{
    "app_id": 334070,
    "name": "Hektor",
    "release_date": "2015-03-13",
    "developer": [
        "Rubycone"
    ],
    "publisher": [
        "Rubycone"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Indie",
        "Action"
    ],
    "achievements": 16,
    "positive_ratings": 598,
    "negative_ratings": 334,
    "price": 6.99,
    "description": "Experience terrors only madness can conjure in HEKTOR, a psychological horror game set in a world that literally moves with your every twist and turn.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334070/header.jpg?t=1511370920",
    "minimum_requirements": "OS: Windows Vista / Windows 7 Processor: 2.4 GHz Dual Core Memory: 2 GB RAM Graphics: 512 MB NVIDIA GeForce 8800 / ATI Radeon HD 3870 DirectX: Version 10 Network: Broadband Internet connection Storage: 4 GB available space Sound Card: DirectX compatible Sound Card Additional Notes: Mouse, Keyboard",
    "recommended_requirements": "OS: Windows 7 / Windows 8 Processor: 2.8 GHz Quad Core Memory: 4 GB RAM Graphics: 1 GB NVIDIA 460 / AMD Radeon 5870 DirectX: Version 12 Network: Broadband Internet connection Storage: 4 GB available space Sound Card: DirectX compatible Sound Card Additional Notes: Mouse, Keyboard",
    "reviews": [
        {
            "review_text": "The hallways of a mysteriously decrepit and deranged research facility beckon your escape, but the weakening of your mental state refuses to make navigating your way to freedom an easy task. The voice of a mysterious girl describes to the player acts of unspeakable injustices from within the confines, and your descent into the sanity depleting design of this strange complex leads you on the hunt for more information. Why are you here, what is the purpose of this wretched place, and who is this girl leaving you notes telling of a sketchy employment situation gone horribly afoul?   Hektor  is a rare breed of psychological horror gaming, one with impeccable pacing and constant flow. Never feeling slow, never sluggish, tedious or breaking the pace, it keeps you one-hundred-percent on your toes and pressing ahead without the will to ever look back.   The story and the mystery surrounding the fates of the facilities inhabitants is told through the discovery of notes left behind by past workers, and cryptic visions from elements of this bleak environment. The voice acting is fantastically done and part of what keeps the player so immersed in the harrowing events unfolding through the snippets of writings uncovered and a real sense of urgency, confusion and terror can be heard with each increasingly dire development of the story.  Moving through the story of  Hektor  takes you through a range of odd environments and surreal imagery. Starting with the harsh reality of the trashed and abandoned research complex and slowly evolving into more vibrantly obscured visions of lush red curtains and fancy tiled floors as if you've stepped right into an episode of  Twin Peaks , but which of these surroundings are merely a figment of your imagination?  The beautifully orchestrated soundtrack is instantly chilling and ominous, worming its way through your ears and into your mind where you can feel every sharp note of the violin effecting your psyche. The echoing of unnerving metal scrapes in the distance, the buzz and crackle of old and failing light fixtures all work together to create a heavy atmosphere that constantly builds tension only to all explode in your face with every twist of the plot and your pysche.  Hallucinatory visual effects that plague our character creates a chaotic and fittingly confusing effect, and your only solace is the scarce Benzodiazepine pills scattered throughout the facility. This in part is what gives  Hektor  such a uniquely bizarre and frantic situation for a horror game, and a unique concept not seen since the likes of the legendary  Eternal Darkness  in terms of how much your mind is being screwed with. The wavy and twisting effect of your ravaged mental state making you feel as though you are losing your vision, causing you to squint and focus your attention on the distortion of the screen even harder until that one disturbing/shocking moment takes you off guard.  Not only does neglecting to take your pills bring about the mind altering hallucinatory effects, but stirs the vengeful and twisted souls of past test subjects of this cruel place. Always ahead of you if you rush and forget to scavenge for pills but never too far behind if you lose your way and slow down, the threat of seeing one of these sanity depleting and terrifying creatures is what drives your carefully paced search for escape and answers.  The random and deliberately confusing nature of the ever-changing hallways around you and the constant transformation of the mysterious facility is an incredibly innovative mechanic for the genre. The straight-forward and almost repetitive nature that plagues most modern horror games gets a much needed spicing up and the cold, gray, lifeless hallways we're so used to from the genre now feel much more alive, more  sinister  and  unpredictable .   Hektor  is one of those elusive and unforgettable horror titles that manages to keep me consistently glued to the screen, only to severely regret my undying attention at the harrowing realization that I'm not alone in these dark and desolate hallways. The creepiness is in full force thanks to a genuinely mind-bending atmosphere, nothing ever feels forced and the scares are all derived from the mysterious unknown factors and macabre questions swimming around your mind. Even more impressive is that this elegant and disturbing journey into a twisted facility was hand crafted and coordinated by a team of five very dedicated people working from various locations across the globe.  Amongst the droves of same-y horror titles and their cheap thrills,  Hektor  stands out as one of the few sublimely twisted experiences with a hallucinatory touch and just the right amount of mind♥♥♥♥ery causing you to question the reality of every last step you took. Where have you really been and what really happened, where are you going and will you ever get there?",
            "review_score": "1"
        },
        {
            "review_text": "★★☆☆☆ - 'Average at best, Id give it a miss'   PROS: - Room and corridor changing is pretty cool and totally messes with your head - There are some top jump scares - Theres a eerie atmosphere, mostly generated by the room changing, scares and creepy noises.  CONS: - Theres no real evidence of a story, its totally forced - I got quite bored of seeing the same rooms over again and the feeling of lostness got too frustrating as its just not rewarding enough - The environment is empty, and whilst theres atmosphere, more detail is badly needed as its too generic and bland - You don't really do anything, the interactions are pretty limited mostly to opening doors. You don't feel any achievement from this game.  VERDICT?  Hektors physiological element is cool but it wears off as the lack of story and pacing started to become more evident. It doesn't feel finished as its just too bland.",
            "review_score": "-1"
        },
        {
            "review_text": "8/10  genre : 1st person horror adventure game  + good presentation, good use of light, creepy atmosphere + sound is great, both soundtrack and in-game music/sound is awesome and adds to the fear factor, voice overs (narrator and when reading documents) are fine + gameplay wise it's a point and click adventure game in 1st person where you have to progress the story through 3 acts by solving some puzzles (all of them are inventory based) , reading documents and from act 2 using stealth (since you are being hunted) - you have a lighter as a source of light and later on a flashlight - you take pills to decrease your sanity meter - resources are limited and can be found searching the environment + controls are fine, so is the optimization, runs maxed out with no problems  +/- the monster that hunts you is too fast, even if you use stealth the light might betray you and if you turn it off you can't see anything - however it's a matter of pace, if you keep up a good pace (not running all the time or doing circles when it hunts you) you can avoid it  - story might be interesting and dark , but not original - the sanity effect (even if you can reduce it in the options menu) is too much and can be irritating since it makes you loose direction - consuming pills doesn't seem to do anything , maybe has an effect only for a few seconds - short, finished in less than 4 hours - some replayability if you want to get all achievements  i was satisfied with the game, although the story is not that good, the atmosphere is great, it's the closest game to amnesia as far as atmosphere is concerned, you will be scared playing it , so i totally recommend it to anyone that has some interest in horror games.",
            "review_score": "1"
        },
        {
            "review_text": "Super creepy game that plays on yourr fears. The whole world shifts around you in unsettling ways leaving you unsure as to what is going to happen next - and yet somehow you always manage to find the correct path.  Part maze exploration game, part psychological horror story - this game gave me chills down my spine. Highly reccomend if you like to be scared and unsettled.",
            "review_score": "1"
        },
        {
            "review_text": "It's not perfect, but the design is very creative. Some parts did get a bit frustrating, when not knowing what to do and being killed over and over again. But overall it was was quite an entertaining playthru, genuinely spooky but not just Amnesia: Redux.",
            "review_score": "1"
        },
        {
            "review_text": "  Short but intense, it's a perfect product for psychological horror fans, but everyone else might find it a little too light on the gameplay side.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my god I hate this game so much.  At first it was intriguing, I liked the atmosphere and the music. Then it started to get boring when I realized there were no consequences for either death, picking the wrong path or not taking pills. Basically I spent the whole game running around randomly and hoping to get killed so the game would just put me on the right track, laughing maniacally at how bad it was. Also, it's funny how I ran through the 'jumpscare illusion' every ♥♥♥♥♥♥♥ time knowing it wasn't going to do any harm. Stopped to care about the plot after the girl cracked, it was like 'hey, you have no idea what's going on but there's this person in distress go save her' and then 'hey, that person is now batshit crazy and beyond salvation, now you just have no idea what's happening'.  Cleared the game running like a moron having no idea what was I doing, go figure.",
            "review_score": "-1"
        },
        {
            "review_text": "  Hektor is a game that messes with your mind, as it is a psychological horror game. It does that extremely well as soon as you understand that what you see is really not everything. The atmosphere of the game is creepy as hell and is very dark most of the time.  The game is fairly easy to pick up. There are not many jumpscares in their traditional form but you shall not worry for you will be surprised and frightened often.  While you wander about in the envivorment you might find yourself confused, unsure where to go or about the usage of a certain item. While this might be seen as poor designing you should keep in mind that most of these things are planned and will get clearer later on. There are flaws in this game but there really isn't anything game breaking. I recommend this game for those who are willing to sacrifice their sanity in exchange for a dark quest.  TL;DR    Pros:      Dark, creepy atmosphere to send chills up your spine.   An impressive soundtrack which lackcs nothing and fits the game perfectly.   A storyline that is both intriguing and mysterious.   Great graphics.   Optimised to run on low end computers.   Amazing map design and mechanics     Cons:      Doors can get annoying.   Graphic effects  might  cause a minor headache.   Few items or mechanics might not be clear at the beginning.  ",
            "review_score": "1"
        },
        {
            "review_text": "   Highly disappointing - didn't meet my expectations.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun to play when you want a quick yet fun and scary experience",
            "review_score": "1"
        },
        {
            "review_text": "  Hektor, the music and intro was great, then, motion sickness, even though I'm over a metre away from my monitor, kust unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy games like Hektor. Horror, scary, achievments, finding notes from different people, all notes have soundtracks which are all voice acted very well. There are supposed to be 40 notes, so far I have found 22 in 7 Hours of Play. There are other collectables; Food, Anxiety Pills, Batteries, etc. There are different types of scares, music, lights, jump scares. There are some puzzles to solve. Sometimes you have to look twice before a clue will appear. Lots of doors to try to open, some of them will actually open. I couldn't stand the wavy visuals, so every time I returned to the game, I turned the strange effects down to minimum, which is 30 %. I would suggest doing the same. Its on the Video control. Sound Control: I turned the music down to 60% and had the voices and other sounds at 100 %. I always had to uncheck the reverse axis box in the game controls. All the controls are quite easy, with a light learning curve. You can crouch, run, walk. I bought Hektor on sale, but is easily worth $ 15. there is a good walkthrough on youtube, in case you get stuck. Enjoy.....",
            "review_score": "1"
        },
        {
            "review_text": "It took me just over an hour to beat and in that time it still managed to feel repetitive. The monster killing you doesn't seem to do anything beyond losing your pills (which are just to keep the monster away), so I pretty much just played as if there was no monster. The story is as unimaginative as possible and even basic gameplay mechanics like opening doors aren't as fluid as in other games (like Amnesia). It isn't scary and the gameplay itself is boring, so there really isn't anything to recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy games like Hektor. Horror, scary, achievments, finding notes from different people, all notes have soundtracks which are all voice acted very well. There are supposed to be 40 notes, so far I have found 22 in 7 Hours of Play. There are other collectables; Food, Anxiety Pills, Batteries, etc. There are different types of scares, music, lights, jump scares. There are some puzzles to solve. Sometimes you have to look twice before a clue will appear. Lots of doors to try to open, some of them will actually open. I couldn't stand the wavy visuals, so every time I returned to the game, I turned the strange effects down to minimum, which is 30 %. I would suggest doing the same. Its on the Video control. Sound Control: I turned the music down to 60% and had the voices and other sounds at 100 %. I always had to uncheck the reverse axis box in the game controls. All the controls are quite easy, with a light learning curve. You can crouch, run, walk. I bought Hektor on sale, but is easily worth $ 15. there is a good walkthrough on youtube, in case you get stuck. Enjoy.....",
            "review_score": "1"
        },
        {
            "review_text": "This game was great. I enjoyed the story, and it was one of the best horror games Iv'e played.",
            "review_score": "1"
        },
        {
            "review_text": "I played through the demo of this game and liked it quite a bit, got the game and found out disappointingly that there was some kind of UI glitch in the actual game where it would display the inventory select controls for a controller over the top of the PC controls - a really annoying feature that wasn't present in the demo, but I continued playing and just thought I would live with it, I got about half an hour into the game and the damn thing crashed. Would not recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game is boring at the start but it gets really scary, great jump scares and has me still shaking after playing 20 minutes of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game because it lists 'full controller support', but that is a lie. There is nothing in the options/controls menu about a gamepad/controller whatsoever...not even the option to flip Y axis. In game, all on-screen prompts are for KB/M controls ONLY, so most gameplay elements are a crapshoot at best. Pausing the game doesn't even give you an options menu, like most games. I'll expect a full refund from Steam for this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game...don't forget to take your meds! :)  You can even kill your light by turning to fast.",
            "review_score": "1"
        },
        {
            "review_text": "  Super creepy",
            "review_score": "1"
        },
        {
            "review_text": "The Game Ambient was good and sounds it was sceary",
            "review_score": "1"
        },
        {
            "review_text": "  Save your money. STAY THE HELL AWAY from this garbage game. Don't even think of wasting your money on this. It says full controller support that is laughable. You can't even see or adjust any of the buttons for controller because why... there isn't support for controllers. I started up the game using controller but once you start playing all the instructions for actions are still for keyboard actions. So you can't even do anything w/o the keyboard. Their idea of full controller support is that the joysticks work to move you around and then you can drop the controller to press a button on the keyboard and then pick the controller back up to try and play the game. Doesn't that sound fun! This is Rubycone's idea of Support. And this is all before even getting into how bad the rest of the game was. It looks like someone spent a day building a game and then quickly put this garbage on steam to try and burn a few clueless buyers. Thankfully I got this POS for free otherwise it would definately be a refund game. If the Mixed reviews didn't already give you subtle hints about how bad this game is i dont know what will.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate this game, I am still ♥♥♥♥n surprised at the levels you people go to make something from what I actually am capable of On my own without your pitiful associative tendency to feel like you can capitilize off intellectual property that is by the way a ♥♥♥♥ing gutter trash piece of ♥♥♥♥ game. You should have known better, and for all intents and purposes should give me all your profits for you basically stole this ♥♥♥♥, and you should take the recourse from it where it was situated on some super ♥♥♥♥in idiot bait lines that you would take from. Congratulations you flock of ♥♥♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Take your pills to stop the monsters.  I better take my pills.  I TOOK MY PILLS!! GO AWAY!!  *takes pills repeatedly*  dead.",
            "review_score": "1"
        },
        {
            "review_text": "Alright... It's time...  When I ran this game for first time bad models made me cry. But then I faced with 'horror' part of this game. OH MY GOODNESS! The doors were cracking and some sound were like my neighbour got diarrhea. After that I totally ♥♥♥♥ed up with all these mazes. But it's cheap enough and you can get trading cards. It was my opinion so maybe for someone it'll be creepy and interesting but not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Game looks interesting but has little to no controller support. Cannot map keys, does not display which 360 controller button does what. Cannot even navigate menus. Support for controllers advertised and was promised a year ago, still barely present. Wish I could refund this title but too old. Not worth the hassle of waiting and hoping for improvement when there are others out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Glitches, bugs, bad story and an overall confusing level design. I do not recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an interesting new IP with a great story.  While it is short (wait for a sale) I highly recommend it.  Great atmosphere Great level design Great sounds Great story  While a lot of the map is 'recycled', it's all part of the story.   'The closest thing on steam to Outlast, but have the time to complete' 8/10 -Me",
            "review_score": "1"
        },
        {
            "review_text": "Very boring door opening simulator",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game after you fix the generator",
            "review_score": "1"
        },
        {
            "review_text": "so far the screen blurring is my only issue with this game, in cell block A2 it gets so out of control that I had to literally stop playing.",
            "review_score": "-1"
        },
        {
            "review_text": "I'll not play this crap unless you fix xbox360 gamepad inversion.  upd: this bug has been fixed, thanks to developers for feedback!",
            "review_score": "1"
        },
        {
            "review_text": "It's in the 'meh' line",
            "review_score": "1"
        },
        {
            "review_text": "Anyone want to ♥♥♥♥ his/her bed in sleep? Here is a horro game of that proportion",
            "review_score": "1"
        },
        {
            "review_text": "  Overall great adventure game but not reccomended for people who suffer from motion sickness.",
            "review_score": "1"
        }
    ]
}