{
    "app_id": 334190,
    "name": "Insanity's Blade",
    "release_date": "2014-12-04",
    "developer": [
        "Causal Bit Games Inc."
    ],
    "publisher": [
        "Causal Bit Games Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Casual",
        "Indie"
    ],
    "achievements": 34,
    "positive_ratings": 187,
    "negative_ratings": 60,
    "price": 4.79,
    "description": "Take a father’s journey to hell in order to save the souls of his wife and child. Insanity's Blade: The Chronicles of Thurstan is the first in a series of games based around the journey of a sword possessed by a father's powerful grief and hatred. This is the tale of the sword's creation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334190/header.jpg?t=1550886657",
    "minimum_requirements": "OS: Windows 7 64-bit Processor: Intel Core 2 Duo 2.8ghz or higher Memory: 4 GB RAM Graphics: 512mb DirectX-compliant, INTEL GPUs not supported DirectX: Version 10 Storage: 4 GB available space Sound Card: DirectX 9.0c - compliant sound card Additional Notes: Mobile chipsets may work but not supported.",
    "recommended_requirements": "OS: Windows 7 64-bit Processor: Intel i5 Sandy Bridge Memory: 4 GB RAM Graphics: 1GB DirectX-compliant, INTEL GPUs not supported DirectX: Version 10 Storage: 4 GB available space Sound Card: DirectX 9.0c - compliant sound card Additional Notes: XInput Controller. This software is not compatible with video streaming or screen capture software, decreased performance will be experienced. Mobile chipsets may work but not supported.",
    "reviews": [
        {
            "review_text": "So having given the game a play and a thorough run through!  I must say it has a lot of fun and positive benefits, but a few flaws as well, course no game can ever be a flawless diamond.  +Plus+ The story Is definitely one to be told, like the good old days of Conan, Willow, and more. Its simple, it gives our hero a reason to go beyond humanity to save the world.  +Gameplay- Gameplay is simple, like any arcade sidescroller akin to those of Castlevania, or Rastan. You move, swing your weapon, or grab opposing enemies and chuck em, break em, or use their body parts as a weapon.  BUT I feel the use of weapons looses its creative edge once you earn the final blade. You don't get a chance to swap weapons, and I feel that the idea of the power of the blade should have been more akin to the character themselves imbuing any weapon they hold with the power, as I did have fun using the flail!  Yet as it is, the gameplay isn't harmed by this.  It certainly does have difficulty, mostly in parts of the mission where you must scale walls. They do make it difficult to control ones jump and attack. As well it would be nicer to be able to attack on the move, rather than suddenly stop.   Is this game worth the 6.99?   Yes, even more so as I would feel in the arcades, you'd be spending plenty more, even then because of the co-op capabilties, though I do hope next story, they offer more to Flinn, as he has plenty of potentail in the story!  Check it out, no harm with the price, and enjoy a great game with wonderful music!",
            "review_score": "1"
        },
        {
            "review_text": "Snes/Nes/Genesis era half-castlevania, half-beat-em-up type action platform jumping game. If you're looking for your retro fix, this game has it. 8-bit or 16-bit toggle-able soundtrack to suit your taste! You may play in arcade mode or story mode which gives a little more open-ended bit on exploration but either is suitable for the action-game lover of yesteryear. Just a simple game like they made 25 years ago - if that is what you want, this is your fix. While it's no Castlevania, it certainly does have it's charms - honestly I can't really find complaint in the fact that it cost just a few American dollars to buy. A few times were quite NES-era [cussword] difficult so it's definitely up to par on challenge. A must on any retro-gamer's list of games to check out.",
            "review_score": "1"
        },
        {
            "review_text": "a game that recalls the style 'altered beast', hits everything that moves, powerup, violent and fun. unfortunately I did not play the coop. for those who enjoy old school, will enjoy this game. I made 100% at 4 hours   um jogo que lembra o estilo 'altered beast', bate em tudo que se move, powerup, violento e divertido. infelizmente não joguei o coop. para quem curte velha escola, vai curtir esse jogo. fiz 100% em 4 horas",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Plays like the old NES games that I would spend hours and hours playing in order to beat back in the day. I like that it has RPG elements like a leveling up system to get stronger, different weapons that can be found and equiped, and stores to purchase permanent upgrades. There are also side quests that can be taken on to flesh out levels.   Although the game sports an old school graphical look, the graphics are detailed enough that it boarders on PSone era 2d games. It looks good and I have no complaints.   Some other cool things about the game are the bosses which are huge and require some intense footwork to master and the varied enemies that show up in different stages. The stages themselves are huge and really varied. This keeps the progression fresh and interesting.   Some negatives I found: the combat is fairly basic and doesn't get much past dodging and spamming the attack button. Also, the instant kill pitfalls and spikes can be seriously annoying, especially on longer levels.   Overall, I really like this game and recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great, dark and atmospheric game. It's overwhelmingly fun in singleplayer, I believe it's even more fun when playing with a friend.  You control Thurstan, some kind of demoted royal knight now living in some village. One day undead attack and kill everyone except Thurstan, who gets a curse on him and a unending thirst for vengance.  When it comes to gameplay mechanics this is a arcade 2d beatem up game with some levels or parts where you can ride an undead dragon and shoot different things from his mouth (you can even pick up orbs powerups that change the weapon of the dragon) or ride some undead cadaver down the slope.   There are 9 weapons in the game: - basic fists - 6 melee weapons like sword or mace that you have in your inventory after finding them during exploring levels - Insanity's Blade that locks all of your previous weapons and is ridiculously powerful - you get it near the ending of the game - thrown daggers with 4 upgrade levels - single dagger, three daggers, five daggers, three burning daggers (the fun begin from this point), five burning daggers  You also gain cash from destroyed enemies and you can spend it in shop for dagger upgrades, more maximum health, 1 up and some kind of upgrade for Finn.  The plot of the game is fun. Thurstan and Finn wander around swamps, castles, caves, mad sage tower, sunken temple, icy mountains and hell hole itself.  Enemies is this game are mostly undead monsters, demons and some deformed creatures. Bosses are mostly fun, with the exception of two boring ones (imo the first boss and the undead construct with flying eye orbs).  Player characters in this game can level up - it expands and replenishes their health bar and also increases their damage potential a bit.   Graphics are really detailed. Controls are very good when it comes to playing on a gamepad. Level of details that you can see in levels is really outstanding.   Characters can perform throws on enemies. Depending on enemy you can take a different throw - when I pressed up + throw in front of strong zombie Thurstan ripped it apart. After pressing left/right + throw the character just throws enemy left or right. After pressing down + throw the character ripped one of zombie's hands apart, after that you can use that zombie's arm to hit other enemies. Wow!  Interesting thing - in order to pick up torches and swords that lay here and there you need to press down + throw/grab. I think it's not covered in the instruction video.  Let's sum it up:  Pros: - mood! - graphics - grotesque enemies - level design - hard but rewarding (for me, I am not a hardcore platform gamer) - levelling system in an arcade beatem up - level of details - makes me want to play and finish it  Cons: - some levels are too long, you just go right and press attack - cheap deaths sometimes - it takes quite a bit to buy better daggers in the shop - levels are mostly linear, there's not really a point to replay the game after finishing it. It's better to wait some months, forget a thing or two and then come back to play more  Overall - I heartily recommend this game. It fast, it's fun it sometimes just insame when it comes to enemy design. Controlls are good and graphics are nice.   A real indie gem. ",
            "review_score": "1"
        },
        {
            "review_text": "It's Castlevania meets Altered Beast meets Metalocalypse, what more do you want?  My full review is  here  [www.rpg.net] ",
            "review_score": "1"
        },
        {
            "review_text": "Appealing graphics and sound reminiscent of sega genesis or turbo grafx16. Simple and generally enjoyable gameplay, however there are a number of glitches and bugs that can be highly frustrating. Additionally, not having the option to remap the controls in the game is annoying. It has a solid retro feel and is generally enjoyable, though the bugs and glitches will take a player out of the game. Some of the design feels intentionally frustrating, like a way for the dev to pad gameplay or create an illusion of difficult gameplay or platforming. Glitches I experienced include clipping issues, jump to a platform and fall through nothing to death, and sound cutting out.",
            "review_score": "1"
        },
        {
            "review_text": "Very much feels like a 90s arcade game... i.e. clunky, repetitive and awkwardly scaled (difficulty-wise). Still, this game has a nostalgic charm, making it worth a few bucks.  ",
            "review_score": "1"
        },
        {
            "review_text": "Rode a zombie down the forrest mountain , Did it again and again and ripped some zombies apart ,Found the spike bomby knocker ball thing and have been using it ever since 10/10 recomended highly.",
            "review_score": "1"
        },
        {
            "review_text": "Insanity's Blade is brilliant. It knows exactly what it is, and does what it should do wonderfully. It's the love child of the level and boss design of the first Castlevania and the action packed slashing and punching of Golden Ax and Streets of Rage, with the scenario ripped from the pulp rags where folk first read the name CONAN. Grab your dunkaroos and buckle in to punch some knives at hordes of dusty desiccated undead and wrestle some mace-wielding ogres.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "'he had a terrible weapon called ♥♥♥♥ PUNCHER'  writing on a 12 year old level here are we (also the game's not very good)",
            "review_score": "-1"
        },
        {
            "review_text": "I would enjoy this game a lot more if I could use one of the controllers I have (none of them are X Box) for player one. I can use the ones I have with player two but it's kind of a pain in the ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "controls are all messed up and it's freaking unplayable in local coop with my girlfriend ffs",
            "review_score": "-1"
        }
    ]
}