{
    "app_id": 334120,
    "name": "Armikrog",
    "release_date": "2015-09-30",
    "developer": [
        "Pencil Test Studios"
    ],
    "publisher": [
        "Versus Evil"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 580,
    "negative_ratings": 533,
    "price": 6.99,
    "description": "Armikrog is a unique stop motion clay animated point and click adventure game from the creators of Earthworm Jim and the Neverhood. Unravel the mysteries of the fortress that holds Tommynaut and his blind alien talking dog Beak-Beak captive through exploration and puzzle solving!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334120/header.jpg?t=1497039661",
    "minimum_requirements": "OS: Windows XP+ Memory: 2 GB RAM Graphics: Pentium 4 or equivalent DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I just had a lengthy debate with myself over whether or not I could recommend this game. Ultimately, I can not.  I grew up in the heart of the adventure game era. I am very forgiving of the pitfalls of most adventure games as long as I feel like I had fun at the end of the day. As a fan of Neverhood, Earthworm Jim, and adventure gaming in general, I was quite excited when this popped up on Kickstarter. I dropped WAY more cash than normal to get art books, signed prints from Doug, and other swag.   I've learned to temper my expectations from kickstarter, I've also learned to not expect these games for several years and even then, not to play them when they are first released. I picked up Armikrog the day after a patch which added context sensitive cursors, and several other minor fixes.  Right off the bat I was thrown into a static menu screen. I immediately missed the lively, animated title screen from Neverhood that set the tone for he rest of the game. Unfortunately, this static screen was setting the tone for this game as well.  A majority of the game is played across sparse rooms. Some are simply a few walls made of clay with a couple fingernail lines drawn into them. Others have gorgeous set pieces using found objects. But even the gorgeous scenes typically revolved around a single item. In the intro we get a glimpse of this planet, it's wildlife, the slapstick style 'klayman' humor we loved in Neverhood, and a glimpse at the relationship between Tommynaut and Beak Beak. And then the game starts and we might as well throw all that out the window. It becomes painfully obvious that after the intro, the minds who developed Neverhood stepped out and the clay jockeys stepped in.   The game itself takes place fully inside a fortress. So the organic puzzles that inhabited Neverhood are nowhere to be found. The fortress itself is composes of 3 towers (4 technically, but the final one is *very* limited).  Each tower has the exact same setup. Get the main door open, get the power on, get some more doors open, move to the next tower. Even the puzzle types repeat themselves, almost always relying on 'find a symbol somewhere else and type it in here'.  One puzzle in particular has a baby crying until you solve it. The puzzle itself happens to be an audio puzzle. It requires careful listening and patience. After several minutes of having a baby cry over your the sounds of the puzzle and then having to sit there while the tune plays to verify you got the puzzle right.... well, let's just say that it can drive a person nuts. And like most puzzles in the game, you will get to redo this multiple times.  On top of the above complaints, and in spite of the repetition, the game is quite short. If it takes you more than a few hours, then it is simply because you are trying to figure out what to do next based on X number of symbols you have and Y number of cryptic devices you can type them into. I never felt particularly smart after solving a puzzle in the game. I actually accidentally solved 2 puzzles just by messing around with the mechanics of them to see how they worked. Only later did I accidentally stumble across the clues that I was supposed to find. Speaking of the 'clues', some of them are so obvious they might as well just solve the puzzle for you. Need to find 3 colors? Walk one screen over and push a button. Look, 3 colors! Walk back, type in 3 colors. That's not a specific puzzle in the game, rather it is indicative of the game's puzzles in general.  What about the soundtrack? Terry S Taylor was brought on to do this, and that alone should have added a huge bright spot. Yet many of the tracks were short and, hey it's the word of the day, repetitive. I swear some rooms appeared to be on a 15 second audio loop. Where were the full length background songs from Skullmonkeys and Neverhood? Other times there was absolutely no background music at all. Just silence. I'm not sure if this was a bug or not (sometimes the sound effects simply dropped out as well). But then a few minutes later a seemingly random background tune would suddenly fade in. And by random, I mean random. Right after a scene that should have been quite sad, a funky little upbeat jazz tune kicked on. What? Where did this come from? It doesn't match a single section of the game, let alone this particular moment.  So after all was said and done, I felt a little empty. I felt a little let down. I felt that if this game wasn't built out of clay, then it really wouldn't have anything going for it at all. And the medium should be a tool that simply enhances the game.... not provide it's defining characteristic across the board. And yet, when I read the games reviews they almost always praise the graphics... and then stop there. I lost count of how many suggested playing the game simply to 'see it'. At that point, would it not have been better as a non-interactive show or movie? Oh... wait, no, because that would have required a plot.  A plot. Yes, the games plot is pretty paper thin. One room has a novel's worth of text that gives background, however it is key to note here that high level backers were promised the ability to name items and characters in the game. Considering the only items that Tommynaut ever picks up are battery packs and levers, this means that every single named item, character place, and whatever else that came from kickstarter got dumped into this gigantic 'history'. The history can be skipped 100% as it has nothing to do with the games plot or puzzles. It literally exists simply so they could sell $200 tiers on kickstarter to folks and promise them they could name some item that is mentioned once in a throw away text that hardly anyone will ever read.   A lot of these reviews sum up whether or not to buy the game at full price, or sale price, or whatever. Ultimately, I don't care how much a game is if it's not fun. If you just want to see the graphics, go watch a youtube video of it. The reason to PLAY a game is to PLAY a game. And playing this game simply isn't fun. And it really pains me to say that. I wanted it to be fun. The world needs more creative, smart, funny games like The Neverhood.  At the end of the day, Armikrog is just another disappointing promise from kickstarter. A reminder that publishers actually play a very important role in the business, whether we like it or not.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not nearly polished enough.. There are lots of little bugs and things that may irritate. A game that has been delayed this long and this many times should be forking perfect. found several bugs within 20 minutes of playing.  if you were a die hard neverhood fan, you might be able to somewhat enjoy this, if not steer clear",
            "review_score": "-1"
        },
        {
            "review_text": "✓ GNU/Linux support. ✓ Claymation and hand crafted environments with 'real' lighting  ✘ Uninspired story, poor writing ✘ Boring puzzles, nonsensical quest items  ✘ Poor voice acting, as well as almost non existent ✘ Terry Taylor doesn't sound all that interesting here ✘ Cheap room / creatures / character design ✘ Some annoying, even frustrating design choices sometimes ✘ Glitches everywhere and poor interface design  Boring, soporific even. Neverhood had something going for it. This one doesn't.",
            "review_score": "-1"
        },
        {
            "review_text": "The neverhood is by far much better, with less bugs and a better story. We wanted hoborg's world, not this repeated and boring puzzles . . . I am so sad and I have a big disappointment.  PLEASE COME BACK HOBORG",
            "review_score": "-1"
        },
        {
            "review_text": "I played this for about an hour and got quite far. However, this game is half-finished. Here is a list of problems that have no sign of being addressed by the developers:     UI elements appear to be either missing or ill-conceived: uses default mouse cursor that doesn't highlight or notify what things can be interacted with/picked up, save/load is hidden away in 'options', no inventory, you just automatically use the right object at the time.     It's possible for the game to be incompletable due a bug that allows you to go past a locked room with no way of returning.    Some of the puzzles aren't really puzzles - they are just arbitary roadblocks that you couldn't possibly guess because the game is incositent with what you can'can't interact with.    There's a puzzle that will make any new parent tear their hair out as you have to complete it while listening to a distraught baby.    Various buttons can't, then can be interacted with depending on if you've completed prior steps (instead of letting you use a button anyway and being told 'it does nothing', which would make more sense and was done by every other PnC Adventure ever).  It's such a shame as the animation/art is really cool. I didn't finish it, but I'm also reading reports that it's very short as well.  ",
            "review_score": "-1"
        },
        {
            "review_text": "the art and clay give this game a good feeling. but it falls short on the neverhood in every area. I can see the effort behind it and I can see what it wanted to be. But guys, you should have thought about what made the neverhood so great before even atempting to make a successor: for example, the neverhood is great because you develop a sense of how the whole 3D world is mapped out and learn to navigate and come to love it. but in armikrogm it doesnt feel like a world, it feels like a constant mash up of rooms made from fitted together layers of seperatley recorded clay, and this makes the whole thing feel flat and insted of navigating, exploring and walking around you just pace back and forth in room upon room. also the storey is hardly explained in enough detail and beak beak feels like he is just their for gameplay purpose because the relationship of the two main characters of the game is not developed at all, making it all feel forced. The biggest concern for me is also something that no-one else had mentioned, the Neverhood felt solid because everything was one and all the rooms where the same size and klaymans slow pace actually gave a nicer feel to the game, however, in Armikrog some rooms were hugely zoomed out, ruining the mystery and feel of the game also the game felt really flimsy and that every action and movement had no real weight behind it, and all those layers also ruined the soul of the game and it feels rushed. the other con for me was the music, partley because it barley playes and also is sort of boring and ambiant, it is good but not what i was expecting from Taylor. where is the catchy giberish and acoustic gituar!? i heard the boo-ha-ha song and it put my expectations high because i loved it and then the music disaponted it is like something out of Rayman, not the neverhood. also the bugs could be fixed but it still would not fix the feel of the game. Nice effort tho and i can see what it was meant to be, but next time when you want to bring the soul of the neverhood in to 2015, write down all the things why the neverhood has its unique soal and what makes it so great. I am not angry just a disapointed. if you feel the same please comment, I would love to hear from you. Don't be scared to comment either mike. thanks for reading.",
            "review_score": "-1"
        },
        {
            "review_text": "After finishing the game and I have to say I took a long trip and had to restart it twice (because of the bugs) I have to say that I do not recommend it.  Pros: + unique graphics style but that is what I expected and the reason why I bought the game (sure I loved Neverhood)  Cons: - TONS OF BUGS - for an officially released game this looked more like an early access with gamebreaking bugs - the amount of locations was disappointing, very few of them - 4 'hubs' and just rides between them - lack of challenging puzzles - short and by short I mean really short, it takes you one evening to beat it if you want to",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a kickstarter backer who paid well over 120$ for this because I loved the Neverhood. This game is far off the spirit of the original. The music isn't as riveting. The story is bland. And the bugs and mechnics are so dated it put me off from playing.  Really disappointed and I can't say I recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's really tough to downrate such a beautiful game that so much effort has clearly gone into but unfortunately (in my opinion) this game is unpolished and needs work. It's probably worth me adding that I have never played the Neverhood, so that hasn't factored into my review.  Pros + Fantastic aesthetics - the claymation is truly brilliant + Great music (although I hear that for some it doesn't always play) + Interesting puzzles  Cons  - Dreadful UI. I know this is a matter of preference, so you may well feel differently, but for me this just wasn't what I would expect from a modern point and click adventure. The cursor is the standard windows one - this may not sound like a big deal but I don't ever remember seeing this on a game I've paid for... I was so surprised in fact that I thought the game hadn't loaded correctly. Pixel hunting is rife in this game. While I can understand that some may not want the feeling of being handheld by having clear hotspots or a dynamic cursor, the game just doesn't give you feedback leading to a bit of frustration, clicking on everything repeatedly. Why? The hotspot sensitivity/radius is really odd (sometimes you have to click in a slightly odd place to get something to work); sometimes the clicks don't seem to register even though you're clicking on something that's definitely interactive; and sometimes when you're clicking on, for example, a button 'too early' (ie a puzzle somewhere needs to be solved first) you'd expect the character to press it (and it then does nothing). Actually the character does nothing at all, there's no feedback/sounds or anything, so you're left thinking perhaps it isn't something you can interact with (even though it is). I can't help but think that this is not where the puzzles are supposed to be. Clicking on a button for 10 minutes to get something to happen just isn't fun. I don't expect puzzle hints, I do expect some even vague clues on how to play the game. There's no inventory, for example - in fact it's purely pointing and clicking, there are no keyboard controls.  - Very little story or character development. Yes, there is a (text only) novella part way through the game but usually in a point and click I'd get a decent story propelling me throughout that compels me to keep playing. I didn't get that from this game at all. There's very little dialogue and not as much humour as I had expected.  - Lots of bugs, some of which are minor, others are more major - you can get yourself stuck in no-win situations, for example, and in some instances the save game function is not working properly (for instance when overwriting a previous save). I understand it only launched yesterday (at time of writing) so I'm really hoping these things will be fixed soon.  - Quality on the cinematics/sound seems poor, as though it had been over-compressed.  - Bit short for the price at (approximately) 3-5 hours playtime. Little replay value (as it is linear)  Ultimately although the devs doing the claymation did a stellar job, I really feel this game has been let down by gameplay mechanics, story and bugs. I would love to give this a recommendation but I just can't in its present state. Hopefully over time the game will evolve into a more polished version, and at that time I'll play it through again and amend my review.",
            "review_score": "-1"
        },
        {
            "review_text": "Finished in a little over 5 hours. I did not encounter bugs. the game brought back great nostalgia from my neverhood days. Puzzles are not too complex to where you must search for a walk through or guide. I enjoyed every minute of it with only frustrations coming from a couple puzzles. You can tell a lot of love went into this game.",
            "review_score": "1"
        },
        {
            "review_text": "has the look and feel of the neverhood, but falls just short of the puzzles that its known for. some are pretty challenging in armikrog and may cause you to backtrack to relook at missed info. doesnt have the impact that neverhood gave with some comedy (belching tree, falling down bridge/stairs, fall to your death, running into a wall (god that scene is still funny)).  7/10, nice attempt for modern claymation point n click, but wait for a sale if you're on the fence about it.",
            "review_score": "1"
        },
        {
            "review_text": "Not as bad as I had heard, and I hope they will one day be able to make another game like this but better due to my love of the first game, but with only 3-4 hours of play time needed to beat it (I was taking my sweet time with this game too btw) its hard to justify its normal asking price. Would only reccomend buying it if you really like the style and it's on sale, and in hopes to help fund another game that can potentially be better. I don't want to compare it to the neverhood because it's a different game on its own but with it being tied so closely with its art style, game play, and similar puzzles I feel as though I can't help but do so.   There seems to be an overall lack of immersion like there was in the neverhood, which may be due to the neverhood having the strength of the silent protagonist, and there is also the lack of sense of wonder of exploration, where in Armikrog you feel like there is only a predetermined route with few branching paths to choose the order in which you can tackle the various challenges as you go mostly from one room to the next. Where the Neverhood allowed you to actually explore the world of The Neverhood for large portions in the game in a first person perspective actually allowing you to take in and explore your surroundings at your leisure.   As for the story, while given an interesting intro and backstory to your character, the rest of the story feels kind of shoe horned in, especially with the introduction of the villain seeming evil for evil's sake with little forshadowing in cutscenes where these octopus things speak to you in a language you can't understand until the very end of the game, even then the story they tell you isn't really vital and forces you to go out of your way to loop through all of Arkikrog to finally understand what they are telling you, if at the end you even care. Whereas in The Neverhood (again, I wish i din't feel the need to compare the two) the story grew organically as you literally know nothing of the world you are in, but you slowly see the influences and actions of the villain throughout the game and grow a sense of an omnipotent danger ever lurking long before you even see a glimpse of the villain.  As for the puzzles, they tend to repeat themselves with very little growth in challenge or complexity, or the few that do arn't (at least in my opinion) very fun. The ones you need to complete to access a new area in the game with the turn wheel is what comes to mind. That being said there where a few I did find fun and inginuitive, but they were few and far between. I guess my biggest gripe with the puzzles is that they didn't really seem to grow on top of eachother that well and felt more like things I had to do over and over again as opposed to what The Neverhood had done which I felt had puzzles that grew on eachother and were more intricately connected. Kind of like if you were to compare map designs of Dark Souls 1 with the map design of Dark Souls 2 for those who haven't played The Neverhood or Armikrog.  The animating at some points were a bit choppy as some points, several moments in the last cutscene of the game especially seemed cheaply done while at the same time had several moments that were done really well which only upsets me more because it shows they could have done a better quality job with it. I won't say what moments in this review because I don't want to spoil anything for those who may want to still buy this game and who may enjoy it. Also there are times when your main protagonist and his companion talk to eachother on screen or jump give slight compliments to eachother where neither of there mouths move, which I know can be hard to animate with clay animation all the lip movements while your characters could be doing any number of things individually for each line but still come accross as awkward and a blatent flaw that personally would take me out of the game whenever it happened. The last animation error I'd like to address is when sometimes you are pushing this orange and yellow square shapped creature to use as a platform, your characters arm and partial body he has wrapped around the creature can be seen through the creature as you are pushing it, which again since you have to do this several times for several of the same similar puzzles you would think would have been fixed during the playtesting phase.  With everything having been said, it's a cute game and I'm happy several of the origional team members of The Neverhood (the first game I was ever bought as a child that got me into gaming that I have reccomended to people my entire life and still pop the disk into my computer to this day) got together to work on a new project even if they dropped the ball. I have to also admit that due to my everlasting nestalgia boner for their first title, I may be too biased in the comparison of the two games, but I still hope that this team will one day make another game like The Neverhood and Armikrog and learn from their mistakes to bring us future content, even if it never lives up to the high pedistal I've placed The Neverhood on.",
            "review_score": "-1"
        },
        {
            "review_text": "Armikrog is a fun point &amp; click puzzle game. For me it really stopped me on some puzzle and made me think alot. The artwork is really beautiful and of course the claymation is really good. It was a fun playthrough for me, but it didnt took me a long time to beat it. I really like the soundtrack in this game. Just like in Neverhood and Skullmonekys. Spot on!  There were a few bugs here and there. First thing what I saw was that the audio was off in the cutscenes. Not too much, but still. In the last cutscene it was WAAY off. Subtitles were a bit messy. Sometimes a bit off or it just came too late. Music sometimes didnt play at all and it worried me, because the game has a GREAT soundtrack. Be careful on some puzzles. I did 2 puzzles accidently twice and it messed the game a bit, but I was able to fix it by doing the puzzle one more time. Some clicks were a bit akward. For example Beak, you're sidekick 'dog' were sometimes hard to push a button. I pressed it alot of times and in diffirent places, but nothing. When I got out of the room and went back in, that fixed the problem. Hopefully the bugs and problems will be fixed.  I would wanna recommend the game. I had fun playing it through. The prize is kinda high right now. I'd say buy it when the prize goes down a bit.  Pros: + Artwork + Puzzles + Music  Cons: - A bit short - Few bugs - Prize right now, for how short the game is - Subtitles were sometimes a bit too off - Sounds were off. Either in cutscenes or some of the music didnt play for some reason",
            "review_score": "1"
        },
        {
            "review_text": "If you have played Neverhood go for it. But even then you might want to wait for the price to drop down a little. Its not bad game (if you excuse the release version bugs), but it is rather short (5 hours for me, but I got stuck on just one puzzle for like 15 mins) and generaly it feels like they skipped some portion of stuff they planned for it.",
            "review_score": "1"
        },
        {
            "review_text": "I was extremely excited when I heard that this game was being funded, having almost beat the Neverhood before (I was stopped when my computer updated and wouldn't run the game properly anymore). To be honest, I wish that they could just remaster and re-release the Neverhood so that it wouldn't be so darn rare to find compatible copies! Still, I've played the game around 3 times and I can say this game isn't bad.   The voice acting is relatively ok, Rob Paulsen carrying a lot of it as Beak-Beak, but the setting and music both really give the game a lot of charm. The story is half of what It could've been. With more time, it could've been deeper and more complex. The characters, as a result, also fall pretty flat. There is little time devoted to them to allow the player to care much about them.  The game has little replay value except to see how fast you can run through it (about 1.5 hours for me the last run), so I would say this game is worth buying if it's on sale. Not very worth its full price. Find the Neverhood somehow. Even though the animation is much better in Armikrog, being newer, the Neverhood has a bigger game, harder puzzles, and more depth to its story. ",
            "review_score": "1"
        },
        {
            "review_text": "Despite all the flaws it has during launch, the game still has a very unique charm that very few games have ever had.",
            "review_score": "1"
        },
        {
            "review_text": "Supported the project via crowdfunding. Today is 5 of october and I already finished the game... (Installed yesterday). The game is quite cool, with smell of old Neverhood, however: it is REALLY TOO SHORT, TOO EASY. I've spent just 5 hours to finish the game. Don't really like that characters now talk. You only get used to the game and... It finishes. Too sad. Recommend you to play but know that it cannot replace the Neverhood and way way way shorter. The last thing i REALLY DON'T LIKE, is that you are having similar tasks / quests multiple times. Most of the game you make your baby stop crying, or travel via cart to some places, or solve the round-puzzle (which is quite easy). If you make screenshot on each location via steam or your system (I played in Ubuntu), you can then open screenshots on second desktop or via steam and take a look at them to see the solutions. WAAAAY TO EASY. The music is okay but the game is still short for a good soundtrack. Also, there seems to be not 100% made from plasticine. Sad, sad, sad. It's 30% of Neverhood. However, I would recommend this game as long as noone make quests like this now...",
            "review_score": "1"
        },
        {
            "review_text": "It's not a good game. Sorry. I backed on kickstarter and was looking forward for this game. I guess another year of development and a decent amount of money will make this a real complete game. It feels like they looked for ways to make this game longer.. and this alone is sad",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the money.  I am a great fan of Neverhood and as most of people who backed the game on Kickstarter, we expected at least to see the spiritual successor. No such luck. No luck at all.  The game is too short, if you're good at adventures and concetrate a bit, you can finish it quickly. Okay, perhaps creators offered something other in exchange for short playtime.  Good story? Nope, it's short and not interesting.  Okay, is the music good? It's decent, but like everything else in this game, it feels slacked off. Which is suprising, seeing how the same guy composed the soundtrack for this game as for the Neverhood. How about cutscenes? Are there any funny movies? Nope, they' are short and often don't contribute much. And there is too small number of them.  Okay, final try : the puzzles, are they any good?  No. They repeat themselves too often, and this game is actually the sum of three of four types of puzzles. Most of the puzzles are actually asking from you to write a thing down here, and enter it there. They aren't demanding. What's even worse, one of the last puzzles in the game is actually totally random, asking from you to click on something you wouldn't even do, because you tried it before with Tommynaut and with his dog and it gave no result. So, near the end of the game, thing that doesn't work suddenly works. That's some design.  I can't say that this game is bad. It's not bad, but it's lacking. It feels rushed and like every corner was cut so it would get done. It's not worth it's price. Perhaps if it was 5-10 bucks it wouldn't be too much.  I wasn't really sure whether to recommend this game or not. But damn, it's disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "did you like the neverhood? did you remember that game, the neverhood? wasn't it wacky? does the neverhood bring back feelings of nostalgia? me too, and i don't care about how a game developer feels about homosexuality.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the few games I backed on Kickstarter so I was really looking forward to this.  Unfortunately, the game ended up being very short, very buggy and the puzzles in this game become very repetitive the further you get. The music and the claymation style is wonderful, but the faults stick out like a sore thumb.  Unfortunately, I was never able to finish this game because I saved at a certain late part of the game and when I reload that save I'm stuck and can't get out. I refuse to play through the game all the way from the beginning just to see the ending.  Do not buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very dissappointed. I was giving this game all my hope and I was ready to wait for it for how long devs would feel it is neccessary to create great game. However it turned out to be just something that feeds on fame of Neverhood. Trailer and vlogs of devs made me feel like its gonna be something outstanding and it kind of is, but its not finished yet. I would welcome many more goofy lines, many more tweaks like own game cursor, which would eliminate pixel hunting. I would also not be affraid to put in some puzzles that need much more time spent to be solved (not my 2 hours of gameplay...) And I would most definitely try to create atmosphere that would just suck me inside of this game (maybe it was due to bugs that this didnt haeppen), but for sure the story was too short without anything unpredicatable... I am sad right now, this just looks like some total backstabbing. Not gonna spend any more money on these devs if I am not sure if they are worthy, they just lost my trust...gdmnt",
            "review_score": "-1"
        },
        {
            "review_text": "this is a critical thinking poin&amp;click game made entirely from clay and it's not a walk in the park   I will have my full review later when I beat the game but this is all there is at the moment. the best advice I can give for this is have a pen and paper when playing becaue I guarantee everything you see has a purpose.  okay I'm about an hour in with gameplay and there are no bugs, though I noticed a lack of notification if my mouse is over something I can interact with.",
            "review_score": "1"
        },
        {
            "review_text": "I tried to like Armikrog, but it's no Neverhood. It's not even consistently clay. It's ugly, impenetrable, glitchy, and it demeans your intelligence and foregoes any sense of exhibitionary storytelling by beating you over the head with the blunt end of the game's premise with a theme song that's so ingratiating and unnecessarily saccharine that you can actually feel yourself getting dumber.  With all the technology available to modern game developers, TenNapel and company managed to make a game less stable and enjoyable than a creation myth spoof frustration-is-a-puzzle-mechanic game from the mid nineties.",
            "review_score": "-1"
        },
        {
            "review_text": "As much as I appreciate that they made a sequel I must say that it was to short. However it gave me this small comeback to my childhood when I played Neverhood! Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended, especially if you grew up with Neverhood as I did. It doesn't quite live up to the name of Neverhood, but Neverhood wasn't funded by Kickstarter like Armikrog was. Neverhood is my favorite game of all time and was beyond belief when I saw that a new game was being made by it's creators. I am more than satisfied with this and hope that it is the first of many games they make.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I was a backer of the game because I liked Neverhood a lot - the game Armikrog is based on. Armikrog hardly shares anything with Neverhood, apart from the technique the games were made (stop motion animation, the world made of clay). The game short of humour, puzzles (many puzzles repeat several times), story - everything what made Neverhood remarkable. Many objects in the game repeat often - it seems that the game team had difficulties to make diverse world and as a result the game is very short. ",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game I likey Neverhood more This game is a good sequel. Try it-gonna get good memories about Neverhood. But-if you want and never tried original-try it after-it looks alot alot of better than this game-its just alot of repeatable puzzles... sadly =/ and short that took me to solve in 4 hours without any walkthroughs",
            "review_score": "1"
        },
        {
            "review_text": "Having worked in a gaming studio, I can understand all the crazy things going wrong at the last minute etc etc. As well as having the community breathing down your neck to release. I can cut them some slack for not everything being perfect. I am just very happy the game is finally here!   I played for a couple of hours, but I think I will wait till they patch a couple of things. The graphics are detailed and beautiful, and the music is amazing !  Good work !",
            "review_score": "1"
        },
        {
            "review_text": "Armikrog is a beautiful point-and-click puzzle/adventure game. It starts off with a wonderful animated intro sequence and good music, followed by an exciting and enjoyable claymation cinematic that kicks off the game. You are pumped to get started, and for the first few minutes, it's very promising.  After that, though, the game starts to fall apart (gameplay wise).  Ignoring the missing menu text that was fixed in a timely fashion, the game seems unpolished, and far from ready to release. I had to restart the game from nealy the beginning after discovering that you could not overwrite saved games. The game did not tell you this, because you get no feedback when you press save to know that you have actually saved it. Bugs and frustrating moments leave you with the question 'Is this supposed to be like this, or is this just another bug'.   Some buttons you can press, some buttons you can only press if all the conditions are met, and some buttons you can press, but the game won't let you unless you hit a sweet-spot with your mouse cursor, and so you might think that you have not met the conditions to press this button yet, so you move on to the next puzzle, and so the confusion begins.  It feels untested, even though it has gone through a beta. After almost year of delay, you'd think that it would be well tested. As of now, one puzzle can be skipped entirely by walking straight through a locked door. Everyone seem to have this problem. I can't imagine this would go by any sort of QA.   Armikrog, again, is a beautiful game, and I want to recommend it. But I can't. Not now. It's not about the price. That is something I'm willing to pay for this kind of beautiful claymation adventure. But the game is simply not DONE.  The voice quality of the dialogue is varying from bad to okay at best. The main characters start off the game talking to each other as you progress, but apart from cinematics, they barely speak past a few rooms, which enforce the 'not done' feeling permeate this game.  I want to like you, Armikrog, but you got to take the few extra steps. Buy/play this game once the bugs have been fixed, and it might be enjoyable enough.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're a fan of The Neverhood, this game will not dissappoint you. Similar humor and puzzle styles are present and you'll notice some things that were definitely from Neverhood. A great nostalgia trip for the next generation of technology.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous to look at, fun to poke at and explore, more leisurely than The Neverhood but arguably grander in terms of the mythology it hints at. Puzzles are repeated in a way that builds on past experiences, resulting in a gradual increase in difficulty I found to be an improvement on The Neverhood. Its most egregious bugs have been patched (transparently so by the folks at Pencil Test), and while it retains a few UI quirks (the lack of feedback for interactive elements can be frustrating), neither of these prevented me from completing the game a few days after its debut.  Like Broken Age, Armikrog may be a victim of the challenges game developers face when updating point-and-click adventures for a modern audience: Many of the conventions most coveted by hardcore fans directly contradict contemporary tenets of game design and usability. My impression from Armikrog is that the team chose to favor the qualities of The Neverhood that aged best and set it apart (the clay visuals, the soundtrack, the mythology) over those that wouldn't be as charming to modern players.  Also like Broken Age: Armikrog is imperfect, but I love it anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Armikrog is a classic-styled pont and click adventure featuring plenty of clever puzzles, fiendish brainteasers, wacky character designs and beautiful stop-motion animation. The soundtrack varies from being atmospheric to playful. Unlike many other point-and-click games, Armikrog features NO dialogue trees. Much of the puzzles are based off of finding secret symbols and codes to use elsewhere. Be sure to take notes with a pen and paper while adventuring!  As a fan of point and click games from companies like Lucasarts and Telltale, Armikrog is a breath of fresh air, as its lack of dialogue trees and its use of symbol-focused puzzles give it a unique gameplay experience. You'll love to explore the mysterious tower and learn about its tragic history.  The voice acting is excellent. Michael J. Nelson and Rob Paulson deliver excellent performances as the two lead characters.   Unfourtuanetly, there are a few bugs to be found within the game. I have experienced animation glitches whenever I grab onto a squid's tentacles, and there is one area where Beak Beak the dog needs to jump on a switch. It doesn't work properly, as no matter how many times I click on the switch, he simply WON'T sit on it. However, these bugs do not detract from the experience.  If you are a fan of point-and-click games and/or stop motion animation, Armikrog should be a no-brainer for you. Buy it now and head off to adventure!  85/100",
            "review_score": "1"
        },
        {
            "review_text": "The game is confusing and giving you a silent treatment. Call me stupid, but this game is confusing as heck. Also screw infant with lulaby puzzle.  And add the language option.  btw I regret backing it up on kickstarter.",
            "review_score": "-1"
        },
        {
            "review_text": "Heartbreaking to thumb this one down. The art style is charming and wonderful--something anyone who has played The Nerverhood would fall in love with.   Unfortunately it's very difficult to recommend it right now for reasons you can read in other reviews.  Two things that bugged me though that doesn't seem as frequently criticised--the quality of the audio of the voice overs is very poor, and the cutscene videos aren't of particularly high quality either. An option to download a more detailed/HD transcode would be great.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game just like the neverhood although it was a bit short it was still fantastic, Also if you havent already check out The Neverhood it is a classic.",
            "review_score": "1"
        },
        {
            "review_text": "I backed up this game on kickstarted. Although the game release was delayed multiple times, I waited patiently. Due to delays I was expecting polished bugfree experience which developer failed to deliver.  To my dissapointment, this game is nothing like Neverhood. I's pretty boring and puzzles are too easy.  And current price (25€ in my region) is just too much for this game. It's worth 5€ top.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want to enjoy this game try your best NOT to compare it with Neverhood. Yes, same creators, same style, clay, bla-bla-bla, enjoy the picture, but   DO NOT compare!   If you do, you'll ruin the experience and will probably be a bit disappointed. Personally, I enjoyed the game a lot.  PROs: + clay animation combined with more materials and other animation styles looks awesome + I acctually had to draw on paper to solve some puzzles + new language inside the game, not just symbols but actual voicinng    When those octopi-things are telling Beak-Beak the story first they do it in that language    + a little drama touch was nice + cute characters and monsters + references to Neverhood    Remember robot Bill (with teddy bear) from Neverhood? You'll see some of those. And you'll have to fire a cannon one more time     CONs: - rather short - not very funny, although it had some potential  - not many difficult puzzles, most of which were just getting repetetive - feels a bit unfinshed, unpolished, there's much more that could be done to make the game more compex and more interesting, I think developers probably should have taken more time, but add those small detailes (like clay cursor or moving lips or just more phrases from characters) that would be very apreciated by everyone, and it wouldn't feel so raw  Still, I think the game is worth playng. Of course, you're probably interested in it because of the Neverhood, but don't expect it to be as good and varied, and then you'll enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice graphics style, but the experience is crippled by strange unresolvable puzzles and bugs in the Mac version.",
            "review_score": "1"
        },
        {
            "review_text": "+ Beautiful claymation + For Neverhood fans this is something worth checking out (but after price reduction) + Very good music  - Too short (4 hours, really?) - Story is very dissapointing - Small bugs and glitches everywhere  Armikrog was announced as a game that will follow in footsteps of Neverhood, but there isn't even a chance to 'feel' the story, because it's too damn short, I'm very dissapointed... :(",
            "review_score": "-1"
        },
        {
            "review_text": "Neverhood:MYST this:RIVEN  try hard",
            "review_score": "1"
        },
        {
            "review_text": "Short and buggy. If you want the nostalgic feeling from playing the Neverhood -- go get the Neverhood somewhere instead of this.",
            "review_score": "-1"
        },
        {
            "review_text": "The only thing good about this game is the first room.  After you leave the first room, you won't encounter any more humor or claymated cutscenes, instead you will have to solve... no, not puzzles because those are recycled 3 times each so they're boring instead of challenging. You will have to solve another kind of puzzle, which is navigating your way around game breaking bugs.  Save often because you will load at least twice because you can and will get stuck with no way to continue. That is, if you aren't playing on a 4:3 screen because then it's impossible to pass some screens at all.  You will also have to ignore pre-alpha quality of the game engine: animations not working, dialogs not audible, subtitles appearing when no one is speaking, but not shown when there's speech, certain hot spots randomly not working so you need to leave a room and come back, stuff like that.  The game was released over a year past schedule, by putting together scraps and gluing them together. You will notice dialog was just test sounds sent in by various people and they never re-recorded in a studio. You will see a missing box monster being stretched. If you've watched trailers, you will notice several rooms didn't make it to the game, as well as at least two cutscenes.  So the game puts you in a whacky place but is never funny after intro+first room (which was done before kickstarter campaign, before actual team was assembled and killed the mood). So the puzzles are easy but recycled to the point of not just boring but irritating you. So the game takes 2 hours if you've played point-and-click adventures before. All bad news for a game asking €25, but most of us would probably forget that, on the account that claymation games are so rare and must be hard/costly to make. But the bugs are unforgivable.  The gameplay bugs are really easy to fix (some photoshopping here and there, some hot spot resizing, making the music actually play sometimes). Same goes for all the typos on the wall of text, can't you just paste that into a spell checker?  You know, stuff like that adds insult to the injury.  I wouldn't pay €5 for this if I knew.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid adventure game. I gave up on it when it first released because it seemed too buggy and unpolished. They must have updated it because it runs really well right now and I am really enjoying the amazing claymation and cool puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "The game is too short, puzzles started repeating itself in the middle of the game. First one third of a game was great, but I really was disappointed with the rest.   Anyway, as a baker, I did expect it at least as cool as Neverhood was.   To be fair, it looks like as good as old Neverhood. Good sound, good animation, good music.   But I'd say authors must spend at least one more year to make the game excellent - it seems they didn't spent enough time (or money?).   It might be say Episode One of the true Armikrog. But it is doesn't look like the solid complete game.",
            "review_score": "-1"
        },
        {
            "review_text": "There are no puzzels in this game. Only gauntlets of tedium. Which is impressive for a game that's so short.",
            "review_score": "-1"
        },
        {
            "review_text": "RPS review is ♥♥♥♥♥ing about Armikrog being how it is SUPPOSED to be. Of course there is no description on what item you just picked up or are about to grab. Its for you to find out. THATS THE GAME. ITS A HARD PUZZLE GAME THAT LOOKS COOL AND HAS GREAT MUSIC. At least buy the music. Will write more as I play: fixed starting problems, none of which I experienced. Plays Smooth, and has a nostalgic feel.",
            "review_score": "1"
        },
        {
            "review_text": "Reelly cool old-fashioned point-and-click game. Really reminds of the good old days spent with Neverhhod. But event after delayed release the game has lots of bugs, and the worst of them is bug with SAVING YOUR GAME! Enjoing the game, but reaaly hope, developers make patch as soon as possible",
            "review_score": "1"
        },
        {
            "review_text": "A very poorly designed game. Yea, they have spent every cent on their clay animation, but no amount of hard work can save this piece of garbage (with game saving in options?!) . Backed on KS out of nostalgia feel of neverhood, but will never do such mistake again.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're a fan on The Neverhood, than some part of you will completely adore this game. However, that being said the game itself has been an up and down for me. The story is a bit lacking and short, and puzzels can get very very hard. If you're into that though, definitley a game for you.",
            "review_score": "1"
        },
        {
            "review_text": "A real bummer. The visual design for this game is great, the music is great, the puzzles (if you can figure out what is a puzzle or not) are so-so. The bugs are tremendous. There are no pixel hunting aspects to this point and click, and it runs to about 5 hours if you happen to stumble into the correct order of puzzles. Got to the part just after meeting the villain, and everything stopped being interactable...",
            "review_score": "-1"
        },
        {
            "review_text": "Ugh. I don't want to give Armikrog a negative review. Then again, I pretty much have to. Bear with me a moment, what follows are the ramblings of a very conflicted soul.  I'll start by saying that I really enjoyed the game. It kept me entertained and brought back some lovely memories of a little tiny me trying to wrap my head around the Neverhood. The puzzles were challenging, and definitely of the 'bizarre adventure game logic' variety, but that's exactly what I expected, and exactly what I wanted.  Why the negative review, then? Well, I did enjoy the game for its entire duration... all four hours of it. Given how much the game sells for, and how much it was hyped up to be during the Kickstarter campaign that brought it to life, that's quite a lot less than I expected. To be blunt, I would have been happy with 12 hours. The puzzle and room design feels much more repetitive than that of the Neverhood.  It kind of feels like a game that was dropped halfway through development. The storyline doesn't seem to really end, or at least it ends too abruptly to really sink in.  If you're a die-hard Neverhood fan who really wants some more, do buy this game. You'll enjoy it, much as I did. However, please bear in mind that you'll be buying something that may well leave you asking for more. And you're probably not getting that second helping anytime soon.",
            "review_score": "-1"
        },
        {
            "review_text": "Huge letdown.",
            "review_score": "-1"
        },
        {
            "review_text": "Huge letdown.",
            "review_score": "-1"
        },
        {
            "review_text": "There are some imperfections, but whatever its very good and outstanding.  ",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's a 'not bad' sequel of the Neverhood - but lack of real puzzles over and over ( not as hard and confusing as the Neverhood - ofc. i should not compare the two - but well, same company, same style - it should have some connection... By the way, the game is quite short - there is also a repetative annoying puzzle ( baby song solve ) - with a terrible music on a loop, dunno who wanted that.. story is sloppy too, and missing the soul of the old game - missing a lot of pointless interaction, only had one: the window at the beginning. Beside that, if you want to choose between the two: then you should go with Neverhood. Cheers!  Rating: 6/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Being a fan of Neverhood getting this game was a must. For a while i enjoyed the game, reminded me the Neverhood only to end up frustrated by bug. I had other bugs as well but without effect on the gameplay. Wasted enough of my time already. Maybe you get lucky and will not get the bug(s) and will be satisfied with the game. I was not, sadly.",
            "review_score": "-1"
        }
    ]
}