{
    "app_id": 334100,
    "name": "Extreme Exorcism",
    "release_date": "2015-09-23",
    "developer": [
        "Golden Ruby Games"
    ],
    "publisher": [
        "Ripstone"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Action"
    ],
    "achievements": 13,
    "positive_ratings": 24,
    "negative_ratings": 4,
    "price": 4.99,
    "description": "Extreme Exorcism is a paranormal platformer where every move you make comes back to haunt you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334100/header.jpg?t=1506940130",
    "minimum_requirements": "OS: Windows 7 64Bit Processor: Intel Pentium Dual Core E5400 2.7GHz Memory: 4 GB RAM Graphics: AMD Radeon HD 3830 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Super Crate Box but SPOOOOOOOKYYYYYYY~~    Hate reading? Check out my impression in REAL TIME HD 1080p TECHNICOLORS    Pros: _Looks nice: Very vibrant pixel arts, fits the tone of the game, pleasant to look at. _Great music: Appropriately Halloween, nothing too catchy, but pretty kickass. _Controls well: Nice and tight, Double jumping feels great, weapons could use a bit more oomph, but overall pretty good. _Interesting mechanics: You can hold and use 3 weapons at the same time! That's pretty rad. The ghosts are also interesting. They mimic your actions from the previous rounds, making them really unpredictable and eratic. The chaos they create are insane. _Lots to unlock: Stages, weapons and more unlock at a breakneck pace, keeping you playing just one more round. _Local multiplayer: Ramps up the chaos, ramps up the friendship.  Cons: _Sort of one note: You just kill ghosts and nothing else. The ghost all look the same, and do the same thing you do. So it's just a whole lot of jumping and shooting. Very interesting jumping and shooting perhaps, but it does get old and grindy after a while. _No online plays: Which is a shame, cuz I have no friends :(  Is it worth 13 bucks? I would say so. For all of its flaws, it IS a fun game. It's hectic, arcade-y fun. You could do a whole lot worse.",
            "review_score": "1"
        }
    ]
}