{
    "app_id": 334260,
    "name": "Icebound",
    "release_date": "2015-08-05",
    "developer": [
        "Fastermind Games"
    ],
    "publisher": [
        "Fastermind Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Visual Novel",
        "Puzzle"
    ],
    "achievements": 14,
    "positive_ratings": 8,
    "negative_ratings": 0,
    "price": 11.39,
    "description": "A steampunk visual novel and puzzle game set in Permia - a world in the depths of an ice age. Dougal, a wandering alchemist, gets in over his head when he competes against several eccentric individuals for the ultimate treasure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334260/header.jpg?t=1447365251",
    "minimum_requirements": "OS: Windows XP SP1 Processor: Pentium 4 1.7 GHz Memory: 128 MB RAM Graphics: Intel Integrated Chipset Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Story    The story of Icebound revolves around Dougal and Isaac, an alchemist and his familiar who made a terrible mistake, and search for a way to rectify it. Along the way they meet many characters and explore new lands.    Art:    The art is decent, there is a variety of art for each character, as well as CG's for important scenes.   Gameplay   This VN does feature some gameplay in the form of Alchemy puzzles. These involve placing colored squares in the right order to fill up a board, these can be quite challenging, and can be a fun break from reading.   Music   The music and sound design is well done, the music compliments the scenes nicely and flows seamlessly with the game.   Overall   Players who enjoy fantasy or steampunk novels wil enjoy Icebound, it features a refreshing story with interesting plot points and mystery to keep you interested, and gameplay and puzzles will keep you coming back for more.",
            "review_score": "1"
        }
    ]
}