{
    "app_id": 334710,
    "name": "Ilamentia",
    "release_date": "2014-11-25",
    "developer": [
        "Anthony Case"
    ],
    "publisher": [
        "Caiysware"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Puzzle",
        "First-Person"
    ],
    "achievements": 25,
    "positive_ratings": 54,
    "negative_ratings": 21,
    "price": 2.09,
    "description": "Ilamentia is a mysterious actiony puzzler where you must first discern the curiosities before resolving them. Some levels focus on brain-melting logic, others rely on sharp reactions, many more will test the limits of every facet of your cognitive faculties.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334710/header.jpg?t=1547113692",
    "minimum_requirements": "OS: Microsoft® Windows® Vista / 7 / 8 Processor: 2.4 GHz Memory: 1 GB RAM Graphics: Dedicated (not integrated) 512Mb graphics card DirectX: Version 9.0c Storage: 200 MB available space Additional Notes: This game only supports XInput gamepad controllers (e.g. Xbox 360).",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An amazing series of exploratative puzzles, and one of the best uses of design space that I can recall.  The game itself is difficult to explain. Its a first person wasd + mouse control scheme with only 4 additional forms of input. Fire, jump, restart, and exit. These functions change slightly from level to level. Sometimes you might not be able to jump, sometimes you might be able to fly, sometimes your fire button does... something entirely different.  There is very little in the sense of hints (usually you have the name of a level and a single short sentence with which to build your guesses). This can be a boon or a curse depending on how quickly you pick up the goal of a stage.  The game is somewhat simplistic visually, but handles its setting and theme very well. With its otherwordly sound track, constant visual tricks, and a very novel approach to death (there technically isn't any), I felt very much like some sort of nethermancer seeking to accumulate souls for whatever purpose a nethermancer soul searches.  I very much suggest purchasing this game, I've already bought several copies for friends. It's a game you don't want to miss.",
            "review_score": "1"
        },
        {
            "review_text": "Very hard puzzle. I love hard puzzles :).",
            "review_score": "1"
        },
        {
            "review_text": "What?  I don't...  What.  Illamentia is an obscure title almost akin to the likes of Yume Nikki or Dreaming Sara in the sense that you have to try to understand the things around you, however where the game differs is not only in its' art style, but in the puzzle-style gameplay presented to you. Picture this: You see a giant tower-like object, and you can shoot cubes around it to change their color. The ground under you is completely reflective, as you pace around for a little bit, you notice the reflection of the cubes represents what their color should be in the overhead world. It's simple, not too complicated, but makes for some interesting concepts at times when the puzzles get a bit more difficult. The jumping puzzle was awful, don't even get me started on that, but i'll let it slide considering it's kind of a 3d platformer in a way as well.  If you like weird games, and 3d platformers, you just might get a decent kick out of it, hell I liked it enough to play for about 5 hours, so hey, give it a try if it looks like something that interests you.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░▄█▌▀▄▓▓▄▄▄▄▀▀▀▄▓▓▓▓▓▌█  ░░░▄█▀▀▄▓█▓▓▓▓▓▓▓▓▓▓▓▓▀░▓▌█  ░░█▀▄▓▓▓███▓▓▓███▓▓▓▄░░▄▓▐█▌  ░█▌▓▓▓▀▀▓▓▓▓███▓▓▓▓▓▓▓▄▀▓▓▐█  ▐█▐██has ▓▓▓▓▓▀▄░▀▓▓▓▓▓▓▓▓▓▌█▌  █▌███▓▓▓▓▓▓▓▓cards ▓▓███▓▓▓▄▀▐█  █▐█▓▀░░▀▓▓▓▓▓▓▓▓▓██████▓▓▓▓▐█  ▌▓▄▌▀░▀░▐▀█▄▓▓██████████▓▓▓▌█▌  ▌▓▓▓▄▄▀▀▓▓▓▀▓▓▓▓▓▓▓▓█▓█▓█▓▓▌█▌  █▐▓▓▓▓▓▓▄▄▄▓▓▓▓▓▓█▓█▓█▓█▓▓▓▐█",
            "review_score": "1"
        },
        {
            "review_text": "played about 1 hour, and honestly, i cant understant nothing, seems a good puzzle game, i love puzzle games but its a bit uhmmm",
            "review_score": "-1"
        }
    ]
}