{
    "app_id": 334840,
    "name": "Drive to Hell",
    "release_date": "2015-01-30",
    "developer": [
        "Ghost Crab Games"
    ],
    "publisher": [
        "Ghost Crab Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Shoot 'Em Up"
    ],
    "achievements": 40,
    "positive_ratings": 48,
    "negative_ratings": 9,
    "price": 3.99,
    "description": "Drive to Hell is an action-packed shooter where you'll take a ride through an army of monsters to exact revenge on the Demon King for destroying your favorite dive bar. Enemies assault from all sides, each with its own special personality and attack style.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334840/header.jpg?t=1447365384",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core 2 Duo 2GHz Memory: 1 GB RAM Graphics: DirectX 9.0c compatiable video card with 256 MB video memory DirectX: Version 9.0c Storage: 550 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A really fun top-down, twin-stick shooter wrapped in the guide of a road trip riddled with monsters and demons. The game is filled with weapon upgrades, boss monsters, and a visual style that brings me back to the 16-bit era. The game plays great with either keyboard/mouse or a controller, and the tone of the game (you are driving through hell - like in a car, capable of firing missiles, because a demon blew up your favorite bar) is really fun and doesn't take itself too seriously, which is refreshing.   I guess one could read into it a bit too much and glean a point about who is really the monster: the demon, or the couple willing to hunt him down because they couldn't get a drink, but I'm too busy blowing stuff up to care about morality in games. I have demons to kill, so pour me another!  A really fun game, and definitely worth the asking price!",
            "review_score": "1"
        },
        {
            "review_text": "Really nice casual game. Good to play with keyboard plus mouse and also with a gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "EXT. FRONTYARD - DAY It is a cold fall day. Light sprinkles of rain beat down on a man drinking from a bottle. Man wanders down street something catches his attention. Man walks up to a window of a house. Friendly laughter fills the air. Man sadly peeks through window. The light drizzle hides his tear. Inside house a group of friends laugh, smile and play co-op games together. Suddenly a jump scare by a rude voice   HIPSTER GAEMER  'Hey! Git way from hour window!'     Man stumbles back like a drunk Miley Cyrus opening up a portal  to an alternate reality while riding the Gravitron and almost spills his beverage.   Player 1   'You almost made me drop my beer idiot!'  EXT. PARKING LOT - NIGHT Rugged man scurries away and jumps into a neon pink Libra. Pulls up to his favorite bar and then... Bricks.  'Roger this is a thumbs up for me.'  An entertaining step back in the right direction for sheezy.",
            "review_score": "1"
        },
        {
            "review_text": "  Amazing game, very fun. Makes me rage every day, 24/7. I don't have any time to rage, makes me rage more than Geometery Dash.",
            "review_score": "1"
        }
    ]
}