{
    "app_id": 334980,
    "name": "Into Blue Valley",
    "release_date": "2014-12-24",
    "developer": [
        "Ryan Javanshir"
    ],
    "publisher": [
        "Ryan Javanshir"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Walking Simulator"
    ],
    "achievements": 0,
    "positive_ratings": 27,
    "negative_ratings": 29,
    "price": 3.99,
    "description": "Into Blue Valley is a first-person exploration game drawing upon themes of mystery and curiosity. It is presented as a 'found footage' game with the player's view resembling a camcorder recording showing a glipmse into the subdued environment that is being explored.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/334980/header.jpg?t=1504322012",
    "minimum_requirements": "OS: Windows 7 Processor: 1.80GHz Processor Memory: 2 GB RAM Graphics: Video Card with 2GB of VRAM DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Have been long anticipating this release as I do know personally the small team that has been behind it's development. First of all can I say a big well done on coming this far and persevering with this project, it's always refreshing to see new ideas come to the table and indie developers giving their spin on story telling or just pure gameplay at its core.  Into Blue Valley shows off one hell of a creative landscape and perspective which will have you building up your own suspense and in some cases have your eyes playing tricks on you. The atmoshpere is completely hammered home through its fantastic soundtrack to really give that lost wanderer feel.  The story is text based so prepare to read a little but manages to cover different styles of writing that you'd probaly find lying around... It is not a film award winning script but manages to do the job.   Honestly don't expect the longest amount of gameplay from Into Blue Valley however do keep in mind that this is a first for the developer (that consists of one coder might I add!) and that the magic is really in taking it in a slow pace allowing yourself to immerse a little! This immersion will be pushed a little further by an Occulus Rift version (free of charge) which is a bonus that I'd be willing to try out and does help to justify the game's price. I really will be trying this to see if my eyes end up tricking me even more.  Overall a good effort and would be interested in seeing where the developers go in the future.",
            "review_score": "1"
        },
        {
            "review_text": "I guardedly recommend this game; the visuals, presentation, and central conceit of it are excellent and engaging, but it's extremely brief.",
            "review_score": "1"
        },
        {
            "review_text": "Purchased because of alleged DK2 support. I have a fast PC that runs EliteDangerous like a dream. On lowest quality settings it cannot get above 50fps. Nauseafest. The interface is not well designed for DK2 - you can easily miss the text which goes by too quickly. Content made for a PC screen not for a VR experience. Not recommended for VR.",
            "review_score": "-1"
        }
    ]
}