{
    "app_id": 335190,
    "name": "200% Mixed Juice!",
    "release_date": "2015-10-23",
    "developer": [
        "Orange_Juice"
    ],
    "publisher": [
        "Fruitbat Factory"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Anime",
        "Indie"
    ],
    "achievements": 23,
    "positive_ratings": 261,
    "negative_ratings": 54,
    "price": 4.99,
    "description": "200% Mixed Juice! is the 10th Anniversary game of OrangeJuice, an old school RPG featuring a 200% mix of OrangeJuice characters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/335190/header.jpg?t=1500959798",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: Intel CPU 2.0GHz or faster Memory: 1024 MB RAM Graphics: DirectX 9 or above compatible card with 256MB VRAM or more (Radeon or GeForce recommended) DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectSound-compatible card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Indie GAGA Review This is a short review. To view the full review including many more details, a video and screenshots, please follow  this link  [www.indiegaga.com] .    Overview   I must mention first of all that this game primarily serves as a fan service to people who have played other OrangeJuice titles. This is a JRPG with strong visual novel elements. Our first introduction to the characters in this was from 100% Orange Juice (a virtual board game) which was a little confusing if you think of it like playing Mario Party alone. You see, the Japanese were introduced to the characters through OrangeJuice's bullet hell games, so they already knew who many of the characters were. You might think of this as unimportant, but really, you will be lost when playing this if you haven't played any of the other OrangeJuice titles.  Dialogue is childish, and so is the humour, so don't expect anything serious. Battles are fought with a perspective highly similar to Pokémon. Like 100% Orange Juice, you work with cards. You can collect an endless number of cards, but you can choose three to fight with. Each card is a character with its own attacks. (There are item cards, but these come into gameplay later on.) You can choose from rock, paper and scissors, and these will determine your strength and defence. If you find yourself at a disadvantage you can switch cards. Attacks have different SP costs, which you gain through dice rolls at the start of turns. Battles are fun, but grinding isn't.  Honestly, the story is a bit half-♥♥♥♥♥ and corny, but when you consider the game as fan service and not taking itself seriously, it's forgivable. I wouldn't recommend it to those unfamiliar with the franchises. The developers tried hard to give the game a retro look, similar to 16-bit games, and they did a good job. In my experience it screws the screen up in full-screen mode, so I played windowed. I hope the devs fix this. Music is mostly sub-par, with some nice tracks. I can't judge the online mode yet, but I'll update the review when I can.    Ratings       Category  Score  Explanation    Gameplay  7/10  It's easy to learn, perhaps too easy though. Those familiar with Pokémon should like the battle system. Sadly, you'll have to grind a lot. Card collection is fun, but cards are unbalanced. You can skip through cutscenes. Online play is a nice addition that I'll add to the review.    Story  4.5/10  The script might be annoying to those who prefer serious JRPGs. However, the humour is light-hearted with memes included every so often and fourth wall breaking.    Graphics  4.5/10  Art is of good quality, but all frames are static. The game is a cheap purchase, though. Backgrounds are a little too pixelated. Full-screen problems need fixing.    Sound  6/10  Along with the graphics, the music has a retro quality, being chiptune. Most of the music is very average, but some of the boss themes are great.       Final Verdict   6/10",
            "review_score": "1"
        },
        {
            "review_text": "A bit overpriced, but a perfect game for all people that might know 100% Orange Juice universe, especially those unknown games such as Sora, Flying Red Barrel or a bit more recognized, Suguri series.  Basically, it's exactly how it's described, an olschool RPG with a sense of humour, mixed together with many different games, pokemon-like battles and classical 'save a world' main objective. Can be easily completed in a few hours.  If you ask me, get it if you like 100% Orange Juice or played other mentioned above series. If you don't, perhaps consider doing so firstly, or at least wait for nice discount (-33% would be nice for me).  Overall, 7/10.  P.S. Multiplayer was a mistake.",
            "review_score": "1"
        },
        {
            "review_text": "100% Orange Juice+100% Pokemon=200%Mixed Juice! But really, it's a fun game and totally worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Game Title: 200% Mixed Juice! Achievement Progress (at the time of post): Completed  (My reviews assume you have read about the content of the game in terms of gameplay. I am simply reviewing each individual aspect based on my opinion. You may find I rate by different categories in each of my reviews. This is because every type of game is different, and will not have the same content. I think it is pointless to leave a category blank or write 'unrelated', or something similar.)  Game Content:  Type of Game: Board game, card game, anime, RPG, strategy Graphics: ** - Pixelated with classic anime style characters Music: *** - Catchy, but can get repetitive and boring (if you play it as much as I did) Addictiveness: ***** - I could not stop playing! The addictiveness comes in hunting for every achievement and trying to get every card. I did not complete the latter, but I was close. Storyline: *** - Followable and interesting. Difficulty: *** - Difficult at first, but once you master the stategy and collect cards gradually, it will become easier. Character Development: *** - The player learns about every character in little depth, but the player can understand the personality of each character. Replay Value: * - Although there is not much replayability, instead you are building up one collection of cards after completing the storyline once. Gameplay and Controls: *** - Very enjoyable gameplay, but the controls are limited to the classic Z, X, enter and the like, with no mouse input. Co-op and Multiplayer Ability: ** - There is the abilty to play against friends if you schedule it, but there has never been anyone in the lobby for multiplayer in my entire experience playing the game, except when I invited my friend to play. The muliplayer is PvP only.  Conclusion:  Marks Overall (judged by the mode of the numbers): *** 6/10 Who Should Play This Game?: Card/board game lovers, people looking for a unique sort of RPG and people following the developers of the game: Orange Juice.  Thank you for reading! If you have any suggestions about removing/adding/changing anything in my reviews, please let me know.  Peace out mein liebes XD",
            "review_score": "1"
        },
        {
            "review_text": "This game has 100% more juice.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of any of the orange juice games and/or love yourself this game is a must buy for your soul.",
            "review_score": "1"
        },
        {
            "review_text": "A very cute but also very grindy RPG. Doesn't suit my personal tastes, but worth your time if you're into that sort of thing.",
            "review_score": "1"
        },
        {
            "review_text": "Very, very, goofy. Fairly hilarious.  Good music, pretty good plot if you've played other Orange Juice games, and a good battle system.  Give it a try, it's definitely worth.",
            "review_score": "1"
        },
        {
            "review_text": "good game i cried at the   start  ",
            "review_score": "1"
        },
        {
            "review_text": "More like 200% Mixdus never gives you what you want. it's still fun and funny though.",
            "review_score": "1"
        },
        {
            "review_text": "It's very simple and easy to get into.",
            "review_score": "1"
        },
        {
            "review_text": "Pokemon but with random Characters + Visual novel = Awesome ",
            "review_score": "1"
        },
        {
            "review_text": "Simple plot. Simple gameplay. Quirky cast. Good music.   Overall, 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most adorable RPGs I ever had the pleasure of buying.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Game of The Year 2015.   If the fact the title abbreviates to 200% MJ doesn't seal the deal for you I don't even know what you're thinking man.  All I know is Orange Juice=Good Games=My Fetish.  Also Fruitbat Factory=Good Localizations (Of Good Games)=My Fetish.",
            "review_score": "1"
        },
        {
            "review_text": "It's definitely required you own 100% Orange Juice before this. It's recommended that you've at least attempted to play SUGURI, or Acceleration of Suguri. QP Shooting has zero story, so ignore that.",
            "review_score": "1"
        },
        {
            "review_text": "Its like a even more weeb pokemon on steam",
            "review_score": "1"
        },
        {
            "review_text": "My status rose (lowered) in the eyes of my friends who now call me a weaboo for playing this game.  10/10 social status change again",
            "review_score": "1"
        },
        {
            "review_text": " **ACHIEVEMENTS CLEARED (23/23)**  personal score:   C-RANK   price paid:   6.29 USDs   price history:    buy at a 50%+ price cut  [isthereanydeal.com]   ",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;Plays game &gt;Runs into weeb wolf girl &gt;She's useless &gt;Gets a bully &gt;She's useful &gt;Uses bully &gt;Bully carries the team till the end game &gt;Beat the final boss with only the bully &gt;Everyone else is winded  ... 10/10 would use the bully again.",
            "review_score": "1"
        },
        {
            "review_text": "I'll get right on this review: The single-player is simple, the graphics are basic, but colorful. The mechanics work well, and lastly, this is just a gigantic card game RPG simulator.  Pros: easy to play gameplay mechanics work plethora of characters to choose from play as protagonist  hug QP and get her on your team from the get-go silly storyline that makes little sense, but still fun to watch, especially 4th wall breaking Free mixed juice Marie Poppo for 100% Orange Juice players  cons: Lack of Marie Poppo in the first few areas disturbs me greatly.... No Marie Poppo make me something something.....  All in all, if you like quirky RPGS without much story, this game is an easy pickup. For those who own 100% Orange Juice, just like QP Shooting Dangerously, the only way to get Mixed Marie Poppo is by purchasing this game, but I will say it's pretty interesting and worth a playthrough or two. Wish more people played this multiplayer, as I've yet to really see that part of the community grow. ",
            "review_score": "1"
        },
        {
            "review_text": "To be honest this is an amazing game. It is, to put it simpaly a 'mix' of all of Orange_Juice's characters (Hence the name) it is rather comedic all most with out even trying. But it has a few glitches and problems... by a few I mean one. The only glitch I've found is if you Alt+Tab out during a battle the game will crash. *Dog jumps on lap during final boss fight, presses windows button by mestake... game crashes.* And the problem with the game is mainly to get some jokes or references you need to of played 100% orange juice or other Orange_Juice games (I may as well add that this was the first Orange_Juice game I played) but after playing QP Shooting I got some of the references but not all of them. Still back to this game. The battles are fun and sought of remind me of playing Pokemon among other things, other people have said it reminds them of playing other JRPG's but for some reason Pokemon stood out for me... odd thing to say I know. The game is rather short (It took me about 6 hours including grinding) after words I tried to speed run the game with my level cap characters and skipping all the text between fights and I got through most of the game in about 50 min... short a'int it. THe game has a seamingly empty multiplayer feature. (Still havn't worked out how to get a ramdom battle) The system of buying cards eventually gets kinda bull. (While looking for a certain item I got the rarest item in the game... twice... and the item I was looking for was only labeled 'Rare') There is a system of mixing characters is quite funny when it's first introduced. (The machine that mixes charactors is described as a giant juicer) but eventually becomes an essential game element as some charactors, even at level cap are kinda... ♥♥♥♥. So. Let's talk story. 'Awaken sleeping princess' 'Wake up sleepy head princess or I will die of boredom' (Oh really?) Apart from the braketed part these are lines from the fist few lines of the game. You are told that the person who woke you 'Navi' has gone and made a 'small' world... that seems to consist of three seperate worlds... okay. you are given a name 'Protagionest' (I don't know if I spelt that right) oh and I'm not kidding about the name either. you are told that from being asleep for so long your social skills have degraded completely. Probably why for most of the game you're mute. At least the reason you're mute is explained. Anyway. At the second last fight in the game you fight yourself... WTF. characters constantly break the forth wall one character even goes as far to admit to this fact. So let's quickly recap before I lose my mind. Great game, short but in a good way, (Portal one style) story that seems to be rather generic at first glance but when you delve into it the game become a unique jewel full of non-standered humour and lots of forth wall breaking. The odd glitch and dog caused crash and a need to know other games to get some joke/refencences. The game ends on the cliff hanger from hell and after finishing it four or five times I still know nothing of it. I guess I'll do some searching of the interwebs to find out atleast something... probably be the best way to spend the rest of my weekend. It's quite cheap so if you are in for a stupidly comedic adventure or for a good RPG give this game a try. Oh and the charactors look quite cute... so yeah give it a go.",
            "review_score": "1"
        }
    ]
}