{
    "app_id": 335200,
    "name": "ManaCollect",
    "release_date": "2015-04-17",
    "developer": [
        "Tazigen Clock"
    ],
    "publisher": [
        "Fruitbat Factory"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Anime"
    ],
    "achievements": 21,
    "positive_ratings": 41,
    "negative_ratings": 17,
    "price": 4.99,
    "description": "ManaCollect is an action packed take on the classic Minesweeper as an action/puzzle game. Two contestants compete on a grid based arena to collect hidden mana by following numbered hints and unleash special attacks to drain their opponents mana.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/335200/header.jpg?t=1500606296",
    "minimum_requirements": "OS: Windows XP, Vista, 7 and 8 Processor: Intel Pentium 4, 3.0 GHz or higher Memory: 1 GB RAM Graphics: DirectX 9.0c compatible video card with 256MB memory DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am huge fan of the games that come out of Japan. They are strange, innovative, and show a completely different thought process. Especially when it comes to their games. Fruitbat Factory is one of my favorite publishers for these types of games. Bringing us such games as 100% Orange Juice and War of the Human Tanks. All games I have had the pleasure of reviewing. ManaCollect and all the aforementioned titles, have a certain charisma and personality to them that is hard to describe. Simply put they must be experienced. However I will do my best to bring it justice.  First off, when you boot up the game, the first thing you are greeted by is the cheery, over the top, cutesy music. The kind we have all learned to love and expect from these types of games. The soundtrack is catchy and poppie. It flows with the gameplay in natural style. There are several tracks to enjoy and for the most part the music is not grating on the ears. The only thing I could've wished for was the ability to choose which track to play. No big deal.  Now again most games from Japan usually like to add a twist to games. 100% Orange Juice is still the strangest card/board game I have ever had the pleasure of playing. ManaCollect takes the concept of Minesweeper, you read right, Minesweeper and adds a heaping of anime, kawaii style. The gameplay is more or less the same as the American version except it's hexagons that are numbered and you must find the 'Mana spot' AKA the mine spot. Added to that, is the games versus style combat. You see the mana you collect is turned into points. Points that you can use to hurt your enemy. Hence the more more mana you find the more damage you can inflict.  However your opponent is far from helpless. The opponent is collecting mana as much as you are. Running around the battlefield in a mad dash to collect. They can use this mana to attack but also defend themselves, so that all your precious attack mana is wasted and the game continues. Also each of the ten playable characters comes with a unique power, one that can easily give them the advantage if played right. This adds a pretty tactical aspect to ManaCollect. Not only using your powers at the right time but knowing when to attack or defend is crucial. Also being damn good at playing mine....ahem. Collecting mana.  Now the game comes with an assortment of different game modes. All of which are more or less a different variety of the combat versus mode. The Story mode is decent enough and adds some pretty decent AI that can easily dispatch you. I know, I lost many times. Story mode has four chapters total, ranging from easy to chaos. Now if you were to ask me what ManaCollects story was all about, I wouldn't have the foggiest idea. This is kind of typical though. Most games from Japan have a very over the top story. ManaCollect just kinda throws you into the middle of things, with little to no explanation. I feel as if I missed a prologue or some sort of introduction to the world and characters. Alas there isn't one. There also isn't a large visual novel aspect to the game, compared to lets say, War of the Human Tanks. You kinda just are these characters and go! No questions! Collect mana!  The visuals of ManaCollect are fair enough. Giving you an over head view to see the action and numbers. Your eyes are usually so focused on the numbers and mana most of the time. I barely noticed the avatars themselves running about the field. One thing that is kind nice to note is that ManaCollect comes in 16:9 resolution. Which is very rare for some games coming from Japan. Other options like rebindable keys, Anti-aliasing, full controller support are all options that are nice to have.  The game does offer plenty of replay value, including several difficulties dependent on your skill level. The local versus mode does add quite a bit of Mana collecting chaos. I can imagine having a few quick fun rounds with friends, battling it out as we use our powers and plan when to attack, then moving on to another game. I guess the mileage you will get out of ManaCollect all really depends on how much you enjoy Minesweeper.  In all, I had fun with ManaCollect. I felt though that there was something missing, a gaming Umami, if you will. The usual games I see coming from Fruitbat Factory and Japan in general, all have this unique style to them that makes me smile. ManaCollect needed a bit more of this in my opinion. It's what makes the genre of games unique. Otherwise it's just Minesweeper with an anime skin and versus mode. This 'gaming umami' is hard to define. It's not exactly a specific aspect, but just how the game made me feel. I had fun but it was forgettable. If you play these types of games constantly, you may know what I mean. It's fairly priced ($6.99) and you may get a few hours, to a couple of days worth of entertainment out of it.",
            "review_score": "1"
        },
        {
            "review_text": "ManaCollect is competitive minesweeper where two players compete to clear the same board. If you can mark all the bombs by yourself you get a massive bonus, and if you make a mistake, you lose all the correct mines you have identified no the board. Each character also has a special skill that can be used strategically to hinder the opponent's mine finding efforts. When you have found enough mines you can launch attacks on the other player which, after you deal sufficient damage, will win the game.  Overall I found the game somewhat mediocre. It is fun if you have a friend who also loves minesweeper I guess. The story is kind of nonsensical, I beat it and have no idea what is going on, but it does shine in multiplayer. I agree with the other comments that it is way better with a controller. The graphics are nice and the controls are snappy enough that you can usually mark hexes quite quickly without input error. The main issue for me is that I really have no inclination to play this game, by myself or with a friend, after the ~10 hours I put into it. There are simply other games are are more fun. I think if you can buy this game on sale and don't have expectations you will play it for that long, it is a decent pick.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "You know you are playing a lazy ♥♥♥ port when your mouse doesn't work at all in game. Keyboard controls are stupid. Tutorial is incomprehensible. Now I have to idle it for 3 hours to get the cards before I delete it.",
            "review_score": "-1"
        },
        {
            "review_text": "Really good game, even though it can be a hard.",
            "review_score": "1"
        }
    ]
}