{
    "app_id": 335220,
    "name": "But to Paint a Universe",
    "release_date": "2015-01-15",
    "developer": [
        "Mårten Jonsson"
    ],
    "publisher": [
        "JMJ Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 3,
    "positive_ratings": 18,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "A puzzle-game telling the story of a little girls struggle to restore a broken sky.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/335220/header.jpg?t=1460716298",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Memory: 512 MB RAM Graphics: Built-in DirectX: Version 9.0 Storage: 118 MB available space Sound Card: Built-in",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This puzzle game follows very simple rules. You have set orbs you have to manipulate certain colors into all at once, and while this sounds easy enough, it can get complex. I have had to stop and think about what I'm doing more than once.   My only recommendation is to make the 'rules' for each level a little more obvious. It wasn't very clear until I started to play the second and third levels. That said, toward the bottom before each level, it inidicates how colors will be knocked out. (Horizontally, vertically, diagonal, alternates, etc.) And on the actual puzzle screen, the bottom left is how many times you have to get all those colors into the special orbs.  The art is soft and beautiful while the music leaves a calm feeling as you work toward success. This is a lovely game and I'd definitely recommend it for a nice casual play.",
            "review_score": "1"
        },
        {
            "review_text": "Every stage has different rule on the same main rule. But it may be felt boring a little. I played this game for 2 weeks, 3 hours.",
            "review_score": "-1"
        }
    ]
}