{
    "app_id": 33570,
    "name": "Patrician III",
    "release_date": "2010-11-18",
    "developer": [
        "Ascaron Entertainment ltd."
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Trading"
    ],
    "achievements": 0,
    "positive_ratings": 289,
    "negative_ratings": 86,
    "price": 3.99,
    "description": "Patrician III - sequel to the award winning game Patrician II - features advanced in-game AI, which adjusts its difficulty based on experience and ability. In this economic sandbox game you can gain wealth and power in multiple ways - what you will do with it is up to you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33570/header.jpg?t=1478102142",
    "minimum_requirements": "OS: Windows XP SP2/Vista Processor: 1.6 GHz or higher Memory: 512 MB or higher Graphics: 128 MB DirectX 9-compatible (Pixel/Vertexshader 1.1) DirectX®: DirectX-compatible Hard Drive: 6.5 GB free hard drive space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "No eye candy, this game is about playability. Simply brilliant. Calls for lots of tweaking and micro management, but not in a way a becomes tedious to do so. Just enough to give you the feeling you are doing exactly what is needed. Various levels of play make the game challenging for all levels. I think I will still be playing this in 30 years from now (when no decent successor surfaces). The best of the series, better than earlier AND later versions of Patrician. The best trading game out there to date.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect way to scratch that 'I need to play an economic simulator game' kind of itch. If you don't know that feeling, this game might not be your thing.",
            "review_score": "1"
        },
        {
            "review_text": "Tutorial is one of the drawbacks. It could have been done better. Firstly, you need to stare in the small letters at the bottom of the screen and reading this is quite tiring. Secondly, not all the instructions are clear. Also, there's no control system that would check if a player did the requested action correctly. The tutorial is rather some kind of a guide book rather than a tutorial. Reading it all can take you up to 2 hours. Also, the tutorial doesn't explain everything, so it's wise to try a free game after the tutorial before getting to the campaigns. This will help you to learn the game by trial and error.  Graphics is not so great but it is decent and it reminds me of those games in the nineties. This can be a virtue as well as fault. Depends on what you like. The idea is simple: try to be the best merchant in the world. It turns out not to be so easy as you could have thought at first.  The game is challenging and even you know which city needs what kind of goods, it's still not easy to get rich. The clock is ticking and you need to act fast and with conviction. Learning the game will last a few hours as the tutorial is more about controls than substance of the game. But this can be a good point. One is sure: you need to acquire balance between selling and expanding your real estates.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is not compatible with Windows 10. Patrician III will not run using Windows 10. No known patches are in the works. I was very happy to see this game under the STEAM umbrella, then very disappointed when I found, it was not compatible.  UPDATE: I recently played the Steam version of Patrician III on a system, with Windows 8. The play was without any noticble problems and I was very pleased. I do recommend this game for Windows 8.",
            "review_score": "1"
        },
        {
            "review_text": "This is still one of my favourites of all time! The micromanagement necessary to tweak your trading routes to getting every last gold coin out of them is simply fascinating. There is nothing more satisfying than seeing your fleet grow and setting up more and more elaborate traderoutes, exploring even the mediterranian sea to get valuable spices back to northern europe all while growing your home city and expanding its borders as the mayor they all love.  Truely a classic and hasnt lost any of its appeal even though the graphics are very outdated by now.",
            "review_score": "1"
        },
        {
            "review_text": "This game extends your mind to the world of commerce and trade. One false move or random event can send you spiraling into demise. Such as a pirate plundering your ship, and all your cash...  At the same time though, this initial difficulty curve can be easily overcome by just playing through the tutorials thoroughly and then going for a few trial runs, and learning the feel for the game. You then learn what's what and get a few more ships, and even a town, eliminating the random events completely knocking you off your socks.  For $5, it's a veritable steal. (Although I got it for peanuts with the Patricians and Merchants pack back when it was $2.50!)",
            "review_score": "1"
        },
        {
            "review_text": "Didn't work on old computer, doesn't work on new computer.  don't waste your money.  just for a bit more detail. after installing, you run the video tests and they pass just fine. run the game however and it's nothing but the left half of the screen showing garbled imagery.",
            "review_score": "-1"
        },
        {
            "review_text": "Most definitely! Not many elements, but they are balanced almost flawlesly to create an engaging and deep game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. Apparently, I just don't have what it takes to be good at it and advance to make it enjoyable past the point I have reached. I became frustrated after 26 hours of trying and gave up for now. I only plan attempting it again when I am bored, between other games, or when the longing for it surfaces again. It is not a matter of a negatively constructed learning curve. In fact, learning how to play is not an issue at all. There are five tutorials, and they do an okay job at introducing the player to the game. The first campaign focusing on player advancement also instructs and gives hints appropriately, even though not with very much detail as to how to accomplish certain more convoluted aspects of the game. Even after consulting one extensive Wiki and three FAQ pages online, the game is still too difficult for me to succeed in. I've tried, once again, for 26 hours, every strategy and approach known to the experts, and I still would not succeed. The other AI controlled merchants in the game were light years ahead of me. All of the more in-depth reviews seen here are true and accurate. I just simply became frustrated at being mediocre or worse in the game, after 26 hours of trying. The game is difficult to be successful in. It's as simple as that. Perhaps this is a game that requires much more patience, and many more hours to be fully enjoyable.  Patrician III is okay.",
            "review_score": "1"
        },
        {
            "review_text": "I should have read more, I thought I was going to get a city building game, not trade...I suck at this and regret this purchase...however, The game itself doesn't seem to be bad, So if you like trading and ♥♥♥♥...Well, Go one.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING TO PEOPLE ON WINDOWS 8:  I followed all the steps on the community forums etc as to how to make this game compatible and make it run and still no luck! Steam is a great gaming service however they really need to crack down on selling broken games and make sure they are compatible with all operating systems.  Id advise you to stay away from this one!",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sure its a lovely strategy game but just try and get it running on modern machines. Graphical glitches made the game unplayable. Imagine every 100x100 grouping of pixels flickering in random directiosn for a hint of the headache enducing assault on my eyes. A mouse pointer leaving trails of ghost images of itself until it has clogged the screen. Menues that are invisible until you run the cursor over them. Producing a kind of rubing image that you may be able to interact with if the afformentioned mouse cursor ghost images do not obscure what your are looking at too much. The readme file links unoffical patches for Voodoo graphics cards, so if you're still rocking one of those you may be in luck. Do not waste your money unless you are into the challenge of getting older games to function with modern displays and GPU's. And if you do, let me know how you did it because this does look like a fun strategy game.",
            "review_score": "-1"
        },
        {
            "review_text": "I saw some good reviews for this game but even with several attempted fixes and patches I couldn't get it to run on win8.",
            "review_score": "-1"
        },
        {
            "review_text": "Old, poor graphics, nothing works well in high resolution even when patched.",
            "review_score": "-1"
        },
        {
            "review_text": "Do your remember playing Uncharted Waters back in the 90's? This is like that game, only with much better graphics and some town building.",
            "review_score": "1"
        },
        {
            "review_text": "Work on windows 10, some little bug (when you load or exit a game), but seem to work great.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging and not for everyone, but fun once you get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this cant play the game because of a standard error. Followed several instructions online, still doesnt work. Really a shame cause I played the game before and it is good. Why does Steam put broken games in there store? ",
            "review_score": "-1"
        }
    ]
}