{
    "app_id": 335830,
    "name": "Distant Star: Revenant Fleet",
    "release_date": "2015-04-07",
    "developer": [
        "Blazing Griffin"
    ],
    "publisher": [
        "Blazing Griffin"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Action"
    ],
    "achievements": 28,
    "positive_ratings": 175,
    "negative_ratings": 93,
    "price": 6.99,
    "description": "BAFTA award winning fleet-based RTS meets rogue-lite. In Distant Star: Revenant Fleet, build your fleet of up to 5 ships from a choice of 8 classes and traverse a randomly generated galaxy to defeat the Erebus Platform.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/335830/header.jpg?t=1555064119",
    "minimum_requirements": "OS: XP/Vista/Windows 7/8 Processor: Intel® Pentium® IV 2.4 GHz or AMD 3500+ Memory: 2 GB RAM Graphics: NVIDIA® GeForce 8800 or ATI Radeon® X1900, 512mb graphics memory required, Minimum Resolution: 1024x768 DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX Compatible Soundcard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Decided to finally review this game since the developers seem to have gotten it in the place that they want it to be, or close. And they did so through AMAZING and dedicated support, that every developer out there should take a page from to be frank. I want this at the top of my review because it's the most critical aspect to me--whether you like a game or not is subjective (aside from mechanical or design flaws), but whether the developers are worth their salt is not. These guys have done well to earn their place in the gaming industry, I think.  About the game itself and my thoughts. I grew up a multigamer, but my core has always been RTS. On that note, the closest gameplay I can associate it to would be something like Ground Control, stuffed into a roguelike progression system with scenario-based play/missions. Frankly, I loved the old Ground Control series as I tended towards a micro-focused RTS player for most of my time. And roguelikes are my favorite genre to play inbetween my mainstay titles.  Sure, this game has had issues upon release and things you can nitpick for a long time afterward. You can read other reviews to get pages upon pages about all of that. I soared through this game like 2-3 weeks after release and got my first win, after only 1-2 attempts on Elite difficulty. There were definitely challenges here and there. I tried to keep pausing to a minimum. But that was expected (imo) from someone with my background. However, the game was still FUN, and the game is even more enjoyable now. Seems more challenging now as well--and that's coming from someone who's played nearly every RTS since Warcraft 2 dropped. It's certainly worth sinking several runs into now, as you should in any roguelike. But bear in mind, I can only speak for Elite difficulty as it's all I've played.  I saw that the devs were initiating a massive campaign of overhauling the game back then, so I let it sit until now. Coming back to it, I can say it's now polished enough to be taken seriously by everyone. Give this title a purchase if you have any interest in squad size RTS at all. The pause feature makes it accessible for literally everyone. I feel like cramming RTS into a roguelike and making it a truly playable title was quite a feat, to be honest. I prefer this over the horde of twin stick shooter roguelikes that have been surfacing the past few years.  I'm hoping Blazing Griffin get enough support and have the desire to add more content to this title. I would love to see this type of game with the depth of replayability that most of the more well known roguelike titles have. How they should go about that, I'm not sure. But I feel like the potential is there. /end rant",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, it was really hard before the devs updated and tweaked stuff. It's still hard to finish but it's way better now. People should really retake a look at it. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun rogue-like-like with RTS-like-like top-down tactical combat with up to 5 ships in the player fleet vs a possibly obscene numbers of enemies.  Having stupidly-high APM isn't a prerequisite, because you can easily pause the action in Tactical Mode to issue commands as needed.  Game isn't 100% perfect but devs are actively working on quashing bugs and updating features.   Graphics 7/10: Ship/station and environment models are nice. Game has a very dark feel to it. As for backgrounds, I can say that they serve their purpose, but that's about it.  Sounds 10/10: Nothin' to complain about. Units have some weird alien-language responses but they don't get dull or repetitive, which is saying a lot considering just how much you're going to be hearing them.  Music 7/10: Changes dynamically when battle comes in. It fits the game very well, but I don't think I'd pick up an OST to listen to when I'm not playing.  Gameplay 7/10: Units handle well and there is a lot of challenge. Game is difficult, and gets difficult right on th first mission. You are going to need to stay on your toes - enter the Tactics Mode a lot if you want to survive. Game runs very smoothly, haven't had problems with glitches or crashes of any kind.  Some of the mission types feel like they need some more fine tuning - escort missions, especially, and the final mission doesn't feel challenging. Having a lot more mission types would be good.  The 'procedurally generated galaxy' only applies to the mission progression and options. As for the tactical maps that you end up doing the fighting in, you will begin to recognize them fairly quickly, as there aren't a huge number.  UI 4/10: Some of the tooltips are inaccurate. I still have no idea what 'supply' does. Hotkeys are not listed ANYWHERE - no menu lists, not even in tooltips that pop up - you are left to guess. Weapons/ships/systems don't come with nearly enough information to help you make informed decisions. Example: All I know about Nova Lance II and Nova Lance III is that Nova Lance III has one more I than II. I don't know how much more damage it does, if it has a different cooldown or not, nothin'. I'm just assuming it is better, because III is more than II. Keep in mind that none of this is gamebreaking by any means - in fact, they are minor annoyances only, but it's a lot of minor annoyances.  Overall 7/10: Devs are working hard at quashing bugs and seem receptive to player feedback - so, game is good now, I'm optimistic it will improve. Ideal price IMO is $10.",
            "review_score": "1"
        },
        {
            "review_text": "What is there to say about Distant Star: Revenant Fleet? Well when it was released I never gave it any thought and marked it as not interested. Then it appeared on sale and I read reviews and did research on YouTube and decided that, since it was on sale I will give it ‘n chance and purchased it. I started playing and man was I surprised. The gameplay is simple to grasp and the battles are tough. You move through space travelling to different sector in which you have to complete missions. If you win you are rewarded, but if you lose it is game over. You start from the beginning. But that IS NOT A BAD THING. The game is simply so much fun that I didn’t mind at all. If I have to sum up … this game is one of those “just another fight” type of games. It is a lot of fun and very, very addictive. Do I recommend it? It gets a BIG yes. ",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, good looking and fun!  Though it could be better balanced: i had no troubles for the first 80% of the game. Never got a ship disabled, nor did I struggle with any of the combats. Then it got increasingly difficult. First I liked the change, but soon it became rather frustrating. There werent enough repair station to repair all the criticals anymore, I had a strong fleet, though the enemies was always a lot stronger, which culminated in the very last mission on Aon. Up until then I didnt feel this to be like a roguelike at all (since I did not loose anything permanently yet), and then Aon pops up. Enemy fleet crushes me entirely. Back to main menu --&gt; utter frustration. Take this as constructive feedback. I still like the game!",
            "review_score": "1"
        },
        {
            "review_text": "In this game you manage up to five units (at least i think thats the max) using various abilities. You can also pause the game so it does not become to intense. I only played on the easiest difficulty thus far and failed at the final (and only) boss. However, from what i have seen i quiet like it, furtheremore the devs tweaked the misssion which made me fail my first run, which is nice.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game seems to have some mixed reviews, so I wanted to add a postive for it:  Very fun rogue-like game which is in many ways similar to FTL, except that you build a small fleet of ships without crew-member management. There are simple RTS battles in some of the jumps you make.   Graphics are simple, but attractive.  Sounds are good, but the music can get a bit grating after a while.  The game is difficult but manageable, although I am still struggling on the final boss. However, these type of games generally are hard, and recent balance patches reportedly have made it much more manageable compared to older builds (the end boss).  Overall, if you enjoy rogue-like games and/or FTL, then this game is definitely worth a look!",
            "review_score": "1"
        },
        {
            "review_text": "game is heavily undercooked , what is the difference between cruise missile 1 and cruise missile 3 ? how spider rockets differ from normal ones , no tooltips , not enough tutorials , looks more like beta then release .",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game.  Yes it is very hard, but I beat it when it first came out and was even harder than it is today. The challenge to do so made ultimate victory much more satisfying. It required me to really think after my failures about what to do differently,    You just have to adapt to the harsh realities of the universe rather than adhere to your whims.  You are the underdog in this story, you have to face superior forces and figure out how to prevail.  I recommend this game to people who enjoy a good challenge, and I also recommend it to people who have maybe never played such a difficult game and might not have ever felt the joy of overcoming them :-)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! spooky music and thrilling game play keeps you 'in character' all the time. I thought it was going to be another rts space game, but it just isn't. Awesome casual space fights with enough to keep you coming back for more. Favourited!",
            "review_score": "1"
        },
        {
            "review_text": "Ok, First review wiped, that wasn't good enough. Went back to it.  Music's great, visuals great.  Difficulty scaling could be tweaked IMO. Final battle is kinda nice, but I let my people die cause I'm too stupid to see the timer.  Would have liked a more FTL manner of the game pushing you forward, that's one thing I didn't like. Another thing didn't really like was that you couldn't shift your ships about your list (not too much of a game breaker.).  Random thing I found about the game: lying through your teeth to people has strange outcomes. 10/10 would lie again.  This game, kinda hard.  But like Durians, try it once, go away, and then try it again. Cause Now I like it, now I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "3 hours of gameplay to fail the final mission. With no replay function or backup they expect you to grind for hours just to try a new way to die. I like rogue-lite gameplay, but not when the grind leading up to a battle is just so bland and repetetive. Music transitions are awful. Get FTL, much more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I ahd fun but I do admit I wish there was a little more to it.",
            "review_score": "1"
        },
        {
            "review_text": "Seems kind of stupid hard",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine FTL. Then imagine if it was boring.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a stupid game. In fact I'm not even sure you can actually call it a game. I have more sophisticated games on my phone than this.  I don't know who the jokers were that posted good reviews, but you guys owe me some $$$.  I wouldn't recommend it and want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money. No redemable traits on this on.",
            "review_score": "-1"
        }
    ]
}