{
    "app_id": 336090,
    "name": "Sky Mercenaries",
    "release_date": "2014-12-16",
    "developer": [
        "PolarityFlow"
    ],
    "publisher": [
        "PolarityFlow"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Steam Turn Notifications",
        "Includes level editor",
        "Commentary available"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Bullet Hell"
    ],
    "achievements": 27,
    "positive_ratings": 76,
    "negative_ratings": 28,
    "price": 6.99,
    "description": "Sky Mercenaries - Fast paced action overdose with rpg elements",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/336090/header.jpg?t=1497341240",
    "minimum_requirements": "OS: Windows XP, Vista, 7 or Windows 8/8.1+ Memory: 512 MB RAM Graphics: 128MB graphics card, Screen resolution of 1024×600+ Additional Notes: 2 player local Co-op",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I don't know if this game is supposed to be an homage to old school shmups because it sure as heck doesn't tell you so.. or anything else which possibly could be of use to the player for that matter. It almost seems like this game tries to bite off more than it can chew, resulting in what feels like a watered down shooter that doesn't excel at anything.  I don't write negative reviews lightly (this being my second). I generally just don't bother with 'mediocre' or lower game but in some cases I do care. So from an almost 3 hour play session (which is more than lenient for this type of game) this is what I got from it.  - Damage Numbers: By default, this setting is enabled which may be 'fun' in the beginning but later on just serves as more crap and distraction on the screen and doesn't really add anything useful whatsoever. - RPG Element: I usually enjoy RPG elements in games when it's done right.. but it does absolutely nothing for me here. It feels like a boring linear treadmill which almost seems required to progress which is pretty absurd for a shmup. - Color/Absorb/Polarity: A nice mechanic popularized by Ikaruga but falls a bit short here. Players unfamiliar with Ikaruga will either have to stumble upon it, get it from the subtle one-time 'hint' in the game or read it from the achievement you get for switching colors.  To cut things short, I'll speed it up a bit.. The UI is unpleasant to navigate; in-game HUD is very bland; Hitpoints for the player's ship are localized to separate ship parts/drones which is useless because it's not like you have any real control of it; enemies often seems to have too much HP regardless if you 'specialized' for damage; and the bonus level seems to be bugged unless you're not supposed to move and tank sporadic rockets that sway towards your ship until you die because I can't imagine shooting all of them down whilst also trying to wittle down the 'boss' of it's seemingly infinite HP.  There's probably more minor grievances that I have with this game but despite of everything I just wrote, I would be okay with this game if it wasn't for the dreadful sound effects. I have never played a shmup that felt less satisfying than this one does. The sound effects are very bland to the point that there's no sense of impact when you shoot or kill an enemy ship.. not only is it unsatisfying to shoot and kill, it makes it somewhat difficult to tell where and when you actually kill an enemy. For a game that revolves around wrecking swarms of enemy ships and crafts, this makes for a very dull and boring experience.  But that's not all unfortunately because the horribleness of sound effects stretches even further.. Now I am not a rookie at these types of games but in certain levels it throws so much crap at you that I'd be surprised if you can come out of it unscathed. Calling it bullet hell feels degrading towards other actual bullet hell games so I usually like to call it 'bs hell' as that's what it is. In other words, you will sometimes get hit quite a bit. ..and when you're in the middle of taking all of those hits in a bullet infestation, it really.. really doesn't help that taking damage sounds like you're being smacked on the the side by a muppet.. or stung by a swarm of muppets for that matter. Because that's not a sound that makes you think you're in trouble or may be about to die. If it wasn't clear.. by muppet I mean a little puppet that makes a squeeky sound when you squeeze it. ..it's horrible. But on the flipside, after an hour playing listening to it your ears become immune and you'll start thinking that colliding with enemy spaceships only tickles you and you're immortal.. ..well, until you see your ship crashing down that is.  And with that, I think I have said enough. Honestly, I do think this game has/had potential but it just seems that it tries too much whilst the most essential parts of the game fall behind unfortunately. One thing I did enjoy was the music.. but for some reason it's random as heck which doesn't distinguish the stages/tilesets from each other and makes each level as forgettable as the last.. which sadly is also true for the game as a whole.  As a fan of this genre in general, I can not by the life of me recommend this game at it's full asking price. Perhaps the multiplayer/co-op could be fun, but alas like most of these games it's local only. And even then, I would advice just getting it on a sale because there's far better out there for your money's worth.",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: March 20 2015-- Thanks to SunBeamZappa for bringing my attention to an update that released for Sky Mercenaries, This new update has fixed issues with gamepad and joystick controls in-game. There is not an option to change the inputs yet but they seemed to work fine with a MadCatz fightstick. The game is much more enjoyable and really exciting on the faster speeds.    SEE EDIT:I would not recommend this to anyone wanting to play with an arcade stick as the controls are broken with one, as well as a gamepad controller. The announcments say this game has full controller, pad, joystick support, its just flat out wrong. Check the forums.",
            "review_score": "1"
        },
        {
            "review_text": "Brings back the good old days of fun....",
            "review_score": "1"
        },
        {
            "review_text": "Not Worth unless you like Bullt Hell-esque games",
            "review_score": "-1"
        }
    ]
}