{
    "app_id": 33600,
    "name": "Broken Sword 2 - the Smoking Mirror: Remastered",
    "release_date": "2009-12-02",
    "developer": [
        "Revolution Software Ltd"
    ],
    "publisher": [
        "Revolution Software Ltd"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 432,
    "negative_ratings": 51,
    "price": 4.99,
    "description": "‘Broken Sword - The Smoking Mirror: Remastered’ is a stunning update to the multi million-selling original. While investigating a ruthless drug gang, journalist Nico Collard unexpectedly comes across an ancient artifact.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33600/header.jpg?t=1485515152",
    "minimum_requirements": "OS: Windows 10 / 8 / 7 / Vista Processor: Pentium or equivalent Memory: 16 Mb Graphics: Direct X 5.0 compatible card DirectX®: 5.0 or greater Hard Drive: 600 Mb  Sound: Direct X compatible card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A great sequel which maintains the charm of the first game (same colourful characters, same witty dialogues) . A must have for any fan of the series.",
            "review_score": "1"
        },
        {
            "review_text": "The short version review is this: if you like the Point &amp; Click genre, you will most likely enjoy this.  What are pros for some people may be cons for another, so here are some general points to consider:  *Puzzles are the usual P&amp;C fare, meaning not always intuitive in terms of solution. If you already enjoy the genre, you already know this and it won't bother you much. If you are newer to the genre, you just have to remember the all-purpose 'click on everything' rule and 'combine your inventory with anything you can no matter how strange it seems' rule. There's nothing too farfetched.  *Voice acting is quite good for the most part and the interactions are fully voiced, which I appreciate. Sound and music in general is nicely done.  *Art is very cartoon-ish. That could be a selling point for somel; it certainly isn't for me. However, despite being sort of a snob about art style, I will say that it is very well done even though it's not a style I love. It in no way detracted from the overall game for me, and some people might absolutely love it.  *The story was good, taking our heroes into Mayan Central America this time. The end was a bit abrupt but did tie up the story nicely. The addition of some optional graphic novel content helps flesh out the gap between this game and its predecessor.  *There is a built-in help system for when you get stuck, which you can choose to use if you like (or can ignore, if you like!). The help is 'progressive hint' style, giving you the option to start with a very vague hint and work your way up to a detailed solution if you're still stuck. While some people consider this absolute heresy, others will appreciate not having to track down a detailed walkthrough for help on one small point.  *Play time is shorter than some comparable games. I clocked in at around six hours, plowing straight through and not getting too hung up on anything (I'm too impatient to wait too long before checking to see what I missed!). For someone not using any hints, it could probably take a couple hours longer.  So, I would recommend not only this game, but picking up the trilogy in a package if you don't have any of the games already. It's a great deal and definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "A Review Mostly for me so I know I’ve completed the story, as well as feedback on the game.  My Thoughts:- The 2nd Broken Sword game where a few improvements have been made to the art and the game itself, George and Nicole are back on another adventure this time to save the world. Just like the 1st game it’s a point n click adventure game with more puzzles. Has a Help system to give you hints on how to progress in the game although will spoil the achievement of you doing it for yourself.  Achievements:- N/A  What Could Be Added:- Achievements  Rating:- 7 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable romp that's not quite as epic as the first game, but the graphics are slightly improved and it's still an enjoyable adventure.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't competed the game yet but is great. This is my first point and click adventure I've ever actually played and I'm thinking about getting some more because of this one. If you like mysteries and adventure then this game is for you. I really recommend this game to anyone who wants to get into point and click adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "More of the same from Broken Sword. With no need to change an already strong formula, this sequel delivers exactly what you're wanting if you've played the first game: more of the first game. More wit, more charm, more places to explore, more headache enducing confusing puzzles and more mysteries to solve.   It is strange to say that opting for no-change over change is a brave move, but these days it is in gaming. So many sequels get it wrong and take away something many love for something or another many hate. So here we are. Broken Sword 2 is a braveish clone/sequel to an excellent game and is an excellent game by proxy.",
            "review_score": "1"
        },
        {
            "review_text": "This is an okay point and click adventure game, which took me around 9 hours to beat. This remastered edition does add some nice touches to make the story more cohesive, so it is worth playing if you liked Shadow of the Templas, the first (and still the best) game in the series.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play an old classic again.",
            "review_score": "1"
        },
        {
            "review_text": "I own the entire Broken Sword Series, the earlier series 1-3 on my phone and 5 on my computer. The Smoking Mirror is an excellent Point-Click Adventure game. I can't say enough good things about the entire Broken Sword series but if you're interested in intriguing and fun adventures, something that has some historical relevance and some taste of reality and fiction, then these games are well worth a try. Without spoiling too much, the destinations were very interesting, I love the two main characters in the story, the protagonists are believable and the intermittent characters and plots are allot of fun. I literally felt like I was watching a movie or reading a really good book. Lastly the game implements a quarry guide which helps you out in the stickiest of puzzles.   Highly recommended if you love Point-Click adventure games. ",
            "review_score": "1"
        },
        {
            "review_text": "Terrible story, puzzles were either too easy or too stupid. A lot of attempted storyline development with nothing coming out of it. Everything is realistic until the end, and then it turns out that a magical demon actually shows up and the world is saved by a dwarf. Yeah I spoiled you, but does it matter? Unlike in broken sword 1, where Nico is a well developed and cool character, Nico has been reduced to a ♥♥♥♥♥y girlfriend.   I'd give this game a 1/5 stars. Easily worst game I've ever played up to this point that actually tried",
            "review_score": "-1"
        },
        {
            "review_text": "Unless Broken Sword 2 comes bundled in with the Broken Sword Trilogy, I wouldn't recommend going out of your way to buy this. It doesn't have the same love and care the original Broken Sword had, the puzzles aren't fun they're almost frustrating and certainly poor. They don't make you THINK, they make you click around everywhere hoping.  The artwork isn't as charming, and the voice acting doesn't have same over the top appeal. The story is weak too. This is one of the few games that has honestly sent me to sleep while playing... while streaming... I pay my respects to the 2 people who seemingly sat and watched me play this from start to finish. Whoever you were.",
            "review_score": "-1"
        },
        {
            "review_text": "Great adventure game. The prefect game for a perfect relaxing evening.",
            "review_score": "1"
        },
        {
            "review_text": "Great follow up to the first one. Thought it was funny how they repeated certain characters as well.",
            "review_score": "1"
        },
        {
            "review_text": "The game is as intresting as the first one if not more so. Unlike most point and click games the first and second games keep you thinking. But if you get stumped as easily as I do theirs the greatest hint giving gift in the pause menu.",
            "review_score": "1"
        },
        {
            "review_text": "Second chapter of the Broken Sword saga, not good as first but still one of the best point-and-click adventure game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Semi Fun Adventure game. Predictable and easy. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Not a long game but is still fun :D It's not expensive and is a good point and click adventue game with a great story that contains funny characters XD if your bored from your main game (tf2, dota counter strike etc) check it out :D If your not a fan of point and click games then you should keep clear from it. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game but i only recommend it to people that like a puzzle. Broken Sword is a point and click adventure game filled to the top with puzzles. Broken Sword was originally on the ps1 and what did ps1 games give us challenge so only but this game if you have the balls for the challenge ahead. i give it 5/10 same review as my Broken Sword 1 and 3",
            "review_score": "1"
        },
        {
            "review_text": "Impressive game, and very good linux support!",
            "review_score": "1"
        }
    ]
}