{
    "app_id": 336060,
    "name": "Raptor: Call of The Shadows - 2015 Edition",
    "release_date": "2015-02-13",
    "developer": [
        "DotEmu"
    ],
    "publisher": [
        "DotEmu"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Retro"
    ],
    "achievements": 10,
    "positive_ratings": 211,
    "negative_ratings": 64,
    "price": 3.99,
    "description": "Raptor: Call of The Shadows is the most action-crazed, guns blazing, shoot ‘em up game you’ve ever played!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/336060/header.jpg?t=1447365599",
    "minimum_requirements": "OS: Windows Vista, 7, 8 Processor: Pentium 4 2.4Ghz Memory: 1 GB RAM Graphics: Intel HD Graphics DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Holy hell, I did not expect to ever see this game on steam. Its one of the long lost classics of the 90s.  Its amazing, the game itselfs is extremely long, with an amazing upgrade system to go with it. Missiles, rockets, laz0rz's, everything. Manage your currency and make sure to save your game! you will loose your progress if you dont.  However, for a '2015 edition' its extremely lackluster. There is literally no new features in the game, it plays like its exactly as it was 15 bloody years ago. Is that a bad thing? hell no! but i expected at LEAST 1080p 60fps support. According to my steam meter, its running at 24fps. The way this game runs however, you dont feel it. Its easily playable, and for $5 this classic is a steal, I reccomend anyone looking for a nostalgic, or oldschool experience, grab this game!'  I also need to mention the save system. Each save doesn't overright your last, it creates a new one. Tracking saves becomes a chore. This really is a lazy port, I really hope these issues are patched soon.",
            "review_score": "1"
        },
        {
            "review_text": "They straight up screwed this game up in this '2015 edition' of sorts so I can't recommend this version. Get the original DOS version that comes with the 3D Realms Anthology. The original is just damn great.",
            "review_score": "-1"
        },
        {
            "review_text": " 9/10  (pure retro)   'As awesome as back in the days - in '94.'   Raptor Call of the Shadows is a linear 2D top-down shooter, well known in the DOS century. RAPTOR was after  SolarStriker(GameBoy)  my favorite 2D top-down shooter, when I was a child. 21 years are a long time and still it just makes massively fun. The 2015 Edition is a bit misleading since this is no remake - but it works on Win8.1 64bit ;) One great new feature is the X360 controller support. One bad new feature is that the mouse sensitivity is way too high. You have to change it manually in windows or on your mouse, if it features dpi pre-settings.    Pros:  + it is RAPTOR 1:1 + great atmosphere + great gameplay + great graphics + great controls  =&gt; X360controller / keyboard / keyboard+mouse + great ost&amp;sounds + SAVE feature + pure retro   'Cons':  - ...it's 2015 - only 3 screen resolutions =&gt; 640x400; 960x600; 1280x800 - the sound quality is very low - no in-game control options - no trading cards   I would love to see more classical games coming to steam. ",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  + Twin Lasers FTW + Probably Easy + PROTIP: Touch those BUTTONS IN THE SELECT MISSION SCREEN FOR EASTER EGG ENEMIES.  Cons: - Save file bugs - BECAREFUL IF YOU DELETE YOUR SAVE. - Not Hard enough   Raptor - I played the special edition 'demo' from an Egames demo disk along with several other games, such as Speedy Eggbert, Demonstar, and Snake Arena. The Special Edition has Bravo sector fully playable, and the first three stages of Tango Sector. It has all weapons available, but Outer Regions and the rest of Tango Sector was out of reach.  Steam's release changed everything. I am able to play the rest of the content... well, actually, with more bugs that the special edition back in the 2000's. Either way, this game still plays well, till you hit the bugs, and achievement bugs -.-  Tango's Final boss is still awesome AS ****! &gt;:D        ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game allot when i was around 10 on a 333mhz pc :D, now i am 30 and i still play it. Its a timeless shmup and this version is perfect and i never expected this obscure game to come on steam! Instant buy for me. Controls are great sounds are great, settings are good. 20 years ago i never would even imagined it would still be out there today and i am sure the devs from this game thought the same back then :D. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I cant make much of an arguement to justify this release and call it '2015' edition. This is the 2010 edition with steam achievements and a different default key binding. With that said n done with, heres why its still a decent buy, and some of its drawbacks:  Its a classic 2d raster shooter with varied areas, an array of different enemies combined with a well used color palette and an arsenal to put america world police in the shadows. It does however have a few issues in this release: The 'HQ filter' that was introduced 5 years ago in the 2010 edition is just outright bad. In some cases it actually changes the size of the incoming enemy sprite in the name of smoothing out pixels. Its not a whole lot of a size difference, but enough to cause some overlapping(as an example I thought Id crash with an enemy several times, but instead it just passed through me on the side), and almost hilarious deforming of the artwork.   Since it being a raster shooter, it dont scale up well. To the uninformed, a raster means youre practically scrolling through a really tall picture, and that picture dont change resolution as you scale up, making the game look worse now 21 years after its original release. Really guys, its been 21 years, can someone sit down and re-make a bit of this? &lt;3  Other than the slightly bigger resolution option and HQ filter(both from the 2010 version), the only thing to add that 5 on the end is the achievement list. Its still a great game, and I still love it, but its no real upgrade to this classic title hidden in the numbers.  I also made my aquintance with a few bugs regarding the pointer, having it getting stuck in a mouse force field, sometimes this was only fixed by going back one menu.",
            "review_score": "1"
        },
        {
            "review_text": "Raptor certainly a Classic title all the way back to 1994.  What puts this game above other Shmups is in my opinion.  Huge enemy variety from airial enemys to the bosses all with different weapons and attack patterns, speed and how many hits they can take.  Destructible Ground elements, be it Vehicles, Boats, Submarines, Turret installations, or that City you just have to punch through to get to the boss.  Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Freeware classic back again, WOO!",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay and general sound effects are improved over the original.  The music however is completely inferior and poorly programmed (It doesn't repeat properly) compared to the original 1994 release.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh man, I was so happy to see this somewhere beside the dusty old box of floppy disks sitting in the corner of my closet.  Raptor is a vertical shooter of the sort that anyone who played arcade games in the 1990s will be familiar with. You shoot enemies, get money, upgrade your ship, collect powerups, and fight bosses.  It's pretty simple, but alot more challenging than I remember. There's probably a good dozen hours worth of gameplay here unless you're much better than I am. Check out some gameplay videos if you're not nostalgic, even though this has aged well, gaming has come a long ways.",
            "review_score": "1"
        },
        {
            "review_text": "this revew is not based on the game since everyproblem people might say thats bad about the port like joystick moveing in the menus and stuff was all there in the base game. no i am here to talk brefly about the port it's self and what it did wrong and there is 2 things that make me not want to play it and the first reson is the music. not only dose it not loop well it's also filter midi saved as wav files. that your proof right there. second is the mouse or rather screen size. you can move the mouse into the black area of the bottem of the screen with is not possible in the original game witch can lead to some confusing things like not knowing where your pointer is. if you can get pased thos then it's a good game but thos are 2 major fualts with this port. yes it added the settings from the setup program into the game it's self witch is nice but thats the only thing they did witch i like. yes i still know every dose comman sice i used dos and the old directory structure my dad set up and how i have it set up in dosbox. that should tell you something.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, Raptor is a fine game. I'm just puzzled how the 2015 edition came out worse than the 1994 classic edition (Also available on Steam). You should really buy that one instead.  I mean seriously, the 1994 version runs in DOSBox and somehow has better sound???? (???????????????????????)  And the achievements added are more an insult than anything else. I'm not one of those old man gamers that hates achievements on principle, but 'DESTROY A BOAT' as 1/10th of your achievements has got to be a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most enjoyable oldschool games I faced on steam.  If you are 20+ like me, you definitely played this in your past, or at least heard about it in the middle 90s.   This 2015 Edition will give you staggering air combat with good action and some nostalgia feeling, too.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much one of the last games of the dos era. It's been a long time since I had a 486 but this plays pretty much how it did back then. Good nostalgia trip.",
            "review_score": "1"
        },
        {
            "review_text": "Takes me back!",
            "review_score": "1"
        },
        {
            "review_text": "Made me feel like I'm 3 years old again. The soundtrack alone could make me cry of happiness... ",
            "review_score": "1"
        },
        {
            "review_text": "Those of us who played this years ago get it. But for everyone else I say don't buy it because you won't get it. Get it? Stab the thumbs down button you weak f***",
            "review_score": "1"
        },
        {
            "review_text": "whoa...browsing for a new game to buy and found this golden memories.",
            "review_score": "1"
        }
    ]
}