{
    "app_id": 336110,
    "name": "Bloody Streets",
    "release_date": "2015-03-12",
    "developer": [
        "Headless Wizard"
    ],
    "publisher": [
        "Headless Wizard"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Zombies"
    ],
    "achievements": 45,
    "positive_ratings": 92,
    "negative_ratings": 18,
    "price": 3.99,
    "description": "Bloody Streets is a brutal top-down shooter which will challenge you with areas swarmed by undead in a beautifully stylized and hand painted 2D world complemented by high energy rock music. How long can you survive the sea of monsters while pumping round after round of bullets?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/336110/header.jpg?t=1478265782",
    "minimum_requirements": "OS: Windows  7 Processor: 2.0 Ghz Memory: 2 GB RAM Graphics: DirectX 9 compatible video card with 512 MB (Pixel Shader 3.0, Vertex Shader 3.0) DirectX: Version 9.0 Storage: 500 MB available space Additional Notes: Standard Mouse and Keyboard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Bloody Streets aka  Yet Another Freakin Zombie Shooter  actually isn't bad at all. You're the Survivor, a man with no name, face, address, or phone number. You're the only person alive - aside from whoever pilots the helicopter at the beginning and end of each stage - in a world filled with the walking dead. Your mission? Kill  ALL  of the zombies. We're talking complete and utter zombie genocide. Of course, this begs the question: What next? Humanity has been wiped out (again), so who's going to re-populate the earth? The Survivor and... and...? I suppose that's just something we'll have to live with. After all, we caused the zombie apocalypse sooooo.  Oh right, this is a game review.  Each level is fairly simple. There are three waves, and you...kill all of the zombies. Aside from a selection of guns and a wicked knife, you can also use the environment to your advantage. Everything from exploding barrels to runaway trains will make short work of the undead menace. There is a scoring system that favors large combos as well as envirokills, but you likely won't give it much attention. This is mainly because there aren't any leaderboards. You could work towards an S rank in every stage, but the feeling of accomplishment will be far too fleeting.  No, the real appeal of this game is the absolute massacre on display. There aren't really any boss-fights or a complicated plot. You can start this game up, shoot through a few thousand zombies, and then go on with your day. It's purely in-offensive entertainment, and does enough right to keep you playing for at least an hour or two. Not once while I was playing this game did I feel like it needed something more, like an upgrade system or even a couple more types of enemies. Besides, who needs all that junk in the game, when you've already got giant spiders? ♥♥♥♥in' spiders man, I hate them.  So yeah, that's about all I can say regarding Bloody Streets. This game is disposable, and I mean that in a positive way. Some games create memories, some good, others you wish you could bury. Once you've gotten your fill of Bloody Streets, you'll probably forget it ever existed. Sometimes it's a good thing when a decent game can be forgotten. One day out of the blue, you'll smile and wonder why, but in your heart you'll know that it was because on a random day you played a pretty decent videogame, and it was pleasant.  Unfortunately for me, I remember every terrible game. It's like hundreds of chains dragging me into the abyss.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody Streets is an enjoyable top down shooter which is worth the price. All achievements are simply and easy to attain. Easy enough to recommend for those fans to who like this genre of gaming.  8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Colorful fast-paced top down mass zombie killing with lots and lots of blood. Everything you need to have fun!",
            "review_score": "1"
        },
        {
            "review_text": "this game is good if you like terrible games.",
            "review_score": "-1"
        },
        {
            "review_text": "Is a fun short game. The game is alright but my game was crashing after playing 4 maps.",
            "review_score": "1"
        }
    ]
}