{
    "app_id": 336280,
    "name": "Chronicles of a Dark Lord: Episode 1 Tides of Fate Complete",
    "release_date": "2014-12-19",
    "developer": [
        "Kisareth Studios"
    ],
    "publisher": [
        "Kisareth Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Great Soundtrack"
    ],
    "achievements": 46,
    "positive_ratings": 58,
    "negative_ratings": 28,
    "price": 0.79,
    "description": "The saga of the Dark Lord, Magus Drakhen Lee, begins in this 25+ hour long epic JRPG celebration of classic 16-Bit titles infused with a mature and darker story filled with intrigue from a very different perspective.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/336280/header.jpg?t=1447365653",
    "minimum_requirements": "OS: XP, Vista, 7, 8 Processor: Intel 1.6 Ghz or AMD 1.8 Ghz Memory: 1 GB RAM Graphics: DirectX Accelerated Video Card with 512 MB RAM and Shader Model 2 support DirectX: Version 8.0 Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "*Note: This was written before the 'Rebirth' update to the game that makes changes to the main story dialogue. I have not played it since this update, if I do, I will revise my review. For now, it will remain the same. This is a review of the game I paid for, played and that the devs were content with for almost six months.   TL,DR: Chronicles of a Dark Lord is an ineptly written game with somewhat tolerable combat. The story is cliche, the characters have no personality or diversity and the game's flow is extremely repetitive. The description promises a game that's dark, mature and complex, but what you get is juvenile, shallow and as dark as something like Naruto. Furthermore, even though the description promises that you'll get to make decisions that effect the game later that is not the case (aside from choosing whether or not to kill random NPCs).  -------------------------------------  First, I want to point out that one positive review on this page was written by  someone affiliated with the developers . Looking at some comments on their Desura page, it seems like this is not uncommon for them. Even if I liked this game this would leave a bad taste in my mouth.  Fair warning, there are SPOILERS IN THIS REVIEW.  Chronicles of a Dark Lord: Episode 1 Tides of Fate is the kind of game that gives RPG Maker games a bad reputation. It is one of the worst written games I've ever played. If an RPG is poorly written, it fails. This goes double for RPG Maker games, because the graphics are pretty standard across the board (some will have nice character portraits, the portraits in this seem to be generated in RPG Maker) and the gameplay is very rote JRPG fare.   Before I get into why Chronicles of a Dark Lord is so bad, I will talk about the few things I did like. The random battle system is very nice. It's not really random. There's a meter that fills up as you walk and decreases if you stand still. If it fills up, you enter a battle. There's lots of object hidden around in the environment. My love of RPGs has trained me to check literally everything. In this game it pays off and I like that. Finally, about halfway-ish through the game I found a hidden sword and piece of armor that was so over-powered I breezed through a lot of the game. That definitely helped me keep going. Also, the song during the end credits is pretty good. Marielle Thomas did a great job with it.  So, onto the problems. First, and most importantly, the characters have no personality. Well, they kind of do, but everyone is either quiet and serious or kind of goofy. There is hardly any distinction between your party members. Half of them even look the same. If I was forced to describe any of them it would be extremely difficult. That's not good. The characters should be diverse and interesting.   The main character, Magus, is the worst of all. No personality. Towards the end of the game, some characters have a conversation about how he doesn't show emotion. Guess what? That's not interesting. He's just kind of there. Everything interesting about him happened in the prologue and the text crawl between that and the main game. There's supposedly a conflict between the evil path he started down and his decision to not be totally evil. . .WE NEVER SEE THAT.  Magus is supposed to be so dark. The only way the game really shows us that in the main game is that we are given the option to randomly kill some NPCs. That's the problem with the game in general: where's the darkness? This is supposed to be dark and mature, but it's not. The game tries too hard to also be funny and light for it to be dark. For instance, there's one part where you're in a cave and there's a rumble. Magus' wife says something like, 'Either Magus is hungry or we better get moving!' The game doesn't have any of the edge it claims to have, but when you throw in lines like that, it's just goofy. Or, the conversation with a female NPC where the Dark Lord Magus says he'll come back later to pick her up so she can come visit his kingdom.  Here's a line that just blew my mind: 'She is going to cut my breasts off or something if we do not get out of her garden.' That's in the game. Or, how about this line which someone says before fighting one of the final bosses: 'I am Sapphire Darkwell. . .and I hate cats. It's because of YOU I have to institute a law against cats in Senefarria!' That is some dramatic and dark writing.  The storyline is really cliche. First, you're traveling around trying to rally people to fight an invading evil. Then, it turns out that (spoiler alert) the bad guys have a hidden agenda. They're trying to summon something to destroy the world. The dumbest trope in the world. Why do they want to destroy the world? What do they gain?  The script is super repetitive. I'm willing to bet 10% of the game is characters introducing themselves or being introduced. Magus seems to know every character he meets, but I don't. We usually don't really learn who they are, but we're supposed to care about them or be invested in what's going on. One character is recruited, then a side quest immediately becomes available where someone is trying to lure them into a confrontation. I don't know who that enemy was and I didn't care about what was going on. The whole game in general is repetitive. The bulk of it is: go to castle, talk to rule, get permission to go to next world map screen, fight boss, go to castle. World map screens come in two varieties: Castle and town and bridge/cave/docks or castle and bridge/cave/docks.  Then, there's just weird stuff that makes me think the game was written by a 13-year-old boy. All your party members are female, except for Magus and someone you get at the end of the game. Why? There's no good reason. Also, three of your party members are women who Magus has had sex with. His ex-wife, his current wife and their lover. That's right, Magus has a wife and together they have a lover. Why? How did this happen? What is the attraction? What is the purpose from a writing perspective? It doesn't add anything. None of the three seem to actually be in love, they just call each other 'my love.' I guess for them to seem like they actually loved each other they would need personalities. Is it so we know how not gay Magus is? Is it so he seems cooler or more awesome? I'm not a prude. If the characters were more developed, if any of it served any purpose, it would be fine. It doesn't, though. There's also a city entirely populated by lesbians.  There's also just mind-blowingly crazy things. There's a character named Crysta Aier. Later, someone mentions 'Krysta Aier.' I thought, 'Oh, a typo.' Then, we recruit Krysta Aier and I thought, 'Oh, I just remembered it wrong.' Then, you re-recruit Crysta Aier and have both Aiers. Then, I didn't know what was going on. Finally, by chance, while checking a bookshelf, I found out that one of them is FROM ANOTHER DIMENSION. That's right. People's dopplegangers just pop in from other dimensions. Then, Magus remembers about the time that happened to him!  On top of the insanely inept writing, there are other issues. There's no mouse control and muting sounds doesn't completely work. Also, even though the description seems to promise that you'll get to make decisions that effect the game that is not true. The only decisions you get to make are whether or not to kill some random, nameless NPCs.  I know that this review is extremely long, but the game is so flawed in so many ways I had to get it out (if only for my own sanity).",
            "review_score": "-1"
        },
        {
            "review_text": "Having played through and beaten this game (non-Steam version) before the Rebirth update, I wanted to see what the changes were. What I found were more detailed in battle character sprites, new music tracks, smoother gameplay, better dialogue, and now I get to have achievements and trading cards with the Steam version. It's a solid RPG. With a great story, challenging bosses, good combat, really good music, and memorable characters (especially Xiria) you can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 if only for Aspect. One of the most fun bosses I've seen in some time. Surprisingly fun and addicting.",
            "review_score": "1"
        },
        {
            "review_text": "Here are the pros, cons, and plot of this game: \\ Plot: Magus Lee was the child of Exodus Lee, who was in war with another kingdom. Magus was desperate to lead his father's forces in thier final push against their foes, but his father, being a Dark Lord, was cruel and belittled Magus. He denied Magus this chance, so Magus took matters into his own hands, and went to the battlefield. There, he confronted his father, and as they argued, the Dark God gifted Magus incredible powers. With this power, Magus killed both his father's and his father's enemies within seconds. He then banished his father to another land, and took his place of Dark Lord. Within the next few years, Magus took over many lands, but was soon defeated in a battle. From this, the Dark God took his powers away, leaving Magus helpless and weak. And now, he is rising in power again....   Pros: I somewhat enjoy the difficulty of the game. If you don't play just right, you'll need to grind and farm XP and Gold to buy potions, weapons, and armor. I also enjoy the idea of playing as an evil being, and how he is fighting another evil. With this, I enjoy how combat is played out, and how there is a random encounter meter in the open world. Finally, I like the dark humor in the story.  Cons: I dislike how much I have had to farm to get powerful enough to fight bosses, and I also dislike how magick users don't have as much MP as I would want and need to keep reviving and healing allies. Even with the humor, I don't like how it ruins the Dark feeling in the game.  Final Thoughts: I would recommend this game. I like how it runs, and how it feels. For those who want to try this, I recommend you buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I think I'm getting sick of RPG Maker games.  The outdated graphics, battle system, and overused stock items, characters avatars, etc. gets to be quite boring over time. It's also worth nothing that the majority of RPG Maker games do NOT support Steam Overlay, so you can't even SEE the achievements you earn as you earn them, and you need to alt tab to see any messages. This is worth skipping games in the engine for that reason alone unless your not very social or don't care about Achievements, but I found this to be a negative. I generally only play these games for the battle system, so I'm not really going to say much about the story, but the battle system is rather generic. The problem I have with this game is that all you do in battles is use special moves and heal. As your team levels up, you will begin to do insane amounts of damage in the 1000s which means any weak attacks is a waste of time. The flow of the game is basically going from one town/dungeon combo to another, fighting about three of the same enemies in boring dungeons using your most powerful specials, and buying ether to keep the MP up. You will get a flock of similar characters (almost all female) to join you as you progress, but you will eventually find that only some of them are strong enough to invest your time in. I did read a lot of the story, but I found it to be rather boring. The music and sound effects are nothing special either. I never once considered this game to be fun, exciting, or creative. There are better RPGs to play, using better more updated game engines. Don't waste your time or money here like I did. ",
            "review_score": "-1"
        }
    ]
}