{
    "app_id": 33620,
    "name": "Crash Time 3",
    "release_date": "2009-11-25",
    "developer": [
        "Synetic"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Action",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 228,
    "negative_ratings": 64,
    "price": 3.99,
    "description": "Like its predecessors, Crash Time 3, the new installment of the well-known action racing game series, offers varied gameplay in top quality. The German game forge Synetic has once more taken the graphics engine a significant step further.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33620/header.jpg?t=1447352736",
    "minimum_requirements": "OS: Windows XP with SP2, or Windows Vista with SP1 Processor: Athlon 64 3200+ or Intel Pentium 4 - 3,2 GHz or better Memory: 1 GB RAM (2 GB RAM for Vista) Graphics: DirectX 9.0c compatible 256 MB graphics card DirectX®: DirectX 9.0c (November 2008) Hard Drive: 4.2 GB free hard drive space Sound: DirectX 9.0c compatible sound card Supported Graphics Cards: AGP 8x or PCI Express ATI Radeon X800 or better nVidia GeForce 6600 GT or better Video card must support ShaderModel 2.0 and hardware T&amp;L Not compatible with integrated graphics solutions, in particular laptop computers.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Have you ever picked up a game from a bargain bin, back in the days before Steam sales, just on a whim? Out of a little pool of obscure titles, picking up one you've never heard of, and giving it a shot just because you can, and it's cheap. And sometimes, it'd be mediocre, or broken. But sometimes, you'd end up with an awesome experience that you'd never have come across otherwise. This game, in my opinion, is the latter case.  It's a budget title, sure. That shows through in quite a few occasions, be it skyscrapers abruptly appearing with a low draw distance, or the hard-to-place voice acting. But as far as outright fun goes, the game only spends the first half pretending at all that the story is anything but an excuse to put you in increasingly preposterous vehicles and doing awesome things.  Many game mechanics are introduced, and some instructions seem to be outright missing from the game (when tailing someone in the open world, for example, you must destroy their car when the timer runs out, despite no hint that you should do so unless you fail to). But overall, this is an arcade racer at the very core of it. Some control issues (those of you using 360 controllers must use the D-Pad to scroll through menus), poor design choices (you must go back to the menus to go back into the open world when you've finished a mission) and strange missions (collecting tickets from cameras to pay off collateral damage costs?) hamper the experience a bit, but the core racing and pursuit is fun.  There is a point where the main story stops taking itself seriously. You will know the exact line where this happens. At that point, it becomes much, much more fun. Treat it like a campy romp through the Autobahn, with the excessive driving of an 80's TV show and the pyrotechnics of a Michael Bay movie, and you'll get exactly that. And a monster truck. You also get a monster truck. So there's that.  You unlock more tracks and cars by playing through the game, and while there are plenty of street races on the open highway, there are also legitimate race courses, which add a nice variety to the overall experience. You can take on races with undercover cop cars, tuners, a Formula 1 car, and armored trucks, so you can make any race as intense or as preposterous as you'd like. I can't vouch for the multiplayer experience, having yet to try this with someone else, but from my single-player look at Single Race mode, it seems pretty solid. Reminds me of the classic NFS games, especially with mods that let you drive firetrucks and such.  In short, a surprisingly intense thrill ride on the cheap, with some design quirks here and there that may strike you as odd, but aren't nearly bad enough to make this game hard at all to recommend. Also, cool original soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Got it for $2.49 on the recent Exploration Sale.  Voice acting might be terrible, and the missions may not seem like much to most people. However, it's fun to explore the environment, and the game doesn't crash or lag as often. (You can also change up the lights in the MOX files for the cars, traffic, and city objects to your accord as well with the right software [via.  eleven-games.net ]).  Overall score: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game if you like Physics fun and destruction, aswell pursuits and racing. I would say there's bether driving physics in this game than Grand Theft Auto 5. For what your paying that is pretty good, story line is pretty linear, it is fun sandboxing and just screwing around.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, it feels like a car crime simulator if that makes any sense... It's all about crimes in a reality driving form... Obviously like most driving games are not like GTA V how you can exit your vehicle at will. This game takes it to the next level despite the unrealistic shooting-out-of-the-car concept but, the physics and controls work flawlessly. I love the 2nd Person mode because in a real life scenario you are driving the car, and the view of that, is exactly like 2nd person... Now what this game has an advantage over most games is that you can add your own music to the game... All you have to do is simply convert your music to a .MP3 file and click and drag the file into: OS (Operating System) &gt; Program Files (x86) &gt; Steam &gt; SteamApps &gt; common &gt; Crash Time III &gt; My Music | Thats how you listen to your own music in Crash Time 3, I think it's a unique feature, I just felt the need to mention it to you guys :D Overall I will give this game a 10/10!! Great job Synetic GmbH for making a really good game...",
            "review_score": "1"
        },
        {
            "review_text": "Very cool 'Cops and Robbers' game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ok. it's kinda boring but it beats nothing.",
            "review_score": "1"
        },
        {
            "review_text": "Undeniably awful. I don't care how cheap it was, still not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": " What a piece of f*cking dog sh*t!  This game is even worse than Crash Time 2, and where the f*ck is Crash Time 1!? OBLIVION! Cause this series is A*S!!!  The narrator sounds like he want's to kill himself and is very un-interested in this filth. The driving sucks, the gameplay sucks, EVERYTHING SUCKS!  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "FUN FUN FUN, after playing some simulators then a little fun with this game is veeeeery nice",
            "review_score": "1"
        },
        {
            "review_text": "this is such a fun game i would reccommend if you love destruction and cars PLUS cheats to unclok every car in the game scout is the apc scout plus infinite nitro= the fastest dedliest moving thing on wheels",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why but i enjoy doing stunts in this game and getting outside the map and of course playing with my friends (using cheats to be able to go freeroam).",
            "review_score": "1"
        }
    ]
}