{
    "app_id": 336380,
    "name": "Catmouth Island",
    "release_date": "2014-12-31",
    "developer": [
        "Colonthree Enterprises"
    ],
    "publisher": [
        "Colonthree Enterprises"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 39,
    "negative_ratings": 32,
    "price": 0.79,
    "description": "It's a relaxed, laid-back episodic 3D point-and-click adventure game set on an island group in the middle of the pacific! Yay! Hooray!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/336380/header.jpg?t=1447365662",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III Memory: 512 MB RAM Graphics: On-board graphics chip DirectX: Version 9.0 Storage: 120 MB available space Sound Card: On-board sound chip Additional Notes: The game was meant to run on toasters but sadly our game engine wasn't. There might be occasional stuttering in the menu after start-up.",
    "recommended_requirements": "OS: Windows 7 64-bit Processor: Over 1 GHz of CPU power Memory: 1 GB RAM Graphics: Dedicated gamer video card DirectX: Version 9.0 Storage: 150 MB available space Sound Card: Dedicated sound card Additional Notes: If you want the nice shadows, blur and anti-aliasing consider having a good video card.",
    "reviews": [
        {
            "review_text": "Catmouth Island brings me back to the days of N64 games in terms of visual style. Along with a great amount of NPCs that make you really feel like you're a part of the life in Catmouth Island and each with some pretty unique dialogue. Over all it's a great game with some awesome level design and great immersion.",
            "review_score": "1"
        },
        {
            "review_text": "Mostly forgettable. Can I recommend playing it? No. Is it worth it at $0.24US? Yes.  After reading the reviews, I tried to go into CI not expecting much but I couldn't help but hope.  The graphics while being low poly actually made a refreshing change. Not since Jak &amp; Daxter have I been impressed at the depth of field in a game. Also interesting graphically are the puffs of smoke from the cursor and the way walls of entered buildings drop comically from the sky upon leaving.  There is a *lot* of walking in this game. While it does make the world seem actually big and possibly more realistic, it gets tedious very quickly. You are given a teleport option between sites but that takes little away from it. Coupled with the unusual camera angles that can only be rotated left and right and not up and down, it makes a short snacky game into a multiple visit affair. You can at least click on things far away and the pathfinding will take over for you, making treks down mountain paths a chance for a player break.  As a side note, I like how when you run for a long time, Mya gets out of breath.  The humour while not awful is mostly forgetable. It's like a family or PG movie in that there's quite a few adult humour bits that should fly over younglings heads. Plus, toilet humour (literally too)!  [The store page said 'There's occasional swearing and coarse language...Therefore it is not suitable for younger players' but I honestly can't remember anything that bad.]  The puzzle solving is a little odd. Most puzzles are solved for you if you have the correct item. So it's mostly just a bit of back-and-forth running about. Which does hurt you once you've forgotten where things are. There was one story puzzle that (AFAIK) involved trail-and-error.  There also seems to be a lot of things missing or at least alluded to. My guess is it's either teasers for the next episode but it could just be bad design.  My complaints: The 2 mousebutton thing to see interactive objects is really annoying. Can't we have a keyboard shortcut? There are no audio/volume controls. Only one save slot available You had to use the toilet twice to get the book?!? The game is relatively short and there's a promise of sequels but I doubt any will exist anytime soon. The ending took WAAAY too long that I missed the top of the house. I had to play a game on my phone to suffer thru it. I thought at the time it would have been perfect to play the credits over, so when the credits played straight afterwards, I was utterly disappointed.  To reiterate, if it gets down to 24c and you have the patience, pick this game up. For anyone else, I can't say you'd be missing much.",
            "review_score": "-1"
        },
        {
            "review_text": "This games are OK. It has the graphics and the game play. Very good.",
            "review_score": "1"
        },
        {
            "review_text": "played for about 20 min, didnt care for it... moved on to next game :(",
            "review_score": "-1"
        },
        {
            "review_text": "Boring point and click puzzle adventure with cellshaded graphics",
            "review_score": "-1"
        }
    ]
}