{
    "app_id": 336610,
    "name": "Outcast 1.1",
    "release_date": "2014-12-18",
    "developer": [
        "Fresh3D"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Classic"
    ],
    "achievements": 172,
    "positive_ratings": 384,
    "negative_ratings": 35,
    "price": 4.79,
    "description": "Outcast 1.1 is an enhanced version of the critically acclaimed action-adventure game developed in 1999 by Appeal for the PC.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/336610/header.jpg?t=1549609852",
    "minimum_requirements": "OS: Windows XP SP2, Vista, Windows 7, Windows 8 Processor: 1.2 Ghz Processor or higher Memory: 1 GB RAM Graphics: Generic DirectX compatible card (compatible with DirectDraw 8) DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX Compatible SoundCard Additional Notes: The game does not require a high end Graphics Card as the rendering is done by the CPU. Compatible with Xbox gamepad (recommend)  or Direct Input 8 Controllers.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is amazing and if the developers can get enough money for an HD reboot then it would surely be a top game. It already is in terms of gameplay, however the graphics are lacking. I always find myself completely immersed when I play this game for some odd reason, you just keep wanting to know more about the game world and get further in the story.",
            "review_score": "1"
        },
        {
            "review_text": "Finished the game yesterday, about 15 years after my first playthrough. I tried to play the game a few times over the last decade but compatibility issues and resolution limitations were a big deal breaker. This 'remastered' version is fantastic and it's incredible to see how this game is still beautiful and addictive after 15 years.   A few con's: - Bugs: I encountered quite a few bugs. Most important: every second time i want to use my gaamsav it doesnt work, after a few hours the game keeps crashing every 15 minutes to my last savegame, graphics glitches in conversations - I played the dutch version and some conversations didn't appear or parts of the GUI were incomplete. For example: i can only see the first few words when i check my notes - Camera makes it sometimes difficult to see environment under you - Draw Distance is pretty low, this makes objects pop-up a lot   Pro's: + Story + Artistic design, beautiful environments  + Music and voice acting is still a lot better then most games today + So addicitive, you always want to finish that one last side-quest and end up still playing 4h later + Compatibility with modern hardware, high resolutions supported + Developers is active on the discussion board and fixes bugs almost instantly! + They are adding achievements for this game, nice addition!  I always considered this to be one of the best games I have ever played. This playthrough just confirmed that it still is. Everybody needs this classic in his library, even if it is just to support this dev.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this is still the best game ever made. Here is why.  It may be old but the game is still fun and exciting. It has a enganging and epic story. Getting the talans to support you in your endeavour takes time but it really helps making Adelpha a believeable world. Also you can actually ask your way around to find important NPCs, which I would like in many modern games instead of following a blimp on the map.  And if you play it, just wait until you get to the city of Okriana. Then stop for a moment and just catch the atmosphere of the city, which is one of the most convincing simulations of a living city. I have yet to find a modern game which does that, GTA has the dome in which the player moves and some people/cars that surround him and AC has the same crowds always treading the same paths, so these never felt convincing, although I like these games too.  Other fond memories include the regions of Okasankaar, which back then had the coolest water/ocean effects or the region of Okaar with its forest, where things were actually falling from trees. You could really see the effort and passion the people who created this game have put into it to create a convincing and living world.  Also the game gets very good support by the devs. You should definitely play it.",
            "review_score": "1"
        },
        {
            "review_text": "Ah, the nostalgia! What a classic of its time, unfortunately not successful enough for Infogrames (now Atari) to finance a sequel. I gladly remember being addicted to the game and being a regular member of the Infogrames forums back in the day, being part of an awesome community and helping a lot of people with the many secrets and and complexities Outcast had to offer.  The voxel engine was and still is a curiosity, resulting in a natural, non-blocky environment. While the textures are quite low-quality compared to today's standards, it is still a decently looking game. The high resolution of the remake helps with that. I am still stunned by the music and find myself regularly humming it while traversing the beautiful landscapes.  I would claim the AI is still up to today's standard, the enemies seem smarter than in Skyrim (that's not saying much, but it's something). And the population with its diverse day-to-day routines make up for a believable world, which was revolutionary back then and holds up to this day.  The remake has been well done and deserves - unlike other so-called 'remakes' - its name. The developer did a good job and even fixed some long-standing bugs. The introduction of the achievements was a really good thing: It highlights not-so-obvious sidequests that many people missed when the game was orginally released.  If you can live with a few quirks here and there (the game is 16 years old after all!), I can recommend Outcast 1.1 from the bottom of my heart. A dirt cheap price for an atmospheric experience many modern games aren't able to deliver.  Immerse yourself into the world of Adelpha and enjoy :)",
            "review_score": "1"
        },
        {
            "review_text": "Even though the graphics are crap, it's one of the best games ever created. The story is unique and you care about the Talan people. The music is beautiful and haunting. Do not play this if you want good graphics. Play it for the awesome story and characters. Play it for the humor.",
            "review_score": "1"
        },
        {
            "review_text": "This review is a tricky one. I say this becasue I haven't really played much of the game yet, other than booting it up now and then to see the improvements brought to us through almost daily updates. When I say almost daily, I mean it literally, almost every single day.  This game is already reknown as a good game, and has been for a long time. It's issues lately up to and including this release, is the game wasn't designed originally to be very future-proof. Until this release, you needed an old PC, or a lot of tweaking to get it platying proper. This is no longer the case, thanks to the 1.1 version and the hard work being put into it.  I tried to get this game working for years on an old physical copy, always getting just far enough to get interested before hitting a wall of crashes or bugs. So when I seen this on steam, I bought it on Day 1. Was it worth it? Hell yes it was! Here is why:  The *new* developer, has worked and continues to work harder than any other developer releasing an older game on Steam and bringing it back to life on new PC's, than anyone else ever has.Seriously, this dude deserves a medal.  Like I said, I havent played that much of this version. Mainly, because the updates are so fast and so often, I'm holding out as long as i can for the pinnacle of a gaming experience we all know is coming. Every day we get closer.  So yes, BUY THIS GAME, for no other reason besides DEVELOPERS LIKE THIS NEED OUR SUPPORT. Well.... there is one other reason - the game is a great game from a great Era.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game, enthralling atmosphere and amazing soundtrack! The graphics (which were mind bendingly good back in the 90's) still hold up really well today, especially considering the graphics engine doesn't use your GPU one bit, but instead uses your CPU.  I remember having the demo of this from back when I was a child, I saw it on the front cover of PC Gamer and couldn't wait to give it a whirl, although the demo was short (but sweet) I would play it over and over as I was so immersed.  And now moving on to 2015 I can relive that experience again but with proper widescreen resolution.  The love that Fresh3d is giving this game is impressive, Since the release they have released patch after patch which have improved the game vastly, The game is close to perfection now, a few more patches and I believe it will be pretty much 'fault free'.  So do I recommend this game? 100% YES!!! If you enjoy good atmosphere set in a fascinating world with one of the best soundtracks ever known in a game then I say you should buy this game. If you're still unsure, look up some gameplay videos on YouTube, stick on headphones while watching... But imagine how much more fun it would be if you were controlling the character exploring that strange world.  ",
            "review_score": "1"
        },
        {
            "review_text": "THIS is the game that made me a life long gamer.  ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome classic.",
            "review_score": "1"
        },
        {
            "review_text": "- You can pick and sell dinosaur sh*t which called gorgor zort (zort means sh*t in their language) - You can kill everyone with dynamite and the folk will still love you - When you burn a person with your flamethrower you can still speak to him, he's burning and screaming and falls to the ground, but he will still talking to you before he die  Its not only the best game i ever played, you can create so many funny bugs and try other things to troll people in this game.  And there are so many dialogues for playing good or for being an assh*le.  You will definitely not get bored by this game.",
            "review_score": "1"
        },
        {
            "review_text": "There's a small number of games which I've revisited numerous times, and Outcast is one of them. When it first came out, it was a gorgeous game - but the graphics were highly reliant on a powerful CPU, which meant that a lot of people couldn't actually run the game, even at its ridiculously low resolution (even at the time). As a result, the game didn't go on to become a commercial success despite being widely praised otherwise.  By the time I first laid my eyes on this gem a few years after it came out, the average gaming PC had become able to comfortably run the program with no real issues, and boy, it wasn't just a gorgeous game (despite the tiny resolution), but also an incredibly immersive one. In this game you end up exploring what was at the time a vast and expansive world with several different regions, inhabited by the Talan - an alien species - as you try to save both this world and your own (the Earth) after an experiment has gone terribly wrong.  The world is immersive, the lore draws you in, the characters are memorable and the story is satisfying. It is not a flawless game - movement can feel a bit clunky (especially jumping/climbing), there are a few ways in which you can cause bugs which prevent story progression (most notably by going to areas you're not supposed to go to early, though that's fairly difficult to do) and there are a few (very rare) situations in which you can be stunlocked until you die by some of the most elite opponents (though good planning can avoid this). However, all in all, this game was (and still is) a tremendous success, and comes highly recommended.  With Outcast 1.1, a number of the bugs related to CPUs have been fixed (a too fast CPU could break certain parts of the original game) and it's finally possible to play the game at a decent resolution. Be aware however that this game is very demanding on the CPU (even now) when played on higher resolutions. It's voxel-based graphics are rendered by the CPU, not by the GPU, so if your game is underperforming, consider lowering the resolution a little.",
            "review_score": "1"
        },
        {
            "review_text": "Help, this is my first ever RPG I have played and I loved it. But now I struggle with the keys. I do not know how to safe the game. Have been told to use the left mouse klick or left control while holding the gaamesaave in my hand. But still it does not work. Has anybody found a manual for the use of the keys..?",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite game on earth. The storyline is awesome, the humor is great, the gameplay is addictiv.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best game I have ever played! Amazing storyline and symphonic music. I played 15 years ago, but still impressed with this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic, i had it when it first came out never got to finish it, saw it on steam an just bought it an its still got it,.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I'm loving it.",
            "review_score": "1"
        },
        {
            "review_text": "The steam controller feels like it was made for this game.",
            "review_score": "1"
        },
        {
            "review_text": "I spent a few hundred hours playing this as a child. What a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This is simply one of the best games ever created. In my Top-3 (along with Gothic 1 and Drakan: Order of the Flame). I played it 100+ times since 1999, and I still want to return to this world. I also supported kickstarter for HD-remake in 2014.",
            "review_score": "1"
        },
        {
            "review_text": "still unplayable, they should have made a remake.",
            "review_score": "-1"
        }
    ]
}