{
    "app_id": 336630,
    "name": "Crash And Burn Racing",
    "release_date": "2014-12-09",
    "developer": [
        "Lunagames"
    ],
    "publisher": [
        "Libredia"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Indie",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 28,
    "negative_ratings": 15,
    "price": 2.09,
    "description": "Crash and Burn Racing is a high impact racing game. You will be put behind the wheel of crazy vehicles that are fitted with over-the-top weaponry and power-ups such as a nitro chargers, bombs and homing missiles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/336630/header.jpg?t=1528294334",
    "minimum_requirements": "OS: Win 8, 7, Vista, XP Processor: 1 GHz Memory: 1 GB RAM Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a simple endless run game. Nothing is special about this game. There is no achievements, steam cards, multiplayer, leaderboard, etc. Just as the title said 'Crash and Burn Racing', you drive a racing car to crash and burn other cars.  But it's still fun to play when you're bored.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you do not have to accelerate, the only thing you have to do is dodge other cars and collect money, powerups or bombs/rockets. The bombs and rockets can be used to destroy other cars and the money is needed to upgrade your car.  At first 'Crash&amp;Burn' looks like a nice little casual game but after a while I was dodging cars for, what seemed like 30 minutes, in fact it was only 10-15 minutes but long enough and way too easy. I don't know how long the first level would take but it was enough for me to just crash and quit the game.   Crash &amp; Burn is not a bad game but it could be a lot better. Adding steam achievements and leaderboard would already be a great improvement but it would not be enough to keep playing this game for hours. I do not care about buying new car colours or upgrades in a game like this.   Perhaps I will play this game again in the future but right now I don't see that happening.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Cool little arcade racer. Explosive action and cool optimisation options for your car. The game is simple in terms of controls, but getting a good high score is challenging. Shame there is only one track though. If you are looking for a serious racing game like GT or Forza I wouldn't recommend this game, but If you like simple arcade racers, this might be right up your alley.",
            "review_score": "1"
        }
    ]
}