{
    "app_id": 337150,
    "name": "Sentinels of the Multiverse",
    "release_date": "2014-12-22",
    "developer": [
        "Handelabra Games Inc."
    ],
    "publisher": [
        "Handelabra Games Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Card Game",
        "Board Game",
        "Superhero"
    ],
    "achievements": 84,
    "positive_ratings": 644,
    "negative_ratings": 103,
    "price": 6.99,
    "description": "You've never played a comic book like this! Control a team of heroes battling evil villains across dynamic environments. Play out epic comic book battles come to life in this exciting adaptation of the hit card game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/337150/header.jpg?t=1553007575",
    "minimum_requirements": "OS: Windows Vista SP1+ Processor: SSE2 instruction set support Memory: 2 GB RAM Graphics: DX10 (shader model 4.0) capabilities, 1024x768 resolution DirectX: Version 10 Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Digital version of an incredibly addicting tabletop game with tons of replay value. The UI is smooth and easy to use, and all the cards are very readable at different resolutions. The ability to active/use cards without having to double-click each one is very handy once you get used to the game and learn the cards by heart - which will happen if you use a hero long enough. The music is great as well, which was a pleasant surprise, and fits the superhero theme wonderfully. The inclusion of unlockable variant promo cards is a great addition, because each varant changes up the base power of the hero, or in the villain's case can really change the way the villain plays. This adds even more variety and combinations to a game already full of hundreds of hero/villain/environment combinations. And with the expansions inevitably on their way, there'll be even more. The tutorial is also really well done so you don't have to worry about being familiar with the tabletop rules before hand. It really walked through everything you could possibly need to know about how the game works, which is nice for those who've never played before.  On the flipside, the only thing I don't really like about this digital version is the lack of online multiplayer, although it is coming in a future update. The game does, however, lend itself really well to playing multiplayer locally by simply sharing the computer. And of course being able to play the game solo when you're craving a Sentinels fix is really where this game shines. Controller support would also be nice for playing on a TV, but that is also coming down the pipe eventually. Handleabra games is really doing a nice job of making the transition from physical boardgame to digital version.  As for the gameplay itself, it plays exactly like the tabletop version. Each player takes control of a superhero and teams up to take down a villain. Each hero has it's own unique deck of cards with wildly varying playstyles between each hero. Legacy, for example, is the paragon of justice who uses his cards and abilities to buff and defend his team of heroes, while someone like Tachyon uses her super-speed to burn through her deck drawing and discarding cards, many of which do more damage based on how many specific cards are in her discard pile. Each hero's deck of cards fits the hero's theme and superpower wonderfully, making for a different experience and strategy with each hero.   However, the villains also have a deck of cards full of minions and nasty super-powered attacks to take down the heroes. At some point during the game the villain's card will trigger an effect that causes it to flip over, which changes up the mechanics of how the villain plays - and sometimes changes the max HP the villain has. Plus each villain has a nemesis (or multiple ones) attached to it, which means the villain does extra damage to his nemesis, and vice-versa. And you can't forget about the environment you're playing on. After the villain has had his turn and all the heroes have gone, the environment itself gets a turn and draws a card from it's deck. Sometimes the environment deck helps the heroes out in someway, most of the time it does horrible, horrible things to the players like having pterodactyls steal all of your equipment. Each enviroment has it's own gimmicks to it's deck. Megalopolis has lots of city hazards like a speeding train that can damage both heroes and villains, or cops that show up to aid the heroes. Meanwhile something like Wagner Mars Base has a self-destruct timer, which if it reaches the end kills both the heroes and the villain and everyone on the Mars base ending in a draw.  The game has hundreds of combinations, as each time you play you pick a villain, and environment, and anywhere between 3-5 heroes. Everytime you play even just changing one of those from the previous game can really affect the outcome of the game and change the strategy you'll be using. The game has so much variety, and the rules are so simple to pick it up, that it makes itself very addicting. You can play dozens of times and still be surprised when something crazy happens that flips the current game on it's head. I really can't recommend this enough.",
            "review_score": "1"
        },
        {
            "review_text": "A faithful adaptation of the card game, except you don't have to have friends in the same place to play it. Or any friends at all. I'm not here to judge.  Pros: - Much less expensive than the physical game (the physical Core Game alone is $40), even without the Steam sale. - Online multiplayer is a thing. - A buttload of possible hero/villain/environment combinations to keep things fresh (with the DLC- see below.) - Keeps track of minutiae like which effects are active, damage calculations, etc. for you- a godsend if you're playing with one of the more complicated characters. - Pretty nice interface- bold, colorful, and you can tweak the length of animations and how long cards are shown to your needs.  Cons: - I bought the core game and Season Pass at the same time so I haven't seen it, but word from other reviewers is the game is pretty pushy about selling you the DLC. And you *need* at least some of it if you're going to play multiplayer or Weekly One-Shots. (Plus, all the really interesting villains are in expansions.) - Not a lot of people in multiplayer, though the Steam sale may change that. - Minor interface quibble: cards attached to characters (e.g. most of Captain Cosmic's constructs) kind of get lost in the shuffle.  edit: turns out there was a setting for some of the interface stuff that bugged me, right on",
            "review_score": "1"
        },
        {
            "review_text": "I leave this as a reluctant No, because while the gameplay is both accurate to the tabletop, and fun to play, the game has a very limited amount of content until you open up your wallet.",
            "review_score": "-1"
        },
        {
            "review_text": "this is probably my favorite tabletop game that isn't a pen and paper rpg. and now i don't have to get 4 other people around to play it. i highly recommend this game. (side note: this is a simulated card game so don't be expecting an action game)",
            "review_score": "1"
        },
        {
            "review_text": "One of my friends recently introduced me to the card version of this game, and I immidiately loved it. Not wanting to drop a small on the physical game I decided to by the digital copy, and I do not regret that decision. The gameplay is infuriatingly fun and with the addon packs which introduce more villians, heroes, and environments you can play almost endless game possibilities with a different set of heroes and villian everytime. I highly recommend this game for anyone who likes superheros and strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the card game first, so I am probably a bit biased.  Cooperative features are nice, but I use this mostly for solo play.  This is a very 'busy' interface efficiently displaying an entire table's worth of information.  Very solid. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The game that made me fall in love with co-op games, now in digital form! Occasional new features can be buggy, but they are constantly and actively being improved. Some great challenges in place for good replayability--unlocking variants the hard way takes a lot of planning and work! New co-op function working well so far... can't wait to see where they continue to go.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic port of the cardgame. Not a bad set for $10 either!",
            "review_score": "1"
        },
        {
            "review_text": "As one that played and enjoyed the original card game this is based on, I have to admit...this version is better. Games go faster, and the graphics, sound effects, and especially music sets mood ten times better.  The multiplayer works well, though I would prefer a simplified way to find games. However, that's a minor nitpick at best.   If you like card games, and like comics and/or superheroes, this is definately a game you want to get.",
            "review_score": "1"
        },
        {
            "review_text": "If you love comic books this is a game you should check out. If you love card games/board games this is a game you should check out. If you love co-operative strategy games, this is a game you should check out. If you love all three this is a game you should get. The entire 'plot' of this game is that you or a group of people control super heros by playing cards that corespond to some of their abilities. With your team of super heros you are trying to take down a super villian. In general all the super villians have the same pre-requisit to kill them (get them to 0 hp) however each villian has their own set of fail conditions. But it's usally that all your heros get KO'd. Each hero has their own play style and even some of the varients that just change the main power on the card can affect their play style.  However this is a game that I would say needs all the expansions to get a fulfilling experience out of. This isn't a $10 game with expansions it's a (if you get the season pass and i'm sure there is going to be a second season pass as well but for now $30) $30 game that comes in multiple parts.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing port, of a (presumably) amazing cooperative card/board game!  I've never played the original card game it's based on (though I'm fairly sure I will with my regular gaming group, once I get a chance). It's similar to a game like Magic: The Gathering in a way, however, it's also very different. It's not a 'CCG' (because it contains expansions with cards, you don't buy 'packs' and try to get cards or build decks). This is true in both the card and video game versions. The game is strictly cooperative, 1 to 5 players versus the Villain, the base game (the video game at least) has 4 villains and about 10 heroes. Cards are dealt out, you play various ongoing, one-shot, and other types of cards to get an effect or deal damage to the villain or it's minions or devices, it in turn, tries to kill you all (Grand Lord Voss is a PitA).  What really impresses me is how well it plays, both single and multiplayer (multiplayer has some weird hitches and people don't see cards at the same time, depending on how fast they click or have their animation speed set) and you do a lot of 'voting' and 'suggesting' what the other players do or can do, that's handy for text, but a bit less-so for voice (the game does not support voice natively, you'll need your own client), though I understand why it's set up this way) it's ages beyond how well the various versions of Magic play on Steam (though they're nice, they don't work as well and seamlessly as this game). It's extremely addicting if you love comics, superheroes, cooperative card games, board games, or just doing stuff with your friends, (though it plays perfectly fine solo also).  Check it out; you'll be glad you did!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! If you like the tabletop version of this game, you'll like this just as much!",
            "review_score": "1"
        },
        {
            "review_text": "  One of the best card game I ever played. This is not a deck-building card game, it's a board game for 1 to 5 players that get transferred as a PC game. There is also the tablet ann phone version.  Basically, you play a team of Super-Heros 3 to 5 and go against a Villain in a specific environment until the heroes get incapacitated or that you manage to do the winning conditions. Every turns, the villain play, then the heroes and at last is the environment.  Each hero in the game has its own deck, depending on the kind of hero you play, some have differents power, others are war machine that uses differents equipment. Every hero has it,s own unique playstyle. The cards you draw lead the way on how you react or the attribute you can use with that hero. Very detailed and well-balanced deck with a lot of work on it. There is 3 phase to the hero turns. First, the hero plays a card from the cards in hand. Then there is the power phase, where the hero can use a power or an equipment. Then the hero draws a card. Sometimes there is some specific rules that can change the order or the number of cards a hero can play in a turn, the number of power a hero can use in a turn and also the number f cards a hero can draw in a turn.  On the other end, the villain you face also have its own unique deck depending on the villain you face. Some have different winning conditions, they all have their unique abilities and use differents powers, equipment, devices or even henchmen or creatures to fight against the heroes. The villain deck is shuffled at the start and every turn unless there are some special rules for that specific villain, a card is played from the villain deck and act as the villain action for this turn. Depending on the villain cards, there may be some other events that happen or special rules that may vary the gameplay.  There is also another variable to take into consideration, where the heroes fight the villain. This is determined by an environment deck. Every environment has it's own deck of 15 cards. Usually, 1 environment card is played from the environment deck per turn unless there is some special rules or events. Some environment is nasty and have creatures fighting the heroes and also the villain. There is also some event that can happen, as for example, a volcano erupts and deals damage to everyone or some paparazzi on the scene that forbid the heroes to use their power for a turn.   This game is really awesome, if you like strategy and cards game, this is a unique game with so much to offer. The community isn't huge, but this is a small community of people who really like this game. You can find the online game most evening from American Time zone. Usually, this is when there are the most players online.   So I hope it convinced you to buy this, that game is just awesome. I never heard of this game before last holidays, I won this game and gave it a try. Really surprised by the quality of the game and the fun I had playing it. After only a few days, I bought the season 1 pass that adds a lot of new heroes, villains, and environment. I also backed the season 2 pass from kick-starter. Now I'm a real addict and I need my fix almost every day.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with great music and easy flow. If you are a fan of the table top version this is a MUST have. Perfect for when you can't convince your friends over for the third time this week...",
            "review_score": "1"
        },
        {
            "review_text": "Having played both the tabletop version as well as the PC version, I can say that the PC version stacks up very well. The interface is themed well to look like an actual comic book. Plus, it's a lot cheaper than the physical game! The only thing *really* missing is multiplayer but I wouldn't be surprised if it showed up in a future update. While I recommend the game as it is, if they decide to add extra locations or heroes as unlockable rather than DLC, this would get an even higher recommendation.   Rating: 8/10 for lacking multiplayer currently. Score would be lower if I was tempted to try multiplayer more.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun and a great port of the tabletop game. Well executed. Can't wait for the expansions!",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun translation of the card game to a video game format. It is fun and has a good UI that makes the action easy to follow, and with dlc promised and on the way this game will become a great addition to the multiverse family!",
            "review_score": "1"
        },
        {
            "review_text": "An adaptation from the boardgame. This game make a good job to reproduce what make the board game so good.  Here each hero, villain and environnement have it own deck of card with it own machanic making each of them really unique. I play a lot of game on the boardgame and in this digital version and none of my game where ever the same.  So far only multiplayer is missing, but since that feature is currenlty in beta it only a matter of time before it eliminate is only big flaw.  Strongly reccommend this game for all people that love a pure coop game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Must have If you enjoy playing the orginial card game",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game put out by Greater Than Games! I can't wait for an expansion!! 5 out of 6 stars",
            "review_score": "1"
        },
        {
            "review_text": "For anyone who enjoys PvE, card games, board games, superheroes, turn based games, or strategy game, I would highly recommend this game. It is a true adaptation of a well recieved indy card game wherein a team of 3-5 heroes duke it out with one villain in a setting.  There are plenty of heroes to choose from, 4 villains in the base set (more with expansions) and 4 settings (more with expansions) which makes for a large number of unique combinations and possibilities. Expansions only add to those combinations.  Each hero, villain, and setting has an entirely unique deck that provides them with their own 'feel'. I won't detail them all here, but there are a number of parallels to popular fictional characters, even so the game keeps its characters very unique.  Settings provide random events that happen every turn, one or two cards in a setting deck may actually help the players, but most of the time the deck provides chaos that must be dealt with during the battle (a volcano errupts, there is a hostage situation, water is flooding the battleground, etc...)  The original card game was co-op, unfortunately the video game isn't co-op unless you all want to get together and pass a mouse around (I won't judge). This game is a fantastic solitaire game, but it would benefit most from a multiplayer online upgrade. The Steam page says it is local co-op, near as I can tell that means playing on the same PC (it would work well if your PC is hooked up to a TV and could be tonnes of fun with friends).  Anyway, the game is great, pick it up and enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Every hero, villain and enviroment have their own little quirks. In the base set you have four villains, four enviroments and a dozen heros to play with. You (alone or with friends) can have a lot of fun playing around with the different heros and villains. The setup takes some getting used to and the controls can get weird sometimes but it is enjoyable.  My recomendation is to buy it and play for a while so you can get used to the mechanics, then if you like it, buy the season pass. It almost tripples the amount of content in the game while paying only a little more than the store price (with more heros and villains on their way)  Go forth and defeat those dastardly scoundrels!",
            "review_score": "1"
        },
        {
            "review_text": "It's a more or less perfect implementation of the card game with all the tedious shuffling taken out. If you like the card game, go for it.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the card game you'll like this, if you don't know about the card game you may want to give it a try anyway. The weekly one shots are interesting.",
            "review_score": "1"
        },
        {
            "review_text": "I don't quite know what it is about this game. I bought it upon release, since an old friend of mine had introduced me to the tabletop version of it, and I was enjoying it. I bought the season passs, but I had one bad game and then set it aside, not playing it for months. Now we're in January 2016 and I've put almost 20 hours into it in the last two weeks.   So if you buy this and don't get into it right away, step back for a bit (not four months obviously) and then come back to it again. You won't regret it.  But what *is* this game you might ask? It is a co-operative digital card game, which you can play solo or online as a group of unique superheroes, against any one of a number of unique villians, in various environments. I haven't played online so my review is based on my single player experiences.   The graphics are limited to drawing of the various heroes and villians, with some slight changes as they take damage and become incapacitated, as well as damage animations. The music however is pretty badass. But what about the gameplay?  The tutorial is recommended when you start to get the basics down; the villian has a turn where they play cards, and then the heroes go. Each hero can play a card, use a special power, and then draw a card. Certain things may cause you to skip one or more phases, and if you skip the first two on your own you draw two cards. After all the heroes go, the environment you are on has a turn, and this can be good or bad depending on what environment you pick.  The goal is to defeat the villian, but each one is different, and this is where the meat of the game comes in; the strategy. A fight against the same villian can be different depending on which environment you have; you can also have your team be anywhere from 3 heroes up to 5, which can cause differences in the battle as well, and each heros deck and powers make them distinct from one another. Also, each villian also has an advanced mode if you're looking for a more sizeable challenge. So the number of various scenarios you can have is very large.  The game has no story or campaign of the sort at the moment of this writing. They have introduced what is called a 'weekly one shot' where the community gets a specific challenge based on a certain group of heroes versus a certain villian in a certain environment, and then are encouraged to discuss it on the forums. There are also 'variants' on the existing cards you can unlock, but the condiitions for doing so are very convoluted in some cases so it is best to refer to the well written community guides to determine how to do so.   Outside of unlocking the variants and the 'one shots' then the game is basically setting up your own matches by yourself and with friends to see how you do. You can let the game randomize a match for you, or set one up yourself. As I said, there are numerous combinations in the base game, but to get the best experience it is recommended you try to get the DLC for the additional heroes and villians to increase the replayability of the game.  It is expensive, what with the main game at $17 and the Season Pass at $21, but for the fun you will have it is worth it. Absolute 10/10 recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Sentinels is an absolute delight. It's a fun, cooperative experience with tons of variety and a good mix of opportunities for skillful play and exciting twists of fate when the RNG betrays you. The cards are flavorful, and the stylized art really cool. I'd buy into a Sentinels comic series, cartoon, whatever; the fluff is great and I want to see more of that world.   Sentinels is one of my favorite card games in paper form. This computer version is 100% faithful, and way cheaper because electrons are easier to manufacture than trading cards. Do it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a superhero card game ported to PC. It's fantastic. If you like the game, try out the DLC.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awsome and is equivilent to the card game",
            "review_score": "1"
        },
        {
            "review_text": "Updated - After my intitial review of the base game listed below. I felt that the game was lacking in a few areas that have been updated. Its strange that while i initially had this game objectively listed as 5/10 as a result of playing it I went and bought the tabletop version and have become a huge fan.  I am happy to say that with recent addition of the first full expansion packs as well as some slight quaility of life upgrades since the games release and my purchase I would now bump up my grade to a 6/10 and a I would recommend the digital version to most people at this point.  There are still a ton of things that I feel should be added to improve the game and I still feel they should do more to animate and accentuate the game given the tools at their disposal. Multiplayer should be top of the list.  I left my orginial review unaltered except for a few quick grammar corrections for any whom are on the fence about buying the game please read on.....  Orginal Review  After much internal debate I came to the assement that the developers managed to digitized a GREAT tabletop game...however I still have to give this the thumb downs. So to be clear...I enjoyed the mechanics, the game runs smoothly, and there seems to have a very good developer to community relationship (at least in my experience) yet I still would not recomend purchasing this game.  I was disappointed to find this talbletop/card game that fails to add any compeling elements despite the fact that it has ascended into the digital world. This is a sin I cannot overlook and makes me regret not buying the tabletop version. I would say being given the keys to go anywhere and do anything at Disneyworld and then refusing to leave the parking lot does not make a bad person but it does make me wonder what end of the autism spectrum you sit. This is not a bad 'game' just an unnecessarily limited 'video game' and a complete waste of potential.   To clarify the game itself is FUN and well designed with the different combinations of decks (heros, villians, environment) providing a good deal of variety in terms of playstyle from game to game. However there are no animations past the static comic book pieces of art (though well done at from what I can tell on par with the carboard box takehome) and very little else to help color the experience after multiple playthroughs. It may be that every game is different but it honestly does not feel much different to me. There are some very obscure conditions that allow you to unlock 'variants' of particular decks (heros and villains no location unlocks) but most of that satisfaction feeling I usually get after succesfully beating a game or fufilling a condition of an unlock is absent.  There is an overall lack of content here. I understand and believe that the developers where trying to be as faithful as possible to the tabletop version and they succeed in doing so here. In the end the human element that is lost by playing this game solo (no multiplayer option to attempt to replace human contact either) makes it a failure. Again this a true shame as their really is a ton of potential here. There is no progression or advancment that I can see and it lacks window dressing.  All that being said I am going to purchase the tabletop game and give it a go at game night with my friends this week. Again this is a great 'GAME' but a poor 'VIDEO GAME' I would recommend you support the game in it's original form but skip on this version.  5/10  Tough to come up with my rating here but I will stand by it as being the perfect example of a 5. When reviewing it I did not comeup with a single good or bad point without finding a contradiction steering me in the other direction.   End Original Review  In case you skipped to the end in it's current state 6/10 as of April 16th 2015...  10/10 for the tabletop version of the game its still best played with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Sentinels of the Multiverse is a fantastic superhero card game I enjoy to have. It offers a bunch of great superhero stories, amazing variety,I can recommend the game to fans of superhero comics and DC/MARVEL movies.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, easy to play! Having a lot of fun with the new varients, and looking forward to the expansion packs! I might actually get this in its original board game format.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Played the tabeltop versio with one of my best friends Tom Ingham and his son Rob. Had to buy it for myself on steam. Wish it was online co-op.",
            "review_score": "1"
        },
        {
            "review_text": "I love card games, and this one is even more fun to play than it looks. Thank you for the Linux version!",
            "review_score": "1"
        },
        {
            "review_text": "Friends made me get this game. Have now wasted hours trying to unlock variants. I regret nothing.  9.5/10 because my grades would've been better without it.",
            "review_score": "1"
        },
        {
            "review_text": "the interface is a little clunky, and i hope they add the rest of the sets. but over all a good game 8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer is so buggy its unusable.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is an absolute waste of time. I played through the tutorial which took ages. The cards make no sense and the cartoonish style of the game made it even worse.  If my only choices where playing this game or to go outside and sit in the sun, i would get tan af.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought the 5 pack with the impression that it had bonus content. The 5 pack has no description! If you're going to sell multiple coppies of the same title you should add a description saying that this is what you are doing! Does Handelabra have any arrangements to offer bonus content in exchange for the duplicates, or was the 5 pack a bogus item???",
            "review_score": "-1"
        },
        {
            "review_text": "If you like the Sentinels of the Multiverse card game, then you'll love the video game version. All the rules are intact and it is easier to play thanks to the computer keeping track of all the cards, abilities, and status changes. What is lacking, however, is an online cooperative mode that you can play with others. The fun thing about the card game is interacting with other players to figure out a strategy. The video game is just starting out so there is plenty of time for improvements and additions to it. I'd give it a 4/5. If anything, it will improve your skills for the actual card game!",
            "review_score": "1"
        },
        {
            "review_text": "Caution: this game is a trap. You play a game, or two, and suddenly it's four in the morning and you have to get up at six to go to work. In the evening you play another game, and then you feel compelled to buy the tabletop version... and then all the expansions... Developers, have mercy: my board game shelf cannot fit anything else!  In all seriousness, this is a great port of a wonderful game. If you like cooperative board games (it reminds me a bit of how Ghost Stories plays, not in pure mechanics, but in the mood and brain usage), or semi-cooperative games like Legendary, Sentinels should be a no-brainer. The graphics are very stylized and comic-book like, which was slightly distracting at first, but after a couple games, I grew used to it. Luckily, the music is a great recompense; I even found myself leaving the game running once or twice in the background to listen to the soundtrack.  Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Perfect adaption of an excellent table top game.",
            "review_score": "1"
        },
        {
            "review_text": "This game plays similar to the card game, but don't expect it to be any great work of software engineering. The visuals are plain, and the flow of the game is a bit confusing for new players, but if you're familiar with the card game, you'll feel right at home.  One of the biggest issues with the card game is tracking all of the changing effects, which the computer game version does for you, saving a huge headache, especially with some of the more complicated heroes and villians. The price is a bit steep, especially when the people you want to play with are spread out so you have to play online, but if you can get past having to have everyone own the base game, and all of the expansions, and you like the card game in the first place, I think this is worth buying.  If you've never played the card game, only buy the base game, try it once or twice, and then decide if the expansions are worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "I own and love the Cardgame and supported the recent kickstarter for the last expansion to it. I love this online version as it takes care of all the recordkeeping chits and addition you have to do by hand when you play it in person. My one suggestion(not gripe - since the game is great and without any bugs I can find) is to have voice chat as part of the game so people can tabletalk more naturally.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game!  It's fun when you play multiple heroes at the same time",
            "review_score": "1"
        },
        {
            "review_text": "An extremely loyal adaptation of the card game of the same name.  A blast to play, either solo or multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't too convinced with reviews when I bought it. Card game's solid - PC adaptation works great.  It's still not as much fun as playing with real people and real cards at a real table, but suppose you're stuck in China and have very limited capacity for games you can carry? This is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Highly entertaining comic/CCG game. Expansions are too high priced and wish it had more starter villians. Still playing though!",
            "review_score": "1"
        },
        {
            "review_text": "Own physical copy, love the digital version. Use the free lear-to-play to lure playgroup friends into the Multiverse :)",
            "review_score": "1"
        },
        {
            "review_text": "Great physical game...great video game. A+",
            "review_score": "1"
        },
        {
            "review_text": "This is my absolute favorite card game, so the video game adaptation needed to be perfect to live up to the standard. And it is. All the characters really feel straight out of a comic book, and the soundtrack in the digital version nicely adds to the epic feel of a team of superheroes defeating villians. The digital version takes care of all the token and damage bonus management for you, so it's easier to focus just on the strategy and action.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Great Artwork Long Challenging Battles Well-crafted AI  Cons: No Campaign/Story Mode Game is absolutely crying for Voice effects  8/10  ",
            "review_score": "1"
        }
    ]
}