{
    "app_id": 337210,
    "name": "Royal Bounty HD",
    "release_date": "2015-08-10",
    "developer": [
        "iosoftware"
    ],
    "publisher": [
        "iosoftware"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Indie"
    ],
    "achievements": 22,
    "positive_ratings": 86,
    "negative_ratings": 58,
    "price": 1.99,
    "description": "Royal Bounty HD is a fantasy RPG in the feel of the great old 1990 King's Bounty. You control a hero to gather gold and armies, level up and upgrade your stats, and complete quests across a huge map with 4 continents.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/337210/header.jpg?t=1492363402",
    "minimum_requirements": "OS: XP Processor: 2000 mHz Memory: 512 MB RAM Graphics: Intel GMA950 Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game could be good.  It would be good if players were given time to explore and move at their own pace instead of making it necessary to speedrun the game. This could be achieved by placing a certain amount of lootable resources on one part of the game, which are then used to get through battles - some players needing less and some needing more of them... or then by adding something else entirely.  Progress is impossible if you explore or backtrack 'too much'.. or honestly, even if you just fight all the battles as the enemies start to overwhelm you in no time. Too bad you might notice this too late when you've already spent a good while on a playthrough.  I'll be trying it again after some updates.",
            "review_score": "-1"
        },
        {
            "review_text": "Never in my HoMM carier have I commanded an army of 400.000 ghosts... 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "It's a cool concept, but the game is clunky, controls are unresponsive, the dialogue is abysmal, graphics/animations are choppy, and it feel like it has a pretty big learning curve (or it is just poorly explained and executed). Even for $5, not impressed.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice little game with a combination of strategy and rpg elements. Easy to pick up and play during a break etc.  Pros: Lovely Art Lots of stuff to discover Cheap No bugs or crashes so far  Cons: No world map Enemy groups get bigger over time, this means if you back-track or explore for too long, the game gets impossible. ",
            "review_score": "1"
        },
        {
            "review_text": "Achievments dont work((( that s sad!",
            "review_score": "-1"
        },
        {
            "review_text": "Eh... boring, not deep at all.",
            "review_score": "-1"
        }
    ]
}