{
    "app_id": 337270,
    "name": "Ostrich Island",
    "release_date": "2015-01-08",
    "developer": [
        "MeDungeon Ltd."
    ],
    "publisher": [
        "MeDungeon Ltd."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "achievements": 84,
    "positive_ratings": 197,
    "negative_ratings": 34,
    "price": 3.99,
    "description": "Don't be an ostrich, play Ostrich! Gain experience points and unlock new skills and achievements! Feel creative? Create whole new islands and share it with community!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/337270/header.jpg?t=1481470300",
    "minimum_requirements": "OS: Windows 7 Processor: 2 GHz single core, SSE2 instruction set support Memory: 2 GB RAM Graphics: DirectX 11 compatible dedicated graphics card with 1024MB VRAM, integrated video may not work. DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space",
    "recommended_requirements": "OS: Latest Processor: Fastest available Memory: 8 GB RAM Graphics: Coolest available DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: Perhaps you already have the one you like.",
    "reviews": [
        {
            "review_text": "At first you look at the game and wonder what this is. It looks childish, has some treacherous controls and maybe one glitch or the other.  Still you play it, just a bit. Achievements come flying in from the first level onwards, you find the secrets, and you want more.  Suddenly you find yourself ranked among your friends and the whole world of players. And you keep playing for the one moment that allows you the next highscore.  Silly kind of funny and badly addictive! I should have stayed away...",
            "review_score": "1"
        },
        {
            "review_text": "This game is cute and quirky, and a good way to entertain yourself. Kinda reminds me of the good old days, when games were simple and silly like this and you could spend the entire game derping around if you really wanted to.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly catthartic. I guess I secretly wanted to be an ostrich all along, without even knowing. Very fun, though the controls can be clunky (I find remapping the keys to be helpful.) Something about it is very charming, bringing back memories of the collect-a-thons of the N64 era.",
            "review_score": "1"
        },
        {
            "review_text": "Ostrich Island is a ridiculous concept trapped in a game trying to do more than it can realistically accomplish, driven off a cliff by an endless stream of bugs and glitches.  As the last ostrich trapped on a barren island, the tide slowly coming to claim what dry land remains and you along with it, your goal is to escape through the wall of bubbles, grabbing as much crap as you can pickup along the way while completing bizarre objectives seemingly left behind by a former island cult. None of this is explained, mind you, instead leaving you to bounce around levels clipping through the environment, collecting hats you can't equip (until the game miraculously decides you're worthy and they begin to work), and generally breaking the game in order to proceed. Most objectives are optional, but without them the game is nearly entirely empty, so you're left with either rushing through accomplishing nothing or struggling with challenges I never understood even after completing them which in essence accomplsh nothing as well.  Coop had the slight potential to salvage a terribly clunky, often malfunctioning experience, but naturally it's just as unintuitive and poorly implemented, with levels often becoming even more faulty when you introduce another player and objectives tending to require repeat playthroughs so as to allow both players to complete them. Controls are stiff, generally unresponsive, terribly mapped (especially on controller, which despite what is listed on the store page is far from fully supported), and wonky enough that I'd often fly wildly out of control simply trying to perform a normal jump let along trying to complete some of the more strenuous platforming sections.  Everything about Ostrich Island screams of a missed opportunity and a misunderstanding of what it wants to be. The idea is so absurd it's almost endearing by itself, but it's hard to even find dressing your ostrich up like a cow wearing heart shaped glasses amusing when everything is breaking apart around you and you're still expected to somehow make it through. It's not impassible if you're determined enough to push through a ceaseless technical disaster, but there's nothing on the other side to have in any way made it worthwhile.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best games to play with a friend. It creates a bond between ostrich and you and it is touching. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Kicked a chicken. Stuck my head in the sand. Ran into a lobster and died.  11/10 Game of the Year.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 really wanted to role play as an ostrich with my friends",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would click settings again and lose the fullsreen mode forever.",
            "review_score": "1"
        },
        {
            "review_text": "Now i feel like an Ostrich 11/10",
            "review_score": "1"
        },
        {
            "review_text": "About as fun as wiping myself with sandpaper.",
            "review_score": "-1"
        },
        {
            "review_text": "I roundhouse kicked a pot and a herd of ladybugs erupted from within.  Would recommend to those who wish to experience life as an ostrich.",
            "review_score": "1"
        },
        {
            "review_text": "Boring youtube bait. IDK why I keep buying this stuff.",
            "review_score": "-1"
        },
        {
            "review_text": "200 lbs of poultry, and a dream.",
            "review_score": "1"
        },
        {
            "review_text": "Dont buy this game if you want to live",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't get pass the first level. 10/10",
            "review_score": "1"
        }
    ]
}