{
    "app_id": 337410,
    "name": "Karos",
    "release_date": "2014-12-24",
    "developer": [
        "Galaxy Gate"
    ],
    "publisher": [
        "NIKITA ONLINE"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Commentary available"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "RPG",
        "Massively Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 183,
    "negative_ratings": 154,
    "price": 0.0,
    "description": "Karos is stylish MMORPG with plenty of content and fascinating story. The multitude of game professions and classes, epic battles between guilds and factions, dungeon raids, elaborate crafting system and other necessities essential for a modern MMORPG found their flawlessly neat execution in Karos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/337410/header.jpg?t=1454065743",
    "minimum_requirements": "OS: Windows XP, VISTA, Windows7 Processor: Intel Pentium 4 1.8 Ghz or more Memory: 1 GB RAM Graphics: П DirectX: Version 9.0 Network: Broadband Internet connection Storage: 5 GB available space Sound Card: GeForce 5600 or similar",
    "recommended_requirements": "OS: OS Windows xp / Windows 7 Processor: CPU Intel® CoreTM 2 Duo E6700(2.66Ghz) or more Memory: 2 GB RAM Graphics: Graphics GeForce FX6200 / Radeon 9600 or more Network: Broadband Internet connection Storage: 5 GB available space Sound Card: GeForce 5600 or similar",
    "reviews": [
        {
            "review_text": " Please read the rest of my review if you need help to remove this game from your library after adding it by accident    If you want to read actual reviews for this game, change your localization to Russian in the steam client and the Russian reviews will appear.",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: Some peaple got butthurt with my review ( saying 'Not even translated' ) so I'll make an honest one.  Let's talk about my first impressions when I first logged into the game. Keep in mind that this is from someone who has never played this before steam version. First I opened the launcher and couldnt understand ♥♥♥♥ because it wasnt translated. How do you want peaple to play? So don't play this unless you know Russian. Even tho it is not translated yes, I logged into the game and tried to play it without even understanding and what I got was a nice class selection and character customization and It's not bad, you have various classes, I picked an archer. After getting into the game the first impact was that the map textures are pretty bad compared to the characters and the weird animations. Mobs doesn't even make sense where they spawn ( big spiders and wolves on an open field for example ) I'll update this review if they actually do something for their own good ( and sorry for the misspellings )",
            "review_score": "-1"
        },
        {
            "review_text": "looks ♥♥♥♥ing cool n might make you wanna try it out......... untill you find out you need to learn ♥♥♥♥♥♥♥ed russian to ♥♥♥♥ing play it. ♥♥♥♥ you devs",
            "review_score": "-1"
        },
        {
            "review_text": "please create language engilsh karos online in game..",
            "review_score": "-1"
        }
    ]
}