{
    "app_id": 33770,
    "name": "Drakensang: The River of Time",
    "release_date": "2011-02-16",
    "developer": [
        "DTP"
    ],
    "publisher": [
        "Valusoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 154,
    "negative_ratings": 37,
    "price": 14.99,
    "description": "The prequel to Radon Labs' award-winning RPG, Drakensang: The River of Time introduces a brand new story within the Drakensang universe. The new story brings many innovations and new game elements for experienced as well for first time players, who will jump right into the fascinating medieval fantasy RPG scenario of Drakensang: The...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33770/header.jpg?t=1447353943",
    "minimum_requirements": "OS: XP / Vista / 7 Processor: 2.8 GHz or faster Memory: 1 GB RAM ( 2 GB RAM for Windows Vista / 7) Graphics: 256 MB DirectX 9.0 compatible DirectX®: 9.0 Hard Drive: 5.5 GB Sound: DirectX 9.0 compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "What a fantastic rpg!! there are no achievements or cards......just good gameplay and story. It makes you want to play the game for the game. I really like the controls for movement, you can point and click or take full control, very similar to World of Warcraft. In battles you can pause (turnbase style) or just go full action. I am also a fan of The Dark Eye ruleset, if you hover over or right click on anything it gives an explaination, so it is easy to learn. There is alot crafting and upgrades, tons of collectable items and weapons, and you cant go 10 feet without a chest or barrell full of stuff. Add mine to the list of positive reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Sequel to the fun, but not all that great RPG Drakensang.  Unlike the first game, this one is actually good all around. They seem to have figured out what went wrong with their first foray in to RPG territory, and fixed it right up. The combat has been improved, although its still basic PnP rules, the story is actually interesting, and stays consistent, unlike the first one, and its just much better constructed.  If you like RPGs, and want one very similar to the oldschool PnP style games, ( NWN/NWN2, KotOR/2 ), then you'd be foolish to not pick up River of Time at its asking price, its everything I was hoping Dragon Age 2 would be, except much cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "8/10. Combat system can be a bit clunky but this reminded me of classic RPGs through and through. Decent story and some memorable characters. Absolutely worth a pick up if you're an RPG fan.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great, great game! I would say it's worth every penny! Again great game!",
            "review_score": "1"
        },
        {
            "review_text": "DO YOU LIKE RPGS? OF COURSE YOU DO. Do you like WRPGS? You goddam better, they always have better storylines than your cliche young angsty hero with spiky hair saves the world that have cursed JRPGS. This game sticks you an a group of adventurers on a quest to recover a crown stolen by a legendary theif. You fight tons of different enemies and the character sheet lets you make any type of hero you choose. This game is also beautiful, i have some screenshots of really neat scenery and fights.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing adventure in the setting of the Dark Eye, popular german roleplay. Atmosphere is awesone, characters are great - a must-play if you love roleplaying games.",
            "review_score": "1"
        },
        {
            "review_text": "WAAAY too many confusing stats/10",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful and underrated RPG, pity the studio was bought out and the series is dead.",
            "review_score": "1"
        },
        {
            "review_text": "Game was full of startup bugs which did not allow me, and many other Steam users (see forums) to even start the game withouth getting SQL errors and other odd errors that Steam could never explain or fix. For that reason I recommend great caution in renting it. Try Oblivion, Skyrim or Dragon Age Origins.",
            "review_score": "-1"
        },
        {
            "review_text": "I remembered liking Drakensang so I bought this. I should have remembered that I never finished Drakensang so I probably didn't need to buy this. Instead, I could have just gone back to the original. Again, this is my problem. What I saw of the game in under an hour seemed fine.",
            "review_score": "1"
        }
    ]
}