{
    "app_id": 337880,
    "name": "One Late Night: Deadline",
    "release_date": "2014-12-22",
    "developer": [
        "Black Curtain Studio"
    ],
    "publisher": [
        "Black Curtain Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 31,
    "negative_ratings": 91,
    "price": 5.79,
    "description": "One Late Night: Deadline continues the story of One Late Night, a horror/mystery game where you play the role of an office worker caught in the middle of the paranormal activity that has broken out in a seemingly ordinary office building. Freely explore the 5 story office complex that houses several different companies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/337880/header.jpg?t=1447365892",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel Core 2 Duo or AMD equivalent Memory: 2 GB RAM Graphics: DirectX9c compliant card with at least 1024MB of VRAM DirectX: Version 9.0 Storage: 1250 MB available space Sound Card: DirectX9c compliant Additional Notes: Rquirements are based on desktop hardware. Some AMD based hardware may experience lesser performance.",
    "recommended_requirements": "OS: Windows 7 SP1 64-bits Processor: Intel Core 2 Quad or AMD equivalent Memory: 8 GB RAM Graphics: DirectX9c compliant card with at least 2048MB of VRAM DirectX: Version 9.0c Storage: 1250 MB available space Sound Card: DirectX9c compliant Additional Notes: Rquirements are based on desktop hardware. Some AMD based hardware may experience lesser performance.",
    "reviews": [
        {
            "review_text": "Review for new update: + Way better frame rate, can go up to 40 frames easily + The annoying little bugs throughout the game have been fixed + Now playable  - Still a few bugs and things need to be fixed  - Still needs a better objective viewer because you can only see one objective at a time - Character gets drowsy too quickly which can cause lots of problems  + The story is very interesting + It is extremely creepy when it needs to be which makes it a great horror experience  + Amazing graphics + Can be funny at some points of the game  I'm recommending this game because if everything is fixed this can be an amazing game. If your not sure if you want to buy it check my first look video out:         YouTube™ Video:  One Late Night: Deadline Part 1 | First Look&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I've seen some youtubers playing this and thought I would give it ago. And I did see the bad reviews. I didn't even get a chance to get into the game at the moment, due to the mouse doesn't seem to be working with the game or the game doesn't want to use my mouse. I can move around the in the game, but I can't turn to look at things which is gonna be crappy as I won't be able to access doors and such. I'm gonna wait for another update and give it go then. I'm not going to jump to disliking this game or saying this negative.",
            "review_score": "1"
        },
        {
            "review_text": "If you reading this you either are contemplating buying this and looking for more info, or you're equally as likely someone who bought this game and is trying to figure out a fix for the absolutely abysmal performance.   My advice as someone who bought this title months ago is: DO. NOT. BUY. THIS.  There have been performance issues since the very beginning and not a single thing seems to have been done about it except constant 'well it works on our pc's' and a single patch that noone who was complaining about issues seems to find did a damn thing. Dev responses have dropped to literally nothing on most. Oh but they will respond to anyone new asking how the game runs and then tell them that their have been no complaints after this first patch WHEN THE COMPLAINTS FROM BEFORE IT ARE STILL VALID AND HAVE YET TO BE FIXED.  If you already bought this game, I advise you to request a refund from steam. Do NOT give a developer who is this distant and clearly doesn't give a damn your time or your money. Anyone who has been complaining along with me for the few months, supposedly steam is giving refunds for older titles with special consideration. I suggest giving them a shot. I personally won't because even though I feel ripped off I still will accept the bad purchase I made.  Hopefully this stops people from being burned.",
            "review_score": "-1"
        },
        {
            "review_text": "JUST NASTY!",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly the best part of the game was finding the rediculous angles you can get while drinking Torstig.",
            "review_score": "-1"
        },
        {
            "review_text": "Got a free copy of the game from  orlygift.com ",
            "review_score": "-1"
        },
        {
            "review_text": "The Framerate is unbelievabley rubbish i'm at 5FPS And I have a proper gaming computer. If your framrate is good you are lucky as hell, but for now this game is crap.",
            "review_score": "-1"
        }
    ]
}