{
    "app_id": 33790,
    "name": "Elizabeth Find M.D. - Diagnosis Mystery - Season 2",
    "release_date": "2011-06-09",
    "developer": [
        "Gunnar Games, Inc."
    ],
    "publisher": [
        "ValuSoft"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object"
    ],
    "achievements": 0,
    "positive_ratings": 16,
    "negative_ratings": 13,
    "price": 14.99,
    "description": "Unravel the Medical Mysteries in this Dramatic Puzzle Adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33790/header.jpg?t=1447354308",
    "minimum_requirements": "OS: Windows XP/VistaProcessor: Pentium® 1.2 GHz processor or fasterMemory: 256 MB RAMGraphics: 32 MB DirectX® 9 Video CardDirectX&reg;: 9.0cHard Drive: 100 MBSound: DirectX9.0c compatible card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Elizabeth Find M.D. - Diagnosis Mystery - Season 2 is a hidden-object puzzle game, where you uncover clues to diagnose and treat patients by playing through hidden-object puzzles at various locations. It is interesting as a hidden-object game, which I loved as a small child. It functions similarly to the free to play facebook game, Criminal Case. Once you have uncovered all the clues for a patient, you can inspect the evidence collected, review the patients chart and based on deductive reasoning from the evidence, present your diagnosis. Once this is accomplished you move on to the next patient. In between these patient scenario's, a storyline develops regarding Doctor Find, her relationships with coworkers, and her employment at the hospital.   I didn't think it was a bad game considering the classification and genre of game it is. I think it is rather well done, although the puzzles were overly simplistic I thought and could have been more challenging. There were other simple mini-games included, such as Bloodwork games, spot the difference on the X-Ray, etc. Perhaps timers would give the game a sense of urgency or add a dimensional difficulty the game is currently lacking. All in all I had fun with it. It is a decent hidden-object puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "(This review is for 'Elizabeth Find M.D. - Diagnosis Mystery - Season 2') 4/5 Stars. Object finding game of good quality. It took about three hours to complete it. As with all object-find games, this has no replayability, so be sure not to pay more than $5 for it. It has a minor storyline that is a bit soap-opera-ish and doesn't really enhance or affect the puzzle aspect. It would have gotten 5/5 if it hadn't reused some search scenes and if it had an extra hour or so of game play.",
            "review_score": "1"
        }
    ]
}