{
    "app_id": 338050,
    "name": "Anoxemia",
    "release_date": "2015-01-16",
    "developer": [
        "BSK Games"
    ],
    "publisher": [
        "BSK Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Casual"
    ],
    "achievements": 23,
    "positive_ratings": 242,
    "negative_ratings": 128,
    "price": 2.79,
    "description": "Anoxemia is a story-driven exploration game that puts you in control of the scientist Dr. Bailey and his operations drone, ATMA. Search the ocean floor as you discover and extract samples from the bowels of the underwater caves.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/338050/header.jpg?t=1450948545",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Vista, 7, 8 Процессор: 2 GHz Оперативная память: 512 MB ОЗУ Видеокарта: 5 years old or younger. Integrated graphics and very low budget cards may not work. Shader Model 3.0 required DirectX: Версии 9.0c Место на диске: 4 GB",
    "recommended_requirements": "Рекомендованные: ОС: Windows XP, Vista, 7, 8 Процессор: 2 GHz Оперативная память: 512 MB ОЗУ Видеокарта: 5 years old or younger. Integrated graphics and very low budget cards may not work. Shader Model 3.0 required DirectX: Версии 9.0c Место на диске: 4 GB",
    "reviews": [
        {
            "review_text": " TL;DR",
            "review_score": "1"
        },
        {
            "review_text": "To start, I'm not done the game yet, I'm about 15 levels in!  Like a lot of puzzle games it may seem unfair and frustrating at first. But once you get past the initial frustration and get into the flow of the game, it gets to be a lot of fun! I'm not that far, but I look forward to trudging on and making it to the end! :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Nice under water adventure/ puzzle solving game. Had fun Thanx",
            "review_score": "1"
        },
        {
            "review_text": "It's alright. A little boring. The atmosphere is good. Can't fault it for the presentation.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  The After Thought - Anoxemia (Review and First Impressions)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This game is too spooky",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "really good, underrated game",
            "review_score": "1"
        },
        {
            "review_text": "It's a clever little game but nothing amazing. No significant challenges until half way through with it. Overall it just couldn't hold my attention, plus I ran into some physics issues that would cause your drone to get trapped a bit too easily at times. Very frustrating when you're most of the way through a level and that happens.",
            "review_score": "-1"
        },
        {
            "review_text": "The atmosphere is really good and the setting is pretty interesting, but the gameplay is lackluster. You control a drone and the gameplay mainly consists of waiting till the human that is following you has caught up. You progress by picking up the plants in the level while dodging mines, pushing the occasional rock out of the way and looking for dynamite to blow up walls blocking the way. If you make a mistake and your human runs into a mine, you restart the whole level. The game isn't hard, just repetitive.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls are bad, when you press esc to pause, the only way to resume is to restart the level you were just on, oxygen is annoying, this game is just bad. It's bad. No one should get it.",
            "review_score": "-1"
        },
        {
            "review_text": "Move unconvincingly through an underwater environment, get hit a lifeguard float, die. Reload? Nope.",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 - no wonder the name sounds like a disease  Original idea &amp; artwork getting drowned by uninspired gameplay &amp; boring level design.",
            "review_score": "-1"
        },
        {
            "review_text": "No checkpoints, very floaty / wonky controls, and the guy never follows you properly. Supposed to be narrative heavy, but I made it 7 levels in and I never felt intrigued enough by it to push past the gameplay.",
            "review_score": "-1"
        }
    ]
}