{
    "app_id": 338170,
    "name": "Ratz Instagib",
    "release_date": "2016-07-27",
    "developer": [
        "Lino Slahuschek"
    ],
    "publisher": [
        "Rising Star Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Steam Achievements",
        "Steam Workshop",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "FPS",
        "Action"
    ],
    "achievements": 13,
    "positive_ratings": 2140,
    "negative_ratings": 365,
    "price": 6.99,
    "description": "Shoot first, eat cheese later! Jump into a fast, frenetic and exciting one-hit, one-kill FPS arena shooter with a totally level playing field, tonnes of maps, customisation and a robust map editor!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/338170/header.jpg?t=1478092319",
    "minimum_requirements": "OS: Windows XP Processor: Intel i3 Processor, 2.0GHz Memory: 2 GB RAM Graphics: Intel HD 4000 Integrated Graphics (256MB) DirectX: Version 9.0 Network: Broadband Internet connection Storage: 600 MB available space Sound Card: Any compatible soundcard Additional Notes: Mouse/Keyboard required; turn off anti-aliasing/outlines to maximise framerate",
    "recommended_requirements": "OS: Windows 7 Processor: Intel i5 Processor, 2.8GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 650 or similar dedicated graphics card DirectX: Version 9.0 Network: Broadband Internet connection Storage: 600 MB available space Sound Card: Any compatible soundcard Additional Notes: Mouse/Keyboard required",
    "reviews": [
        {
            "review_text": "That game can make the time you spend playing it fun and pretty interesting. The game has a fine graphic and cool gameplay, the soundtrack is good. This was a unique experience playing that game and I liked it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure fun. Fluid movement and no gimmicks.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game perfect 5/7",
            "review_score": "1"
        },
        {
            "review_text": "Do it for the badge",
            "review_score": "1"
        },
        {
            "review_text": "people that put a negative review even tho they like the game and say it has no players are part of the problem. no1 will play if all the recent reviews are negative",
            "review_score": "1"
        },
        {
            "review_text": "played on a map called 'don't fear the pingas' for a solid hour. never before have i played such a revolutionary game",
            "review_score": "1"
        },
        {
            "review_text": "This game is hella fun BUT, beware of the low player count.",
            "review_score": "1"
        },
        {
            "review_text": "Does anyone still play this game?",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game it has nobody playing it so i was playing with myself just like i aways do 9/11 ",
            "review_score": "1"
        },
        {
            "review_text": "OFFICIAL RELEASE? Wow, they grow up so fast.  This game has the speed and gameplay of a classic arena shooter and it feels good. An amazing hit-detection system, customizable characters, fun maps. I don't know what else I can really say but this game is really good. You might have a hard time finding matches, but that was just me.   Anyways, this is definatly worth a purchase. Have fun!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "bhopping and shooting. what more can you want",
            "review_score": "1"
        },
        {
            "review_text": "It's insta kill, stylised graphics, exagerated cpma style movement with cool dnb tunes. If those are your requirements, you'll love it, it does it very well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good.",
            "review_score": "1"
        },
        {
            "review_text": "top game of the game",
            "review_score": "1"
        },
        {
            "review_text": "incredibly fun and satisfying. even if you're only playing with bots",
            "review_score": "1"
        },
        {
            "review_text": "Extremely good game but very small player base. At the time I'm writing this, the US server has 5 players.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, Wish there was more player though:)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great",
            "review_score": "1"
        },
        {
            "review_text": "this is a prime example on how little arena shooters require to be great",
            "review_score": "1"
        },
        {
            "review_text": "It's k but nobody plays anymore :(",
            "review_score": "1"
        },
        {
            "review_text": "'Best use of farmyard animal'",
            "review_score": "1"
        },
        {
            "review_text": "super fun &amp; super fast ... thats all, just buy it, its 2€",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game.It demands pure aiming skill and good reaction time.However,it lacks players and community.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Too bad no one is playing this game anymore and that the community is dying, I really like its concept, and I think the developer needs to get more recognition for this. Lots of customization options, lots. And the game is really fun, especially in a full match; might not be everyone's cup of tea though, and clearly not mine but this didn't prevent me from having fun running around, jumping, boosting, trying to get a shot in. In short, point, dodge, shoot and hope(...) it hits...or know it hits depending on your skill level. In shorter, super fun. Clear lack of a tutorial, but very easy to get the hang of.  [+] : Specifications, Customization, Fun [-] : Dying Community [Note] : Only deathmatch have people on anymore.  Perfect game for an 'on-the-go' gaming (a stable connection is highly recommended) who can't put CS:GO or Team Fortress-type games on their laptop (due to lack of storage?), though this isn't a clone of that at all. Plus it's low specs, low space.  P.S. I already knew that the game community was nearly dead when I bought this, I just thought this game deserved to be known, and it looks like what sells get marked as a success and what doesn't is labelled as a failure, which is really sad as this is really fun. It's sad to note that the 'failure' of this game is entirely based on people having other (maybe better - according to them, at least) things to play...",
            "review_score": "1"
        }
    ]
}