{
    "app_id": 338300,
    "name": "Disney's Chicken Little: Ace in Action",
    "release_date": "2015-02-24",
    "developer": [
        "Avalanche Software"
    ],
    "publisher": [
        "Disney Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 12,
    "negative_ratings": 2,
    "price": 15.49,
    "description": "Inspired by the &quot;superhero movie within the movie&quot; finale of Walt Disney Pictures' film &quot;Chicken Little,&quot; Disney&quot;s Chicken Little: Ace in Action features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends: Runt, Abby and Fish-Out-of-Water.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/338300/header.jpg?t=1542763008",
    "minimum_requirements": "OS: Microsoft® Windows XP SP2 Processor: Processeur Pentium™ 4 or Athlon XP, 1.4 GHz Memory: 256 MB RAM Graphics: Any 3D 32MB DirectX 9 compatible graphics card (nVidia GeForce 2 or ATI Radeon 7500 or higher) Storage: 2560 MB available space Sound Card: 16-bit DirectX 9.0c-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This was surprisingly fun to play. I really don't care about the Chicken Little franchise but ended up playing this game with my daughter on the Wii and found it quite fun. It is basically a 3rd person shooter with lots of unlockables and replayable levels. You get to play as someone on the ground, as a tank, and as a starfighter. Lots of varied enemies and levels. Never seemed to be repetitive. So glad to find it here on steam. I was worried as the gameplay was super fun with the Wii controllers but I have found it even more fun with keyboard and mouse on the PC. Highly recommend this game. It is just surprisingly fun.",
            "review_score": "1"
        }
    ]
}