{
    "app_id": 338390,
    "name": "The Technomancer",
    "release_date": "2016-06-28",
    "developer": [
        "Spiders"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Sci-fi"
    ],
    "achievements": 40,
    "positive_ratings": 1232,
    "negative_ratings": 565,
    "price": 23.99,
    "description": "The Technomancer is a sci-fi RPG that offers players plenty of dynamic combat action based on 4 skill trees dedicated to 3 combat styles and the destructive electrical powers of the Technomancers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/338390/header.jpg?t=1499274222",
    "minimum_requirements": "OS: Windows 7 / 8 / 10 (64-bit versions only) Processor: AMD FX-4100 X4 (3,6 GHz)/Intel Core i5-2500 (3,3 GHz) Memory: 4 GB RAM Graphics: 1 GB, DirectX 11, AMD Radeon HD 6950/NVIDIA GeForce GTX 560 DirectX: Version 11 Storage: 11 GB available space Sound Card: DirectX compatible Additional Notes: Internet connection required for game activation",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The Technomancer is a mixed bag - there is about an equal amount of good and bad in it. The game does atmosphere very well - the locations all look great, are varied in design, and subtle touches make the populace feel real and alive. The voice acting really helps here too.  As far as being an rpg, the game doesn't break any new ground and all the usual suspects are there: you quest, gain xp, talk to companions, do side quests, some quests have multiple ways to resolve them, there are dialogue trees, a reputation system, crafting stuff, etc. Nothing special but it is competent.  The biggest issues I have are combat and back-tracking. Oh, god, the back-tracking. The back and forth wouldn't be so bad if the same groups of enemies did not constantly spawn in the same places every time. These enemies are not difficult but they are annoying as all hell and do nothing but force you to waste time fighting them. I feel like the game would be half as long without these pointless fights that just pad play time.  Another funny thing about combat is your main character is extremely squishy. You only have 1/3 to 1/4 the health of your companions and almost every enemy you fight. It is a strange design choice to have your character die in just a couple of hits but every street punk, soldier, and mutant you fight be a chore to beat down. That's what combat really feels like too - a chore.   The plot also feels very threadbare. It's a fairly standard story of corruption, traitors, and secrets that is interesting enough but too spread out and unevenly paced. There are a lot of characters and factions who are around but nobody gets fleshed out too well. It is like they had too many ideas and rather than pare things down to the best bits, they just kept everything. It's a case of too much and too little.  I liked playing through it mostly because I was curious how things would play out story-wise. Ultimately, I was disappointed. There wasn't much pay-off of all the plot threads. Boss fights felt oddly placed and several didn't make much sense (I'm looking at you Ice Dome Leviathan). Other side plots I just left alone because I didn't really care and I didn't need the money or xp. No replayability in my mind.  The Technomancer is satisfactory as a game. A solid 'C' effort. It plays it safe, doesn't try anything new, does several things well, but really harms the overall experience by forcing so much back-tracking on the player and making combat repetitive and dull.  Also, spoiler alert, does nobody on Mars have a telescope? Makes the ending a little hard to believe.",
            "review_score": "1"
        },
        {
            "review_text": "'If we're ever alone I'll make you shoot more than just a little electricity'  ( ͡° ͜ʖ ͡°)  Seriously though, decent RPG, decent-yet-repetitive combat, low enemy variety, some creative plot lines/twists, but with an UNHOLY amount of backtracking.  If you decide to do all the sidequests you come across you will literally spend 80% of this game running back and forth between 2 cities, clearing out the exact same mobs spawning in the exact same places 20+ times in a playthrough. The game never gave me more than 3 sidequests at a time, so I would travel to city A, do 2 or 3 things, travel back to city B to turn in the quests, then get 2 or 3 more quests, rinse and repeat for 15+ hours. This is interspersed by the occasional primary quest, which more often than not was just more backtracking. When it isn't simple backtracking though, the story is quite interesting.  The combat system also doesn't develop at all throughtout the game. You will learn a couple of new abilities, but fundamentally you spend every fight doing the same moves over and over again, against the same enemies. Human enemies do get stronger throughout the game, but purely with health/resistance buffs, not with improved movesets or AI.  Would give 'mixed' review if I could. 6.5/10 Buy on special if you're bored.",
            "review_score": "1"
        },
        {
            "review_text": "For a B company release, this is pretty good. Think of it like the first Dragon Age; which still had massive amounts of funding by EA, rough around the edges, we just met the cast of characters, and the world is still rather unknown to us and deserves to be expanded.",
            "review_score": "1"
        },
        {
            "review_text": " Spiders are getting better at this whole RPG thing, it's taking them a few goes, but bit by bit they're getting there. We've gone from very janky (Mars War Logs) to slightly janky (Bound by Flame) to...",
            "review_score": "1"
        },
        {
            "review_text": "Loved the Game. I've played Mars Logs also and enjoyed both  Far from being a perfect game however it was entertaining  Pro's : 1. Well written story . The voice acting is convincing  2. The 'universe' or MARS is captivating  3. Companions  4. Crafting , skill management . They add a nice touch  Cons: 1. Gameplay: it takes a bit to get used to it. 2. Lacks free roaming ( i'm a fan of open world)  3. The crafting , resource management and skill management could have been done better.   In conclusion I recommand the game, even at full price for an idealistic reason: Help the company rise to it's full potential. Thus in the future we can get better games from them.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me a bit of the first mass effect...   The story is good, but not great (there are some plot holes, which i wont discuss because of spoilering). Companions are intersting enough to talk to them once in a while, but a little more would have been better. The skill tree is great, but there is no retrain option. The combat is fun to do, but it can get a little repetative when doing fetch quests. The villain of the game is impressive (when he shows up), but just a little to absent for my taste. (although i do admit that it sort of fits in the story line... the villain just isnt a hands-on baddie, more of a tell others what to do baddie) I would go for a second playthrough (eventually), but i would see if there were cheats for said second playthrough.  I can go on for a while like this but the message is clear: overall the game is good, but not great.   I finished this game, which i enjoyed enough to recommend it to the people i like. However i would recommend buying it on sale for 30 euros or so. Then you have a good game for a good price.   I hope you enjoy this game as much as i did.   ",
            "review_score": "1"
        },
        {
            "review_text": "Like many who have already posted, I have mixed feelings about this game. At the end of the day, though, I have no qualms giving it a thumbs up. The devs deserve praise for making significant improvements with each game they put out. Having played Mars: War Logs and Bound By Flame, I can definitely see the writing improve as well as gameplay and graphical fidelity. A problem with those earlier games was they tended to feel like cliffnotes versions of stories. The Technomancer felt much more fleshed out. There were still pacing issues (e.g. chapter one took a long time to get going vs chapter 3 which was too backtracky and significantly shorter), but they're headed in the right direction.   Spiders has pretty much guaranteed a day one purchase from me for each of their games going forward.   I also want to give the music a shoutout. The theme for Mutant Valley was a personal favorite, I'd linger there just to listen for a while. Bound By Flame's soundtrack is probably my favorite of theirs so far, but Technomaner's is close.",
            "review_score": "1"
        },
        {
            "review_text": "Story is really pretty good. The combat is challenging. You feel as though your fighting the controls at first but once you learn how the fighting mechanic works and the timing of different enemies, it becomes rather enjoyable. Has a great skill tree with different fighting styles that actually play pretty differently. Semi open world with some light crafting.    I hate to compare to other games but somewhere in between Mass Effect, KOTOR and Bushido Blade. The combat is serious business and the stand out feature here when thoughtfully combined with your chosen skill progression. Take your time and you won't regret it.  PC performance is great. Running @ 4x DSR on GTX 1080. Ran @ 2x DSR on GTX 770, everything on Ultra. Textures aren't the most detailed but still look really good. Lighting and shadows serve the world design perfectly. SMAA + DSR remove almost all jaggies.   It's a slow burn story with twist and turns. Feels like a journey. Very happy! ",
            "review_score": "1"
        },
        {
            "review_text": "Just Finished the game. Not bad. Big improvement over their previous titles in every aspect. Becomes a bit tedious with all the backtracking for sidequests sometimes. But overall a satisfying experience.",
            "review_score": "1"
        },
        {
            "review_text": "I normally don't write reviews, however I feel that some of the negative reviews here are way too harsh. I say this because whilst the game doesn't have the polished graphics and other minor details that some AAA titles have such things aren't important enough to warrant a negative review. Whilst it has a similar feel to Mass Effect,   I'll get the negative difference out of the way. Yes its not as polished... But do you play RPGs for the graphics or for the story / game?  The Technomancer has a focus on melee that Mass Effect doesn't. If you prefer to smash your enemy's skull in rather than hiding behind a wall shooting then this difference will appeal to you.   Combat allows you to switch between 3 different combat styles, (similar to switching sword styles etc in other games). Each style has its own pros and cons and moves, knowing which style to use in a particular situation makes combat more dynamic. Plus the skill trees are more robust than Mass Effect. There are 4 different trees with 6 or so branches per tree.  So essentially core mechanics of The Technomancer are solid, its just the niggly polish that some people may wish to complain about. I will mention that combat is hard, refreshingly hard. This isn't one of those 'hold your hand' kid-like, 'you are always going to win' games.   ",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game, so here's my thoughts.  The Technomancer is in fact pretty good, if you like Bioware's work then this is definetely a game you should check out. However to clarify, dialogue choices are there, but only really appear at critical moments. There's not a good and bad option for every conversation.  Story: I'm putting this first because if you like this game, this is what you'll like it for. The Technomancer takes place on mars long after being abandoned by earth in something called the turmoil. This event destroyed mars' ecosystem and atmosphere, creating a deadly landscape of mutated creatures and the sky itself burning you alive. Great corporations that were in charge of water distrobution during the turmoil have now risen in to military and industrial powers of varying types. The player's starting corporation Abundance has some very USSR design sensibilities and is known for it's regular infantry filled army. The enemy corporation Aurora is a religous order filled with Technomancers. Speaking of Technomancers, you play as the about to be promoted Zachariah Mancer(people's last names are their jobs in Abundance) who in learning the secret of Abundance's Technomancers begins two story threads. One involves inter-corprate espionage and military work where the other invlolves searching with your fellow Technomancers to find the lost planet of earth and reunite with your ancestors. The two quests intertwine and effect eachother regularly and both are required to beat the game. Both are pretty well written and include a deluge of realizations and revalations into mars, earth and the technomancers. Overall the story in this game is very well written and extremely well done. Side quests are of course included and many involve your companions, which usually ended up being the best ones or helping the various factions of mars. Some were great, some were not, standard RPG fair as far as side quests go.  Gameplay:The Technomancer has some pretty typical RPG skills, speech, crafting, lockpicking and so on, but what makes it stick out is the ability to switch between combat styles and skill trees in the middle of the fight with a shared technomancy power tree across all of them. The styles basically amount to heavy medium and light but each serve their purpose in particular fights. However the combat system itself can be summed up as 'it gets the job done.' Until you unlock the cooler moves and technomancy powers you'll be mashing left click on enemy's over and over again. Once you get the cooler moves and powers fights typically go quicker but don't really add tactical depth. The gameplay is fine but gets repetitive quickly, but if you like the game it's not really what you're there for.  Boss Fights: I put this as a section because they are really a mixed bag, most of them are pretty boring mechanically and just a big health bar on wheels.(especially the few human bosses) But the visual design of the creature bosses as well as the last boss in general really make up for a lot of this and make the fights at least fun to look at.  Graphics: While I doubt The Technomancer will win any awards any time soon the game can look downright amazing at times. Character models are typically very polished(for recurring characters at least) and the environments are usually very detailed and stick out from one another very well, from the concrete and steel of Ophir to the middle eastern designs of Noctis, the game visually never left me wanting. I have two real gripes however, the lip syncing is pretty meh at best and sometimes just destroys a characters face (looking at you phobos) and some of the one time visit areas have some ps2 era textures on rocks and the like. But as a whole, the graphics are quite nice.  Sound/Voice: The Technomancer does sound rather well for the most part, hitting people with your staff and getting hit has the satisfying thud you'd expect it to and the slow down on critical hits warps things just enough to be cool. However some lower feedback on the technomancy powers rather than some rather just ok electricity noises and while most guns are literally nail guns it would be nice to have the real ones have some lower feedback as well. The voice acting for The Technomancer is pretty hit or miss from character to character from line to line. The main character is often rather deadpan but has good timing and sometimes does show some good emotion. Standout perfomances include Phobos and the darth-vader without the helmet sounding villian who while menacing doesn't appear often enough to appreciate his intimidating presence.  Performance: I didn't take an exact framerate count but the game ran rather smooth on two R9 290's and never had any significant graphical issues.  Verdict:Overall I'd give The Technomancer a 7.5/10. The story in this game is absolutely great and the ending was a particularly sudden and interesting conclusion, with a fallout 3/NV esque narrative epilogue going over your choices and explaining the fates of the characters. The gameplay is good enough but could have used some variation. Now the one thing you do need to understand getting into the game is it is NOT The Witcher. It has a definite feeling of technical jank and some weird control issues. But overall it shows that Spiders as a studio is learning and improving. I'd reccomend the game to anyone who likes great stories and doesn't mind some slow gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "If you like a deep and engaging story, I highly recommend. If you have played Mass Effect, this may feel familiar, but the possibility of this feels all the more real with the way our world is spinning today and the the possibility of this happening may not be so far away. Haven't finished the game yet, but I am loving it and not wanting the game to end. I see a series possibility with this one. The story and quest line all fit. Not overwhelming like Dragon Age Inquisition or Witcher 3 can be. All quests can affect each other, even side quests. Also, be careful who you ♥♥♥♥ off, and how you respond to NPCs, cause they can bit you VERY MUCH later. I see a lot of replayability as well. Awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "If you like a game with a story, where your choices have different outcome, then i would recommend this game.  The only down side is, when you have finished the game then it ends there, so you can't play after the end.",
            "review_score": "1"
        },
        {
            "review_text": "I'll put positive, but I wish conflicted was an option. I admit I havent played a whole lot of this game thus far, but I've gotten a feel for it soo...  Pros:  Very cool atmosphere and world. It's feels cohesive and the visuals are interesting and apropriate for the genre. The story has gotten off to a strong(ish) start. I can see where it might lead to interesting places. The combat is challanging but not enough to make me full of rage.  Cons:  Really really wish the camera would stay centered on my back automatically. Or better, a first person mode. The camera can get kinda wonky in combat. The combat controls are not intuitive at all. it takes me to long to figureout which combonation of buttons lets me use healing or switch weapons. and the menue doesnt pause it so you dont have time to figure it out. The faces are creepy. whoever did the animations in cut scenes really really did not know how moths work. it's creepy to watch. ",
            "review_score": "1"
        },
        {
            "review_text": "Instead of reviewing this game directly, I'll post how it fares to other RPG games made by Spiders team.  Mars: War Logs was OK. Bound by Flame was average. Technomancer is pretty good.  So take this into account, if you played other Spiders RPGs and how you liked them.  Update: And now, my review does not anymore contribute to the Steam user review score, since I bought the game from GMG. Great play Steam, bravo...",
            "review_score": "1"
        },
        {
            "review_text": "It's true this isn't a AAA game. It has its quirks but personally I find myself enjoying this so far. The sci-fi aspects remind me of Mass Effect and the game incorporates many features I love with most RPGs. There seems to be a karma system, relationships and allying with companions can give you not only more story or insight into them but also stat bonuses. The combat stances and trees you can put points into are pretty interesting. You can switch them on the go or in combat to adjust to what you're up against. The crafting/scavaging system is not too simple but yet not overwhelmingly advanced. I play with a controller and I do not have any issues with the movement or fluidity of combat. If you enjoy games like kotor, dragon age origins or even mass effect, I would recommend this game. 8.5/10. Will update as I progress.",
            "review_score": "1"
        },
        {
            "review_text": "After 30 hours of playing the game and completing the game i have to say i really enjoyed it.   The setting is gorgeous is dodge focused but they have done a good job on being able to break out of animations so you can dodge mid attack.   There are some occasional ♥♥♥♥♥♥♥t moments where you get stunlocked and killed, but if you can get past that and the weak voice acting there is an interesting world, with an interesting story. With some character development. It kinda feels like it needs work though, like it was alittle rushed. Especially after the 2nd chapter. They've created a gorgeous world to run around in.  I would have liked more lore items in the game, and for the 3rd and 4th chapters to be fleshed out more. It would also have been nice if your party's opinion evolved as you they learned about each other.   despite those and a few other issues the game was fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Great RPG that starts slow but becomes really nice once you reach chapter 2 (story and visuals really pick up from there).  However the combat is challenging and requires some getting used to, even if you play on easy and are only here for the story. If you've played The Witcher or Dark Souls, it'll probably feel familiar.  If you're not too worried about having to learn how to fight in this game, and you're looking for a great scifi rpg that has lots of stuff to do (30h of gameplay on my first run) with new areas to discover in each chapter, interesting companions (some of which you can romance), plenty of character customization, and a nice story where your actions have a huge impact, then give this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "You know what? This is a pretty interesting game. The voice acting is like...teetering on the line of bad and good. Some of the dialogue sounds strange, however actually some of the voice acting is really endearing. The first couple of team mates you get sound like normal people I've had classes with.  Anyways - the combat is fun. everything moves really fluidly. So far the crafting seems really in depth and rewarding.  Do I wish I couldve playeda female? Yeah. No beard option for my bro dude? Sigh.   BUT it's still fun. Check it out while it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Well this is going to be hard. Is The Technomancer a perfect game? Definitely not. Is it a good game? Hell yes!  It reminds me Witcher 1 or the Gothic series. It is rough around the esges, sometimes clunky but it is... superbly different? No AAA developer would have guts to make this game.  Distopian civilization abandoned on Mars? An order of Technomancers used mostly to protect the elite and abuse others? With their own dark secret? All this accompanied by amazing music of Olivier Deriviere         YouTube™ Video:  The Technomancer - OST - Lost Transmission&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Before the review I will say the game runs at 1080 60fps ultra on my i5 4670k, gtx780 and 16gb of ram.  I haven't played much at the time of writing this, but I wanted to put in a positive review while the game was still on sale. This is another game from Spiders, and if you have played their previous games than you know what you are in for. I enjoy their games and always buy them because they fill spot in game development that is near non existent: The B quality game. This is not an indie game, but it isn't AAA either. The games from these developers are what you get from a decent sized team with a decent sized budget, and they are some of my favorite games to play.  The game was priced at $45 at release (I purchased at $30) and that is how the game should be thought of as. Not quite the full, huge AAA experience of a $60 rpg, but of higher quality and depth than a $20 indie RPG. Technomancer fills a space often left out of development, and I applaud the developers for creating the game they could and releasing it at this price point. There is such a gap in new releases between the $25 and below small releases and the $60+ AAA games that when a game can release at what feels is a price worthy of its quality I love it (Looking at you, No Man's Sky, the $60 game that should have been $40).  ",
            "review_score": "1"
        },
        {
            "review_text": "I dont write many reviews, as I have always taken the stance that my opinion is going to vary heavily from that of others, and that each person will experience a game in his or her own way. However after reading IGN reviews and some of the reviews posted here I feel almost a moral obligation to discuss a few things.  Is this game a blockbuster grade A title...No it is not.   What i have found from my time in this game has been something extremely refreshing. A game that takes chances, doesnt try heavily to be something else just because it has had success. The game doesnt hold your hand and honestly rewards those who pay attention to the game world, the lore and the characters in it.   I have had a wonderful time playing this so far and I would absolutley reccomend it to anyone on the fence that loves RPGs.   Dont come into this game expecting something that is going to rival the Wticher 3 or have the polish of games with much higher budgets. But if you are looking for a great time-dump with some fun gameplay and a great sci-fi feel this game is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend the game BUT there are a few design issues that make this game definitely not for everyone. If you have played Bound by Flame andmost of all Mars War Logs and liked them - go ahead, buy the Technomancer, you will havea blast. If you hated them, don't bother - it is exactly the same.  It is a 'typical' Spiders game: great story, amazging environments but very rough around the edges with some questionable design choices.  PROS: - amazing, unique setting - great story - stunning environments - well designed character progression - good combat -great crafting (you only make upgradesto existing gear)  CONS: - textures look like a game from few years ago, characters look like Fallout 3/NV - typical 'Spiders' enclosed levels that are reused quite often - too much running around on the same levels - too many pointless fights in areas previously lceared - character progression same as Bound by Flame (Heavy/DPS, Tank trees) - no jumping meaning you can get cornered by enemies in a fight doing sommersaults against the wall  Overall this game is a lot of fun but it is VERY rough around the edges, so you can't enjoy a game with dated graphical elements and design ideas do not bother. ",
            "review_score": "1"
        },
        {
            "review_text": " I very much enjoyed the game!",
            "review_score": "1"
        },
        {
            "review_text": "Don't know why people are complaining about the story so much, I thought it was better than dragon age inquisition's story.  DEAL BREAKERS:  -The game is poorly optimitized. (I'm running a GTX 970 and it drops from 60 to 45 no matter what settings I put)  -Quest breaking bugs (In certain places, if you open a door too early or you get something too early. It can halt your progress)  If the developers can fix these problems then it would be worth the full price tag   CONS:  -Combat gameplay isn't that great (problem I have with it is that if I block or dodge I still get hurt, doesn't register fast enough)  -Useless companions (Most of the time, the AI companions just stand there doing nothing)  -Too much feminism (Its okay if 1 or 2 characters are feminist but almost all the main female characters are feminist propaganda, people are always asking for strong female characters but this game is just pushing it)  PROS:  -Characters (aside from the feminist thing, the characters and companions are really cool and interesting)  -Decisions matter (things you do will affect your surroundings and responding to your companions will influence their affection toward the main character)  -Crafting system (crafting parts for your armor will change its appearance and add stats to it)  -voice acting (Most of the voice actors fit there character and aren't bad)  -Story (People say it is boring but it is comparable to the first mass effect)  -The Ending (It actually mentions the descisions you make and how they affected the world instead of giving a red, green or blue ending)",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game. It's got good graphics, so far the story has been interesting, and its got a fairly decent open world. That being said there are a few things that are disappointing, the character's mouths as they talk are not smooth, and the voice acting does leave something to be desired, the companions are ok I guess (This is no Mass Effect). The biggest thing with this game though is without a doubt the combat. I strongly suggest you start this game on Easy until you figure out which style you like and get used to the weird combat in this game. I'm a hardcore RPG vet, Demon Souls/Dark Souls/Dark Souls 2/Dark Souls 3 and many others, but when I put the game on normal mode sweet lord fighting a group of humans was insanely difficult. Now with all that out of the way, The Technomancer is a decent game from an Indie developer that put a lot of hard work in so if you like Sci-Fi RPGs I say give this one a go!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game preordered on sale, got it for probably 20-30 dollars or something. It's playstyle reminds me a lot of a more mobile knights of the old republic star wars. Honestly a 9/10 game especially for the price. It's a bit short but for 30 dollars it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The Issues People used to give negative Reviews is a mess, this People should be banned forever and never ever play a Video Game again. It was absolutely clear that this Game is classified as a B Class Game with limited Ressources and a small Budget, that wasnt a Secret but the stupidity of certain People giving everything the fault except themselves.  It seems that every little nonsense these Days is a Reason for a bad Review, People dont even play the Game more then a few Hours and talking like full Experts of this Game without any shame and picking Input Device choice as a negative Points of the Game. So many bad Previews before its Release and now this People proven wrong because of a pretty solid Game, dont want to be wrong.  The Games pretty solid and challenging, with its limited Ressources they did a damn good Job. It doesnt go by without issues, no Game did that but thats no Reason for butthurt negative Reviews. The Combat System is extremly tactical and challenging, i dont found single Issue with it except that it is hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "I thought this game was great! I liked the story and the environments.Sure it doesn't measure up to games like AC or The Witcher, but I still thoroughly enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "games pretty damn good. Not exactly a witcher but definately worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Played the game for over an hour now, in my opinion it is a lot like an upgraded version of Mars war logs, which to me isnt a bad thing. The only real negative thing i have to say about this game so far is that the movement is clunky like TW3 when it was first released.",
            "review_score": "1"
        },
        {
            "review_text": "Check out a brief video on my first impressions of the game. The price point should have been $35, but it's ok.. it seems lately i'm always looking for a game to play.          YouTube™ Video:  First Impressions, Gameplay, Initiation - The Technomancer&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest. I love this game. I have a secret fondness for the developers that made this and their games. They're a developer that doesn't have Bioware's unlimited bank account or EA's backing but they do a hell of a job crafting intricate stories and great action-adventure rpg titles. Their stories may be cliche to some, boring to others or downright fascinating to some. I just really dig em. They're good.    The grahics of the game are pretty on par for what tech is available now. While the game doesn't have the dozens of graphical settings some AAA games may have it still looks great. You can tell a lot of work went into designing and planning out levels, gear, weapons and upgrades. Upgrades on your armor and weapons physically presents itself for you to see. It's just not adding up numbers and lo and behold you're more powerful. Theres a real, almost nit-picky attitude about the work that went into the small things. Something you don't see often in rpgs. While the graphics engine is decent, good enough to look good, there are some things some people may complain about. Lip synching is done well but you can tell the limitations at times. Facial design on some NPCs and characters can look a little...well...odd at times. Not bad, just different.    Sound design is on par for your standard sci-fi rpg fare. Weapon sounds sound well done. Combat sounds are really well done. Guns, etc. There's your standard foot stomping going on and some decent voice acting. It's not cheesy, it's not 'cliche', it's pretty good, honestly.    Combat is the meat and potatoes of the game and it shines in this game. It's definitely a step up from their last game for sure and the work that has been put into this game shows. A lot. With 3 separate fighting styles and the added technomancy tree, you'll have many ways to replay the game if you so choose. It's not easy but it's not unforgiving either. It's nicely set in the middle, even on normal play. While the AI may seem wonky at times, it does shine in that the AI will look for weaknesses in your attacks and try to take advantage appropriately. I've been knifed a few times when coming back from a failed parry or guard. The fact that hand to hand combat can be done pretty poorly, even in AAA games gives testament to the work the devs did on designing the system and implementing it well. I like it because it takes a bit of skill to take on a whole group of enemies and not fizzle out once or twice because of mistakes.    All in all, it's a great 'B' game that, if you like sci-fi RPGs you should try. Truly. When I talk about it with people/friends, etc, I like to compare it to how the Gothic games (mostly 1 and 2) entered the RPG world. They weren't AAA games but they were hand crafted with a lot of love for the genre and it shows thoroughly. In fact, I absolutely think this game has more depth to it than even Dragon's Age 3. I think that highly of it. The systems in place just seem better, just work better and seem to be a real immersion factor. Not taking anything away from Dragon's Age 3 but it was a bit more shallow than I was expecting.    My personal rating. Easily, a 7-8. Easily.",
            "review_score": "1"
        },
        {
            "review_text": "Its not a bad game its Ok if you like RPGS you might like this or may not.",
            "review_score": "1"
        },
        {
            "review_text": "its like one of those sci fi popcorn flicks you watch on a lazy weekend. Decent enough but not something that would keep you in a state of awe or anything. Definitely worth checking out on a sale tho ",
            "review_score": "1"
        },
        {
            "review_text": "I reccoment this game but on for $10 or less. Get this game on sale. Pay no more than $10 for it. Do not pay full price. This games is about as good as Mars War logs. If you have that game and havent finished it then you can get a real good idea of how you will be with this game. Mars war logs is always on sale for under $10. Exspect this game to be around the same price soon. Maybe by the next sale. I reccoment this game but on for $10 or less.",
            "review_score": "1"
        },
        {
            "review_text": "So far really enjoying this game, although for whatever reason I could NOT get it to work with any of my controllers including my Steam Controller (but that thing has never not given me some sort of issue...) Works great on keyboard and mouse though, combat is pretty fluid.  Besides that I enjoy the combat I must say its pretty fun rolling around poisoning the enemies and watching them drop while you kite. I will say that the combat did take some getting use to its a lot of dodging and using the windows they give you to attack (at least for a Rogue) I think of it like Dark Souls usually if you mess up in your assault it can be very unforgiving (playing on Hard mode) but I will say sometimes the controls can be clunky and so far only once have I gotten stuck in something but it did involve me being trapped by the enemy x_x Besides that I must agree with others that the voice acting is terrible (but its fun to laugh at) and the graphics are meh but its a nice looking game in some ways.   Overall I must say was very worried about getting this game based on other reviews and I almost didnt, but I must say I am happy I decided to purchase this game its exactly what I was in the mood for and Im enjoying the ride.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is the character models of Divinity II but refreshed with newer graphics and futuristic theme, and to be perfectly honest it felt like i was playing a spread out Star Wars : Knights of the Old Republic..  Game is fun and enjoyable but the constant traveling places youve already been can be annoying ^_^",
            "review_score": "1"
        },
        {
            "review_text": "The North Korean/Corporatist world building is once again Spider's highlight.  It's also their most solid game at launch.  It's an AA game not an AAA game so it might not have the polish of Bioware but it does have more heart.",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is that this game is in no way bad, and honestly is worth a try. If you like action RPG's then this should feel familiar and fun. Quest here, fight ♥♥♥♥ there, earn xp and loot, return quest there and repeat. The story is not the greatest and the characters look lifeless when in dialogue but the story is interesting with some cool lore and power struggles going on.  Pros:  - Challenging but fun combat  - Plenty of game to play  - Crafting and upgrading system  - Skill allocation  - Interesting lore implications Cons:  - Lifeless character emotion  - Boring story (for the most part)  - Terrible companions (75% of the time)  - Sometimes clunky dodge mechanic (except during Rogue stance)  I'd give it an honest 7/10 for being a fun and challenging RPG and still doing enough to keep me playing regardless of its broing story. It does what it set out to do, provide me with hours of sci fi mars headcrushing. Buy on sale if you can because 44.99 is sort of steep for a non AAA RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I had almost no expectations when I considered this game. I recommend everyone follow this practice, it makes every game better.  I enjoyed the ♥♥♥♥ out of this game, almost every second of the way. The only complaint I have is the enemy respawn rate. They respawn REALLY fast, which makes wandering down a tunnel over and over for quests... kind of a pain. Thankfully, the game has a very enjoyable combat system, so I couldn't complain too much about it.  9/10, and I recommend this game to anyone who enjoys games like Mass Effect or Dragon Age.",
            "review_score": "1"
        },
        {
            "review_text": "  If you liked Mars: War Logs, this is for you. Much better graphics, better characters, better dialogues, amazing character progress and its many possibilities makes this game long-time run. There are thing I like and things I don't. This game reminds me of The Witcher 2, with every pros and cons because nor Witcher 2 was 100% perfect and there were some design mistakes too. For example, in Technomancer you have to press button and watch animation when jump down from higher places, you have to run a lot from place to place, you don´t see dropped loot on the map, some dialogue animations are really poor etc. These are small details which can destroy overall great atmosphere and gameplay. Dialogues and decisions are well advanced now and you can even switch between three fighting styles in a second (for example when you fight boss and his companions/animals). Deep character progression, choices how you behave in the world, fighting and well developed RPG elements are good reasons to play it, or give it a chance at least.",
            "review_score": "1"
        },
        {
            "review_text": "Does this game have a couple of flaws? Yes. SO does any game EVER! I can't comprehend how IGN and over game reviewers are hating on this game so hard. People praise dark souls for being an extremely hard, yet rewarding experience. But they won't accept the fact that Technomancer falls along the same lines of difficult hack-and-slash play. The game has a good and interesting story with a fun combat system. If you are willing to be a little patient this game is a rather rewarding experience.  ",
            "review_score": "1"
        },
        {
            "review_text": "great game love the choice element reminded me of knights of the old republic. good combat system, three distinct styles i mostly went warrior but went rogue when i needed faster attacks.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Star Wars , but not quite . It's like Mass Effect , but not quite . It's like The Witcher 3 , but not quite . It's like Mad Max , but not quite . This is the game that could , but not quite . I'd recommend this game , but not quite .",
            "review_score": "1"
        },
        {
            "review_text": "I love the feeling this game gives. Let's go to Mars.",
            "review_score": "1"
        },
        {
            "review_text": "[Ive only played the game for 5 hours] This game is something too play and i really like it. The classes in my opinion are very nice. The game seemed a little hard at first but once you get a feel for how it plays it will get easier and i respect the difficulty because its not very hard but it will challenge you a bit depending on what your playing on. since i saw this game a little while ago i got excited for it and am not disappointed so far. i would give it about a solid 8.7/10  its about a couple days later and i beat the game. in the end i was a level 37 and completed the game in 12 hours doing mostly all side quests and playing as a guardian. The story was pretty good i liked it but it was kind of short. i played the game on normal and it was still pretty hard at times and did make me mad. [Ahead might contain spoilers] some things about the game i noted was that it got difficult too fight enemies when they were in large groups it was a lot of dodging hitting and stopping too heal. The people with guns made me mad the most and almost made me quit sometimes. The side quests did get annoying nearing the middle/end because it was a lot of traveling from ophir to noctis to mutant valley and just going back and forth the most annoying about this was the underworks because enemies would respawn everytime you go back and you would get constantly attacked. and lastly the boss fights were a little hard they did take a couple of tries until i got a feel for them and then they got kind of easy. The very last boss fight i actually found kind of a glitch too complete because i was getting really salty [comment if you want me too tell you the glitch]. Then there were little things like the way the game looked but it didnt look incredibly bad. overall i think the game is worth a play but at 30-40 dollars is questionable. i can understand why people would give this game a low score but overall i liked it. it may just be that i just like these kind of games so i may be a little biased but you cant really expect a witcher 3 out of it either. i think the idea of the game has a lot of potential i would love to play a sequel, i have not played the mars game they made but after this i might have too. i just think if they had maybe a little more money this game or a future game would be really good overall 7/10 ;]",
            "review_score": "1"
        },
        {
            "review_text": "  If Steam had a neutral rating I would probably give it to The Technomancer. The game does some things well but at the same time could have used some work in other areas.  First if you have not played Mars War Logs I would recommend it since The Technomancer is a sequel/spinoff that takes place in the same universe. The early game's story is explained in a way that it kind of assumes that you have played Mars War Logs.   Overall the combat is good and bad at the same time. I actually really like the ability to switch between the different styles with two buttons. This makes switching styles really quick and easy. The combat thrives when you can change your style to fit your situation. The problem with the combat is at times it feels a little clunky. The combat also relies on spamming the dodge button until there is an opening to attack enemies.   The upgrade system is pretty nice. The problem is that it kind of forces you to focus on one or two styles or you won't be strong in any of them. The equipment and crafting systems are okay but I never really got into spending more time on them than I had to.   Difficulty wise I would say the game is moderately difficult. This isn't a game where you can really just mash attack buttons since you are going to be dodging more than attacking. The problem is that the game does nothing to indicate if you are strong enough to complete a mission. I encountered a couple missions where I encountered a bunch of enemies that killed both of my companions within seconds which forced me to fight all of the enemies at the same time. That did not go well.  The game also has some graphical/technical glitches and bugs. This is from the pre-release copy of the game though so the issues might have already been resolved or could be fixed really soon. None of these bugs are game breaking but kind of take you out of the experience.   Overall The Technomance is neither a bad or great game. It is a solid game that does some things right but has some issues as well. If you really like these type of action RPG games you will probably enjoy the game but there are better action RPG games out there.  Check out Geeky Hobbies for my   full review   [www.geekyhobbies.com]  of The Technomancer.",
            "review_score": "1"
        },
        {
            "review_text": "Hello internet traveler. Is The technomancer great game? No! Is is worth it? Yes!  If you are into story driven action games with some RP elements (gear and talents) this will please you. If you are into AAA titles with countless replayabilities, this is not for you. Simply said, The technomancer is worth its money, no more no less.   +Good Mars feeling (Total recall-ish, if you remember the movie), conspirations, agendas, everyone is your enemy. +Great music, one of the first games I play with music on +On the fly weapon style changing. Go prof or go hybrid, it is up to you (combat slowmotion is fun) +The best 'dodge' reaction I have seen in a game. Ever! You press dodge it executes, even a nanosecond from beeing hit  -Not main quests are boring as hell :D You gonna walk in same areas multiple times, wanting or not (Hello Dragon age 2) -Voiceacting is terrible. Npcs are somewhat soulless (with some exeptions - Anton Rogue is awesome) -Poor creatures variety. Humans, mutants, and 2 - 3 native species of bugs. Not many 'epic' boss battles. -Almost non to non character costumisations. No gendre change.You are the MANchnomancer. Couple of haircuts and skin colours..  6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Rough diamond! Not sure if it is worth the bucks they ask for, but i paid it and i love it for what it is worth!  If you are thinking of buying this (watched the gameplay vids and it suits you) wait for a sale. If you are like me, love the atmosphere of this creation - buy it asap! ",
            "review_score": "1"
        },
        {
            "review_text": "not perfect but has alot of things going for it. Pros:  -the setting is unique and interesting -looks really good -interesting factions and plot -combat 'can' be fun - mass effect feel with progression - not open world but makes use of its environments well Cons: -quests/missions get a bit repetative -while there is alot of combate options, some are cleearly better then others - very mixed voice acting. (the main character seems to monotoned to me)  overall i would deff recomend this to any fans of games like mass effect or dragon age. Has some feel tho maybe less polished.  7/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Aside from running into a gamebreaking bug I can wholeheartedly say up untl now I liked this game. Somehow reminds me of the KOTOR games. I'd say a 7/10. A few things are really annoying, like no fast travel mechanism in one area, which would speed up the stupid walking between quests. And I'm pretty sure that there is no real balance. I thought the game at the beginning was way harder then it is now. I also dislike that you are a Technomancer, the most badass of the badasses, unfortunately you are equipped like a ♥♥♥♥♥♥♥ pawn. Aside from that though, everything is fine. Very itneresting world and story, interesting characters and much much more.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "I do wish there was a mixed button as i like the game but there are some really bad design decisions  an example is there is no forwarding through conversations AS IT SKIPS ENTIRE SCENES or the fact the the right click is the same button as dodge and skip so half way through combat a cut scene may occour and you have just pressed dodge guess what no you have t o reload AND DO IT AGAIN TO WATCH A CUT SCENE   i like the story the combat is easy to learn and master but by god there are some bad things here",
            "review_score": "1"
        },
        {
            "review_text": "I've only played the game for a bit. But my initial feeling towards the game is that it reminds me a lot like the Witcher 1 and 2. It's got an interesting story, and somewhat mediocre combat in the beginning. It's cheap, and made by a small time company. I bought it and I've been pleased with my purchase. If you enjoy RPG games and have delt with less than satisfactory combat in the RPG games, then you'll be pleased with this purchase. The combat honestly gets better the further you go.",
            "review_score": "1"
        },
        {
            "review_text": "Someone said 'I'm a modern ♥♥♥♥ing sisyphus tasked with ♥♥♥♥♥♥♥ in the ocean.' so great dialogue  The crafting looks cool too. like the weapons end up looking cool.   I hate that I can't bind my mouse buttons to things in the game though. like mouse 4 and 5 wont work  Also I'd like to be able to see what weapons look like before I buy them.",
            "review_score": "1"
        },
        {
            "review_text": "English and Russian.  This game is that sci-fi type RPG that almost forgotten today or perverted to unknown combo-formats (consoles mostly). It has all that need good RPG, except piar - style, story, good combat system, hero, monsters and struggle. I'm a very old gamer and i say with time there are little good things are maded - but this one is worthy. So buy, play, choose, enjoy. Only minus of game - presence of homosexuality - BIG mistake developers.  Эта игра по типу фантастической РПГ которые сейчас почти забыты или извращены в неясные комбо-форматы (по большей части консольные). У неё есть всё что нужно РПГ, кроме пиара - свой стиль, история, хорошая боевая система, герой, монстры и борьба. Я старый геймер и скажу что в наше время хорошего почти не делают - но эта игра стоит своего. Так что берите, играйте, выбирайте, наслаждайтесь. Единственный минус игры - наличие гомосятины - на кой хрен разрабы вы это впихнули сюда?",
            "review_score": "1"
        },
        {
            "review_text": "I'm sorry i cheated at first to know all the skills now i reseted the game and i am currently playing in extreme mode :D",
            "review_score": "1"
        },
        {
            "review_text": "+story +combat +mars +graphics -fps issues",
            "review_score": "1"
        },
        {
            "review_text": "Here's the thing with this game... It's solid, but it's not great. It feels so limited at times, when it seems like it could have been so much grander.   The things I enjoy:  *The setting - being on Mars is cool, I like their take on it... *The combat - It's fast paced and fun. I played as a rogue with all the technomancy powers, so lots of rolling, dodging, shooting, stabbing and electrocuting. I hear a lot of people saying it's too hard, but I didn't think so at all. *The story - it may not be the deepest or most intriguing, but it's reason enough to keep playing. *The loot/crafting - again, it's not the deepest, but it's enough to give you variety and reason to search out new 'recipes'. I remember playing through Torchlight and having to live in the menu because there was too much loot. This is on the opposite end, I spent most of the game with the same dagger, but upgraded armor more frequently. Crafting is simple and effective. *The companions - Although this is where some of the hiccups/inconsistencies in dialogue occur (your companion will go from highly emotional after you complete a companion quest to acting like nothing happened seconds later), I like that you can bring different companions along for different perks.  The things I did not enjoy so much... *The sidequests - too many fetch quests that have you running tediously from one end of the map to the other, wading through tedius mob after tedius mob. *Which leads me to my next dislike - this game gets really tedius about 3/4 of the way through, the mobs of ASC in Ophir are enough to make me want to rip my hair out. *The map - When you first see the world map, it looks like you are going to explore a vast array of envirionments, when in fact it boils down to a handful of locations, honestly 90% of that map is just for ships and giggles... *The dialogue can be really inconsistent - as mentioned above, your companions go from crushed to happier than a pig in poop in the span of one conversation like they have instant amnesia. It makes the world lose some credibility. *My last dislike is the lack of enemy types - I understand that you are going to fight people and that's fine if they don't change, but I would have enjoyed a bit more variety of creature types in the wild. I would say less than 10 types of creatures to fight.  All in all, I do enjoy this game. It reminds me of KOTOR, Dragon Age and Mass Effect. It's fun, but limited. You can do a lot worse out there these days. It's not a game for everyone, but it's definitely a game for people who like Action RPG's and don't mind if they are a little bit rough around the edges.",
            "review_score": "1"
        },
        {
            "review_text": "Look, this game full of unrealized ambitions, all things in there were made better somewhere else. Writing is weak, dialogues are boring, characters are flat and uninteresting. Fighting is easy and monotonous, all quests are pretty much the same, music is unremarkable. And everything on the list they could do better, if only someone would try a little bit more than that.  For first 5 hours of gameplay I felt like I can forgive most of game issues. There're not many RPG's after all. But at some point I found myself thinking - that's it, there will be nothing new here. So I played it a little more, got bored and turned it off. Then I tried again and it get even worse. Every time I tried to finish this game - I couldn't. And now I just realized - I will never finish it. It's just boring, bad and not even close to worth it's price. ",
            "review_score": "-1"
        },
        {
            "review_text": "Super clunky controls with certain keys doing things they shouldn't. For me moving left off a knocked out opponent randomly killed them resulting in Karma loss, changing weapons worked for about 30 seconds until the weapon was randomly moved back to staff. This game has been around for a while now so there is little excuse for such basic roughness. The voice acting and scripting also seems fairly wooden. More importantly, mash left button repeatedly to perform attacks means that there is little real difference between the three class paths so skill trees seem tacked on. Stealth attacks do not instantly kill your target and will alert every other enemy as soon as they are made making them fairly pointless. I will be requesting a refund despite it's possibly being worth persevering with at the sale price. An action based RPG with bad controls just isn't worth the effort when there are so many better games you could be playing.",
            "review_score": "-1"
        },
        {
            "review_text": "It is ok, but i personally felt the story was lacking in interest, and there are very few locations to visit. It is not open world per se, lots of coming and going is done within the large settlements/city. Only decent thing was upgrading the skill trees, but after a while, even the combat gets samey and boring, and even on hard, combat is not that challenging. A good attempt, but many better rpgs out there in a purer form of the genre. AI is not very smart either",
            "review_score": "-1"
        },
        {
            "review_text": "I cant stand a game that hasn't put much - if any - thought into pc controls. The little hesitation before you run is terrible...The voice acting is also terrible...Like the first resident evil terrible. But not on the cut-scenes and some of the dialogue in the city.   I had to stop playing. So If you are playing with a controller, and you don't care about voice acting...didn't seem too bad for the short time I played it.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game. And I did, for a while, despite the uninspired story, bad writing and even worse voice acting. But in the end I just didn't care enough to keep fighting past the tedium.  One of the biggest complaints I've seen is about the combat system. I personally thought it was fine, after re-configuring the keyboard controls. It is even elegant and fun, once you get the hang of it and learn to time your attacks.   But combat can be very unforgiving, and if you make a mistake you will die quickly. It can be very frustrating to be almost done with a tough fight, and then get 2 shot from out of nowhere.  For all that, I think it is a worthy effort and I do not regret the 35 hours I put into it. If this game goes on sale, it would be a fine way to pass some time and explore a new (not very big) world. But for full price it isn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "I was seriously hyped for this game, but the moment I started to play it I felt a sinking motivation. Not only was the Prepurchase 'Free Soundtrack' utterly dissapointing (I could remake that soundtrack with a basic music program, and hearing the same tune over and over and over again really does not do much for immersion), the main game was lacking in too many points for me to enjoy. Voice acting is random and totally out of sync with the characters movements, quests are basically running up and down, without a clear path finding, and the reputation system is not explained nor used. Even with the patch, the game is a result of too many development departments not working together enough, resulting in a mix of the occasional 'good moments', but the majority is badly put together. The graphics are the sole Grade A of this game, but for some one who plays a game like this hoping to find a good story, it just doesn't deliver.  The devs have released a patch, sorting out a few gameplay issues, which shows that they listen to the playerbase. Kudos are due, not many companies to that.   But to save this game, they would need to seriously redo the voice acting and the quest finding.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is beautiful and the store is ok.... but the combat is the worst theing i have ever had to deal with and it ruins the game",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game, it is not finished. You will dodge, get stuck in between or on objects, and die. Over and over and over again. Infuriating.",
            "review_score": "-1"
        },
        {
            "review_text": "I personally have been unable to play the game for more than 10 minutes at a time. In the 80 minutes or so I've played this game, it has crashed 7 times. The game is unplayable for me.  It's such a shame, because the 80 minutes I've played, I really enjoyed. I just wish I could see the rest of the game.  EDIT: I posted in the support forum and have received one reply. I have then been ignored by the developers. I personally would stay away from this game unless there is a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "The combat mechanics in this game, something that is as core as guns in a shooter are just completly awful. most of your blows really have no impact which really killed the game for me in my opinion. not only that but UI is pretty bad, and the game decides to give you choices which dont really matter. i might not have played it long enough but i was pressed on getting my refund...",
            "review_score": "-1"
        },
        {
            "review_text": "Janky and boring fighting mechanics coupled with dodgy facial animation.",
            "review_score": "-1"
        },
        {
            "review_text": "Has game breaking glitches. Not recommended until patched.",
            "review_score": "-1"
        },
        {
            "review_text": "i hated this game. the graphics and combat ai were horible and did not at all live up to the hype of the trailer. it was a complete waste of money in my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "First, I like this game. I liked Dragon Age 2, and Dragon Age Inquisition, and I think the designers of this game did as well.  That said, after about an hour and a half of playing, there are some bugs. Or, you know- a hive of the things.  Recomendation: Don't buy yet, let them patch some of this stuff.  Now we can address the hive of bugs! Firstly, the facial animations seem really, really stiff. I mean 'rushed production' stiff.  Next, the combat. I will freely admit that I use cheat engine- I like the feeling of laying waste to enemies by the dozens, and the electrical attacks of the Technomancer have a very Infamous Vibe. That said, the bugs appear when trying to lay waste to the small packs of enemies I have encountered so far- where the enemies have no real cordination and swarm me. HUMAN ENEMIES SHOULDN'T DO THIS! Seriously Devs- The AI for insects should be different than for human enemies, and it really doesn't feel like that. Adding more issues to the tally, there is the level system. I have used cheat engine to aquire thousands of EXP because I like the feeling of laying waste to my foes in interesting ways. Level 44 means you can fully upgrade 2 skill trees, have 9 points to spend on dialogue option counters, and have 12 points to spend on the four atributes. Sounds good so far right? But that's where the leveling stops. No more points, no more upgrades, no more choices on the attributes. The counters just didn't let me go any higher. I can see the level system stopping when you have maxed out everything, but geometric progression isn't that hard to work out (mathamatically), and being able to become a jack-of-all-trades, while not impossible, should be difficult. I understand this. But for those of us who want to play the game for the potential story, this becomes a problem- playing the game more than once is fine, but really guys? I would like to be able to run with as many options as possible at first, just to see what the game can do.  AND THE CUTSCENES! Oh geeze, guys- there is a major problem here. The characters are overly robotic, the dialogue is very forced, some of it just doesn't mesh with the enviroment or people, and what you are wearing doesn't translate into the cutscenes. I don't lnow why the last point annoys me so much, but it does! When I (the character) am wearing goggles, I cannot help but want to see them in the cutscenes. It ruins immersion, and destroys the general feel of the game. Oh- and snapping. The animation that plays when you search an enemy shouldn't cause your character to just jump to slightly better position to play that animation. On top of that, the mechanic of dropping down walls is cool and all, but shouldn't you be able to climb back up some of them? The snapping is also annoying there, as I can be near the edge of a ledge next to a wall, then snap to the middle of the ledge to drop down.   Fix these things, and I would recomend this game... But until then, NO.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to enjoy this game, but I cant stand the combat stances, and the slow motion fight scenes at random are so disruptive.....Thank god for return policy",
            "review_score": "-1"
        },
        {
            "review_text": "Played just 40 minutes and died about 20x! Mouse and keyboard controls are crap in this game, fighting techniques unintuitive and even not explained in the shortest tutorial ever. At least I have tried the 'refund' option on Steam for the first time.",
            "review_score": "-1"
        },
        {
            "review_text": "Not what I expected. Combat is clunky and story held little interest.",
            "review_score": "-1"
        },
        {
            "review_text": "Clunky and boring, terrible voice animations. Plays like a game that came out 10 years ago. Graphics look alright.",
            "review_score": "-1"
        },
        {
            "review_text": "so, i'm level 5 in the game, and i NEEDED to look up a way to beat the first boss, ON EASY MODE!!! even then the suggested method was so irritating for a game that says that you can play any way you want, you NEED to use a specific weapon group, and a specific move on said weapon in order to have a snowballs chance, if you want my opinion on this game it's a pass, i REALLY want to explore the game world, but when i am swarmed by 5 humans at level 5 early in the game, and die in 5 seconds after initiating combat, there is something wrong, in my opinion, there need to be tweaks to this game, it feels like the combat was rushed out, and has yet to be tuned correctly, once that error in the game is fixed this game becomes a must buy, but as it is, i unfortunatley cannot play it, and i cannot reccommend this game until it gets fixed",
            "review_score": "-1"
        },
        {
            "review_text": "If you want a hack and slash with rpg elements this is the game for you If you want a game with a compelling story steer clear of this game",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so entertaining that I fell asleep while playing it.  10/10 would use it again to get a good nights sleep ( -.- ) zzZZ",
            "review_score": "-1"
        },
        {
            "review_text": "I do not find the story in this game very good, I have not played through the whole game. But this game claims to be an RPG yet you are forced to stay on one path, the game is a hack and slash game. You have rooms of 20 ememies thrown at you that you just spam buttons to kill. Many of the conversations are one sided.  If your a fan of Fallout, Skyrim or even Mass effect and your expecting a similar game of the same quallity you will not find it here. You cannot aim your pistol, you just spam a button to fire. The game is too flat and does not allow you to play in your own style, if i want to shoot somone in the leg i should be able to shoot them in the leg. I do realize that this is a hack and slash game but i do think the game would be improved if they dropped the boring hack and slash element.  I myself would as one of these superwarriors prefer to walk into a room of 5 enemies having them fear me by just seeing me, rekognizing my power and showing fear as i put them down fast and easy. In this game you follow a path, you do not chose to talk or to fight, the game choses for you and if it is a room whit enemies there will be a bunch of them and you will have to spam your buttons instead of relying on a rifle or pistol and your own skill. Whitin the first 10 minutes of the game you dont feel like you are part of the story and you will be attacked by random bandits for no real reason. The how to play tips in the corner of the screen you may also find passing too fast for you to read many of them.  You cant be a skilled player that puts people down instantly, in this game you are supposed to be skilled but you feel powerless having to bash people for 5 minutes before they go down. I really dont like hack and slash games so that is my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "Nope",
            "review_score": "-1"
        },
        {
            "review_text": "[Updating review because I stepped on a few snowflakes]  Pros: great graphics &amp; possibly a storyline [only played 30min] Cons: combat controls are over the top and cumbersome [in my opinion based on playing games since 1985]",
            "review_score": "-1"
        },
        {
            "review_text": "For all Roleplay-people: Bought it today, game is clearly not a AAA-Title. But it seems great. One big minus for me: the keyboard/mouse-version has no walking-button. You always have to run. This is crazy! All the 'walking-coolness' of the main character - gone for all key-board users....",
            "review_score": "-1"
        },
        {
            "review_text": "I hated myself for finishing this game",
            "review_score": "-1"
        }
    ]
}