{
    "app_id": 338310,
    "name": "Warden: Melody of the Undergrowth",
    "release_date": "2016-04-08",
    "developer": [
        "Cardboard Keep"
    ],
    "publisher": [
        "Cardboard Keep"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "achievements": 43,
    "positive_ratings": 48,
    "negative_ratings": 10,
    "price": 15.49,
    "description": "Trapped in an ancient forest, a young prince searches for a lost god. Here he befriends the spirit of a young girl and a volatile child, and they quickly find their destinies intertwined. Third-person action-adventure inspired by genre classics of the N64-era.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/338310/header.jpg?t=1542151221",
    "minimum_requirements": "OS: Windows 7 Processor: 2009 or newer dual-core Intel or AMD Memory: 3 GB RAM Graphics: GeForce GTX 500 series or Radeon HD 5800 series DirectX: Version 9.0 Storage: 5 GB available space",
    "recommended_requirements": "OS: Windows 10 Processor: 2011 or newer Intel i3, i5 or i7 Memory: 4 GB RAM Graphics: GeForce GTX 660 or Radeon HD 6850 or better DirectX: Version 12 Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "Great game with very simple. yet sometimes challenging gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, Played it at Pax Aus. Havent played much of it but what i have played is really enjoyable, Looking like it will have a good story, Would reccomend this game to all. the guys at Cardboard Keep have done a really great job with this game. Good Work guys and congrats on the release of the game!",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent, highly enjoyable throwback to the n64/gamecube LoZ games and is well worth the money.  Be forewarned though, there are bugs...lots of bugs! The developer has been putting out patches almost daily to fix them, but there are still lots.  All in all, a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Okay, let me start by saying that Warden: Melody of the Undergrowth is not a polished game.   However, with that out of the way let me just say that this is one of the best experiences I've had in a long time. Once you get passed the poor camera angles, impossilble lighting, and bugy enemies this game has a lot to offer. If only in nostalgia onlone this game pays back your money tenfold. If you want a gameplay experience to remind you of the good old days with Banjo Kazooie, LOZ Ocarina of time, or even Windwaker with many fun and modern twists and enhancements this is the game for you. I highly recomend giving it a try especially at the price you will not regret it. Unless you are deathly afraid of poor camera angles. Then stay far, far away.",
            "review_score": "1"
        },
        {
            "review_text": "Good story but THE BOSSES ARE TO HARD AND NO FAIR   unless you like the Type of game where you can'y win against a Big boss (the 1 crystal boss) then this is your game  it also feels to basic like the tried to make a game that combines like zelda and a few others together in a bad and dull version",
            "review_score": "-1"
        }
    ]
}