{
    "app_id": 338540,
    "name": "Navy Field 2 : Conqueror of the Ocean",
    "release_date": "2015-03-05",
    "developer": [
        "SDEnterNet"
    ],
    "publisher": [
        "SDEnterNet"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Massively Multiplayer",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Naval",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 599,
    "negative_ratings": 714,
    "price": 0.0,
    "description": "Navy Field 2 is the follow up to Navy Field, the original pioneer of Massively Multiplayer Strategic Online Naval Warfare. Cooperate with your team to maximize the potential of your vessel as you face off in large-scale naval battles. Challenge yourself to become the ultimate captain!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/338540/header.jpg?t=1461258142",
    "minimum_requirements": "OS: Windows XP, Vista, 7, or 8 Memory: 4 GB RAM Graphics: Onboard DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows XP, Vista, 7, or 8 Memory: 8 GB RAM Graphics: Discrete DirectX: Version 9.0c Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "What could have been a good game, has turned into a piece of garbage. It is deffinatly a PAY TO WIN game, that non wallet warriors have little chance of success. It seems like it is following every other cash grab games plan.  The game play is interesting enough, but the science fiction that it incorporates is VERY dissapointing...I still cant get over how games can scew up HISTORY....This one is no different......a few examples.  1. teleporting of ships....REALLY??? 2. Desrtoyers (wallet warrior) that can take 8 Long lance torpedo hits (most Destroyers could not survive 1 LOL) 3. Landing Craft that can outrun a Light Cruiser with armor to rival a Cruiser (they look like PT boats they are so fast)  Then we can get into the downtime of the game as of late...not good, with them changing their minds like their underwear on issues they are trying to 'fix'....ends up WORSE!  I gave it 3 weeks of play before writing this review to be fair....Just fyi.  I had really hoped for it to be better.",
            "review_score": "-1"
        },
        {
            "review_text": "Go play World of Warships.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not bother with this game it becomes a match of hide in the dark and shoot quickly. You can never have fun because of this and its extremely unrealistic and unbalanced. It makes carriers the number 1 ship because of this.",
            "review_score": "-1"
        },
        {
            "review_text": "The game as a MMO offers good team-working gameplay.  As a historical simulation game set in certain period of our history it excellently simulates 2WW-Era naval battles,  giving real difference among certain ship classes and their role in battle.  There are ofc real cash paid items, as in every freemium games, but they are giving you only a slight advantage. What matters the most is  player skills  - both tactical, and manual. This scecond plays the bigest role, when you decide  to use - in my opinion the best feature of the game - manual keyboard ship gun aiming control. (in WW2 there were none point&amp;click aiming systems!)  The game has some disadvantages, nothing and nobody is perfect, but the devs had shown, that they are really listening the community, making changes that goes straight along players wishes.  ",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Navy Field 1 you will probably like this.  End of the day its a pretty fun game and its free so your really not losing much to try it out. I think as long as you enjoy things like world of tanks / war thunder then you will probably enjoy it. If you hate those games still give it a go unless you have download limits your just losing your time if you hate it.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite a game suitable for almost all computers and players, not much violence, just blasting the crap out of ships, with no blood just explosions, so it's not that violent for younger kids to play. Pros: This game is free, so people with financial problems can still play, You don't need alot of performance, the people with financial problems might have a poor performance laptop or computer, but this game doesn't really need much disk space or performance to run smoothly This game is so fun, it is really fun for everyone,  Cons: Graphics not the best ( Well that's good for people with poor PCs) Notes: So this game is really fun as I mentioned, You just pick your country, buy ships, pick lines, unlock and it gets really interesting and addicting.",
            "review_score": "1"
        },
        {
            "review_text": "any game that offers you the chance to play/use a Yamato is a great game :D",
            "review_score": "1"
        },
        {
            "review_text": "The producer of this game has no sincerity. BAD game experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Unlike most poeple that tink this is a bad game i wont to say that this game is very fun and frustating at the same time. Whit that i don't want to say that the game is bad but is what make the difference in this game, bacause you can lose just as like you can win. To win a game is necessary cooperation and strategy (you just need to stik together and try to focus the same target) whit those you will see how the game become more fun and awsome to play. For the ship i have to admit two tings:  1) At the start you will tink is easy to progress from ship to ship, because you can obtain Tier III ship very quick but then you will see how hard is to get all the other ship in the game and because of that you have to chose what class ship you whant in the game like; i take the submarine or i will take a battleship.  2) The machmaking isn't fair but you can still win a battle by working together, like a have said frist you just need to stik together and try to focus the same target, that is the key to win in this game and the game mechanic are make to let you tink what are you doing insted of run to the enemy whit the bigger gun (some torpedo and you will be dead soon)  The last tingh i want to say is this THE GAME IS NOT PAY TO WIN! and trust me a have play a lot of game (not on steam) saing the same tingh but in the end the pay to win was there, but not here and not in this game if you get killed by the most biggest ship in the game is the machmaking foult and not a pay to win player.  In the game is possible to unlock evryting whit patience and good skill",
            "review_score": "1"
        },
        {
            "review_text": "The game isnt that bad, they could have done much better though. Many NF veteran rather play the old NF over this, i do like them both, but it seem alittle off with realism and balance. Here you have women on board, so many torpedoes for small ships, there no telling what will happen with women on board that sailors (men) get distracted and sank the boat itself.",
            "review_score": "1"
        },
        {
            "review_text": "First - Navy Field 2 feels nice to me.   Different types of ships = different gameplay.  Team based and team dependant.  Simply enough controls, low system reqirements. I can really recommend to try it, despite of enormous flaws.   Important: I am playing this game with non-Steam account, and I've played it a year ago (Nexon published). So dont get confused with 0 playtime.   Second - I cant recommend this game. Well, seriously - I cant.  There is Pay-to-grind-less - yes.    There is Pay-to-WIN - no, but close to, because premium officers have better stats, premium equipment have double stats (+5% accuracy - normal, +10% accuracy - premium one) - so Visa can give you an edge in fight, and quite a sharp one.    Team based and team dependant - because matchmaking sometimes throws crasy setups in battle (maybe because of low player base).  No information about game mechanics given, players have to figure out everything themselves - and it's costly.  Nice but primitive visuals.  Still bugs in game.  Far from optimal interface (IMO).  Steam account integration problems. Even PROBLEMS.  Good game to play for fun. But if you want to max your odds, to get all the advantages - you have to pay. Constantly. So - not recommended for serious players.       ",
            "review_score": "-1"
        },
        {
            "review_text": "blow stuff up, earn money + exp! very fun WW2 ship battle game the ship variety is huge with nice detail and lots of unqiueness to each ship, fuels my inner history nerd 8-)",
            "review_score": "1"
        },
        {
            "review_text": "I like this game a lot!  It's quite simple as it stands. I used to play NF1, which was much more complex. That said, it's clear that several features are still being worked on in NF2 and will be released at a later time.  Also, the ducumenation, tutorials, and tool tips suck in this game currently. No hard stats are available anywhere, and I'm still finding out new features that exist by reading the forums, etc. This stuff should be explained in-game clearly. It's not even clear is some features are active or not.  I am having fun playing this game and I hope to see it evolve to be even better than NF1!",
            "review_score": "1"
        },
        {
            "review_text": "wont let me log in with the correct log in",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a bad game another take on a MOBA game. The challenge ramps up quick with the game, and with the other players. Remember this is a free to play game. So If want to stick with the game you will be throwing a couple of dollars like any of the others.",
            "review_score": "1"
        },
        {
            "review_text": "It is a better game then people give it credit for. I find it fun. Battles are generally quick and furious. The tech trees are not overly hard for grinding until you get to the very top tiers.   Unlike many games in this genre, it is easy to play and hard to master. Skill is rewarded, and the learning curve is not nearly as bad as other games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "wasnt able to play they gotta fix it. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Just, terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Go Steel Ocean , much better :) ",
            "review_score": "-1"
        },
        {
            "review_text": "Game is very user unfriendly. Take the old navy field, throw out what was good about it, and you have Navy Field 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Hmm...not really a polite way to put this. NF2, I am disappointed. I spent 100s of hours, and $100's of $$$ on the Original Navyfield. Frankly, the original took me by surprise. As a hardcore 1st person pov simulator fan, I would not even have given Navyfield a chance had I not been invited by some AA clan buddies. Once I started, I could'nt stop. It amazed me how such a graphically simple, top down view game could put its hooks into me so successfully. So of course after having discovered there was a Navyfield 2, and on Steam (which I now have embraced), I could not download it fast enough. My first thoughts are here in list format:  - Why can't I skip this damn tutorial? - Did I download the wrong game? - Why is the background music so friggen loud and why cant I change it? Oh yeah, forced into tutorial! - Yay! Done with tutorial... what about recruiting an aide? How? Oh does it cost money? Can tell, oh well, skip it - Into battle.... did I hit a time acceleration button somewhere? - Why do the graphics look just like Navyfield I ? - Why are the ships turning around like go karts flying around a track?  And lastely...   - Where did I put that Navyfiled I installer again... I hope all my old premium stuff I paid so much money for is still there!!  - Navyfield II first experience compelled me to stop playing, not continue and as a Veteran to the franchise left me with a strong sense of disappointment. Like when Disney bought Lucas franchise.  If your new to NF, this might not seem to bad, but if you are not new... you will be asking yourself, why in the world would I want to play this?",
            "review_score": "-1"
        },
        {
            "review_text": "Guys srly this game is not like world of warship and why are you judging 2 differnt games when there not suppose to be the same.",
            "review_score": "1"
        },
        {
            "review_text": "As pretty much the only submarine player on the Washington server, its heavily weighed against you. Maps are huge, barely any time to stay underwater, torpedoes barely damage anyone who buys bulge armor, completely vulnerable at periscope depth to pretty much every surface vessel, not to mention no snorkels so even at periscope depth, you're losing oxygen. Not to mention there is either a hack or a bug that lets capital ships without having or using sonar to track you at depth below periscope depth accurately. There is also a bug where the sub randomly does not have to surface pretty much indefinitely. Pretty much any stealth advantage is sometimes flat out negated. Not to mention, sonar doesn't work both ways in game, i.e., I as a submarine cant use sonar to detect surface targets, especially since your surface field of view becomes almost as small as your ship at depths deeper than 3.   Pros: its visually pleasing, and the nationalities speaking their mother tongues is a cool touch.  Cons: It's neither as fun nor playable as NF1 (which is still online, mind you), and it's still somewhat buggy.  I'm still going to recommend it because maybe if more people actually played, there'd me a more active following by the devs.",
            "review_score": "1"
        },
        {
            "review_text": "OMG this game is so much fun, its like you drive ship in the ocean and shoot other ships. Sometimes other ships shoot you so you hide behind ships. Its like playing a giant game of dodge ball in the ocean using a floating ball.",
            "review_score": "1"
        },
        {
            "review_text": "not recommended to play this game, world of warships so much better than this game",
            "review_score": "-1"
        },
        {
            "review_text": "I get to play world of warships before world of warships is out.  I also get to play Kancolle: The Video game: The Video Game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A faily decent game, except for the fact that it has the most unbalanced matchmaking I've ever seen. Its like BB guns vs nukes or like a cippled midget vs the Hulk whens he's super ♥♥♥♥♥♥. If they would fix that aspect it would be a lot more fun. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "46 hours in, and for the most part the game is fun. Big differences between this version and NF1:  1. No Gun options, what it comes with is what you get. Most ships you can upgrade the guns for more damage, better accuracy, and faster reload, but it feels to be a major 'miss' when compared to NF1's modifications.  2. No Premium Ships currently. This is good and bad at the same time, as in NF1's premium ships were by no means a 'pay to win' option, but if you got good with them they did help you grind a bit faster.  3. Manual aiming is a huge pain in the A. Not sure if it's the quicker speed of the game (all ships feel like they are moving at lightspeed in comparison) and manual aiming is too slow. Combine that with any amount of lagging at all, and you end up with a big loss. I only ever used auto aim for a few cl's and ca's in NF1, but in this version I haven't managed over 20K damage with manual aim mode. Maybe it's better with bigger boats, but I'm kinda doubting it.  4. Lag, lock-ups, and another loss. Any time you 'Retreat' or have to Quit the game due to your game lagging out and then freezing, the game counts that battle in your win/loss record as a loss. Not a big deal if you don't care, but NF1 a lot of us prided ourselves in having a 60-75% Win ratio. Not possible to maintain that with 5-10 auto losses in a 4 hour sitting due to servers gumming up. And it's not player's computer, as it seems to be affecting everyone equally, no matter system specs.  All in all, the game is fun. But with the many issues, frustrations, and annoyances, it's just not worth putting any money into the game. Give it a go maybe if you have some time to kill, but I would give this title a pass.",
            "review_score": "-1"
        },
        {
            "review_text": "I've downloaded NF2 on Steam, but I cannot access the server, I've also downloaded NF2 from the website, but I cannot find out how to convert it to Steam. It looks like it would be an awesome game, I just wish I could play it! Can anyone help please?  BC_RyWilly_73 ",
            "review_score": "1"
        },
        {
            "review_text": "Very impressive",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: Download Games Step 2: Create Account Step 3: Attempt to log in Step 4: Fail. Step 5: Try to fix for 1 hour Step 6: Decide '♥♥♥♥ this' Step 7: Uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay looks nice at first and this game could have potential. But: Userinterface and menus are a puzzle to find out. Poor documentation on how to play and use the different shipclasses and their weapons. And most important and gamebreaking: Matchmaking is terrible, it creates very unbalanced battles - a lot, It also matches low tiers with much higher tiers, which just leads to more frustration when your teammates are being destroyed one after another and you can hardly do a thing. ",
            "review_score": "-1"
        },
        {
            "review_text": "Navy Field 2: Conqueror of the Grind... Nuff said.",
            "review_score": "-1"
        },
        {
            "review_text": "Really. I log in it says 'Account already logged in from another place.Previous account disconnected,so please try loging in again.' I tried again and same thing happened. daheck is going on here",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game. Different to your usual naval games.",
            "review_score": "1"
        },
        {
            "review_text": "Thats how yhou pick a 10 year old game and make him worse.",
            "review_score": "-1"
        },
        {
            "review_text": "Game's much better than the user review suggests; maybe the review has to do with the company we all hate? But really, most of the negative things mentioned in the reviews don't seem to be that bad.  There's ZERO chance the grind is worse than World of Tanks or any other games. Unlike WOT, even if the round is lost, you get quite a bit of award according to your performance / dmg. done. You can leave the game once you're sunk, and there is NO WAITING time until the round is over; you can start another game as soon as you are back in lobby. The game's actually great; give it a try guys. I surely was doubtful at first, but I am loving it.",
            "review_score": "1"
        },
        {
            "review_text": "this is not the game i hoped for it has that naval fell butt its top doun veiw makes it hard for players like me.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game I wanted to like. I really loved NF1 played it forever and liked it for its uniqueness.  Now the genre isn't quiet so empty, here we have NF2, World of Warships is coming out, and presumably more are to come.  NF2 to me felt like a dumbed down, simpler, and easier NF1. Its exactly what I didn't want. I would have been thrilled at the prospect of a modeled and rebalanced NF1. Instead we got rid of manual aiming and everything is now auto-aim to some degree which really removed a great amount of player skill from the game.  They just really missed the mark in my opinion, a large part of what made NF1 great even for people not a fan of ships was the interesting and skill oriented aiming system by removing this they effectively removed the main skill from the game.   It feels more like an easy cash farmer now, the sort of f2p program shoved out to make a dime not be a great game. So its with a great amount of disappointment I'll say I can't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Loved the game, simple easy to use controls and fast paced gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game,long grinds to get more ships but some good fun.",
            "review_score": "1"
        },
        {
            "review_text": "Just a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game for a great price. They have made improvements since the first game including capture points on islands. This gives the 'flagship' unique abilities sure as scout planes, bombers, and radar ship detection. Definately worth a try if you are on the fence about it!",
            "review_score": "1"
        },
        {
            "review_text": "As a former player of the original Navyfield, I do not recommend this. The excessive amount of pay2win content will make any fight against paying players a suicide. It is not uncommon to see half of your team reaped by these players.  The graphics will let you down as well, not to mention the high usage of computer resources to achieve them.  If you want a strategic naval combat game, stick to the original Navyfield.",
            "review_score": "-1"
        },
        {
            "review_text": "Worse game ever produced.",
            "review_score": "-1"
        },
        {
            "review_text": "there is no support if something goes wrong your screwed",
            "review_score": "-1"
        },
        {
            "review_text": "I downloaded, installed the game.  One of the first things I do in EVERY game is either turn off or down the music. You can tell how poorly this game was developed when you can't even turn the music down or off by itself, without turning off ALL of the other sounds.  Guess what? I'm out. The music is loud in this game. If I can't even do something SO simple like that. I'm done right there. I won't even play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Bulls**t don't even bother.",
            "review_score": "-1"
        },
        {
            "review_text": "i have played this game for a good 15 minutes and i can already tell you to turn around and buy a game. dont waste your time on dis piece of ****",
            "review_score": "-1"
        },
        {
            "review_text": "pay to win crap korean grind economy is a mess  nf1 is better",
            "review_score": "-1"
        },
        {
            "review_text": "In the 90ish minuts i played before writing this review i found out that this game was fun, but not without drawbacks namely making an account or logging in it turns out that you use your steam login info. anyway the game is fun even when you level up WAY to fast",
            "review_score": "1"
        },
        {
            "review_text": "R.I.P World of Warships",
            "review_score": "1"
        },
        {
            "review_text": "Huge fan of Navy field, however after playing nf2 I felt that the first one has better controls. I will say that the graphics are better but thats where it ends.",
            "review_score": "-1"
        },
        {
            "review_text": "If you loved the original version of navyfield, then you will love this. It is the old concept but with some additions. For example using your sonar manually as a dd.  Some claim it still has some ballance issues. Nevertheless I enjoy the game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Wanna try your hand at the Naval combat? Well her ya go this game gives you sveral tiers ship starting at one and leveling up to a max tier. Upgrades will greatly benefit your ship as you progress. Teams and battle are interesting and thier certainly a ton of controls you will need to learn in order to play well. The graphics and other various details are also very neatly done and makes for an estatically pleasing game. This game I would say it is realitively fun with some patience and time.",
            "review_score": "1"
        },
        {
            "review_text": "Great Concept for a game, poor execution. Terrible graphics and controls only work 1/2 of the time.",
            "review_score": "-1"
        },
        {
            "review_text": "I wantd to like this game, I loved the Original Navy Field. If I can get it to run again on this tablet im using, I may just continue playing it. But Screw you SDEnternet. You've ruined this game and shown little care to correct it.   If you want to deal with: -highly unbalanced matches, ALWAYS -Almost no Player population (5-10 minute wait times for games) -And an overall sense of ♥♥♥♥♥♥♥♥♥gery from the ones who stuck around to be 'those vets' picking on and driving away new players,  than try this game.  OTHERWISE STEER THE ♥♥♥♥ CLEAR. DONT GIVE THEM AN OUNCE OF YOUR TIME OR MONEY.  Go play the original if you want to really enjoy Navy Field at its Best  PS: Screw You SD Enternet ",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the game there is lots of werid bugs here and there and the graphics are okay the game I like to compare with world of warship. I lconike world of warships better becuase the servers dont go down as much and the concept is better. I would recomend this to a friend or a new comer to steam.  ------------------------------------------------------------------------------------------------------------------------------- World of Warships has (below) Better graphics  Gameplay a like  Great tiering  Terrible sound on bad pcs Better aircraft cairrers  Servers almost never go down no bugs ------------------------------------------------------------------------------------------------------------------------------- Navy Field 2 has (below) okay graphics  servers go down and up here and there Werid bugs (not alot) Gameplay a like  Not so good tiering ",
            "review_score": "1"
        },
        {
            "review_text": "Almost forgot why I uninstalled this, in 2 minutes I remembered. Horrible Game, if you have it installed, uninstall, if you dont, dont even think of downloading it. WoWS &gt; NF2",
            "review_score": "-1"
        },
        {
            "review_text": "The game is not that bad i like the game play mostly the graphics aren't bad either  The only issues i see are the negative player base   The false statements made by most state Helpful and friendly player commity All i have seen on the chat is nothing but typical racism nazism none sense others who degrade and insult others for no reason.  Team damaging and team killing is a major issue as well  And you will more likely be in a team that will throw the game  So that earns from my review a negatve -20   I dislike the fact they still allow brazilians into this game as history from the original navy field proved and showed they were the major issue They can't read english and the game is based on english text rules and all and not to mention SD is known too recruit enablers and nazi would be people as moderators who abuse their game powers.  I wouldn't suggest anyone in their right minds play this game just for the fact you may end up having such a bad gaming experience due to other minority players ruining it for others with the team killing and insults too start up a dramatic online fight.  Now if SD would kindly just shut out brazil from their games things will be fine cause i have come across Brazilians who are just more focused on being the center of attention and whiny.  And some other people from other countries who just down right look for any excuse on being mean with others may very well be the down fall of SDNET  Unless they start waking up.. which won't happen   As for the game it self  The amount of credit and experience cost for ships above tier 5 and 6 are seriously high too the point you will see yourself grinding it for the long haul.  I can understand what they were aiming at... but there are still questionable factors that'll make others wonder... who..? what..? why?? when??  Sorry for the long reading material  And the bad grammar english isn't my primary lingo  Again i would not at all suggest this game to any of my pals or anyone at all..  I honestly just don't feel brazilians should be allowed too play online games with other nationalities i would sooner play games with russians and canadians and Germans and chinese and japanese sooner than i would play with any brazilian nazi scumbag..",
            "review_score": "-1"
        },
        {
            "review_text": "Let's start....  So I played Navyfield 1 (Forgot when.) It was confusing for new players and graphics were well... 50-50. .-.  And now this released I saw it at free to play so thought of downloading and giving it a try  I must say Graphics has improved very well but there are few problems with it too It sort of laggs every now and than (Not me Server side.) And Matchmaking Let's say one team is full of Tier 1 Destroyers and other is full of tier 5+ Battleships .-. -The moment you realizes you're doomed- other than that it's quite fun infact I started to like it. =)  I can't say Thumps up or down I'll give a up cause I like it but rest you guys decide. Good luck!  ",
            "review_score": "1"
        },
        {
            "review_text": "My first match of the game was a teir 11 match.... The people were actually rather freindly it seemed to me, or maybe they just wanted to make themselves look good on the steam posts, I even got to teir 3...wouldnt reccomend due to the fact that every match was teir 11 ",
            "review_score": "-1"
        },
        {
            "review_text": "pick a destroyer change gun to AA point gun to 90°  change to HE fire until 0 dp recieve credits and experience  10/10 ultimate ww2 experience",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks it wont even load up I try loading it, it says to go to its website I go there I read what to do and when I do it it just says NO!",
            "review_score": "-1"
        },
        {
            "review_text": "I recommended this game because i love battleships and NF2 runs perfectly on my laptop. While NF2 have lots of bad reviews but i really do enjoy how you can just jump in and have a quick battle anytime you want, and the variety of ships is plenty for me to choose from and suit my own battle style. but the biggest dissapointment for me has to be ship upgrades. I dont mean the overall 'tech tree' upgrade, i mean single ship upgrades. Because the stats upgrades just feels very or almost no effect on your ship. Apart from a few ship can have different main battery upgrades, otherwise the upgrades most of the time gives you less than 5% improvements. I know this is acurate and balanced since you cant just upgrade a tier1 ship that grants tier 5 ships abilities, but still... i still think the upgrades could be done better by giving more options on types of guns to equipt or upgrades to grant ships additional firepower.  Forexample the myoko or tone is known to have torpedos, maybe add torpedos to them will be a better upgrade compare to like 0.03% faster reload or 0.1% more firepower... Anyway i'd say im gonna have at least another 100 hours on this game, but if nothing changes after that, is verylikely ill get bored and quit like many others has",
            "review_score": "1"
        },
        {
            "review_text": "Converting your account to Steam is useless, so created an account and downloaded the game direct from the Navyfield website and had no problems so far.",
            "review_score": "1"
        },
        {
            "review_text": "This game made really feel like i am battleing in the great sea",
            "review_score": "1"
        },
        {
            "review_text": "Go with world of warships its 10x better than this in many ways",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game before then but lacks the historical evaluation. I'd say for those who wants to have fun rather than evaluating history itself, this is the perfect game for you. (except for the bots ofc)",
            "review_score": "1"
        }
    ]
}