{
    "app_id": 339000,
    "name": "Ukrainian Ninja",
    "release_date": "2014-12-23",
    "developer": [
        "Michael Kissinger",
        "Marco Hulden",
        "Shaun Egan",
        "Joshua Marks",
        "Denys Ovsiannykov"
    ],
    "publisher": [
        "Dragon Fire Games Inc"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 102,
    "negative_ratings": 97,
    "price": 0.0,
    "description": "Ukrainian Ninja is a multiplayer platformer game for Windows. The Ninja shoots and slashes, using weapons sold by the trader to clear each world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339000/header.jpg?t=1514502943",
    "minimum_requirements": "OS: Windows XP Processor: 2.0+ GHz processor Memory: 2 GB RAM Graphics: A graphics card with shader model 3.0 support. DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows XP or higher Processor: 2GHz or better CPU Memory: 4 GB RAM Graphics: A graphics card with Shader Model 3.0 support, such as nVidia GeForce 7800 DirectX: Version 9.0 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "Final update:  Still a lack luster platformer. Meh.",
            "review_score": "-1"
        },
        {
            "review_text": "I've just started playing the game and i've already seen some mistakes by game design like undesired edge grabs on low objects while under fire. Also I've got some trouble in wall jumb with certain walls making these puzzles very frustating, don't know if it was a bug caused by occasional lag or only bad designed.  That said the game has very interesting level design with action combined with some puzzles that require perfect timing. There's a lot of hidden itens and challenges for the player get some fun.  This game has a great potentional, but the frustations due annoying situations makes you quit early. I hope it gets some fix update soon, untill then I can't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "  SLAVA UKRAINE, GEROYAM SALA.",
            "review_score": "1"
        },
        {
            "review_text": "Cool! When you buy it you can support the Ukrainians.",
            "review_score": "1"
        },
        {
            "review_text": "It should will be update wih achievements, fanny game with non-politic story/ 6 ukrainians of 10",
            "review_score": "1"
        },
        {
            "review_text": "Game is funny. You are ninja that must stop evil.... At begging you need to destory a tank which is really easy mission... After that you need to destory helicopter and you done first world.. There are 4 worlds new 4 comes soon. Movement of game is maybe really not *cool*. You move very fast and if you miss jumping box you become a little angry!! Figthing is really easy 1 or 2 punch is enough to kill an enemy (soliders)... Also you have shop in game where you can: restore your health, buy shurikens and ak47... If you play some old games that they have cricle fire bullets well here is same... You try to miss bullets and kill enemis.... Enemies are sometimes just glitched and you can easly kill them.... You have wall jumping and double jump.... After die you press fire and it's spawns near your death... Sometimes enemies attack you very fast abd you die fast... Also when you on train picture really moving fast and maybe someone don't like it.  Developers really make a good game. They really try to make good ninja game.... I talk with one of them.... Game will got new updates soon  Rate of game: 9.8/10 Character should move a bit slowly or you have a button to press sprint and on train picture really move fast!",
            "review_score": "1"
        }
    ]
}