{
    "app_id": 339160,
    "name": "Tales of the Orient: The Rising Sun",
    "release_date": "2015-02-27",
    "developer": [
        "Green Sauce Games"
    ],
    "publisher": [
        "Green Sauce Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Match 3"
    ],
    "achievements": 16,
    "positive_ratings": 272,
    "negative_ratings": 49,
    "price": 6.99,
    "description": "Travel to the Edo period in Japan and help Satsu and Miyamoto in an epic adventure to preserve ancient Japan. Prove your skills in Challenge mode with limited moves. Experience the excitement of building an ancient Japanese village in this engaging Match 3 game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339160/header.jpg?t=1464362465",
    "minimum_requirements": "OS: XP/Vista/7/8 Processor: 1.5 GHz Memory: 1024 MB RAM Graphics: 256 MB DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Yes, I know, how can I spend 67 (omg) hours on a game I don't recommend afterall? Steam's system is flawed, games and opinions are much more diverse than YES or NO. If there were other options, this game would get the 'If there's nothing better' or 'meh' rating, because it's just ... generic. It has a few strong points, and just as many weak ones, making it really hard to foresee if a random user would like it or not. Start with the positives: - The best one: you can choose your game: match 3, the classic swapper one. Pop, where you just have to click on groups of 3+ blocks to make them disappear, and for third, Chain - you need to draw a line between 3+ blocks to make them disappear. - Power-ups: single block, random 5 blocks, whole row, whole row + rank in a shape of a cross. - If you can make at least 5 blocks disappear, you'll get a bomb with blows up the tile it's on + 2 in the four main directions.  - You can rotate the table -Ability to randomize the table - timed, not charged. - Pretty, colourful design. - Lots of levels, if you enjoy the game. About 100 levels to build everything, and achievements for 200 played levels / 10 hours of gameplay. Then the negatives: - Totally unbalanced. In chain-only games, like 4 Elements, the longer the chain, the bigger the explosion. Here while the chain-mechanic has the potential of making much longer matches than the traditional swap, it's hard to pull of because you can touch one tile only once during drawing the chain, plus the game will reward the 6-7-8 block long chains with a simple bomb as well. Bomb will get placed where the chain ends, if it's long enough. Pop mode makes this much, much-much easier - I think chain is the hardest mode because of the too many different colours present at the same time. -Feature level bugs and annoying kinds of real bugs. Where you create a bomb you can detonate it in the air before it would fall, you can do this with any block matches as well. You can rotate the table while creating the bomb making it fall 'sideways'. While the bomb's flames are present, the game treats the blocks as intact, so basically you can blow up a bomb, then make the soon-to-be-exploded blocks disappear in a match. But at least you can calculate with these, but I'm pretty sure it's not designed into the game as tutorial hasn't mention it at all.  Often (especially where creating bombs) blocks just spawn under the bomb, so it doesn't fall as deep as it should be, destroying tactics and plans. - Challenge mode in my opinion is totally broken and borderline impossible. Levels are randomized, and challenges are based on the number of moves, not time. The table doesn't auto-shuffles where there are no matches, you need to do it manually. In challenge mode if you don't want to spend 3-4 moves for the *chance* of making a golden tile disappearing, you can try reshuffling. Once in like every 3 minutes, making the game incredibly streched out and slow. The powerups require like 50 blocks (14 3-block matches) to charge, making it usable like once on a level, if you're lucky. Another reason to call the game surprisingly slow. And this is not a real negative, but it would be so much better if one could rotate the table with the arrow keys, like Clickr does, it would improve a lot on the fluidity of the gameplay. Afterall, my problem with the game that is so average (and not a trustworthy kind of average game hence the constant glitches and bugs) that I can not recommend it - though if you want to play it, get it, preferably on a sale. It's not bad, it's not unplayeable, just ... there are better games out there in the match 3 genre.  ( PS: an advice: Always escape to the menu and close the game - if you happen to alt-F4 while playing on a board to close the game, your progress from that session gets deleted as I think there's still no autosave between the levels)",
            "review_score": "-1"
        },
        {
            "review_text": "  First of all, not all my gaming hours were logged because I was playing it often while I was on the go, and there was no wifi available. The best feature of this game is it's fully compatible with a windows10 tablet. Very touch screen friendly. Works perfectly on desktop too. So I recommend this game to everyone who likes objective based match-3 games, but beware! It's not an easy game. You can choose from 3 different play styles: swap, pop and chain. Most of the time I play in swap mode but none of them makes the game easier. The graphics are beautiful, the music is epic too.  I recommend it to everyone who is up for a good challenge! I would not call this game 'relaxing' by any means. You will cry in rage sometimes because yes, some levels are veeeery hard!  So overall I really love this game. I've got it for free but it's certainly worth the full price. I found no flaws in this game, it's really good in it's genre.  My tips: use your powerups wisely, and rotate the table whenever you stuck.",
            "review_score": "1"
        },
        {
            "review_text": "Tales of the Orient: The Rising Sun is a casual match 3 game   Pros:  Relaxing and enjoyable Nice Soundtrack Addictive Nice game mechanics  Cons:  Nothing so far, this game is decent  -Recommended-",
            "review_score": "1"
        },
        {
            "review_text": "Nice match-3 game that gives a choice in its mechanics. That is you can choose swap, link or pop tiles so you can play it as you want.",
            "review_score": "1"
        },
        {
            "review_text": "  fun puzzle game :3  great when its a boring and rainy day so I can connect 4 items and get dem crazy combos :3",
            "review_score": "1"
        },
        {
            "review_text": "Good game, good graphics, good gameplay, excelent soundtrack. That is my review. Recommended !",
            "review_score": "1"
        },
        {
            "review_text": "i really liked the game justa normal puzzle game and i liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Worth for your money.",
            "review_score": "1"
        },
        {
            "review_text": "Made in Brazil, a story told of Japan, through words of English and acceptable accent. It's not just another Match 3 game... it's SEVERAL match 3 games! You can choose between Swap, Chain and Pop (Collapse!/Blox) modes for any level, and that's nice. It's also got surprisingly nice music and visuals, although I suppose that's to be expected when your game is, mnehhh... this.",
            "review_score": "1"
        },
        {
            "review_text": "a beauiful game awesome gameplay and the soundtrack is just so relaxing and fits the mood for the game and the nippon land i give this game 10 out of 10 i hope to see more games this dev soon and hopfully they provide the soundtrack too its that good",
            "review_score": "1"
        },
        {
            "review_text": "A classic matching game.  Pros-  *Great soundtrack *Can choose between chain, pop or swap matching modes *Visuals are pleasing *Trading cards, emoticons and backgrounds are awesome. *Reasonably small download size  Cons-  *This game is extremely repetitive *People will think you weird for playing a matching game  Overall, this is one of few matching games that I enjoy. Definitely worth buying if it is on sale 7/10",
            "review_score": "1"
        },
        {
            "review_text": "There are lots of match 3 game on steam, but this is one of the top game. All the music, the game mechanic, everything is cool and relaxing.",
            "review_score": "1"
        }
    ]
}