{
    "app_id": 339190,
    "name": "Dead Synchronicity: Tomorrow Comes Today",
    "release_date": "2015-04-10",
    "developer": [
        "Fictiorama Studios"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 24,
    "positive_ratings": 582,
    "negative_ratings": 105,
    "price": 7.99,
    "description": "A dying reality, a universe that’s fading away. A merciless world thatgets sick and vanishes. No past, no present, no future; only the impending moment of “dead synchronicity” ahead. Will you be able to stop it?Because, otherwise... what will you do when Time dissolves itself?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339190/header.jpg?t=1478167659",
    "minimum_requirements": "OS: Windows Vista SP2, Windows 7 SP1 Processor: 2 GHz Dual Core CPU Memory: 2000 MB RAM Graphics: Nvidia GeForce 8600 GS, ATI Radeon HD 3470 DirectX: Version 9.0c Storage: 4500 MB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers Additional Notes: Using the Minimum Configuration, we strongly recommend to use minimal settings in order to not experience low frame rates.",
    "recommended_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 (32/64 bits versions) Processor: 2.6 Ghz Dual Core CPU Memory: 4000 MB RAM Graphics: Nvidia GeForce GT 610, ATI Radeon HD 4650 Series or higher DirectX: Version 9.0c Storage: 4500 MB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "reviews": [
        {
            "review_text": "Great setting, atmposphere and plot points. Voice acting top notch all the way as well as the artstyle.  Until you feel cheated at the ending of course, with no sense of closure or feeling of a cliffhanger.",
            "review_score": "1"
        },
        {
            "review_text": "Dead Synchronicity is a point and click adventure that plays out few days after the end of the world as we know. Weird phenomenon appears in the sky any many people get fatally ill - getting hours of excruciating pain, with dying after that. Michael wakes up into the New World but he can't remember anything.   The shadow government and the army is trying to hold control even after the end of the old world, so Michael is held in the refugee camp that nobody can leave. There starts the depressing story about the loss of freedom inside the world full of people who died because of the illness, or because they commited suicide.  The game has pretty unique graphics style, with sharp edges of every object instead of classic round style - you can see that in the screenshots. That feels really great for the atmosphere on the game, it has only one flaw - it makes all women in the game look ugly. Also, while the environment looks great and detailed, most characters looks more simplified.  Difficulty is not so hard, I haven't personally met any moment where I would get desperate enough to check walkthroughs, though there are definitely parts where you'll get stuck for a while. And meanwhile you'll be trying all possible combinations of items and objects, you might get a surprise achievement. That's because most of the Steam achievement are unlocked for trying silly usage of items, mostly in reference to popular culture.   Conclusion:",
            "review_score": "1"
        },
        {
            "review_text": "Its nice to play a point n click adventure title that does not pull its punches. There are real emotions going on here. The game presents real world situations coloured by dystopian paint and outlined with logic. The science fiction never takes over the story.  Of particular note are the interesting angles and cutting up of scenes as Michael moves from one to the other.  The story will continue in part 2, so don't be dissuaded by those that don't like the ending. It is there as an arrow pointing the way to the next chapter, which will join with the first, by being even more interactive and gripping.",
            "review_score": "1"
        },
        {
            "review_text": "This game has unique idea about solving problem with corpse in a way you will fascinated surely. I really like voice actors in this game, perfect like watching movie.  I hope to play next chapter of this game. It's quite amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic and beautiful, but the ending stinks! Buy it if they ever announce the sequal.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderfully fleshed out Point-and-Click adventure game with a very dark storyline. There are many overused tropes in this game, but the story twists in such delightful ways that you don't mind at all in the end. The music is very well done and works with the scenes and the sound effects always fit perfectly. The post-apocalyptic storyline was so good and they fleshed it out very well. I never felt wanting for more information because at some point during the game, they described everything I needed to know in great detail. I also liked that I could rewatch the cutscenes whenever I wanted by simply accessing the notebook.  Some of the voice acting didn't fit the characters or the flow of the words 100% but it's still very well done. I also enjoyed the diversity of characters.  Be warned that if you play this game, there are some very dark and horrifying things you have to do/witness/listen to in order to proceed with the game. Some might even consider them triggering in some instances.  I was so intrigued by the puzzles and the plot that I basically could not stop the game once I started. I got stuck on a few puzzles, but I managed to always find my way through.  The only true downside to the game is the ending. It's a MASSIVE cliffhanger and I literally lept out of my chair because I was so frustrated. However, I still highly recommend this game and I will definitely be buying the sequel. ",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable, although I got stuck more times than I would have liked as a seasoned adventure game player. The ending was a little disappointing, but hopefully the next one will follow on nicely.",
            "review_score": "1"
        },
        {
            "review_text": "loved this game buy it NOW! Cant wait for the sequel. Its Dark, its Gritty, its macabre on a level that makes you want to melt more faces with acid. the puzzles are tricky enough to make you think but not ridiculous. you don't have to break a comb in 2 and put it back together to make a screwdriver??? (a new begining-final cut) . The pacing is just right, and when you finally figure out what you already knew; it ends.   SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL SEQUEL",
            "review_score": "1"
        },
        {
            "review_text": "The game can be confusing at frist so I recommend you go through the tutorial section. Good story can't wait to see the sequel and by the way I do like the artwork and also the characters.  One of the characters called the hunter is hilarious. :)",
            "review_score": "1"
        },
        {
            "review_text": "A really nice point and click game with a strange, but interesting story, morbid theme and amazing artwork.  I'd recommend to buy it in a sale though, for 20€ are a bit too much in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Extremely dark, well-written story Logical puzzles  Cons: Voice acting decent, could be better That's really all I can think of",
            "review_score": "1"
        },
        {
            "review_text": "Set in a dystopian world that was ravaged by an event known as The Great Wave, Dead Synchronicity: Tomorrow Comes Today is the first installment in a new post-apocalyptic point and click adventure. At this time, it is undetermined how many entries this series will have, or when the next one will arrive. Beware reviews that state that they were 'uninformed' that this is an episodic point and click; that information is right on the store page.  The game revolves around a man named Michael, who is considered a 'blankmind' since he woke in the new world with no recollection of his past. Throughout the story, you will uncover the details of what was significant in his past and you will also piece those together with what is going on in the present. As expected, being the initial entry into an episodic series, this title involves uncovering a lot of backstory. During the main timeline, an illness that turns people into 'the Dissolved' is sweeping the land, and Michael is tasked with finding a cure for the son of the family who saved him. There are several plot twists, though the major one that comes at the end can easily be guessed during the early parts of the game; so it really comes as no huge surprise.  The dark expressionist artwork is exceedingly grim and blood soaked. There's a grand use of clashing warm and cool pastel colors that really sets off the dystopian vibe that this game has. The backgrounds are brilliantly drawn and painted, however I do feel that the characters, especially Michael, could have used a little more work. This latter point could also be due to the fact that I'm personally not a fan of the harsh, straight lines that expressionism is known for when it comes to homo-sapiens, but the characters seem much more bland in comparison to the world that they're roaming around in. Along with the fantastic artwork is an equally fantastic soundtrack. I'm not a big fan of indie music, but Kovalski did a great job of adding forlorn ambiance to the game. The music really brings out the overall mood of the title, although if you stay in an area too long the music will stop and it will fail to loop.  There are only a few gripes that anyone will have with Dead Synchronicity: Tomorrow Comes Today. For one, the game is $24.99 CAD, and it only lasts at best for 4 hours. Unlike many other Daedalic Entertainment point and clicks, the game isn't very complex or difficult to figure out either, so it's unlikely that it will provide a challenge for the seasoned point and click fan. Those who are not a fan of episodic games might as well wait until there's either a full collection available, or at least until we find out when the next title will come out. There's nothing exceptionally riveting in this initial installment, and especially not for the price point; the game has been terribly over-hyped. If you find it on sale for $5-10, it's definitely worth taking a look at, though.   Rating:  3.0/5.0  - Average, can take it or leave it.",
            "review_score": "1"
        },
        {
            "review_text": "Dead Synchronicity is definitely an experience, and one worth the time.  TLDR: If you are looking for an dark, atmospheric game that really makes you question the good and evil at our cores, and what it really means to survive, get this game. 8/10  Dark and atmospheric, it's easy to get caught up in the twisted world that is Dead Synchronicity. Though many aspects of the world are left a mystery as you search for the answers that no one has, you never lose sight of just how ♥♥♥♥ed up this world is. There were many moments that I found somewhat hard to watch, certain places I dreaded going due to the gruesome scenery, but you have to go, you have to experience it. It may be hard, but it's like that for a reason, and the fact that the creators could convey such feelings really speaks for itself.  The plot can be pretty hit or miss in terms of unpredictability, I found that most of the character background was pretty see-through, but you probably won't be able to guess all the craziness in terms of the overall plot. But my god some of the small plot developments really get you. This game does a really good job with it's characters, so when ♥♥♥♥ hits the fan you can feel it.  In terms of actual gameplay, being a point and click makes it pretty straight to the point. Certain inputs could definitely be improved (right/left click, grabbing/using items, sometimes it just doesn't seem that responsive), but it's something you get used to and it doesn't really take away from the game.   The Puzzles can be particularly challenging, but sometimes for the wrong reasons. My biggest issue was just FINDING the right items. Many useful items tend to blend in with the scenery a bit, making them hard to notice, but without them you can't progress at all. It's another thing you sort of just get used to. I would say though that a lot of the time finding the right item was much more challenging than the actual puzzles themselves.   The art style is cool and adds to the atmosphere and the voice acting is fantastic.   Please note that this is PART ONE. I've seen a lot of people complain about the cliffhanger but don't, and I don't find it to be THAT much of a cliffhanger. This game addresses all of the immediate issues and it tactfully sets you up for moving on to Act 2. It sets you up emotionally and gives you the info you need to prepare yourself for what will very likely be an even more emotional journey.   I don't really judge game cost, it's a good game and if you can enjoy it then it's worth it.   If you are looking for an dark, atmospheric game that really makes you question the good and evil at our cores, and what it really means to survive, get this game. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has a beautiful art style, great atmosphere, and a decent story. It suffers from the usual illogic of this type of adventure game (using the car seat on the window? really?) but mostly can be tackled head on. The real issue is that at a certain point in the game it   ends.  Abruptly. I can only assume the game will be episodic? Or something? It was such a shock it really ruined the experience for me. It was less of a cliffhanger, and more of just cutting off mid-thought. Jarring, and unpleasant.",
            "review_score": "-1"
        },
        {
            "review_text": "Very predictable story with no pay-off at the end. Some `puzzles` are inscrutible and anoying with no connection to the dialog or plot, others are obvious and tedious. The dialog is overwrought and the monologues are exagerated. The concepts involved in the story allow for a lot more potential gameplay that simply doesn't exist.  The music and art are good and but this is far down my list of best point-and-click games.",
            "review_score": "-1"
        },
        {
            "review_text": "As an adenture it is ok. What ruined it for me is the ugly graphic. Yes, I get it: It should be very artsy and styiish. But it is just cheaply done and ugly. And while the overall flow of the story (as in: If you like the visuals it could be a decent adventure) is good, the ending and overall explanation is badly written and unsatisfying.",
            "review_score": "-1"
        }
    ]
}