{
    "app_id": 339200,
    "name": "Oceanhorn: Monster of Uncharted Seas",
    "release_date": "2015-03-17",
    "developer": [
        "Cornfox & Bros."
    ],
    "publisher": [
        "Cornfox & Bros."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Action"
    ],
    "achievements": 63,
    "positive_ratings": 1214,
    "negative_ratings": 312,
    "price": 10.99,
    "description": "Oceanhorn: Monster of Uncharted Seas combines captivating storytelling, breathtaking 3D visuals and exciting gameplay into one epic action-adventure experience. In the game you explore the islands of Uncharted Seas, a world filled with many dangers, puzzles and secrets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339200/header.jpg?t=1514832413",
    "minimum_requirements": "OS: Windows 7 Processor: 1.7 GHz Dual Core or faster Memory: 1 GB RAM Graphics: DirectX 10 compatible, 256 MB VRAM DirectX: Version 10 Storage: 700 MB available space Sound Card: DirectX 10 compatible Additional Notes: Even slower systems may run the game.",
    "recommended_requirements": "OS: Windows 10 Processor: 2.2 GHz Dual Core or faster Memory: 2 GB RAM Graphics: DirectX 10 compatible, 512 MB VRAM DirectX: Version 10 Storage: 800 MB available space Sound Card: DirectX 10 compatible Additional Notes: Even slower systems run the game.",
    "reviews": [
        {
            "review_text": "This was a very nice and fun homage to Majora's Mask/Wind Waker from what I could tell. You can see how much the devs loved Zelda, and how careful they were to honor that great franchise with a variation featuring their own vision with their own story. I'd say they succeeded with flying colors.   The game did crash every so often, but other than that, the gameplay was seamless, solid, and engaging. None of the puzzles were too difficult, and nothing in the game really did anything to bog down what ended up being a wonderful experience. As my many screenshots can corroborate, this game was also very pretty. The graphics were solid.  All told, I would give this an easy 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Budget legend of zelda, feels like it, plays like it. Is that a bad thing? by any means no. Gameplay is enjoyable and like most zelda games start out slow at first, which will off put most gamers, who in tale wont make it midway through the game where the action really picks up.   The game doesn't try to do anything new when copying the legend of zelda but for the price and given the game is a iPhone port, its still worth it.  I enjoyed the play through, didn't care for the story, characters, music. The main character is easily forgotten, but who cares. What you have is a base game thats still highly enjoyable. Game takes a sample (inspiration) from Legend of zelda windwaker, like object iteration and flesh that out a bit more.  make sure you incorporate objects laying on the floor into your combat to experience the combat system in its glory. The game is worth the play-though and i love the simplistic graphics, which remind me of a ps2/gamecube era game. Worth a play through.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty dang awesome. If you like Zelda, you should like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Oceanhorn doesn't reinvent the wheel, and that's ok! What it does do is replicate a proven formula with fantastic presentation and gameplay. The controls are work very well even when playing with a mouse and keyboard, which I feared would be problematic. Playing the game you really forget this isn't a triple A title. The music, voice acting and sound effects are all on point. Visually the world and monsters are a colorful treat, even if they aren't the most original. Bottom line, if you're a fan of the Zelda series then I believe you'll love Oceanhorn!",
            "review_score": "1"
        },
        {
            "review_text": "not a zelda rip-off, just simmilar in a good way",
            "review_score": "1"
        },
        {
            "review_text": "painting by numbers. Thats what the devlopers did using the zelda francise as there blueprint. That being said the game in its simplicity is enjoyable. Whether you play on the side when your on a half hour break or just looking for a casual game to play.   Pointers Baically a zelda game in a simplified format. Good mechanics Frame drops sometimes happen. 7-14hours gameplay depending if you rush it or go for the 100%. Great game to play on the side if you play hardcore games like SC2, LoL, DoTA,  enjoy your stay in Arcadia!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game that should be suitable for all ages. Definitely a must for one's game library. The devs are very customer service oriented, so, if you do run into glitches, just contact them and I'm sure they will work to solve your problem.",
            "review_score": "1"
        },
        {
            "review_text": "Nice easy game. Yes yes it looks like Zelda and is comparabable to Zelda but It's not Zelda. But still it is really fun to play. Haven't encountered any bugs. Storyline develops nicely and makes it interesting to continue.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like I would absolutely love this game if it had a little more polish. It's got some really good Zelda-esque aspects in here with the music being beautiful and all the people charming. But then it leaves out some really crucial Zelda-esque things (and I mean if you're going to go for it, go all the way).   The good:  + Artstyle + Music + Story + Inventory/Item switching  The Bad: - Movement controls are a bit sloppy - Boss battles are boring - There are unfixed glitches in the game that can really mess up your progress (for example, there was a boss that I could routinely get down to zero health and who wouldn't die. He would just fly around the boss room until I got impatient and let him kill me). - The game is often vague on what to do and not in a 'here is a puzzle to solve' way, but in a 'you can find one of the most useful rings in dark souls by climbing out a hidden tower and these ruins that don't look climbable, so you can go back to this area you didn't think you could get back to with no real markers or hints beyond a crow watching you' way.  - It has the FF8 syndrome where you can get locked into a village with no way to level, get more hearts, get better weapons, etc. And you can't get off that island until you beat a boss. That glitchy boss I mentioned before. It sucked.  There is just barely enough for me to recommend this game and a lot of the good will it had built up was destroyed by the that stupid boss glitch. If you're looking for a Zelda-esque adventure on PC that reminds you of Windwaker without all the sailing, but with more boring enemies? This is your game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good, simple, beautiful action adventure game. It's reminiscent of 64/Gamecube Zelda titles. It's shorter with a smaller world, but what's there is fulfilling. This is definitely worth picking up at this price point.",
            "review_score": "1"
        },
        {
            "review_text": "In a word: disappointing.  They would say it is a Zelda title for smarphones but anyone who played at least once with a Zelda title would be quite disappointed in hearing this: it couldn't be farther from a Zelda, from the mechanics, to the storyline, passing through the variety of items, equipment and monsters.  My sincere opinion is that it is a bad trend that the game industry is now uncapable of granting a certain quality in their product while states the exact contrary: in effect, it is surely a great shame that a game programmed with modern technologies is nothing but a mere and less accurate copy with no hope of comparison of a game from 20 years ago.  Nevertheless, forgetting their wrong ambitions, it is quite entertaining and worth buying while in sale.",
            "review_score": "-1"
        },
        {
            "review_text": "“Oceanhorn: Monster of Uncharted Seas” is an interesting game in concept. It accurately compares itself to the “Legend of Zelda” titles and is definitely reminiscent of the core gameplay in that series. The interesting part however comes from the game being on mobile devices and PC, whereas Nintendo has so far only released Zelda games on their own consoles. “Oceanhorn” attempts to tap into a niche, and does it fairly well, despite lacking the polish that Nintendo fans have come to expect.  The game is a mostly isometric dungeon crawler game akin to Zelda games. Using a sword and shield, along with various items unlocked through the game, the goal is to progress through various dungeons and reach the boss of each area. At times this is much easier said than done, as the level layouts can be a bit confusing at times. The levels themselves however look fantastic, and generally speaking the game’s graphical quality is up to the standard of the Zelda games, just with a bit less bloom which is very welcome.  In fairness to the game, as of yet I haven’t run into any major issues that have stopped me from progressing or caused me to wonder what exactly the developer was thinking, however my problems with the game arise from a series of small things that are missing. The easiest way to describe it is unfortunately just to reiterate the first paragraph; the game lacks polish in many areas.  The graphics of the game, as previously mentioned are pretty great, the game genuinely looks gorgeous, especially the water used to sail between islands. However some texture glitches and clipping can stand out while trying to solve a puzzle, and the isometric viewpoint can be a bit of a problem at times even with an adjustable camera. The game’s combat is generally solid, however hitbox issues can make fighting a bit unsatisfying, and the music sits comfortably in between being great and defining the landscape as Zelda games use their soundtrack, and being fairly mediocre. I never found reason to complain, but unlike some other games in recent memory, it never left me wanting a soundtrack to slap on my phone.  However, a lot of the issues I’ve raised with this game are present in others like it, and are usually forgivable, however for something that compares itself to a Zelda game, it’s hard to not judge it in the same vein as those titles. That said, this review has been a bit harsh so far -- while the game definitely lacks the polish of Zelda titles, it brings some of its own traits to the table which add to the game.  An experience system and a sprint function without having to wait to unlock the Pegasus Boots is likely the biggest improvement, as being able to zip around places you’ve already been through means hopping right back into a dungeon is always just a couple seconds away. The challenges offer experience as a reward and can add some interesting depth to the game, assuming it’s not a simple one like breaking several pots, something Zelda fans were going to do anyway.  Overall, the game does a decent job at mimicking the Zelda series, but as stated before multiple times, the lack of polish can stand out and may put some people off from the title. That’s unfortunate, because the game is generally enjoyable. It makes some legitimate improvements to the formula of Zelda titles, it’s just hard to not look at some aspects of the game and wish the developers had a bit more experience behind them so they could smooth out the rough bits. That said, it’s an enjoyable experience that at the least attempts to shake things up a bit.  3/5",
            "review_score": "1"
        },
        {
            "review_text": "For me these are the pros:  1. Atmosphere. Indeed, it is not a legendary story which chains you down from dusk till dawn. But it has a certain calmness, a bit like being the main protagonist of those old tales which are were read to children from big old books.  2. Simplicity and still fun. There is nothing complicated things in this game (maybe some puzzles?), but not a lot of skill points, inventory management, item augmentations, alchemy etc. In spite of this still offers a decent relaxation.  3. Graphics. I don't want to say that it has some uber hardcore graphics, but it has it's own 'bright' style, which is kind of a refreshing after playing 200 hours of survival horror.  Cons:  I really can't say anything really bad about this game. But if you are the person who needs some legendary stuff, and to feel feel like a mighty warrior or fearful mage, please avoid this game. :)   As a summary: I really recommend this game to those who can enjoy a game without the urge to compare to other BIG titles in the industry.",
            "review_score": "1"
        },
        {
            "review_text": "Given That this game crashes on launch , I sadly can not recomend it, I will update this if the dev ever fixes the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like Legend of Zelda? - This is Legend of Oceanhorn Link's clones Adventure  Do you like Wind Waker? - This is a clone of Wind Waker with a different story.  Do you like Easy Puzzle fighters like LoZ? - This is the game for you.  For $11, this game definitely gives me a great LoZ vibe and is a great gap filler for the time in between the LoZ releases.  8/10 I would recommend this to any LoZ fan.",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to experience a Zelda experience that is similar to Wind Waker on PC? Well you're looking at the game that will deliver that experience to you! It may be an iOS port, but if you didn't know that you wouldn't be able to tell - that's how good the game is. It's art style is beautiful, the level and puzzle design is excellent, and the gameplay overall is just straight out enjoyable. The music is great, and the voice acting is quite well done too, and the story kept me going without getting bored at all, which is a definite bonus.  So for all the LoZ fans out there, definitely check this out! I highly recommend this game to fans of the series (or people who like puzzles and quests mixed in with some RPG elements in general).  Enjoy! :D",
            "review_score": "1"
        },
        {
            "review_text": "The Good: - Art design and music lend perfectly to the genre. The game obviously emulates Zelda, but it also reminds me of other classics like Landstalker (Genesis) and Alundra (PS1). If you’re into these types of games, you’ll definitely enjoy what Oceanhorn has to offer.   - Certainly, the upgrades and variety of gadgets could have been more robust and there could have been more towns to explore, but as a five hour experience (if you're just focused on the main story), Oceanhorn didn’t need these extra elements to be enjoyable.   - Unlike other reviewers, I really liked the sailing segments. It’s essentially an on-rails shooting gallery that gives the player an opportunity to refill their inventory and health before reaching a new island.   The Bad: - For the most part, Oceanhorn ran smoothly; however, there were a few times during my play through that the frame rate plummeted. This occurred mostly when entering the towns, but thankfully it only lasted for ten to twenty seconds before returning back to normal speed.   - This game desperately needed an active mission hint system to give the player suggestions on where to go or how to accomplish certain goals. For me, this would have been helpful after major segments of the game as it took a bit of trial and error to figure out where to go next.   - Boss fights ranged from tedious to overly convoluted.  - If you’re an achievement hunter this game is not hard to fully complete. But, some of the fishing challenges (The Botfish) were ridiculously frustrating.  Final Verdict: I recommend this game, but only if it’s on sale. While there are numerous positives to Oceanhorn, there are design and game play elements which unquestionably detract from the overall enjoyment of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Well, i was shocked and surprised at the same time when i finished the game and though that was only e freaking Phone-Tablet Game. It was really good and enjoyable to play it, no more words, just the perfect and the first hybrid Zelda typology of game for the Master Race PC. It needs a bit of more work to become near as the Nintendo titles tho. But hey, just buy it when it is on sale or just after reading this , simple but effective at is own way. 9/10! (And yes, I'm a Zelda Fan).",
            "review_score": "1"
        },
        {
            "review_text": "It's great!",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a lower quality Zelda: Wind Waker that's still pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a smaller, off-brand, version of The Legend of Zelda: The Wind Waker. Since Wind Waker is one of my favorite games I was really happy with the similarities. Overall, It's a pretty solid game, although it does seem like it might be a little shorter than you'd expect from a full-fledged Zelda game. Also, the soundtrack is really great, and fits the art style well.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game. Plays like zelda games. Very nice music. the inverted y-axis control for aiming the pumpkin seed gun is confusing. would prefer an option for normal control. took me a while to realise i had to hit the bloodstone a lot of times to collect it. kind of thought there'd be a specific skill/item for collecting it haha. plays great with controller ^^",
            "review_score": "1"
        },
        {
            "review_text": "Some ours into this and it does play perfectly. Although that it looks like a zelda clone it does have differences.The story is good enough to keep you interested for like 15+ hours/Lots of achivs/Nice combat mechanics/variety of enemies/Good voiceovers. I would reccomend buying it and it does offer the things you expect from its full -price on steam. Currently 1 dollar/euro in humble bundle so why not give it a try if you love adventure games/Zelda",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, great for all ages. kinda like zelda 9/10",
            "review_score": "1"
        },
        {
            "review_text": "a zelda clone that reproduces all of the charm and none of the fun",
            "review_score": "-1"
        },
        {
            "review_text": " If you love Zelda, you will hate Oceanhorn.   I have no problem with games coping other titles and belive it can be a good thing. But the developer of Oceanhorn seam to lack a understandig of why Zelda is a good game. They copy mechanics and implement them in on of the worst ways I have ever seen.  My favorit example would be the bombs, that can be used in combat or to destroy walls. Zelda introduces bombs in a logical way and shows the player different ways of using them. Oceanhorn on the other hand gifs you said bombs and explains nothing. Of course if you know Zelda you will also know that you can destroy walls, they're clearly damaged and indicate that an explosion would destroy them. In Oceanhorn there is never a clear indication and it's more guessing than knowing. Rarly will you see a small part of an staircase or similiar to guide you the way.  I could make these examples for every design choice in Oceanhorn from the painfully fishing to the horrible level structure.  The only good things about Oceanhorn are the some what decent soundtrack and the visuals. (Although the blocky style often makes the gameplay worse than it should be)   If you really want to play this game i would recommend to wait for a good offer on a sale. It's not worth the full price.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good mini games ,, very Zelda like . ( not as cool ,, but )",
            "review_score": "1"
        },
        {
            "review_text": "So, I completed Oceanhorn today, after around 11 or so hours. It's so much of a 2D Zelda clone that I've taken to calling it 'The Legend of Zoldo'. And I have to say it is a very problemed game, and a lot of those problems stem from it originally being designed for a touchscreen.  For example, in order to make moving the character manageable with a virtual stick the developer opted to make you walk really, really slowly. Which isn't helped with a difficult to control dash move that has you running out of stamina almost instantly (and it takes ages to replenish).  Add to that the cube-based level design which only lets you jump down from a height of one cube (whereas Zelda lets you drop down as long as there is ledge somewhere below, no matter how far below) and you have to painfully trek back and forth around the levels a lot.  But the design oversights get worse. For example, you can throw and smash pots (oddly you can't break them with your sword) to get hearts, arrows and whatnot, but unlike Zelda where the item you get is semi-randomised in your favour, in Oceanhorn it's entirely random which means you can get flooded with arrows when your stock is full and you desperately need health or magic. Many times I've had to trek back outside of a dungeon/area until I could top myself up.  There are also other immersion killers such as the poor implementation of the soundtrack.  Don't get me wrong, I don't mean the soundtrack itself is poor (anything but), rather that the way it is used is overbearing. The game is constantly playing music that doesn't fit the mood of the scene, many times being just too cacophonous (works great in boss fights, not elsewhere) and, ultimately, tiring to listen to. The tracks don't even loop correctly as you'd expect of videogame music.  Finally there's the several sections in the game where the solutions to puzzles are counter-intuitive because you can't move certain statues/boxes (for seemingly no reason) but can others. Or one part where you have to gather items from the island you are on, but are not given any indication that the last item you need is on a completely different island altogether.  Still, it's not all bad. Some of the puzzle towards the end are pretty cool. And there's a really substantial optional island that is worth checking out. The story too, develops into something that is quite interesting (with the major characters voiced well).  But, all in all, I feel it's a game that just needs more polish, especially in the dungeons where you mostly do rudimentary puzzles. There's no sub-bosses or cool moments when you are locked in a room against an enemy mob. It's all just very... pedestrian.",
            "review_score": "-1"
        },
        {
            "review_text": "not bad, but far from what i expected. pretty mediocre",
            "review_score": "1"
        },
        {
            "review_text": "While overall it seems like a competent Zelda-clone, although with poor navigation/animations/consumables, late game bosses put such heavy stress on a broken camera and lock-on system that the game falls apart.",
            "review_score": "-1"
        },
        {
            "review_text": "The game's obviously a love letter to zelda games. It shows. A lot. And there's nothing wrong with that.  But once I get past the nostalgia, it's a very frustrating, tedious game. Controls feel very 'floaty' and unresponsive. Half the time when I try to aim at an enemy, the main character is a sharpshooter. The other half of the time, he can't hit the broad side of a barn and will just fling pots and arrows with wild abandon into the horizon like a drunken idiot.  Doorways have unnaturally large hitboxes. I've unwillingly exited rooms while trying to go pick things up.  And then there's just baffling design choices like filling a dungeon with firebats that can only be harmed by a specific ice spell that you only have enough magic to cast twice. The rest of the time is just running and being lit on fire half a screen away.",
            "review_score": "-1"
        },
        {
            "review_text": "Got bored very quickly with this Zelda clone. Sailing from island to island looks great the first time, but when there is nothing else to do it's just tedious. In fact once you get over the nostalgia of the music and the game mechanics, you realise that the levels might be graphically themed, but they're ever so samey. Some of the Super Nintendo titles are a lot more engaging than this one. I'm not saying it is terrible, but it could have been better with some better level design. There are other similar games that don't try as hard as this one and still have room for lots of innovation in their gameplay. Hack 'n Slash, for example, entertained me for hours longer than this one.",
            "review_score": "-1"
        },
        {
            "review_text": "As I arrived at the very first island (Home island not included), guess what I happen to see? A windmill-like object.   To quote a certain youtuber's video title, 'You like the Zelda?'  It's Legend of Zelda: A link between worlds with the sailing mechanic of LoZ: Phantom Hour Glass. With less polish, of course but don't let that discourage you. Just looking at the images you can tell that. I took one long at them and said 'That's Zelda inspired'  Give it a try. If you've ever played one of the DS Zelda games then you already have an idea of what to expect.",
            "review_score": "1"
        },
        {
            "review_text": "Good game until you reach the final boss... Controls very slow and buggy and way too much damage dealt to you by bombs... Frustrating fight... Did not complete the game becuase of it.",
            "review_score": "-1"
        },
        {
            "review_text": "78/100",
            "review_score": "1"
        },
        {
            "review_text": "Pretty simple game. Very Zelda like, and was pretty fun. Not the best game out there, but overall enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "It is a simple clon of the Zelda games, and it is not bad, it is so adictive, i stop playing beacause i have to work haha.",
            "review_score": "1"
        },
        {
            "review_text": "Superb music, story flow and grapics. Light RPG for those who look laidback game experience with limited timetable. Especially recomend for younger players.",
            "review_score": "1"
        },
        {
            "review_text": "Zelda .... Thats basicly it",
            "review_score": "1"
        },
        {
            "review_text": "It's very slick and console-like and it's like having Zelda on the PC but it feels a bit generic compared to Zelda.",
            "review_score": "1"
        },
        {
            "review_text": "A 2.5D Zelda clone for the PC that isn’t quite as good as Zelda.  You wanted more?  Fine.  Oceanhorn is a game about a kid who is looking for his dad. His dad took off to face off with Oceanhorn, the last of the Living Fortresses, great monsters which were left behind by an ancient civilization. Your goal is to go from island to island in search of your dad.  The core gameplay is very familiar to Zelda fans – you have a sword and a shield. You wander around stabbing stuff. While the game has 3D graphics, it is fundamentally 2D – indeed, it is a major gameplay mechanic that you can fall down one “floor” worth of blocks, and can only go up via stairs. This is pretty much how all the dungeons are arranged, and numerous puzzles center around your inability to jump.  This is not a sophisticated game – you walk around and slash stuff with your sword. There is no Z-targeting or anything of the sort, but the game does have a sort of auto-aim feature.  Over the course of the game, you acquire items – bombs (for blowing stuff up), a bow and arrow (for shooting targets to trigger stuff, as well as certain enemies), a fishing rod (because what is Zelda without fishing?), boots (for jumping over one-square gaps)… really, exactly the most basic items you’d expect in a Zelda game. You also get spells – a fire spell, a spell that drops stuff on switches, an ice spell to freeze stuff which seemed unnecessary, a cure spell that I only used on the final boss, and a black hole spell that is super overpowered but useless on bosses.  That said, the game is pretty easy, and the puzzles basic. There’s nothing here that you haven’t seen before many times.  And that’s really the problem with the game – it is nothing new. It is just a kind of mediocre Zelda-ish game that doesn’t do anything new, just sort of treads the usual ground. The bosses are nothing impressive, the ordinary enemies are mostly boring and samey (and you find them a lot – there isn’t a whole bunch of variety, having even less variety than Zelda games), the environments didn’t feel that varied (you’re on a bunch of islands, but few of them feel unique)… really, there’s just very little here to excite you.  It isn’t bad, and the voice acting is decent (even if the script is often not great), but there’s just little here to get excited about. You’ve probably played Zelda, and if you haven’t, this isn’t a great introduction to the genre – games like Darksiders felt like they were much more interesting new interpretations of the Zelda formula than this was. This was same old, same old, and fairly mediocre. There’s nothing great about it, and while it isn’t bad, there’s little to recommend. ",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty aesthetic, great soundtrack... but it stops there.  Boring gameplay, boring level design, boring boring boring.",
            "review_score": "-1"
        },
        {
            "review_text": " *EDIT*   (Improved the review)  If you're looking for a good Zelda-esque experience, look elsewhere. I know people really want a good PC Zelda-style game, but Oceanhorn is very mediocre. I am honestly puzzled as to why Oceanhorn has so many positive ratings, given how many clear faults it has.   Pros:  -Decent Music. -Solid Controls. -Environment visuals are ok.   Cons:  -Extremely short dungeons. -Uninteresting/Forgettable dungeon design. (Both in layout and visuals) -Uninteresting items. (With the exception of Force Spell, and Trencher Boots.) -No Overworld to speak of. (It's a glorified level-select) -Boring sailing from island to island with almost no interactivity. -No open exploration at all. (just level-unlocks hidden in other levels.) -Terrible animation. -One Spell has no animation at all. -Bad voice-acting. -Very limited enemy types. -All of the enemies are too easy, including bosses. -Late game enemies are very sword-spongy. -Collectables take a long time to harvest, wasting time for no reason. -No sense of urgency in the plot, ever. Because  *Mild Spoiler* : it does not actually progress at all until the absolute end of the game. (As an example: It is like if the entirety of 'A Link to the Past' was spent just looking for your Uncle.) -Shallow and uninteresting characters. (with the mild exception of the father due to narration on each island, but you never really get to know who he is, just that he did some stuff and has a kind of gravelly voice.) -Painfully awkward 'emotional' scenes, where you're supposed to really care about character(s) you've barely even seen before, let alone talked to.   In Conclusion:  With all of these Cons, Oceanhorn still might be worth getting if it's on a  very  steep sale, (ie. for $2.00 or less,) because the Dungeons are at least somewhat entertaining, and it is a mercifully short game. But it is  not  in any way shape or form, worth anything close to full price.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty much one of the worst indie games i've ever played.  Has no good aspects or zelda, it's laggy, and it's boring as hell.   1/10 would never touch again",
            "review_score": "-1"
        },
        {
            "review_text": "  7/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "It's a zelda-clone, and a damn good one. The game it most heavily reminds me of is Legend of Zelda: Phantom Hourglass, mostly because of the setting and usage of some of the items. It has it's flaws, the magic spells are a little too expensive for my tastes and gold suddenly becomes really common after about the halfway point, but besides that this is well worth purchasing.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of the games I played on playstation 1 when I was like 14, only with better graphics and an awesome soundtrack. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "Nobuo Uematsu's involved in this game = Insta-Buy!!!",
            "review_score": "1"
        },
        {
            "review_text": "If LoZ: Wind Waker &amp; Diablo III had a baby it would be Oceanhorn (Although more parts Wind Wake than Diablo III), but from what I've played through so far it's a fun adventure game that is worth a buy. I must also say Cornfox &amp; Bros did a good job from porting this title over from a mobile platform to the PC as it looks stunning while maintaining some solid gameplay despite a little draw distance &amp; render tearing that I experienced though that might be just my PC at fault. Very beautiful on max graphics as well, and the frame-rate is crisp as well!",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game a few minutes ago and I must say im impressed!! Very colorful and well designed environment, fun gameplay, also the soundtrack is quite amazing itself.",
            "review_score": "1"
        },
        {
            "review_text": "Adventure game with this style, gameplay and feel are what we need more of.",
            "review_score": "1"
        },
        {
            "review_text": "2D-Zelda style gameplay with great 3D graphics. If you like oldschool zelda games, this is a perfect fit.",
            "review_score": "1"
        },
        {
            "review_text": "Unabashed Zelda clone, but decently executed.",
            "review_score": "1"
        },
        {
            "review_text": "I see some complaints regarding the qaulity, and the idea its a zelda clone.. look people its $15 your not going to have the qaulity of a zelda game from an indie.. sure there are a couple gems but the likley hood is slim.. the story is almost non-existant and you wont feel attached to any charecters. But i still recomend based the dungeon crawling, multi-weapon dynamic that was pulled straight from a old school zelda game with no shame",
            "review_score": "1"
        },
        {
            "review_text": "Very cool zelada inspired game. There are couple minor flaws but nothing that can be deal breaker or spoil the fun, overall very solid game, it was better than I thought it would be and I think it is worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting gripping storyline .simplistic and was hoping for some kicks along the way. However it was very buggy till i figured out to enable it in the catalyst center for high performance.if you want to play though be prepared for lots of seafaring between islands...overall a positive vibe. game on !",
            "review_score": "1"
        },
        {
            "review_text": "Great game altogether, however I'm going to say 3 out of 5 stars. Here's the pros and cons from my experiences of the game:  PROS - great story, it follows through very well despite the side quests - Graphics are A+ from what I can manage on my computer. However... - a lot of chances to explore and the way you sail around really does remind me of LoZ: Windwaker. Although... - FISHING! I love fishing, and I'm a fan of collecting. - Dungeons reward you for exploring everywhere. - Boss battles are challenging, yet still easy for casual play.  CONS -  Graphics:  Despite the game being visually appealing, I was forced to lower the resolution because the game would go haywire if I went to better graphics. The screen would flicker and the game screen would black out like some creepy haunted video.  -  Movement:  The character moves too slow sometimes, making me wish there was more of a dashing chance without it eating up stamina so quickly. It wasn't fun walking around a boss and hoping they wouldn't hit you and kill you so quickly. -  Camera Angles:  The biggest reason I can't give a better score on this game. In my fight with Mesmeroth's Spirit, when you're trying to wack the little flaming orbs to find him, the camera angle would TWIST YOUR VISUALITY AROUND SO MUCH that you would STRUGGLE just trying to simply hit all the orbs. I couldn't hit them in time because THE CAMERA WOULDN'T LET ME. I died many times because of this. :( - The second time I was fighting the fish boss, he got stuck on one of the pillars and couldn't move. It ensured my victory...but... -  Exploration  - I love exploring. The map is great and going everywhere is fun, but I wish instead of going on a set course, you could sail on your own. It'd have a more Windwaker feel, but it'd also feel nostalgic.  Either way, great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game was originally released for the ipad and now ported to PC. In general I tend to find those two things normally equate to that of total crap. Surprisingly however, Oceanhorn stands out as a shining example of how a solid port should be done.  No hiding the fact it's a total Wind Waker clone. Pretty much everything in this game draws direct connection from much of the Zelda series. Trying to fill those shoes can be a pretty huge task, which it at least does a pretty good job of emulating. It manages to capture the nice open colorful world in the same fashion as Zelda. The characters, monsters and bosses are fairly creative. Most of what you encounter tries to mimic the art style of Zelda quite closely. Not quite as charming of course, although to be fair it'd be hard to live up to some of the most beloved games of all time completely.   Sometimes you can sense a bit of the restraints from this game originally being intended for the ipad. The combat is good, but I feel like it's not quite as fluid or polished as it could have been. Had it not been originally designed around the ipad. For the most part at least it comes off rather well on the PC using a controller. It also allows for the use of mouse an keyboard controls.   Unlike Zelda, Oceanhorn features a leveling system. Gaining a level can result in earning coins an item refills, increasing the number of bombs you can carry, but it also serves to unlock other things such as a cannon item for your sail boat early on. The boat is your main source of transportation for island hopping around the world. Travelling by boat is done on a rail system unlike the free roaming in Wind Waker. I guess to try to make the travel portions a bit less dull, they decided to add in things like explosive mines and enemies along with crates and things you can shoot for experience and coins as you travel along. This portion can become a bit tedious at times.   The music is nice and the game looks good enough for what it's intended to be. Saving is done either automatically when entering a new area or when activating checkpoints. Not having the option to save manually however can be a little annoying. The game itself is pretty forgiving however. If you find yourself being killed, you're automatically transported back to the location of your last checkpoint save, while retaining any items and exp you collected beforehand. For the most part the difficulty is rather mild.  In the end for what faults it does have I would still recommend this to any fan of the Zelda series. All in all it's bit like a smaller Wind Waker lite. It does do a pretty good job in filling a nice niche, in which it's hard to find many similiar games on the PC. If you're looking for something to fill that Zelda-esque desire you probably won't regret buying Oceanhorn. Overall I'd rate this game at maybe a close 7 out of 10. Probably won't wow you, but enjoyable enough to be worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "I would not recommend this game it feels like a legend of zelda wind waker clone.  Pro's --------- Good graphics Okay cutscenes  Con's --------- combat feels sluggish combat is too easy to bs weapon set mimics legend of zelda weapons uninspired feels like there is only one voice actor very boring puzzles way too easy ai too predictable",
            "review_score": "-1"
        },
        {
            "review_text": "A stunning combination of modern graphics, old-school Zelda gameplay with modern Zelda goals, a touch of Windwaker islands, no restraints from fan-service and a clear amount of love and dedication to the format. This will be the best non-third-person Zelda game you've played for a long time, but don't let that comparison fool you as this game has so many good, well-followed-through ideas that you'll be left feeling Nintendo needs to catch up.  It's got everything you'd expect from the years of Zelda variations we've had: elemental relics, fish and bird people, arrows and bombs, heart pieces, and a silent protagonist. But it's also got a lot you woulds: XP and levelling up, fishing, built-in non-grinding acheivements that award XP, far more subtle secrets than Zelda's ever had, and persistent rooms that don't reset when you leave. This isn't some cheap indie cash-in. This was made with love, for the sole purpose of being a  good  game.   [Update]  The further you get into the game, the more you see that this really is a shameless Zelda clone, which is very sad. It had so much potential to be special, but beyond simply a tribute game, they've stuck to the same old formula to the same detriment as Nintendo. The primary-coloured tunic, the carbon-copy Zora fish-people who are frozen and you save their princess, the legendary sword that looks identical to the Master Sword with a palette-swap, the three elemental gods whose elemental symbols you collect to gain their favour, refurring to Cuckoos by name (Zelda's name for chickens), and I mentioned it before but the silent protagonist is entirely unnessisary - characters converse with you like you're talking back, and this is a game where there is spoken, english dialogue, quite unlike Zelda.   Using an item to jump and casting ranged spells is a welcome change from the formula, but it's not the gameplay that's the problem - the fighting, puzzles and level design are all really fun. No, it's the strict adherance to creating an off-brand Zelda that really lets this game down. If you've never played a Zelda, then fantastic, but I imagine a lot of the people who bought this game were drawn to the aesthtic and familiar mechanics. This game could have been so much more and stood out on its own merits- the foundation is there -but its reverence to its inspiration is its downfall, highlighting all the stolen ideas and overshadowing the innovations.  If there's ever a sequel, and I would like there to be, I do hope they take a seperate path and turn this story platform into something unique.",
            "review_score": "1"
        },
        {
            "review_text": "It's alright, only really worth one run-through. Like wind waker for babies made on the unreal-engine. Controls are fine if a bit fiddly at times when it mattered. 5/10, 'meh'",
            "review_score": "1"
        },
        {
            "review_text": "A clever and well-made game that, while similar to the Nintendo Zelda series, manages to stand on its own. Good sound and visuals. Runs great on Windows 10. Can't wait to see the next offering from this creative team.",
            "review_score": "1"
        },
        {
            "review_text": "I played it offline for about 7 hours, I also read some reviews before making one my own. It's a good game, but it fails to be original in any way bothers me a lot. it's a shameless clone of legend of zelda. If I get bored, I might finish the game, but there's nothing new to expect for me. I'll still give it a recommended review because it was at least a decent game. 6/10  Pros: +Eye refreshing, Good backgrounds +Zelda on PC  Cons: -A total zelda rip off, definitely not unique -Characters are not adorable -Story and direction are boring and probably rip off too.",
            "review_score": "1"
        },
        {
            "review_text": "I'm so glad they have released a Mac version or I'd never have got around to playing this.  I've only recently started playing the game, but I'm enjoying it greatly. Attractive graphics and atmosphere, plays well, no complaints at all so far. I'm going back to explore some more...",
            "review_score": "1"
        },
        {
            "review_text": "A good Zelda clone. Not as extensive or cerebral but a very fun 10 hour experience. MOre a slice os Zelda as there are only a few bosses to face,though they are all pretty well done. I only managed 75% completion in those 19 hours so there is certainly still left more to do but I doubt I will come back to to 100% it. I'm happy with the time I have spent with it an don't want it to over stay it's welcome. (I never 100% Zelda either,to be fair).",
            "review_score": "1"
        },
        {
            "review_text": "For a shameless ripoff of Windwaker it was quite a fun game to play. It does not have a great story progression and it is rather short, but it is definitely a nice title to catch during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great game, took me awhile to get into it, but once i did, i was hooked. Especially considering how easy it is to get achievements. I'd recommend this to any Zelda fan, as well as if your curious about what Zelda would be like or were wanting a similar game. I brought this to see if it'd get me into Zelda and it definetly has done that, well done Cornfox &amp; Bros, you've done an exceptional job of making a Zelda experience i can remenise about.",
            "review_score": "1"
        },
        {
            "review_text": "A testament to how strong the Zelda formula is. Lame story with lackluster gameplay still fun because Zelda. Graphics sure are pretty though.",
            "review_score": "1"
        },
        {
            "review_text": "At first,i was quite frustrated with this game.I would launch it,play for a maximum of 10 minutes,then the screen would freeze. After i found the solution,i started playing the game for good. Having played 4 hours so far,i gotta say it's a nice game from many aspects.The graphics are nice for an indie,the gameplay is ok and the control is user-friendly.It reminds in many ways every Zelda game but that is ok by me. The story is not that complicated,you can easily follow the plot,there are logs and videos in Pause Menu in case you forget a few things.  Pros: - Get to explore many islands,tiny and huge one,core and secret. - Nice graphics - Controls are simple,it takes like a minute to learn. - Narration - Secrets,achievements and various in-game rewards that you have to unlock.For people who like to fully explore a game.  Cons: - Even though the visuals are nice,for some reason,there is a incompatibility with many GPUs.Probably bad programming in this part. - Going from island to island is nice,a 'Fast Travel' option -at least,after a point in the game'- would be appreciated.",
            "review_score": "1"
        }
    ]
}