{
    "app_id": 339340,
    "name": "Resident Evil 0 / biohazard 0 HD REMASTER",
    "release_date": "2016-01-19",
    "developer": [
        "CAPCOM Co., Ltd."
    ],
    "publisher": [
        "CAPCOM Co., Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Horror",
        "Zombies",
        "Survival Horror"
    ],
    "achievements": 47,
    "positive_ratings": 2196,
    "negative_ratings": 393,
    "price": 15.99,
    "description": "Before the mansion, before the destruction of Raccoon City, there was Resident Evil 0. Now remastered with improved visuals and sounds, as well as the all-new Wesker Mode, there's never been a better time to experience the origins of the Resident Evil story.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339340/header.jpg?t=1554398136",
    "minimum_requirements": "OS: Windows® 7 SP1 / Windows® 8.1 Processor: Intel® Core™ 2 Duo 2.4 GHz, or better Memory: 2 GB RAM Graphics: NVIDIA® GeForce® GTX260, or better DirectX: Version 9.0c Network: Broadband Internet connection Storage: 13 GB available space Sound Card: DirectSound compatible (must support DirectX 9.0c or higher) Additional Notes: Supports Keyboard +Mouse. Genuine Xbox 360 PC compatible controller recommended.",
    "recommended_requirements": "OS: Windows® 7 SP1 / Windows® 8.1 Processor: Intel® Core™ 2 Quad 2.7 GHz, or better Memory: 4 GB RAM Graphics: NVIDIA® GeForce® GTX 560, or better DirectX: Version 9.0c Network: Broadband Internet connection Storage: 13 GB available space Sound Card: DirectSound compatible (must support DirectX 9.0c or higher) Additional Notes: Supports Keyboard +Mouse. Genuine Xbox 360 PC compatible controller recommended.",
    "reviews": [
        {
            "review_text": "Goood job capcom, now remake RE 2 and 3 hehe :3",
            "review_score": "1"
        },
        {
            "review_text": "more classics capcom please and the outbreak titles on steam would be so awesome!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy classic Resident Evil games, then get this. If you enjoyed the Resident Evil Remaster, then get this.  Its 19.99, just get it. You know you've wasted more on stupid early access and greenlit games..why are you still reading this you should be at the check-out already.   Ignore all the people who wrote negitive reviews inventory system and character control system, they clearly missed the point of Survival Horror. You're not suppose to be able to carry all the guns, ammo, medical supplies and key/puzzle item for game progression. You're suppose to freak out, you're suppose to back track, avoid monsters, as you progress. You pick and choose your battles, you can't duke nukem it up in this game. This is the twist they added to the original formula - two characters, two inventorys, characters get split up, each character helps solve a puzzle, both chracters have their upsides and downsides.  +Graphics are fantastic, game was updated while preserving the original atmosphere of the game.  +Controls + Steam Link + Steam Controller is fantastic. Any gamepad will work as well. +Audio has been improved and sounds great (Depends on your set up as well.) -/+ Only down side is the game still uses the original GC version cut scenes, they look fine considering their age.  Again why are you still reading this? Go buy it already.   Now I need Resident Evil 2/3/CVX Remasters. Thank you. ",
            "review_score": "1"
        },
        {
            "review_text": "a game where In-game graphics look far better than cinematics.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  * HD graphics - Enviroments look beautiful.. * Difficult puzzles. * Two playable characters. * Able to drop items anywhere. * Real survival horror. * Ammo is scarce.  * Good backround info for Umbrella. * Able to change costumes at any time.  Cons:  * The ridiculous price for costume packs. Without pre-ordering, they cost about as much as the game!  * Inventory Management between two characters is still a pain. * Would've liked more control options for controllers. Run needed have an option to be mapped to the X button!  * Bigger weapons take up more space. Shotgun = 2 slots. * No option to skip door/stair transitions (it was there in Deadly Silence, Capcom!). * Bad bosses.  * Lack of save rooms with the Safe Heaven track. * No resolution for a character at the end. They sort of drop off the face of the earth after this game (previous players know who I'm talking about).   Though not as good and classic as the first, it still holds its own as a genuinely fun and engaging RE title.",
            "review_score": "1"
        },
        {
            "review_text": "Its just like the original Resident Evil game, but with extremely upgraded graphics. Very fluid looking and very fun. If a challenge doesn't bother you, pick this one up. Its hard, but its worth it. For a retro style game - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good Remaster! If you like the old Resident Evil, gotta get this one. Played it on gamecube back in the days, was fun then and is fun now. Graphics are crisper than in Resi 1 Remaster in my opinion. Finished this one and started the first one right away, so my comparison is up to date.  Inventory system is a little different and can be annoying at times. You dont have a chest to put your items in. You can drop everything on the ground, wherever you stand. I like this system, dont have to run back to the chest to put something in when i want to pick up a new item. Just drop it and get it later. Your map shows you where you put your items. I recommend making main item rooms, so you dont find yourself searching for that magnum ammo. One downside to this inventory system is, that you can encounter bossbattles while youre totally unequipped. This could happen in the first one too, but in this one, due to the 2 playable characters, it might happen that the important stuff is on your other character, which isnt always available. So youll need to live with what you got or load a savegame, to reequip. As i mentioned before, i started the first one after finishing Zero and i kinda missed the ability to drop items where i want. But i guess this is totally up to personal liking.  This is one of the classic RE games, many say it is the weakest, i loved all of them. So if youre in the classic ones you wont be making a mistake getting this one.   Highly recommended!  ",
            "review_score": "1"
        },
        {
            "review_text": "A good Resident Evil game that was beautifuly remastered, but it isn't quite as good REmake, and newcomers might have a hard time dealing with the lack of Item Boxes and having to take care of two characters at the same time.  I can totally understand someone who loved REmake not enjoying RE0, but even so, I still give this game a 7.5/10 due it being the last RE game made with pre-rendered backgrounds and classic, tank controls.  Just be prepared to haul your dropped stuff on the ground many times as you progress through the game.",
            "review_score": "1"
        },
        {
            "review_text": "i finallly got my chance to play this game again i hope this helps us get re outbreak remastered on all platforms and a bigger inspiration for re 2 remake so you can reused some features from zero",
            "review_score": "1"
        },
        {
            "review_text": "Idk what want to review but the game was awesome. I love watch classic RE Zero and other old RE series while my sister played until complete game when in my childhood. And now im try to play RE Zero and RE1 Remaster to bring back those memories that I had before... :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I first played this back on the Nintendo Gamecube when it was an EXCLUSIVE... I guess the contract was over since it's been ported over... Nevertheless, as a hardcore RE fan...I must purchase it! Definitely a HD Remaster...! I love RE! Looking forward to RE7!",
            "review_score": "1"
        },
        {
            "review_text": "It's the original Resident Evil Zero with some new polish. But faces some new challenges.  First of all, Let's make this clear. This is the exact same game from 2002. Only with 60FPS gameplay, New controls and higher resolution Textures. If you was expecting a 'Remake'. That's not what this is, this is a more modern version of the already amazingly beautiful, crisp and solid GameCube game from 2002 (And Wii during the later years). So you should treat it as such.   Somehow, Capcom managed to make this game look even better than Resident Evil 1 HD. I can't place my finger on it but it overall looks crisper. Almost as if they've done more effort than before. The details in the environments make the GameCube version, even though it's still a spectacular visual experience, look way outdated.   There is a problem however, the game looks so good, that the CG Movie clips looks outrageously bad. It's ripped straight from the GameCube and you can see this clearly in the credits as it uses the old Logo. The CG Videos looks extremely compressed and honestly worse than the actual game. Some moving objects in the background seems to be running at a lower FPS than the rest of the game, which is fine but may look odd in some situations. Yet the intro movie when you start up the game is done very well for some reason. Odd.  Interestingly enough, This game doesn't include any strange 'Remixed' or 'Remastered' sound tracks like in Resident Evil 1 HD. Even more strange it doesn't include the Soundtrack. Pre-order bonus or not. Not a huge deal just a tad odd.  It definitely shows that Capcom put in some more effort into this one. There's actual DLC Costume packs, which while Resident Evil 1 HD does add 1 extra outfit for Chris and Jill. Here you have 5 Packs for Bill and Rebecca. Plus a new game mode to boot. What gives Capcom? Give RE1HD the same treatment!  Since it's the same game as the 2002 Gamecube original. It suffers from the same problems. It's a very slow, sometimes very tedious Survival Horror game. With fixed Camera angles and even though it has a more modern 'Better' control Scheme. The long animations of the characters make the action extremely slow paced and sometimes frustrating. However, That's how Resident Evil was loved before. That's how we remember it. And it's a love or hate argument. Simply put, if you only play Resident Evil 4 and above. Stay away from this one or any of the classic ones unless you're ready for a much slower game.  Now for this versions biggest flaw. Controls. Firstly, the Inventory and Sprint keys for the tank controllers are flipped. None of the Control options can change this. At all, you can't even map manual actions like in RE1HD. How did Capcom screw this up is beyond me.   It may not seem like an issue. But oh goodness is it a problem. The 'Y' button on a X360 controller switches characters. You can see how that is already a problem. If you played RE1HD a lot. That same button should be inventory. Instead, it's the 'X' button, Which should be Run if you're playing in Tank control mode. This is unacceptable. Even in the GameCube version and I dare say the Wii. The Control buttons made sense. Here it's setup in some absorb rubbish. I don't care if it's 'Japanese' style or whatever. It doesn't change the fact that in the first game it was set to it's normal controls. And this is the PC version, which is Internationally the same with a simple Language change.  That doesn't seem like a horrible issue. But it's quite the annoyance, especially since it got me killed a few times.   All in all. This is a fantastic Remaster. And I'm happy, because this is one of my favorite Resident Evil games. If the Controls could be mapped, the CG Videos redone in a higher resolution and less compression. Possibly add the soundtrack for consistency? Then I'd say this is a perfect remaster. And it still is a great ride.",
            "review_score": "1"
        },
        {
            "review_text": "The sad fall of Rebecca Chambers. From crack shot, leech killing bad ♥♥♥ in RE0, to completely unable to defend herself in RE1. Must have taken too many green herbs and forgot everything.",
            "review_score": "1"
        },
        {
            "review_text": "Looks Good!  Waiting for RE 2 Remaster",
            "review_score": "1"
        },
        {
            "review_text": "Can't say I'm a huge fan of the old style RE titles but since I never actually got to experience them, it's nice to go through them with modern updates. I'm not much of a patient gamer so the old gameplay and saving style got in my nerves at times, still enjoy the story to 'see how it all started'. Also cool that capcom brought in some additional content like Wesker mode and costumes.  Next up, RE2 HD.",
            "review_score": "1"
        },
        {
            "review_text": "I'm new to the Resident Evil franchise so I decided to buy this gem on sale. (Rebecca in a  cheerleader outfit  was a deciding factor.) I must say I'm quite impressed.  The controls are quite intuitive and if you plug in your Xbox controller via USB it's plug-and-play.  I've just 'parked' the train and am exploring the next stage but the graphics are really quite good. The sound is great too, I saw the Dolby logo on a startup screen.   Graphics: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the oldschool Resident evils, then this is for you! Those who are not familiar with these kind of RE games may not like this, but I suggest you give it a try. its not that expensive.  The graphics are remastered and they look pretty good. The great thing about these old RE games is the athmosphere which comes from great music and gameplay that require puzzle solving and many situations where you have to think about whether to run or use your limited ammo to kill enemies.  You play as two characters, but you move only one character at a time. Each one has their own personal item and special ability, such as strenght to move heavy objects or to crawl from small holes. Sometimes you need to move together, sometimes you cant, and sometimes its just not necessary or smart. Ammo and healtpacks are limited, and you have to decide which one takes them, You can swap and leave items, and if you move to next section of the game the items oddly follow you, which is a good thing. There are several different enemies and also bosses. Some drain your health pretty fast so you have to act and think fast. There are three difficulty settings. I personaly think the easiest setting is too easy, so you should start with normal.  Turn off your lights and put volume to max, I quarantee this game offers some good scares!",
            "review_score": "1"
        },
        {
            "review_text": "The classic Resident Evil with fixed camera angles and it's great! You're constantly worrying if something is gonna pop out and scare the s*** out of you. The graphics look pretty nice and runs at a silky smooth 60fps. This version has a mode which replace Billy and let's you control Wesker with a few special powers which is a fun thing to mess around with. One thing it needs is more outfits for Rebecca and Billy.",
            "review_score": "1"
        },
        {
            "review_text": "Great remaster!",
            "review_score": "1"
        },
        {
            "review_text": "Man.. This game..  It certainly needs no introduction, everyone knows the resident evil saga, and the most appreciate its early titles more than the last ones. I honestly like both (my most played game on steam is RE: Revelations 2 and I played... a lot of RE: Revelations not on steam) for different reason.  I really liked this Resident Evil 0 a lot, I don't care if it's a remastered version of an old game (that's one of the reason i bought it, since i've never had a Gamecube, like most of the people i guess). The thing about this game, or the first RE, is that is difficoult.. very very difficoult, but not like Dark Souls; it is difficoult in a better way (i like Dark Souls too btw). There are no monster that oneshots you and you can't die by falling from somewhere high, the reason this game is difficoult are the same of some other RE games: you are a human (which means that you actually die pretty fast if a zombie eats your face), there's an extremely lack of ammo of any type and the puzzles are great.   So why this game is so good? Because it's extremely challenging, which means that when you succeed in doing something, like finish a puzzle, or go through a zone with a lot of enemy without using any bullet, you feel litteraly amazing! This game gives you a sense of satisfaction like I've rarely seen in other games. I've litteraly found myself cheering after beating a boss or something like that.  By saying this I'm also saying that this game is extremely immersive, I really felt thrilled for almost the entire duration of the game, and this is just awesome, and i also think that this helps a lot since it's a survival horror game. In my opinion a good survival horror needs to be this way, it needs to keep you attached to the monitor, it needs to scare you without jumpscare, and this is important. This game scares you, without any jumpscare, but thanks to the atmosphere, the settings, the music and the sounds in general. Everything is exactly where it's supposed to be.  And last but not the least, it's a RE game.. so even the files and the documents you find during the game are very interesting for the sake of the entire RE history, especially if , like me, you've never played RE zero before.  So probably the fact that I'm a huge fan of the saga helped me a lot enjoying this game, but still I think it's a great game, which everyone who like a genuine survival horror should definetely try out.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the weakest of the best is still good, right? Resident Evil 0 is a rather mediocre entry among the absolute best classic Resident Evil titles, which means, it's still way above a lot of classic survival horror wannabes. And in its HD Remake version the game got better. Not just visually, like it mostly was with REmaster (not like it was a bad thing, mind you) - RE0 HD is actually more fun to play than the original GC (and later Wii) release.  Resident Evil 0 itself is a game with a long history of development. Prequel idea started being R&amp;D'ed before RE1 was even released, game was finally shown in some playable state on N64 in 2000, but it seems like a lot of post-train story and gameplay was still not 100% set. After that the development was completely restarted for GC alongside REmake with slight story adjustments for both for continuity. And I think for a lot of people the concept of the 'Resident Evil on a train' was something that stuck with them - it sounded interesting and new. And it actually is. Sadly, the Train is only about 1/5 of the entire game.  The game has a lot of intersting concepts - two playable characters at once, change from item boxes to 'put item on the ground anywhere', a bit more emphasis on unique abilities of playable characters - something RE1 introduced and since hasn't really been used again in the series. But it's the implementation that makes it all go average instead of great. Playing as two characters is not as fun as it could be, item management is more forced and boring and unique abilities of characters apart from gameplay differences (Billy deals with recoil better and gets hurt less), are very rarely used despite the possibilities. Even the ideas from other games in the series up to that point, are either unused or underused - zombies travel across rooms only once, Crimson Heads are not here, there's no dodging or self-defence items, no creepy pursuing enemies (just an annoying, but often easily skippable, leech-monster), no real scenario variety.  But the main downer is the levels and the overall feel of the game. Story is all over the place, never sticking to any particular tone, with jRPG fabulous-looking evil guy being the main bad, game opening with documentary style narration (but never going back to it), character suddenly referencing the future (because it's prequel, you see?). And yes, it's storytelling in Resident Evil, who cares, right? Well, thing is - no matter how silly a lot of RE stories went, they usually did it with style and in a memorable cool way. RE0 is just 'eh, it happened, I guess'. And the levels are just... boring. So are the bosses. They all feel like a collection of discarded classic RE ideas put together in one game. It also cannot really choose between the more colorful and stylish look of classic PS1-era REs and the 'creepy old' look of REmake, something that was improved a lot in the HD Remaster (original was very gray/yellow-ish), but still feels not as good as other games.  But HD Remaster fixes not just visual issues and makes the game look very good. In addition, it adds several welcome changes in the controls (realtime reload button is a cool thing), most notable of which is the alternative control scheme. Now it was also present in REmaster, however REmake worked perfectly fine with classic tank controls - all the animations felt right, moving and shooting and evading was fun to master and use. In RE0 original tank controls have a slight delay due to additional animation frames for a lot of actions which are simply removed in alt. control scheme, making it a much better option, especially when controlling the partner character, even despite few places, where camera changes to screw up your movement. In addition to that, game also gets a silly and fun to play Wesker mode, where Billy is changed into RE5-style Wesker, who can run at super speed and explode enemies with his aura at will. It's a ridiculous mode, that gets even sillier when you complete it once, as sadly there is no Wesker Leech Hunter, but all the rewards in the game are just unlocked for the second playthrough. It's funny, it's fun, it's a nice way to relax after Leech Hunter or hard mode playthrough, and it's always fun to explode zombie heads with your thoughts.  So, is it a good game to get? Well, if you like classic survival horror and this is the game you've missed before - definitely. If you're a fan of RE series - yep. If you want to get into classic survival horrors - only after you try out better options. REmaster is a better option, but I would've suggested checking RE Director's Cut (just not dual shock ver., if you value your ears), 2 and 3 as well, if possible. And same goes for people who are just checking this out without knowledge of the genre and the series - this is a rather good way, but there are better options to start with.",
            "review_score": "1"
        },
        {
            "review_text": "Resident Evil 0 deserves more credit.  Of all the more traditional games in the series prior to Resident Evil 4's more action-y gameplay overhaul, 0 receives the most trash talk. It first appeared in 2002, well after all but the most ardent of fans were tired of the survival horror formula and ready for something new. Despite a few minor additions, Resident Evil 0 didn't offer that.  But that's precisely why this Resident Evil 0 HD re-release from Capcom is so useful. With distance from the atmosphere surrounding its release, it's a lot easier to view Resident Evil 0 for exactly what it is: a flawed but generally satisfying and, more importantly, smart take on Capcom's approach to horror.   And yet, aside from the very last area, I found Resident Evil 0's locales interesting enough to alleviate any frustration from backtracking. These are tightly-designed settings, paced perfectly to emphasize tension. I was rarely sent running in a direction I'd already been in without the area suddenly being invaded by a new nightmare creature, or without finding myself unexpectedly stalked by a returning foe. Even as the game advanced and I built up a healthy backpack of ammunition for my guns, I always felt just one or two bad rooms away from losing everything.  For as much as Resident Evil 0 embraces the series' classic gameplay, it also adopts the goofy, heavy-handed and poorly voice-acted storytelling of the franchise's earliest entries. If you're expecting serious drama from Rebecca and Billy, you're in for a disappointment, and don't even get me started on the game's hilariously ineffective villain. But if you love the cornier approach to survival horror, before everything took itself so seriously, it's a blast.  Removed from the moment in time when it debuted, Resident Evil 0 is just a really good classic RE game. It didn't set the standards for this style of game the way Resident Evil 1 did; it's not as ambitious or unblemished as Resident Evil 2. But it's far from the mess that history made it out to be. Whether you're a veteran who's played it before or a new fan who never tried out Resident Evil 0, it's good enough to deserve this second chance.",
            "review_score": "1"
        },
        {
            "review_text": "Good old RE formula !  If you like your RE experience with fixed cameras and tank controls (improved from the original games still), you will have no problem with this one !  Can't wait for the RE2 remake !",
            "review_score": "1"
        },
        {
            "review_text": "I had originally played this game on GameCube but I didn't entirely finish it. My memories of it were that the item management was a bit tedious. So, going into this many years later with almost no other memories of it I must say I'm far more impressed than I expected to be. After playing it over 4 times, and completing leech mode twice, this game has become one of my top 3 Resident Evil games.   Why do I love this game? Well, I started off by playing it on hard (can't recommend enough for RE vets), and this game on hard was easily the most challenging Resident Evil experience I have delt with, but in my opinion the perfect kind of fun challenge that is extremely rewarding. This game has it all, plenty of classic Resident Evil puzzles that are even more complex due to the 2 characters, extremely limited ammo which requires you to plan you play through, and incrediably great settings.   If you're looking for classic RE with a challenge this game is for you. If you don't like item management you may not like this game, however for an old school RE fan I think that it actually is one of its biggest strengths since it actually adds a ton of depth to the game. Extremely underrated game.   9.7/10.",
            "review_score": "1"
        },
        {
            "review_text": "The story is quite decent and the gameplay is fun as it was in Resident Evil 1.  Pros: +Classic Resident Evil gameplay as RE 1, 2, 3 and later Code Veronica. +Very nice pre-rendered backgrounds and graphics. +Rebecca as protagonist, and her cute outfits (well you need to pay for most of them... So it may be a con). +Mini games (Leech Hunter and Wesker mode).  Cons: -The areas are not awesome as Resident 1 areas. -Not many interesting puzzles as Resident Evil 1 puzzles. -No chests to store your items (you have to drop stuff and return to the exact same location if you need it later.. Yes, it's BORING). -The partner system looks cool, but in fact you partner is very dumb and will mostly die in hard areas if you dont control him to get away). And due the small areas of the game and the camera angle (pre-rendered backgrounds), moving your partner away from enemies won't help you most of the time. It does look nice in paper, but doesn't works so well due how the game was made. So most times you will rather play alone.",
            "review_score": "1"
        },
        {
            "review_text": "runs great ... well done Capcom",
            "review_score": "1"
        },
        {
            "review_text": "Great game for start a great saga (the old saga). 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Yeah whatever, it's Resident Evil.... blah blah blah.... now with a Michael Jackson style face lift... and we all know how those turned out. :)  So if you're feeling nostalgic and want to run through this train wreck (pun intended) of a game again... Then here it is in full HD glory... Yes indeed... except shadow quality is defaulted at low, it's in windowed mode and running at 720p....   Right after you tweak the settings you'll be running the game as intended... I guess they just figured a lot of people with i3 laptops would be running this p.o.s. so they didn't want their systems to crash.  I'm recommending this game because as shallow and redundant of an addition to the original franchise as it was, it's still a classic Resident Evil style game.... Is it better than say Resident Evil Code Veronica? Mmmmmm, maybe on par... it definitely doesn't hold a candle to REmake or RE2.... maybe 3 even... that might be a stretch though.  So basically the original gamecube version of the game is still intact. You can't skip the useless door animations unless you're running a mod or script. Why they still chose to leave the crappy door animations with no option in game to turn them off is beyond me... I mean at this point they're just a special effect meant to draw you in to the world and create atmosphere... but highly unnecessary from a technical stand point.   Changes from the original GC version",
            "review_score": "1"
        },
        {
            "review_text": "The best in the series IMO I love this game forever and always it will hold a special place in my heart!",
            "review_score": "1"
        },
        {
            "review_text": "I give it 100/10 and recomend it    Capcom please if you get the time make it again with mulitplayer one person plays as billy or rebecca and you have solo story mode for playing alone it would be awsome",
            "review_score": "1"
        },
        {
            "review_text": "please buy this",
            "review_score": "1"
        },
        {
            "review_text": "Real Good, but I just have to spend some time getting used to the new mode in 0.",
            "review_score": "1"
        },
        {
            "review_text": "Really beautiful remaster, great perfomance/optimization, nothing too original here, exept maybe the train part, but if you enjoyed the earlier installments you will love this one, its dark, creepy, fun, even includes really annoying ennemies and inventory system !",
            "review_score": "1"
        },
        {
            "review_text": "RE 0 has a visually appealing graphics especially considering the game's age, and it does a good job of complementing the game play. RE 0 is alot more action oriented then RE 1 since there is two characters at the same time in most situations. My only real gripe with this game is that there are way too many scenes of the game where stuff is transitioning, and there is some pretty cheap enemy placement. Overall it is an excellent purchase, both on sale or full price",
            "review_score": "1"
        },
        {
            "review_text": "&nbsp; Inventory Management and Backtracking: The Game. Resident Evil: Zero is a prequel to the popular survival horror series as the name suggests, and the game mechanics are more archaic and frustrating than the older entries' already infuriating systems. Whether that's an intentional, meta decision or just experimentation gone awry, I couldn't say for sure. The end result is a bad game either way. &nbsp; &nbsp; RE0 starts out strong. As S.T.A.R.S medic Rebecca Chambers, you're separated from your squad (as tends to happen) and find yourself searching a train for an escaped convict, Billy Coen. The train is a great introductory stage; essentially a long hallway with impressive environmental details and an ever-moving backdrop. You quickly find your liberated prisoner, and he's a real corny ♥♥♥♥♥♥. Billy's tribal tattoos, spiky hair, and cringy one liners are more than enough to get Rebecca's girl juices flowing, so the two partner up and you're introduced to the concept of playing in tandem with an AI partner. You can set the computer controlled character to follow you, stay put, attack enemies or be passive, and you can exchange items as long as they are on the same screen. The idea is novel and leads to the type of puzzles you would expect, and they each have minor differences and special equipment (Billy can push heavier objects, Rebecca can mix herbs, etc.). Judging by this first stage, things look great in the confined train as you pass objects through dumb waiters and separate to trigger time sensitive switches. As the scope of the game expands, everything quickly falls apart. &nbsp; &nbsp; Rebecca and Billy both have painfully small inventory slots, so neither of them can be the badly needed pack mule. Struggling with limited space is a staple of the genre, but Resident Evil: Zero pushes it to insufferable levels. The game goes crazy with multiple key items that need to be hauled, combined, and stored and those all eat up precious slots. Anything larger than a handgun (and some key items) take up multiple of your eight squares, plus the ammo needed... add a healing item and you are constantly fiddling and juggling and dropping and swapping and it's obnoxious. Previous games in the series gave you access to a storage box in save rooms that would magically transport items to other save rooms; video game-y? Sure, but it worked to alleviate the finicky nature of what you're doing to a degree. In the aptly named Resident Evil: Zero you just throw crap on the ground. &nbsp; &nbsp; The dropped objects are physically represented in the room, though you have to take the games' word for it sometimes when your ink ribbon is obscured by foreground objects and you walk in circles jamming 'A' trying to find it while the character remarks over and over about the vintage of the furniture. Even when you can see the items good luck picking up what you want when multiple items are next to each other. Another issue with the floor garbage is it multiplies the need to backtrack exponentially as your weapons, health, and ammo end up scattered all over the entire game as you drop them for key items and are subsequently blocked off, shuffled forward, or split up. It's an inelegant solution to a problem that had already been solved, and the game suffers for it. &nbsp; &nbsp; After the train the stages devolve from the familiar (another mansion...) to the boring (a sewage treatment plant?), and the story and characters go from cheesy to familiar to bad as well. It all culminates in a boss battle that frequently interjects little cutscenes to throw off your flow; a climax of the bad game design. Then Billy spouts a '90s action movie one-liner and your eyes and the credits roll. Resident Evil: Zero feels like a by-the-numbers Resident Evil game that doubles down on all the worst parts of the genre. It's a real... zero.",
            "review_score": "-1"
        },
        {
            "review_text": "Resident Evil Zero HD Remaster is definitely a huge success and a good game. I never played the real game because I was too young so this was the perfect opportunity so play it. Well, I never finished the game because I suck but that's not important.  RE0 is set before RE1 and shows you what happened before S.T.A.R.S. Alpha team arrives at the mansion. The game looks pretty good, offeres a lot of horror and you always have to make good decisions on how you manage your inventory. If you're looking for a horror game you can pick this one.  8,5/10",
            "review_score": "1"
        },
        {
            "review_text": "This is throws you back to the stone age of no autosaves, Felt like a savage using those type writers. Worth every penny if you didn't have game cube and always wanted one but mom says you already have too much toys and a playstation/playstation 2 and you try to convince her that it is different and she says its all the same to her, you argue about specifications and graphics, and she's still not convinced.  love this game",
            "review_score": "1"
        },
        {
            "review_text": "A great remaster. Worth checking out even if you played the GameCube version. Not my favorite resident evil but still a fun and creepy game.",
            "review_score": "1"
        },
        {
            "review_text": "Good while on the train.  So about 20 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "even with mods, this game will never be as good as the resident evil 1 remake/remaster. I was never a fan of this title, but I thought after 15 years, I'd give it another chance...still dislike it. I don't like the idea of having to change characters. I only want one for the entire playthrough. It just makes the game more boring than it needs to be.  The most annoying thing about this title is that the controlls are for running and item menu are not the same as RE1 remaster...like wtf? just so stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it. First of all: Resident Evil HD Remaster was the first time I played the first Resident Evil game, and I was never a huge fan of the new ones, but I liked RE4, RE5 and Revelations 2. Resident Evil HD Remaster is a masterpiece if you ask me, so why don't I recommend RE Zero? Because they made TONS of MORONIC decisions. First the puzzles. In RE1 the puzzles were unrealistic, but they made sense, you understood them and they fit the setting. In RE Zero the puzzles feel completely random, don't make any sense. It's like every time one of the developer said 'we need a puzzle here' someone else took out his puzzlebook and just chose a random puzzle out of that. Then whos ♥♥♥♥ing idea was to have 2 playable characters? Not only are both characters extremely boring, bland, and ♥♥♥♥ing cliche times 100, it also makes the gameplay extremely annoying. Inventory can be annoying in RE1, but it was fine. In RE Zero you have to manage two inventories now with the extremely clonky menus and long animations inbetween every action you do. And in gun fights your AI partner is a complete moron, which means you have to sometimes control both characters at the same time which can become really frustrating. Also if you don't pay attention for a second, your AI partner could waste your precious ammo for totally unneccessary reason. One of the great things about RE1 was that combat wasn't a big challenge, it was always a decision if you want to do combat or try to dodge enemies, both approaches had benefits. In RE Zero you can't do that because of your AI partner, you have to kill almost every enemy you see. As you can see from my playtime, I didn't play for too long though, so maybe later in the game the level design gets better. Another huge problem is that there are no item crates anymore, so you have to drop items on the floor and backtrack to pick them up again. Especially painful with the ink ribbons, which you have to always drop at the save point, next time drop another item to have space, pick the ink ribbon up, save, drop the ink ribbon, pick up the other dropped item. This was also a bit of a problem in RE1, but this whole process was much faster with item crates and because of that it wasn't so ♥♥♥♥ing annoying. Every time you pick up an item there is a small animation and the game asks you if you want to pick it up first. Opening inventory and closing it always has a small delays, lots of small things like that make it extremely annoying.  RE1 is a 9.5/10 for me, I ♥♥♥♥ing love it. But this game is just annoying and a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, terrible port.   The game only renders Rooms and Characters at 1920x1440 resolution. So you need really good gpu to run it without slow mo. (My pc can handle 'Witcher 3' but here it chokes)   Now only hope is to wait for mod from people who fixed that issue in RE1HD. In re1hd its called REHDHook.  As I said game is great: scary, dark, challenging, creepy, awesome.  But port.... Dark Souls port was masterpiece compared to this. And sadly, adding just one thing in game options (changing rendering resolution) could make it good port.  But I'm gonna still play it, because even with slow mo, its still one of best horror games made.",
            "review_score": "-1"
        },
        {
            "review_text": "Hardly a remake...still have limited game saves and very limited non-upgradable inventory slots. Frames per second and graphics also need more work.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the more terrible Resident Evils I have yet to play. I remember not much caring for it when I had it on gamecube... but now I really remember the cancer that is Resident Evil 0.  What it's got:  ♥♥♥♥ controls ♥♥♥♥ inventory management ♥♥♥♥ AI ♥♥♥♥ Partner mechanics No co-op to replace the abhorrent partner ai (♥♥♥♥ off sp fanbois) ♥♥♥♥ boss fights Cramped quarters Illogical story Vomit inducing dialogue Quest items that take up more than one inventory slot And the cherry on top: Wesker is for some reason in the story now!  Honestly though. It's a good port and a good remaster.... it's just a ♥♥♥♥♥♥ game to choose fora remaster.  I only hope Capcom can redeem themselves by releasing RE Outbreak 1&amp;2 Remastered within the next decade or so. I'd take like 30 mini stories over one mid-length ♥♥♥♥♥♥ story.  I know I sounded really hostile in my review, but bear with me, I just lost 20$ to this ♥♥♥♥♥♥♥♥. At least I've almost got the full collection now...    P.S. No one likes a fanboy, so don't get your panties in a knot just because I dislike your favorite game. ",
            "review_score": "-1"
        },
        {
            "review_text": "it's weird this game runing 30 fps, already set to 60 fps",
            "review_score": "-1"
        },
        {
            "review_text": "More of the original RE formula: Tank controls, prerendered backgrounds, Umbrella doing evil stuff, and 2 character puzzles. As a RE fan, I'm glad there's some RE to play; but there's nothing outstanding here. It does look great in HD and 60fps. The background remains at 30 fps though.  The two party system makes for some new puzzle solutions but introduces a bigger problem. The item boxes have been removed while enabling to leave items in the environment. Once a room is 'Full' it gets very frustrating to manage your items. Having the item boxes would've been nice. The companion AI is good for trash zombies; but with specials/bosses it's terrible.  RE0 dropped the ball by not including some gameplay in the RE1 mansion. Experiencing the Mansion as Bravo team would've been great. I never finished this on GC, and always hoped that there was some gameplay in the Mansion. Experiencing how everyone got into trouble before Alpha arrived would've been fresh. But we get Billy 'Cool Guy Leon' Coen and the lamest antagonist ever. Why does he need to wear a white robe? All these events take place in some copy paste mansion that doesn't come close to the old Mansion, RCPD, or RC. The game ends with no new insight to the RE lore. New to RE? Skip and go play RE1 HD. Veteran? Play for some filler action till RE2 HD.",
            "review_score": "1"
        },
        {
            "review_text": "While not quite as polished up as the prior Biohazard HD remaster, primarily in relation to the original GCN versions, 0 has proven to be damn good survival horror so far. Aside from the game tending to stiff me on inventory for consumables (such as when 3 bottles and 3 gas combine to make only 2 molotovs when my current stack has 2 spaces left), it's been a real blast.  However...  Capcom, I'm not the kind of person who preorders games, but I did it here because I love me some Biohazard and I, out of some twisted completionist urge, wanted the stupid costume DLC... But when launch day comes and I see you added more costume DLC packs on top of the preorder bonus I got... Including... oh, I dunno, ALL OF REBECCA'S CLASSIC F#$%ING COSTUMES, I tend to feel even more stiffed than your spare bottle gambit. I know the skins don't add much, but I imagine most of the old school Resident Evil fans that buy this on Steam would be pretty apalled at seeing something like that... Especially when the last remaster's alternate costumes were all unlocked in game.  I caved and bought the damn dlc, because I'm an idiot consumer and that's what I do... at least Rebecca looks fleeked out in her new beret.",
            "review_score": "1"
        },
        {
            "review_text": "Childhood favorite they did outstanding work puting this HQ make sure to pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually like this kinda game, but somehow all this backtracking, item management and cheap enemies makes me want to play more rather than quit",
            "review_score": "1"
        },
        {
            "review_text": "Was good to run through it again, since I haven't played it since it's orginal release on the Cube.  My orginal thoughts was at the time that RE0 was the worst RE they had made, was not a fan of the tag team gameplay and the story wasn't that strong. But after RE5 and 6 action games, running back through zero 14 years later was quite refreshing because I didn't remember any of it aside from the train intro, so it felt almost like a new RE but in the old school static camera gameplay which I still prefer over the new 3rd person camera.  Wesker mode is just for fun, because Wesker is OP and can kill any normal enemy in one red charge and most bosses are dead in 2-3 (with the exception of the last 2 bossess)  The only thing is I'm still not a fan of the tag team gameplay and also the item management in it. You only get 6 slots between the 2 charcters (total 12) and 2 slots can be taken by an item such as the hook or a shotgun/granade launcher so I found myself backtracking quite a lot to get amo/healing or weapons.   A storage chest option would have been nice, though doing it this way makes it a lot more strategic and you have to think about what you're doing.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "10/10 had best laughs when i looked at the negative reviews",
            "review_score": "1"
        },
        {
            "review_text": "A great port of a crucial game in the beloved Biohazard/Resident Evil franchise. Runs exceptionally well, has 4K support and offers a bunch of graphical options. The game's textures were actually remastered and look brilliant, making this decade old title feel new again.  Gameplay is identical to the older Resident Evil games, with a slight twist. Controlling two characters at once changes the formula just enough to make Zero stand out from the other games from this era of RE titles.  Old school gameplay? Check. Fancy new graphics? Check. Good PC port? Check.  Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "SHUT UP AND TAKE MY MONEY",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Really stands the test of time. Puzzles are fun to solve and give a real sense of accomplishment, the zombies and monsters make for a good scare, and the fixed camera angles are a real treat from the past. Highly recommend.",
            "review_score": "1"
        }
    ]
}