{
    "app_id": 339470,
    "name": "Retention",
    "release_date": "2015-01-13",
    "developer": [
        "Sometimes You"
    ],
    "publisher": [
        "Sometimes You"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 218,
    "negative_ratings": 438,
    "price": 0.79,
    "description": "This game is about a person who kept running through his life, never looking back at the past. He rarely slept, and even with 24 hours in a day, it was not enough for him. Once during a trip, he gets into trouble. Now he's lying on the cold ground, buried beneath his bicycle. Slides of various moments fly through his head.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339470/header.jpg?t=1544792569",
    "minimum_requirements": "OS: Windows XP DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is one of those rare instances where I wish I had done as the negative reviews had suggested and not bought the game.  Sadly I thought that, because Retention was so cheap, it would be worth the risk of buying it. That did not turn out to be true. Now normally I enjoy games that go out of their way to be different and try something new. While it is safe to say Retention is something different that does not make it good in any way. A big problem with Retention is that it promises a story that never happens. The game description says you're given the 'opportunity to tell a man by his memories', but I found that this just amounts to you picking one picture out of a group of three and then being given a small one sentence summary of the picture (as if you already couldn't tell just by looking at most of them). The ending you recieve after picking one picture out of all 85 groups of 3 doesn't help clarify the story in any way. I've played through it multiple times now and I still can't decipher how or why I unlocked certain endings (and you can unlock multiple ones at once) and not others.  Confusion is honestly another reason why Retention is not a good game. Again this is a game which in the description promises a 'user-friendly interface'. I did not find that to be the case. Right from the start the only helpful information given to you is how to move between slides and that you have to pick one picture out of a group of three. The problem is that the game starts you at the very moment when the man presumably got into his biking accident. You must then go back through all 85 of his memories (the pictures you'll get tired of looking at because they never change). There are many problems with this. First is the fact that it's very hard to tell what picture group you're on. It took me way too long to figure out that the only thing indicating what group you're on is a thin strip of white that appears below the square of film you're on. Second is that if you somehow miss a picture group you're kind of screwed. The only thing that separates picture groups you've selected a picture from, from ones you haven't is a tiny (very easy to miss) + sign. Those two things coupled with being forced to flip through all the pictures you've already selected and seen to see if you've done enough to achieve an ending and in the end being denied one because you missed one group (out of 85) is downright frustrating.   In the end the only good thing I can say about Retention is that it has some pretty pictures and okay music. There is also the fact it has cards, but even those can't make up for the fact that Retention is bad game.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow!Just wow. After reading some negative comments,I purchased the game,thinking that all the negativity is too harsh for such an interesting idea.I really wanted to like the game and put a positive vote. After playing the game and finishing it in less than 10 minutes with random clicking on meaningless photos,which had no connection,I feel that I have lost some part of my mind.  It would be interesting if it was some kind of psychological test,but the real test here is to see if you have the mentality and strength to finish the game.I haven't,so after a while I started clicking on photos without thinking and i got the lost your memory result,although it felt like lost your mind result.  The only reasons to purchase is the low price,the trading cards and to give support to new,different ideas.",
            "review_score": "-1"
        },
        {
            "review_text": "This is just a photo album. Just because you get to pick one out of three pictures for every slide with music playing in the background does not make it a video game.   Save yourself the cash and go through your own photos.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is in the simplest form a picture book that allows you to choose your own adventure. Except at best the adventure is skewed and obfuscated. In reality though, there is no coherent plot. No hooks to go off of and simply nothing to really tell you anything about it. This is a point and click adventure game without the adventure and the point and click is very limited. It's 99 cents but yet I wouldn't recommend that for it. There is little interaction, no plot, no gameplay, little feedback and it delivers a message at the end that is suppose to invoke emotion to encourage you to go look through your past and remember some nostalgia about the good ol days. The message though falls flat and is easily missed if you don't click the 'credits' button. The entire experience is over in 12 minutes if you take your time and read everything. Probably around 2 minutes if you just rush it.",
            "review_score": "-1"
        },
        {
            "review_text": "My friend saw that I played this  game  I had a friend",
            "review_score": "-1"
        },
        {
            "review_text": "This is just a pointless slidewhow with no story or gameplay whatsoever. It tells you that you are for some reason stuck under a bycicle...seriously? And then you pick from a bunch of random pictures with no connection...the end? F#$%ing seriously?",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "Well, Retention isn't your regular game. You can call it more like an experience instead of a game. You are to choose one of three pictures for a sets of 85 pictures, each picture with it's own short description. The pictures are ranging from pictures with landscape to peoples, I found the pictures to be inresting. Based on your choice you get a different ending. Not sure if each ending has a different set of pics or the four pics that I found are for the different endings, sadly won't 'play it' again.   The soundtracks, at least from my point of view, it's awful. In my playthrought there were 3-4 different songs but all of them somehow didn't fit with you scrolling through the pictures.  If you are interested in this fact the game have cards, but lacks achievements.",
            "review_score": "-1"
        },
        {
            "review_text": "Not much of a game. You have 10.5 minutes to click on one image in each of about 80 sets of three images each. Once you've done that, it tells you what types of images you clicked on. That's it, nothing more.",
            "review_score": "-1"
        },
        {
            "review_text": "I consider myself something of a hipster gamer. Okay, not something of. A complete and total hipster gamer. I love indie games and I love games that push the borders of what can be considered a game and I love weird narrative spins and just... everything about the sort of games that make your average gamer go 'UGGGHHH NOT A GAME 0/10 BOOOOO' is the sorta thing I cherish. I mean, my top games of the past year or two include Mountain, Gone Home, and Hate Plus.  But even I can't stand Retention, the latest game to bring down the wrath of NOT A GAME gamers. First off, it's totally a game. The inputs are weird and disconnected because really you're looking through pictures and choosing them and its supposed to string together a story. It's no less of a game than any choice game; the system of inputs is just unique.  The problem is that the player is given absolutely no sense of coherent connections between the images. It's implied that they're a timeline of events, but there's no thread that holds them together except the occasional repeated model or vague theme. In terms of 'narrative,' nothing matches up.  So, if there's no narrative, maybe the game is better read as modern poetry. Maybe the game needs to be read as discordant elements brought together in a way where the meaning needs to be pieced together. Okay, cool idea. I still think it could be better executed because, again, there are few repeated motifs throughout the piece and poems work almost entirely based off invoking a series of signs and signifiers that links the reader back to previous works and images in a canon of both literature and language. The game struggles to do this. And that's okay, in certain ways, but it makes it incredibly hard to analyze and piece things together.  Retention is an interesting experiment, that's for certain. I think it deserves to exist and should exist and needs to exist. It's possibly an important step in disturbing and deconstructing our ideas of what makes games art by pushing a concept of game poetry forwards in a new way. Sadly, I just don't think this poem is any good.",
            "review_score": "-1"
        },
        {
            "review_text": "Hmmm... I'm really not into trashing games, I always do my best to find something positive about them. But I simply fail to do so with Retention. The mere publishing of Retention on Steam puzzles me. Honestly, Zimbio's quizzes (you know those 'Which Spiderman villain are you?' or 'How would you die on Game of Thrones?') have more elements of a game than this... game. It's just a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Great for some free tradecards. Let it run and watch some video´s. Other than that it is useless.  You only get choose a few pics you have to put in to a timeline. Why? No clue. what happens after you're done? You get to scroll to the timeline for a endless amount of time! Untill you reset the game and you put other pics in the timeline.  It ain't even cool pics either..  2/10 (2 for the cards)",
            "review_score": "-1"
        },
        {
            "review_text": "  By Gods, what the hell is this?! How the Hell did it get through the Steam Greenlight?!",
            "review_score": "-1"
        },
        {
            "review_text": "I bought it for the trading cards. All for the trading cards.",
            "review_score": "-1"
        },
        {
            "review_text": "strange music and weird photos,made me feel like i'm reading a teenage girl's facebook page",
            "review_score": "-1"
        },
        {
            "review_text": "i looking for beautifull old memory :) someone in there.  very simple but pretty game.",
            "review_score": "1"
        },
        {
            "review_text": "  Well, I think they were going for an artistic kind of game, but this is not how you make an artistic game.  This is how you put your photography portfolio into a standalone program and call it a game.  And then, it's not even easy to navigate the photos, the UI is rather poor, sluggish, and difficult to use; which is pretty inexcusable in something as simple as this.  My favorite part is how the captions slowly have worse and worse English in them, as though the translator got more and more bored as they went on and slowly lost the will to make good translations.  So, yeah, don't get this, unless you got it for free, in which case there's trading cards so go ahead and run it until you get those!",
            "review_score": "-1"
        },
        {
            "review_text": "Overall strange experience. But not in a bad way. Would recommend if it has something more, than just a claim to be art.  P.S. Photos are nice though.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is different, but i would really call it a novel then anything.",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' is just a bunch of PNG files. The gameplay makes no sense and isn't explained at all.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS NOT A GAME  This is an 80-page collection of random pictures that you can click on for some reason  -- THE END",
            "review_score": "-1"
        },
        {
            "review_text": "An experimental 'game' for  mature  people. While the idea is great, it fails in building a connection to the player, and the countdown of left heartbeats leads to a click-rush in the later game, which destroys any emotion. Gladly, you're allowed to disable the timer, and I recommend doing so on the first walkthrough, even if it takes more game out of the play.  So it might be not as good as it could be, and it's definitely not everyone's cup of tea... But you should buy it anyway, if you too think, that we strongly need more fresh ideas and have to support those who have them.   And for less than a cup of coffey you'll get - a groovy digital 4 Track EP by Keratordash - some really good photographies - three trading cards (from a set of five) - and lots of cats! ;)  ",
            "review_score": "1"
        },
        {
            "review_text": "Twitter simulator",
            "review_score": "1"
        }
    ]
}