{
    "app_id": 33950,
    "name": "Fish Fillets 2",
    "release_date": "2010-11-05",
    "developer": [
        "Altar Games"
    ],
    "publisher": [
        "Bohemia Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 151,
    "negative_ratings": 56,
    "price": 3.99,
    "description": "In this underwater puzzle game you control fish secret agents Max Flounder and Tina Guppy. Seemingly a common case turns into a tough fight with a mysterious enemy and the strings appear to lead pretty high. Fortunately, you are not alone.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33950/header.jpg?t=1521643545",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium® IV - 2GHz Memory: 512 MB RAM Graphics: nVidia® GeForce™4 - 256 MB DirectX®: DirectX®: 9.0c Hard Drive: 650 MB free space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "+ lots of challenging puzzles + visually appealing 2D graphics style + funny comments of the 2 main protagonists and their voice-acting; overall nice and mild humour + not a bad soundtrack (not exceptionally great either though) + native widescreen support - puzzles may be a bit too challenging, which can easily lead up to frustration  This is like a singleplayer-only, indie underwater Portal 2 coop in 2D, minus the portals and with a different type of humour. And harder. Much harder.",
            "review_score": "1"
        },
        {
            "review_text": "A difficult but fair puzzle game with full mid-level save and undo support. If you like block-pushing puzzles at all, this is highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated games I know. Warning: This game may cause your brain to overheat. Use only with proper cooling system installed. Seriously, this game is not for simpletons. This game is essentially a Sokoban that drank a powerthirst™! Did you think sokoban was hard? then how about sokoban with several players? with variable size? and gravity? and more rules?",
            "review_score": "1"
        },
        {
            "review_text": "The Big Blue fish is the only one who can push steel beams. The puzzles would be much easier if he could simply melt them. However it may be hard to melt the beams underwater, also the fish may have trouble finding jet fuel.  Positives: -A great source of humor.  -The levels are a real challenge for any puzzle loving, steal beam theorists.  -The starting music reminds me alot of 'illuminaty' music, which along with the difficulty of the puzzles leads me to believe this game was created by the NSA with only super computors being able to complete the puzzles.  Negatives: -The game starts in windowed mode which is more of an inconvenience than a bad thing as it can be changed in the options menu.   -The fishes faces are not quite right and I now suffer from night mares.  Overall this game is an splendid 2D puzzle game that challenges both the puzzle lover and conspirators alike. The game is very good value for money becuase if compleated with no youtube help it will have years of replay value.   9/10 for puzzle difficulty would have fish related night mares again.",
            "review_score": "1"
        },
        {
            "review_text": "I don't see why this game gets hate, looks fine to me.",
            "review_score": "1"
        },
        {
            "review_text": "Got it in the humble bundle, cute funny game thats worth the play so far.",
            "review_score": "1"
        },
        {
            "review_text": "How high were the creators of this game? Honestly...",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the greatest game ever made? The depth of the puzzles and characters I have yet to come accross a game that is as deep as this one. The story of this game is so deep I don't really know where to start so I'll let you play it yourself so you can be amazed by this masterpiece. If you have not yet purchased this yet please do yourself a favor and treat yourself to this masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "The best logical game which has many hard levels.",
            "review_score": "1"
        },
        {
            "review_text": "good game for 1-3 years kids !",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very bad game, its damn near impossible to get all of the stars, the logic behind the game is really dumb, and the voice over is simple at best. Although I will state that the game is original.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a game for kids im sure. and i mean like 5 year olds. i downloaded it coz i thought itd be funny to do but it wasnt even that.",
            "review_score": "-1"
        }
    ]
}