{
    "app_id": 339610,
    "name": "Freestyle 2: Street Basketball",
    "release_date": "2015-04-01",
    "developer": [
        "Joycity"
    ],
    "publisher": [
        "Joycity"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Online Multi-Player",
        "MMO",
        "Online Co-op",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Free to Play",
        "Massively Multiplayer",
        "Sports"
    ],
    "tags": [
        "Free to Play",
        "Basketball",
        "Sports"
    ],
    "achievements": 0,
    "positive_ratings": 5781,
    "negative_ratings": 2192,
    "price": 0.0,
    "description": "Freestyle 2: Street Basketball is a fast paced online arcade basketball game. Create your own unique player and compete in the online street league! Use variety of b-ball moves and customize your player! Team up with the best street ballers online and rise to the top!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339610/header.jpg?t=1515195348",
    "minimum_requirements": "OS: Window XP Processor: Pentium 4 2.8 GHz Memory: 1 GB RAM Graphics: GeForce 7600 GT 512MB DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": "OS: Window 7 Processor: Pentium 4 3.4 GHz Memory: 2 GB RAM Graphics: GeForce 9800 GT 1GB DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX Compatible",
    "reviews": [
        {
            "review_text": "I started playing this because its free and I actually enjoyed it. I had like 100+ hours on it creating new accounts to earn 150k points. Bought 500 Gkash for the event.  I was able to feel satisfied with how my character looks and plays. But as soon as I reach level 24. No one would play with you. If there is, they will call you NOOB throughout the whole game. Then use a microphone and harass you throughout.   Community sucks! People are jerks~! There are some who would play with you but for the most part everyone is a jerk.   Downfall of this game is how jerks high level people or seasoned people are and it really sets me back.  Goodluck to this game. Its fun till 24 and if you like getting called noob and doesnt bother getting owned by seasoned players or getting kicked from room to room spending 15 minutes just to play 1 game then get called a noob then kicked then this game is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "MY ANTIVIRUS LEGIT PICKED UP A BITCOIN MINER WHEN I UPDATED THIS GAME. THIS NEEDS TO BE OFF THE STEAM STORE. WHAT KIND OF ♥♥♥♥ IS THIS?  EVERYONE REPORT THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "Real basketball fans and players wouldn't be impressed with this game's mechanics or animations because this game doesn't go for a realistic basketball simulation. Instead this game focuses on team play and player customisation and most of customisable things are aquired by playing the game, not by spending real money. Post game rewards and leveling up keeps you playing and grinding through the game. Just remember that if you want the best experience , team up with 2 of your buddies and it will be a lot more fun and enjoyable to play :)   Overall: If your looking for a realistic basketball simulation - don't bother, It's not NBA 2K, but if your looking for a fun, grindy,arcady team game - try it out.",
            "review_score": "1"
        },
        {
            "review_text": "I have just got a pop up saying that there was a bitcoin miner in the folder for this do not download!",
            "review_score": "-1"
        },
        {
            "review_text": "The game it self is really fun, simple and enjoyable. however the community at large is by far the worst I've ever come across. People are unfriendly and wildly arrogant. Also the game is so packed with russians refusing to speak English I feel like sovjets on the rise again.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, cool game and when u look at it u think oh it is a ♥♥♥♥ game but infact it is so enjoyable I love it to bits and the crew system they have in the game is amazing I do recommend this game to kids above 10+ years of age.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly didn't care the fact that is was pay2play. It's one of the best FREE basketball games there is... Do you really wanna drop 60.00 for 2k? I mean I guess if you dropped money to win in this game.  BUT for those who did not. Like, I had so much fun playing this game.  None of my friends wanted to play, but ♥♥♥♥ it. This games fun af.  It was all fun and games, up until you guys made it personal.  How dare you mine my computer? You guys are savages. Theres no remorse, just in it for the profit. In every aspect.  I will never play this game again, how yal betrayed my love for online basketball games.  Just Buy ♥♥♥♥ing 2k. 2k17 is coming out. Also need a controller. But its worth it. At least 2k tells us theyre gonna hustle us.",
            "review_score": "-1"
        },
        {
            "review_text": "IGN: Valioa ( Level 50 PG Clara Balanced Type, Known for magical diving catches)  ( ' w ' ) / Ladies and Gentleman. \\ ( ' w ' )   This is a game in which you start out as a trainee, learning the ropes of the game, most likely losing a lot (well, it depends if you are playing with total strangers), and as you 'go on', you just get better and better, eventually winning.  Like I said above, don't expect to be good at the start, and PLAY with friends! This game is heavily team-based, featuring 3v3 basketball matches that can get hectic pretty fast in the long run, especially in the pro channels.  When I started out in the game, I didn't like how bad I was, and how bad my teammates were sometimes. But its ok. I came out on top, became one of the best at my position (Point Guard), and I believe I am well known in the FS2 community xD.   ITS ALL ABOUT PERSERVERANCE...!  NEVER GIVE UP! Create the best freestyle 2 team out there with your friends young padawan. Heck, maybe even join a crew (The 'Bruh' Crew, lead by Left-Eye is a really good start, a crew that allows anyone willing to learn the game a chance at getting better overall)  AND REMEMBER.... In Pie We Trust.™ ( ' w ' ) //",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun until you play with hackers. Really fun to get out some Basketball in your system. With the hackers its ever y 2-3 games you have to deal with one to an extent where they can teleport the ball from your current possion to the middle of the FT line. And every other team name has Racial slurs in it or some sexual enundos. I'm not fantastic at this game but when I'm not playing with a hacker its great even though it is semi Pay to win but it also milks the aspect of skill.  I'm gonna say I don't recommend this game for now since they fail to deal with the Hacking basically says its ok to hack away to win. Better off playing NBA2k14 or 2k15. As a gamer its hard for me to talk bad about any games and it pains me to see a game thats fun to be overran by hackers.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your time on getting this game.This game is pay to win game.Everytime developers try to fix a bug 2 new ones appear.Bugs are expected but how do you have bug that crashes the sever everytime.If you want to waste your money don't waste here it's not worth it.Lvl 60's of this game are pay to win players that give their money to this game, they make this game hell when trying to lvl up.The only time your going to win is when you are 1-30 lvl.This game is waste of time because once you reach the lvl 50 milestone you never see the light and day until you open your pockets for the game.Why should waste your time on this game that breaks because of giltches and pay to win players.Don't get me started with the chat in this game, the people in this game will tell you how bad you are every single day of life until you make the right decision and unistall this game.If you want to go through hell play this game you'll experince it.",
            "review_score": "-1"
        },
        {
            "review_text": "I played many hours of Freestyle back in 2007. This iteration is plagued by slow loading times, a bad user interface, and way too many equippables that distract from the actual game. This game has taken microtransactions to a level I didn't know was possible, and it's all in your face constantly. This feels more like a Korean trinket shop than a video game",
            "review_score": "-1"
        },
        {
            "review_text": "Fun but takes forever to even load up to the main menu and crashes mid game or crashes from the start",
            "review_score": "-1"
        },
        {
            "review_text": "Well first 20 minutes of gameplay and i want to delete it allready..If you are a new player no one want to even play with you and beacause the players are so salty with new players.. no one is playng in rookie rooms..Just dont play this game unless you like when other people is swearing you because you are a new player and get kicked every game.. 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good game, however its a f*cking P2W. It always has been ever since it was created with Sierra, I been playing FS for a very long time. However, I will not be putting this as a negative review since I still play this game and will always play it. I just love FS. Don't my cons scare you, however take it in consideration since it's true. If you don't believe me play FS 2 for about 25 hours and then tell me what you see.  Now here is the pro and cons:  Pros: - Fun game when you have respectful players  Cons: - P2W: Pay to Win, which is very true. For example: When you buy a special character, you get a bonus stats when you create them. So if you were a PF, you would get a bonus like 5+ or something like that. - LAGGY, most of the players are from other countries playing on the US server. When you ask them why they don't play on theirs, they say something like 'Nobody is on the server, blah blah' - There are some good clothes in the game, however if you want to add attributes to them you can but they only last like 30 days or so. It wasn't like in FS, where some clothes you could pay to add attributs and it stays with you forever. - The freestyles are random and you never get to choose which ones you want like in FS. For example, if I wanted miller time for my SG, I would have to get Freestlye tickets and play the random sh*t hoping I could get it. - Most people don't know how to play at all, and also there is a lot of holders when it's the last 20 seconds. - The last thing, its a god damn PAY TO WIN.   So, if you want to win a lot, you either do two things: First, pay money to get special characters, etc. Blah blah. Two: practice a lot and learn to PASS the ball, and use teamwork. I prefer the second option since in this game, it is easy to beat the special characters. And it's called TEAMWORK!!!",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun, don't get me wrong, but there is so much P2W aspects of the game it's unreal. It's great for a F2P game, but they could make money the right way and not allow people to P 2 W! There needs to be more modes; maybe a 5v5 full court action. Make the game more realistic and add some more physics and allow me to be able to block a dunk. There is also way too much to the game yet way too little, and what I mean by that, is there are stat cards and free styles and 'magic' clothes that would give you the edge in a match. Just have normal basketball, that's all you need. Too little, basically what I said before, to where there aren't any game modes, and just there isn't much customization either, unless you wanna be a dragon helmeted nba player or a humongous black Jonas Brother. It's fun, but there's issues I'd hope and many others would hope they fix.",
            "review_score": "-1"
        },
        {
            "review_text": "Greatest DEFENSE ever! Can't even launch the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very bad, luck based and full of random bugs",
            "review_score": "-1"
        },
        {
            "review_text": "feaces",
            "review_score": "-1"
        },
        {
            "review_text": "nice the basketball games",
            "review_score": "1"
        },
        {
            "review_text": "I played the very first Freestyle Basketball and then i downloaded the asian version of Freestyle 2 back when it wasn't available for the United States, and I had played it very often when it was available. The one hour I have on steam was to see if this game was still pay to win, sadly it is. When you make a character you get to choose your position and you get to choose between a few sample characters with different heights, if you PAY the game though you can unlock other characters that have boosted stats and are much bigger than you. They will always be better than you no matter how much you play, this game is slightly skill based but it is very much like an arcade game. Rebounds can be grabbed from the other side of the goal just because a player has a higher attribute than you, regardless of your timing and positioning for it. Most shots fall in this game if you dont block them, which if you pay, you block everything. This game has the potential to be so much better, especially because it is the only basketball MMO out there, but they are stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "The Game Is Super Awesome.I Think Is The Best BasketBall Game Ever. but please cheaper the premium characters",
            "review_score": "1"
        },
        {
            "review_text": "Well.... would be great without broken and totally useless mechanics... and it's kinda odd...",
            "review_score": "-1"
        },
        {
            "review_text": "This game sorta stinks. I can't find a grasp on how the shooting gauge works. The MC is God awfully annoying, since all he says is 'nice pass!' 'oh you sneaky ♥♥♥♥♥♥♥!'. Community is filled with stuck up tight-wads with too much bullplop in their ears. Megaphones (an all out broadcast to the server) usually says something from xXx__BALLisLIFE__xXx 'heh rekt u #@$# pretty easily step up your game'. I find these rather disparaging comments annoying.  The rookie channel is, as a commenter said before, filled with pros, as people could not merge their old accounts onto Steam. Articles of clothing are merely for looks, which really shows if someone has easy access to their parents' credit card number. Rookie channel, again, has some people failing a layup or easily shooting half-court threes with no trouble. The game lags a bit, sometimes characters and the ball spazzing out, or having characters that are nowhere near the ball all of a sudden having it.  The community, as said, is a bunch of stuck up tight-wads. Some people ball hog and just keep dunking. Others can't read English, as when you need to go for 3's, they keep making layups. Like what the crud bro.  The swearing filter has a really low bar. Words like 'crap', 'crud', 'wtf', and even IDK has DK censored into i**, assuming dk is short for '♥♥♥♥'. That really throws me off about this game.  To summarize, a stuck up community, poorly optimized gameplay, really harsh swearing filter, spazzy characters and items. Also, don't forget really crappy random drops. Keep pulling blank cards. Continuing: megaphone abuse, and the somehow hated cell-shaded art. I really adore cell shading, so this game is looks nice. Then again, I haven't optimized it for my computer yet. Yet.  Overall, game gets like a 2.5 out of 5 stars. Give it a whirl. If it's not your thing, then uninstall it. That's what I'll be doing.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has lowered my standards of basketball for eternity, I am disgusted by how terrible this game is. if some asked me to compare this game i would compare this game to straight dog ♥♥♥♥, i cant even get through the tutorial because this shitaki is just trash. This has made every black person in this game look like jiggaboo jones and it is insulting to the black culture. 1/10 I wipe my cheeks with this game :)",
            "review_score": "-1"
        },
        {
            "review_text": "Goooood Job but SEA server must improve! take them to SG, we can get more better connection  and one, please, support gamepad",
            "review_score": "1"
        },
        {
            "review_text": "People may say that this game is P2W and has a 'bad community' and has its servers crashing. I can tell you that once you get into it, you don's have to pay money to win. I am a level 32 SF, and i do just fine against the special characters. They also give you chances to gain those special characters via Magic Balls, or an update. I still havent created another character, and i find the grind quiet fun actually. The community isnt bad, its just it needs more people. So please give this game a try until level 10, and if you feel greedy play 1 V 1",
            "review_score": "1"
        },
        {
            "review_text": "haha teamwork is the key to sucess",
            "review_score": "1"
        },
        {
            "review_text": "games so much fun even if i bearly have hours on it i havent played very much but this game is amazing so much fun as i said i really recomemend it   I hope u enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "Who needs to go outside when you have Freestyle2: Street Basketball. I plan on playing this game for the rest of my life never seeing the light of the day. Also its easy to install.",
            "review_score": "1"
        },
        {
            "review_text": "i played a little its good",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome but I was playing with my points worth of 43K and then i went to watch live broadcast, i saw my points went down to 4K. Please fix this bug.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome! I like to play it with my friends!!! Recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "decent game, has one of the worst community and game becomes p2w once you reach pro league.  dont waste your time.  ",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥ game, I muted the audio completely but it kept blasting my headphones with 100% AUDIO!   MY ♥♥♥♥ING EARS ARE BLEEDING WITH THIS ♥♥♥♥♥♥ MUSIC AND CONSTANT SCREAMING!  YOU OWE ME MONEY FOR PLAYING THIS.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game.. its really completly different between FS 1 , lets dunk",
            "review_score": "1"
        },
        {
            "review_text": "Trash game, ♥♥♥♥♥♥ servers, dead game.  0/10 gtfo fgts",
            "review_score": "-1"
        },
        {
            "review_text": "because of this, I'm starting to play basketball in real life :D",
            "review_score": "1"
        },
        {
            "review_text": "When I saw this, I was hoping for a competent street basketball game with some paid character customizations and some kinda gross paid stat boosts. What I found instead was a poorly translated storefront with a terrible basketball game attached.  Best I can tell, you are forced to control your character with the keyboard rather than a gamepad, which seems an odd choice for a basketball game. The rules of the game (both in terms of the rules in the rulebook and the way basketball works) are implemented very simplisticly. For example, if you want to block a shot, You'll need to be sure you're in front of the shooting player. It's literally impossible to block a short from the side or from behind.   It feels like a board game implementation of basketball, and, as much as I like board games, the beauty of video games is that the game can juggle as many rules and variables as you can throw at it. Board games have to be simplified because people have to manage all those rules themselves. For a game as dynamic as basketball, this implementation doesn't create a very satisfying experience.  The UI is ridiculous. Every screen has dozens of buttons labeled mostly with cryptic icons. As a new player, you'll be given several reward items after logging in, but you'll have no idea what they are or why you would want them. In this way, the game is extremely hostile to new players.  If there is any fun to be had in this game, it's well hidden behind a smokescreen of odd design decisions and mechanisms designed to get you to give them money.",
            "review_score": "-1"
        },
        {
            "review_text": "if u love basketball.... u will love this game... :)",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why, but in ASIA server (still beta) when I play 75% disconnected from the game. can chat with the others player but the game not respond. and can not exit without alt+F4. server problem or from the game?",
            "review_score": "-1"
        },
        {
            "review_text": "How am i going to play this game , if when the SUPER SLOW loading reach 40% the game freeze and i need to force close it?? , Stop wasting your time downloading this game!!!!  ----------------------------------- - Download from steam -&gt; download from the launcher -&gt; SUPER SLOW LOADING IN GAME WTF??? - SUPER SLOW LOADING  - 800 MB FOR SEEING THE LOADING SCREEN????  - FIX THIS AND I WILL RECOMMEND IF MY PROBLEM IS FIXED ----------------------------------- ",
            "review_score": "-1"
        },
        {
            "review_text": "You really only use 3 buttons to play the game other than the arrows, so theres not much 'freestyle'. The character customization is weak, everyone shares the same characters but gets to dress them up differently. There's little to no info available about some of the items in game, and even after downloading a PDF guide from the game's official website I couldnt figure out what a lot of things were for. (i.e Toy Manual).",
            "review_score": "-1"
        },
        {
            "review_text": "FreeStyle2: Street Basketball is one of the best sports mmo, and one thing it achieved by being a free mmo is balance. This game is no where close to pay to win, Sure you can buy exp coupons, but a higher level means nothing and the skills you earn are nothing if you're not good enough to use them. I've seen lvl 2 rookies block lvl 40 pros. I recommend this to whoever loves ballin and fairness.",
            "review_score": "1"
        },
        {
            "review_text": "I rate it 9/11",
            "review_score": "1"
        },
        {
            "review_text": "This game i have no idea of how it plays because it does not open, so therefor i cannot write the best reveiw, if anyone else is viewing my problem and it is happening with you too please do tell me and i shall contact steam",
            "review_score": "1"
        },
        {
            "review_text": "Cool basketball multiplayer game..!!! but, so much trash talking there.. LOL",
            "review_score": "1"
        },
        {
            "review_text": "Love the Game &lt;3. Specially while playing with your friends.  Super Enjoy !",
            "review_score": "1"
        },
        {
            "review_text": "I LIKE THIS GAME SO MUCH",
            "review_score": "1"
        },
        {
            "review_text": "DAMN !! That dunk , That beautifull shoot , and that gameplay is sooo damn fun !!",
            "review_score": "1"
        },
        {
            "review_text": "great and a fun game..wp",
            "review_score": "1"
        },
        {
            "review_text": "Great soundtrack that got me in the mood and boosted my morale, after it set me up the game play knocked me down (in a sensual way) After falling in to deep depression just the thought of ballin gave me back my confidence. Really good stuff, could not recommend more!",
            "review_score": "1"
        },
        {
            "review_text": "heavily p2w game.waste of time. why i pay money to this game instead of buying 2k games?",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game! Create your own team with your friends and rule the game!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely NOT Pay2Win if you want to have fun and win. The only 'necessary' spending total around USD20 on 4 extra skill slots in order to maximize gameplay potential. It is only effective when you are commited to go PRO (~lvl 40+), you don't have to spend a dime to be good at this game.  Each game lasts &lt;10 minutes (Forfeit option is available).The community should welcome players from all skill levels. Expect trash talking at higher level games (common phenomenon). Freestyle should grow for the better since Steam launch, unless the developer side don't accomodate for the expansion.   I would recommend this game to anyone who enjoys basketball or sports in general. Great fun!",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is really fun and competitive, especially when the team is working together even though it's a 'PUG'. only downside is asia server is currently unstable and lag alot, which makes alot of asia player to play in North America server instead. Though it doesn't affect too much but if you're using a Center or PF position the ping matters. =.= Overall a good game and being able to swag out your character makes it even better. I made a big black guy, gave him Blonde hair and slapped on a pair of fancy glasses and then named him FatJ. ♥♥♥♥♥ He's Fabulous, Don't judge.",
            "review_score": "1"
        },
        {
            "review_text": "This game has crashed on me so many times, also, the co-op com has only 2 bad teams, you would want to verse different teams but the only way to win is by having good players after the bad teams...",
            "review_score": "-1"
        },
        {
            "review_text": "so fun..only thing i dont like is its not that balanced",
            "review_score": "1"
        },
        {
            "review_text": "Because it's totally not Pay to Win right?",
            "review_score": "-1"
        },
        {
            "review_text": "I think this game has alot of potential. With the graphics of GTA 3 and the game play of well i dont know because this is possibly the best game i've every played. Hope everyone else thinks the same, good luck with your games. Remember to say gl hf and gg at the end of games xD",
            "review_score": "1"
        },
        {
            "review_text": "If you can get past the server issues the game is pretty good and has a large following. The interface is a bit confusing and I still have no clue what some of the stuff does or what I should do with it but it's basketball and it's street basketball and that makes it a 10/10 for me.   UPDATE:  Well I have been playing a lot of team matches lately and I can say without a doubt the game is 150% P2W. We played a team of bought players and we could not touch them, one guy scored all the points with a total of 36 points and they were all 3 pointers with NO misses at all. I am done with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "If you've played 2K or Live, stay away from this game. Here's why: -Anything basketball related doesn't make any sense. -It's a little bit of Pay-To-Win -Just sucks. Also, there are way too many people who take this game way too seriously and get butthurt if you make a mistake. This was pretty much a cash grab by the company. ",
            "review_score": "-1"
        },
        {
            "review_text": "P2WP2WP2WP2W  Install and play, it's self explanatory P2W",
            "review_score": "-1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "Gayplay is good. But it's p2w. ♥♥♥♥ you gamekiss.  &gt;buying characters  &gt;having ♥♥♥♥♥on of skills  ♥♥♥♥ you.",
            "review_score": "-1"
        },
        {
            "review_text": "You have to use arrow keys to move",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Wish I could give it a higher score but.. I just can't cause of only 1 thing.. THE ♥♥♥♥ING CONNECTION ISSUES,EVERY SECOND MATCH I LOSE CONNECTION and trust me I tried everything,I've got crystal clear 20MS and I lose connection more than I even play for ♥♥♥♥ sakes.  6/10 only cause of connection,and yes this is a HUGE problem as you can see..  Edit: I am now being kicked from every possible game because I'm getting these connection problems,and I'm heavily p2w,believe me,I used to never be kicked,now people are kicking me saying I'm a 'Quitter'. ♥♥♥♥ your connection issues.  Edit 2: The connection problems are so ♥♥♥♥ing insane now that I'm changing my review. From 6/10 to 4/10, ♥♥♥♥ you for not fixing this issue. Clear 20MS and I'm losing connection all the time.  Edit 3: time to fix that first thing I wrote 'every 2 matches' nah.. MAKE IT EVERY SINGLE ♥♥♥♥ING MATCH,I DEMAND YOU REPLY TO MY FORUM POSTS,I ♥♥♥♥ING DEMAND IT.",
            "review_score": "-1"
        },
        {
            "review_text": "Ball going to my hand... SIKE  Aba cadabra!!!!! it's on the opponent hands  9/10-IGN 'To much magic'",
            "review_score": "-1"
        },
        {
            "review_text": "horrible ♥♥♥♥ing game... You can't even invite your friends, they wont be able to join because 'you can't enter this room' is apparently the reason",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game man!",
            "review_score": "1"
        },
        {
            "review_text": "boring as ♥♥♥♥ reminds me of those 'backyard sports' games except worse concentrates way too much on trying to be urban thuglyf and not enough on the actual gameplay which is frankly pretty damn ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "fun with friends, alone gets kind of boring, in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting, skilled based game and it's basketball, try it out!",
            "review_score": "1"
        },
        {
            "review_text": "Every basketball lovers should play this game",
            "review_score": "1"
        },
        {
            "review_text": "Can't enter this room. Can't enter this room. Can't enter this room. Can't play this game it's garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Like a Play real Basketball (y) Rec++ Game",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's a good game, but the services sometines sucks.  If there is a Oceania Services it would be better.",
            "review_score": "1"
        },
        {
            "review_text": "great game :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Not too p2w",
            "review_score": "1"
        },
        {
            "review_text": "So addictive HAHAHA !",
            "review_score": "1"
        },
        {
            "review_text": "bring it to OSX please!!!",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing Freestyle since 2007, of course back then it was the original Freestyle Street Basketball by Sierra Online. Now we have the second installment of this series and it is great, there is no other game in the market that allows you to play team basketball with your friends like this one does.  I think it has room for improvement but what doesn't? I really hope now being on Steam it will allow them to do greater things with this game, I totally recommend this to basketball fans, specially if you plan to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Nice characters, nice costumes, and well defined positions, making the game more enjoyable. (Y) i will recommend this game to my friends :)  More power FS2!",
            "review_score": "1"
        },
        {
            "review_text": "I can finally feel like Aomine!  ",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Awesome",
            "review_score": "1"
        },
        {
            "review_text": "We B Ballin...  Still haunts my dreams,,  We B Ballin...  Good song",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Hope we can have full court.",
            "review_score": "1"
        },
        {
            "review_text": "It's just awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game",
            "review_score": "1"
        },
        {
            "review_text": "i came into this game expecting an all out ball out session...as i loaded in i was shouted at by an asian kpop singer singing god knows what and 3 ppl posing for what looks like a rap album cover!! the game engine was prob made my a 12 year old dog with heart worms. this game reminds me of that v tech ♥♥♥♥ u give to 5 year olds and they play for 5 minutes and it breaks bc its made of used condoms and cardboard.  OVERALL this game may or may not cause aids bc it ♥♥♥♥s up ur mind of how AWFUL IT IS   -23/10",
            "review_score": "-1"
        },
        {
            "review_text": "Sucks. I can't formulate a group of words and sentences that would truely express my dislike for the experience.",
            "review_score": "-1"
        },
        {
            "review_text": "I've tried to get on this game a couple of times and its crashed everytime I have gotten to the white screen.!!!! Please help me i really want to play this game! ",
            "review_score": "1"
        },
        {
            "review_text": "good game, but im LV 50 SG, and no gift from GM for leveling up form 48 to 49 as well from 49 to 50, plus GM said that lv get a free [Buzzer Beater Special Char] Coupon, and i dont see any coupon, GM? fix this",
            "review_score": "1"
        },
        {
            "review_text": "the downloading part is stuck at 95 percent",
            "review_score": "1"
        },
        {
            "review_text": "It's really a good game to play. So try it out..",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ game not recommend to play it because its suck even when you take a shoot on a right time . Still miss like dog perfect shot = miss",
            "review_score": "-1"
        },
        {
            "review_text": "dont you dare think this is gonna be fun no one cares about rookies they just say pass the ball24/7 and they never give you your fair share and the game is stupid because the op players go against rookies and you cant win so my entire time playing it was horrible the controls suck,gameplay is horrible and the graphics are ok but the people on there avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Freestyle 2 caters to both casual and hardcore audiences.  The game's simple learning curve allows anyone to just jump in and start having fun.  As for your main character, you get to choose from 5 positions (Point Guard, Shooting Guard, Small Forward, Power Forward, and Center). There are also 2 Competitive Modes: Team Match which is a 3v3, and Individual Mode is 1v1.  Co-op vs AI mode is also available. If you’re a fan of basketball, there’s no reason you shouldn’t be playing this game.  It’s generous, it gives you free stuff such as clothes and outfits on an almost daily basis, premium characters for free and an amazingly addictive gameplay experience to top it all off.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "tried multiple times to get into the game. Was unable to every time. Message showed up saying ERROR make sure you are running steam while game is open. Even though steam was open, it would open up and then automatically shut down. Don't spend the time with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Takes 10 minutes to download the game. Take 10 minutes to load the game. I gave up. ",
            "review_score": "-1"
        },
        {
            "review_text": "...",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game because is all about basketball :)",
            "review_score": "1"
        },
        {
            "review_text": "It's fun playing this game",
            "review_score": "1"
        },
        {
            "review_text": "Freestyle 1 Was masterpiece this was huge ♥♥♥ trying to copy the legend most of costumes is ♥♥♥♥ and whole community is kind of ♥♥♥♥♥♥♥♥. Freestyle 1 was best all those tournaments n stuff",
            "review_score": "-1"
        },
        {
            "review_text": "Ball is love Ball is life",
            "review_score": "1"
        },
        {
            "review_text": "It's meh, but I still play it. I reccomend this game if you don't have NBA2k17 and you wanna play MyCareer or don't have NBA Live 16 and you wanna play Rising Stars.",
            "review_score": "1"
        },
        {
            "review_text": "It's really fun!",
            "review_score": "1"
        },
        {
            "review_text": "I'm just going to go straight into it. I've put in about 30 or so hours into this game and I have enjoyed my time spent with it for the most part.  Freestyle 2 is a basketball game that is published by Joycity and hosted by Gamekiss. The game is run on a free 2 play model and while that may raise red flags for some, I've found it to be very fun and fair. After logging in, you are able to pick from a couple of classes. Small Forward, Point Forward, Center, Shot Guard, etc. After choosing a class, you are shown a list of different characters, that are really just chosen based on your preferred look or style. The game doesn't really offer any body customization like skin color, hair, eyes. But you can purchase different clothes, wigs, etc in the game shop. (They actually have a decent selection for the ingame free points that can be earned through playing.)  ~Gameplay~ I've found the mechanics of this game to be enjoyable, they all work how I'd expect. The controls definately took some getting used to. It's been a long time since I've used my keyboads directional keys.   The A button is to drive dribble, which consumes stamina and allows you to dash with the ball to pass your opponent.  S is to pass or steal  D is to shoot or block  W is to guard or post up. (Moving towards the basket with ball in a slower and more defensive motion.  I've found that it's a little bit harder to play defense than offense, but it all works well and feels really good when you dunk on an oppenent and he/she is slammed back down.   Your character(s) also have stats and level up. Level 50 is the max and the progression can be a bit slow after level 30. You put points into various attributes like 3 pt, layup, middle shot, speed, stamina, etc. The stats feel somewhat minor and it take's a bit to really notice a big difference. You can also buy skills and this opens up the game to a lot more, making it faster and way more interesting. One of the skills I received allows me to drive dribble back and forth to really shake up my opponents.   I find the gameplay extremely enjoyable and for that alone, I can reccommend this game to just about anyone especcially if you have friends, but we will get to that.  ~Graphics~ The game looks nice. It's a very simple cel shaded style and it runs pretty well on most low end computers that I've played on as well. If you turn up the game to high/medium, you may notice the game having a blurry effect on the characters. I personally didn't like this effect and found the game to look better on low. You only have preset graphic selections of low, medium, and high, so I found no way to turn it off. Speaking of which, I should probably talk about the options menu a bit more.  You cannot rebind your keys for drive dribble, pass, shoot, steal, or your movement. I found that to be a bit silly in a pc only game. Also no controller support, but they offer a guide on the site's forums that is stickied and it explains how to use a controller. This is still not a good thing in my opinion and hopefully they will add more options in the future, but I don't see it happening.   ~Sound~ The music is different to say the least. It's like k pop mixed with rap. I personally liked it and at times found it hilarious, but after a while I got tired of hearing the same tracks over and over again and listened to some of my own music.   ~Community~  Disclaimer: Another persons experience may differ from mine.  So the community is pretty small, but you should not have an issue finding any games. Though, I must reccommend playing with friends. Usually in a small community, you would expect players to be a bit more tight-knit, but that is far from the case. There are a lot of people that say the trash talking is just apart of the game. I can agree some what with that, but that isn't where my problem with the community really comes from.  You will experience more ♥♥♥♥ talking from fellow team mates. Players will berate you if you just get unlucky and miss a shot. You may see people go into all chat and call there own teammates noobs, because they are losing the game. (You lose nothing important by losing a game except your winrate and you still recieve the same exp and points for losing or winning.)   Edit: I can understand someone not wanting to see their win ratio lowered. I've done quite a bit of competitive gaming and sometimes communities will judge based on your win ratio and not your actual skill. It's just the way of the world, unfortunately.  I have to reccomend that you play this game with friends, because it is an extremely good time with people you know, win or lose.   ~Cash shop pay to win or not?~ I've played up to level 50 so far and have not experienced any real need to pay. Though there are things to pay for if you want to min max. There are cards that can be found with either luck or in a gachapon that boost your stats by a couple of points and then can be upgraded further. Some may want to find the best versions of those cards that upgrade the stats they want. There are also some cash only cosmetics to purchase, but no outfits have an expiration date and as I've said earlier, I was able to find a decent selection for points and they didn't take very long to buy.   You can pay for extra skill slots and that seems to be the most pay 2 win aspect, but from what I've read, you can make a good character without ever paying.  There are also exp boosts and such for conveniece and I've found the model to be fair and I don't think there is anything wrong with the system.  ~Conclusion~  I can definitely reccommend this game to just about anyone, especially if you have friends to play with. You will have an easier time with the community if you solo que at a lower level, but once you get into the higher leveled games, you will see a lot of hostility from your own teammates. Other wise, this is probably one of the best basketball games I've ever played. It runs well and does everything I'd expect from it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, freestyle 1 was better though, but this one brings in resolution options and more content. Wardrobes are limited but new clothes will be added as time goes on. This is a good c h i n k simulator if you want to play with them all the time because they are 2 short to play basketball IRL. Takes time to get good you need to know when to shoot, fake , rebound and positioning, etc. People who think this game is bad are idiots. Only bad thing is the ch1nks and the laggy players that come from the jungles of the Phillipines. Very good censorship in chat. saying 'idk' or 'stupid' gets censored but then theres players like ni gger666 that are allowed. Even saying the simple name of the game 'freestyle' is censored in chat  UPDATE: Chin ks still playing in NA server even though a goo k server opened up this week.  Very pay to win game. They spend their 5$ wekly factory paychecks to buy items on this game",
            "review_score": "1"
        },
        {
            "review_text": "Can You Create Asia Server Please",
            "review_score": "1"
        },
        {
            "review_text": "I love it i know its just released so i cant complain i just do not like how when something is loading it freezes a loading screen would be nice i thought the game was frozen the first two tries turns out it just takes a while to switch screens.",
            "review_score": "1"
        },
        {
            "review_text": "worst ♥♥♥♥ing game in the world",
            "review_score": "-1"
        },
        {
            "review_text": "Boring",
            "review_score": "-1"
        },
        {
            "review_text": "this is literally the worst game ive ever played, its impossible to figure out how to play with friends",
            "review_score": "-1"
        },
        {
            "review_text": "this game is really fun but some things seemed annoying: 1.the bots are really hard to beat 2.all players are op as hell 3.leveling up is kind of slow  but i cant wait for this game to get more updates ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Literally the best basketball game out their, find some NON ♥♥♥♥♥♥ FRIENDS and play some b ball",
            "review_score": "1"
        },
        {
            "review_text": "0/10 would never play again ",
            "review_score": "1"
        },
        {
            "review_text": "Uninstallation Simulator 2k15. 8/10 - ign",
            "review_score": "-1"
        },
        {
            "review_text": "pretty good ",
            "review_score": "1"
        },
        {
            "review_text": "Fix this, please. Everytime I load up the starting menu where you put the country, I press start then it crashes everytime and I also unistalled and reinstalled it and the same thing happens still. HELP ME!! I want to play so bad!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's one of the best free games ever.",
            "review_score": "1"
        },
        {
            "review_text": "This was the best game i ever installed",
            "review_score": "1"
        },
        {
            "review_text": "This game could be so much better. The controls alone is what drove me away from this game. Uninstalled!",
            "review_score": "-1"
        },
        {
            "review_text": "Stacked aka the face of FS2 on steam. That one pmf that is featured in the steam screenshots dunking on a trash pf. This is one of the best sports games for the PC, get it!",
            "review_score": "1"
        },
        {
            "review_text": "14/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥♥♥♥♥ and hard to use, dont waste your time",
            "review_score": "-1"
        },
        {
            "review_text": "this game is ♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "p2win. dunking is way too op and it seems like even if u pay to win it doesn't seem fun. I had fun with the game for an hour, but once i saw what p2w is like in this game....no way am i spending anymore time on this",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game but it's too glitchy like how I lost my 7 day double sponser when i used it for less than 2 hours",
            "review_score": "1"
        },
        {
            "review_text": "Use arrow keys to move characters?  Uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has the worst servers I have ever seen in my entire life.",
            "review_score": "-1"
        },
        {
            "review_text": "If your looking for a review on this game you've come to the wrong place, but if your looking for an outstanding pie recipe you've come to the right place.  Ingredients: 1. 6 tablespoons unsalted butter 2. 1/2 cup white sugar 3. 1/2 cup brown sugar 4. 1/4 cup water 5. 1/4 teaspoon cinnamon 6. 1 pinch salt 7. 5 apples - peeled, cored and sliced 8. 1 pastry for double-crust pie   Directions: 1. Preheat oven to 425 degrees F (220 degrees C). 2. Combine butter, white sugar, brown sugar, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat and set aside. 3. Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices. 4. Roll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal. 5. Pour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust. 6. Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.",
            "review_score": "1"
        },
        {
            "review_text": "hella fun but i upgraded to windows 10 :D",
            "review_score": "1"
        },
        {
            "review_text": "i can shoot 3's in this game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "It is so EPIC!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "To make a honest review this is a great game. Reminds of nba street but a little more skilled based wise and a hell of a lot more teamwork can take you a far way. This game has really only ups no downs. This soundtracks also are just great. overall best street ball game out now.",
            "review_score": "1"
        },
        {
            "review_text": "If he is good at shooting, kick him",
            "review_score": "1"
        },
        {
            "review_text": "This is actually fun, the controls are simple and easy to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "3 of us downloaded this as a joke created characters joined same server couldn't add each other didn't play a single match game froze upon closing  11/10 would create pajama man called BananaBoi again",
            "review_score": "1"
        },
        {
            "review_text": "Recommended game (y)",
            "review_score": "1"
        },
        {
            "review_text": "Love this game:)",
            "review_score": "1"
        },
        {
            "review_text": "Kellogs Mckina loves this ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "Installed this game at 2 pm. At 2 am still playing...  If  1) YOu love basketball and  2) want to play against humans and not stupid AI players, then...  THIS IS YOUR GAME  BE CAREFULL NOT TO BECOME ADDICTED TO... (lol look who is talking about...)",
            "review_score": "1"
        },
        {
            "review_text": "i want to know what does it mean i need steam user to pla ythis game can somebody tell me how because this is making me mad!!! ",
            "review_score": "-1"
        },
        {
            "review_text": "FS1 was a wonderful memory of my childhood. it with me more than 5 years. few days ago found this FS2 on steam. im playing memory here nothing else. but As a money game. The problem is I even cant purchase the gkash. still showing processing. (i tried double check game setting it doesnt work) hope you can fix this bug soon.",
            "review_score": "1"
        },
        {
            "review_text": "262hours and counting.  These are the Pros and Cons that I have personally experienced in the game, you may or may not agree with me but i'm just trying to share a fun game to people who either want a casual or a competitive game to play.  Pros - Got a lot of cool events and giveaways - Part team-based, part individual skill-based gameplay. (You can win if you are good in at least 1 of the two) - Titles and Achievements that rewards players with goodies. (Item ball, Magic Ball, etc.) - The Character Customization is quite fun. - I personally like the graphics and it has a low system requirement which is a plus for me because of my beloved ancient laptop. - Meet a lot of fun people to play with.  Cons - Encountering Toxic People both in game and in the lobby. (It's understandable to admonish a mistake in gameplay in higher channels like pro and pro2 but mistakes done in both rookie and major channels should be understandable to people.) - A difference in ping is huge when it comes to Big Men positions (C and PF), because the rebounding is crucial to the game.  - Special Characters have noticeable advantages to normal created characters. (But I have 3 spc. characters without spending a dime because of amazing events.) - Not really that much of a Pay-to-Win Game, even though in higher channels Pro-Pro2, much needed stats gained from special cards and equipment would come as a great help. - If you are a VIP member, you can kick the host of the game that you are playing. (Seriously!? If you don't like the host then just leave then create your own room.)  I may have forgotten to write a few Pros and Cons but you get the point. Seriously, just earnestly try to have fun in playing any game than interests you and the game would be fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "It seems like a great game...but doesnt work for me -_-",
            "review_score": "1"
        },
        {
            "review_text": "I rate this 8/10  Needs to fix connection issues",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this broken game.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, i really love this game, is just that when you got to major server, you got players like SantonosJr always take the fun out of this game, i miss a couple of shot and they told 'You suck, You're terrible, you're garbage, leave, stop playing and uninstall this game' also he was talking about my mom, people like them alway takes the fun out of every PvE games and i'm sick of it, i'm still playing this game, i'm just going to keep doing what i do best, ignore the negative people and listen to positive people, maybe we should all ignore cyber bullies",
            "review_score": "1"
        },
        {
            "review_text": "NIce Game, Like It",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, addicting gameplay.... other than that, the servers are complete a$$ and this mostly ruins it for me, especially when i'm waiting an HOUR to get a match going, or worse, i get a win streak going and the game decides to terminate my connection and close the game out. very frustrating. oh and it's pretty funny, the announcer has a potty mouth, the soundtrack is exactly what you would expect from a basketball game... yet the chat filter blocks words like 'long,' 'stupid,' and even 'idk,' making communication hard sometimes. Also i'm not looking forward to progressing to Pro, as i hear its MAJOR p2w at that point. i recommend it despite these drawbacks.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun i use to play freestyle 1 and for myself there is so many changes that happens in freestyle 2 even so this game is as awesome just like the previous one. So many reviews says it is a pay to play game how can you say it is pay to play if they always had a giveaway and event. so i reccomend this game to be played.",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10   Only lacking consistency and stability in servers.  Everything else? Terrific",
            "review_score": "1"
        },
        {
            "review_text": "why i sudenly can't play this game,, in game when i trying to join team match,, always get kick out automaticly ,,, what is the problem,, can anybody help answer my question?",
            "review_score": "1"
        },
        {
            "review_text": "good game for basketball addicts. LOL",
            "review_score": "1"
        },
        {
            "review_text": "Classic game ... one of the best steam game .. 1 problem though it only starts in window mode .. however i can set graphics once the game is ON ! solution pls ...",
            "review_score": "1"
        },
        {
            "review_text": "Wouldnt load, poor graphics, super lag",
            "review_score": "-1"
        },
        {
            "review_text": "what is UI? i failed when it is in the 40% T_T  plss help! tnx :)",
            "review_score": "-1"
        },
        {
            "review_text": "The game is fun",
            "review_score": "1"
        },
        {
            "review_text": "Horrible...!!! I cant customize the input key(control key) in game for my own.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm still new to this game. But it's really fun, I've played games like 2k too. Obviously this doesn't have the depth as Nba 2k but it's solid, it's free and it's online.   The online gameplay is good, I'm from Australia, there are no dedicated servers but Asia ping wise is fine. I didn't notice much delay etc. The level grind looks like a real grind. I didn't feel like gameplay was effected by pay2win stuff. It's all mainly cosmetic I believe.   One main thing this game lacks, controller support. I like using a controller for these kinds of games but yea it sucks here. I was able to dribble and shoot thats about it. I have to press f to dunk and there's no button on the controller which did that. Sucks. I tried looking at the settings but nothing.   Overall 8/10. Solid, quick download and fun. I'd give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Failure to download the luncher data .. how to fix ?",
            "review_score": "1"
        },
        {
            "review_text": "Not bad, not good, but good more!",
            "review_score": "1"
        },
        {
            "review_text": "it's ♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "If you are willing to overlook the many weird network related bugs in this game, and a semi-toxic community of very young players, the game is surprisingly fun to play. I'd recommend to play it with at least 1 friend, so that you can at least have a 1-2 combo going on. The game has some pay-to-win'ish stuff in it, but it is entirely possible to win a lot without paying anything.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! :D",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, its stopping me from learning so go have a try XD",
            "review_score": "1"
        },
        {
            "review_text": "awsome for people who love basket ball",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very well put together. Had a few minor complaints.  Here are the complaints: 1. COULDN'T SHOOT THE BALL. 2. COULDN'T PLAY BIG JOE. 3. THERE WAS NO JORDANS TO BUY. 4. COULDN'T SHOOT THE ♥♥♥♥ING BALL. 5. HOW THE ♥♥♥♥ WILL A BASKETBALL NOT LET YOU SHOOT THE BALL.  So overall I'd give the game a 8/10. I will cry myself to sleep because I couldn't play Big Joe the god of Basketball. All Hail Big Joe.",
            "review_score": "1"
        },
        {
            "review_text": "The best fun game, multiplayer game, free to play game ever ! I played only 43 hours but it's onorable to play that game .. Nice condisions, small bugs but it's ok !!",
            "review_score": "1"
        },
        {
            "review_text": "HE SAID IT ALL~  ovsep56 10 products in account 1 review  Not Recommended 0.4 hrs on record Posted: 2 April let me give you a proper review of the game i played it since closed beta so most of the people praising it are players who played it before steam and spend TONS of money on it and they're trying to sugercoat the game so gain more players so they can curse at you and humiliate you also call you noob.  PLEASE READ IT ITS A WARNING ABOUT THE GAME.  pro: -great gameplay. -costumization. -different dunks. -teamwork required. -scoring feels satisfying.  cons- -HEAVILY p2w (like seriously check the cards your can obtain all cards wich are gold are only obtainable through cash those cards can be upgraded more than 10 times) and don't forget the +10 stats on clothing wich is also only available for cash (with item balls) only free players can only have +5 stats on a clothing piece i calulated the stats you could earn with cash and with ingame money free players can get to +35 on 1 stat paying players can get over +65. -HIGLY toxic playerbase don't get fooled by the rookie server the pro server is swarming with ♥♥♥♥♥♥♥s bragging that they spend the most money in the game. -usseless gm's they ban you if you say bad stuff about the game i already had a warning message from a gm. -relies highly on ping for the pf and C position. -players posting the most dumbest things on the forums wich has nothing to do with the game its almost as bad as facebook. -pf's are highly overpowered they can shoot 3's like a sg, shoot 2's like a sf,dunk like a pf and rebound like a C and pf's has a skill that makes C's completly usseless. -C's are HIGHLY underpowered DO NOT!!!!! take that position they got almost completly usseless cause of pf's.  -mostly foreigners good luck finding english players. -idiotic players who keeps wanting an asia server even tough there is 2 asain versions of the game already. -playerbase is next to none before it came to steam and there is a good reason for that. -prepare to get kicked out alot.  -special characters that is only obtainable with cash gaining special atributes. -players who have vip cannot be kicked in fact vip players can kick the host. -most events require cash -cash clothing so big it litteraly blocks your view of your character. -special characters have a bigger hitbox -tons of exploits like when you playing as a C or PF most of the time you needs to split into 2 to win and either way you get the blame.  reason the game is so p2w is because its following the taiwan version of the game the korean version is 10X better and not p2w at all. if it din't have all those cons the game could have been so much better",
            "review_score": "-1"
        },
        {
            "review_text": "Great to play with Friends, Not Recommended on solo match makers  Pros: Awesome and really fun for my first hours Nice game play Team base Game Gr8 With Friends  Cons: Really annoying EGO-Players who kept spamming pass Game will get boring on Scrubs on team Lots of EGO players if you go solo",
            "review_score": "-1"
        },
        {
            "review_text": "I installed the game  I created a Center  I played a match (after getting kicked out of 69 other lobbies)  I got dunked on by a 5'4'' point guard.   My team shouted at me and told me to uninstall.  I uninstalled.  5.27/10 - Shaq would approve.  ",
            "review_score": "1"
        },
        {
            "review_text": "I am unable to purchase Gcash.. when I try it just says processing please wait and I have to altF4, overlay was enabled, but it still doesnt work, can someone tell me why? The game was great tho",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ as game win 10 games in arow after 8 lvl imposible to win, used 3 different chars same ♥♥♥♥. P2w or play with premades solo is ♥♥♥♥. Was fun at start but now it makes me just rage alot, with 0 balance.",
            "review_score": "-1"
        },
        {
            "review_text": "Please help. Game is not responding when it reached 40% in the loading screen after I start.",
            "review_score": "-1"
        },
        {
            "review_text": "i cant purchase the cash,always processing.how to fix it",
            "review_score": "1"
        },
        {
            "review_text": "All in all a great game, I understand you need a good computer to play it, but the game crashes so much it kind of annoys me... if that is a problem with other user's aswell, I would LOVE to see that fixed, other then that, great game ^-^",
            "review_score": "1"
        },
        {
            "review_text": "Good Online Sport :D xD",
            "review_score": "1"
        },
        {
            "review_text": "I love it sg for life",
            "review_score": "1"
        },
        {
            "review_text": "Just love it.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes i dream about playing kuroko no basket .  well it finally happend ,  WELCOME TO THE ZONE!",
            "review_score": "1"
        },
        {
            "review_text": "This thing didn´t open!",
            "review_score": "-1"
        },
        {
            "review_text": "Mac please",
            "review_score": "1"
        },
        {
            "review_text": "I love the gameplay. But the menus are aids and very confusing, the netcode is trash, the servers are slow, the charachers are $15 each and if you want to change anything you need t pay nother $15 or pay another $10 to change the name or respec. So, even though gameplay is great it lack in other areas",
            "review_score": "1"
        },
        {
            "review_text": "happy new year every body !!",
            "review_score": "1"
        },
        {
            "review_text": "First game was vs someone decked in gear and stats. No match making, which makes the p2w even worse.",
            "review_score": "-1"
        },
        {
            "review_text": "Y so good gem? Le play",
            "review_score": "1"
        },
        {
            "review_text": "How to buy VIP?",
            "review_score": "1"
        },
        {
            "review_text": "Limited customization, great animation and physics but unappealing and repetitive gameplay. Would rather ball irl.",
            "review_score": "-1"
        },
        {
            "review_text": "Yes. It's worth the weight.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty ♥♥♥♥ and misleading",
            "review_score": "-1"
        },
        {
            "review_text": "PROS: +good basketball game +team work based +nice soundtracks +beautiful characters models and skins CONS: -slighty p2w with special characters that have bonus points attributes -at 24-50 lvl is not fair game anymore",
            "review_score": "1"
        },
        {
            "review_text": "It's a verry good game i love it       P.S suck my ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "why always not responding wen 40%???",
            "review_score": "-1"
        },
        {
            "review_text": "I can't see room list   help me pls T^T",
            "review_score": "1"
        },
        {
            "review_text": "Pls create volleyball game like this ^_^",
            "review_score": "1"
        },
        {
            "review_text": "I wish Steam had the option to give a 'mixed' review, because I honestly can't say my review is either positive or negative. Out of coherence, since for past games I had the same problem with I just put in 'positive', we'll go with that. I do enjoy the game.  It's pretty simple, it's super fun, and the style not only of the characters, but of pretty much all of the items and interface are mostly consistent and hella stylish. Seriously, every minor artwork for events has their suburban/slightly anime schtick. Soundtrack helps a lot with the feel too, although obviously it gets repetitive after a while.  Unfortunately, the game is plagued by some issues that cannot be ignored: first of all, having a bad ping absolutely destroys your game experience and that of the others. It's not as bad as in other games, but that's not saying much: it's pretty terrible.  Secondly, the game is very luck-based, which arguably some casual players might enjoy, but not me. Admittedly, it makes sense in the way they made it, having your chance of success or fail an action depend on your stats compared to those of your adversary, trying to simulate variation or something... still, this effectively means playing consistently doesn't yield the same result all the time, and sure, the usual argument against this is 'that just means you have to adapt to new circumstances', but I personally dislike this approach. Plus, someone succeeding a low-chance Steal, turning around shooting 2pt is not exactly giving anyone time or chance to react, although obviously there are plays and 'strats' that, paired with reflexes, minimize risks. So, it's bad, but not all that bad.  Secondly, the oh-so-dreaded pay2win. It's definitely there. There's this argument going around, claiming that 'even if you pay for the boosts, you gotta know how to use your character, so this isn't true', but what the people who say this are forgetting is that that effectively means if two people of roughly the same 'skill level' meet, the person who payed will objectively have better stats and therefore the exact advantage they need to defeat the other person, without having achieved this via either luck or skill.  Overall, try it. It's fun. I'm not taking it seriously and I'm having a blast, but I'm not sure I'd ever want to touch the comp scene.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, just that the bad part is that there are alot of cheaters in Individual and Team Match.",
            "review_score": "1"
        },
        {
            "review_text": "it does not load up it say error game crashed can u plz fix this for me please",
            "review_score": "1"
        },
        {
            "review_text": "If you have the patience and time to learn how to play this game properly then it will be fun. This game isn't 2k17 you can't just play it without knowing how to block correctly, how to play your role and position.",
            "review_score": "1"
        },
        {
            "review_text": "old game but good",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun with friends, but stupid community is toxic at everything. Also whenever i try to play a game without my friends, i get kicked from the lobby for being ''bad'' even though they have never played with me before, so my experience with this game is that the community sucks balls but the game is alright",
            "review_score": "-1"
        },
        {
            "review_text": "play this game",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very addicting!!!",
            "review_score": "1"
        },
        {
            "review_text": "Good game but server is so FK LAGGGGGGGG",
            "review_score": "1"
        },
        {
            "review_text": "HELP! Whenever I launch the game, it crashes and says steam user error. ",
            "review_score": "1"
        },
        {
            "review_text": "'That shot was beautiful,somebody take a picture!' - Great lines i,great music,great gameplay,great game. Gr8 m8 ir8 8/8. WOULD DUNK AGAIN.",
            "review_score": "1"
        },
        {
            "review_text": "Bro's and Hoe's alike, LOVE THIS GAME. IT IS AMAZE. I HAVE SPOKEN!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "how to buy Gkash from steam wallet ",
            "review_score": "1"
        },
        {
            "review_text": "I do reccomend this game but it will not start up for me...it pulls up the launcher and i press start. but nothing happens...then if it fianally does open. the game will crash with some kind of error like 5-10 min later.....",
            "review_score": "1"
        },
        {
            "review_text": "Fun games but it was Pay2Win games since the item have attribute boost and it would be better if have controller support",
            "review_score": "1"
        },
        {
            "review_text": "I cant even play the damn game when I try to run it, it just says 'In order to run this game steam must be running' and it is running so dont play this game",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly this game looks like trash from the steam page but don't be deiceived me and my friend play it for ♥♥♥♥♥ and gigs turns out this game is REALLY ♥♥♥♥ING FUN",
            "review_score": "1"
        },
        {
            "review_text": "Personally cant say much not my type of game due to micro transactions.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was, well, awful. the controls where stupid, the animations they worked 'so hard' on made the game slower for anyone who played it (no wonder there are bearly any videos of it, u cant run that and fraps, R.I.P computer) the bots where stupid as a goldfish in first grade which made this game terrible cause nobody is ever playing it, kinda like team Xperiance, the only differents is that I team X is a game I would play as frequently as I go to the toilet. to conclude this review I would recommend this game to my insane cousin jeff to get him to stop playing hungry hungry hippo.",
            "review_score": "-1"
        },
        {
            "review_text": "Deceptivly simple basketball game. In the end it all comes down to stats. I've had some fun with it.  Upgraded my opinion. Little gem ssd worthy.",
            "review_score": "1"
        },
        {
            "review_text": "it nice sever sea",
            "review_score": "1"
        },
        {
            "review_text": "im White Person playing a basketball game for the first time in his life! Wins the first game against another player. Where did i go wrong!!??",
            "review_score": "1"
        },
        {
            "review_text": "You like Basketball Games, Do you like Free Games???   Then this Game is right for you!!!  But then if you want to look super swag out you got have moneyz...  But lucky alot of the items only use in game currency!!!  So play it for like an hour or 2.",
            "review_score": "1"
        },
        {
            "review_text": "Doesnt work for my Windows 8. After clicking 'Start' on launcher a screen opens up and closes then a bug window opens telling me to send the information to them.... doesnt' even send",
            "review_score": "-1"
        },
        {
            "review_text": "Loved this game. Great game if your really just trying to chill, maybe stream. For whatever your playing this game for, have a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't even get the game to play....",
            "review_score": "-1"
        },
        {
            "review_text": "Does not load ;/",
            "review_score": "-1"
        },
        {
            "review_text": "If I could pick between shooting 3 pointers in this game... jk 3 pointers are pay to make or doom to fail. People gain stats by putting watermelons on their heads, racist game.",
            "review_score": "-1"
        },
        {
            "review_text": "nice game. for people who like basketball. and the best thing is that it is free",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game! I highly recommend it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Although I love this game, it has a lot of flaws. I love playing this with friends, and it has lots of replay value, but with these fun points, some features ruin the gameplay.  Pros: -Great Replay Value -Fun with friends -Cartoony graphics that set the mood -Lots of features -Good multiplayer and good features -Its free!  Cons: -Pay to win -Buggy menus and often crashes (from my perspective) -Overpriced micro transactions -Crappy Music   Overall, I really enjoy this game, but I think the developers went a bit overboard on the pay to win features. I like buying new clothes and different accesories, but the fact that you can buy characters with a gameplay advantage, and buy your player into the best is a bit stupid. I still enjoy this game a lot either way.",
            "review_score": "1"
        },
        {
            "review_text": ":)))",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of my younger days. Unfiltered basketball.  EDIT::  There WAS multiple channels for this game to kep skill based matchmaking fair.  Rookie 1 Channel / 1-11 Completely for newcomers)  Rookie 2 Channel / 1-11 (For high level experienced players starting a new character or very good rookie 1 players who pick up the game fast. You are forced to play in rookie 2 if you fit the criteria.)  Major Channel / 12-24  (Where rookie 2 and rookie 1 players merge. It's overall balanced here because rookie 1 players should get the gist of the game by now.)  Pro Channel 1 / Level 24-39 Nothing much to say here.  Pro Channel 2 / 24-50 Pro 1 players can come here but I highly don't recommend it.  -----------------  As you near the max level you will realize that the game is ultimately Pay 2 Win, or at the very least pay to have a ridiculous advantage.  Example: Buying a level 1 SPC (Special Character) is about $15 while the same SPC character at level 40 is up to $50. With this SPC you get 40 extra stat points. Now to explain stat points - there are attributes such as 3pt shots, rebounding, passing, short lay-ups, long lay-ups, stealing, and more.   The higher the stat the better the succes rate. You get 2 points each time you level up. Then you go to level your attributes. Each attribute to level up has 4 segments of 5 bars to fill. At first it cost 1 point to level up. So 5 points to level up the first 5 bars which is the first segment. Then is cost 3 points to level up in segment two. So a total of 15 points to level the next 5 bars to get to segment three. Segment three; which is 5 points to level up one bar totaling 25 points to fill up segment 3.  (I think segment four is 7 per bar, going by a pattern)   Now let me repeat. SPC's get 40 extra stat points to spend on the attributes. Starting at level 1.  ----------  Now granted it is pretty fun and you dont really notice the pay-to-win players until you get to the Pro channel's. But now it's worse. A recent update -which is why I'm making this new review- has merged The two rookie channels into one rookie channel, and same for the pro channels. Think for a moment on what you just read and you'll see how unbalanced that gets very quickly. New players facing SPC users, and new pro players that don't pay to win at level 24 being matched up with full-on level 50 SPC users with those 40 extra stat points. Good luck. The wall the gave this game and players some idea of what little fairness was there to begin with has now gotten completely demolished.   ----------   Do I thumbs the game up? Yes. Why? Because it can still be fun, and you have a choice to play with computers, for an extreme amount of lowered XP per match. Do I think people should play it? With this recent update? No. I say Gamekiss should make two servers. One for people who are free-to-play and one for the combined community; free to play and not. The matchmaking has gotten too unbalanced. If it was a shooting game bullets can make a person go down easy, so pay to win doesnt mean much. But this is a basketball game. Every, dunk, block, and turnover means all that much more with higher stats over the course of a long 5 minutes per game. The community is also very toxic, often times for no good reason.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play with friends!",
            "review_score": "1"
        },
        {
            "review_text": "GOOD GAME  yes , I know there are some problems yet , and yes I know the game publisher still have to fix few things .  BUT , it's great game , it's fun and you can play hours without gatting tired from it .",
            "review_score": "1"
        },
        {
            "review_text": "ohhh yeahhhhhhh.... just cant get enough",
            "review_score": "1"
        },
        {
            "review_text": "my avg found a virus within this game",
            "review_score": "1"
        },
        {
            "review_text": "Old school streetball! Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "the control kind of suck  ",
            "review_score": "1"
        },
        {
            "review_text": "Nice game if you are playing on american server and nice community ",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game, but the developers need to step up and think more of the players. Get more for your money, or pay less and get more. Because the donation system is the worst i've seen in all my life. For the rest they need to pay more attention to what the players want. But the game itself and the mechanics are pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't open up the game... All it says everytime is something around the words You need steam to be running (which it is) I've done everything i've looked up on how to fix it and nothing works. IT WOULD have been fun to play but there is always stupid s*** that happens.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this cause i love basketball and I can't afford 2k14-15.  I actually got a realy decent game with a nice, catchy soundtrack and gameplay thats easy to get into.  cosmetics are really nice looking but arent all that.  Since its free i highly recommend for you to try it out.    ",
            "review_score": "1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "Recommended",
            "review_score": "1"
        },
        {
            "review_text": "how can i convert my steam wallet into GKash ??",
            "review_score": "1"
        },
        {
            "review_text": "this game makes no ♥♥♥♥ing sense",
            "review_score": "1"
        },
        {
            "review_text": "this game is very cute.",
            "review_score": "1"
        },
        {
            "review_text": "its easy to get use to the only thing is they need to fix alittle bug because when i shoot when i hit the green bar i miss like come on :( but its a fun game like how to can custom almost every thing like skills an ur person what can you say its free",
            "review_score": "1"
        },
        {
            "review_text": "its very cool i play the game this will be a coollest game im played street basketball",
            "review_score": "1"
        },
        {
            "review_text": "My game wont launch when i press start idk wat to do?",
            "review_score": "1"
        },
        {
            "review_text": "better than space jam 10/11",
            "review_score": "1"
        },
        {
            "review_text": "What a fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "error when i trying to play ",
            "review_score": "-1"
        },
        {
            "review_text": "Pro: +Funny gameplay. Very funny! +Coop. +Lots of customization. +Lots of free characters to choose+++! +Cell shading. +Ceremonies when scoring. Con: -Community. Very Toxic. -UI Slow. Slow loading screen. Poor optimization. -Music is ok but needs more variety. -P2W. This is a very competitive game. Skill beats money. But luck is based on attributes. More attributes means more chance to score 2p, 3p, Steal, etc. -You need very good ping for competitive and not many servers. People who live inside the server will benefit a lot. -Very bad matchmaking. (level 1-11 &lt;this is the very nice, 12-23 &lt;you will be kicked a lot but very balanced matches and most fun, 24-50 &lt;very unbalanced matches). -Sometimes is hard to find people to play with. -Grinding level is hard. -Expensive items. e.g. 16€ for 4 skill slots for one of your characters.  I can't recommend this game right now because matchmaking and P2W system. Don't lose your time, fool!",
            "review_score": "-1"
        },
        {
            "review_text": "Guys i know i have 200 hour in this game. If i vote NO why i played so much with this game? Because its a very fun and good game. Then the other question, is why i give him NO. Because there are many of buggs, but its not a very big problem... The biggest problem its that almost impossible to defend the enemy. Like SF(2 PT Scorer) have skill that you cant block... But i think download it and play some hours with it because first its a very good game!",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, thanks to gm who give me/us a good event in game ^^",
            "review_score": "1"
        },
        {
            "review_text": "To start playing 3v3 you must wait for players and it takes ages",
            "review_score": "-1"
        },
        {
            "review_text": "Ball is love",
            "review_score": "1"
        },
        {
            "review_text": "This game is pay 2 win.  It was great until gamekiss ♥♥♥♥ed it",
            "review_score": "-1"
        },
        {
            "review_text": "Ye, this game is pretty good. It is just bad with the swingman being op.",
            "review_score": "1"
        },
        {
            "review_text": "Good Basket ball game but pay2win",
            "review_score": "1"
        },
        {
            "review_text": "This game is very nice !! I like to play it !",
            "review_score": "1"
        },
        {
            "review_text": "This game isnt pay to win. I didnt spend a penny and I average 60-70% winrate on all of the characters which is insane. I've played this game ever since it first came out in Korea (good ole FS1 days) and I can tell you for sure it's all about TEAMWORK. This game isn't enjoyable if you are playing by yourself because you will meet players who just don't get the game. So a rule of thumb is if you like whoever you played with, just add him/her so you can play together next time.   Few additional helpful tips are (in-game): 1. Always look to pass  2. Don't go for block everytime the opponent does a pumpfake  3. Know your strength and abuse it   Hope you guys enjoy this game too! It's free afterall",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is solid, though it'd be cool to have the option to play full court with bigger teams. The menus and everything other than actual gameplay is a cluster♥♥♥♥ hoarder mess. There's so much going on you find yourself lost in a maze of receive gift/receive item buttons and also there's some sort of board game with a cow you move around to get more ♥♥♥♥. Where am I and who is sending these gifts? Mysteries that will never be solved.  ultimately the game feels like what it is, a manufactured bloated mess. It's fun in the same way that a snes basketball game is, which means it's ok. But it'll never be anything more than 'ok'. Changed review to not recommended because I can't see a reason to play this over literally any other game.",
            "review_score": "-1"
        },
        {
            "review_text": "I find the load times to be somewhat lengthy. I'm sure if you could get that sorted, along with the server connection times - then I may be able to get into it, but atm, as it currently is - It's just not for me. Good luck to the producer, and I wish only good game to all who enjoy this, but again - It's just not for me. I'll stick to my NBA 2k. I also enjoy a really great b-ball game on the Wii (original) using Wiimote n Nunchuck. To be honest though, I (personally) have never enjoysed sports games on PC. I don't know why, but I just don't. GG to ALL - GG!!!",
            "review_score": "-1"
        },
        {
            "review_text": "yo this game is hype as ♥♥♥♥, lets ball. --DroHouSe--",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "terrible game, you cant invite your friends for ♥♥♥♥ and the bots spam the ♥♥♥♥ out of you. pay to win garbage",
            "review_score": "-1"
        },
        {
            "review_text": "crashes alot",
            "review_score": "-1"
        },
        {
            "review_text": "Amazingly fun gameplay, simple but exciting.  Worst customer service I've ever experienced.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls suck.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is amazing, the community not always. I wish muting was easier.   This game is like a mmorpg of basketball where you get matched with players in your skill range. You level up skills and use skills on opponets and do more damage (score or defend). The feel of the game is smooth and the makers are extremly reliable. It is a pay to win. But it is a very fun game, forking over money is worth it i feel like with this game, this company put out a solid game and they ban people for toxicity all the time. One of my favorite things with this company is that they release the names of the people they banned for the month (with *'s to hide actual names) so people who played with them saw they had been punished.  If you play this game, play for fun like the majority of us. Don't take this game seriously, and if you do don't rage at your teamates for trying to have a good time.",
            "review_score": "1"
        },
        {
            "review_text": "I like the customization, the skills, the freestyle, the art.          Hate the community.",
            "review_score": "1"
        },
        {
            "review_text": "very bad connect",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is Awesome but everytime my family around the loading screen is grr. FIX IT LOL!",
            "review_score": "1"
        },
        {
            "review_text": "  ilove game this so funn and always win hha",
            "review_score": "1"
        },
        {
            "review_text": "EDITED:This game was fun now its full P2W P.S and tons of bugs :D",
            "review_score": "-1"
        },
        {
            "review_text": "a very good game indeed, for those who are fans of basketball, but not me. just tried this and its fun i can say.",
            "review_score": "1"
        },
        {
            "review_text": "actually pretty nice game",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME but somehow it gets stuck at 40% and could not play.",
            "review_score": "1"
        },
        {
            "review_text": "it wouldn't even let me start. It crashes and says 'Please wait' and doesnt even load after that, causing me not even to be able to uninstall it. The game probably is fun, if i could atleast pick a character. Learn to make a game.",
            "review_score": "-1"
        },
        {
            "review_text": "  very very nice game",
            "review_score": "1"
        },
        {
            "review_text": "well it looks like the games good but bob ross is not that happy Yes. he sees it allows me to beat the devil out of all of them but bob ross cant load this game makeing him angry but maby this was just a happy accident",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable. Some fixes here and there and it'll be perfect. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "p2w game with terrible controls",
            "review_score": "-1"
        },
        {
            "review_text": "The game doesn't even work for me lol!",
            "review_score": "-1"
        },
        {
            "review_text": "This game Is actually really fun, the clothing customization, gameplay simplicity controls is simple as well to be honest with you. It will get you hooked pretty fast.",
            "review_score": "1"
        },
        {
            "review_text": "+rep what a game",
            "review_score": "1"
        },
        {
            "review_text": "i Like this game. even spent a lil money on it too. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Press A to win",
            "review_score": "1"
        },
        {
            "review_text": "Compatible with MacOSx platform plss :(",
            "review_score": "1"
        },
        {
            "review_text": "Please fix the problem 'Connection to Server Terminated(4)'. This happened after the update.",
            "review_score": "-1"
        },
        {
            "review_text": "A few bugs like when you choose control type(s) the browser page that is supposd to load up (guessing it is control map) doesn't load. Also no custom controls seriously puts me of this game, I would spend money on the game if I see the devs are productive and listen to the community. Otherwise I like the game and can see myself playing this.  EDIT: I can swear the devs don't give two s%$*! and the controller support... Well it isn't very supported..",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME ♥♥♥♥IN WONT LET ME START. Honestly im very keen to play this game, but it just won't start AS SOON AS I CHOSE MY CHARACTER AND INSERT MY NAME IT KEEPS SAYING 'PLEASE WAIT, PROCESSING.........' FOR ♥♥♥♥IN EVER. FIX THIS PLEASE",
            "review_score": "-1"
        },
        {
            "review_text": "PASS THE ROCK BRO!",
            "review_score": "1"
        },
        {
            "review_text": "Its aight",
            "review_score": "1"
        },
        {
            "review_text": "GOAT GAME OF THE MILENNIA",
            "review_score": "1"
        },
        {
            "review_text": "Until the defense is fixed and players play against equal level this game is trash!",
            "review_score": "-1"
        },
        {
            "review_text": "its an FAILURE",
            "review_score": "1"
        },
        {
            "review_text": "Played since FS1 launch, still a great pastime.",
            "review_score": "1"
        },
        {
            "review_text": "this is so amazing needs some more ghrakcic butting up",
            "review_score": "1"
        },
        {
            "review_text": "A little connexion lost and the game close directly plus long to start the game.",
            "review_score": "-1"
        },
        {
            "review_text": "wake up Triggered  Play game triggered  see a man TRIGGERED 10/10 would Trigger Again",
            "review_score": "1"
        },
        {
            "review_text": "I had this game on its release on a different account and I have to say it's really fun with friends,and it really feels like your playing street basketball with friends! Now don't expect anything huge with graphics BUT! The gameplay is amazing! Dough it gets a little repetitive but they try to add content I just think they should add more modes other then 3v3.",
            "review_score": "1"
        }
    ]
}