{
    "app_id": 339800,
    "name": "HuniePop",
    "release_date": "2015-01-19",
    "developer": [
        "HuniePot"
    ],
    "publisher": [
        "HuniePot"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Nudity",
        "Mature",
        "Anime"
    ],
    "achievements": 20,
    "positive_ratings": 17761,
    "negative_ratings": 711,
    "price": 6.99,
    "description": "HuniePop is a unique sim experience for PC, Mac and Linux. It's a gameplay first approach that's part dating sim, part puzzle game, with light RPG elements, a visual novel style of presentation, an abrasive western writing style and plenty of &quot;plot&quot;.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/339800/header.jpg?t=1482628849",
    "minimum_requirements": "OS: Windows XP+ Processor: 1.2 GHz Memory: 2 GB RAM Graphics: DirectX® 9 Compatible Graphics Card DirectX: Version 9.0a Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fun game Pros: -The puzzles are the reasons to get the game  Cons: -having to explain to my roommate why implaying this game -having to exxplain to my grilfriend why implaying this game and why did i even buy it. -trying to convince people i only got it for the puzzles",
            "review_score": "1"
        },
        {
            "review_text": "What I've learned from this game:  - Dating and having sex does not become any easier with experience. In fact, it becomes much more difficult. - Chicks dig pretenders. Do NOT try to be yourself. Trust me, it's not gonna work. - It's completely OK to ask questions about weight and bra size. Girls expect you to do so. - There is little to no reason to ever have anything to do with someone you've already banged. Move on.  HuniePop is pretty much your regular light dating sim. You ask girls generic questions, they in return quiz you to find out if you've paid any attention at all and in the end, if done correctly, you've humped every girl in town. For some reason though it feels more fun than dating sims usually. I'm still trying to determine if it actually is more fun or am I just being fooled to think so.  If you've played any dating sim before, especially any western-made, you've seen most of this game already. First you're introduced with your mission to get down with every girl you meet. Sometimes it's because you're trying to win a bet, sometimes you're doing it just for the hell of it, sometimes you're getting revenge, and so on, and so on. This time the reason is a magic fairy who comes to your aid because you're a pathetic mess and need to get some poon-tang ASAP. Then you run rampant around the town meeting girls and memorizing trivia you learn from them. Wooing the girls can be made easier by handing them various obtainable gifts.  What's different in this game is dating. Instead of putting anything you've learned in actual use, you're playing a round of Bejeweled... Candy Crush... You know, that puzzle game where there's a board full of bricks of different colors and you're supposed to swap bricks to create lines of three or more of same color. You need to get certain amount of points and you have 20 turns to do so. If you succeed, date is successful and your prey likes you a little bit more. However, every time you win a date game, next date becomes more difficult with higher target score. You can improve your in-game skills to get point multipliers, but at some point you're likely to find yourself in a situation where every move has to be magnificent. There's no time limit though, and sooner or later you're gonna understand why.  Once you've managed to bend your target under your will, it's time to move to your bedroom. Again you're facing your nemesis, the bling-bling puzzle game, but this time it's slightly different. You have unlimited moves, but your score keeps running down to zero. In order to reach your target you need to score faster than your points decrease. During this your conquest stands next to you in her underwear moaning. It's rather peculiar portrayal of intercourse, I must say. It makes you feel like you're rolling all over the place like a tornado, trying to twist and tweak everything you can, as fast as you can. If you can conjure a hysteric state of mind at will, it will be extremely helpful.  The game is put together very well. Graphics are pretty, background music can run hours without becoming annoying and voice acting is a lot better than you would expect, although sometimes it's difficult to believe that every girl has their own voice actress. Girls have extremely different, yet quite stereotypical personalities. Dialogue varies from hilarious to awkward to annoying, so a lot, but thanks to voice acting you don't want to skip any of it (unless you really hate the girl in question).  There are some minor nuisances. Once you've done the deed with a girl, there isn't any reason to interact with her again. There are some minor details like costumes and hairstyles you can always try to unlock but nothing that affects gameplay and nothing that matters at all in any way if you're not gonna see that girl anymore, and again, why would you? Item inventory has less space than there are items to obtain. For some reason this becomes quite annoying, especially because there is absolutely no reason to limit the size of inventory. Also, there are Steam cards but no achievements. Personally I would've picked achievements over trading cards, but that's just me.  I still don't know for sure whether HuniePop really is fun or just masked as fun. I'm playing it hours at a time, but I'm not exactly sure why. It doesn't really bring anything new to the table. It doesn't offer anything I haven't yet seen. If you're familiar with dating sims this one is going to feel familiar right off the bat. I recommend this game, but ONLY if you like the genre or want to find out what dating sims are. Even though it's very generic, it's still very well made and an excellent example of a dating sim. If you've tried dating sims before and haven't liked them, this one is not gonna change that opinion.",
            "review_score": "1"
        },
        {
            "review_text": "  Family friendly Teaches good morals Strengthens values",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the whole family to enjoy.      Update: Played with family, NOT I REPEAT NOT, a good game for the whole family 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Got me banned from twitch.tv, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A Candy Crush game that you can bang Latino, Black, Asain, White, Neko and aliens girls by giving them gifts ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Came for the boobs, stayed for the match 3 puzzles.   Pro: -Nudity (that's why we're all here, isn't it?) -Cute puzzle game -Challenging at times  Con: -The story isn't really anything special, if you're into good story games I wouldn't recommend this -Can't play with family/spouse in the room  Solid 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Got banned on Twitch, still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "A kawaii lewd candy crush version filled with savage dialogue, hot girls and big, you know what I mean. A lot of big this and that. Want to get turned on by a game and laugh at the same time? Then this is probably up your alley. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the game your dad dreams of walking in on you playing",
            "review_score": "1"
        },
        {
            "review_text": "... ./:::::::::::::::::”,-,,::\\|”~-,,\\,:”~-\\”: :”-,::::/: :/:::,-“: :/::,-“/:::,-“:::/  ... /::::::::::::::::::/,__”-,\\: : ,,-~”,',-,: : :\\:/: :/:,-“,-~,”-,”:/:,,-“:,-//'  .. |:::::::::::::::::/:o:::o: :,,-“/ ,-“:\\.|: : : : “: -'”:/./,--,”\\.'|”/::::::|-“  ..|:::::::/:::::::::/::/|:::|.\\: : \\.|'| ;|..|.|: : : : : : : :|.||;;;|././:|:::|:::|  ...|::|:::|::::::::/::'-':::'-,': : '\\'\\'~'_/,/: : : : : : ,: :'-'-—-'~': |:|:::|  ...|::|:::|::::::::/::::|:::::'|: : : “' —: : : : : : : : : :\\: : : : : : /::'\\::|  ...|::|:::|:::::::/:::::|:::::'\\: : : : : : : : : : : : : : :': : : : : :/::::::|::|  ... \\:|:::|::::::|::::::|::::::|,: : : : : : : : : :__,: : : : : : :,-“:::::::|::|  ... .'\\|::|::::::|::::::||::::::\\'~,: : : : : : : :'--~': : : : ,,~”\\:::::::::|:/  ... ...'\\:|:::::|::::::/.|::::::|: : “~,: : : : : : : : ,,-~,”::::::'\\:::::::|:/  ... ... .\\\\:::::|”~,/-,|:::::::|: : : : —”~,-,,,-~”:::,,-'\\::::::::\\-_::|/  ... ... ..',\\,::|~--'-~\\:::::::|: : : : : : |::|,,-~”—..__\\::::::::\\.. .'|  ... ..,~”': : \\|: : : : : \\::::::|: : : : : : |—”'~~”~,”,: : \\:::::::|.. /  ..,-“: : : : : :|: : : : : :\\::::::|: : : : : : \\: : : : : : “~'-,:\\::::::|\\,  ..|: : : : : : : |: : : : : : |::::|,\\,: : : : : : : : : : : : : :”-,-\\::::|: \\  ..| : : : : : : : : : : : : : |::::|:'-,\\: : : : : : : : : : : : : : :”-'\\,|: :|  ...\\ : : : : : : : : : :'\\: : :\\:::|: : '\\'\\: : : : :~,,: : : : : : : : : “~-',_  ... \\: : : : : : : : : : :\\: /:|:/: : : :',-'-,: : : : : “-,: : : : : : : : : : :,/”'-,  ... .\\: : : : : : : : : : :\\|: |/: : : ,-“....”-,: : : : : '\\: : : : : : : : : ,/.....”-,  ... ...\\: : : : : : : : : : \\: |: : :/...........\\: : : : : |: : : : : : : ,-“.........'\\  ... ... .\\ : : : : : : : : : '\\': : /..............\\: : : : |: : : : : :,-“.............|  ... ... ...\\ : : : : : : : : : '\\:/.................\\: : :,/: : : : : /................/  ... ... ... \\ : : : : : : : : : \\....................\\:,-“: : : : :,/................./  ... ... ... ...\\ : : : : : : : : : \\,_.............._,”======',_..........,-“  ... ... ... ... \\,: : : : : : : : : \\: —”'~---~”: : : : : : : : : : :—”~~,'  ... ... ... ... ..'\\,: : : : : : : : : \\: : : : : : : : : : : : : : : : : : : '|: : \\  ... ... ... ... ... .\\, : : : : : : : : '\\: : : : : : : : : : : : : : : : : : :|: : '\\  ... ... ... ... ... ...\\,: : : : : : : : :\\ : : : : : : : : : : : : : : : : : |: : :\\  ... ... ... ... ... ... ..\\ : : : : : : : : \\: : : : : : : : : : : : : : : : :|: : : :\\  ... ... ... ... ... ... ...\\\\,: : : : : : : :\\, : : : : : : : : : : : : : : :/: : : : :\\  ... ... ... ... ... ... ... .\\\\ : : : : : : : :'\\ : : : : : : : : : : : : : :|: : : : : '|  ... ... ... ... ... ... ... ./:\\: : : : : : : : :'\\, : : : : : : : : : : : : |: : : : : :|  ... ... ... ... ... ... ... /: : \\: : : : : : : : : '\\,: : : : : : : : : : : |: : : : : :|  ... ... ... ... ... ... .../: : : '\\: : : : : : : : : :'\\,: : : : : : : : : :|: : : : : : |  ... ... ... ... ... ... ../: : : : :\\: : : : : : : : : : :\\, : : : : : : : : |: : : : : : |  ... ... ... ... ... ... ,/: : : : : : :\\: : : : : : : : : : '\\,: : : : : : : |: : : : : : |  ... ... ... ... ... ..,-“: : : : : : : :“-,: : : : : : : : : : \\: : : : : : :| : : : : : |  ... ... ... ... ... ,/ : : : : : : : : : :”-, : : : : : : : : : :\\: : : : : /: : : : : : /  ... ... ... ... ..,/ : : : : : : : : : : : : :”-, : : : : : : : : :'\\: : : :| : : : : : ,/  ... ... ... ... ,/ : : : : : : : : : : : : : : : “-,: : : : : : : : :'\\: : |: : : : : : /  ... ... ... .../: : : : : : : : : : : : : : : : : : “-,: : : : : : : : '\\: |: : : : : /  ... ... ... ../: : : : : : : : : : : : : : : : : : : : :“-,: : : : : : : \\,|: : : : :/  ... ... ... ,/: : : : : : : : : : : : : : : : : : : : : : :“-,: : : : : : :\\: : : : /'|  ... ... .../-,-,”,,-,~-,,_: : : : : : : : : : : : : : : : : “-,: : : : : :'\\: : :'|: |  ... ... ...|',/,/:||:\\,\\: : : “'~,,~~---,,,_: : : : : : : : : :'\\: : : : : :\\,: :|:||  ... ... ..|: :”: ||: :”: : : : : : :”-,........ ——”''~~--~|\\: : : : : : \\:|: |'\\  ... ... ..|: : : ||: : : : : : : : : : :”-,.......................|: : : : : : : \\|: |,”  ... ... ..| : : : : : : : : : : : : : : : :”-,.....................\\: : : : : : : :\\,|.|  ... ... ..| : : : : : : : : : : : : : : : :”-,\\....................,-“\\: : : : : : : : '\\”  ... ... ..| : : : : : : : : : : : : : : : : : :”-\\...............,/: : :\\: : : : : : : : :\\,  ... ... ..| : : : : : : : : : : : : : : : : : : : \\,...........,/: : : : '\\: : : : : : : : : |  ... ... ..| : : : : : : : : : : : : : : : : : : : : \\........./: : : : ,-~/: : ,: : |: :/: :|  ... ... ..'|: : : : : : : : : : : : : : : : : : : : : \\~”—: : : : : |: :|: : /: :/: ,/: :/  ... ... ...|: : : : : : : : : : : : : : : : : : : : : |: : : : : : : :”-,,_/_,/-~”:|”—  ... ... ...|: : : : : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : : : : :|  ... ... ... |: : : : : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : : : : |  ... ... ... | : : : : : : : : : : : : : : : : : : : : :|: : : : : : : : : : : : : : :/  ... ... ... .\\: : : : : : : : : : : : : : : : : : : : :|: : : : : : : : : : : : : : /  ... ... ... ..\\ : : : : : : : : : : : : : : : : : : : :| : : : : : : : : : : : : : /  ... ... ... ...\\: : : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : : /  ... ... ... ... '\\: : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : :",
            "review_score": "1"
        },
        {
            "review_text": "Watch out girls! Now i'm a master seductor!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good puzzle game. Even if your friends find it weird you're playing this game, it's still worth it  (To avoid talking to people who want to slander you for playing this game, I recommend going Offline.)",
            "review_score": "1"
        },
        {
            "review_text": "It was a gift i swear!",
            "review_score": "1"
        },
        {
            "review_text": "I play this game for the plot and it's great.  Although I haven't found the plot yet, I will continue to keep playing until I find it.  Edit April 25th, 2016: After playing for nearly 1000 hours, I still have not found the plot, but my hunt still continues!",
            "review_score": "1"
        },
        {
            "review_text": "This game has some quality gameplay. ( ͡° ͜ʖ ͡°)  Amongst other very nice things. ( ͡o ͜ʖ ͡o)",
            "review_score": "1"
        },
        {
            "review_text": "like Candy Crush but you get to ♥♥♥♥ girls at the end.",
            "review_score": "1"
        },
        {
            "review_text": "# Pros: 1. A good puzzle game. 2. Has a good diffuculty scaling system. 3. The art background music and sound effects are stellar. 4. Everybit of dialogue is fully voiced. 5. A fine visual erotic novel based dating sim. 6. Amusing charecters.  #Cons: 1. You pretty much need to check online to unlock all the girls because of the tricky manual to unlock 2 hidden girls.  2. Needed a bit more content. 3. The resolution of the game is kinda annoying sometimes.  #Conslusion: It's definitely worth the purchase as the gameplay is fine so it can show you a good time. ",
            "review_score": "1"
        },
        {
            "review_text": "I played 11 straight hours of Bejeweled: Hentai Edition  It was pretty great, if you like porn and bejewled (which I do, i guess)  10/10 GOTY candidate  Careful for tentai",
            "review_score": "1"
        },
        {
            "review_text": "HuniePop has possibly every type of girl or woman you see in fictional media (MILF, hot teacher, nerd, alpha-♥♥♥♥♥, girl-next-door, alien babe, etc), yep, you'll find them all in HuniePop.   And then, you suddenly realize the game is like Pokemon. You just gotta catch em all.",
            "review_score": "1"
        },
        {
            "review_text": "My two favorite things in life, Bejewled and Porn",
            "review_score": "1"
        },
        {
            "review_text": "wow anita sarkeesian was right we do need more games like this   2D girls really are the best type of girl",
            "review_score": "1"
        },
        {
            "review_text": "I banged a student. I banged her mother.  I banged her teacher.  I banged a woman who thought she was a cat. I banged a fairy. I banged a goddess.  And finally I banged an extraterrestrial being.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "    Met a girl     Took her on a few dates      One night before going to the Botanical Gardens, I gave her a bag of goldfish     Proceeded to feed her a whole cabbage and pumpkin pie     Brought her back to my place and had sex with her     Next morning, she gave me her panties and some graphic pictures of herself     She left, and then I got on my PC and launched HuniePop   10/10 would recommend ",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Girl asks me if I want to get high sometime &gt;bottom option is erryday WHY CANT THIS BE MY LIFE?!",
            "review_score": "1"
        },
        {
            "review_text": "I shouldn't have to work this hard to fap.",
            "review_score": "1"
        },
        {
            "review_text": "I play this too much... Thanks Sidearms xD",
            "review_score": "1"
        },
        {
            "review_text": " Pleasently surprised.",
            "review_score": "1"
        },
        {
            "review_text": "I tried to call the cops on a fairy, but she still won't leave.  Play the game with speakers so that your entire apartment complex can hear how good you are at waifus.",
            "review_score": "1"
        },
        {
            "review_text": "'Did you take an awesome class or something, you're awesome!'  .........i blush....every time...  11/10 best acting 2015",
            "review_score": "1"
        },
        {
            "review_text": "'♥♥♥♥ these birds. Am i right?'",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for 18 hours straight, with people watching me on skype.  I never knew up untill now how hard it is to masturbate without people noticing.  10/10 IGN 'like bejewelled with boobs'",
            "review_score": "1"
        },
        {
            "review_text": "Well well well..  So I thought this is just gonna be another simple boring game accompanied by anime-like girls. Fortunately to my suprise, the puzzle like aspect of the game is quite simply fun and engaging. Maybe I'm a little bit dumb but the puzzle is quite hard as more time put into it. The dialogues and voice acting had me cringe and laughing at first just because I usually hear Japanese VA on most games. So this is quite an experience that I find quite delightful. But in terms of replaybility, there's not much. Unless you want to unlock all the girl's hairstyles, and outfits, and also the complete the gifts gave to each girl. So I had quite a bit of fun with this game. Money well spent.  Overall I give it.. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "i misclicked and bought this, omg 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes, I look back on my life and speculate the point at which it all went wrong.   In the mean time, at least I can seduce these imaginary girls with my puzzle solving skills.",
            "review_score": "1"
        },
        {
            "review_text": "I play most of my games right-handed, lets just say, this game is an exception.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly run-of-the-mill in terms of adult content, nothing you wouldn't see on Rule 34 or something similar. The puzzle game itself is surprisingly addicting, though, and the characters are pretty enjoyable. My favorite character overall is probably Aiko, but Kyu is far and away the funniest of the bunch. If someone made a mod where she was voiced by John DeLancey (get it, Q, Kyu?), I think I'd die laughing.  The game revels in how politically incorrect it is. Every woman you meet is pretty much one or another stereotype (i.e. the good girl, the mega-♥♥♥♥♥, the catgirl, etc.), as Kyu herself is often quick to point out. Most of the women play their parts to such a straight degree that it's hard not to laugh, but Kyu's 'no fourth wall' conversations turn the whole thing into pure gold ('Come on, seduce me with your sexy puzzle skills!').  It isn't really possible to 'lose' at HuniePop, per se, but each successive puzzle gets progressively higher point requirements to clear it, and if you don't make the most out of each portion of the day (particularly the night portion), you can quickly find yourself falling behind the curve; even easy mode will start to give you trouble going into your second week. Thankfully, you only  have  to pass the first four dates with each girl to make progress, after which you're free to fail as often as you like.  Overall, it's a decent way to pass the afternoon. You're not gonna find the meaning of life in this game, but you will be entertained.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a guilty pleasure. Its fun, well made, and deliberately politicaly incorect. That it exists gives me hope that society may one day mature enough to stop dictating morality and arbitrary puritanical standards.   I'm all for ratings, as they inform consumers. I'm all for child controls as I believe in parental responsibility and authority. I don't agree with grown adults being told what they are and are not allowed to indulge in the comfort of their own home in their spare time.  With that said, its a desent match 3 RPG dating sim, and I sincerly hope to see more games like it.",
            "review_score": "1"
        },
        {
            "review_text": "Prime fap material here. Liked the match four more.",
            "review_score": "1"
        },
        {
            "review_text": "Was frustrated enough to wish a girl would stop moaning because it was distracting me from finishing.  12 times.  Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "After spending years plagued with the task of dealing with 3D girls, I have finally found a game that I can use as an example of why 2D girls will always be superior. They don't smell. They don't ask for much. All you have to do is give them love and affection and they will return in kind. I haven't left my house in weeks because 2D girls don't ask you to go to work or take them out or shower. All you have to do is be there, in front of the screen with your dakimakura and masturbatory tool of preference and you will be set. I finally know what true love is. I just wish my mom would stop knocking on my door. I mean, I'm 20 for Kami-sama's sake. I know what I'm doing with my life. She's such a baka gaijin. Thank you, HuniePop. You have changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "This game is cheaper than a girlfriend 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I used to be made fun of and called a nerd and thought I would never get a girlfriend. Now I have 4 girlfriends and we had a five way. This game changed my life.   ",
            "review_score": "1"
        },
        {
            "review_text": "I told an MILF that her ♥♥♥♥ are '10 outta 10' and laid her later on...  Well THATS a 10/10  PS: If you dont live alone, either close your door safely or play at night AND use a headset, those moans of the girls are ...well...you know",
            "review_score": "1"
        },
        {
            "review_text": "My family always seemed to look down on me simply because I wanted to explore and experience the magic and culture of nippon (that's japanese for Japan). They always tried to get me involved in more 'western' attractions like theme parks and shooting games. This used to bother me, but after discovering HuniePop I realized that I was not alone. There are thousands, no, millions of people like me who prefer the 2d to the 3d. I truly believe that the paradigm of beauty has shifted and that the 2d is slowly starting to become more mainstream. Unfortunately, not everyone can be as open minded as I am (atheist, like all sorts of music but mostly jazz and indie-pop). These people are trolls and haters who try to make me and people like me feel horrible for being who we are. They say that watching 2d sex videos is weird, but I know that I am allowed to be who I want. I also identify as a half wolf (I prefer to be alone, and value intellect over all other things in the material world.   But enough about me, here's my review.  PROS:  -Lots of pretty anime ladies -2D -Realistic simulation of romance (I mean true romance not the fake love that you experience with 3D girls, who think that they're better than everyone else) -Let's you meet likeminded gamers  CONS:  The only con that I can think of is that it doesn't let me fully customize my character as a half demon wolf-boy.   10/10 I highly recommend this game to anyone who loves Highschool DxD",
            "review_score": "1"
        },
        {
            "review_text": "The ultimate game?  The voice acting is awesome, it's a very intelligent dating simulator with unique and interesting puzzle mechanics. You can tell they went over this game with a fine toothed comb and smoothed out everything possible.   Everything about the game is AAA quality. I have not logged much time at all, but I can see it has a pretty deep storyline and there is a lot of things to do. You have to figure out all these things about these girls from their favorite foods to their ♥♥♥♥' cup sizes. And I presume the game's goal is to have your way with as many of them as possible.   You will especially like it if you are a fan of match-3 games (like Bejeweled, Zoo Keeper, etc) as this uses the match-3 puzzle mechanics for when you are not talking to people or doing other activities. It's more than just playing a match-3 though, each piece does different things and you have to come up with new strategies even if you are already a pro at those types of games.   Do not hesitate, you need this in your library.  10/10 all day long.  Update 1: These girls are hungry. And I paid $300 for this frizz-bee and you don't even want it??",
            "review_score": "1"
        },
        {
            "review_text": "I used to be one of the legendaries Meme Master Now im the Waifu Master  69/10 Would ♥♥♥♥ an alien again",
            "review_score": "1"
        },
        {
            "review_text": "If Life Was that Easy. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm now a lesbian",
            "review_score": "1"
        },
        {
            "review_text": "Meet'N'Fu-ck Bejeweled. My cook is on fire!",
            "review_score": "1"
        },
        {
            "review_text": "** I am a girl &gt; Sits on the stairs cause nephew kicks me out of the room &gt; Starts playing HuniePop &gt; Father walks up the stairs &gt; Looks at the game &gt; Father looks at me &gt; I smile and wave bc Madagascar Penguins taught me so &gt; I banged ♥♥♥♥♥es  PRICELESS  In all honesty, if you're perverted and into animated hot girls, like I am, 9/11 would smash again. It's fun, interesting, sexual, and keeps me on the edge man, I feel like you guys enjoy this better than a girl would, so i'm pretty jealous with that, but oh well, ♥♥♥♥♥ hot, I like it.  Did I mention my boyfriend bought me this? Yeah he regretted it after because I was so intrigued with the game rather than with him.",
            "review_score": "1"
        },
        {
            "review_text": "MY FRIEND BOUGHT ME THIS GAME I SWEAR",
            "review_score": "1"
        },
        {
            "review_text": "Popped hunies and solved sexy puzzles 11/10. Tiffany best hunie.",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly addictive. I mainly got it for the match 3 game, but quickly found out that it's really simplistic and truth be told not very exciting. There is just something about how the Dev managed to combine both the dating sim (which I am not usually a fan of) and the match 3 game types together that just makes it work. I started the game thinking I would only play it here and there to pass some time, but then I realised 4 hours went by.  There is nudity however which is probably a benefit to the game. Especially with the uncensor patch cause without it the game would be pretty stale. The nudity is only there however when you are pretty far along with dating the girls so there is a bit of playtime involded before you get to it.",
            "review_score": "1"
        },
        {
            "review_text": "HuniePop, a dating simulator where you impress the girl using your match-three, Bejeweled or Candy Crush skills. Match accordingly to the girl's most preferred traits and try to avoid her least preferred traits whenever possible. Make sure not to match the broken hearts!  Sounds: The voice acting is all right.  Music/Soundtrack: The music gets sort of repetitive over time.  Addictiveness: It's pretty addictive if you are into match-three, Bejeweled or Candy Crush type of games and are into weird anime stuff.  User Interface: I'd say the user interface is pretty good for a dating simulator game like this. However, I had to run the game  Windowed  as opposed to my preferred  Full-Screen No Border  as for some reason the visuals in both left and right sides get messed up if I happen to force it to run full-screen no border.  Story: It's about you dating more and more girls through the power of match-three and trying your best to not let them know you're cheating on them.  Gameplay: You just play the game as how you would play a match-three game, Bejeweled or Candy Crush, except it's sort of mixed with some Visual Novel gameplay. However, you are given  date gifts  and  traits  that are meant to help you out during the match-three gameplay.  Characters: The characters in HuniePop are somewhat an exaggerated version of realistic personalities. You have the cute, pure and short girl everyone likes. There's also the ♥♥♥♥♥y, hot and ♥♥♥♥♥♥-bag girl every guy likes. Then there's you, the perverted weeaboo who decided that you don't have the courage to ask a guy/girl out on a date in real life and decided to play this game.  Enjoyment: ( ͡° ͜ʖ ͡°)  At the time of posting this review, it is 26th of June 2015 and I have 10 hours played with a 66% progression on my save game. I will edit accordingly as I read feedback, put more time and progress further into the game.",
            "review_score": "1"
        },
        {
            "review_text": "All those times I played candy crush finally paid off, now I can have those anime waifus",
            "review_score": "1"
        },
        {
            "review_text": "Great game for horny neck-bearded predators that wish for their blood siculation to be slighty weaker. Over all a quality purchase.",
            "review_score": "1"
        },
        {
            "review_text": "FIrst Let me say stright out of the gate;  Don't listen to any of the professional reviews or reviewers (i think we know of a couple famous ones so far mentioned by the creator of this game), they don't know good satire and comedy even if it slapped them right in the nads  This game is pretty damn great, albit the steam version is censored it's still fun. lots to do, the puzzles get nasty (not porn wise you perv) when put on hard mode (insert d!ck joke here) And while i have not unlocked them yet theres rumors to be quite a few more unlockable beauties to have fun with later on.  EDIT; Ok so had my first sexual conquest (i play the uncensored version) The bedroom game is INSANE. thats all i Have to say on that, you'll see when you get there, the one time you'll need to be a minute man, HA!  So far I really like this game, keeps your attention, the art style reminds oneself of kawata shoujo (you'll start noticing when you start building relation &lt;3's with the girls) And it has i would say a just above par replayability because A. Puzzles and B. Styles/Hairstyles/Items of the girl  Found 3 of the 4 unlockables, how you earn hunie points with them is neat, it's like a memory game to boot lol",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit, I purchased this because I'd seen the Let's Play videos of ths game and because the premise was just so ridiculous that you couldn't help but have your curiousity piqued. There are some reviews/coverage out there that paints this game as being an insult to women, but I didn't entirely see this. I suppose that to a point I could see where some are coming from with that, but any sexism was definitely not intended.   Your enjoyment of this game will ultimately boil down to how much you like games like Bejeweled since that's really the main thrust of the game (no pun intended). The dating sim aspects are somewhat weak and mostly there to string together the various game levels for each girl and give you power ups. The story is probably the weakest part of the game and probably why the charges of sexism are even being levied, since there really isn't a lot to these women other than their datability. While yes, this is an aspect of datings sims to a degree, the good dating sims give you a chance to become at least slightly emotionally invested in the characters. I didn't really get that feeling with this game's characters- not even the person we're supposed to be portraying.   Some of this I can handwave away by this being a 'first game' that was funded via Kickstarter. The learning process is always a rough one and for this to be the developer's first official game and sorta dating sim (that I'm aware of) it's a pretty darn good one since there are no visible glitches or errors that interrupt gameplay. I'm aware that there wll be a second game and I hope that the developer brings in more character development since that was something that was sorely missing with this game. The dating sim aspect was no risk and while I didn't entirely mind that, I did want to see more interaction with the characters and more development. This game had a lot of potential and while it lives up to that on the matching game end, it was sorely lacking on the dating sim angle. I think that more character development, the ability to have some slight risk (like being caught with another girl means that you can't date one or both girls for a set period of time), and the ability to choose a Final Girl would have improved this greatly and would be great to have in the sequel.   Ultimately I'd recommend this, but not to anyone looking for a more involved dating sim or one with any true storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This game is making something pop alright...",
            "review_score": "1"
        },
        {
            "review_text": "To be perfectly honest, this is the first game I've ever purchased on Steam; account authentication requires you to buy $5 worth of items to chat, and the deluxe edition was on sale for $5.09 during the Thanksgiving sale, so it worked out.  Sure, a lot of my friends may refer to this game as a 'DON'T DO IT', or a 'WHY!?!?', but the reason I logged 40+ hours into this game isn't really the girls at all- it's the core gameplay. The puzzles.  I never thought I'd get into Match-3 titles, especially seeing how my mom adores Candy Crush. I even tried a few of her levels, and it... wasn't satisfying. Popcap's original Bejeweled didn't cut it either, since the gameplay felt too ordinary and unadventurous. Huniepop teeters on an interesting trek since the developers decided to implement their own take on the Match-3 system, and rather than cut boosters entirely, they're gained through gameplay by earning 'Sentiment' points by matching specific sets of tokens, rather than buying the boosters before playing. A huge step up from mobile Match-3's.  If you like Match-3 games, give this a shot. There may be some uncomfortable moments here and there, but from what can be observed, Huniepop is (imo) the best Match-3 in recent memory. Consider purchasing it during a steam sale, since the price for the standard version can go down to 3 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. This game is so self-aware of the type of game it is and it makes such a great experience. As a child growing up playing a lot of flash games (including the ones that I wasn't allowed to play at certain ages), I felt as if this was one big send up to all those flash games you can find on the Newgrounds Mature section. Everything about this game is just amazing. From the soundtrack to the designs. 10/10 would always play again!",
            "review_score": "1"
        },
        {
            "review_text": "How to Get a Girl to Like You Simulator 2015",
            "review_score": "1"
        },
        {
            "review_text": "This is the hardest Bejeweled I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "ive lost all dignity, all hopes of ever being a man, i can feel the neckbeard growing as i type this out.    10/10 would play hentai dating game again",
            "review_score": "1"
        },
        {
            "review_text": "Lets see where to begin.... Well lets start with the obvious, puzzles and porn, two things that never in a million years would I have thought that they could be mixed together but this dev did it, and quite successfully too. Huniepop delivers on what they advertised on steam, and along with the devs generously providing the means to get the uncensored version of the game, I would say it is worth the money and time.  This game does have a few weaknesses though, especially for those whom have never played a puzzle game before, or don't find puzzles to be very compelling. (like me).  The game's tutorial is rather light on teaching a new player on how to effectively match the pieces, to say nothing of teaching how to pull off a 'multiple combo' in which a player can clear a good portion of the board at once, for me its still seems like random luck despite playing it for 12 hours. A tutorial that details that aspect of getting the most out of your moves would be welcomed. Easy mode could also be more 'easy', don't underestimate my utter lack of skill when it comes to puzzles.  Another issue is the lack of interaction choices with the various women in the game, its the same three questions, (And same greetings) despite the fact you have asked (Or met) them before. They certainly do not change based on their relationship with the player either. And while yes this game is  not  meant to be a serious dating sim,(More on this later) a small amount of effort put here by the devs would be welcome.  Now as for the 'plot'. I will say right now that I  have not completed the game, nor have I unlocked all the characters , so I could very well be missing something very big. That being said what I have seen so far passes off as bare minimal at best, and that  surprisingly is a good thing , since this game seems more like a  spoof  on the dating sim genre and plays on some of the various tropes, and sterotypes quite well, and seems to poke fun at itself too.  Those of you looking for a more serious dating sim would do well too look elsewhere.  Now for what everyone has been waiting for.... the 'pictures' are done very well, (could stand to have more for each character though, but thats just my personal gripe.) The voice actresses are also surprisingly good as well.  Well I think that everything that needs to be said about this game, its good for what it does, its  not  a bad game by any means but at least for  me , the one who sucks at puzzles, I don't know if the promise of new characters, more nude pictures, and possible plot is enough to persuade me to continue 'grinding' through increasingly difficult puzzles for a set of three to four pics, even if they are well done. Though I am sure I will attempt to progress from time to time.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone in my house thinks I'm alone in my bedroom playing on the computer, but they don't know that actually I'm ♥♥♥♥ing 8 random girls, a fairy, a goddess, a cat girl and a sexy alien. Game of the ♥♥♥♥ing millennium. ",
            "review_score": "1"
        },
        {
            "review_text": "It's even better when Kyu is aware I'm trying to get in her panties. 10/10 would fail Bejewled again.",
            "review_score": "1"
        },
        {
            "review_text": " This game is just fantastic.  I cannot recommend it enough; it is brilliantly done. The artwork and music are great, and it is  really, really  fun to play. It has just the right amount of perviness too - which I believe is essential to any great dating simulator. The devs seem outstanding as well. They added free content for Valentines Day, and I believe there is a DLC planned (sign me up!).   Its only February, but I can honestly say this is the best game I have played so far in 2015 (I am sure it won't be game of the year, but I am just saying).   Give this a try - you won't be dissapointed. Easily gets 10 hours of playtime.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game out of a naive curiosity for anime dating simulators. I peered over the edge of the rabbit hole and have come back a changed man. What is this? What is this? What is this? What is THIS?      What am I doing with my life?     Embrace me waifus! Embrace me!     I cry softly into my body pillow.      Match 3 aspect is fun and scales well.",
            "review_score": "1"
        },
        {
            "review_text": "  The fairy got excited with my picking up skills and decided to try some. I was totally nailing the fairy, she was moaning in pleasure as I moved all the correct pieces. She was moaning so loud. I started to get excited and yelled dirty words at her. My mom came to the room and screamed, I told her to gtfo because I was totally having my way tonight. She slapped at me and disconnected the computer. I stood up. I had my wiener outside. She was yelling at me. Then dad came, dad also yelled at me and told me I was the disgrace of the family. They wont let me use the computer anymore. I am crying now, my pillow is soaked with my tears. I couldnt give the fairy pleasure.",
            "review_score": "1"
        },
        {
            "review_text": "─▄▀▀▀▀▄─█──█────▄▀▀█─▄▀▀▀▀▄─█▀▀▄  ─█────█─█──█────█────█────█─█──█  ─█────█─█▀▀█────█─▄▄─█────█─█──█  ─▀▄▄▄▄▀─█──█────▀▄▄█─▀▄▄▄▄▀─█▄▄▀   ─────────▄██████▀▀▀▀▀▀▄ ─────▄█████████▄───────▀▀▄▄ ──▄█████████████───────────▀▀▄ ▄██████████████─▄▀───▀▄─▀▄▄▄──▀▄ ███████████████──▄▀─▀▄▄▄▄▄▄────█ █████████████████▀█──▄█▄▄▄──────█ ███████████──█▀█──▀▄─█─█─█───────█ ████████████████───▀█─▀██▄▄──────█ █████████████████──▄─▀█▄─────▄───█ █████████████████▀███▀▀─▀▄────█──█ ████████████████──────────█──▄▀──█ ████████████████▄▀▀▀▀▀▀▄──█──────█ ████████████████▀▀▀▀▀▀▀▄──█──────█ ▀████████████████▀▀▀▀▀▀──────────█ ──███████████████▀▀─────█──────▄▀ ──▀█████████████────────█────▄▀ ────▀████████████▄───▄▄█▀─▄█▀ ──────▀████████████▀▀▀──▄███ ──────████████████████████─█ ─────████████████████████──█ ────████████████████████───█ ────██████████████████─────█ ────██████████████████─────█ ────██████████████████─────█ ────██████████████████─────█ ────██████████████████▄▄▄▄▄█  ─────────────█─────█─█──█─█───█ ─────────────█─────█─█──█─▀█─█▀ ─────────────█─▄█▄─█─█▀▀█──▀█▀ ─────────────██▀─▀██─█──█───█",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░▄▄▄▀▀▀▄▄███▄ ░░░░░▄▀▀░░░░░░░▐░▀██▌ ░░░▄▀░░░░▄▄███░▌▀▀░▀█ ░░▄█░░▄▀▀▒▒▒▒▒▄▐░░░░█▌ ░▐█▀▄▀▄▄▄▄▀▀▀▀▌░░░░░▐█▄ ░▌▄▄▀▀░░░░░░░░▌░░░░▄███████▄ ░░░░░░░░░░░░░▐░░░░▐███████████▄ ░░░░did░░░░░░░▐░░░░▐█████████████▄ ░░░░░i░░░░░░░░▀▄░░░▐██████████████▄ ░░░░hurt░░░░░░░░▀▄▄████████████████▄ ░░░░░your░░░░░░░░░░░░░░░█▀██████▀▀▀▀█▄ ░░░░wh×re░░░░░░░░░░░░░▄▄▀▄▀░▀██▀▀▀▄▄▄▀█ ░░░░░feelings?░░░░░░░▄▀▀▀▀▀░░░░██▌ ░░░░░░░░░░░░░░░░░░░░░░░░░░░▄▀▄▀",
            "review_score": "1"
        },
        {
            "review_text": "How to date girls according to this game: Gift them racial stereotypical gifts. Press the pink button that appears next to them, to go on a date. Play Candy Crush on your date. If you're good enough at Candy Crush you might even get to bang them. Rinse (or don't) and repeat.",
            "review_score": "1"
        },
        {
            "review_text": "I play this on offline mode",
            "review_score": "1"
        },
        {
            "review_text": "Great wank material",
            "review_score": "1"
        },
        {
            "review_text": "ima girl and this is my favourite game. not even lesbian.",
            "review_score": "1"
        },
        {
            "review_text": "I'm so sorry Franku...anime is my life...I LOVE ANIME!!!",
            "review_score": "1"
        },
        {
            "review_text": "I am addicted to the puzzle aspect of the game and my freind kept saying that I wasnt until he played. He added three hours to my play time. Watching porn with freinds is now ticked off the bucket list. 19/10",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for 17 hours within the last 2 days.   O.O",
            "review_score": "1"
        },
        {
            "review_text": "5/5 Definetly worth playing.   - Puzzles are challenging. - Really like the sarcastic humour. - Racist remarks from your lovely fairy friend.  You're probably gonna have some hard time trying to explain why you're pla... why bother, It's a good game!",
            "review_score": "1"
        },
        {
            "review_text": "this game is probably one of the biggest regrets i've ever had, or will have, in my life, and has made me painfully aware of the pointlessness of reality. humanity is a failure",
            "review_score": "1"
        },
        {
            "review_text": "Game distracts my bisexual girlfriend so I can read Ayn Rand 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Now I keep getting suggestions for other hentai games.  WHY!! I only ever bought one! And it was just for the puzzles! Honest!",
            "review_score": "1"
        },
        {
            "review_text": "I applaud the guy who thought of 69% sale.",
            "review_score": "1"
        },
        {
            "review_text": "great for a quick wan- fun game to play",
            "review_score": "1"
        },
        {
            "review_text": "I've never played a game that kept me entertained well into the night to the point I could only think about completing it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, download the de-censorship patch!   Very fun, very worth the money!  (also, you'll need a hand free when playing this game, if you feel me)",
            "review_score": "1"
        },
        {
            "review_text": "I DONT EVEN KNOW WHAT THIS IS THANKS FOR THE GIFT VAMPY YOU WEIRDO  its actualy quite good but i feel dirty as ♥♥♥♥ from haveing this in my libary of games or haveing played it .....or knowing it excists also im bad at it so its a very good sim really much better than euro truck or football manager cause in those i can do both very well where as in this i cant complete any date at all.  10/10 fully voiced just like fallout 4 game of the year ",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best experience of my life. Was worth getting banned on twitch 100%.",
            "review_score": "1"
        },
        {
            "review_text": "The more I play this, the more lonely I get.  Nonetheless, it's a fantastic game ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, and i would recommend it. Just don't stream it on twitch. Steam failed to show the rating of this game (which is AO).  I learned about this the hard way, and seeing as how i bought it off of steam i thought it was an M rated game.  I do recommend this game, it's fun and funny. JUST DON'T STREAM THIS ON TWITCH OR YOU WILL BE BANNED.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly? This game is very good.  Let me be honest: I bought this because of 'LOL, anime boobs LOL'. But below the shallow Anime Dating Sim lies a pretty good and sometimes challenging Puzzle-RPG with a great progression system, that lets you convert the points you earn from the puzzles into other points that you can use to upgrade your skills. This allows you to persist in the following, even more challenging puzzles and adds a factor of resource management to the mix.  All in all, a pretty good 'Don´t judge a book by it´s cover'-Game.",
            "review_score": "1"
        },
        {
            "review_text": "Audrey a best",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - You can play this game with one hand - Variety of waifus from asian (jap) to milf, young milf, loli to gamer, you name it - uncensored game with the help of 18+ patch of course - have total of 12 girlfriends for you to date which you probably won't be achieve in real life  Cons: - your parent will be disappointed - friends will mostly likely unfriend you if they find out you have this game",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this! I can play with one hand!",
            "review_score": "1"
        },
        {
            "review_text": "Extremly fun and enjoyable to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "The uh... puzzles are pretty uh.... good",
            "review_score": "1"
        },
        {
            "review_text": "I never played a game that manipulated me in more ways than one",
            "review_score": "1"
        },
        {
            "review_text": "At least now I can say that I've had sex with multiple girls by playing match three while trying to remember what their favorite season is.   I really should've studied for my exams.   ",
            "review_score": "1"
        },
        {
            "review_text": "While the gameplay is repetitive....BEWWWWBBSSS",
            "review_score": "1"
        },
        {
            "review_text": "This game... where do I start? the story was briliant!! It touched my heart almost as much as I touched myself!! 69 out-of 69 #GOTY2015",
            "review_score": "1"
        },
        {
            "review_text": "It's a real game. One of the more entertaining sims I've played. Also this puzzler can actually get intense at times. Can we get a mobile version?",
            "review_score": "1"
        },
        {
            "review_text": "I know it just looks like another porn game made for a quick buck based on the screenshots, but HuniePop actually contains a lot of depth. Most games treat match-3 puzzles like filler gameplay, but HuniePop makes it fun and strategic. If you don't have a stick up your ♥♥♥, you'll likely find the writing pretty funny and engaging. This game can be an easy time sink, and it's quickly become a big favorite of mine.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game if you're not interested in the plot. It can get frustrating at time but overall I enjoyed this a lot and I'm looking forward to the next HuniePop game.",
            "review_score": "1"
        },
        {
            "review_text": "I normaly play games with my right hand, But this game is a exception",
            "review_score": "1"
        },
        {
            "review_text": "I give it 9,5 'What's shakin' bacon?' outta 10.",
            "review_score": "1"
        },
        {
            "review_text": "Like skyrim with Bejeweled and Hentai",
            "review_score": "1"
        },
        {
            "review_text": "this is actually a pretty quality game considering it's basically a cheesy anime girl dating sim. whether or not you like it or like to make fun of it, it's somewhat fun and can definitely keep you engaged as a little game to play on the side when you're bored(bonus hot chicks and boobs and all that jazz) or you're a loser of any gender looking to masturbate to anime girls, this game has a nice little amount of content(such as using 'date presents' as powerups or giving the girls new hairstyles and clothes and stuff) for any casual gamer looking for a mix-n-match type game coupled with some actually really gorgeous animu(sometimes pr0n) art.  8/10 forgot to get the uncensored patch",
            "review_score": "1"
        },
        {
            "review_text": "Since this game I think about connecting tokens when making sweet love to my girlfriend.",
            "review_score": "1"
        },
        {
            "review_text": "A game about conquering some Anime reproductive organs, with the help of your silver tongue and bejeweled.. Reality has never been closer.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 great guide on how to get it in on the first date",
            "review_score": "1"
        },
        {
            "review_text": "ITS LIKE POKEMON. gotta get all the panties. and i will tell you now i am a pokemon master ;)",
            "review_score": "1"
        },
        {
            "review_text": "The best dating simulator I have ever played, and i've tried them all.   Graphics: 5/5, the gui is amazing compared to other dating sims, the girls even have voice actors and their mouths move! That was mind blowing for me.   Story: 4/5, it's the usual dating sim plotline - get the girls in bed, but i'll add that you can get ALL of them in bed, which is amazing.   Characters: 5/5, all unique, diverse, and they actually have personalities, they're not just the regular schoolgirl with little quirks.   You can even be a girl, which is a pretty huge step considering most dating sims feature a male protagonist. On top of everything else, the main 'game' of the game (ie dating minigame) is actually quite hard. It takes planning, skill, and technique. You can fail a date multiple times, or get lucky, or use date items to help you out.   This game is a parody of all dating sims, and ends up the best one of all.   9/10 - only complaint is a minor one: i'd like to be able to have a name, or a face to my character.  ",
            "review_score": "1"
        },
        {
            "review_text": "A light hearted romp with lovely females abounding in your virtual life...... what's not to like?  If you like puzzles and if you are an Otaku or a fan of Anime, HuniePop should be right up your alley. If you like cute and if you like girls, theres lots to like.   Visually, HuniePop is lovely, with rich backgrounds that compliment the detailed characters. The scenes don't not feel cheap or rushed.  I really have enjoyed playing, thus far, though still shy of the 100% mark. Looking forward to switching genders for the second run through.....   There appear to be some haters, but, go figure. Someone will always hate something. If you hate it, don't buy it. Just, PLEASE, leave the rest alone.   As for being porn; the Steam version shows some semi-nude and nude (gallery pics) Anime characters, shows some panties and breast, and has puzzle sound effect that simulate pleasurable sounds from sex. No intercourse is shown. No genitalia. I don't see porn. Get over yourselves. A bit of virtual titillation isn't a bad thing. But, really, if sex didn't happen, no one would be reading this.....  Some critics harp on a lack of character development. Characters could possibly use some more development, but, this isn't an 80 + hour VN, and as it stands, the girls all have distinct personalities and do add conversation bullets as you progress in the game. Kyu, Audrey and Aiko have some lines that really crack me up! Sure, one could hope for deeper relationship possibilities, possibly even some jealous drama, but that might just take away from the charm of HuniePop as it stands.  Keep it light and lovable! Great game!",
            "review_score": "1"
        },
        {
            "review_text": "What I've learned so far.    Turns out faris are real and you find them at a bar or night club   It's 100% cool to ask a woman her age and breast size   It's OK to date multiple women at once   It's good to get a woman drunk before asking her questions or taking out her   Dating is nothing but a form of a match 3 puzzle   What I've learned when putting those into practice.    No sexy fairy showed up about my love live, even after wondering around multiple bars and night clubs   When asking a woman for their age and breast size and it's your first time meeting them, 5 out of 10 would slap you   It's really hard to keep all the women in line and you start calling a chick by someone elses' name, so you get slapped and dumped because of it   Apparently it's considered date ♥♥♥♥ for getting a girl all drunked first before taking her back to your place   There's no match 3 puzzle on the actual date and you're on your own   This game has destroyed my life.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "All I really want is girls And in the morning it's girls 'Cause in the evening it's girls  I like the way that they walk And it's chilly to hear them talk And I can always make them smile From White Castle to the nile  Girls, to do the dishes Girls, to clean up my room Girls, to do the laundry Girls, and in the bathroom Girls, that's all I really want is girls Two at a time, I want girls With new wave hairdos, I want girls I ought to whip out my,  girls, girls, girls, girls, girls Girls, girls, girls, girls, girls Girls, girls, girls, girls, girls, girls, girls, girls, girls Girls, girls, girls, girls, girls Girls, girls, girls, girls,  girls, girls, girls, girls, girls Girls, girls, girls, girls, girls Girls, girls, girls, girls,  girls, girls, girls, girls, girls Girls, girls, girls, girls, girls Girls, girls, girls, girls,",
            "review_score": "1"
        },
        {
            "review_text": "I have 5 main reasons to play this game: 1. Boobs 2. Puzzles 3. Soundtrack 4. Boobs 5. Even more boobs",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good, makes you actually think about puzzles, the girls can't deny my feminine wiles (even though I'm playing as the guy character). Also Nikki is too much like me, send help.",
            "review_score": "1"
        },
        {
            "review_text": "Since you only need to use your mouse to play this game....let's just say both hands were still used :3  10/10 would FOREVER buy DLC to this game if they make some.",
            "review_score": "1"
        },
        {
            "review_text": "HuniePop... some people still think i'm weird because i play this and enjoy it  !!!STEAM VERSION IS CENSORED!!!  - Match-3 in this game is a blast, highly strategical(if you want some casual fun or just enjoy the dialogue play on easy) - Decent gameplay besides the Match-3 - Nice Artstyle, though lacks a lot of options(resolution for instance) - Good Soundtrack, for each location a different track that fits perfectly - Extremely Funny writing/dialogue, i will never forget 'Thats a Supremely Nice set of ♥♥♥♥, Ten outta Ten' - Decent Amount of secret characters and unlockable stuff for the Girls  I'd rate 9/10, this game is really good.",
            "review_score": "1"
        },
        {
            "review_text": "I legitimately expected nothing from this game. I've just played for eight straight hours and beaten it.   And then I finished the game.",
            "review_score": "1"
        },
        {
            "review_text": "very good game! easy to pick up and fun to play",
            "review_score": "1"
        },
        {
            "review_text": "The Gem matching is challenging so I like it.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT LOVE IT LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "So, my history with hentai-date-sim games goes back to Newgrounds and the likes of 'Simgirl' and 'Ganguro Girl'. In regards to the elements that are common between all the games in that particular genre, HuniePop is neither better nor worse than all the others that have come before it; if the formula isn't broken, don't fix it, just make it shinier and with higher production values.  Perhaps the strangest thing about HuniePop is that once you get past the, 'Yay! Boobies!' facet of things, you will probably discover that the actual game portion of the game is pretty great. While essentially a standard 'match 3' type of mini-game, there is a surprising amount of strategy to be found when you start to factor in the various 'date gifts' and how they interact with the simple nature of the system.  For anyone that is playing this game just because of the ecchi element, I'm reasonably certain there are a thousand more efficient ways of getting your porn fix than by playing a casual puzzle game. If you initially came (pun intended) for the jiggly-bits, then stick around and give the game the scrutiny it deserves by trying Alpha Mode; you'll learn to get a lot better at matching tiles really quick, or get laughed at by hot anime girls... Either way is a win in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more hot gamer grills Banged twice the amount of girls in this game in one day. 69/10 needs more panties ",
            "review_score": "1"
        },
        {
            "review_text": "very great game to me but my cousin said he wished it show every thing if you know what i mean. but other than that the game is great ",
            "review_score": "1"
        },
        {
            "review_text": "Anime game for Linux - 10/10. Can be uncensored easily with the official patch. Must have for a lonely nerd.",
            "review_score": "1"
        },
        {
            "review_text": "So, this game is not for fap, it forces you to just play the game forget about the moaning and stuff.  &gt;Gets to after sex  &gt;Instantly presses X &gt;Because there's nothing to see &gt;Finished the game without getting a boner &gt;I am gay  Please, I want the protagonist's D O N G.SHOW IT TO ME.",
            "review_score": "1"
        },
        {
            "review_text": "I freaking love this game. It's a nice time sink with some great art. The dialogue is hilarious at times, and playing it reminded me of other, similar games I haven't played in forever. A great pick up!",
            "review_score": "1"
        },
        {
            "review_text": "I launch a different game before I start playing this game to hide my autism 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I swear i bought it for the story and gamplay!! (damn it badges don't work here)",
            "review_score": "1"
        },
        {
            "review_text": "HuniePop is one part dating sim and one part match-three puzzle game. What makes the game genius is how each of these two systems intertwine. Talk to girls to get Hunie, which you can use to buy upgrades for your puzzle skills. Play puzzles to earn Munie to buy the girls gifts/food/alcohol. The different colored orbs during the puzzles all correspond to different personality traits, which each girl will respond differently to. Buying girls especially good gifts will unlock special 'date gifts', which vary widely in effect, that you can equip and use once per puzzle.   Basically, HuniePop is every dating sim trope refined to a tee, and then perfectly intertwined with a deeper version of Candy Crush. No action feels pointless, there are plenty of secrets to find, and by the time things could potential feel like a grind, you've already gotten your money's worth.   Among the best dating sims I've played. A must-play for any fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "fun game addicting for so many reasons.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot believe you've bought me Bejeweled: Maximum Weeaboo Edition, Matt.  I hate you.",
            "review_score": "1"
        },
        {
            "review_text": "great game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Got it from a freind as a joke, ended up playing it with him for 10 hrs. 5/7",
            "review_score": "1"
        },
        {
            "review_text": "I heard the voice of a breast god, she offered me the chance to fondle so i had no choice! You see children when papa bear has to crack the code to access the sacred gardens for that honey pot, there ain't naught that can stop him.",
            "review_score": "1"
        },
        {
            "review_text": "Ah Huniepop, when you want to play an erotic dating sim but you're in a puzzle-solving mood. 12 total girls, 10 to 20+ hours of regular gameplay and some nice tatas. Although it's a nice, subtle relaxing games, there are flaws. (WARNING: I only cover the flaws here, I look at the negatives too often, please do not believe I think this game is ♥♥♥♥, because it's not, it's weird and fun :D) - No colorblind mode: This is a bit of a problem, as I myself am colorblind. Making some puzzles difficult, especially the puzzles right before doing the dirty, since 2 of the tokens in that mini-game are pretty much identical in color. - The difference in the 'Play as a Male' to the 'Play as a Female' route is disappointing: After finishing the Male route, I was curious about the Female route. Saw the girls didn't change into guys so they're still girls, alright that's nice, I like me a lesbian route. I play for about an hour to get laid by one of the girls, after finishing that I wait to see that erotic picture fade in. Annnnnnnnnnd, no difference, the scenes are exactly the same just the ♥♥♥♥♥ is removed from the pictures... come on man, there was huge potential, you didn't need to change much, just make 12 more pictures with lesbian scenes (Idk, scissoring, ♥♥♥♥♥♥, just ♥♥♥♥ing something) and it would warrant people to play through the entire game again but instead as a girl, adding an easy 10+ hours to someone's playtime. If the developer sees this, follow this advice like the bible. - - - tldr; No colorblind mode, female route is no different from male route, this is more of a review for the developer rather than for the consumer",
            "review_score": "1"
        },
        {
            "review_text": "I've never felt so amused and ashamed at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "I got so addicted that I played it for more then 5 hours straight alone 10/10 would go on virtual dates over real life again",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ed the girl 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A game that makes you work hard for your Porn...a rewarding challenge... 10/10    and boobs yo...",
            "review_score": "1"
        },
        {
            "review_text": "who needs a girlfriend when you have this!",
            "review_score": "1"
        },
        {
            "review_text": "The best enviornment to play this game in is in your room alone with the door locked and your lover and/or family out of the house.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I was single before this game.. but now look at all my girlfriends. ",
            "review_score": "1"
        },
        {
            "review_text": "Became attatched to several women who will never exist. 11/10 would break my heart again.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game as a JOKE. I decided to start it up, to the outrage of every steam friend, but it turned out to be way more fun than I thought. I normally get bored of games super quickly, but something about this game kept me hooked for 11 hours.  Oh god. 11 hours? ON HUNIEPOP? WHO AM I WHY AM I RECOMMENDING THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "I can confirm that there is indeed no god...",
            "review_score": "1"
        },
        {
            "review_text": "Well I bought this when its on sale and I don't regret it ( ͡° ͜ʖ ͡°) I admit that I hate anime but this I really liked. I think its because all the girls are like the ones in real life and not got like long a*s hair and s**t. Positives about this game: Can play with one hand Game creator made a nude patch Pretty addicting, I've been playing it all weekend Anime Tiddys A*s Pussay Negatives: Doesn't come bundled with tissues No slideshow option for the pictures you have unlocked so you have to keep going to the mouse to change picture No animated scenes. I highly recommend this game ( ͡° ͜ʖ ͡°) but please add like a slideshow button for the pictures you have unlocked. I would really love this to be added because I have to stop fapping to change pics ;) If you make a huniepop 2 (Which I really hope c; please make the girls in sort of the same style) please add a slideshow button",
            "review_score": "1"
        },
        {
            "review_text": "Dating Sims + Bejewed + Quirky Characters = Brilliant Huniepop both excels as a puzzle game and a dating in the highest degree as it both serve as introductory to both genre. The gameplay is simple match the the shape earn point on dates and if you make it far enough you get to bang your girl in the most glorious of matter, by that I mean you bejeweled her to the point of ♥♥♥♥♥♥. The most important thing in a dating sim is one thing it's the character you can 'date' Huniepop though may not have the shakesperian writting, the characters is memorable and can be laughbly funny at times, but it has its fair shares of cringe enducing lines and cringe enducing character. Now the second aspect the puzzle..... 2 words Simple and Addicting as B**LS the game initially start you off pretty easy, but the more chicks you bang the harder it is, and despite the insane difficulty in the post game, I'm still playing and for good reasons. Is the game worth your damn money short answer Yes....... if your an anime fan or puzzle game fan or a guy who lives the basement with a little girls dungeon. But if your not then your money is better spent else where despite my intial praise this game is a dating sim with an anime overtone, so if your not into that now or don't want to get into it chances are you will either only like one aspect of the game which is the puzzle and get turned off by the 'sexual encounters' or get turned off by the reptitve nature of the game, With that said if your in the market for a hilarious dating sim buy it If your an anime fan like myself and want to play a fun dating sim go buy it if you want an addicitve puzzle game go buy it but if you want a puzzle game and all your not open to the idea of fusing both genre of puzzle and dating sims ....... just get Candy Crush",
            "review_score": "1"
        },
        {
            "review_text": "HuniePop is probably one of the most satisfying dating sims I've ever played. I can finally put all of those years of my Bejeweled Blitz addiction to use.  Not to mention Celeste with her tentacle monsters.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've disappointed both my friends and family so much, I might as well go the full mile.    I'm never going to get a girlfriend, so ♥♥♥♥ it / 10. ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and I'm not even gay",
            "review_score": "1"
        },
        {
            "review_text": "God, where to start?  First, the gameplay. It's solid. It plays much like Bejeweled, but there is a larger amount of freedom in preparing for dates and moving tokens on the playable board, allowing for more strategic gameplay rather than purely relying on how good a board you start with. Dates will get steadily harder but it does not have any gimmicks introduced, allowing a fairer difficulty curve. Not to say that the later dates get near impossible without the right loadout. All in all, decent gameplay.  The characters themselves are rather one-dimensional however, and the lack of a storyline for any of the characters outside of 'bang every broad in a 5-mile radius' makes it fall rather flat. Don't expect to be feeling very much outside of euphoria from finally beating the final Bejeweled Blitz game (more affectionately known as SANIC BEJEWELED). If you are looking for more emotional and convincing characters, I would suggest looking for Visual Novels instead (Nekopara is a personal favourite of mine). However, the character dialogue is rather hilarious at times, and is the sort of B-movie slop that you will simply get hooked on.  Dating Sim gameplay is rather simple. Give presents, ask and answer questions, and stuff your waifu with food and drink. This is the only way of getting one of the currencies in the game called Hunie, neede for upgrading Traits to make the Bejeweled sections easier. To get Munie you need to sharpen up you match-3 skills.  HOWEVER, there is one other thing.  THE SOUNDTRACK IS AMAZING. I would HIGHLY suggest getting the Digital Soundtrack if you intend on buying this game. The tunes are catchy, yet also soothing. You can see for yourself how good the music is if you get the game yourself.  All in all, I can highly recommend this game. First, you come for the waifus. Second, you stay for the surprisingly good gameplay complexity. Lastly, you get earworms.  BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "game is not boring",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever 10/10- IGN  Definitely The Game You Want To Play If You Love 'Plot'",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game more than Fallout 4",
            "review_score": "1"
        },
        {
            "review_text": "Art is niiiiice, i like the girls personality (they are all fun and quirky) Im not good at puzzle games and i really dont like them but this one i do like. girls: 10/10 would bang lol game: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "10/8 would f*ck anime girls again",
            "review_score": "1"
        },
        {
            "review_text": "Its for the most normal guy on the street, you know the guy, yeah yeah that guy, asking you to get in his van for some candy, I mean this whole get is about 'candy' and cRUSHIN' and at the end you get a big halloween treat ;) . Thats why I recommend it too all little kids that are using their parents laptop to look up some good juicy, wet, biG, WATERMELONS. ;^)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Bejewled simulator.       And boobs.",
            "review_score": "1"
        },
        {
            "review_text": "I give this to my friend, he thanked me and asked what the best strategy was... 69/69 would play again",
            "review_score": "1"
        },
        {
            "review_text": "The most hardest game of my life. No pun intended. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "What I learned from this game: -The key to a successful relationship is buying nearly endless amounts of food for your wiafu-to-be. -(As others have stated) Racist gifts are a sure way to a girl's heart. -Some people actually wait till the evening/night to drink?   What to expect from this game: -Good voice acting and narration that actually had me laughing at times. -A challenging but enjoyable CandyCrush-esque game. -Receiving this message from your friends/colleagues on Steam, 'DUDE . . . WHAT IN THE HELL ARE YOU PLAYING?' -Trying in vain to convince said friends that you are playing this game for the puzzles. -Trying in vain to conince yoruself that you are playing this game for the puzzles . . . perv. -Googling 'HuniePop Steam Patch' . . . because you probably will eventually.  8/10 Would feed fruit to Waifu again.",
            "review_score": "1"
        },
        {
            "review_text": "BOOBS  BOOBS  PUZZLES  OH hey look boobs!  Oh god not another puzzle!  Hey look boobs!  Oh god not another puzzle!  Rinse Repeat, all glory be to Huniepop, it be the deity that we waited for. For people who have no self esteem play this game on easy mode :D",
            "review_score": "1"
        },
        {
            "review_text": "bought game, fapped happily, is now harrassed by friends 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game changes you from someone who's a virgin who couldn't get anyone to date with into someone who had sex with Goddess of Love.   11/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Even though I originally bought it as a joke, I recommend this game. I really enjoyed the puzzle aspect of the game; this coming from someone who doesn’t even play Bejeweled. There’s more to it than simply matching three of a kind and you’re going to need to use some strategy. You’ll find there’s nothing more rewarding then taking a girl back to your place to play Candy Crush. Joke aside the bedroom mini-game is certainly not a carbon copy of the date puzzles. It’s faster paced and less stressful than its predecessor. The characters in the game are well developed, and in a normal game you’ll spend a lot of time talking to them. It took me about 25 hours to complete the storyline (this will vary). As far as replaying the game you will likely only do so for achievements.  The only reason I could see why to not get Huniepop is if you are uncomfortable with sexual content. Either that or the fear of one of your steam friends judging you, but I wouldn’t worry too much about that. They probably have season one of Bible Black on their C Drive.  ",
            "review_score": "1"
        },
        {
            "review_text": " before you read this, its a long one, and, get a box of tissues (not for crying) and your left hand ready to game, *implying you buy the game of course,* because you are about to read a dik jerker review and a game that will want to make you do more of that dik jerker action *the box of tissues and left hand are for the game if it wasn't painfully obvious, or, ya know, if you perfer the left hand but most perfer right*     -  ABOUT THE GAME",
            "review_score": "1"
        },
        {
            "review_text": "bought it for the amazing puzzles ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "I left my girlfriend for this game  10/10 would match 3 to get laid again",
            "review_score": "1"
        },
        {
            "review_text": "If you not big on seeing naked woman everywhere then this is not the game for you. The puzzle aspect of the game though is very fun and relaxing to play. Would recommend to anyone that enjoys Puzzle games!",
            "review_score": "1"
        },
        {
            "review_text": "   Apparently that Venus, the Love Goddess has the same height has me :P       ",
            "review_score": "1"
        },
        {
            "review_text": "My best purchase of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Everytime I boot up this game at least one of my friends lets me know how much of a dissapointment I am.  10/10 would be ridiculed again for anime tiddy",
            "review_score": "1"
        },
        {
            "review_text": "It's quite convenient that you only need one hand to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "I took pictures with my phone, so i dont get any of the questions they ask, wrong :)  very good game with amazing art style  the bejewled kind of thing was some of the times fun and fustrating  i clutch more in this game than csgo  and more combos than in tekken   i fell for 'The ♥♥♥♥♥' 'Idian Woman' 'The Teacher' 'Toothfairy' 'The tumblr femnist asexual underage girl with blue hair'  'Hey!, This Game Is Pretty good!'",
            "review_score": "1"
        },
        {
            "review_text": "This teaches you to be ambidextrous.  10/10 Would Learn again.",
            "review_score": "1"
        },
        {
            "review_text": "Things i thought i knew before Huniepop:  ~Dating is expensive ~Girls need to be treated properly, cared for and loved before you can get anywhere with 'em ~I have no life.  Things I know Post-Huniepop: ~When on a date, the girl pays you after. ~Nobody will ever question why you brought them a rubik's cube and a shower robe... to the bar.. ~Girls see you as more likeable when ♥♥♥♥ drunk ~it is socially acceptable to sleep with a 1 year old, and a 300+ year old. ~Finally my time spent alone playing Bejeweled will make girls horny. ~It is socially acceptable to have sexual relations with a mother and her child... at the same time. ~I... still have no life...  Thanks Huniepop!",
            "review_score": "1"
        },
        {
            "review_text": "got some nice anime ho haws 10/10",
            "review_score": "1"
        },
        {
            "review_text": "if only dating was simple as solving puzzles",
            "review_score": "1"
        },
        {
            "review_text": "I got this game via trading. When I found out it was porn I played six+ hours of it. I reget nothing",
            "review_score": "1"
        },
        {
            "review_text": "I have no excuse for owning this game. Just judge me.",
            "review_score": "1"
        },
        {
            "review_text": "I asked a girl her cup size at the grocery store. Then I spent a lot of money on my hospital bill.  Most unrealistic game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "69 is best % off",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would fap again",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best plot based game",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "So I really only bought this game because I saw quite a few people play it and despite the awkwardness it looked pretty fun. As a gay guy I don't really have any interest in all the anime ( . )\\/( . )s and lewd outfits but its been a generally enjoyable game. The puzzle gameplay is pretty fun and the rpg elements are really nice too, a diverse range of girls with different personalities &amp; interests which can actually be pretty challenging to progress at times. I imagine for all the straight guys and lesbians out there who like anime girls this would be a 10/10 but since that aspect wasn't for me purely on gameplay and atmosphere I think 7/10 :P (-3 for love fairy, weird cat girl, alien lady xD)",
            "review_score": "1"
        },
        {
            "review_text": "The best way to describe Huniepop is it's pretty much drugs, once you get a taste of it you can never get enough. This game will consume the soul of anyone who buys it. Don't believe me, my cousin played this game 12 hours straight without food or water and whenever I tried to get him off of it he nearly went berserk. It wasn't until I bought it that I understood why he loved it so much.  The premise of the game is pretty straightforward and simple, you're a huge loser who can't even hold a conversation with a girl but then a love fairy named Kyu comes into your life and helps you overcome your jirttery and nervous personality so you can become a hit with the ladies. As you talk to girls you increase your skills and successfully transform into an egotistical womanizer.  I kind of wish there was an actual story with an ending and I think it would've been funny to see what would've happened if one of the girls caught you cheating but that doesn't make the game any less fun.  The voice acting is AWESOME! The actresses should be given awards because their performance was superb. Each girl had a different personality that made you fall in love with them and some that you could personally relate to.  As for the dating candy crush mini game, I have to say I never saw this coming. In this game you have to use each different token of affection according to what each girl likes. It's really cool especially coming from someone who sucks at candy crush.  The soundtrack is beautiful. It was really well done and it worked with each setting. My personal favorites are the Lusties Nightclub and the Farmers Market.  As for the secret characters, I didn't mind Celeste one but, we already have a love fairy follwing us around so having an alien show up didn't really surprise me. Now Momo, I want nothing to do with her. She creeps me out and she is the only character of the cast I dislike. My advice go for celeste and ignore Momo, the secret characters aren't mandatory.  As for the negatives, there are only few but there are some. I notice that whenever you move your mouse, the screen moves slightly left and right when I feel like more can be put into that because honestly what was the point of including it if it onlys moves left and right only slightly. Also, I understand they want us to imagine the protagonist as ourselves. However, how can you have us choose whether to be male or female and not give us the chance to create our own character. That would've been awesome!  10/10: Legendary. Just so were clear 10/10 does not mean perfect without any flaws whatsoever. The reason this game gets a 10 is because of how addicting the game was, how incredible the characters design and personality was, and how well the art and soundtrack was made.   I am quite aware that they made a spin off but I would like to see a sequel to Huniepop, hoping that they would bring back the original cast and add in more girls, hell add in the girls from Huniecam Studios if you want. Just be warned that this game is very addicting that you will spend several hours on it nonstop. All I know is that the future for Huniepop is looking bright and I am looking forward to what Huniepot has in store for us next time.  Overall favorite girl: Nikki",
            "review_score": "1"
        },
        {
            "review_text": "Sadly this game does not come with lotion and tissues and the aftermath of this game is sticky keys if you know what I mean.",
            "review_score": "1"
        },
        {
            "review_text": "Celeste is bae 10/10 Best boobies Would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "I 100%'d this game,and I need some bleach for my eyes",
            "review_score": "1"
        },
        {
            "review_text": "I fapped, 8 times, am i proud? Kind of... 10/10 still wanna fap again",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ed an alien, a cat, and Palutena Get this ♥♥♥♥ing game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addicting. I mean, really addicting.. It's fun, and possiby the coolest puzzle game I've played. Make sure to turn your volume down after the fourth date. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to fight a dragon? Have you ever wanted to be a fockin' badass? Then play skyrim, if you're here for beeeeeeewbs then you're on the right track. ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": ". ... ... ... ... ... ... ... ... ,,----~~”'¯¯¯¯¯¯”'~~----,,  ... ... ... ... ... ...,,-~”¯::::::::::::::::::::::::::::::::::¯”'~,,  ... ... ... ... ..,,~”::::::::::::::::::::::::::::::::::::::::::::::::::::”~,,  ... ... ... ..,,-“:::::::::::::::/::::::/::::::::::::::::\\::::::::::::\\:::::::::\\  ... ... ...,-“:::::,-“:::/:::::/::::::/:|::::::::::::::::\\::::::::::::\\:::::::::\\  ... ... .,-“:::::::/:::::|:::::|:::::::|:|:::::::|:::::::\\\\:::::::::::|:|:::::\\::\\  ... ... /::::::/:::|::::::|:::::|::|::::\\:\\:::::/\\::::/:::||:::::::::|:/::::::|:::|  ... .../::::::|:::::\\::::::\\::::\\::\\::::/\\:\\,::/::\\::/::::|:|:::::::/\\/::::::/::::|  ... ../::::::/::::::'\\::::::\\-,:::\\/\\::/: :\\-,”/ : :\\/:\\:::/: |:::::/::/::::::|::::/  ... ./::::::|:::::::::\\::::::\\|::/: \\/: : : \\/: : : : : \\,/: \\/::_/\\//:\\:::::/:::/  ... /::::::/::/:::::::|::/,__/:/: :__/ . .: : : : : : :\\__. \\/: \\:::::/::/:::/  ... |:::|::::::::::::/::/::::/;/ ;/ ,. .,\\: : : : : : : / ,._., \\ /::::::|::/:|  ...|:::/:::/::;;;::::::/::/|:::|.\\: |.|||; : : : : : : : :|.|.||;|::|:::\\/:/:|:/  ...|::|:::|::::::::/:::\\|:::'\\,|: \\.''' /: : : : : : : :'\\.' ''/ : \\: |:::|::\\  ...|::|:::|:::::::/:::::|::::|/: : “¯': : : : : : : : : :'¯'' : : : :/::::'\\  ...|::|:::|::::::/:::::/:::::'\\: : : : : : : : : : : : : : :': : : : :| :/::::::|  ... \\:|:::|:::::|::::::|::::::|,: : : : : : :~,___,~: : : : : :,-“:::::::|::|  ... .'\\|::|:::::|::::::||::::::\\'~,: : : : : : '~--~': : : : ,,~”\\:::::::::|:/  ... ...'\\:|:::::|::::::/.|::::::|: : “~,: : : : : : : : ,,-~,”::::::'\\::::::::/  ... ... .\\\\:::::|”~,/-,|:::::::|: : : : ¯”~,-,,,-~”:::,,-'\\::::::::\\-,,_::|/  ... ... ..',\\,::|~--'-~\\:::::::|: : : : : : |::|,,-~”¯..__\\::::::::\\... .'|  ... ..,~”': : \\|: : : : : \\::::::|: : : : : : |¯”'~~”~,”,: : \\:::::::|.. /  ..,-“: : : : : :|: : : : : :\\::::::|: : : : : : \\: : : : : : “~'-,:\\::::::|\\,  ..|: : : : : : : |: : : : : : |::::|,\\,: : : : : : : : : : : : : :”-,-\\::::|: \\  ..| : : : : : : : : : : : : : |::::|:'-,\\: : : : : : : : : : : : : : :”-'\\,|: :|  ...\\ : : : : : : : : : :'\\: : :\\:::|: : '\\'\\: : : : :~,,: : : : : : : : : “~-',_  ... \\: : : : : : : : : : :\\: /:|:/: : : :',-'-,_,: : : “-,: : : : : : : : :,/”'-,  ... .\\: : : : : : : : : : :\\|: |/: : : ,-“....”-,:\\: : : : '\\: : : : : : :,/.......”-,  ... ...\\: : : : : : : : : : \\: |: : ...........\\*/ : : : :|: : : : : :,-“..............'|  ... ... .\\ : : : : : : : : : '\\': : /..............\\/ : : : : /: : : : : :,-“............./  ... ... ...\\ : : : : : : : : : '\\:/.................\\: : :,/: : : : : /................./  ... ... .....\\ : : : : : : : : : \\........................\\:,-“: : : : :,/............/  ... ... ... ...\\ : : : : : : : : : \\,_.............._,”======',_..........,-“\\  ... ... ... ... \\,: : : : : : : : : \\: ¯”'~---~”¯: : : : : : : : : :¯”~~,': |: \\  ... ... ... ... ..'\\,: : : : : : : : : \\: : : : : : : : : : : : : : : : : : : '|: : : : |  ... ... ... ... ... .\\, : : : : : : : : '\\: : : : : : : : : : : : : : : : : : :|: : '/: |  ... ... ... ... ... ...\\,: : : : : : : : : : : : : : : : : : : : : : : : : |: : : : : :|  ... ... ... ... ... ... ..\\ : : : : : : : : \\: : : : : : : : : : : : : : : : :|: : : :\\|  ... ... ... ... ... ... ...\\\\,: : : : : : : , : : : : : : : : : : : : : : :/: : : : :\\: |  ... ... ... ... ... ... ... .\\\\ : : : : : : : :'\\ : : : : : : : : : : : : : :|: : : : : |  ... ... ... ... ... ... ... ./:\\: : : : : : : : :'\\, : :;: : : : : :;: : : :|: : : : : :|  ... ... ... ... ... ... ... /: : \\: : : : : : : : : '\\,:;: : : : : :;: : : :|: : : : : :|  ... ... ... ... ... ... .../: : : '\\: : : : : : : : : :'\\,: : : : : :; : : : :|: : : : : |  ... ... ... ... ... ... ../: : : : :\\: : : : : : : : : : , : : : ;: : : : : : | : : : : /:\\  ... ... ... ... ... ... ,/: : : : : : :\\: : : : : : : : : : '\\,:.. :: : : : : : |: : : :;::|  ... ... ... ... ... ..,-“: : : : : : : :“-,: : : : : : : : : : \\*, : : : : : :| : : : :\\:|  ... ... ... ... ... ,/ : : : : : : : : : :”-, : : : : : : : : : :\\: : : : : /: : : : : : /  ... ... ... ... ..,/ : : : : : : : : : : : : :”-, : : : : : : : : :'\\: : : :| : : : : : ,/  ... ... ... ... ,/ : : : : : : : : : : : : : : : ;-,: : : : : : : : :'\\: : |: : : : : : /  ... ... ... .../: : : : : : : : : : : : : : : : :;: “-,: : : : : : : : '\\: |: : : : : /  ... ... ... ../: : : : : : : : : : : : : : : : : : : : :“-,: : : : : : : \\,|: : : : /  ... ... ... ,/: : : : : : : : : : : : : : : : : : : : : : :“-,: : : : : : :\\: : : : /  ... ... .../-,-,”,,-,~-,,_: : : : : : : : : : : : : : : : : “-,: : : : : :'\\: : :'|  ... ... ...|',/,/:||:\\,\\: : : “'~,,~~---,,,_: : : : : : : : '\\: : : : : ,: :|  ... ... ..|: :”: ||: :”: : : : : : :”-,........ ¯¯”''~~~-~.|\\: : : : : : \\:|  ... ... ..|: : : ||: : : : : : : : : : :”-,.......................|: : : : : : : \\|  ... ... ..| : : : : : : : : : : : : : : : :”-,.....................\\: : : : : : : ,\\  ... ... ..| : : : : : : : : : : : : : : : :”-,\\....................“\\: : : : : : : : '\\  ... ... ..| : : : : : : : : : : : : : : : : : :”-\\...............,/: : :\\: : : : : : : |  ... ... ..| : : : : : : : : : : : : : : : : : : : \\,...........,/: : : : '\\: : : : : : ||  ... ... ..| : : : : : : : : : : : : : : : : : : : : \\.......,/: : : : ,-~/: : ,: |: /:|  ... ... ..'|: : : : : : : : : : : : : : : : : : : : : \\~”¯: : : : : :|: ::|: :/::/:,/  ... ... ...|: : : : : : : : : : : : : : : : : : : : : |: : : : : : : :”-,,_/_,/-~”:|  ... ... ...|: : : : : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : : : : :|  ... ... ... |: : : : : : : : : : : : : : : : : : : : : |: : : : : : : : : : : : : : : |  ... ... ... | : : : : : : : : : : : : : : : : : : : : :|: : : : : : : : : : : : : : : | ",
            "review_score": "1"
        },
        {
            "review_text": "This game helped me figure out what women really want, someone really good at solving match-3 puzzles. This game improved my love life.",
            "review_score": "1"
        },
        {
            "review_text": "Well you see as a woman I enjoy this",
            "review_score": "1"
        },
        {
            "review_text": "I'm a disgrace to my family",
            "review_score": "1"
        },
        {
            "review_text": "The only game where I double check to see if I'm offline before I start playing....  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Banged an adult actress, then her daughter  I'm not even sorry 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I have to turn my monitor away from my door each time I play this, but I swear I bought it for the Puzzles",
            "review_score": "1"
        },
        {
            "review_text": "15/10  Would fap again.",
            "review_score": "1"
        },
        {
            "review_text": "In the year 2020, cyborg deamons attack the peacful countryside of babalonia. You play as Richerd Mc TicleToff, an ace detective on the scene of a grisily murder of a bear, when suddenly the calamity of ninga deamons ravishes my auns. and then you ♥♥♥♥ some chicks I guess. the hack and slash gamplay can get a bit repettitive, and the upgrade tree, a bit samey. the storyline is where the game shines, where richerd must atone for killing his wife (who was a grizzely bear) and finds love in the moist embrace of an anime girl. 2/2.  ",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "I say, this game teaches me the ways of how to beat candy crush. But more EROTIC if you know what I mean.",
            "review_score": "1"
        },
        {
            "review_text": "incredible game you can play with one hand and its really good way to build arm muscle 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game, lots of fun, fun puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amaising",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever. I loved the plot and how it teaches you to get with a woman and then never speak to her again and also gives you awesome pointers on how to talk to women like; hey whats your height? how much do you weight? what cup size you rocking? 11/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun dating sim game and also a challenge for those that likes Bejewled. And it's not recommended for those thats underage or be played in a public space that like whole family can pop in without warning since game contain uncensored nudity, sounds not meant for young ears and alot of swearing. But i recommend this game for those that like puzzle games like Bejewled and maybe wanna improve peoples confidence.",
            "review_score": "1"
        },
        {
            "review_text": "Before the game wasnt gay   Now Im not so sure",
            "review_score": "1"
        },
        {
            "review_text": "TotalBiscuit made me want to get this game. NO REGRETS!! :D",
            "review_score": "1"
        },
        {
            "review_text": "Not bad i got Laid about 17 times so not bad",
            "review_score": "1"
        },
        {
            "review_text": "Intersting characters, funny writing, surprisingly fun puzzle gameplay, dirty pictures  There really isn't much more to say about this. It is an enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Waifu Weeaboo heaven",
            "review_score": "1"
        },
        {
            "review_text": "Never was much of a fan for match 3 games but this completely turned that around for me.. Especially for dem anime ♥♥♥♥♥♥s BELI IS BEST GIRL",
            "review_score": "1"
        },
        {
            "review_text": "I had alot of fun for 4h, but then I was done ♥♥♥♥ing all the cute babes. You will get depressed after you ♥♥♥♥ed all those cute babes because you want to ♥♥♥♥ more of them.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER! &lt;3        *ForeverAlone* sobs :'c",
            "review_score": "1"
        },
        {
            "review_text": "All the girls become irritable when hungry and refuse to have conversation with you until you buy them food. As a woman, I fully understand this.  10/10 for realism.",
            "review_score": "1"
        },
        {
            "review_text": "Taught me the best life lesson:  Women will love you if you have mad Bejewled skills  69/10 ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "my girlfriend is probably going to break up with me now.      ",
            "review_score": "1"
        },
        {
            "review_text": "I asked about her cup size. Didn't get slapped. Right on. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This is a game where you want to achieve something. In this game its to collect all fotos :)  And to be honest, I played this game only with 1 hand :) Of course only for moving to boxes :3  Conclusion: +its a achievment game +its simple to understand  -its not a longtime time game",
            "review_score": "1"
        },
        {
            "review_text": "this game is beyond weird... but i highly recommend this game if u want a boner XD",
            "review_score": "1"
        },
        {
            "review_text": "Very good game!!! It had lots of good 'gameplay', they thought of everything!! For instance, the controls are mouse only so you can play the game with one hand although it should be noted that I am a lefty so it was a bit easier for me to rummage through my pocket than it might be for some!!!",
            "review_score": "1"
        },
        {
            "review_text": "It is certainly an experiance...",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would fap again",
            "review_score": "1"
        },
        {
            "review_text": "i cant stop having a boner",
            "review_score": "1"
        },
        {
            "review_text": "As my friend calls it waifu sim 2015. The game can get anoying at times with the dificulty spikes here and there cause they scale it to how well you have done so far. Basicly bejeweled with ♥♥♥♥... and other stuff with mods *cough cough*. If you are ocd like me and want to get every item with every person and unlock everything then you can since a lot of time into it. Most people do not condone cheating (especially on a game this easy) but if you really don't want to spend a lot of time on it you could always use cheat engine to auto win the date (bejeweled) parts. I would say wait for a sale before getting this one.",
            "review_score": "1"
        },
        {
            "review_text": "10/10!!!!! BEST GAME EVER GET IT NOW!!!!  But seriously, at first I wasn't so sure about it. I kinda thought it would be super easy and boring. However, after playing it for a bit, I found out it is actually pretty challenging and very entertaining! :D BUY IT  Tiffany FTW",
            "review_score": "1"
        },
        {
            "review_text": "the game is good but actually it is not at all and this is just match three with moaning deviantart ocs",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly addictive game and a bit difficult too if you are not paying attention. And my god, is this game voice acted superbly! Whomever does the voice for Jessie OMG! You need to get into the phone sex industry, you would make millions! A really good buy even at full price. 8/10 easily.",
            "review_score": "1"
        },
        {
            "review_text": "There comes a point in every person’s life when they look at the situation they’re in and think to themselves, “what the hell am I doing?” This revelation can strike any time: during a class for a useless degree, a waning relationship, a drug deal with a co-worker. My moment of clarity, if you will, hit me when I needed it most, in the midst of a frantic dash for three-jewel matches as I worked to build a lazily-drawn, not-anime girl’s o-meter.  It brought me back to reality, back from that dark place in the back of my head where I go when I need to retreat from the world’s ugliness. This happened just as the screen faded and the poor voice actress’ bored moans grew in volume and doused in effects. I was rewarded with yet another CG image of a naked woman in an inhuman pose, covered in fluids.  Yes, I’m reviewing an adult game. A match-three, adult game. A Kickstarted, match-three, adult game. A Kickstarted, match-three, adult game that received over $50 grand.  I play it for the puzzles, mom, I swear!  Here’s the deal: your character is a perpetually virginal loser. You’re so sexually hopeless you incur the wrath of the love goddess, and she sends an almost-naked, fairy lady to turn dates with women into a video game, because that’s your only skill. You’re actually so terrible at life, the fairy girl sees your case as a special challenge and goes the extra mile to make sure you get laid, and often. The projection in HuniePop’s (really bad, but who’s surprised?) writing is so thick you can cut it with a disapproving grimace.  With your new gamified romance powers, you get to stalk a group of women with your magic radar phone, and ask them invasive questions out of the blue, because that’s totally how approaching women works. You can also go out on date, which takes you to HuniePop’s pretend gimmick (I mean, seriously, there’s porn): the “puzzle stuff,” as HuniePop’s Kickstarter pitch so eloquently puts it.  When Irony Attacks  So, here we are. HuniePop. A bland puzzle game that pretends to have depth, a dating sim you can’t lose that glorifies loserdom to an uncomfortable level and lame porn. Why bother? If you want anime porn, there’s plenty of visual novels or eroge or whatever out there featuring much less secondhand embarrassment. If you want a puzzle game, with gimmicks and depth, there’s like fifty better options out there. HuniePop is a lose-lose situation. It isn’t even worth much of a laugh, frankly. It’s just boring. Also, if you get it on Steam, it isn’t even porn anymore. HuniePop.  2/10 Would Play For The Puzzle Again",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the 12 hours were well spent pondering why I ever bought this game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would ♥♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "Well, I never really thought I'd ever play a game quite like this, Nor did I think I'd find it so fun. But, here I am, writing a review for the new game called 'HuniePop', a combination of every Hentai dating sim and Bejeweled style puzzles games. So, without further ado, let's give you the story.  Story: You are a guy/girl who is unlucky in love. However, one day, a Love Fairy named Kyu approaches you with the offer of a lifetime, the chance to teach you how to seduce girls. Now, armed with your trusty HunieBee, plenty of gifts and pick up lines, AND one hell of a libido, you are off to win the hearts of 8 lucky ladies, plus a few secret girls~  Pros: Now, let's just start off by saying that the premise of a dating sim mixed with Bejeweled is very interesting, and handled well here. It is quite challenging, even on easy mode, so don't exactly plan to breeze through this. The tutorial for the game is also good and gets you a full idea on how the mechanics work. It also has some very great voice work that will likely make you decide you actually WANT to hear the women talk (though it DOES leave the option to turn off their voices). Furthermore, the women are each unique and fun to watch (though some aren't AS likeable, you will qucikly find). The HunieBee menu is also pretty easy to go through, besides some minor difficulties (which I'll explain later). The artwork is really lovely, with some of it being cute while a large portion is nice and sexy. Also, for those who are more hardcore when it comes to games, worry not. Because this game also has an 'Alpha Mode' which you can get once you successfully seduce all the girls, including that 'final boss' whom I won't reveal. In this mode, all dates you go in will be in Hard Mode AND increase in difficulty with every date. And finally for what it arguably lacks in story it makes up for with a rather off the wall, inappropriate humor that manages to come off as surprisingly charming despite itself. From having your Love Fairy mention having a taste for chocolate (she's talking about a black woman) to one of the girls, Audrey, asking another girl if she 'hurt [her] ♥♥♥♥♥ feelings, the funny moments can be too many to count and honestly come off as hilarious, whether because it sounds surprisingly natural, or because it's much too corny to take seriously.  Cons: Now, while I did mention quite a few pros, a few of them could actually count as cons for other people. First of all, there's the fact that this game really has no real story or even character development, besides your guy/girl going from a shy, simple virgin to the town's biggest sleeparound. Oh yeah, did I mention that you sleep with every girl in the entire game and yet still go on dates with each one, INCLUDING a mother and her own college age daughter (granted, they're enstranged from one another, but still)? Because yeah, that's exactly what happens. And combine that with all the drug &amp; alcohol references, inappropriate humor, some of the less likable characters (Audrey and her excessive swearing can feel quite grating when she isn't funny) and the mere fact that you end up collecting the panties of the girls you sleep with can easily make this a conservative's worst nightmare. Oh yeah, and if you aren't into the game's humor (which you can easily get a feel for early on), then trust me when I say it doesn't get any better. As a final, but minor note, I find that the HunieBee menu for the info on the different girls can be a bit of a pain to go through since you have to rely on the arrows to get you through it rather than tabs going to what you want to look at. Not big, but still annoying.  All in all, I was honestly happy with my experience playing this game, and NOT just because of the hentai elements. To put it simply, I managed to find that I actually enjoyed the puzzles and found winning the hearts of all the women to feel rewarding, expecially when I made them happy. While it can easily be argued that it stoops pretty low in terms of both the premise and humor, you may just find that to be a part of the charm. So if you can at least get a demo of it, try it out first and if you like it, go ahead and buy it. I honestly feel happy that I gave it a try.",
            "review_score": "1"
        },
        {
            "review_text": "  I must say this is one of the best Dating Games I've ever played. After seeing gameplay of it, I was immediately intrigued by the puzzle (I love games like Bejeweled), and the characters themselves. It may not be as story-driven as other Dating games, but I feel that the personalities of each girl is unique and gives an interesting variety to choose from.   I highly recommend this game to anyone looking for an interesting, and sometimes challenging, way to win the hearts of beautiful girls. ;) My personal favorite is Nikki &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Light Puzzle game: Check Light Dating Sim: Check Naughty: Yessir!!! Fun: Double Check  Important note: Steam version is censored. If you buy via  HuniePop.com  or  MangaGamer.com  yoou will get the uncensored version plus a Steam Key. Save files share between versions!!!  The characters are pretty much one dimentional but that does not detract from the fun.   A nice time burner with a naughty edge.  ",
            "review_score": "1"
        },
        {
            "review_text": "the game is really addicting especialy the 'bejeweled' style dating games if you are looking for a game with alot of depth, go omewhere else if you are looking for a fun game that one way or another will put a smile on your face, buy this game ",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun mix of a standard dating sim and challenging puzzle game. Great arts, and it has decent voice acting works for the characters (except for a few over/under-acting characters)  'You wanna ask me on a date? Sure... NOW SOLVE THIS PUZZLE!'",
            "review_score": "1"
        },
        {
            "review_text": "Its like bejeweled with hentai...   Surprisingly a good game, but dont play with others around, or else things get awkward.  The message is kind of awkward... Lie to girls, go date another girl after you banged another and girls will sleep with you for gifts...10/10! Just kidding, the gsme has alot of room for improvement. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Surprised I like this, but the puzzles are pretty good. The writing is funny and the voice acting is actually pretty darn decent too. I recommend the uncensored patch for those mature enough to view that. It's not shakespear, but it's a fun, silly, adult puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "All the fun of being a cad and a womaniser, plus match three puzzles!  So, now I'll be that guy who writes a serious review of a porn game. Because make no mistake -- that's what this is. The cutesy art style in the sample screenshots may deceive you, but as the game progresses, it becomes quite explicit. If you're not comfortable with that, stay away -- and probably don't buy this for your kids. It is, however, as wholesome as a porn game can get; there is no violence and no coercion, no 'bad ends' or gruesome situations. It's just purely consentual, happy encounters and positive outcomes.  In gameplay terms, it's simple and repetitive, but fairly fun. It's basically a match-three game with a rudimentary dating sim tacked on to the front, but with none of the (rather arbitrary and frustrating) mechanics dating sims often suffer under. There are no lose conditions in this game; you can fail at individual puzzle boards and botch sim interactions, but there's no way to lose the game entirely, nor is there any way to screw up your relationship with any of the girls such that you can't just try again tomorrow. Each of the girls (there are several) has her own likes and dislikes, and must be appropriately courted with gifts and flattered with question responses in order to unlock her outfits and hairstyles. Meanwhile, you can also ask them out on dates, which brings you to a match-three board. Completing the board increases that girl's affection for you, and brings you that much closer to the explicit scenes.  The actual sex scenes are, strangely enough, also match-three puzzles, but these are of the 'speed matching' variety, and are easily the most annoying thing in the game. The pleasure meter drains  so  rapidly that strategy becomes next to impossible; mainly, you have to grab and drag whatever you can as fast as you can, or you'll lose all the progress you've made. Still and all, it doesn't appear to be possible to fail at these -- in extremis, your meter will drain all the way back to zero and you have to start over again.  The game has, as the screenshots above demonstrate, a definite anime art style. It's fairly well executed, though entirely static -- there is no animation anywhere in the game. By default, the game is also censored, though the developer has made available a patch that removes the censors; be aware that the uncensored images are  very  explicit, so don't use the patch if you aren't comfortable with that.   The 'abrasive western writing style' certainly is quite abrasive. The dialogue consists of annoying internet memes, distrssingly on-the-nose faux-cool talk, and swearing. Lots of swearing. Call me old-fashioned -- or, not to put too fine a point to it, just plain  old  -- but I don't appreciate the girls in this game all cursing like sailors all the time. It's not just one or two 'edgy' characters, either; all of the girls are rather foul-mouthed. It's rather a shame; if a bit more work had been done on writing decent text rather than just internet in-jokes and foul language, it would have done wonders to improve the experience. There is, after all, quite a lot of dialogue.  There is voice acting. It is exactly as bad as you expect. Fortunately, there is a quite simple way to disable it, and you even have the option of replacing it with 'bloops' so the dialogue boxes aren't purely silent.  Overall, this game is worth your ten dollars if you like match three games and porn. If either of those things is not to your taste, then give it a miss.",
            "review_score": "1"
        },
        {
            "review_text": "i personally liked this game it fun to play but i would'nt tell people IRL that i have it. i like the puzzle most of all but the stories are interesting.   still i only recommend it only to adult gamers for reason's im affraid to say lol. personal rating 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun dating sim mixed with a puzzle game. I'll be honest I got it after I saw Sodapoppin play it and then immediately have to stop after Aiko's third picture (luckily he managed to get something not too terrible). Of course I got it for the pictures that are in it but it quickly became difficult. While I love it, i think the puzzle may be a bit hard (however I don't analyze every single move I make).",
            "review_score": "1"
        },
        {
            "review_text": "Played Bejewelled, boned an alien.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would PLOT again Audrey worst girl",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Just needs achievements now.  ifunowutimeen.",
            "review_score": "1"
        },
        {
            "review_text": "Had to convince my mother that I only play this game for the porn so she wouldn't disown me for playing a candy crush clone.",
            "review_score": "1"
        },
        {
            "review_text": "10",
            "review_score": "1"
        },
        {
            "review_text": "I came into it for the silly dialog, I stayed for SIXTEEN HOURS for the puzzle game.  My only suggestion is to play your own music during the dating/sex minigames after a while. Conquering Venus to 'DON'T LOSE YOUR WAY!' is so much better.  I'm tempted to record a game where I pull of something amazing and put it to Rules of Nature.",
            "review_score": "1"
        },
        {
            "review_text": "Its good that this game only requires one hand to play...so good.",
            "review_score": "1"
        },
        {
            "review_text": "IT CHANGED MY LIFE  huniepop is the perfect game for everyone of all ages and its very enjoyable    i believe this is a gud gam 9/10",
            "review_score": "1"
        },
        {
            "review_text": "its a nice game but i would like to see more story",
            "review_score": "1"
        },
        {
            "review_text": "Honestly? Hot as ♥♥♥♥, funny too.  10/10 i feel like i should have payed more for for it :P",
            "review_score": "1"
        },
        {
            "review_text": "I failed to maintain self-control...",
            "review_score": "1"
        },
        {
            "review_text": "its got some nice anime tiddies and if you patch it you can look at the icecream that you put inside them",
            "review_score": "1"
        },
        {
            "review_text": "IRL achievement unlocked: 'Master of T!nder'",
            "review_score": "1"
        },
        {
            "review_text": "It's a complex puzzle game with funny humour and stuff, and I genuinely mean that.  8/8 would be shamed by my friends list again",
            "review_score": "1"
        },
        {
            "review_text": "A good, Modern Americanization of a graphic novel. Goes along with a lot of habits people have now a days. Also.  1.) Tiffany 2.) Beli  3.) Kyu 4.) Nikki  5.) Aiko  6.) Lola  7.) Kyanna 8.) Jessie 9.) Audrey   Best to worst girls.  There's an English voice over too in this, however you can turn it off when you're with Audrey if you so please. Either way, pretty good. Puzzles have a nice concept too. 9/10. -1 point because Aud's in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Yep, it's porn alright.",
            "review_score": "1"
        },
        {
            "review_text": "do you like boobs  do you like anime chiks do you like candy crusch style puzzels then this game is for you  100000 boobs out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Man i played this game from 3PM to 2AM non stop.  It not just the snoo snoo or orgy parts that got me in this. The game is just so much fun, that those things are just Perks to the game. The characters are fun and enjoyable to be around though some are very Annoying *cough* Kyu *cough*. But in all terms I love to chat with all of them.  To put in terms of 'Dating SIms' I would place that loosely, like most people say. People say this is like Bejeweled I seen the game never played so I can't be for certain. But the game is more of a Puzzle game, the more you win the harder the Puzzles become. (and they are no Push Overs). Winning 'dates' Give you Munie which allows you to buy gifts and food for the girls so you can earn Hunie to 'enhance' your links on your puzzles.  If you are into the regular Dating Sims type of game where you pick a girl you have certain days to get them. Have to get 15 days to actually get yourself as a Boyfriend/Girlfriend. Then another 10 to get that Happy Ending. Then this isn't the game for you.  Though the Steam Version has removed the Kitty Kitty and only left the moo moos. Like I said those are just perks to the actualy Gameplay.  If you like Puzzle games like Bejeweled, Pokemon Puzzle. and all those kind of games. This is a Fun, Enjoyalbe game.",
            "review_score": "1"
        },
        {
            "review_text": "No need for a boring review...  You like anime/hentai? &gt; check! You like to laught out loud like retard behind your PC? &gt; check! You like bejeweled kinda gameplay? check! You like ♥♥♥ stained hentai ♥♥♥♥♥? check! double check! check! check! error..!",
            "review_score": "1"
        },
        {
            "review_text": "This game actually got me a girlfriend by asking every question in game.  Unfortunately I panicked on the first date when little orbs didn't appear and start dropping to form patterns.",
            "review_score": "1"
        },
        {
            "review_text": "What am I dong with my life ? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i feel like a god after conquering all the 12 girls including the goddess and the two secret characters. What i learned when playing the game.  - girls love to get expensive stuff - girls love alcohol  - girls love to only hear about themself - girls ask you questions all the time about themself - girls will ask you tons of questions and they only want to hear what they want to hear or deny it by saying.. you jerk or you don't mean that. ",
            "review_score": "1"
        },
        {
            "review_text": "Hella fun could use a better soundtrack but over all entertaining what with the puzzles and the boobs and the boobs and the boobs and did I mention the mammaries?",
            "review_score": "1"
        },
        {
            "review_text": "I love it. I completly beat it. (the game and more) All the dates, all the puzzle filled sex, every gift.  'There's my beautiful girlfriend! Come to take care of me?' -Jessie, the love of my life. ",
            "review_score": "1"
        },
        {
            "review_text": "bought this while it was on sale for $8. i feel bad, because i came at least $10 worth.  $10/$10",
            "review_score": "1"
        },
        {
            "review_text": "Seriously amazing game! A dating sim mixed with a really fun match 3 with the reward being nudie pics. My wife and i played the crap out of this thing. 10 out of 10!!",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game so me and 4 other nerds could laugh at a dating sim for Valentines day. We ended up playing for over 10 hours in a single sitting.  Great Valentines Day. 10/10. Akio was all of our waifus.",
            "review_score": "1"
        },
        {
            "review_text": "HuniePop is a game where you're a neckbeard loser and this sexy anime fairy chick wants to help you get laid. Your objective is to meet and date different women. The girls like gifts and want to run their trap all the time. they expect you to remember stuff like their birthday and breast size. Some girls like to drink alcohol and some dont. One of them i could just keep feeding drinks and coincidentally thats the first one i slept with. You go on dates which are the puzzle games like bejeweled. They are quite fun. Vulgarity and adult subject matter is present... which i find quite refreshing. Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Torrented it, Played it, Loved it, bought it the day after.  20/10, Would play Illegally, then legally again.",
            "review_score": "1"
        },
        {
            "review_text": "Well. This is a more diffucult version of Bejeweled. HOWEVER! There are items that you get in game (like stuffed animals and shoes) That help you with the game. On top of that there is the fact that the entire goal of the game is to have sex with each and everyone of the characters you meet in the game. The dialouge is hilariously bad, but all the same you will end up trying to learn all you can about the characters and unlocking everything through the powers of bejewled.  Also the girls pay you massive amounts of cash for the dates.  10/10       Yes eventually you get to see their ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Cute anime girls + Puzzle Game + Dating Sim = This game  I'm an addict to puzzle games like bejewled and the like and this game made me addicted, though I wasn't expecting the uuhh, adult rated stuff to happen at the end, so...to those who want to play it, yes it does go there. It doesn't show it but it gets pretty close. Still very fun!  Totally recommend it if you want to get a laugh at the irony and exaggerated stereo types in the game, as well as the fun puzzle game itself!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Diffuculty scaling Artwork Gameplay  Cons: End game progress is too slow You pretty much need to check online to unlock all the girls Wish there was more content",
            "review_score": "1"
        },
        {
            "review_text": "i dont recomend playing this with someone. its pretty much watching hentai. but this is ♥♥♥♥ing amazing to not checking it out. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles get so hard later on. Ive never had such a power struggle of bloodflow before.",
            "review_score": "1"
        },
        {
            "review_text": "playing this geniunely feels like i'm draining my social life away 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  Turn your back on God for a low low price. 👌",
            "review_score": "1"
        },
        {
            "review_text": "It has full frontal nudity. That's pretty much worthy of a 10/10, five stars, two thumbs up, etc. in my book.   Aside from that the game is pretty fun. The dialog is funny. The girls are cute. The gameplay is fun enough. Not much to hate about this game aside from the fact that steam censors it. Luckily you can get a patch for that (Yay PC gaming!).   No, but really. It's basically a sexy version of candy crush. I would recommend it to anyone who likes women. If you are a gay man or a heterosexual woman (or asexual for that matter) you will probably not find this game to be AS enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I grab this game because I like dating sim and match three. And now my girlfriend will kill me if she saw this game in my library.  Dating sim + match three = Awesome 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, I enjoy it so much.",
            "review_score": "1"
        },
        {
            "review_text": "Come for the sweet puzzle action, stay for the anime waifus.",
            "review_score": "1"
        },
        {
            "review_text": "*friend buys me game* Me: oh god why *34 hours later* also me: why the f*** am i still playing this... 9/10 it has ♥♥♥♥ and is also an addictive puzzle game",
            "review_score": "1"
        },
        {
            "review_text": "  This is a great game...just get it.",
            "review_score": "1"
        },
        {
            "review_text": "I played this for the plot.",
            "review_score": "1"
        },
        {
            "review_text": "You can play it with one hand",
            "review_score": "1"
        },
        {
            "review_text": "The grind for boobs.",
            "review_score": "1"
        },
        {
            "review_text": "I regret nothing.",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game in my steam library",
            "review_score": "1"
        },
        {
            "review_text": "I am SOOOO addicted. I'd totally reccomend. If you're over the age of 18 or you're just a horny teen lying about you age, this game is perfect &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Naughty but nice.",
            "review_score": "1"
        },
        {
            "review_text": "Gives watermelon 'that doesnt go well with my diet' Gives cupcake instead 'Yummy just what i needed'  solid 5/5  Best waifu simulator 2k4ever",
            "review_score": "1"
        },
        {
            "review_text": "This is what I think- 69/69 anime girls.",
            "review_score": "1"
        },
        {
            "review_text": "  Hope you bought some lotion, you're gonna need it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game gives the best advice for Dating 101.  Connect 3 tiles in a row to make a girl happy. Now I have 20+ girlfriends in real life.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "  friend bought game for me as gift because i am one charming man, and i used this game to refine my dating skills and now have 1000 chickz at my disposal",
            "review_score": "1"
        },
        {
            "review_text": "Well, well.. I have to say I wasn't expecting much from this game. Truthfully, the story is decent, the match 3 system is challenging (more so as you progress), and it actually forces you to think carefully about your moves to win.  I'm not saying this is a chess master level strategic game, but it's far better than I expected.  Also, tons of plot. I love the plot in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Obviously way better than real dating, you get to bang aliens, asians, milf, ebony and cat girls. My dad saw me playing it once and I am homeless now, but I still have HuniePop. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Gotta love that animu titmilk",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game a lot more than I thought I would lol. The puzzle game part can actually be challenging at times. Then to get rewarded with 'that puh' makes it all worth while... Recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have ever played. Hands down. No competition. Lola and Beli are the best.",
            "review_score": "1"
        },
        {
            "review_text": "We all know what we got this game for. The thing is, f*ck the puzzles. 11/10 would see naked women again",
            "review_score": "1"
        },
        {
            "review_text": "Its a really fun game although i would only reccomend to get it while its on sale because its pretty much just candy crush without cute girls.  fin",
            "review_score": "1"
        },
        {
            "review_text": "  weeaboo trash. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game stole my waifu and replaced her with a new one.    10/10 would HuniePop again.",
            "review_score": "1"
        },
        {
            "review_text": "My Girlfriend saw me playing this, now i'm single........... but it was worth it",
            "review_score": "1"
        },
        {
            "review_text": "4:38 PM - Wilko: OH BOY!!! 4:38 PM - Wilko: HunniePop is $3.39 on steam! 4:38 PM - xxxxxxpicard: lol 4:38 PM - xxxxxxpicard: Gotta get it!! 4:38 PM - xxxxxxpicard: Can't pass that up 4:38 PM - Wilko: lawl 4:40 PM - Wilko: At a price of $3.39, You can't afford not to feel the shame from everyone on your friends list. and go down the long dark path of self loathing.   6 Minutes   later   [i.imgur.com]    4:46 PM - xxxxxxpicard: Problem solved 4:46 PM - Wilko: OMG 4:46 PM - Wilko: You just ♥♥♥♥ing bought that for me 4:46 PM - Wilko: I am the happiest girl at prom 4:46 PM - xxxxxxpicard: Bwahahahahaha! 4:52 PM - Wilko: It is in my library 4:52 PM - Wilko: It cannot be undone 4:52 PM - xxxxxxpicard: yesssss 4:52 AM - Wilko: Picard, I'm going in! Wish me luck Friday, 27 November 2015 5:29 AM - xxxxxxpicard: Woot!! Enjoyyyyy! Kreygasm 5:49 AM - Wilko: I winded a dateadoo! 5:50 AM - xxxxxxpicard: Scoooooooore!! 7:37 AM - Wilko: Hmmm 7:38 AM - Wilko: This HuniePop game is actually pretty addictive 2:46 PM - Wilko: Bruh, can you one click me some kleenex?  10/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "I like to play this game naked and jerk off",
            "review_score": "1"
        },
        {
            "review_text": "My childhood is ruined....",
            "review_score": "1"
        },
        {
            "review_text": "There is no way this wont be the #1 rated game on steam in a years time. ♥♥♥♥♥y girls swearing at you while you try to get in thier pants. Mildy racist and super objectifying 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥♥♥ my pants. Tripped over nothing. Creeped everyone out. Boned 6 girls in 15 minutes. Time to test this in real life... 12/10",
            "review_score": "1"
        },
        {
            "review_text": "Is this game trying to break the forth wall? How did it (she) knows I'm a loser? Dammit. I need to be more social :/",
            "review_score": "1"
        },
        {
            "review_text": "i cant even get a date with a 2d girl i hate myself 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A Good Game. Dunno Why Its Not Censored, But It Just Means I Don't Have To Install A Patch :3 12/12",
            "review_score": "1"
        },
        {
            "review_text": "Good nut material, I would nate it about a planter's peanut on the nut factor.",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun Dating-Sim Match-3 Game.  Many think this game is ♥♥♥♥ because it's a dating sim. Wrong. It's challenging and rewarding, especially with the hardcore matches you can get when in dates.  If you love having a good time and having a challenging experience at the same time, pick up HuniePop and play. You won't be sorry!",
            "review_score": "1"
        },
        {
            "review_text": "I learned that bedroom toys are the way to a fairy's heart.  10/10 Game of the Year inevitable  Edit: Now with Steam Achievements and endgame Prepare to Die mode! GOTY has arrived.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, intersting dialogues, awesome puzzles.  69/10",
            "review_score": "1"
        },
        {
            "review_text": "Just yes.",
            "review_score": "1"
        },
        {
            "review_text": "I bought it for the puzzle part, I swear",
            "review_score": "1"
        },
        {
            "review_text": "Candy Crush to bang grills? SIGN ME UP!",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't the only thing that's hard...",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of great characters (except Nikki and Lola).  Highly recomend for all you lonely creeps out there.",
            "review_score": "1"
        },
        {
            "review_text": "It was hard to play with my foot, but I did it",
            "review_score": "1"
        },
        {
            "review_text": "hay i had fun playing this at first it looked like it was going to be bad but i tryed it and it was really fun the voice acters for this were really good and funny",
            "review_score": "1"
        },
        {
            "review_text": "tried to flirt with a girl by solving a puzzle in front of her she didn't like it this isn't like my korean cartoons",
            "review_score": "1"
        },
        {
            "review_text": "' Why i have an Erection ???!!! '  Because HuniePop !!  ",
            "review_score": "1"
        },
        {
            "review_text": "Hey, little Timmy do you know how to get into a women's heart? You play a hentai puzzle game until you get into her pants. 11/10 I cry every time",
            "review_score": "1"
        },
        {
            "review_text": "You get to ♥♥♥♥ a catgirl and an alien. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a total gem. At first glance, it looks like it's all about the pretty girls. But the voice acting is great, their personalities are fun, diverse, and realistic. More importantly, the puzzle-game is awesome and challenging, with different ways to win, depending on your preferred strategies, and the items you equip. It's really awesome.  HuniePop is like 2 games in one, with the puzzle part even more fun than the dating part.",
            "review_score": "1"
        },
        {
            "review_text": "You know. ( ͡° ͜ʖ ͡° )",
            "review_score": "1"
        },
        {
            "review_text": "Hunie Pop. A game that though rated Mature, is still a fun game that has a challenge for everyone that plauys it. If you like Bejeweled and other related puzzle games, you'll love this one!",
            "review_score": "1"
        },
        {
            "review_text": "100%-ing this game is hard. 11/10 don't date Jessie",
            "review_score": "1"
        },
        {
            "review_text": "Anybody who basically plays this game is a perv. Stop looking at me. LoL Jk",
            "review_score": "1"
        },
        {
            "review_text": "what.the.♥♥♥♥.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "0/10 needs more waifus",
            "review_score": "1"
        },
        {
            "review_text": "my favorite stealth simulator so far   11/10 would lock themselves in their room",
            "review_score": "1"
        },
        {
            "review_text": "The following is an objective fact  1. Tiffany  2. Celeste = Aiko  3. Kyu  4. Kyanna = Beli  5. Audrey  6. Venus  7. Momo   8. Nikki  9. Jessie  10. Lola  -------",
            "review_score": "1"
        },
        {
            "review_text": "Played strictly for the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "My parents don't let me near my little sister or our cat anymore/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ these birds, am I right?  10/10 ROFLs",
            "review_score": "1"
        }
    ]
}