{
    "app_id": 33980,
    "name": "Pound of Ground",
    "release_date": "2010-11-05",
    "developer": [
        "Centauri Production"
    ],
    "publisher": [
        "Bohemia Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Zombies",
        "Third-Person Shooter"
    ],
    "achievements": 26,
    "positive_ratings": 78,
    "negative_ratings": 49,
    "price": 8.99,
    "description": "Pound of Ground, story driven crazy shoot 'em up with red car and LOTS of zombies. The game combines action elements - a wide range of advanced weapons, fights with various bosses and spectacular, endless battles with the crowds of the undead - with a gripping story full of unexpected disclosures and peculiar characters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33980/header.jpg?t=1521642649",
    "minimum_requirements": "OS: Windows® XP / Vista Processor: Intel® Core 2 Duo 2 GHz or compatible Memory: 2 GB RAM Graphics: 256MB graphics card (Shader 2.0 compatible) DirectX®: DirectX®: 9.0c Hard Drive: 1,6 GB free space Sound: DirectX 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Dull, unpleasant gameplay. Pathetic animation and voice-acting. Laughable (in a bad way) story. Might be one of the worst games ever made. Don't buy it. Just don't.  I give this game 0/10 pounds of ground.",
            "review_score": "-1"
        },
        {
            "review_text": "Pound of Ground is a (mostly) open-world zombie bashing, redneck loving, apocalypse saving, nightmare of a title.  The gameplay can be fun...sometimes, but in general it's painfully clunky. Car driving mechanics are decent and I'm always a sucker for games that let you run over people/zombies. Plus using a Louisville slugger to launch zombies never gets old.  The story is god awful wacky with voice acting to match. The best thing about the story is that the developers obviously weren't shooting for something serious--and they did a superb job in that regard.  Overall I have mixed feelings, but because the game crashes too much, I have to go with a thumbs down. It's playable, but I came close to uninstalling it on several occasions.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT buy this game, it stinks.  I buy a 'Zombie Shooter' and it takes me a long ♥♥♥ time to get a gun? The controls are primative and clunky, the interface stinks, there is little to no help/tool tips within the game. Just awful.",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes me fell like I'm high. I was doing that ♥♥♥♥, so believe me, I know what it's like.  PLUSES: - Quite good music, not the BEST SOUNDTRACK EVER 20\\10, but still very atmospheric. - Graphics are...strange, in a good way. - HOMERUN!!!!  MINUSES: - Voice acting, it's horrible. - Zambies. Why? - EVERYTHING IS GREEN, AAAAH! - No, zombies, really?  THE FINAL SCORE: 7\\10, only for those who wants to LET THOSE GOD DAMN ZAMBIES FLY!",
            "review_score": "1"
        },
        {
            "review_text": "Not worth it. Not even for a dollar. I might consider it a bargain to PAY to have this removed from my library.",
            "review_score": "-1"
        },
        {
            "review_text": "You'll come for the zombies and run away screaming in absolute horror from the bizarre dialog and horrible localization, a real winner for anyone who loves games that are so bad they're good.",
            "review_score": "1"
        },
        {
            "review_text": "Wasted my money on this",
            "review_score": "-1"
        },
        {
            "review_text": "full of humor and fun for 1,90 only love tf2 you like this also",
            "review_score": "1"
        },
        {
            "review_text": "Dear god stay away from this godless piece of crap game. How this was allowed to be sold is beyond me. The game's story is complete nonsense. The opening cinematic jumps all over the place about a farmer shooting down a ufo and the government dropping a nuke and the hero doesn't know who he is but just knows he has to do something about the zombies... besides the generic blah of the story the game is written AND VOICED in the most terribly broken english I've seen in a published game in years. Oh, and the level design is a cluttered mess and strips you of the ability to jump. So you can see you destination right in front of you but a tire or random debris blocks the way so rather than; oh I don't know, WALKING OVER IT you have to find a way around. I picked this game up on a sale and even though it cost about 5 bucks at the time I still feel cheated",
            "review_score": "-1"
        }
    ]
}