{
    "app_id": 33990,
    "name": "Alternativa",
    "release_date": "2010-11-05",
    "developer": [
        "Centauri Production"
    ],
    "publisher": [
        "Bohemia Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 83,
    "negative_ratings": 86,
    "price": 9.99,
    "description": "Alternativa is a story that will take you to a world much different to what you'd expect in 2045. To a world destroyed by war and revolutions, a world led by an oppressive and cruel dictatorship. Classic point&amp;click adventure game based on the original sci-fi/cyber-punk script which is composed of a number of shorter stories that...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/33990/header.jpg?t=1521640173",
    "minimum_requirements": "OS: Windows XP ® or Windows ®Vista Processor: Intel Pentium IV ® 2.0 GHz or compatible Memory: 2 GB RAM Graphics: Graphic card with 512 MB RAM (Shader 2.0 compatible) DirectX®: DirectX®: 9.0c Hard Drive: 2 GB free space Sound: DirectX 9.0c ® compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I can only half-recommend this game. The story and the atmosphere are both good, although I have to agree with other reviewers that there are some elements that seem unfinished (pretty sure more was meant to happen with    the cat outside the apartment   , for example). I liked the setting of a dystopian Prague, since I also know and like the city. The voice acting is decent. but as others have said,    the game's ending leaves many questions unanswered    and this is a slight disappointment.   All in all, I'd recommend it for the atmosphere, decent graphics and decent voice acting. However, it's probably more something who really love adventure games and dystopian themes in particular.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good point and click adventure with a few twists, although puzzles are a bit annoying at times and the ending was terrible! Alright for some light gaming if a bit bored from time to time, got this one on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Painfully unfinished, Alternativa may be the worst point and clink game Ive played in years. Firstly, the game crashes a lot. This can be remedied by running in as an admin, but the game will still however crash sometimes during cutscenes (which it did during the bloody ending credts).   Some puzzles are nonsensical (the very first for example) and a lot of the time lacks any clear hints about what you need to do. This could be down to a poor translation, but some of the solutions are just down to bad game design. Does the story make up for this?  No....Not even a little. Theres an interesting Distopian setting presented here, but its wasted on a plot that travels so fast, that the story itself isnt even fleshed out. There was a twist at one point, that Im guessing was supposed to be dramatic, but as a player you werent given enough background to actually care. As other reviewers have mentioned, the game end on an abrupt note, and feels very unfinished. If the plot was good, I would complain, but I was just happy it was over.  Graphics and voice acting can always be forgiven, bad puzzles and narrative however, cannot.  Avoid, and go play a game published by Wadget Eye instead",
            "review_score": "-1"
        },
        {
            "review_text": "pros: + game universe shows some potential + some nice backgrounds (lo-res though)  cons: - BUGS. Including game breaking bugs and crashes. Save often! - average story told in a below-average way - poor, lifeless dialogs - boring, flat characters - pathetic ending - english voice acting varies from average to pathetic; doesn't have to be true for other languages though - some models and animations are really, really bad (especially security androids, which we encounter quite often) - a lot of small glitches  I really don't like writing bad reviews, but this one is, unfortunately, well deserved. Hard to recommend this game to anyone. It looks (and feels) unfinished and unpolished. Even if it was properly finished, it would probably still be average at most. Universe shown in AlternativA shows some potential though, so if a sequel was made someday, it wouldn't necessarily be as bad as this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Alternativa is a point-click puzzle adventure with a dark story tone and creative artstyle that sets gloomy mood . Be warned that this game feels unfinished and there are major consistency issues with quality of puzzles and story pace . Also there are glitches that can potentially force you to start over if you not doing objectives in a certain order .  It could have been a great game but it just feels like they did not have the funds to do it right . I enjoyed it but you have to play it with very forgiving attitude . I am sure people were angry buying this game for $20 but if you get it under $4 its not that bad .  The best part of this game is definitely visual design which is why I bought this game despite low user scrore . I like the fixed backgrounds which reminds me old Resident Evil games .For what it is the game does look above average considering that most point click games are limited to 2D and have no trailers .   Unfortunatly the voice acting (translation) of main character is out of place and ruins the tension in atmosphere which hurts this game more than anything else .Its hard to appreciate dark tone of the game when main character's voice lacks emotional range . Although some of the other characters are voiced much better and I have enjoyed few moments .  I have to say that overall interface and controls are pretty decent . You may run into few instances where action detection is a bit off but for the most I have no problem with the way game plays .   Puzzles are resonably enjoyable . There were a few really stupid solutions that didn't make sense but there are some creative choices as well that made me feel rewarded . However because game feels somewhat rushed I think it makes it harder to appreciate the story .  Game also features dead ends where you can die by picking wrong text answers and if you want make it harder you can play on harder mode that limits your tries . Sometimes you may want to pick wrong answer just to see what happens ;)  Overall I think game is decent (just not $10+ decent) . Most people will probably hate it but if you open minded gamer you might notice some inretesting and creative ideas .  Score : 6/10 . It had some potential but overall the pace of the story,glitches and rushed parts made it feel like unfinished mess .",
            "review_score": "1"
        },
        {
            "review_text": "Weak plot, weaker world building, flat characters, dropped hints that never amount to anything, mostly terrible voice acting, easy puzzles which only become complicated because of hidden hotspots or having to slowly move over several screens... and just when things get interesting, it ends abruptly. It seems like this was meant to be a bigger game but got cut in half at some point. I got AlternativA for sale at an extremely cheap price, but it still isn't worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels like i'm playing some mod of half life but in point and click genre due to the fact that there are robot soldiers in game that are called 'the combine' and the game feels so helpless just like half life 2 is. The story is an interesting one and gameplay is great. I like how the game gives you plenty of time to flee from enemies in some of the missions.",
            "review_score": "1"
        },
        {
            "review_text": "This is my kind of game. Great storyline, cyberpunk. What else do you need?",
            "review_score": "1"
        },
        {
            "review_text": "half an hour played: easy puzzles, dated graphics, really bad voice acting, unoriginal story. dont waste your time.",
            "review_score": "-1"
        },
        {
            "review_text": "You're classic point&amp;click adventure game with a 2.5D aspect. As a whole, the story is good, but not great. It felt more like a prototype concept game than a complete game. Some puzzles can be a little challenging if you happen to miss something in particular.  The game and story starts out to be intriguing and feels like there is a lot of content and story to explore. As the game gradually progress, the scripts shows signs of weakness. Even the narration goes off beat and weak like if the voice actors lost interest or didn't care anymore. It feels like the writer was rushed or didn't know where to go with the story.  A very short game with pretty much no alternative paths or endings. There seems to be no sequel to the story or gameplay as additionnal game information is very limited, even after 5 years. I doubt there will ever be a sequel.  Beside for the graphical art, I wouldn't recommend unless at a very great discount. There are better sci-fi point&amp;click adventure game out there.   Seek elsewhere or you'll feel let down and dissapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "well a chec hit for sure lol",
            "review_score": "1"
        }
    ]
}