{
    "app_id": 340070,
    "name": "Battle Ranch: Pigs vs Plants",
    "release_date": "2015-02-02",
    "developer": [
        "Playboom"
    ],
    "publisher": [
        "Playboom"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Strategy"
    ],
    "achievements": 16,
    "positive_ratings": 408,
    "negative_ratings": 411,
    "price": 0.79,
    "description": "Fight off hordes of enemy pigs in this 200 level strategy, tower defense, and time management game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340070/header.jpg?t=1492975230",
    "minimum_requirements": "OS: Win XP, Win 7, Vista, Win 8 Processor: 2 GHZ Memory: 1 GB RAM Graphics: 128 MB DirectX: Version 9.0 Storage: 450 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "   Basic Information",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like Plant vs Zombies? Have you looked for a similar game? Well Battle Ranch is very much like it.  The first levels you learn how to plant seed, grow plants and defend against the enemy wild boars. You get new tools as you progress through the levels, the season changes and new enemies comes with that.  This PC port is decent. I noticed some low resolution textures in the introduction film but the game itself looks alright. It should be able to run on most systems. You can play it in window or fullscreen, whatever you prefer. Battle Ranch does not support 1920x1080 resolution, however I didnt have any issues with black borders or anything like that.  I haven't seen everything this game has to offer yet, but from what I can tell so far the game has a lot of content, just like Plant vs Zombies (and I put over 100 hours into that game). I will update this review as I progress, but for now I can say that it's an easy buy for any tower defence or resource gathering player out there. It's cheap and fun!",
            "review_score": "1"
        },
        {
            "review_text": "It's quite BOARING...If you're waiting for something like PvZ you will be disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "A nice 1:1 'Plants vs Zombies' clone... for everyone who loved the original. Not as good as 'PvZ' but some new modes and Pirate Pigs instead of Zombies.  Pro: - easy to play Tower-Defense - lots of modes - many plants/weapons to use - cheap (under 1 €)  Contra: - Loading times too long (starting game, opening level) - simple graphics - not really innovative  When 'PvZ' had a 10/10 this one's a 6/10 but it's worth trying for that low price. I'm still waiting for 'PvZ 2' on Steam and untill it's not released I play some rounds with those 'Pirate Piggies';-)  Jake ",
            "review_score": "1"
        },
        {
            "review_text": "This is a really dull, boring and bland clone of  Plants vs. Zombies . There are few new mechanics, but they are really bad and overall not worth checking out.  Game is lazily designed, lazily made and isn't supported anymore (last update was aeons ago).  Yes, it cheap. And yes, it has cards. But would I recommend buying it? Not in a lifetime.",
            "review_score": "-1"
        },
        {
            "review_text": "  I'll get straight to the good and bad things about this game  The good +Nice music which goes with the feel of the game +Good wallpapers given for free for both 4:3 and widescreen +A guide is available for all levels which tells you what order to place the plants and where, which is useful if you get stuck on a level  The bad -Animations and art are definitely not as smooth as PvZ -inconsistency with model changes. Some plants change their look when they become severely damaged, others don't   Summary If you want a PvZ-like game but don't want to pay ~£5 for PvZ then this game is a good choice and for less than one quarter of the price, it offers more than one quarter of the fun (~_~)  Really though this game is pretty good for the price but if you do want to play a PvZ-like game just buy PvZ.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is fairly similar to Plants vs. Zombies, but has some unique aspects to it as well. Instead of planting everything in one plot for battle, there are two separate plots; one for gaining sun and the other for planting battle plants. Instead of zombies you are fighting boars that possess a variety of different weapons. Every level in the campaign offers a unique experience in that you get new plants or items available after completion. Some of the things that remained consistent between PvsZs and this game are the garden, shop, some of the battle plants, and side features that get unlocked as you play further. That said the game offers a unique enough experience that I enjoyed playing it for a while. If you are a PvsZs fan then this game would be great to get on a sale or maybe even at full price if you liked the other a lot.",
            "review_score": "1"
        },
        {
            "review_text": "A really bad PvZ clone... Really bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool game for spending your time. So if you like PvsZ.",
            "review_score": "1"
        },
        {
            "review_text": "Just a cheaper, lower quality version of Plants vs Zombies. :v",
            "review_score": "-1"
        },
        {
            "review_text": "  Cool Game.",
            "review_score": "1"
        },
        {
            "review_text": "  Never having played plants vs zombies. I feel like I have. This game is at home on a tablet or cellphone not on pc. Almost 700 megs to install. Was a bit of a surprise. Back in the day a game like this would be a couple of megs at best.  That being said: It's a fun puzzle game kinda tower defence / whack-a-mole. A good family game.",
            "review_score": "1"
        },
        {
            "review_text": " In case you are a Trading Card junkie like me",
            "review_score": "1"
        },
        {
            "review_text": "F*ck you guys who recommand this ♥♥♥♥.   It's bugued, less than 30 FPS, slow, no binding, juste drag and drop like all ♥♥♥♥♥♥ smartphone game.",
            "review_score": "-1"
        },
        {
            "review_text": "Nowhere near as good as PVZ. The 2D art and sound is ok.. though the game jumps back and forth between resolutions, the gameplay framerate is sluggish and unresponsive and ultimately boring overall - even with it's multitude of game modes.. which by the way, you can only progressively unlock by slaving it through battle mode. Also there is no replay function in battle mode.. meaning if your going for any related achievements, you have to restart it from scratch. Ouch.",
            "review_score": "-1"
        },
        {
            "review_text": "** I received this game for free for my honest review **  This is a fun take on the Plants vs Zombies game. It looks and plays good for a budget game. There are several different modes to play although I've only played one so far.   I find this to be quite fun and even at the full price of $1.99 it's well worth it in my opinion.  As I play more and try other modes. I'll update this if I find reason to.  EDIT:  In this game you don't directly choose the weapon (plant) you are going to use next. You click a button and it randomly selects one ala slot machine. Some may not like that but I did. It made longer planning slightly more difficult and made for a little more frantic game play.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say?! This is a RipOff and a hell of a bad one at that!",
            "review_score": "-1"
        },
        {
            "review_text": "I don't remember buying this game, but I'm guessing it had to do with the trading cards. Nothing more than a PvZ clone.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  -Authentic artwork and not stolen/bought assets. (Give credit where credit is due)   Unfortunately that's as far as I got because:  Cons: -SLOWEST GAMEPLAY I'VE EVER SEEN. It's not laggy or anything, it's just set 400% slower than a defence game should be. -Music is 10 second loops, and it never seems to change. Ever. -Mini-games last WAY TOO LONG. -Low res menu.  Do I recommend it? No. Do I think people should condemn it for being a pvz ripoff? Not a chance, you knew what ytou were in for when you bought a $1 game.",
            "review_score": "-1"
        }
    ]
}