{
    "app_id": 340000,
    "name": "Headlander",
    "release_date": "2016-07-25",
    "developer": [
        "Double Fine Productions"
    ],
    "publisher": [
        "Adult Swim Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Sci-fi",
        "Metroidvania"
    ],
    "achievements": 31,
    "positive_ratings": 575,
    "negative_ratings": 63,
    "price": 14.99,
    "description": "Launch into the ultimate head trip as you blast through psychotic robots in a retro 70's sci-fi action adventure from Double Fine Productions. It is a world of automation, a utopia gone wrong in which all of humanity have transferred their minds into robotic imposter bodies and are ruled by a computer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340000/header.jpg?t=1479501250",
    "minimum_requirements": "OS: Windows 7 (64-bit) Processor: Dual-core 2 GHz Memory: 4 GB RAM Graphics: GeForce GTX 550 Ti, AMD Radeon HD 7750 Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows 7 (64-bit) Processor: Quad-core 3 GHz Memory: 4 GB RAM Graphics: Nvidia GeForce GTX 750 Ti, AMD Radeon R9 270 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "It took me about 10 hours to 100% the game  The game is extremely colorful, which is something I really enjoy. The setting is pretty interesting, and for the most part you have a clear objective.  The only thing I really hated was that there were a handful of secret achievements that I had to google once I beat the game regularly. I had to start a new game just to get the Male Driver achievement, so look that one up before you start a playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Take Ori and the Blind Forest, grab Ori by the head, jam her in a astronaut helmet and make her fly around. Then swap out nail-bitingly hard platforming with laser puzzles, change the sorrowful fantasy forest into a groovy 70's scifi spaceship, transform monsters into murder robots, harmless creatures into dancing drones. You get to keep the stunning visuals and tight controls, but you'll have to give up a story that tugs your heartstrings to make room for literally tugging off heads of an army of rainbow-colored robots.  Sounds like a good deal to me.",
            "review_score": "1"
        },
        {
            "review_text": "Man, I'd never heard of this game until today, but Double Fine have done it again. Exactly what I like. A platformer with innovative gameplay mechanics, tight controls, clean and well-performing gameplay and graphics, interesting storyline, humor. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun puzzle game. Sci-fi and physchadelics mix well to give a unique atmosphere that feels really new while also being very retro.",
            "review_score": "1"
        },
        {
            "review_text": "I was enjoying it until the chess level. Now it's annoying. Nothing worse than having a good experience ruined by putting something terrible right in the middle.",
            "review_score": "-1"
        },
        {
            "review_text": "  I'm currently at 98% completion on this game and it's going to make me lose sleep tonight, I want to complete it so bad. A well-executed 2D exploration game with a distinct 1970's style, a fantastic soundtrack, good old Double Fine humor, and gorgeous environments you genuinely want to explore. I wouldn't recommend it for those who aren't fond of a lot of bright colors and flashy lights, though. But if your eyes can take the strain, get the game.  (I was trying to find a way to incorporate '70s slang into this review but I couldn't so. Uh. Groovy. There ya go)",
            "review_score": "1"
        },
        {
            "review_text": "This game is so well done it hurts my feelings.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic Metroidvania style game with all the charm and humour you expect from the lads and ladies at Double Fine.  It's a solid, fun game, It's not all that expensive and it looks like a 70's sci-fi film, what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "One of the few games that was actually compelling enough for me to finish this year, Headlander was a barrel of fun. A great introductionary game to the Metroidvania genre (of which I've personally never been a fan of, but this game has persuaded me to give them another chance).  The mechanics are solid, the controls are tight, the humour is there but it takes a back seat to the gameplay unlike other Double Fine games but it works in the setting and helps built the atmosphere. If you're a well seasoned Metroidvania enthusiast you probably won't enjoy this game as much but if you're new or unsure to the genre, I highly recommend giving this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic little game full of puzzles! It took me just under 7 hours to complete the story and find most of the secrets, and I loved every minute of it! I love the attention to detail that was put into the game.",
            "review_score": "1"
        },
        {
            "review_text": "Headlander is a fantastic metroidvania title that oozes 70's retro-futuristic charm.   SERIOUS SPOILER, DO NOT LOOK IF YOU HAVEN'T COMPLETED THE GAME!    ♥♥♥♥ THE METHUSALA TITAN, ♥♥♥♥ THE FINAL PHASE THAT KNOCKS YOU BACK TO THE START OF THE SECOND TO LAST PHASE.   ",
            "review_score": "1"
        },
        {
            "review_text": "Nice simple metroidvania (google it, even I'm not that lazy) made by the people who did Psychonauts and Brutal Legend. It has a nice 70's aesthetic with a wierd scifi story. You play as a flying disembidied head who has to save a spacestation's resident people who have had their bodies stolen, and now inhabit robot bodies! Its far out man, could'a used more burgers and shakes though.  4 outa 5 hamburgers",
            "review_score": "1"
        },
        {
            "review_text": "Great fun. Fun puzzles, fun story, fun presentation, wacky fun idea.  FUN!",
            "review_score": "1"
        },
        {
            "review_text": "A month after playing the game and I'm still murmuring things to myself in Methuselah's sexy voice. I'll let you figure out whether that's a recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but a bit short game, well worth the playthrough though.",
            "review_score": "1"
        },
        {
            "review_text": "I am loving this game. The sound design is amazing. Its very quirky. But its also well paced and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "A nice game if your looking for some Metroid like action with a twist! This game has a flashy 1970's sci-fi artstyle to it, it is so colourful and groovy! Set in the future where humans have transferred thier consciousness into robot bodies, you play as the last Human alive who is a floating head with rockets! You can take the heads of these robot bodies and then pop your own head onto their bodies and use them. Take control of a robot dog, and use to go through small doors, or gain access to a security guard who is colour ranked, which allows you to head though security doors and shoot a lazer weapon that bounces all over the place! A very fun game will recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Just wow. I just finished this game and I had to come and review it. This is the first game I've ever reviewed on steam. This game is a masterpiece. They did an amazing job on the music and atmosphere of this game. There are puzzles and action throughout. Definately pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "This has to be The whacked out game of all time. Well Style, great original game play. Well worth picking up and adding to your library.",
            "review_score": "1"
        }
    ]
}