{
    "app_id": 340270,
    "name": "TIMEframe",
    "release_date": "2015-07-07",
    "developer": [
        "Random Seed Games"
    ],
    "publisher": [
        "Random Seed Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Walking Simulator"
    ],
    "achievements": 14,
    "positive_ratings": 362,
    "negative_ratings": 173,
    "price": 4.79,
    "description": "Time is relative. Sometimes 10 seconds can feel like an eternity... In TIMEframe you will discover a world in slow motion. Explore the remnants of a mysterious civilization on the brink of destruction.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340270/header.jpg?t=1478024732",
    "minimum_requirements": "Processor: 4 Core 2.4Ghz Memory: 3 GB RAM Graphics: Nvidia GeForce GT 755M | AMD Radeon HD 8870M Storage: 780 MB available space",
    "recommended_requirements": "Processor: 4 Core 3.2Ghz Memory: 4 GB RAM Graphics: Nvidia GPU GeForce GTX 660 | AMD GPU Radeon HD 7870 Storage: 780 MB available space",
    "reviews": [
        {
            "review_text": "I have sat by and watched the games media criticize games like 'gone home' and 'dear esther' for not being games. This has always really bugged me. I for one loved those games and thoroughly enjoyed playing them. But I now understand what games critics say when they call something 'not a game'. TIMEframe is an 'experience', not a game. To me what makes the prior ones games and not this one is the fact that you actually feel like you are achieving something, even if in reality you aren't.   In the likes of gone home you do similar to TIMEframe were you just walk about and collect items that give you information. The difference with gone home is that these items give you a sense of a story. So when collecting these items you are doing it for a reason and are discovering new things in the process. But in TIMEframe the locations you have to discover give you only a short note. The notes don't have much relation to each other and aren't interesting to read. I didn't feel any anticipation for what would lie at the next location.   So the steam description mentions that the world is in slow motion. How exactly does this affect my gameplay? The answer is that it doesn't. This is what I found most intriguing when looking into this game. But it has basically no input in the game aside from making it look good. Some items in the world that would usually be moving instead are moving in extremely slow motion. I have to admit they did look nice in this style but I was hoping slow motion would be a mechanic in the game that I would be able to use to my advantage.  But what is the goal of the game? There are 14 different iconic locations scattered around the map. Your goal is to go to each of the locations. When you reach each of the locations you get a short extract to read. This seems simple enough right? The problem is the game seems to try to hinder your process every 10 minutes. There is a meteor that is coming down on the world in slow motion. After 10 minutes it hits, the screen goes white and you are teleported back to the beginning to go and explore again. I personally would have preferred it if I had the option to teleport back to the start whenever I wanted instead of having it forcably put upon me all the time.   A lot of flaws I would have been able to ignore if it was for one thing. Did I learn anything? I assumed that these extracts would help me learn something about the era the game was meant to be set in. They didn't. Although some of the extracts may have been telling me about the culture or such I wouldn't have had a clue if they were. The text was written in such gobblygoop that I couldn't follow it or have any idea what was going on.   Ok so there is one thing to praise in this experience. The graphics are incredible, to an extent. From a distance the world does look absolutely beatiful. The developers chose to create the game in a very pretty styilized way that definitely adds to the experience in a great way. The particle effects are also really nice looking and create a bit of an atmosphere. But from close up the graphics aren't as appealing. They are very unconsistent on small details. The plants and grass is something that I feel doesn't fit the rest of the graphics style and just put's me out of the experience a bit. So the graphics are great from a distance but not so nice from up close.   What about from a technical standpoint? The game runs absolutely fine. I had pretty much a constant 60fps throughout and experienced no issues with gameplay. But there is one major problem. There is a very large amount of popin. You can clearly see small items such as grass and rocks popping in from a very short distance away as you explore. This is another thing that slightly ruins the experience for me.   So who should buy this game? Certainly not anyone with the same views as me. I personally don't see any fun in playing this game. But as you can see from other reviews there are plenty of people that aparently enjoy it. It's just not for me. If you enjoy just walking about and exploring and experiencing a beatiful atmosphere at the same time then this is definitely for you.   How reasonable is the price? I completed everything there was to see in the game within 50 minutes. This isn't a huge amount of time to find everything. I also got all of the achievements. To me the price of £5.59 sounds a little bit steep for the amount of content actually present in it. Especially since I didn't actually enjoy the experience. If you are still interested, even after everything i've said, then I would say wait for a sale of at least 50% off to buy it and try it out.    TheIronicGamers rating system",
            "review_score": "-1"
        },
        {
            "review_text": "Really nice piece of art in game form. 2hrs-ish of really neat gfx, finding some story lore, and AMAZING music! Would love to see this dev do something bigger...  I got this for 4.95 but even at 7.99 and it is unique and gorgeous enough to warrant that. As I said, this dev really needs a shot at a bigger game, they could do something amazing :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a tremendous little walking sim. It'd been on my backlog for a while and this peaceful Sunday morning i decided to give it a crack before breakfast. Perfect. You relive the last dying seconds of an alien civilization, the world near-frozen as you wander a valley scattered with antiquities and relics. The engine is a little rough - you can't jump or climb and it is possible to get inescapably stuck in a hole - but this is a minor quibble when the music is so good and the aesthetic so strong. A fabulous melancholy permeates it all. It's not quite Proteus, but it's very good.",
            "review_score": "1"
        },
        {
            "review_text": "The idea is nice. It's a shame, therefore, that the developers of Timeframe didn't turn it into a proper game: it's more of a proof of a concept and, as such, overpriced.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game on somewhat of a gamble. I haven't heard anything about it prior: I just watched the trailer and read some reviews and got interested. I must say, the gamble certainly paid off. But then again, I don't have a very orthodox taste in games.  The game plays exactly how it's advertised: you walk around and explore the world and pieces of its' lore. The visuals are beautiful (Unless you are the type to count polygons.) and the music is fitting. The world is very atmospheric, albeit I wish it was a bit more detailed.  I've spent around an hour on one playthrough and it was well worth my time. Whether it's worth your money is for you to decide. I've really enjoyed playing it and I'm glad that games like this one are able to find their place on the market.",
            "review_score": "1"
        },
        {
            "review_text": "You have all the time in the world; so better hurry!  This game has an interesting incentive to play it over and over again: It limits the amount of achievements you can reach per try. The first time its charme may be as brittle as its graphics; but the more often you play it to collect the parts of the whole solution, the more you discover beauty in simplicity.  You may rush through to grab possibly up to 4 locations in a row before time runs out this turn; or would you rather take a little more of your precious time, looking around, discovering seemingly unimportant details, and reading the different facts which create a better picture of this lost civilization?  Oh, time is over; think about it again next time. And when done, think about your own life: Isn't it way too short as well? But there you can't try again to see what you may have missed.",
            "review_score": "1"
        },
        {
            "review_text": "This game is definitely something you'd play for some relaxation. League of legends rage? Come here. CS GO or other rage just come here and explore some artifacts and get rekt by a meteor every now and then. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  Nice music, ok gameplay, however non-existant tutorial or guide (although there is an amazing community guide).   However there is no way this game is worth 8 dollars. I probably wouldn't even buy it if it was $1-2. It has relatively little replayability to it.  ",
            "review_score": "-1"
        },
        {
            "review_text": "game isnt half bad i love the music .",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet, easily finished in an evening. A lot of traipsing between points of interest...but when found, the mythic architecture and fragments of lore give a tantalising glimpse of a millenia-old civilisation. I wanted to learn a lot more about the world than was revealed, which is the mark of a good narrative. It won't keep you busy for long, but it will keep you thinking about it long after you stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game in one sitting, and I'd have to say it was a relaxing experience. The graphics are wonderful, and the ambiance of the world is quite appealing. I enjoyed the writing style of the different clues left around, and piecing together what they informed me about the culture was a fun intellectual exercise. I would highly recommend this game, although I imagine it's not for everyone. Some may complain it's not a 'game' and I won't quibble about definitions. To me, this is a piece of art that is well worth the money and time it takes to experience. It transported me out of my own world and into another for an hour-and-a-half, and I was thoroughly entertained and engaged the entire time. The only complaint I have is that to me the ending seemed a little ambiguous, and I would have enjoyed a few more answers after completing the quest. In any case, my congratulations to the devs for their work on TIMEframe, and I am highly anticipating future releases from Random Seed Games.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game. Liked the surreal and ancient buildings. The game isnt that long, although there is something which interrupts your journey (for a reason), which is kinda like a simple and creative thing.  If you like walking simulators and surreal games, its sure a recommend game.",
            "review_score": "1"
        },
        {
            "review_text": "A great walk through game.................awesome soundtrak !!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, uncovering a story of a lost (?) civilization. While graphically impressive in its own way, dont expect GTA V level stuff. the exploring (gameplay) is amazing, and just feels right. The stroy will entice you, and you will play the game through in one sitting. (really tho about as addictive as coke-covered meth cubes) And the music? this guy whould go on tour. All in all, worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Seems more like a conceptual game than anything else, and that concept was used really well in Legend of Zelda Majora's Mask, but there are some pretty pictrures in this game too",
            "review_score": "1"
        }
    ]
}