{
    "app_id": 340200,
    "name": "Bloop",
    "release_date": "2015-01-16",
    "developer": [
        "2SD"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 153,
    "negative_ratings": 197,
    "price": 3.99,
    "description": "Ignite your imagination with a whimsical 2D liquid physics-based puzzle game by Studio 2SD!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340200/header.jpg?t=1447366524",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core 2Ghz+ Memory: 1 GB RAM Graphics: 128Mb VRAM with Shader Model 2.0 DirectX: Version 9.0c Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows 7 or above Processor: Dual Core 2Ghz+ Memory: 2 GB RAM Graphics: 256Mb VRAM with Shader Model 2.0 or above DirectX: Version 9.0c Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": " Bloop  is a pretty good puzzle game which might seem basic at first glance, but quickly becomes accessible to only die-hard puzzle fans who don’t mind spending a lot of time on a single level. It features a lot of content for a low price and has nice physics and a big challenge, however, it’s kind of annoying that you can’t skip levels at all if you’re stuck on one.",
            "review_score": "1"
        },
        {
            "review_text": "Not recommended. (For me) This game is bugged the f*ck out. The first cutscene is weird, he first says what he's supposed to say at the end, and I don't see the game itself. Just that Bloop floating there. Don't waste your money on this, unless you got it for free like me...",
            "review_score": "-1"
        },
        {
            "review_text": "Pour the Bloop goop into containers, learn to avoid/defy/tweak the laws of physics to your advantage and just relax in this fun little clicker.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an interesting little game, it has a good concept and mechanic, unfortunately it faisl with level design quite early on.  Instead of levels that make you think of a solution, within the first 5 levels it was basic approximation and 'hope' that you could convince the physics to work in your favor.",
            "review_score": "-1"
        },
        {
            "review_text": "Too expensive at free",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Whenever I first bought this game it looked like a simplistic physics puzzle game... and it is. However upon installing and playing the game I quickly realized that it was not worth the four dollars I had payed for it.  -Negative  First of all, the play button, instead of simply saying 'Play' It says 'fun, fun, fun' and in order to exit the game you have to press 'Blue Pill' instead of 'Exit'. I'm sure that this is a reference to something, but the title screen of a game is not the place to put references. Especially is the reference replaces the name of an important button. The creators should have put the refernces in the story or as images that blend well with the levels. How to start playing a level is also unclear. There is no mention of how to start the level, all you can do is experiment ( You start a level by double clicking, by the way ). The opening story is also beyond bugged. It's completely broken. Images only appear half of the time, the text repeats its self sometimes or is completely out of order and sometimes the game just comletely crashes. It also seems like the creator does not know what the game will do. At about the third or fourth level 'elevators' are introduced and there is a text box that pops up saying that the elevators will move eventually. Making it seem like they did not know how often they made the elevators move. Not to mention that the game does not use the best grammar ( Which is just a pet peeve of mine, it is not anything game breaking, it would just make the game seem a lot nicer if it had good grammar.) or that I had to restart the game four times just to get it to work.  +Positive On the contrary, this game does have an interesting concept and could be good if they spent a little more time on it. For example, spend more time on bug fixing and proofreading the game and maybe even thinking a few of their original decisions over in order to try to make the game more 'user friendly'. I also like the name of the game.   I hope to see some fixes in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "Whenever I first bought this game it looked like a simplistic physics puzzle game... and it is. However upon installing and playing the game I quickly realized that it was not worth the four dollars I had payed for it.  -Negative  First of all, the play button, instead of simply saying 'Play' It says 'fun, fun, fun' and in order to exit the game you have to press 'Blue Pill' instead of 'Exit'. I'm sure that this is a reference to something, but the title screen of a game is not the place to put references. Especially is the reference replaces the name of an important button. The creators should have put the refernces in the story or as images that blend well with the levels. How to start playing a level is also unclear. There is no mention of how to start the level, all you can do is experiment ( You start a level by double clicking, by the way ). The opening story is also beyond bugged. It's completely broken. Images only appear half of the time, the text repeats its self sometimes or is completely out of order and sometimes the game just comletely crashes. It also seems like the creator does not know what the game will do. At about the third or fourth level 'elevators' are introduced and there is a text box that pops up saying that the elevators will move eventually. Making it seem like they did not know how often they made the elevators move. Not to mention that the game does not use the best grammar ( Which is just a pet peeve of mine, it is not anything game breaking, it would just make the game seem a lot nicer if it had good grammar.) or that I had to restart the game four times just to get it to work.  +Positive On the contrary, this game does have an interesting concept and could be good if they spent a little more time on it. For example, spend more time on bug fixing and proofreading the game and maybe even thinking a few of their original decisions over in order to try to make the game more 'user friendly'. I also like the name of the game.   I hope to see some fixes in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "It is quite fun and you need to use your brain so much,",
            "review_score": "1"
        }
    ]
}