{
    "app_id": 34030,
    "name": "Total War: NAPOLEON – Definitive Edition",
    "release_date": "2010-02-25",
    "developer": [
        "CREATIVE ASSEMBLY",
        "Feral Interactive (Mac)"
    ],
    "publisher": [
        "SEGA",
        "Feral Interactive (Mac)"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Historical",
        "Grand Strategy"
    ],
    "achievements": 71,
    "positive_ratings": 8540,
    "negative_ratings": 907,
    "price": 0.0,
    "description": "Complete your Total War collection with this Definitive Edition of Total War: NAPOLEON, which includes all DLC and feature updates since the game’s release",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/34030/header.jpg?t=1548693685",
    "minimum_requirements": "OS:Microsoft® Windows Vista®/XP®/Windows® 7  Processor: 2.3 GHz CPU with SSE2  Memory: 1 GB RAM (XP), 2 GB RAM (Vista®/Windows® 7)  Graphics: 256 MB DirectX® 9.0c shader model 2b compatible GPU  DirectX®: DirectX® 9.0c  Hard Drive: 21 GB free space",
    "recommended_requirements": "OS: Microsoft® Windows Vista®/XP®/Windows® 7  Processor: 2.6 GHz Dual Core CPU  Memory: 2 GB RAM (XP), 4 GB RAM (Vista®/Windows® 7)  Graphics: 256 MB DirectX® 9.0c shader model 3 compatible GPU  DirectX®: DirectX® 9.0c  Hard Drive: 21 GB free space",
    "reviews": [
        {
            "review_text": "Better ship battles in this game than games about ship battles.",
            "review_score": "1"
        },
        {
            "review_text": ":Russia: Buys 10 units Great Economy and army  :Prussia: Buys 10 units Best army in the game  :Britian: Buys 1 unit Economy Crisis  10/10 would make Britian fall again",
            "review_score": "1"
        },
        {
            "review_text": " Basic Information",
            "review_score": "1"
        },
        {
            "review_text": "France messed with me, they are no more Russia messed with me, they are no more Austria messed with me, they are no more Spain messed with me, they are no mor Prussia messed with me, they are no more,  Portugal messed with me, they are no more Denmark messed with me, they are no more Sweden messed with me, they are no more The Ottomen Empire messed with me, they are no more Saridina messed with me, they are no more The Batavaian Republic messed with me, they are no more My mom came in, I am no more",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon Total War is a Tactical Wargame set in the Napoleonic Wars. That is why Napoleon Bonaparte is in it. Made by Creative Assembly ages ago, it was the first game I had, and the ultimate reason I ever got Steam. 3 years later it is still among my favourite games, and I still play it - though to a much higher quality than I used to.   Set in the Napoleonic Wars, as stated above, the main Campaign covers Napoleon’s Campaigns in Italy, Europe, Egypt, and the Peninsular. You are put in command of the French army, and in a certain amount of turns, must complete the campaign ending in a French victory. These campaigns are fun to play, and it feels good to replicate Napoleon's later military career, slaying his foes on the field, though I must be honest I do not think it is the best part of the game.   Alternatively, if you do not want to play as the French, there is the 'Campaigns of the Coalition' option where you can play as any one of the 5 military superpowers of the era. Those being France, ♥ Great Britain ♥, Austria, Prussia, and Russia. Depending what type of campaign you play, they vary in length and difficulty, but you must strategically put your foes to the sword in your best efforts to meet all of your objectives, thus making your nation the very best it can be. Elite not only in Military and Navy, but also economy, and technological advancements. I wrote a campaign  guide  (For Great Britain) which you can view here, showing and explaining in more detail what you can do in a Campaign, and things that may aid you, such as Spies, Gentlemen and of course your control over the Government, and how to use them effectively.   Napoleon really stands out from all other Total War titles in its battles, which are extremely well made. While I do not like many of the maps, and wish perhaps there could have been more, for the most part, games both multiplayer and single player require a lot of strategy and logic to win. There are varying difficulties, though with some experience, the AI soon becomes too easy for everyone, but each demand a more thoughtful approach to the tactic you use in order to ensure your ultimate victory. I've also made a guide on how I fight  battles , again as Great Britain. It was made a while ago, but my tactic hasn't really changed. Sorry if it's written badly in places, but I didn't want to edit it for memorabilia :D   This is my opinion, and many don't agree, but I believe Napoleon was the best Total War game. It's interface is simple and easy to use, but effective too, while still looking good. Graphically I think it walks all over the likes of Shogun 2 and Rome II, despite is age in comparison to the two. The combat engine is good, and fights, both shooting and melee, are fun to watch. The only criticism I do have are its musket sounds. They are quite bad, but this doesn't ruin the feel of the game.   Another reason I am so fond of this game is undeniably the era. I really like the Napoleonic wars, and oddly enough this game sparked my love for it three years ago, and so, to me, there is not another Total War like it. I've no interest in Roman or Medieval history, so perhaps my high opinion of it is partly because of that.   Overall, it is a great game. It's few small floors such as men charging the wrong way, and infantry not forming square in time for cavalry can be annoying, but they don't kill the game for me. I would give this game a proud 9.5/10. It's Creative Assembly's best work, and since then it's on a steady downhill decline for me, with their terrible interfaces and annoying camera restrictions in games such as Shogun 2 and Rome II, but that's for another review.   Thank you for reading my review :)",
            "review_score": "1"
        },
        {
            "review_text": "1st move - Declare an allience. 2nd move - Ask for military access. 3rd move - Move in ALL your troops into your allies territory. 4th move - Declare war. 5th move - Attack each of it's cities, one by one.  10/10 would destroy a whole nation in 5 moves again.",
            "review_score": "1"
        },
        {
            "review_text": "Best total war game, hands down.",
            "review_score": "1"
        },
        {
            "review_text": "Very good Total war Game except Total war Rome 2 ! .  I played this 363 hours ! the most time of all games ! just wow !   Good strategy game , nice multiplayer + cooperation .   Sometimes FPS getting crazy with more artilery :D   8.5/10   I recommend to play this game !   31.12.2014",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon Total War  This is a pretty good game. It is basically Empire Total War with a few changes. It runs and plays well. I like the soundtrack in this game.  There are not as many small kingdoms as in Empire Total War. Battles tend to be large. Both of these things can be positive although I like having many smaller kingdoms on the map. Of course a long Empire Total War game has fwe remaining kingdoms late in the game and most are rather large.  This is an excellent time peroid for warfare. Artillery, Cavalry and Infantry are all useful on the battlefield. There are many cool units during this time period.  There are off map trading sites similar to those found in Empire. These trading sites are nice for extra income.  Napoleon Total War is one of the good Total War games. Total War games are great. I like them. I need to spend more time with Napoleon but am hooked on Empire for now.",
            "review_score": "1"
        },
        {
            "review_text": "The first Total War game I bought and my most favourite as this game has some of the best mods out there like The Great War Mod,Darthmod and Napoleon Total War III.The only slight negative is that the campaign map is a bit small as they could have added the peninsular campaign and and a few more playable grand campaign factions.Also there is great multiplayer as there are great maps and historical units. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Positives:  - Game is fun and replayability is high.   - Great graphics.  Negatives: - Painfully stupid AI incapable of even forming and maintaining a battle line and a whole lot of things that ruin the immersion.   - Slightly relies on mods to keep the game fresh.",
            "review_score": "1"
        },
        {
            "review_text": "The Good: Very fun and in depth game. Few games give you this time frame in world history and let you have the option of both fighting on the battlefield and taking a tactical world view/city managing view of things.  The Bad:  If you are a single player type of person, this game is not for you. The AI battles are incredibly easy even on the hardest difficulty. The AI troop movements are as if they all suffered some type of dabilitating disease and have become mindless zombies, walking straight into cannon fire and allowing my army to completely destroy them before they even have a chance to attack. This is game breaking for me.  Overall: For the price of 20 bucks it really is a fun and fast fix. the battles (though the AI is as dumb as a box of rocks) are very in depth and create a lot of oppurtunities to have fun and expiriment with different unit types, ",
            "review_score": "1"
        },
        {
            "review_text": "This game had some pros and cons to it but I feel like it was missing out on a lot of things. I missed the whole world map being involved like it was in Empire: Total War. I feel like Empire: Total War was a better game all the way around. I think the limited ammo and diplomatic things that you could do in this game was really neat. Overall, I would suggest buying Rome: Total war, Rome: Total War 2, Empire: Total War, and Fall of the Samurai over this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS game of the century, thank you sega",
            "review_score": "1"
        },
        {
            "review_text": "Vive la france as the french would say it Napoleon is the 6th Total War game and is fun if you want to change history around aka break time completely theres barely any mp lobbys open but if you are like me get a few buddys that have this game and there you go 10/10  P.S if you really find this easy get DarthMod and if you don't like napoleon's era then get The Great War as that mod is fun",
            "review_score": "1"
        },
        {
            "review_text": "Hail Mother Russia!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game that sums it up, GRRRRREAAAAAAATTTTTTT ",
            "review_score": "1"
        },
        {
            "review_text": "Well with just over 109 hours of my life playing this game, I can indeed recommend this to those who enjoy a late Sunday afternoon of killing the french and laughing with your English friends, but all jokes aside.   Napoleon: Total war is a game that has a level of strategy that will cause even the best of the game series to sit down and think of their next step in overthrowing their opponent.   Many of you who read this will know that Napoleon: Total war isn't the first of its kind, as you already know that the Total war series takes you to different time periods, pushing the player into different scenarios that will test the player's skill to direct his/her army to victory, by any means necessary.   In Napoleon: Total war, you fight against the AI in some well done (short) campaigns. But the real meat of this game is the online aspect. Sadly, not many people play this gem, as they say, that Empire: Total war was the better of this time period. I will decline their opinions and state, that Napoleon sits in favour of my taste. The game does better to sit you in the midst of the battles, not only reducing the factions you can choose from but giving them a bit of their own flavour and the diverse nations to bring their own types of units (Up to a max of 20) into battle to take own another player, whom has most likely just chosen their favourite faction that they always play with.   Many probably won't believe me, many won't care. But Napoleon: Total war is easy to pick up, but hard to get good at (Not a hard learning curve). Because at every turn, someone will surprise you, whether it be a sudden and devastating surprise attack at the rear, or maybe they have decided to lure you in, only to bring in the good units at the last moment to seize the day. No matter your play style, you will find someone (Mainly if they have better than 3 stars) that will put up a challenge and make you feel like a general, fighting your own battle and making your own tale of glory.   Oh and it has a turn-based campaign, but nobody really plays that. If you want to play the campaign, go get Medieval 2 or Shogun 2.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game, the era is my faviourate time period, and it feels as though you are Wellington, Fighting at the Battle of Waterloo, Or Napoleon at Austerlitz. A definate must have, but it does have some flaws, such as The AI isn't the best, Charging with one unit at the time at my elite foot guards, or attacking my heavily fortified castle with a few militia soldiers. It is a huge improvement over Empire:Total war, And the DLC force you to change playstyles with the different units.   The AI is a bit dissapointing when it comes to fighting, such as when I charge with cavalry they don't form square, or how the artillery would target my fencibles when they were in thin line instead of attacking my foot guards who were in square  pros- Very good game a large array of units, and most countries are playable. first person mode is alright, and when your guy shoots, you spectate the bullet (insert to first person)  Cons- Bad AI The map feels cramped ",
            "review_score": "1"
        },
        {
            "review_text": "Best total war game by far!  Epic battles with artillery and line infantry. Great campaign plus you get to play the napoleon campaign and conquer egypt, italy and russia. Amazing navy warfare  Get to play historical battles.  Co-op campaign and awesome 4 v 4 online battles  If you like RTS games this is a must get!",
            "review_score": "1"
        },
        {
            "review_text": "A great game really,effects and Camping, Battle, really great with everything... :)",
            "review_score": "1"
        },
        {
            "review_text": "Bought this only to play The Great War mod, I don't regret it ^_^",
            "review_score": "1"
        },
        {
            "review_text": "This game represents refinements to gameplay from Empire: Total War. The map is constrained to Europe only, and it's for the best. Seasons, attrition, better options in diplomacy find this being my favorite of the TW series. While it is certainly far from perfect, and not a true simulation of Napoleonic warfare like  Histwar: Les Grognards , this game is super enjoyable. It's best to use either a collection of small mods, or a sweeping overhaul style of mod to make your experience even better.",
            "review_score": "1"
        },
        {
            "review_text": "It's very fun! I like it better than EtW! Only thing is it seems more people like to camp in this compared to Empire.",
            "review_score": "1"
        },
        {
            "review_text": "Its overall mostly historically accurate and will bring many hours of fun and entertainment for people of most ages.",
            "review_score": "1"
        },
        {
            "review_text": "The intro is so badass. I keep watching it over and over again",
            "review_score": "1"
        },
        {
            "review_text": "Awsome 10/10 great adventures and tons of battles",
            "review_score": "1"
        },
        {
            "review_text": "I've had it for over 5 years now and I'm still playing it! So that alone should tell you how awesome the game is!",
            "review_score": "1"
        },
        {
            "review_text": "After putting in over 30 hours into this wonderfully crafted strategy game during the era of the Napoleonic Wars I can say for sure without a doubt that any tactically player or historical player will LOVE this game! Imagine managing any one of the multiple major nations at the time such as Russia or Britain, allowing you to make any decision from controlling your government, trade, industry, research, diplomacy and of course your most important is your military. Now not only are you given objectives to complete within a certain time period but also it gives you the chance for European domination as any one of those major nations. Plan your nation's expansion across Europe allowing you to pick any strategy possible from either destroying large nations to annexing smaller nations into your unstoppable empire! Once you're tired of playing Napoleon's 3 campaigns (Italy, Egypt, and Europe) you can play as any of the coalition nations against Napoleon's France or play multiple different battles that were decisive turning points in history from The Battle of Waterloo to The Battle of the Nile. Finally once you've completed all of that there is multiplayer that is quite entertaining when playing campaigns or battles with friends or anyone else too. Overall this is a pretty good Total War game to buy for you and a friend to play sometime together as a team or as foes.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "I don't think you can recreate or change Napoleonic history any other way. VIVE LA FRANCE!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, could use some touch ups in some places though",
            "review_score": "1"
        },
        {
            "review_text": "Dont think about what this game can do for you but what you can do for this game. Nothing cuz its perfect. Install all the mods you find crash it completely, this game runs on even ♥♥♥♥♥ier PC, i know trust me. It is great. I like muskets cuz they make big booms and the cannon balls make a bigger holes. Is of fun i rate 9/10, would be nice if PC wouldnt have ♥♥♥♥♥♥♥♥ Diplomacy skills. Accept peace after defeating their entire army and moving towards their last provinces capital. Ofcourse not, is of ok m8 you can totally win this. Get Great war mod, is not legit but is maximum fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game. Campaign is addicting and when you get bored with that you can test yourself in the active multiplayer community. I would recommend",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever. I could spend thousands of hours at this game without be tired of.   Every campaign mode it's simply unique. It's true that empire total war is very similar, has a bigger map and more countries, but I think that the combat system is more developed at Napoleon, you can have more fun at a this amazing size Europe",
            "review_score": "1"
        },
        {
            "review_text": "The best total war. I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A must have Total War Game for Singleplayer and Multiplayer. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is interesting especially with darth mod... all though i havent played it much.. meh",
            "review_score": "1"
        },
        {
            "review_text": "I knew when as the Ottomans, I and my ally, Portugal, conquered Paris together, I have modded this game a bit too much, But the point is the playable nations should have include Austria, Ottomans, Portugal etc. 9/10 would perish all French army in the empty streets of Moscow again.",
            "review_score": "1"
        },
        {
            "review_text": "A refined sequel but with a regretably smaller campaign map. Certainly worth getting, doubly so on sale.",
            "review_score": "1"
        },
        {
            "review_text": "You don't see a battle. You *hear* it. Black powder blasting by the ton on all sides. Black smoke blinding you and choking you and making you vomit. Then the French come out of the smoke - not in a line, but in a column. And they march towards our thin line, kettledrums hammering like hell and a golden eagle blazing overhead. They march slowly, and it takes them a long time to reach you, and you can't see them in smoke. But you can hear the drums. They march out of the smoke, and you fire a volley. And the front rank of the column falls, and the next rank steps over them, with drums hammering, and the column smashes your line like a hammer breaking glass... and Napoleon has won another battle.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a great addition to the Total War series. It looks beautiful, the music is hauntingly solemn--which is rather fitting for a game that teaches you how absolutely worthless human life actually is--and it's just an all-around fantastic game. My only complaint is the smaller size of the campaign, though I guess I was kind of spoiled by how extensive Rome II and Empire's campaigns were.  Also, a spy of mine stumbled into a French border town, and Napoleon just happened to be there. He had a 20% chance of assassinating the face of France himself, so I just kinda shrugged and gave him the order to do it, and he ♥♥♥♥in' succeeded. Napoleon was dead before the first year of the game was over. 10/10, would change the course of history again.  ",
            "review_score": "1"
        },
        {
            "review_text": "The best Total war game out there vanilla or moded a great game worth buying! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, if you like the franchise and have not played this I recommend you do, if you have not played any of these games you may like it. But the thing that falls because this really is not a game, its more of what empire should have been, or an DLC to Empire. The game it's self was good but Empire was bigger then this game. I recommend you do get this game but I also recommend you get Empire and install the Darthmod for Empire before playing this.",
            "review_score": "1"
        },
        {
            "review_text": "This is certainly my favorite total war game to date. It features several different campaigns that take from the beginning to the end of the prestigious general's career. If your computer is capable, the visuals are gorgeous, especially once the combat starts and smoke covers the field and blows in the wind. The AI is decent for a total war game, and much better than Empire's AI, which could never seem to correctly fight line battles. I love how tactical the gameplay can get, and this total war emphasizes on positioning and formation to win battles, not just charging everything in sight. There have been several instances in custom and multiplayer battles when my smaller or less experienced force defeated a much more powerful army simply by being in better formation, and I love that. I feel like each unit in this game is useful and can succeed when commanded well. The game itself is crisp and clean and relatively bug free, and local multiplayer games have been a blast. I highly recommend this game to anyone interested in the time period or fans of the total war games, particularly empire due to the simularities. What I expected to be merely a $15 mod for Empire total war turned out to be a much more polished and enjoyable game all around.",
            "review_score": "1"
        },
        {
            "review_text": "OMG, One of the greatest stratagy games i have ever played, its battles are amazing and it immerses you into the game as if you were there yourself, right next to Napoleon himslef... Perfect title.",
            "review_score": "1"
        },
        {
            "review_text": "Best total war games in the series. And i've played them all. Really played them. 1500 hours and counting...  They finally got game mechanics, naval battles and infantry tactics correct. The format in itself is perfect for line infantry style battles. To bad they used the same to make shogun 2 and Rome total war 2.   This version, and the Fall of the samurai campaign in Shogun 2 are the best that sega has created so far.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that got me to play total war. Loved every minute. One of the best games you can buy.",
            "review_score": "1"
        },
        {
            "review_text": "Visually spectacular and still holds up to today's standards just fine. Very polished, very few bugs. Battles are great and well executed. Essentially the better Empire. Buy it along side a friend for some great multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "well i'm not gonna say much on it just maybe if u see it's screen shots u may dislike it but when u play 100% u gonna like it .  Case Is Closed !",
            "review_score": "1"
        },
        {
            "review_text": "perfect for history buffs. love it.",
            "review_score": "1"
        },
        {
            "review_text": "I say take this game if you are into multiplayer battles and take empire for campiagn. I personally prefer this because if i want a taste fo empire i just play the europe campaign. People keep saying that empire battles are better which is ♥♥♥♥♥♥♥t NTW battles are empire battles ten fold. Also this game don't have that many bugs as empire(except for that horse art glitch).",
            "review_score": "1"
        },
        {
            "review_text": "I wouldnt suggest buying this game because it doesnt have the Total war feel, i mean it feels more like a ♥♥♥♥♥♥ DLC Pack for Empire total war. Although if you are into small games that only have 3 realy small campaigns then i would say that you should try it. but as for any game review dont 100% trust on my word, you go try it out for yourself and then make a Judgement. you know what they say!: dont judge a book by its cover (or a game by its reviews)",
            "review_score": "-1"
        },
        {
            "review_text": "Out of all the Total War games ive played Napoleon Takes the cake with very great visuals and strategics. If you have played past and present Total Wars you might agree with me but for me Napoleon has been my favorite since i have started playing!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Better than Empire: total war.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic game the i have played and played. one of the gems of total war.",
            "review_score": "1"
        },
        {
            "review_text": "A fascinating recreation of the Napoleonic Wars. A short-play alternative to long campaigns of Empire Total War.  The best interface to date of any Total War installements, before becoming too much like World of Warcraft, retaining the looks of a board strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Lost many a night of sleep leading the Prussian army into the streets of Paris. Add the DarthMod for a even greater experience with life sized battles.",
            "review_score": "1"
        },
        {
            "review_text": "Best Campaign of a total war game (opinion)",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "It's on the top 3 Total War games.  The multiplayed battles are beyond epic. The fire, explosion and shooting effects are overwhelming as ♥♥♥♥. Campaign is really good. Big variety of maps and units. Medium variety of factions which is fine because every faction feels unique. And last but not least has one of the best mod ever created on any game. It's called 'Darth Mod'. Try the mod, trust me.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "The two-player campaign mode is a great time for any strategist. Looking forward to multiplayer campaign modes in the future Total Wars.",
            "review_score": "1"
        },
        {
            "review_text": "napoleon total war is good game in the world",
            "review_score": "1"
        },
        {
            "review_text": "I want it",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice game!",
            "review_score": "1"
        },
        {
            "review_text": "well, havnt really played the other total war games.. but this game ive owned for over a year now ( got it christmas 2013 ) and ive been playing it ever since, but you gotta have a friend that ownes the game too!! me and my buddy have been playing the campaign together and we are cooperating.. and then we end the game! there is no coop so if you wanna finish the game totaly you need to destroy you're friends nation! it kinda sucks but what the hell the game is awesome and if you live stratigy then i advise you to buy it! if my rewiew has been helpull please press the '' yes '' button so i can see you're apreiciation.. thanks",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game, but DarthMod gives it an extra boost, like being able to fire by rank and other things like smoke visuals",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game. Much more realistic than Total War: Empire. AI still sucks, but the ability to recruit humans for drop-in battles keeps it interesting. When an opponent unit shatters, though, they are harder to find to run down with cavalry.  The multiplayer option is functional and fun.  I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Great game, my favorite total war game to date!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Vanilla is alright, but if you get darthmod it improves the experience twentyfold with the unit sizes, dozens of new units, the smoke and the new nations. Would play again 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon + Darthmod = fun times!",
            "review_score": "1"
        },
        {
            "review_text": "This game is not like Empire Total war but is awsome like when u play the historical battles or the campaigns so gonna be perferct , but the bad thing u can't control some nation like Spaign , Netherlands , ecc... u have to download the mod if u wanted to use it ...",
            "review_score": "1"
        },
        {
            "review_text": "cool ;3",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, but gets boring after a while. Should have had a bigger map of the world like empire.",
            "review_score": "1"
        },
        {
            "review_text": "Its fun to make epic wars and make your own history",
            "review_score": "1"
        },
        {
            "review_text": "This is why I bought TW :)",
            "review_score": "1"
        },
        {
            "review_text": "PLayed more than 70hours and still love it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome battle simulator. I really suck at this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very Nice",
            "review_score": "1"
        },
        {
            "review_text": "Is there a way I could kill my men who retreat?",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game, but if you decide to send troops into melee, you're gonna have a bad time, because the engine isn't made for that. If you decide to play without Darthmod, you're gonna have a bad time. And if you try to play as the Duchy of Warsaw, like me... ...you're gonna have a really bad time.",
            "review_score": "1"
        },
        {
            "review_text": "Played Napoleon for the first time years ago but I'm still finding myself coming back to the game thanks to great mods like The Great war, or Darthmod for example. Anyone even remotely interested in strategy games or playing puppeteer should buy this game, specially thanks to the mods.   Have played for about 700 hours without connection. And multiplayer just makes it better.",
            "review_score": "1"
        },
        {
            "review_text": "I have had this game for about 2 years now, and everytime I go to play in it, I leave having had a good time playing one of the best Total War games out there!! Event better with the LME4 mod, but whatever works works!!   ",
            "review_score": "1"
        },
        {
            "review_text": "Just a ♥♥♥♥ing good game.",
            "review_score": "1"
        },
        {
            "review_text": "A great Total War game. I would still love to see a NTW2 or an ACWTW as an extension of Shogun 2 TW.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun!! Lasts weeks to complete the main campaign*--*  with the choice of nearly all of the biggest nations you can play this game for years! old but gold",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "game is good, however slight things like path finding are bad, i would recomend getting darthmod to play this game",
            "review_score": "1"
        },
        {
            "review_text": "0/10 can't have posse of priests converting whole Europe to Orthodox in three months",
            "review_score": "1"
        },
        {
            "review_text": "It's a fantastic game if you have the modification called DarthMod installed.",
            "review_score": "1"
        },
        {
            "review_text": "Darthmod makes it much more fun ,but without it its not bad at all.",
            "review_score": "1"
        },
        {
            "review_text": "Good game! Buy if you like the Napoelonic wars!",
            "review_score": "1"
        },
        {
            "review_text": "i love napoleon and this has his name in the title so its the game for me",
            "review_score": "1"
        },
        {
            "review_text": "Wow,This game is definitely a entertaining game, If you actually know how to play the game then it will be a blast! if your are some noob who sends there whole army into one part of the battlefield then all i can say is this game is not for you. This game requires strategy and the campaign us fun unless you go bankrupt...Once you start making income etc,. man this is a game you will want to put hours into, Sometimes the game will troll you but other then that it is great, Once you add Darthmod and get the most realistic battles possible then you absolutely love this game,if you are a History and a strategy type of person then this game is for you 8/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is essentially Empire without the crippling bugs and more tasty unit variety. Where in Empire, most of the mainstay European faction units were painfully generic, thankfully there's much more unit types and looks now.  The main campaign is a close knit and somewhat scripted affair, it doesn't detract from the experience, as you are retracing Napoleon's footsteps. If that doesn;t strike your fancy, there's also Campaignsof the Coalition in which it is more open ended but still on a smaller map than empire, plotting Napoleon's downfall.  It's not entirely historically accurate, an inevitability in such a game like this. However, it tries its best to stick to period authentic tactics and effects.  The battle effects are very lovely to look at although the Warscape engine is starting to show cracks what with wonky animation sync and sound clipping as well as some atrocious balance in some engagements. However, it works and is a decent engine for representing Napoleonic combat.  I am a bit biased as I am a monumental Napoleonic and 18th century history enthusiast and if you have a love of history or total war or any other strategy 4x title, I recommend this game highly.  Tl;DR thank god it isn't Rome II.",
            "review_score": "1"
        },
        {
            "review_text": "If you love history and classical European Warfare then buy this game. A truely amazing game taking place in the 1800s with amazing graphics.",
            "review_score": "1"
        },
        {
            "review_text": "I don't think Napoleon is as bad as some people say. It's a marked improvement over Empire and is incredibly fun, so long as you use DarthMod or TGW. Its pretty fun (if you use either of those mods) and has become my 4th most played game on Steam mainly because i enjoy the time period and style of warfare. Marching in a line towards, most likely, your death, the sound of artillery pounding in the distance all set to a lovely tune on drums and flutes. It took true bravery to do that.",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon TW is totaly superior to it's predecessor, Empire TW, featuring improved game mechanics. The campaigns are very interesting and challenging, but the battles are thrilling too. Another great game from Total War series.",
            "review_score": "1"
        },
        {
            "review_text": "This game is in depth with unit stats and morale. It makes you feel like a general cammanding troops.",
            "review_score": "1"
        },
        {
            "review_text": "Still fun after all this time",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon might have had syphillis but this game is in no way diseased kek give me likes pls",
            "review_score": "1"
        },
        {
            "review_text": "  Great game! You can rekt Prussia, Austria and Putin. Even Pope pay you for peace.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "absolute unfinished crappy game, the most annoying MP ever which counts your rank so bad it's not even funny and connection problems of another dimension",
            "review_score": "-1"
        },
        {
            "review_text": "Not my favourite Total War",
            "review_score": "-1"
        },
        {
            "review_text": "it is a great game, it really belittles empire",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon was actually average size. Him being short was British propaganda.",
            "review_score": "1"
        },
        {
            "review_text": "This game.... this game is simply the best TW game ever created, way better than Empire, Rome 2 and Attila. If you are interested in this time period you will abselutely love this. The only thing I don't like is the fact that the AI is ridiculously stupid.",
            "review_score": "1"
        },
        {
            "review_text": "Logistics simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "i have been have the issure where it doesn't show the unit abilty or artiley unlimber and personal need fix it make game less fun and this only total war game i hade this issure with at the momment",
            "review_score": "-1"
        },
        {
            "review_text": "this is a good game but if your starting off you should proably get empire total war",
            "review_score": "1"
        },
        {
            "review_text": "very nice game 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Just Amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Again this game is truely amazing but doesnt quite beat empire total war but it still has the totaal war style i love !! &lt;3  Keep making great games !!!",
            "review_score": "1"
        },
        {
            "review_text": "Well, id like to say that Napoleon Total War Is the best Total war game for me!! And This game changed my life, After 1 years waiting for winter sale.. yeah like my dream has come true!!! So, Id like to Buy Napoleon Total War all DLC.......",
            "review_score": "1"
        },
        {
            "review_text": "Another Gaius Julius Ceasar review  Before i lost my original steam account and deleted the email attached because it was always spamming my email with mailer demon, resulted in me losing my only way to regain my old steam account this game and shogun 2 were the only steam games i had.  However though this is not a 100% like, it is more a 57% like, the game has great things to say but at the same time it also has it's downfalls.    Lets start with the upsides first.   The game is very good for it's diplomacy, it seperates the minor factions from the major and allows for regions to be swaped, unlike in Rome II, state gifts can be given and trade embargos can be broken via diplomacy. This allows for a really great political feel that i believe is missing a bit in ROME II.  The factions are powerfull and most off them are allies, this allows for much more ease of mind, knowing that you will not be facing a war on all fronts.   The graphics is good, it has a great campaign graphics.   Now for some of the downfalls:   As I mentioned above the graphics are good, great campaign graphics but terrible battle graphics, this is a major downfall because you need to get up close and wait a few seconds before you can see the soldiers as normal instead of a weird blurred shape thing.   Also as mentioned before, in the coalition ( which for me is the whole campaign ) you are allied with nearly every country that bonaparte is not in control of. This can be good for an ease of mind but also makes it annouyingly difficult to expand at all, because if you are playing as say Austria then you cannot invade RUSSIA, PRUSSIA, this prevents great expansion, the only true places Austria can invade is the ottoman empire or the italian steas, and France. And with France on one side and wanting to invade you you cannot finish of the war you start of with against the ottoman empire, causing you to struggle on a two fronted war.   ( end of downsides )  However so the game is still a great game that i can tolerate, however so some might not think the same, my only advice is to read as many reviews as possible and make your choice that way.   Yours sincerly Gaius Julius Ceasar",
            "review_score": "1"
        },
        {
            "review_text": "the french wine and cheese is good 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Astonishingly great game",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun time killer or a good history lesson. The game has 100s of hours of fun. If I was you I would start saving up.",
            "review_score": "1"
        },
        {
            "review_text": "awesome for any history lover! 5 stars!",
            "review_score": "1"
        },
        {
            "review_text": "WTF?   This is the worst total war ever!! If you have the money buy Total war Empire it is much better than Napoleon!! ",
            "review_score": "-1"
        },
        {
            "review_text": "An utter and complete disappointment. Napoleon TW just like Empire TW did not offer any new ideas or real improvements compared to its predecessors. I liked both Rome and Medieval II a lot better. Napoleon feels like very much like a scenario DLC for Empire TW, which I also did not really enjoy that much. Somehow Napoleon manages to actually oversimplify important aspects of the game and unnecessarily complicate requiring some tedious and annoying micro management. I will keep playing Medieval 2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't really like napoleon, not as good as Empire was (with darthmod of course). I felt there wasn't enough time in the campaign to play properly and building and recruting took too long, which also inhibited the game. All Total War games are great games this is just my least favorte.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like Empire with French Bread",
            "review_score": "1"
        },
        {
            "review_text": "Don't get this game expecting to ever play it multiplayer. I could never get it to work, and I gather a great number of players never get past 'host not responding' too (based on countless forums I have scoured trying to make this work. Going to try to get my money back",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best CA's Warscape engine could do, and it is a great firearm Total War game. Too bad CA, out of laziness butchered Rome 2 with Warscape.",
            "review_score": "1"
        },
        {
            "review_text": "If only the map was larger.. I would have played this more since I liked the feature of auto replenish... and the New World region would have been nice too... but Empire is a better version.",
            "review_score": "1"
        },
        {
            "review_text": "I had a lot of fun with this game, and though it had some nice new features for the time, I still enjoy Empire Total War more. More than likely that is because of the scope of the map and tech in Empire as opposed to this: Napoleon is much more focused on Europe alone and as a result has a more detailed map, but of course that is because it covers a smaller area. It's hard to justify playing this when you can either play Empire for the experience of this era in a grander scale or Shogun 2 when you want a more detailed and fleshed-out, feature rich gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This game stinks. It's unresponsive. The units never do what you order them to do. The generals are weak as heck and die as soon as they are exposed to battle. The cavalry does nothing but run around enemy units, doing almost nothing. The fighting animations are useless. The guys just fall down around each other. The artillery can't hit the broad side of a barn. When it does make direct contact, it barely damages the enemy unit. However, the enemy cannons are always on target and do immense damage. Napoleon was supposed to be one of the greatest artillery captains in history, but his artillery can't hit ♥♥♥♥!  All in all, this game is a waste of time. If you want to play with muskets, rifles, etc. get Empire Total War. Do no even spend $3 on this crappy title.",
            "review_score": "-1"
        },
        {
            "review_text": "THE WORSE TW GAME EVER",
            "review_score": "-1"
        },
        {
            "review_text": "too involved",
            "review_score": "-1"
        },
        {
            "review_text": "this is a great game if u like history or ur just intrested in the time peroid. but only play this if u have played empire total war there few thinges u might find diffuclt",
            "review_score": "1"
        },
        {
            "review_text": "  THIS GAME IS IS A LET DOWN    Combat is not at all fun, units are hard to control, which get easier to learn after playing for a while. Campaign was dissappointment. They seems to be not as much strategy as the other total wae games i have tried.Tutorial was confusing and doesn't help much. the hud is small and confusing. Maybe i may have to play more of this game to learn strategy, but this game doesn't have as much of the fun component as the other total war games (which i suck at, but non the less fun). Don't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I have a mac - my friend has a pc, i got this game so we could play together, but the mac multiplayer IS NOT ♥♥♥♥ING COMPATABLE WITH THE PC ONE. if you have a mac, and want to play multiplayer DO NOT BUY THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun besides its horrible graphics and its terrible campaign. my first time playing my armies of russia marched fast and proud in 1805 then the armies of russia ended in 1805",
            "review_score": "-1"
        },
        {
            "review_text": "Dear devs: ░░░░░░░░░░░░░░░▄▄░░░░░░░░░░░ ░░░░░░░░░░░░░░█░░█░░░░░░░░░░ ░░░░░░░░░░░░░░█░░█░░░░░░░░░░ ░░░░░░░░░░░░░░█░░█░░░░░░░░░░ ░░░░░░░░░░░░░░█░░█░░░░░░░░░░ ██████▄███▄████░░███▄░░░░░░░ ▓▓▓▓▓▓█░░░█░░░█░░█░░░███░░░░ ▓▓▓▓▓▓█░░░█░░░█░░█░░░█░░█░░░ ▓▓▓▓▓▓█░░░░░░░░░░░░░░█░░█░░░ ▓▓▓▓▓▓█░░░░░░░░░░░░░░░░█░░░░ ▓▓▓▓▓▓█░░░░░░░░░░░░░░██░░░░░ ▓▓▓▓▓▓█████░░░░░░░░░██░░░░░ █████▀░░░░▀▀████████░░░░░░",
            "review_score": "-1"
        },
        {
            "review_text": "essentailly fun ad diverse in units nand skills, but it limits you too often and forces you to an objective in an alloted time, goood for history renactments but not as fun as previous",
            "review_score": "-1"
        },
        {
            "review_text": "This game infuriates me beyond belief the controls are so unresponsive i literally told a ♥♥♥♥♥♥♥♥ to attack this unit 6 times before he got his head out of his ♥♥♥ and attacked him only to get killed in a mere matter of seconds",
            "review_score": "-1"
        },
        {
            "review_text": "Campaign is hard and long-winded, not too many factions to choose from, if you aren't going to devote hours of your life to this then it is not worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game i cant even get the great war mod to work nor the game ever since this is happned i flet like it was cod but worse!",
            "review_score": "-1"
        },
        {
            "review_text": "It is so hard to navigate your units, cities and everything.  Too hard to get used to, I gave up after 2 hours only.  A game need to be simple to play, and not a labyrint to figure out.  A game needs to be so simple that you dont need to use hours to learn how to avigate your arms, cities, where to move to finish a quest and things, KISS: Keep It Simple Stupid so even a kid could do it!  The older games was so good and simple mangement!",
            "review_score": "-1"
        },
        {
            "review_text": "- Early december 1808: I, the British Empire, and my Russian, Austrian and Prussian allies, divide up everything north and east of Paris upto scandinavia on continental Europe... leaving france, whom i'm at war with, with 2 provinces and the Isle of Corsica. Brittany in the west is a Protectorate of mine.  - Late december 1808: As i continue to build up troops at Gibraltar, for an inevitable invasion of the Spanish mainland (as these hooligans have tried to take Gibraltar from me on several occasions these past few years!), i begin peacefull talks with Portugal, i give them new technologies for their Navy and get them to break their allegance to the Kingdom of Spain! 'huzzah!' i say, you people know what is good for you! Then i try to make them my ally.... they don't even have to join the war against Spain from me...they can become a protectorate of mine...or not... i promise them trade, revenue, offer them silly amounts of money... they won't budge... i leave them to make up their minds and will check in again in a month or 2...  -Early january 1809: Austria looses control over the Bavarian province because of Bavarian revolutionaries... i step in, crushing the revolution with the full might of my northern continental military force... Bavarian bradwurst is now part of the English breakfast...  -Early february 1809: Due to having to clear up the mess those lederhose wearing revolutionaries made in the north, i've taken my eye of the 'Portugese matter' for 'just a second' and what do you know? Those fools have the audacity to a attack one of my trade convoys sinking two of my Indiamen class trade ships and subsequently declaring war on me...  -Late february 1809: I am MASSIVELY annoyed at Portugal now.... i send the Fleet at Gibraltar out to take care of the issue, adding insult to injury, i capture all of their vessels and add them to my own fleet.  -Early march 1809: I've decided to make an example out of Portugal, and send two full armies to the capital of Lisbon. I show no mercy and leave no Portugese soldier standing during the Battle of Lisbon that ensues... Having emerged victoriously from the savage battle, i'm still mightely annoyed and instead of peacefully occupying, i randsack, pilage, ♥♥♥♥ and wreck everything on my path... wich brings me much loot ! ... loot that apperently now will be much needed to fix the place up lol  -Late march 1809: The souvereign nation of Portugal ceases to excist...  -Late April 1809: Maybe i went abit overboard, taking ages to fix the place up :s  meanwhile Portugese revolutionaries have sprouted up making all sorts of racket in the town of Evora...  -Early May 1809: I crush the uprising by killing off the remainder of what men of fighting age are left in the Lisbon province... Now that there are no men left capable of fighting in Portugal, they ALL love me...  10/10 Would annex Portugal and decimate the male portion of the population again...",
            "review_score": "1"
        },
        {
            "review_text": "Because of this game I made my steam account. I didn't play much, but I'll start playing more. It's a fun game, It's simplistic and complex in the same time. It's a good game for those who like strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. The time period is my favorite of all Total War titles. Major Improvement to mechanics since empire but still had a long way to go. None the less a strategy gamer essential.",
            "review_score": "1"
        },
        {
            "review_text": "Mods make this game what it should be BUT the Napoleon campaigns are fun. No wonder he tried to conquer the world if it was this much fun chasing people on cavalry.  The great war mod is amazing if your into ww1  Dath Mod makes this game 100x better",
            "review_score": "1"
        },
        {
            "review_text": "This is probably my least favorite of the Total War series unless you add mods (even then it is still towards the bottom of my total war list). I would go with either Rome or Shogun II if this is your first Total War game.",
            "review_score": "-1"
        },
        {
            "review_text": "it is nice for 2 hours and then it's just the same thing over and over again",
            "review_score": "-1"
        },
        {
            "review_text": "Now I know how a man with one bollock felt... like a loser! Typical of the French really!   As for the game, it's adapt at keeping me away from the silly models where you push them around a board. Graphics are top-notch. Battles are well handles, with the pause feature (as for any TW game) becomes paramount. The only drawback are naval battles, I find that I'm never truly in-control of the situaiton unless the micro-manage each ship, which becomes tiresome after a period. Not the best, that title sits with Rome - Total War.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good thhen even better with darthmod",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME I GIVE IT 10 STARS XD",
            "review_score": "1"
        },
        {
            "review_text": "Good game if your into the time period.....still a good game if your not Not for fps ♥♥♥♥♥♥s",
            "review_score": "1"
        },
        {
            "review_text": "A great follow up to Empire total war!",
            "review_score": "1"
        },
        {
            "review_text": "Love it.",
            "review_score": "1"
        },
        {
            "review_text": "This was my summer 2011.",
            "review_score": "1"
        },
        {
            "review_text": "While I still hold a bit of a grudge for the way Empire was released, this game (made on the same engine later) is damned fine quality.",
            "review_score": "1"
        },
        {
            "review_text": "The Total war series are awesome.. Napoleon have alot of improvments from empire, it just feels much better.. but there is a lack of nations compared to Empire... the multiplayer is also improved alot here. The battles feels more real instead of that lame arcade feeling.. darthmod is also recommended",
            "review_score": "1"
        },
        {
            "review_text": "Let me tell you my story in less than 15 lines:  1 year ago, winter time,my friends told me about this game, Mount&amp;Blade Warband: Napoleonic Wars. I loved it! I was playing it day and night. Then I bought myself Warband, and then I traded for the DLC (Napoleonic Wars)  I was so amazed by that game, I am still playing it. It is so addictive! Then, searching for Mount&amp;Blade wallpapers, like 2 weeks ago, I found a lot of Napoleon Total War wallpapers. In that moment after I saw a gameplay and some cool images, I knew I wanted that game.   I couldn't buy it because of the money, so I tried to trade. And I did, so. And that's how I got it, after 2 weeks of watching gameplays, trailers, and getting cool wallpapers and playing demos. What can I say... I love Napoleonic Era. I still remember the first time I saw the intro on the internet. I loved the part when Emperor Napoleon says: 'Burn it!'.  I give this game 10/10. I feel like playing it every day and night. Buy it and you won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon Total War is awesome. It's basically a stand alone expansion to Empire Total War. A lot of solid campaigns, the game runs smoother than Empire, and a huge improvement on the graphics and battle AI. Can't say enough good things about Napoleon.",
            "review_score": "1"
        },
        {
            "review_text": "I loved This game so much i can't really say more than that. The few things that annoyed me are so minor i can't even think of them right now!",
            "review_score": "1"
        },
        {
            "review_text": "My computer is older and I must turn down all the graphics to their most basic to run the game. Gameplay is good but frustrating that I cannot get the full benefit out of the game.",
            "review_score": "1"
        },
        {
            "review_text": "The more detailed campaigns make this a different gameplay experience than Empire Total War. While you don't have the same level of sandbox flexibility, the overall feeling is a bit more authentic. The AI still needs some help, but that can be resolved with the right MOD.",
            "review_score": "1"
        },
        {
            "review_text": "Its aight. GET IT FOR THE WORLD WAR 1 Mod its amazing",
            "review_score": "1"
        },
        {
            "review_text": "Great game, probably the best, most polished TW game right now. Even though it feels like a stand alone expansion for Empire.",
            "review_score": "1"
        },
        {
            "review_text": "Fight past the niggles and you'll find a truly epic grand strategy game with a tremendous sense of spectacle. Go, see, conquer.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great strategy game",
            "review_score": "1"
        },
        {
            "review_text": "very fun to play! good graphics :) a good buy :D",
            "review_score": "1"
        },
        {
            "review_text": "Milita venture foward to attack some french old guard in the fighting the old guard make a charge at the milita the milita manage to hold of the old guard one of napoleons top elite units   Makes sense :/  100/10",
            "review_score": "1"
        },
        {
            "review_text": "As a novice historian, I found this system engaging. Imperial Glory is probably a bit more in depth due to the economic engine that you have to develop. Overall, I still play this... alot. Many may have moved on to the new shiny thing.. myself in cluded. But in the end, I keep coming back. I hope you will find it just as playable and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Slaughter them, slaughter them all. Give no quarter, expect none given!",
            "review_score": "1"
        },
        {
            "review_text": "I purchsed this game on release and i still come back to it. I love it all, you can play in so many ways. i am still not bored",
            "review_score": "1"
        },
        {
            "review_text": "Great, game if you like the total war series. I have 53 hours on it as of now and feel like I got hundreds more left.",
            "review_score": "1"
        },
        {
            "review_text": "Best with darthmod",
            "review_score": "1"
        },
        {
            "review_text": "An awesome Total war. The gameplay is smooth. The units and faction are super awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Like I have said before I am a huge fan of the TW series, Napoleon TW is a great game and very fun to play. The games main focus is Napoleon (hence the name) but you can still play as England, Prussia, Austria, and Russia. There are not as many units as in ETW but there is still a few. Nothing beats the Feeling of have The Duke of Wellington Fight Napoleon on the outskirks of Paris, or having France's Grand Army Storm the Walls of London. There are some great Historic Battles though you play mostly as France (not a bad thing). But Waterloo this like jewel in the crown of the game you can play as both England or France. This game is a great game and I can not wait for the next Musket related Total war game!!!",
            "review_score": "1"
        },
        {
            "review_text": "There's nothing better than to watch a horde of cavalry launch an attack against a resolute line of infantry!  Anybody that loves grand strategy, or massive realistic wargames will undouptably love Napoleon total war!  A truely special game that makes you laugh when you're opponent makes a stupid move, cheer when you launch a succesful charge, and even cry when your patriotic side gets unleased!   Napoleon Total War is a true masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "Stunning graphics and great multiplayer, limited campaign compared to empire however.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Not to hard to pick up compared to other games of its genre, for the age of blackpowder this game is a piece of art. Although its differs from the other total wars (empire not included due to the fact this is that improved and more organized) it is still great to play and sure to make to think. With darthmod this game gets even greater and the horizion expands. I would also rec this game to any wargammer or any real time stratagist gamer. Above all great game that does history(ish) and the era justice.",
            "review_score": "1"
        },
        {
            "review_text": "I personally love this game. The battles are very fun in the story and multiplayer. Even though if ou wish to buy a total war game i would reccomend going with one of the newer ones for improved graphics and more campaign options.",
            "review_score": "1"
        },
        {
            "review_text": "Short people are angry! you get to be a tall person pretending to be a short person thats angy.Or you can be a tall(or moderatly sized)(for those that dont like the weather up there) person thats prending to be a deffirent tall(or moderatly sized)person that happens to be angy.Your height(not realy) is your chioce while conquering the world,",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "This Napoleonic strategy game is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "This game improves upon the falts of Empire Total War, although the latter has a larger campaign map and more nations, Napoleon makes up with quality and depth.  If your looking for a Eurocentric capaign with more focus, this game is for you, if you prefer controlling large colonies and more nations, look for Empire Total war.  I highly recomend this game and, in my opinion, is a much better game than Empire. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Napolen: Total War is just another great game in Total War series, but my brain always wants to explode because of all those big battles. Really, there are a lot of them.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, especially when you have the Great War mod installed. Now, I can finally do what my ancestors couldn't...  10/10 would invade france again",
            "review_score": "1"
        },
        {
            "review_text": "Totally Awesome",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, Darth Mod definitely spices it up though.",
            "review_score": "1"
        },
        {
            "review_text": "good strategy game with good effects for the weapons faster paced than the earlier games with a good variety of weapons. Ship battles are awesome and units replenish more realistacally. A good game that ive been playing for years.",
            "review_score": "1"
        },
        {
            "review_text": "The more polished version of Empire and it shows!",
            "review_score": "1"
        },
        {
            "review_text": "The game is a very good and fun game (especially with darthmod), but the only thing I dont like about it is when there are caltrops (anti-horse traps) in the middle of the field, instead of going around them, the cavalry jumps over them instead of going around, killing most to all of your horses.",
            "review_score": "1"
        },
        {
            "review_text": "This game is what all Total War games after Medieval TW 1 should be like. Wow is all I can say about the way the ai plays and even your units that get attacked now respond in kind. Calvary even charge if the enemy is in their arc of fire. Best TW I've played in years. Better than RTW better than ROME II just better. :)",
            "review_score": "1"
        },
        {
            "review_text": "Maybe it’s just me and that I’m not much into the French revolution but I didn’t much like this. The rank and fire shooting seemed rubbish, most of the time I just told me men to go swords fly, screw the guns! The cannons where powerful but so slow to get intro position they where always out of range, even when placing them in strategic points before the battle, most of the time the enemy refused to attack me, even though they where the ones attacking me on the campaign map! I did like the following the personal history of Napoleon from young lad, to commanding an army but very early on, got a huge difficult spike, where I had to capture a Town right across the map, while capturing aleast two other towns on the way.....yeah right, I would have to quick march my men straight there to reach the Town in time, with no men and no money.... I'm guessing I'm just crap, because it was really early on but that put me off and haven’t played it since.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really Napoleon: Total War because it focuses on military and civic development, and not being a kickass Emperor who has awesome quotes misattributed to him. Not enough tiny islands to retire on.",
            "review_score": "1"
        },
        {
            "review_text": "LoVe It ",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game that I believe was created by manlets angry about their height and females making fun of what they the manlets call 'normal size' to show an alternate history where a frenchy manlet takes over the world, I know, and you know this is BS and would never happen. It is an extremely unlikely situation but it is fun to speculate on what would have happened if the manlets would ever learn, ha.....manlets, when will they learn?",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy the game, but it should be dlc to empire total war. Greater graphic and control panel than in empire. It have more tactical options in building the buildings. Units are so beautiful and realistic that you are sure you play total war tittle.",
            "review_score": "1"
        },
        {
            "review_text": "I play this game for countless hour in a time before I had internet. It is the second best total war to me. Wonderful battles and you need tactics to win.",
            "review_score": "1"
        },
        {
            "review_text": "Empire: Total war on steroids and with added Napoleon, what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "hey ive had this game for a long time and played atleast 87 hours of it so one day i started it up and the screen went black except i heard all the familiar sounds that i would here when the game starts up i had to turn off the entire computer system and restart it i found out that this black screen is aslmost in all of my total war games that i have please help.",
            "review_score": "1"
        },
        {
            "review_text": "this game is very fun grab a group of friends and play other people 9\\10 i still play it there is still a small group of players but it enough to play online at enjoy your self not to popular at night but still iTS a great great game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play as a tiny frenchman again",
            "review_score": "1"
        },
        {
            "review_text": "its one of the coolest games i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "If not for Shogun 2 I would call this the best Total War game, sans mods.  It's got a great set of unit counters and all the nations have really distinct units and strategies despite the age of horse and cannon often seeming too simple. The strategies you can use are immense, the campaign map is incredibly detailed and rewarding despite only covering Europe, and it's very pretty and well-optimized. The game rewards you for securing trade routes, for harassing your enemy, for having good plans, and for ambushing.  The only negative is that the siege warfare is pretty much redundant in this game since forts are so ridiculously powerful that they're almost impossible to take if the enemy has anywhere near your numbers.  Most importantly, it has much better unit variety and almost no bugs compared to it's awful predecessor, Empire.  If you're a Total War fan GET IT. If you're not a Total War fan and you want a relatively complex and deep 18-19th century wargame with an incredible amount of freedom compared to other games of it's type, here's your title.",
            "review_score": "1"
        },
        {
            "review_text": "Meh, it's better than Empire: Total War, which just that has a lot to say for it. + improved graphics + better A.I. + clean interface - linear campaign -/+ fun in short bursts  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game i do very much recomend",
            "review_score": "1"
        },
        {
            "review_text": "Good Traits -So much possibility -So much replayability -You get to kill your friends armies :D -Has tonnes of factions, worldwide  Negative Traits -Need a relatively beefy computer -Few game crashing bugs, for example after about 70-80 years in game the game has a greater chance of crashing",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! I recommend it to every Total War fan and to newcomers!",
            "review_score": "1"
        },
        {
            "review_text": "excellent all round.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would injure Napoleon with cannons again.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of Total War series since their first game in the 2000s. This is a well done extension of the previous Total War for PC, with a few game enhancements such as genetic modifications on soldiers plus ship, that make the game more enjoyable by allowing for more tactical options. I recommend, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon: Total War™ is a realistc game about conquering europe and even the WORLD!!! It is just like civillaziation but for europe. So you can choose leaders like... King George lll, and Napoleon. Napoleon: Total War™ makes my childhood fantasies come to life! You can declare war or just do a battle at the main menus (you can choose on or offline) Beware though of veterians on multiplayer!!! As you march into battle you see EVERY soldier of your army you dictate what they do. And the other AI dictates too. Whiether your the Prussain,Russian,Brittish,or French you can strive for victory!!!  OFCOURSE it takes place in Nepoleonic times (1799-1830). This game is impressive! 9/10 BUY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Here is why:  1. There is a variety of units and nations to play as. 2. The combat is realistic so you have to be careful and really be a strategist; make one mistake and it could lose you a battle. 3. Campaigns are incredibly fun and feels good to look at your empire (until everyone declares war on you becuase you have too much land (still not bad)). 4. Really good theme being entirely based around Napoleon and his campaigns, but you can still have some fun with the nations of the coalition (Britain, Russia, Austria and Prussia). 5. Very accurate to history. 6. Multiplayer is awesome, especially when you have friends to play with. 7. Historical scenarios where you can play as Napoleon, Wellington, Villneuve and François-Paul Brueys d'Aigalliers (copy and paste lol). They can also be challenging but completable. 8. Naval combat is intense and really fun in 1v1s. 9. Achievments look legendary.  10. DLCs are worth it and actually add to the game. 11. Just plain epic for a person who is interested in the Napoleonic Wars like me.  Overall this game is fantsastic, and being my first Total War game, is worth £15, and worth £20 with DLC. So what I'm saying is just get the game!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game with fantastic graphics and gameplay, its similar to empire in the campaign and gameplay so if you like ETW or M&amp;B Napoleonic Wars you'll really love it. ",
            "review_score": "1"
        },
        {
            "review_text": "Some bugs and Crashing game make me feel sick in this game.But Watching a bunch of people Fire each other and Calvary crash together.It feel awesome",
            "review_score": "1"
        },
        {
            "review_text": "The mods make it 10 times better",
            "review_score": "1"
        },
        {
            "review_text": "This game... Is amazing. It might not be as good as Empire, but I've played it sooooo long in total, I can't (EFFING) resist. Thank gaben and the studio that made this for existing. I hope you have a good day, and have a great time. Bye.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, yis, very good, you know good, because write review I did.",
            "review_score": "1"
        },
        {
            "review_text": "I Love RTS I Love Napoleon I Love Gun Powder  Buy and Play it!",
            "review_score": "1"
        },
        {
            "review_text": "well... what to say about this one... Napoloen... on a vo marche! le triomph se manificque le game se awesome! le fight se impressive! your brain needs strategy and therefore this is the most advanced simulation of strategy i have ever encounterd to date...",
            "review_score": "1"
        },
        {
            "review_text": "Best Total War game regarding this type of warfare, they did a really good job with the gameplay. 10/10 in my opinion, I highly reccomend this to strategy lovers. Especially this time of era.",
            "review_score": "1"
        },
        {
            "review_text": "I just can't thank enough for making this game. I spent maybe more time playing this game than studying. Played this like for 300 hours and can't get enough. The campaing for coalitions are really time taking one and the multiplayer is like a addiction, just can't get enough. I recommend this game to every strategy game fan and maybe to anyone, who likes this type of games. Really great game :)",
            "review_score": "1"
        },
        {
            "review_text": "A interesting game of the Napoleonic Era in history. Another game in the Total War Series. The game is similiar to Empire: Total War However, all the attention in terms of land warfare is focused entirely on the European continent. Just like in Empire: Total War there are Sea Trade routes to get to using trade ships while building Warships for protection, raiding, invading, and blockading ports. The trade routes are on the western part of the game map in the Atlatic Ocean, the Mediterranean Sea, and even the Black Sea. In Napoleon: Total War you can take the lessons from Empire: Total War and apply them. Will you be one of the greatest strategiest in history Napoleon Bonaparte of France the 2nd AntiChrist (Depending on how you view Napoleon Bonaparte) and conquer all of Europe, or will you be one of the major powers of the time (Great Britian, Austria, Prussia, or Russia) fighting against Napoleon's France and then turning on your Allies to achieve your Victory conditions if need be? How will you create your alternative history in the Napoleonic Era?",
            "review_score": "1"
        },
        {
            "review_text": "it runs well but it is slow to start , you should do nothing for about 40 turns building up your cities",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, and gameplay! But the campaign is lacking in every aspect.... things always go wrong.... i was france allied with prussia (very friendly) and once i completed an objective it trigered an event that caused my greatest ally to turn enemy which was the stupidest thing ever.... it ruined the game... never played it since.",
            "review_score": "1"
        },
        {
            "review_text": "REALLY an awesome game! I don't play singleplayer cause i prefer the multiplayer campaign. (Play it with friends!)   -Buy it, play it, have fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "Though i dont have this exact edition, i can assure you this game is amazing. i've spent of 350 hours playing this game so far and im STILL not board. This game will keep you going for a long time. Also if you love history, this game has a mode that allows you to play as napoleon in his many battles. This is a must buy :)",
            "review_score": "1"
        },
        {
            "review_text": "Eh... Not as good as Empires Total War but great mechanics but only get this when it's on sale...",
            "review_score": "1"
        },
        {
            "review_text": "Great game for total war fans and people new to the brand. I prefer the hand to hand combat total war games though.",
            "review_score": "1"
        },
        {
            "review_text": "very nice game.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, not expensive (especially if you buy a physical copy from a shop) and very fun. You'll get many, many hours of play time!",
            "review_score": "1"
        },
        {
            "review_text": "It's upgraded version of Empire total war but I think it's really cool total war game. Graphic is really look good and smoothly. If you are looking for strategy game that set in 18th century, you can't miss it.",
            "review_score": "1"
        },
        {
            "review_text": "steam has hijacked every part of my total war games, so i think its no good. who ever invented steam should reinvent it because i cannot understand it",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "good total war but only in europ",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "This game really helped me understand the Napoleanic Wars and brought me to 'get into the head' of Napoleon's mastery of Warfare of the early 1800's. I also use The Great War mod, which uses the map of NTW as a base for WW1 and does a great job once again with helping me with the history and warfare even though it seems well understood!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing!!! Great stratagy and graphics",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the greatest of the franchise; the battles feel more 'alive', like you're really commanding an army with various regiments fighting for control of the battlefield, rather than just beating your enemy.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game to play, only played just a little bit but just by starting out it is very immersive and detailed. Very beautiful graphics and very smooth gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game alot",
            "review_score": "1"
        },
        {
            "review_text": "Very good strategy game. If you are looking for a strategy game based around the Napoleonic wars, this is definently the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to be Napoleon or face against him?  Well now you can.  That's basically the game, you fight or be napoleon, do you want anything else? If you don't want to be or fight napoleon then ♥♥♥♥ off, this game was never meant for you. Jesus christ why did you click this god damned icon if you're a bird brain that doesn't give ♥♥♥♥ about history. ♥♥♥♥ off ♥♥♥♥ before I get all geographic on your ♥♥♥♥♥ ♥♥♥. Also whoever made the maps for the game need a lesson in geography. Like jesus christ get on my level. Hire me instead SEGA, I would make wonderful maps, unlike the cheap french ♥♥♥♥♥s you employ to do so.  8 mideval map scribbles out of 10",
            "review_score": "1"
        },
        {
            "review_text": "it's a A game if you tell me",
            "review_score": "1"
        },
        {
            "review_text": "I recieved this game as part of a bundle package as was immediately won over. The mechanics are smooth and quickly learnable. Addiction set in right away 'Just one more battle' was something I told myself continually. Definately worth picking up!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game- best part is the naval battles.",
            "review_score": "1"
        },
        {
            "review_text": "Simply epic",
            "review_score": "1"
        },
        {
            "review_text": "Epic game looks real nice and plays great.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely... extremely... extremely... epic... '_'",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. VERY historically accurate and well represented units. The action is so realistic too. Highly recommended, you will not waste your money or time playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "The most combat based of all Total War games, NTW is great for your first Total War game.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "unless you are willing to spend about an hour in each battle don't get this game, and like all total war games the AI's units will be better than yours for no apparent reason.",
            "review_score": "-1"
        },
        {
            "review_text": "Steam is the biggest load of ♥♥♥♥ I have ever seen !!! Talk about de-evolution !",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "good game.can be made better with mods but the vanilla version is already quite good",
            "review_score": "1"
        },
        {
            "review_text": "my game is crashing when i start help!!!1 ",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorites out of the Total War series. Napoleon is what Empire really should have been. Everything runs smoother, graphics are much improved, artillery is actually useful, and the game lacks many of the bugs that the previous game had. Sadly, it is much narrower in scope then Empire was, due to its focus on the Napoleonic era specifically. Like old time combat with lines of infantry waiting to be mowed down by canister rounds? This game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "7/10   THis game is really good if you are into strategy or historical games. However, it is best that you practice before going on multiplayer, as it may be hard to understand when you first start playing the game.  ",
            "review_score": "1"
        },
        {
            "review_text": "I'm a great fan of the Total War series, but for me Napoleon: Total War contains the best balance between map scale (only Europe) and campaign modes (smaller scale maps). In later stages of the game this enables you to micromanage everything without losing overview after loading a game (having not played the game for a week).   I'm loving the units set in the Napoleontic era; artillery becomes useful but it's still possible to achieve a complete victory on the battlefield using mobile units (fast moving soldiers or mounted units). Either way, it has given me more than its money's worth of entertainment!",
            "review_score": "1"
        },
        {
            "review_text": "With a few like minded fellows who do not cheat this game can be sheer class.",
            "review_score": "1"
        },
        {
            "review_text": "Its a Total War game, of course its good",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Much improved on Empire Total War in general with more detailed units, enhanced graphics, and is very good with DarthMod. However, the campaign map only covers Europe and can repeat itself over a number of campaigns.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would fight in the shadows of the Pyramids again!  Napoleon is huge improvement from Empire, essentially, the battles are now more naturally paced and feel very player influenced. Artillery is the biggest asset in the game, using the battle of Arcole for example, holding a bridge and firing at it with canister shot is often the deal breaker.   Cavalry takes a backseat to Artillery, but its still effective, dragging heavily armored mounted units through light infantry will destroy them. Infantry is the last in importance, however; line infantry is more durable, but less spammable as they lack the range to attack longer ranged infantry blocks effectively.  Essentially, the best part of each battle in the later stages, because your going to lack fully stocked infantry. Your going to find that victory is often due to tactical play, rather than spamming line infantry and rushing people down.  ",
            "review_score": "1"
        },
        {
            "review_text": "A great game that I bought a couple months ago. I've heard there was lots of bugs and mistakes and that NTW did not fix them at all since many years. But even because of that, it is still a nice, pleasant game with plenty to do!",
            "review_score": "1"
        },
        {
            "review_text": "I love the storytelling and multiple campaigns in this game. If only we could have gotten Napoleon with an Empire sized map. I also miss the different firing formations even though they were kind of broken in Empire.",
            "review_score": "1"
        },
        {
            "review_text": "Play the game if you are worthy",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed every minute of this game. :)",
            "review_score": "1"
        },
        {
            "review_text": "killed napoleon over and over and over agian, but ♥♥♥♥♥ just keeps coming for more. top game!",
            "review_score": "1"
        },
        {
            "review_text": "Very Good Game",
            "review_score": "1"
        },
        {
            "review_text": "They could atleast make this cross-platform. Bought it for my friend, and we couldn't play because of this.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but empire is a little more fun.",
            "review_score": "1"
        },
        {
            "review_text": "Best strategy ive ever played . Graphics are so cool and gameplay too . I think its best part of Total War series .",
            "review_score": "1"
        },
        {
            "review_text": "Great game, if you're a fan of the 19th century musket warfare, get this game, a real gem of the Total War series",
            "review_score": "1"
        },
        {
            "review_text": "I love this game this game so much that the world would explode 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "good game. Better than Empire total war.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game u should get it",
            "review_score": "1"
        },
        {
            "review_text": "Call me a graphics snob but this game looks like hot garbage today. That being said I didn't get this game until about 6 years after it came out. Does it hold up gameplay? Absolutely. Good game and do recommend.",
            "review_score": "1"
        },
        {
            "review_text": "short suave monsieur looking 4 fun in the sun w/ muskets &amp; big hats",
            "review_score": "1"
        },
        {
            "review_text": "Great game but i cant fire by rank with line infantry :( unless someone knows how",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like immersive battles on land and sea, buy Napoleon: Total War.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game a lot at first I was on the fence about it but its a fun game",
            "review_score": "1"
        },
        {
            "review_text": "Gave whole russia to my friend to declare war against the whole europe. Gets killed by revolutionanists. Prussia/Germany10  Would give Estonia away.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Empire mechanically and the battles are stunning watching infantry line up to fire volleys with cannons blowing over head. Napoleon: Total war does strategy best with some eye candy and a system thats worked and pleased players for years!",
            "review_score": "1"
        },
        {
            "review_text": "If you were bored with the textbook version of the early time period, then this game should make you want to know more about the era. You get to command tons of units like the ships with the sails, make peace, trades, start wars on other nations, deny requests from the other nations, etc. it’s a recommended game to get if you want to actually feel instead of reading about it. Play it instead. Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "If you get this game, make sure you get Darthmod with it. The AI without darthmod are push overs, they hardly attack. Even when they do, they might bring one army stack to your two. Still, for new players the AI will be challanging but for a person who has played all but one of the total war games it's a push over.",
            "review_score": "1"
        },
        {
            "review_text": "This is my second Total War game, and it is fantastic. Although it is not as expansive as other Total War games, it is definitely worth the price. I enjoy the focus put on Napoleon throughout the campaign, and I also enjoy the more story driven narrative, as it makes you more attatched to the character and more invested in the real history. I would give it a solid 8/10",
            "review_score": "1"
        },
        {
            "review_text": "There's no gravy for the turkey",
            "review_score": "1"
        },
        {
            "review_text": "You can now murder your countrymen in relentless ways  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. I reccomend it to everybody, this game is worth the money spent. I only don't like a little thing: The King's German Legion ( Actually that's one mine fixation; I don't like it because I'd like that the British army had only the british soldiers. But for the rest, this is a fantastic game!)",
            "review_score": "1"
        },
        {
            "review_text": "For all you history fanatics out there, do yourself a favor and buy this game. Its insanely fun and all around a really great game. Only negative is since the game came out a few years ago, the unit AI can suck at times, but that can be overlooked when the rest of the game is this great.",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon can conquered Europe now, even Russia cannot stop him. I have fulfilled his dream. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. In battle mode, you should add the minor nations of the campaign to play as (examples Piedmont-Sardinia, Hessen-Kassel)",
            "review_score": "1"
        },
        {
            "review_text": "an old game, but still fun",
            "review_score": "1"
        },
        {
            "review_text": "good game worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "Form square to disable a cavalry charge, form two ranks to fire vollys and obliterate a advancing enemy or even going down to a soldiers eye view to find the best position for your artillary to harass the enemy as he forms up........ this game makes you think like a napoleonic general and live out your very own waterloo!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game in this franchise that I've played a lot and I'm truly looking foward to future entries. Epic!",
            "review_score": "1"
        },
        {
            "review_text": "Thumbs up, fantasy sucks!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, one of my favorite total wars! I broke it because I botched a mod install, damn my luck!",
            "review_score": "1"
        },
        {
            "review_text": "It's more like to Empire total war DLC but it's still awesome :33",
            "review_score": "1"
        },
        {
            "review_text": "The battles are awesome and the Battle AI does a great job of making each battle a nail biter. The best Total War",
            "review_score": "1"
        },
        {
            "review_text": "Its fun for a while then it gets more additing",
            "review_score": "1"
        },
        {
            "review_text": "this game is very fun and it is very staticgic indeed ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun if you like to look at units touch each other with bayonets with no sound effects at all. Also fun to mow down Turkish people with rifles that have the range of a modern ballistic sniper rifle.",
            "review_score": "1"
        },
        {
            "review_text": "i just started eventually i have one star and everyone kicking me cant even play  ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a rare thing for a group of games to just keeping getting better but the Total War games are just exceptional and keep getting better. I do have to add that Empire may not be as smooth or as pretty but it's still my favourite. If you haven't played any of the Empire games, where have you been and why haven't you. Think of the best game you have played and it's probably Total War Empire but this comes a close second. I have decided to rate games by comparing them to pizza, this is a pepporoni meat feast presented well but they forgot the mushrooms, still lovely but would of liked the mushrooms as well.",
            "review_score": "1"
        },
        {
            "review_text": "  great game, love it",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty damn good historical RTS if you're into that kind of thing. Certainly recommend",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game, i beat wellington and Blucher at the battle of waterloo and took over europe, 10 Out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "Step by step guide to ruling the waves as britainnia Step 1: capture Santissima Trinidad and rename it royal sorverign step 2: Attack French fleet with trinidad under john jervis step 3: Kill entire french fleet apart from one brig that wont come out of port step 4: Attack spanish fleet step 5: SHOOT IT WITH THE EVERYTHING!!!!! step 6: Blockade france and spain step 7: invade france step 8: take gibralter step 9: lose gibralter step 10: go berserk step 11: utterly destroyer spain and france in blind rage step 12: have victory party  verdict: would rage kill france and spain again",
            "review_score": "1"
        },
        {
            "review_text": "This is very good game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "In only 18 hours of gameplay I can say I reccomend this game fully. The campaign is completly emersive and beuatifly crafted. If you enjoy strategy I gaurentee you will enjoy this!",
            "review_score": "1"
        },
        {
            "review_text": "A good game for strategy. This game requires a good computer like Empire. The graphics are good if your computer can handle ultra. The gameplay is somewhat dull only having 5 nations to play as and less fractions than before. Although the map of Europe has more provinces than in Empire. The campaigns are good as usual and are backed with historical deadlines. The end turn system has changed for something a little more realistic from 2 weeks instead of 6 months. Overall this game has not changed a lot from the previous in terms of graphics and gameplay in fact I don't think it has really changed at all except research of some new technologies for your nation.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like history,Napoleon Bonaparte, France and Europe viva la France ;)",
            "review_score": "1"
        },
        {
            "review_text": "The best Total War game so far.",
            "review_score": "1"
        },
        {
            "review_text": "  Fun game, I love playing multiplayer campaigns with friends, it's very easy to manage. I'd much rather have Rome 2's campaign style (levelling up commanders and units, etc), but not every TW game is alike. I've played this game for years, and I'd have to say it's really fun. I just love the sound of a volley going off at the incoming cavalry before they pull out the bayonets and try to fend the weakened horsemen off.",
            "review_score": "1"
        },
        {
            "review_text": "good game and even better with darth mod",
            "review_score": "1"
        },
        {
            "review_text": "With Darthmod, it's a amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun because you can play coop",
            "review_score": "1"
        },
        {
            "review_text": "Arm-chair General on steroids. A brilliant, near perfect adaptation of the 19th century European battlefield (commonly known as Napoleon's playground). While the single-player in the Total: War series has evolved through each title, it has in a sense become a forgotten art that the multiplayer portion desperately, and lusciously makes up for. As a history aficionado, it has fast-seduced my temporal-lobes in a way that can only be described as enjoyable. My only quibble is that the United States wasn't included--have we all forgotten the great Louisiana Purchase? C'mon man!  I don't always play France, but when I do--I prefer enlisting Prussia. Keep retreating my friends.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the greatest games. It is a huge time suck however that is in no way a bad thing as you start playing and bite people when they try to get you to dtop would definitely reccomend to anyone and everyone",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics.Reealistic war.Amazing game",
            "review_score": "1"
        },
        {
            "review_text": "GREAT rts would recommend if you like good games.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Empire Total war in its Campaign gameplay...  But with a little bit of modding... say : The Great War mod or something... this game turns quite interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Found this difficult to accrue any resources in the early stages of the game, can't fault the game, possibly bad start-up for me,retreating back to Empire instead, I will get around to it, only when I've exhausted my time with the others.",
            "review_score": "1"
        },
        {
            "review_text": "Better in game mechanics than Empire total war! Enjoyed it alot!",
            "review_score": "1"
        },
        {
            "review_text": "Play as Russia and remain neutral while France obliterates everything. Face the baguette hordes in defense of the Motherland.",
            "review_score": "1"
        },
        {
            "review_text": "  Love this game it is so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is a better made, but more focused version of Empire Total War. The faction roster is depressingly small, the campaign only has one continent, and has less depth. However, the battles are better, it runs better, looks better, and there are less bugs. This is not worth full price, but is a steal on sale",
            "review_score": "1"
        },
        {
            "review_text": "Nice gameplay and it's worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Stormed all of Eurpoe as Russia. Old Vladdy's dream.",
            "review_score": "1"
        },
        {
            "review_text": "Napoleon total war is a great realistic game it is just perfect for my interest's such as history and strategic video games. i reccomend this game to fans of the napoleonic wars and the british empire but i dont reccomend this game to steam users who expect the highest quality of graphics.",
            "review_score": "1"
        },
        {
            "review_text": "just one more bridge to cross one more city then we can rest. Napoleonic era dedication and adventure gave so much to the world . The Epic Struggles on land and sea are legend. Because the focus here is the land war with a side show of the sea actions it misses some map you are used to with Empire TW. But that said you focus in on a nice expanded view with improved maps and sound. The AI is a bit wierd in holding alliances for selfish divided reasons. The Map tells you no worries Le Emperour is far away we can invade the Ottomans and next you know hes past Wien and your all thats left. ITs set for a differant style .like Cesar in Gual had to improve and wait one must simply move depleated merging and risking all.  The Unit make up of start positions puts alot on reenforced divisions of combine arms ..when people seem to likw full stacks its the power of a good General in the right place . i think its probly better as a multi player in a way of balance the historic battles are excellant maps and feels just right. =SB=^-^",
            "review_score": "1"
        },
        {
            "review_text": "I love this game for what its worth.",
            "review_score": "1"
        },
        {
            "review_text": "'Villain Most in Need of a Hug' Award Contender",
            "review_score": "1"
        },
        {
            "review_text": "If ya like strategy games this is the way to go! BUY IT OR NAPOLEON WILL GET IN YER PANTS!!!!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game. but its not working anymore. no idea why tho",
            "review_score": "1"
        },
        {
            "review_text": "Aaahhh, this is a classic. More detailed look at Europe with fantastic development on both strategic and tactical fronts.  Lovely stage of Total War franchise",
            "review_score": "1"
        },
        {
            "review_text": "best total war game",
            "review_score": "1"
        }
    ]
}