{
    "app_id": 340340,
    "name": "Domestic Dog",
    "release_date": "2015-04-10",
    "developer": [
        "Sean Davy"
    ],
    "publisher": [
        " Sean Davy"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Casual"
    ],
    "achievements": 32,
    "positive_ratings": 384,
    "negative_ratings": 90,
    "price": 1.99,
    "description": "DOG-based Simulation / Survival / Exploration Become a randomized dog in a randomized house and survive the harsh domestic life! Explore the city and interact with the world to discover items and secrets. Play, eat, drink, and sleep, remember to take care of yourself!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340340/header.jpg?t=1553296308",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 / 8 Processor: 1.2 GHz processor Memory: 2 GB RAM Graphics: DirectX 9-compatible graphics card with at least 32MB of video memory DirectX: Version 9.0c Storage: 400 MB available space Sound Card: Onboard",
    "recommended_requirements": "OS: Microsoft® Windows® XP / Vista / 7 / 8 Processor: 1.4 GHz processor or faster Memory: 2 GB RAM Graphics: DirectX 9-compatible graphics card with at least 32MB of video memory DirectX: Version 9.0c Storage: 400 MB available space Sound Card: Onboard",
    "reviews": [
        {
            "review_text": "BEST GAME EVER MADE 10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "BARK BARK ARF RUFF  Basically its a dog simulator.  You poop, pee on EVERYTHING, break stuff, bark for no reason, eat your poop and chase squirrels.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why people are hating on this game, ITS 3 BUCKS. I personaly think this game is fun for the price, but the only downside is that the developers are just doing tiny changes, why not add a map or somthing?? Sure this game is Really hard to understand and the fact that you have to babysit the meters is fine, if your looking for a small quirky fun game you wanna play from time to time. Then get it, and I hope the developers work on this more. So overall, yes I would reccomend this game!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game! It reminds me a lot of tamagotchi (digital pet toy). The game gets repetitive quickly as it is short, however. The achievements are fun and I'm enjoying trying to get them all. I really like how many types of dog/house combinations that are possible. The music is great and I love all the minigames inside of the game. If you're looking for a short, cute, casual game with a hint of nostalgia, check this one out!",
            "review_score": "1"
        },
        {
            "review_text": "Boy. Excuse my yarn-stringed review here, never written a steam review before. May as well post one here, I like this game, and enthuse about it to my friends, not only because if they don't like it they don't have to waste a bunch of money, but also because it's a fun pick up and play game.  I picked this game up ages ago back when it was Domestic Dog Simulator. A lot of my friends bashed it at the time, I'm kind of frugal/poor and saw this cute atari-style game for cheap during the sale. Don't regret picking it up way back when.  It's funny, but humour is subjective, either you find it funny, or you don't. People are individuals, we all have different tastes, so it's not like we can expect everyone to find the same things funny, on the same note, people most definately can have tastes in humour that lead them to find this sense of comedy boorish, unfunny, etc.  It all boils down to what kind of experience you want from a game. If you were looking for a real dog simulator game... This really isn't that great, tbh. It's almost taking the ♥♥♥♥. It's definately good for a bit of fun, a lot of bang for your buck. There's minigames, lots of things to do, too.  Honestly? I can't really write a majorly convincing review for this game as to why you can buy it, because it'd be like trying to convince you to like MY sense of humour, which is pretty impossible.  Just don't take it too seriously, it's not that deep fam. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutly amainzg!",
            "review_score": "1"
        },
        {
            "review_text": "I peed all over the front room and then was hit by a van. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Games strange,hard for me to understand what to do. ",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: go outside Step 2: stand in the street Step 3: wait Step 4: profit",
            "review_score": "1"
        },
        {
            "review_text": "10/10 took a ♥♥♥♥ then ate it best game ever",
            "review_score": "1"
        },
        {
            "review_text": "you pee on stuff and do dognip 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "its fine",
            "review_score": "1"
        },
        {
            "review_text": "You can blow up a car with your crap.  I'm not kidding.  Best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "She had a deep, throaty, genuine laugh, like that sound a dog makes before it throws up.",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game on sale for 2.20$ ( Canadian ). And. All I have to say is that. This game is amazing. I rate 8/8. Only now do I know what it feels like to ride around on rollerblades peeing on innocent friendly dogs while wearing a very stylish collar! I'd get arrested if I did that in real life. I can now say I know what that feels like. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "best game ever! ive played so much of this game on my other account (@kelp) and i love to paint those sheep yellow with my amazing piant buy this game! ps i love to dig.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun goofy dog sim. A dog-town to explore, stuff to buy, a robbery to make, drugs to do. You know, typical dog stuff.",
            "review_score": "1"
        },
        {
            "review_text": "You must be 'barking' mad to buy this game ;)",
            "review_score": "1"
        },
        {
            "review_text": "It can be a ruff life as a dog.",
            "review_score": "1"
        },
        {
            "review_text": "Only has a thumbs up only because I cant recommend this game or put it down. It's just ehh.",
            "review_score": "1"
        },
        {
            "review_text": "The existence of this game makes everyone's lives better.",
            "review_score": "1"
        },
        {
            "review_text": "dog simulator is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "For so cheap, I expected this game to be crap.  Oh boy was I wrong!  This simulator is great fun. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining for about ten minutes... Simulation is a bit of a stretch.   If it's cheap, like almost free, then I recommend it.   Also good if you like rehashed versions of ancient video games.",
            "review_score": "1"
        },
        {
            "review_text": "Pooped in the road, car ran over it, blew up.  11/10 would get hit by a car",
            "review_score": "1"
        },
        {
            "review_text": "Actually a very good game, I enjoyed getting all of the achievements in it.  As silly as the game seems I would recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I think in order to like this game the idea of a virtual pet should be one you found apealing either in your child hood or recently. The point of the game is to dog (yes the verb dog). Its silly, gross, simple, pointless, and generally just light fun. I got this game because my younger brother saw it on youtube and wanted it really bad and I have to say it was entertaining to play around with. If you are looking for a puzzle game, this isnt it. This legit is a silly dog game with some fun SIMPLE aspects and puzzle like mini game things. If its on sale I\\'d get it. I did pay full price for it though and Im happy with it. Its a fun pass time when you have legit nothing to do or a good game to get little kids with a sense of humer.",
            "review_score": "1"
        },
        {
            "review_text": "If this looks like Pewdiebait to you, you are probably right. I usually suck at distinguishing pewdiebait from real games, but this game is not very interesting when you start playing it. It's more like having to do chores as a dog. Boring as hell. Sure, there are some fun dogs, but as soon as it dies it's gone and you will have to hope for something that doesn't suck as much. It seems alright at first, but soon you will start to notice that within every 5 seconds you have to fix one of the bars that's down to red. You will have to eat, sleep and poop so frequently you start wondering if this dog has any sense of time. Thanks to the lack of explanation you are also left in the dark as to what you should do to fix something, how to keep on sleeping until the bar is full (It interrupts at irregular intervals) and how much food you actually have. You will also notice a vicious cycle of I have no food -&gt; I have no money to buy food -&gt; I dig for money -&gt; I need more food but I have no food -&gt; I have no money to buy food and so on and so on and so on. The game contains some fun easter eggs here and there but without a real goal and seemingly effectless shops the game will bore you before you even started to like it. It's cheap, so if you really need to kill some time you might want this, but you're better off doing almost anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay, I got this on a whim cus it looked fun and it had overall positive reviews. Bad line: I regret my decision.  This game sucks on so many levels...and speaking of which, there is literally hardly anything to do. Imagine Goat Simulator with 1/100 of the map, 2d crappy graphics, and 1/1000th of things to do, and you would have this mess. If it was a flash game on Armor Games or Kongregate, I would give it a 1 out of 5, but this, this is much lower than that since I am ashamed to have paid for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor effort.  Another player described this game to me as 'Youtube bait' and i totally agree. There is no obvious objective nor is there a storyline to follow. You walk around and pee on things and thats pretty much the whole game.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh how wacky; you can pee and poop... Yeah, this is just not an entertaining game.",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks you cant poop automatic its pixelized and its hard also i think its just plain stupid ",
            "review_score": "-1"
        },
        {
            "review_text": "It becomes boring REALY fast. It's a shame i didn't read ther thing for steam refunds.",
            "review_score": "-1"
        },
        {
            "review_text": "yet another ♥♥♥♥♥♥ meme game if this game was a physical copy i'd take a ♥♥♥♥ on it ♥♥♥♥ on it rap3 the ♥♥♥♥ing disc set it on fire and kill its family",
            "review_score": "-1"
        },
        {
            "review_text": "It's not really fun, but I guess you can pee on things...",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst 8bit games ever. This game has no point to it.",
            "review_score": "-1"
        }
    ]
}