{
    "app_id": 340320,
    "name": "Sinless + OST",
    "release_date": "2015-12-16",
    "developer": [
        "MGP Studios"
    ],
    "publisher": [
        "Forever Entertainment S. A."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "achievements": 31,
    "positive_ratings": 142,
    "negative_ratings": 58,
    "price": 3.99,
    "description": "&quot;Before we knew it, what we once knew as 'freedom' became nothing more but a faint and distant memory.&quot; Venture forth and discover the truth behind the seemingly perfect OmniCare society in Sinless: a unique point and click and visual novel hybrid, set in an original cyberpunk reality.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340320/header.jpg?t=1541750961",
    "minimum_requirements": "OS: Windows 7 Processor: Dual core from Intel or AMD at 2.0 GHz Graphics: nVidia 320M or higher, or Radeon 7000 or higher, or Intel HD 3000 or higher",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Something nice for a change. Great art! I enjoyed the colors and style. Also the soundtrack is very good. The game itself quite interesting and addictive. I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game, but sometimes buggy. Got trapped in Jenny's apartment without any way to exit the room, had to restart the game. Beautiful background art, though.",
            "review_score": "1"
        },
        {
            "review_text": " Review + Giveaway x3",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR; A homage to cyberpunk genre and movies like Blade Runner. Game crashes way too often, and second chapter is not here still, but what is present i well worth playing for cyberpunk fans.  Review: Sinless is a visual novel set in neon-shining futuristic cyber-dystopian society.  It is what you would expected Cyberpunk would look like, if you were reading books in 80s and 90s .  Graphics is gorgeous. Music is very ok (despite me not being a fan of that type of music from previous millenium). Storyline is a bit twisted, as expected. Dialogue quality is very uneven. Intro dialogues from first scenes can be very non-climatic.  Things I have problems with in this game: - way too short for something that was supposedly 5 years in the making - unnecesarry pixelisation (really, games back then looked pixelized because there was no other way, but now there is no reasons to force it upon players) - game crashed on me 7 times during 2h playthrough  Conclusion: Buy on sale if a fan of cyberpunk genre. Worth playing for the experience, really.",
            "review_score": "1"
        },
        {
            "review_text": "This game has amazing visuals, a very interesting world and premise, but the writing could be more engaging, as I never felt attached to my character or really curious about what was going on. Right now, there is only one chapter of this game complete. I'll update this review as the rest is released, but right now I cannot recommend this. Not the worse game ever, but not the most interesting P&amp;C game.",
            "review_score": "-1"
        }
    ]
}