{
    "app_id": 340300,
    "name": "Teddy Floppy Ear - Mountain Adventure",
    "release_date": "2015-01-09",
    "developer": [
        "Forever Entertainment S. A."
    ],
    "publisher": [
        "Forever Entertainment S. A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Family Friendly",
        "Casual",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 510,
    "negative_ratings": 62,
    "price": 3.99,
    "description": "Teddy Floppy Ear is a main character of series of adventure games for the children, based on the on famous Polish cartoon. Send your kid onto an unforgettable journey with the world’s most charming bear!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340300/header.jpg?t=1447366551",
    "minimum_requirements": "OS: Windows 7 Processor: Dual core from Intel or AMD at 2.8 GHz Graphics: nVidia GeForce 7800, ATI/AMD Radeaon HD2600/3600",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you have a 3-4 yo who you want to introduce to a mouse and a computer, then this game is a good choice. Graphics, sound and level of difficulty are perfect for such age. A little older child (7 yo) also looks at this game with curiosity, however I suppose that it would be too easy for him.  A simple, nice and friendly game for smaller children.",
            "review_score": "1"
        },
        {
            "review_text": "it's a great game for kids. they love it :)",
            "review_score": "1"
        },
        {
            "review_text": "It was a fun 1 hour game. But you can get it cheaper elsewhere",
            "review_score": "1"
        },
        {
            "review_text": "Cute adventure and learning game for kids we even enjoyed playing as grown-ups :D The graphics are beautiful, the voice acting is good too.",
            "review_score": "1"
        },
        {
            "review_text": "Actually this is a game for kids, but as an adult it is also enjoyable. The graphics are nice, puzzles , of course, really simple but fun to play as a time killer. The game is quite short, so I am glad I bought this game in a bundle with 2 other Floppy games for 1 Euro. Maybe this game is worth 5 Euro's if you buy it for your kid or little nephew, for them it takes longer to finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY ♥♥♥♥ING ♥♥♥♥ THIS IS THE BEST ♥♥♥♥ING GAME OF THE CENTURY. METAL GEAR SOLID 5 AINT GOT NOTHIN ON THIS ♥♥♥♥EN GAME HOLY CHICKEN TESTICLES GAME OF THE YEAR HANDS DOWN. AND IF YOU'RE NOT CONVINCED LET ME GIVE YOU MOTHER ♥♥♥♥ERS.  GRAPHICS: HEARD OF THE FOX ENGINE? ♥♥♥♥ IT, ITS ♥♥♥♥ COMPARED TO THE BEAUTY OF THIS GAME. THERE WAS A TIME WHERE I ACTUALLY THOUGHT I WAS IN THE GAME, SO REALISTIC.  GAMEPLAY: THIS GAME IS SO GOOD IT DOESN'T EVEN NEED GAMEPLAY  CHARACTER DESIGN: YOU HAVE A PEDO UNCLE WHO'S A FRENCH WEINER DOG THAT DRESSES LIKE REVOLVER OCELOT FROM MGS5, WAIT NO... OCELOT DRESSES LIKE PEDO UNCLE. ANYWAY, HIS FIRST MISSION FOR YOU IS TO GET A CAMERA FROM HIS LOCKED BASEMENT... WHAT COULD POSSIBLY GO WRONG? THEN THERE'S A BEAR THAT IM PRETTY SURE IS YOUR REAL FATHER WHO ABANDONED YOU BEFORE YOU WERE BORN BUT WHAT EVER  GO BUY IT NOW, WHAT ARE YOU WAITING FOR",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game, but the fact that you can't repeat a dialogue makes the game a little bit hard, as sometimes you may not understand what is being requested.  In order to make it easier for children to understand, the dialogues should be repeatable, and although voice acting is a good thing, it shouldn't be exagerated. For example, the bear is a little bit hard to understand due to its sad growling voice.",
            "review_score": "1"
        },
        {
            "review_text": "My uncle told me he had a present for me in the basement. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It was decent. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Should be awarded best game of 2015.",
            "review_score": "1"
        },
        {
            "review_text": "literally the best game i've ever layed my eyes on. Like Skyrim with floppy ears 10/10. No No No! - The man himself TFE",
            "review_score": "1"
        },
        {
            "review_text": "Played the game for 30 minutes, I uttered the words 'Uncle please' atleast 90% of the time because he keeps asking you to do random ♥♥♥♥. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "patient: is there a cure to my cancer? doctor: yes, just play Teddy Floppy Ear - Mountain Adventure for 1 hour per day and you will be ok within a week",
            "review_score": "1"
        },
        {
            "review_text": "Never have I cared about the story of a game as much as I did with Teddy Floppy Ear - Mountain Adventure.   The Good     Masterful storytelling    Great voice acting    Amazing subtitles    Soundtrack fits perfectly    Extremely well optimized    Top notch graphics    Floppy ears    The Bad     Only one floppy ear    Costs too much (39p is unreasonable)   All in all, the best game I have ever played.  9/11",
            "review_score": "1"
        },
        {
            "review_text": "wow this game is really edgy    le tips fedora 9/11 top holocaust",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than sex.",
            "review_score": "1"
        },
        {
            "review_text": "6:55 AM - DOSH: gg beat game in 75 mins 6:54 AM - Left click victim: lel 7:00 AM - DOSH: the kid bear has sex with his uncle then leaves 7:00 AM - DOSH: great game 6:59 AM - Left click victim: ok 7:01 AM - DOSH: And the uncle was a dog idk why 6:59 AM - Left click victim: hot 7:00 AM - Left click victim: there's like 1 review 7:01 AM - DOSH: Probably because it was for 5 year olds 7:01 AM - Left click victim: Features: 7:01 AM - Left click victim: - Great for even the youngest kids - Absolutely no violence 7:01 AM - Left click victim: what 7:01 AM - Left click victim: the ♥♥♥♥ 7:01 AM - Left click victim: i don't egt it 7:01 AM - Left click victim: i don't get it 7:02 AM - Left click victim: big floppy bear sausage 7:02 AM - Left click victim: :) ",
            "review_score": "1"
        },
        {
            "review_text": "Great kids(10 and under imo) game!! Your kids may love it!",
            "review_score": "1"
        },
        {
            "review_text": "sweet .... ; )  ... for the young and the young at heart !!!    Wonder why the producers didn't integrate all european languages ??? This would make the game an useful easy language learning tool for toddlers too ******** Spoiler: To unlock all MiniGames from beginning: in the options menue , touch with cursor the 4 cabin doors from left to right when the cabin is passing the screen",
            "review_score": "1"
        },
        {
            "review_text": "Cool game - it reminds you of your childhood and sh*t :D",
            "review_score": "1"
        },
        {
            "review_text": "Really short, really fun. Me and my brother really like it.",
            "review_score": "1"
        },
        {
            "review_text": "  Don't believe the other reviews, they're fake there is a jumpscare at the end involving FNAF",
            "review_score": "1"
        },
        {
            "review_text": "This is a good point-and-click starter for kids. Teddy Floppy Ear has a relaxing ho-hum pace. There are simple minigames throughout but I have yet to figure out the leaf sorting game. We get by on trial and error on that one, at least until I can get myself back in PreK. I think this game is best suited for 3-6 year olds. My 8 year old played it and liked it but I could tell he felt a little guilty about it.",
            "review_score": "1"
        },
        {
            "review_text": "A point and click game that is so bad it's good... to a certain degree.  On one hand it have hillariously bad voice acting, amusing glitches, production values that flail wildly between 'it looks alright' and 'how did I get this DOS game installed on Windows 10', and all sorts of wonderful bad stuff  On the other hand, it has incredibly unresponsive controls, it crashed during a puzzle and wouldn't let me redo it and it just skipped it completely, and the whole game can easily be beaten in under two hours  Then again it goes on sale for 1$ or below a lot, so if you are into abysmal voice acting or want a cheap game that your kid might enjoy for a little while then go for it when it's on sale. Not worth the full price though",
            "review_score": "-1"
        },
        {
            "review_text": "My 13 year old child absolutely hated this game. I got it for him so he could learn the alphabet and shapes like he should have been when he was 5. But, this game taught him none of that. Plus, he described the game as 'boring as hell'",
            "review_score": "-1"
        }
    ]
}