{
    "app_id": 340540,
    "name": "TDP4:Team Battle",
    "release_date": "2015-03-12",
    "developer": [
        "JAVELIN OÜ"
    ],
    "publisher": [
        "JAVELIN OÜ"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "2D"
    ],
    "achievements": 0,
    "positive_ratings": 261,
    "negative_ratings": 347,
    "price": 0.0,
    "description": "TDP4 Team Battle is a real-time multiplayer 2D shooter game with MMORPG elements. The bloody battle for survival among 3 races. There are various types of matches, locations and types of guns. Developed Clan and Tournament system.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340540/header.jpg?t=1447366595",
    "minimum_requirements": "OS: Microsoft® Windows® XP (32 bit), Windows Server 2008 (32 bit), Windows Vista® (32 bit), Windows 7 (32 bit and 64 bit), Windows 8.x (32 bit and 64 bit), or Windows Server 2012 (64 bit) Processor: 2.33GHz or faster x86-compatible processor, or Intel® Atom™ 1.6GHz or faster processor for netbooks Memory: 512 MB RAM Graphics: 128MB of graphics memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 50 MB available space Sound Card: Any",
    "recommended_requirements": "OS: Microsoft® Windows® XP (32 bit), Windows Server 2008 (32 bit), Windows Vista® (32 bit), Windows 7 (32 bit and 64 bit), Windows 8.x (32 bit and 64 bit), or Windows Server 2012 (64 bit) Processor: 2.33GHz or faster x86-compatible processor, or Intel® Atom™ 1.6GHz or faster processor for netbooks Memory: 1 GB RAM Graphics: 128MB of graphics memory DirectX: Version 9.0c Storage: 100 MB available space Sound Card: Any",
    "reviews": [
        {
            "review_text": "10/10 Would Idle Again.",
            "review_score": "1"
        },
        {
            "review_text": "nice game for passing time",
            "review_score": "1"
        },
        {
            "review_text": "couldn't beat the tutorial, and my name could be ♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥♥ 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I never expected to have to see this game again - especially not on Steam.  I used to play this game - a lot in fact. I used to play is so often that I was on the leaderboard for goodness knows how long. In fact, I'm probably still there if I ever feel the need to log back on, which I can promise everyone here, I won't.  The game is riddiculous, the moderators were awful (I assume they must have been replaced by now at the very least) the developers are obvious cash grabbers and the community itself is downright toxic.  Not once have I been so dissapointed by the Greenlight system to actually begin to condemn it.  But enough about my life story, let's get down to business.  The game is P2W and I think that's obvious to everybody who has played the game for longer than an hour. In fact, I spent quite a jolly well amount on this game over the years that I played. The chances of somebody acquiring enough cash and coins to be able to compete with the top players is just stupidly low. If anything, the best chance you have is if you befriended an incredibly skilled player so that you can mooch off of that person during the tournaments, even then it would take weeks if not months to have enough to purchase anything worthwhile.  The developers are an absolute joke: I left the game approximately a year ago and I took a look today just so I could make this review on Steam and the updates are just so damn awful it's an embarrasment. From what I can see is that they've added more guns and made the place look pretty along with a couple of incredibly dull gamemodes which aren't worth anybody's time.  I noticed a few reviews earlier complaining about the farming and cheating. I generally believe that to be overhyped nonsense in most games myself, but this time it's actually true. In fact, it's so bad that the developers created a system where players find other players who cheat or hack and are rewarded for doing so. I remember it being so bad that I along with the majority of the population were having to complain to the moderators who simply were not fixing this issue and rewarding people their well deserved money. Bare in mind that these were 20 odd pages of this stuff. I'm not even going to bother counting the amount of reports there.  The moderators themselves were an absolute joke. Again, I'm basing this on the previous moderators so they're probably different people now. One fellow who managed to become a moderator was simply because he was a popular fellow within the game. He was a 15 year old child. You don't give children that amount of power over people - and he was no exception. Another fellow who was a moderator was somebody who I had never even heard of. Do bare in mind that the community was very close to one another even if they were a bunch of toxic individuals who I'd never offer a cup of tea to, so this came as a surprise to me. What happened? This individual became easily the worst moderator I have ever seen to date - laziness was out of this world. I can only hope these two are gone for the community's sake at the very least.  Community is toxic - I don't think I ever had a day during my years of playing without being insulted repeatedly on a daily basis. Now you can remove the chatting function so you don't have to read people's comments, but it does become rather tiresome after a while. It's a child's game, not that that's a bad thing, but it's run by children for children. Expect extremely childish comments to be made.  The clan system is pointless. I did run several top clans at one point or another. In fact, I remember it very well indeed. They were the only reason I stayed around for so long, eventually I just got tired and left however, one can only stand so much boredom in a game. There were tournaments which took place which were interesting even if I didn't take part in any of them for my own reasons.  But of course, I leave the worst till last. My opinion as to why the game is essentially dead: comboing and flag farming. People level up too quickly and leave the game immediately after. I was one of the few people at the time who never did any of these things. In fact, I even had a clan which was completely against either of these things. You did any of that, and you'd be gone without a second's hesitation I abhore it and I find it pathetic that the developers thought that this should have been allowed to occur even when they knew this game was dying. Absolutely shameful and I feel no pity for them whatsoever. They brought it on themselves.  Honestly, this game shouldn't be worth anybody's time. I have no ill feelings towards it in the slightest, but it simply isn't worth it. P2W, awful developers and obviously a cash-grab. I'm sure the only reason it's still running is because of people paying money because of simple nostalgia.  I loved it at one point, and it helped me through a lot of problems, but God damn is it a joke that it's still around and on Steam of all places.  2/10 and this will be the last day I ever open TDP4 again for any reason.  And if anybody wants to know who I am, I'm sure you can figure it out eventually.",
            "review_score": "-1"
        },
        {
            "review_text": "I will probably quit gaming for like 5 months.",
            "review_score": "-1"
        },
        {
            "review_text": "Steam delete this ♥♥♥♥ and bring Gigaslave to steam ! what is Gigaslave?         YouTube™ Video:  Metal Assault Gameplay - First Look HD&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Money grabbing - Pay to win - Unbalanced - Bloody awefully designed game - The money ♥♥♥♥♥s really need rethink the design of this game. It's appsoulte crap. Do not waist time and money on this ♥♥♥♥!   If you want to play a good free to play shooter, go play TF2.  In a few words - This game is a downloadable turd!!",
            "review_score": "-1"
        },
        {
            "review_text": "Pay to win crap",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game. Simple Yet Addicting. I smell Potential.         Nah, Just messing with u : it's pay to win!",
            "review_score": "-1"
        },
        {
            "review_text": "do not play this game. -5/10",
            "review_score": "-1"
        },
        {
            "review_text": "possibly the worst game on steam",
            "review_score": "-1"
        },
        {
            "review_text": "used to be good, but now once i join a server my team leaves and get spawn killed :)",
            "review_score": "-1"
        },
        {
            "review_text": "100% bad. im not a kid anymore. I dont have time to learn a broken ♥♥♥♥♥♥ game. AVOID AT ALL COSTS!",
            "review_score": "-1"
        }
    ]
}