{
    "app_id": 340830,
    "name": "Razenroth",
    "release_date": "2015-08-28",
    "developer": [
        "Enitvare"
    ],
    "publisher": [
        "Enitvare"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Indie"
    ],
    "achievements": 43,
    "positive_ratings": 380,
    "negative_ratings": 84,
    "price": 3.99,
    "description": "Razenroth is an action shooter with a dark atmosphere, enriched with the elements of roguelike and RPG. All the levels, weather conditions, distribution and quantity of key elements are generated randomly. Thanks to this fact, a single game is different each time.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/340830/header.jpg?t=1555269718",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 / 8 Processor: Athlon 64 X2 4200+ 2.20 Ghz Memory: 1 GB RAM Graphics: 512 MB, Shader Model 3.0 (GeForce 9600GT or greater) DirectX: Version 9.0c Storage: 1500 MB available space Sound Card: Compatible with DirectX®: 9.0c Additional Notes: keyboard and mouse required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I was one of the testers before-hand, and have more hours than shown. I have three or so hours from offline play.   Being a big fan of difficult, rogue-likes and randomly generated content, I can fully recommend this game. The gameplay, like most games similar to this, takes adapting. You most likely will die a lot, at least at first, but you learn from each playthrough.   The art is simple, yet great. It really fits the vibe of a grim indie-RPG game with rogue-like features.  Each playthrough is entirely random generated. Enemies, weather, locations, layouts, all random. It's quite well-done, I would say.  Unlockable characters add to the replayability of the random generation. I've personally only used the first character, so I'm not able to say much on others.   All in all, I believe this game provides more than enough quality content, especially for such a low price. Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good dark fantasy rouge-lite twin stick shooter with atmosphere.  The intro movie is interesting and sets up the setting for the game. From there you have a pretty standard rogue-lite shooter. Use gold to buff yourself in the current run, and dark crystals to buy long term boosts that will impact every game going forward.  The RNG can be a little high in this one, sometimes early on in a run you find yourself up against a level boss that you just don't have the tools to deal with easily. Sometimes you will breeze through to the end. Also it is not always clear what terrain will block shots and what won't, which can lead to some minor frustration.  Controls are tight, sound and music add to the experience. Overall a very decent game.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Apparently the review ain't amusing.. So I had to change it. Maybe because i'm drunk.  Kind of worth it if you get it when its on sale but not quite so when its on sale at its original price.  Razenroth is a top-down survival shooter with roguelike element (permadeath) where you'll lose all your character's level and progress when you die.   (18/1/2016) +Gameplay is smooth which is vital for a dodge-n-shoot arcade. -Short adventure with not much differences in enemies +interactive elements such as quests, campfire, lootings, buffs from runes/glyphs/altars, and pets. -minor accessible feature that defies Roguelike element in the game +slighty better decency graphic and cool atmosphere +character progression are currently not diverse but fairly effective to most of your journey (skill points) -items loot hardly matters thanks to the current inventory system +rarely challenging yet entertaining bosses -3sandbox5me -not so storying story yet.  7.4/10 need more boss battle music.",
            "review_score": "1"
        },
        {
            "review_text": "very nice and challenging game but not too hard like other games, where you try and try and you don't reach anything. plenty items to reveal, several charakters to unlock and an interesting collection of abilitys to upgrade.",
            "review_score": "1"
        },
        {
            "review_text": "It's a few fun game to play if you have a short amount of time. Most runs for me are 10-20 minutes and i enjoy the game every time. The only thing I would like to see added to this game is an 'arcade' mode where you can keep playing endlessly.  Seeing as I currently have the #1 spot there isn't much for me to do but beat my time.   Played game for 2 hours, gets #1 in world on 'Hell' difficulty. I rate 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "T r a s h",
            "review_score": "-1"
        },
        {
            "review_text": "I am rewriting it... after playing it for 9 hours... this game may seem a bit monotonous at the beginning, with just a couple of enemy types and the same gameplay... Believe me, it is very varied. If it seems monotonous, is it probably because youhave not played it for long enough. There is a decent amount of depth with the items and perks that you collect in the game. It is random, so each run will be a different experience. I can explain the in-game mechanics, but I find discovering it by yourself makes it more interesting. If you like rogue-likes, there is no reason you won't like this.",
            "review_score": "1"
        },
        {
            "review_text": "Refunded. why? the game literally makes you bore to death.",
            "review_score": "-1"
        },
        {
            "review_text": "I was hoping for a nice little hack and slash. But was a little dissapointed by the movement controls which felt more like ice skating and lacked the ability for me to accurately place my character between incoming spells. Presentation was nice though and the price is good.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game if you like procedurally generated roguelike top-down shooters. Few kinks but nothing major.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game,   only flaw is that each playthrough is short, each game is only 3 or so dungeons long.",
            "review_score": "1"
        },
        {
            "review_text": "The game gets boring pretty fast. The save system is buggy, therefore it's just a waste of time trying to accomplish anything here.",
            "review_score": "-1"
        }
    ]
}