{
    "app_id": 341070,
    "name": "Stay Dead Evolution",
    "release_date": "2015-02-04",
    "developer": [
        "Brucefilm"
    ],
    "publisher": [
        "Plug In Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Beat 'em up"
    ],
    "achievements": 0,
    "positive_ratings": 35,
    "negative_ratings": 61,
    "price": 4.99,
    "description": "Be an action B-movie hero and defeat all your enemies in this intense fighting experience! Stay Dead Evolution is a unique arcade action game based on real life footage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341070/header.jpg?t=1447366694",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core 2 Duo 2.00GHz or faster x86-compatible Processor Memory: 512 MB RAM Graphics: 512 MB (GeForce 8800 or better) DirectX: Version 9.0c Storage: 850 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Remember when FMV arcade games were popular? I do, but that's because I'm older than dirt. Seriously though, I think that there's a certain charm to QTE-based FMV games. A lot of them feature dozens of ways to die, and it's amusing to see just what can go wrong, simply because you pressed up instead of down. It also helps that some games - like Dragon's Lair 2 - have really interesting visuals.  There's nothing amusing or visually interesting about Stay Dead Evolution. The developers of this game probably would have been better off trying to license some old Shaw Brothers films, and just slap a big red X on the screen whenever the wrong button is pressed. At the very least players would be treated to awesome fight sequences. Actually, I take that back. If there were fights worth watching, who would want to be forced to press buttons at the right moment, just to keep the action going? Admittedly, I'm going off on a tangent, but think about it for a second. You're given the choice between playing a videogame, or watching a Martial Arts movie. If you wanted a little of both, you'd play a fighter, or maybe a beatemup.   If you play this game, you're making a commitment. You're sacrificing your free-time in order to play a game that offers no entertainment. Even if we take away the amateurish production values and the boring fight-scenes, we're left with a game that's just really frustrating to play. Basically you hit the arrows when they appear onscreen and a little moving indicator is in the right spot. If you double-tap the keys when the right colors appear, you can perform combos or counter the opponent's attack. It's a pretty simple system to figure out, once you browse the tutorial.  So let's say you beat the first opponent. No wait, you humiliate him. He can't even land a hit, and you deliver a stunning combo that drains almost all of his health. So he forfeits the match and you're feeling pretty confident. However, when you face the next opponent, the QTEs speed up at an alarming rate. Your brain needs time to see A) what arrow-key to press B) the color of the box (which determines if you can combo/counter) and C) the little moving indicator that flies across the box. Even when your brain has gathered all of this information, you still have to press the key. This is where a lot of players are going to be tripped up. There's a little randomization and the window to press that key seems to vary in size. If your timing isn't super-precise, then you're going to take damage.   Apparently this is one of those games that you're supposed to play frequently. After a long enough period of time, you can adapt to the poorly-designed difficulty, and the absurd timing requirements. Your reward for mastering this game? Oh right, the snore-inducing fights.  In short: This is just one of many games in my library that has earned the rating of 'YIKES!'",
            "review_score": "-1"
        },
        {
            "review_text": "The QTE games I've played in the 90s were much better on Sega Saturn and MAME. I am not fan of this game, but props to the attempt.",
            "review_score": "-1"
        },
        {
            "review_text": "I would rather play a video game version of Tommy Wisseus 'The Room' than play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 the citizen kane of modern video games.",
            "review_score": "1"
        },
        {
            "review_text": "I really do hope that one day, someone will make a fighting game where they will mix-up street fighter with real life movie-like sequences. I 've always dreamed of that kind of game. I really do hope that they will invest into creating interesting characters with origin story. I really do hope that gameplay will have something creative in it and not just no-brainer-reflex-button-mashing. I really do hope that they will bring all sorts of martial arts into that game.  Yep...too bad that there isn't that kind of game. I really do hope someone will make it one day...",
            "review_score": "-1"
        }
    ]
}