{
    "app_id": 341090,
    "name": "On A Roll 3D",
    "release_date": "2015-02-12",
    "developer": [
        "Battenberg Software"
    ],
    "publisher": [
        "Battenberg Software"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 24,
    "positive_ratings": 203,
    "negative_ratings": 27,
    "price": 2.79,
    "description": "On A Roll 3D is a fast, colourful 3D platform game. Roll your way through 24 huge levels across six different themes and be prepared to take on spikes, mines, dynamite, conveyor belts, springs, switches, doors, bumpers, lasers, saws, fire, ice, water, electricity, trapdoors and much much more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341090/header.jpg?t=1548775092",
    "minimum_requirements": "OS: Windows Vista/Windows 7/Windows 8/Windows 10 Memory: 1 GB RAM Graphics: DirectX or OpenGL Compatible Video card DirectX: Version 9.0c Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Interesting game in that the graphics/art style have a retro PS1/N64 look to them. I don't mean that in a bad way and I think that was the aim of the devs here, so if you grew up with those kind of games like I did you'll probably get a nice feeling of nostalgia when playing.  My initial impressions after about a half hour of it is it controls well on my gamepad, which is critical for this kind of game. Doesn't seem to suffer any major performance issues either. Gameplay is a bit slower then a Sonic game &amp; level design doesn't get that complex, but also generally doesn't feel frustrating which is a plus.  Overall it plays fine and has enough variety in the traps, differences in the zones, and overall content to keep you busy for a little while. For the price of a cup of coffee it's worth the couple hours you'll get out of it.",
            "review_score": "1"
        },
        {
            "review_text": "On A Roll 3D as its name implies is a 3D platformer game but it is essentially a 2D side scroller with 3D sprites.  Gameplay is simple with helpful tooltips to guide you along the first few levels. However, I experienced some freezes while playing the game; that may just be my lousy PC though.  The controls are smooth; and surprisingly, this game physics are pretty elaborate for such simple platformer. The camera pans quickly too.  I noticed some flickering textures which may be due to the shadows and lighting. Although distracting, it does not impact the gameplay.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Most of Steam's platforming games feature an innovative feature or gimmick which is very novel but complicates gameplay. Kudos to those games, but, sometimes I just want a simple, old-fashioned platformer. On a Roll 3D delivers that in spades. It's challenging, but not so much that I ever became aggravated. The visuals are are outdated in a pleasant kind of way--a throwback to the PC games of yesteryear. Nostalgia, here I come! The controls are responsive and the game appears to be, for the most part, glitch free. I shouldn't have to praise a game for being functional, but sometimes indie titles are a little spotty with control schemes and gameplay. If you're a fan of Sonic, Crash Bandicoot, or the original Gex, you will probably enjoy On a Roll 3D. Plus, you get to play as a cute ball.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason, this game reminded me Bumpy's Arcade Fantasy for MS-DOS.  I love this game! The 3D elements, the gameplay, the music, overall!  Thank you Battenberg Software!",
            "review_score": "1"
        },
        {
            "review_text": "Cosy little game with cool background tunes, only thing i wish for though is Workshop support to be able to create your own maps :)",
            "review_score": "1"
        },
        {
            "review_text": "It feels like the kind of game you'd find in a cereal box 15 years ago, and I honestly can't find anything wrong with that. It's simple, smooth and decently varied, with enough difficulty to result in a few deaths but not so much that it slows your progression. The 2.5D is satisfying, especially the way the camera deals with the twists and turns, and the soundtrack isn't completely awful, to boot.  Charming stuff, really, would recommend; mediocrity done well.",
            "review_score": "1"
        },
        {
            "review_text": "🌟🌟🌟🌟🌟",
            "review_score": "1"
        },
        {
            "review_text": "its a great platformer game. it feels and plays very much like sonic. youre on a fairly linear path with alot of loops and springy things to bounce on, and ♥♥♥♥ thats trying to kill you.  however it falls into the same trap as sonic, it gives you the ability and desire to roll forward really fast. but youll quickly realize that you cant just roll forward really fast, or youll get hurt alot. so it kinda brings that really fast moving fun pace to a stand still.  it feels JUST like a sonic game in that reguards, taunting you with rapid movement that isnt safe. but its a surprisingly solid game. with quite a few challenging levels. i reccomend IF you like the old sonic games.",
            "review_score": "1"
        },
        {
            "review_text": "I give this Game's Music 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This may be one of the very few satisfying platformers out there. The controls are very sharp, how you progress is purely up to your skill and not the game failing to deliver the desired action. PROs: - very sharp control, one of the best out there - some intriguing mechanics, like door switches or the upside down switch - the price vs content (although I got it in a bundle) - offers some diversity - rolling in circles make it feel a bit like the Sonic game I never got - has trading cards CONs: - it feels like there should be more levels, and features are being underused, like the upside down switch being in just 2 levels in there. - graphics not on par with 2015 release date and some flickering shadows in certain levels. - uninspired, even boring boss fights.  In conclusion, I'd love to see the same mechanics being used again in a game with more levels and focus on interesting ways to use the powers, and reconsider or give up the boss fights.",
            "review_score": "1"
        }
    ]
}