{
    "app_id": 341000,
    "name": "Mad Games Tycoon",
    "release_date": "2016-09-13",
    "developer": [
        "Eggcode"
    ],
    "publisher": [
        "Eggcode"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Management",
        "Simulation",
        "Strategy"
    ],
    "achievements": 39,
    "positive_ratings": 3211,
    "negative_ratings": 362,
    "price": 10.99,
    "description": "Form your own game studio set in the early 1980s in a small garage. Develop your own game ideas, create a team and develop megahit video games. Research new technologies, train your staff and upgrade your office space, going from a lowly garage to a huge building. Expand your business and dominate the world market for video games!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341000/header.jpg?t=1549893153",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core2 Duo 2.4Ghz or Higher / AMD 3Ghz or Higher Memory: 4 GB RAM Graphics: DirectX 10 compatible with 512 RAM or better Storage: 800 MB available space",
    "recommended_requirements": "OS: Windows 7, Windows 8, Windows 8.1, Windows 10 Processor: 2.8 GHz quad core or better Memory: 4 GB RAM Graphics: DirectX 10 compatible with 1024 RAM or better Storage: 800 MB available space",
    "reviews": [
        {
            "review_text": "I love this game. Think Game Dev Tycoon, just you can also be a publisher, more topics, far more indepth, with customizable buildings, a plethora of different room types each with their own specific role in the production/develop of video games, items to customize your Game Company, unlimited time span to play in, and best of all, ludicrously addicting gameplay. And it's only version 0.15! Yes, I know, I sound like a total fanboy... but Game Dev Tycoon left me wanting/craving a Game Development Company Management Simulation that had real depth, that could expand upon the already simplistic yet addicting gameplay with a tad more strategy. Well, this game is it. Absolutely recommend the finished product! Full Release Gameplay:         YouTube™ Video:  Mad Games Tycoon Release Gameplay&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A great tycoon game with a lot of content and more importantly, many ways to explore that content. It's definitely a 'never the same game twice' kind of game, even when loading from a save file and playing from that point on - depending on speed and difficulty settings, combined with random events, I've had all kinds of experiences, from the company that skyrockets to become an empire in a handful of years, to a small company just barely managing to make ends meet after thirty years in the business due to some overly ambitious decisions.  You can basically grow into whatever kind of company you want. Sure, you could make top of the line games that come in a box filled with extras like a t-shirt, and pamper them with updates and expansions to keep it selling for a long time. You could also just focus on cranking out a ton of solid but unremarkable games and ride sheer volume. You can nurture franchises, or even publish other companies games for them.  You can even churn out buggy movie tie-ins for consoles if you so please - and can manage to make it profitable.  What's more, there's plenty of starting options too - starting decade, an option to leapfrog to an office (rather than starting in your garage), randomization options, speed, difficulty - there's plenty to explore that will have an impact on your game.  It's an excellent tycoon game and I'm glad to continue developing the Sexy Puzzle Moms series of puzzle games, aimed at adults with the theme of fashion and eroticism.",
            "review_score": "1"
        },
        {
            "review_text": "So good. Like Game Dev tycoon but with more features!",
            "review_score": "1"
        },
        {
            "review_text": "I gotta say, having played most(?) of the Video Game Industry Tycoon games, this one is my favourite.   +  It allow customisation of your office with a wide amount of objects to place down.  +  The Dev team have been on this game for a year and in that year added features that are to me pretty big and wanted as it gives out more options to choose in your adveture to our current year.  e.g Languages, Buying other companies, Game updates, Icons(you can add your own), Servers for MMO Games, a Mad  Games Convention(E3), Game Size, Rooms to make an aspect of your game better, Platforms, Buildings, Consoles  Development and a literally tons of Hot Fixes which makes the performence, the UI and general gameplay much faster,  easier and fairer.  I would add more but I don't know what else to add as I put most of it in the second Pro. It runs well on my AMD A4 6210, 5 GB Ram, AMD Radeon R3 Graphics Card Laptop. So far i think the dev gives out an average of 3-5 updates/hotfixes a month. It does get annoying that occasionally when the game updates, you can't load in old saves due to a new features or a change but I don't really care.  And that was my first somewhat long review. I definitely would recommend this to any tycoon lovers.",
            "review_score": "1"
        },
        {
            "review_text": "At first I didn't like this game at all. I couldn't figure out what was going on and it seemed vaguely too much like Game Dev Tycoon. But, once I gave it a chance, I loved it. It has a lot of nice features that give it a depth other similar games might have glossed over and it seems to have tried to cover all the bases. I've clearly played it a ton and that's because I keep wanting to start over with new knowledge of how the game works which, for me, is a good thing. I definitely recommend it to any game dev genre fans and hope to see a sequel in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Now that it's released, thought I'd add my review.  This is definitely my top favourite tycoon game. I've played this many a time into the early morning. The devs have actively been updating the game fairly often throughout early access and it's just gotten better and better.   It's kind of a cross between Hospital Tycoon and Game Dev Tycoon. GDT is still one of the better game dev games out there and I enjoyed that but find that MGT just has so much more to offer.   You start out in a garage in the early 80's and slowly build up your game dev business. You can move into bigger buildings, research numerous topics and techs. You can build consoles, develop game dev kits, games, do programming or game dev contracts, and/or publish games. When you have enough money, you can also start buying out other game companies. I really enjoy that there are various ways to build your business although I usually end up with creating dev kits, then moving on to a combination of production or game dev.   It's fun, addictive, high replay value, has a large number of topics and techs to research. Highly recommended if you like management games, and if you liked GDT, then this is that but so much more. Highly recommended.  Also just a big thank you to Eggcode for a great game and all the effort you put into it.",
            "review_score": "1"
        },
        {
            "review_text": "very good game would reccommend to anyone",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy the genre, you'll enjoy this game. It's just a lot of damn fun and has kept me entertained for hours and hours. The detail that you can put into game creation, not to mention the contract work, console development, and production, is very well thought out. It does a great job of allowing you to pretend you're truly a gaming tycoon.",
            "review_score": "1"
        },
        {
            "review_text": "Really good Game-Making-Game. Has a lot of options and provides much more depth than other games of this genre. Also you end up managing quite a large compay in the late-game rather than just a couple of developers.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly reccomended!",
            "review_score": "1"
        },
        {
            "review_text": "Good tycoon game, enough to spend hours to make «one more game».  You can play long or short period. A lot of stuff to discover and understand to succeed.",
            "review_score": "1"
        },
        {
            "review_text": "COOLEST GAME EVER!!!  DoubleAA Rating!  5 Stars!  Fun Award!  Edit: Ok, I apologize. Got a lttle excited there and left out details. This game is so much fun I played it for hours on end. I NEVER review games. Never. Not one. But i just had to put a quick review on this game because it was such a sigh of relief to play something so entertaining and fresh. Its not perfect by any means but if your a simulation fan or tycoon fan, you will love it!   P.s. EGGCODE please make more games like this!!!! TV Tvycoon and Film please!!! I will work for free helping develop. LOL",
            "review_score": "1"
        },
        {
            "review_text": "It's really fun, probably the best video game tycoon game available. It's just a shame that there's no mod support.",
            "review_score": "1"
        },
        {
            "review_text": "  Just the game ive been looking for",
            "review_score": "1"
        },
        {
            "review_text": "The best game dev sim I've played so far. It's a tad easy once you figure it out, but still thorough and satisfying. Well worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Early access done right and great game, if you like management games then this is for you, of all the 'game tycoon' games this is the most complete and one of the best in the genre.  The only thing this game misses? The possibility to create a platform like steam to sell digital games. For the rest you have pretty much everything: you can create your console, your mmo, your f2p, you can publish games for others if you don't want to develop anymore, you can buy other companies, print your own physical copies and decide what to put in the box, make bundles, the list can keep going for a long while but one thing is sure: it's one of the most complete business management games EVER made.  Don't mistake this game for a bland pc version of game dev story, it's not quite complex as Capitalism but it's much more closer to it than it is to game dev story.",
            "review_score": "1"
        },
        {
            "review_text": "From going to a small indie dev to being able to become the biggest game dev in the world while also making game engines and consoles. This game is amazing. Thought it was going to be laughable but turned into a time hog.",
            "review_score": "1"
        },
        {
            "review_text": "Very Great Tycoon Game. You have many ways to play this game. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply great. It has balanced depth and moderately simple approach. It is definitely better than the other software development simulation games. It has only one shortcoming that is graphics, but that can be overlooked.",
            "review_score": "1"
        },
        {
            "review_text": "I chose this game based on the many reviews that said it was the 'Best Management Game Evah'. It's not.   After 15 hours I've barely made ANY progress in this game, even following the guides and tips online.   You hire a dude, make a room, make a game (which consists of picking a genre and then adjusting sliders).   In one game I did somewhat okay, unlocked this room where I can analyze games so I can re-create their success. Got the best-seller, recreated it perfectly, got a horrible review, went bankrupt.   Things that work in one game don't work in the other as far as creating games, so you're constantly trying to find what's good to make, constantly taking money from the bank, feels like you're never truly in control. Quite annoying.   I hated this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is ugly to look at, has very limited options in both the graphical and gameplay department (I really needed an option to have larger text). It copies other, better games and overall simply feels unfinished.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game it is garbage! Get game dev tycoon instead!  I can't even get my money back!!!! F*ck this game and double f*ck eggcode",
            "review_score": "-1"
        }
    ]
}