{
    "app_id": 341390,
    "name": "Vulture for NetHack",
    "release_date": "2015-02-02",
    "developer": [
        "DarkArts Studios"
    ],
    "publisher": [
        "DarkArts Studios"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Rogue-like",
        "Procedural Generation"
    ],
    "achievements": 0,
    "positive_ratings": 102,
    "negative_ratings": 45,
    "price": 2.09,
    "description": "Vulture for NetHack is an isometric graphical interface for the roguelike engine: NetHack.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341390/header.jpg?t=1447366745",
    "minimum_requirements": "OS: Windows XP or higher Processor: Celeron, Pentium or higher Memory: 256 MB RAM Graphics: Any graphics card Storage: 135 MB available space Sound Card: Optional Additional Notes: OpenGL will be required in the future",
    "recommended_requirements": "OS: Windows XP or higher Processor: Celeron, Pentium or higher Memory: 1 GB RAM Graphics: Any graphics card Storage: 200 MB available space Sound Card: Any modern sound card Additional Notes: OpenGL will be required in the future",
    "reviews": [
        {
            "review_text": "I've played this game for nearly four years, on and off, before getting it on Steam when my harddrive died. This game is not for the casual gamer, or anyone with high blood pressure.   You will laugh, you will cry, and more than anything, you will die a lot. In all of my time playing I've only ascended one time, and only with the help of bones files (random drops from previously slain characters) and thoroughly studying nethack wiki.   I have two tips: One, start with melee heavy characters like knight, barbarian, or valkyrie. They are much easier to play, before you get used to the trickier classes like wizard and tourist.  And most important... don't get attached to your pets. Ever. It will lessen the pain.",
            "review_score": "1"
        },
        {
            "review_text": "Vulture (now Vulture for Nethack) has been my preferred NetHack front-end since I discovered the game a few years ago. Tried Falcon's Eye, which was a mess and abandoned years ago. This is a complex, deep and cleverly done game with an even nicer set of graphics upcoming which is already more than worth the asking price.  Word of warning: Don't expect to wing it and be coddled through to a win... Most players haven't EVER 'won' (accomplished The Ascension), but even getting halfway there is a huge accomplishment. This is a taste of true old school gaming. Be prepared to die - A LOT -, maybe play in exploration mode or Wizard mode and maybe even do some reading at NetHack wiki. The nice thing about NetHack is that no matter how many 'spoilers' you read, you won't spoil the game. There's always something new, something unexpected. If you master even the basics (which is itself a feat), Vulture for Nethack is endlessly replayable. Literally.",
            "review_score": "1"
        },
        {
            "review_text": "I am all for any reason to play NetHack once again so this was a pleasant surprise to see appear on Steam's new releases. I still love the old ASCII/Tilebased graphics of the original but this is a nice little isometric coat of paint thrown on for the people who absolutely cannot stand ASCII graphics I guess. Anyone unfamiliar with NetHack should realize this is one of the huge stepping stones that set the foundation for all the roguelikes we see nowadays and often at times the benchmark at what people compare most modern-day roguelikes to. The game is unforgiving, relentless and even in death you will at times find humor in it since there are so many ridiculous ways you can die. The game just like NetHack closes upon death and the final scoreboard which IS annoying as heck when you want to play it again and you have people messaging you 'having problems? it says you're loading up Vulture for NetHack like once every minute or two'. A minor inconvenience that I'm used to.  In short, if you want NetHack on Steam with the graphics presented to you in the screenshots then the price is reasonable considering the hundreds if not thousands of hours I've spent on the original game, and in those many hours I never really got very far, yet still pushed onward hoping I could see something new or die a whole new ridiculous way. If you have absolutely no clue what NetHack is but enjoy dungeon-based roguelikes then I'd say you owe it to yourself to play this or some iteration of NetHack. Just do yourself a favor first and go over the manual and study all those commands, you'll be glad you did.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game since pre-Steam era (~2009).  Wonderful GUI for NetHack, the inventory system is really good. Makes the game more addictive and charismatic. So addictive, that makes me starve from being playing for lots of hours.  The free DLC: Vulture for Slash'Em adds more challenging feeling and much more deaths.",
            "review_score": "1"
        },
        {
            "review_text": "I must say that Nethack is one of the greates games I have ever played, I am no Nethack veteran and started playing it on my phone when i first found interest in Rogue-Likes. This game is everything I have wanted in a game and I can't wait to see what the devs do with the funding they recieve. At first it upset me that the devs were charging for an open source game but once I saw what they are intedning to do with it, it made me happy. Dark Arts is keeping bringing this game as close as they can to a more broad audience who would be put off by the ASCII graphics without removing the core mechanics of the game.   I long for the day I retrieve the Amulet of Yendor and ascend and I wish you luck on your journey as well.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most frustrating TRUE roguelikes of all time. This is essentially a skin for the old Nethack, but with heavy graphical updates. Highly recommend for people who love hardcore RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Never played nethack before buying this and playing with Slash 'Em. It's like playing D&amp;D by yourself with only a really passive aggressive friend as the DM. Highly addicting though.",
            "review_score": "1"
        },
        {
            "review_text": "I started the game up as an Orc Barbarian, killed 2 foxes and went down a level, then choked on a tin of spinach and died. Choke/10",
            "review_score": "1"
        },
        {
            "review_text": "Visuals are very bad. You're better off playing the original, or you could play Wazhack which is a pretty damn good game.",
            "review_score": "-1"
        }
    ]
}