{
    "app_id": 341510,
    "name": "Crayon Chronicles",
    "release_date": "2015-03-02",
    "developer": [
        "Outer Grid Games LLC"
    ],
    "publisher": [
        "Outer Grid Games LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Casual"
    ],
    "achievements": 42,
    "positive_ratings": 36,
    "negative_ratings": 11,
    "price": 2.79,
    "description": "Crayon Chronicles is a:Single-playerTurn-basedRPGRoguelike...offering a relatively short (2-4 hours per play-through) but action-packed experience that randomly generates the level layouts each time you play.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341510/header.jpg?t=1447366768",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Pentium 1Ghz Memory: 512 MB RAM Graphics: Any graphics card that supports Shader Model 2.0 DirectX: Version 9.0 Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The art style and charming music drew me in to this game. Even simple things like navigating the menus is charming and cute. I'd recommend this for anyone who likes crayon drawings/fonts and uplifting music.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an RNG generator. It doesnt matter how high your aim is, you can be killed by a bee with 1 hp left because your saw missed 21 times in a row (yes, that happened). it is Not a hard Game, it's a luck Game. there are no mechanics to stop this. I garentee everytime you die in this game will be because a weak, Stationary enemy will Dodge you 8+ times and then hit you all 8 times (yes, Also happened). It's not a good Rouge-like. But i do love the Visuals.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't STOP Playing!!!! omfg!!",
            "review_score": "1"
        },
        {
            "review_text": "I got this on sale for something like $1 and it was worth the price. The criticisms others have leveled at it are valid, but don't take into account the type of game this is. This is a game that you play when you're on an mmo and waiting for friends to arrive. It passes time. In this function it excels. It has charm, and is a good time waster.",
            "review_score": "1"
        }
    ]
}