{
    "app_id": 341680,
    "name": "stratO",
    "release_date": "2015-06-01",
    "developer": [
        "Mark Chong"
    ],
    "publisher": [
        "Mark Chong"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Action"
    ],
    "achievements": 13,
    "positive_ratings": 52,
    "negative_ratings": 8,
    "price": 3.99,
    "description": "Glide, swoop, tuck, dive, magnetize, grind, walldrive, and burn your way through rings to advance the difficulty of the vast, procedurally-generated environment while avoiding the fog and getting stranded! This game demands a great deal of skill and is not suited for casual players or people susceptible to motion sickness.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341680/header.jpg?t=1452543516",
    "minimum_requirements": "OS: Windows 7 (32-bit) Processor: Intel(R) Core(TM) i3-2330M CPU @ 2.20Ghz (Dual Core) Memory: 4 GB RAM Graphics: NVIDIA Geforce 860m DirectX: Version 9.0c Storage: 100 MB available space Sound Card: Realtek High Definition Audio",
    "recommended_requirements": "OS: Windows 7 or above (32/64) Processor: Intel(R) Core(TM) i7 CPU @3.2Ghz (Quad Core) Memory: 8 GB RAM Graphics: NVIDIA Geforce 660 Ti DirectX: Version 9.0c Storage: 100 MB available space Sound Card: Realtek High Definition Audio",
    "reviews": [
        {
            "review_text": "My stratO experience is one of the more unique experiences with a steam game.  I started out confused and frustrated. I went to the forums and complained about the lack of tutorial and how confusing the controls were.  One of the forum moderators added me almost instantly, walked me through some of the basics, watched a broadcast of me playing, and then had me watch a broadcast of him playing. After that, I kind of knew what was goin on, but still felt lost.  Then the developer himself got on the forums and posted a 22 minute comprehensive tutorial. I watched the whole thing and after my next flight I got my first achievement.  1.3 hours of gameplay later, after all of that, I still feel like a complete n00b, and am still very lost as to what I'm doing when playing, but I'm starting to figure it out little by little.  And, with each little bit I figure out, I'm more and more impressed by how groundbreaking this game is.  I am going to recommend this game, but with the warning that if you're not ready to go through a serious amount of learning just to figure out the basics, this might not be worth your time.  However, if you're craving something new and insanely challenging, buy this now.  Also, I'd like to point out that the dev and moderator who helped me are two of the nicest and most patient people I've come across on Steam, and should get a medal just for dealing with crazy people like me :)",
            "review_score": "1"
        },
        {
            "review_text": "Do you like to fly? Do you like to spin? Do you like to grin? Well then stratO is definetly not the game for you! because you will be flying spinning but definetly not grinning --------------------------------------------------------------- A hard to master flying game designed and created by one man with a passion (Mark Chong &lt;3) truely putting your skill to the limit in an intense race  against....time?  NO THERE IS NO TIME! just enjoy the time you are spending floating from tower to tower feeling free!  BECAUSE IN REALITY YOU ARE NOT........FREEEEEE!  Graphics 3/5 (Do they really matter?) Story 0/5 ( non existent but it doesn't change the quality of the game in any way) Gameplay 5/5 (Joyful and fun but hard to master.)  ",
            "review_score": "1"
        },
        {
            "review_text": "Very simple yet addicting gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Someday I'll learn how to control the paper airplane and beat you in this game, Mark Chong &gt;:D",
            "review_score": "1"
        },
        {
            "review_text": "The Buttons in the main menu doesn\\'t respond. The 4 hours gameplay is the idle time",
            "review_score": "-1"
        },
        {
            "review_text": "It looks so easy, but it's way to hard...",
            "review_score": "1"
        }
    ]
}