{
    "app_id": 341820,
    "name": "Plush",
    "release_date": "2015-02-13",
    "developer": [
        "Red Head Games"
    ],
    "publisher": [
        "Red Head Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Casual"
    ],
    "achievements": 11,
    "positive_ratings": 63,
    "negative_ratings": 9,
    "price": 2.79,
    "description": "Plush combines stuffed animal simulation with the imagination of a little girl to provide a unique puzzle experience. To successfully complete each level, the player must arrange the stuffed animals in such a way as to make them all &quot;happy&quot; before bedtime.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341820/header.jpg?t=1447366825",
    "minimum_requirements": "OS: Win XP Processor: Intel Core Memory: 1 GB RAM DirectX: Version 9.0 Storage: 150 MB available space",
    "recommended_requirements": "Processor: Dual Core Memory: 2 GB RAM Graphics: Dedicated",
    "reviews": [
        {
            "review_text": "Cute rag-doll physics puzzle game.  I expect somebody thought 'my kids don't play with dolls' and instead made a game based on 'rag animal physics'. You have 40 puzzles where teddy bears need to snuggle up to each other, cats jump away if you move something next to them (and hippos make everyone jump away), 'Mr Stinkypants' who needs to be kept away from everyone else, unmovable pillow obstacles that you're not allowed to cross, and in two of the three difficulty levels, the floor is lava. It took me ~4 hours to do and re-do each of the 40 puzzles on each difficulty level to get the achievements.  These 40 puzzles would actually be suitable for small children, but the rag doll physics are not. It is never clear where you're grabbing the animal that you're moving, it seems to be attached to the pointer by a weak spring that elongates itself, which means accurate placement is nearly impossible, and sometimes you can grab animals mid-air and sometimes you can't. This lack of precision means that most of the time I've been fighting the physics instead of solving the puzzle. (And why don't I get the achievement for completing all levels on normal when I completed them on hard?) Sure, the children's voices are a nice touch, but I don't really know to whom I could recommend this game. Well, here goes:  If you like to fiddle with ragdoll physics, and if you like stuffed animals and childrens' voices, this is the game you've been waiting for. If you don't, it's probably not.",
            "review_score": "-1"
        },
        {
            "review_text": "Very cute game. It's a fun puzzle and is very easy to learn. My biggest gripe is the little kid that makes comments continuously as I am going through levels. It's just incredibly annoying. I understand it's based around placing stuffed animals on a child's bed, but said child does not need to say 'why are ponies so silly?' and 'it's Mr. Biggenbottom!' 75000 times when I'm trying to focus on arrangement. I can only play the game in very short intervals because I find the kid so annoying. Maybe there's a way to turn it off but I haven't found it yet. Overall, great game. It's very fun and relaxing while still posing some challenges. Difficulty is adjustible.",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing 'puzzle' game, ideal if you've got a few minutes to spare before bedtime. And who doesn't love teddybears anyway?",
            "review_score": "1"
        },
        {
            "review_text": "Low price and cute graphics Moreover, love how they designed the game  Definitely recommended for spare time ",
            "review_score": "1"
        }
    ]
}