{
    "app_id": 341940,
    "name": "Hatred",
    "release_date": "2015-06-01",
    "developer": [
        "Destructive Creations"
    ],
    "publisher": [
        "Destructive Creations"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Gore",
        "Violent",
        "Action"
    ],
    "achievements": 74,
    "positive_ratings": 5473,
    "negative_ratings": 1560,
    "price": 4.79,
    "description": "Hatred is a violent twin-stick shooter, in which you take the role of The Antagonist fighting against all of humanity.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341940/header.jpg?t=1547119726",
    "minimum_requirements": "OS: Microsoft Windows Vista (SP2) with DirectX 11 update (KB971512-x64), Windows® 7 (Service Pack 1) , Windows 8.1 and Windows 10 - (64-bit only). Processor: 2.6 GHz Intel® Core™ i5-750 or 3.2 GHz AMD Phenom™ II X4 955 Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 460 or AMD Radeon HD5850 (1 GB VRAM) DirectX: Version 11 Storage: 5 GB available space Sound Card: Integrated or dedicated DirectX 11 compatible soundcard Additional Notes: Hatred will launch only on &quot;64-bit&quot; version of operating system.",
    "recommended_requirements": "OS: Windows® 7 (Service Pack 1) / Windows® 8 / Windows® 8.1 / Windows® 10 / (64-bit only) Processor: AMD Octa-Core / Intel Quad-Core processor running at 3.4 GHz (AMD FX X8 8350 or Intel Core i5 3570 or newer architectures are recommended) Memory: 8 GB RAM Graphics: AMD/NVIDIA dedicated with at least 2048MB of dedicated VRAM and with at least DirectX 11 and Shader Model 5.0 support. AMD Radeon R9 285 and NVIDIA GeForce GTX 670 and above are recommended graphic cards. DirectX: Version 11 Storage: 5 GB available space Sound Card: Integrated or dedicated DirectX 11 compatible soundcard Additional Notes: Hatred will launch only on &quot;64-bit&quot; version of operating system.",
    "reviews": [
        {
            "review_text": "It's basically like The Sims. Walking around in the neighbourhood and interacting with other people,  visiting their homes, getting groceries, satisfying your needs ect.   ",
            "review_score": "1"
        },
        {
            "review_text": "Average twin-stick shooter with an I-can't-see-what's-shooting-at-me art style.  Cannot recommend, it's just a bit boring and very repetitive with an edgy 'look how violent and mature I am' trailer.  Honestly regret buying, I was hoping for a good stress buster.",
            "review_score": "-1"
        },
        {
            "review_text": "- Grabbed an AK-47 with 500 rounds - Walked outside and opened fire - Blew up a super market, as well as many other houses - Killed hundreds of people - Came home and played Hatred  10/10 it's really good",
            "review_score": "1"
        },
        {
            "review_text": "My name is not important, what is important is what I am going to cook. I just ♥♥♥♥ing hate fast food, and the obese humans feasting on its calories. My life is just cold, bitter leftovers, and I've always wanted to try ravioli. This the time of dinner, and no sauce is too spicy, And I will put in the pot as many veggies as I can. It is time for me to grill, and it is also, time for me to fry. My cooking buffet begins, here.",
            "review_score": "1"
        },
        {
            "review_text": "Securing my place at the top of the NSA watchlist has never been this fun, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Wiped out 80% of the people who live near me.  Police radio - 'Possible homicide'  Possible..K  8/8",
            "review_score": "1"
        },
        {
            "review_text": " Pretty Mediocre Top Down Shooter   You play as Not Important, a man on a mission to kill everyone for no known reason. I'm not going to hold 'story' against this game because it's pretty clear it's not a story driven game. I will however point out that it's impossible to take this game seriously, and it feels like that's what they were going for. The fact that this is rated AO is an embarrassment to the ESRB. You're supposed to rate games on content, not the amount of political heat they draw.  The graphics are alright, but the game needs to find a better balance between 'grungy' and 'visible'. You'll have a lot of trouble on some levels even navigating around the level at all. The game does have an art style, if 'trying too hard: grunge edition' is an art style. Still, it  does  succeed somewhat at capturing the feel the game is going for. Occasionally walls won't render. That's the biggest graphical glitch I've come across so far.  The sound is alright. Decent quality. Not Important sounds like an emo grungy Xavier Renegade Angel. 3d sound glitches are plentiful, leading to the occasional random ear-bursting gunshot. You have a repertoire of about... 10 one liners from executions and that's it. Overall the sound is...  okay.   The gameplay is also okay. It's a standard top-down shooter. Healing mechanics can get frustrating, especially when you're facing down a wave of 60 cops and you need health. You have to execute to gain health which requires being right next to someone, so these stand-offs usually end up in you either dying if you come closer for health, or dying because you can't heal. Damned if you do, damned if you don't. Add onto that that there is no guaranteed execution and it can get really frustrating really fast, with you hoping that the game's Random Death Generator will be merciful enough to  not  insta-kill the guy you just punted with F, a maneuver the game's loading screens lead you to believe is a reliable method of lining up an execution.  Not Important really should have spent some time at the shooting range before going on his shooting rampage, because he can't aim for ♥♥♥♥. You'll spend a lot of time frustrated at how much you  don't  hit ♥♥♥♥ you're aiming at. The aiming system either rarely compensates for height difference, or doesn't at all. I never caught it doing so for the two hours I played. Granted, the level designs usually render this mostly a non-issue, but for the rare case it's another point of extreme frustration. Not Important really should have also hit the gym, because he can't throw for ♥♥♥♥ either. Grenades almost always make it about 60% of the way to your crosshair. Where they go when you throw them is also almost impossible to predict. I gave up on my strategy of throwing them through doorways to soften the resistance before I entered a room the third time in a row Not Important threw the grenade right into the doorframe and blew himself up.  Respawn tokens are a pain in the ♥♥♥. You don't recover the respawn tokens you had at the start of a level upon restarting the level. This basically ensures that the level will only get  harder  if you lose at it. Another ingredient for our recipe of annoying, frustrating time. Cop and SWAT cars are OP as all ♥♥♥♥. They will swoop in and run you over before you have any time to react, and every time a car hits you, it's a one hit kill. They will not wait for you to finish an execution either, I executed someone to find myself already run over by a SWAT car by the time the execution scene was done happening.   Overall, Hatred isn't really a  bad  game, but it's not a  good  game either. It's also not a game I'd actually recommend for $20.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is missing something.... Hard to say what it is..... Oh, it's fun. That's what the game is missing, fun. I am sure there are some negative reviews because of the content of the game. You are just killing innocent people, gaining health by executing defenselss civilians lying in agony on the groud. That is certainly offensive to people but it's not why this game gets a negative review. The problem with this game is not it's shocking content, it's with it's shocking lack of fun. Simply put, the game is just boring. There is no story other than you hate everyone and want them to die so there is nothing to hold your attention there. The controls are clumsy. The gameplay is repetative. Other than simple shock value there is nothing unique or compelling here. Pass on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "You play as 'Nathan Explosion' Angered with New York's Dethklok sales he visits his fellow NY suburbs to give em a good piece of his mind.",
            "review_score": "1"
        },
        {
            "review_text": "Shallow, boring, and unoptimized video game that get over attention by money mongering media grabbing attention of the mother in 40s worried about their son becoming the next Eric and Dylan.",
            "review_score": "-1"
        },
        {
            "review_text": "This is what Overwatch's Reaper does on his days off.  10/10 Weekend Simulator",
            "review_score": "1"
        },
        {
            "review_text": "Because stress balls are never enough.",
            "review_score": "1"
        },
        {
            "review_text": "He was alone against the world An outcast ever since birth On and on, night and day They told him how to behave You must fit into society Oh, he tried but could not agree Be like us, follow trends No, he'd fight 'till the end  He was alone against the world Every day - a slave at work Be a man, don't make a sound! That's how they tried to tear him down So he was one of a kind They could not control his mind And he knew the day would come To take revenge on everyone  Unleashed",
            "review_score": "1"
        },
        {
            "review_text": "I do enjoy  killing people  playing this game!",
            "review_score": "1"
        },
        {
            "review_text": "An interesting concept unfortunately marred by an uninteresting protagonist and repetetive gameplay. Definitely the better game between itself and the original POSTAL due not only to it's improved visuals but also for the destructable environments and satisfyingly fluid 'execution' animations. The shock value of it's content becomes less biting the longer you are exposed to it. All-in-all a competent twin-stick shooter that you should pick up when it's inevitably discounted to $5 in the future. [6/10]  For extra fun, download 'Tommy Wiseau's THE ROOM' voice mod to make the protagonist 10X more dynamic. [YOU'RE TEARING ME APART, LISA!/10] ",
            "review_score": "1"
        },
        {
            "review_text": "Eric and Dylan Simulator",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty fun game. But controls can be a bit annoying (getting stuck on debris and such.) The voice-over between levels are absolutely cringeworthy and the game is really short. Controversy overblown, but not worth full price. Wait for sale and you might have a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Why can't I do this in real life? Not great, but not a bad game. Worth the cash if it looks like your thing, if not then wait for a sale or a mod scene to crop up and add value. Beatiful scenery; many action movie-like scenes will occur spontaneously. Cheesy one-liners and hilarious ending are a laugh if you can go along with it. For metalheads and B-horror fans.",
            "review_score": "1"
        },
        {
            "review_text": "Hatred is a top down twin stick shooter from the Polish indie developer Destructive Creations. As it was to be expected this game was heavily inspired by the original Postal.    Pros:",
            "review_score": "1"
        },
        {
            "review_text": "I have killed virtual people in more horrendous ways in a hundred other games with much more emotional impact that played a lot ♥♥♥♥in' better, but Hatred still made me giggle.  Update: Using a mouse and keyboard makes the killin' very sweet indeed. Let your controllers collect dust for this one.",
            "review_score": "1"
        },
        {
            "review_text": "In this semi-violent twin-stick shooter, you play the role of Noah 'Tim' Portant. After having his waifu insulted one too many times online, Tim decides to embark on a crusade to remove all normies. You'll kill lots of normies throughout the game, and more than a few law enforcement officers as well. All the while, Tim spouts off one-liners and dank memes. It's quite therapeutic.   A pretty fun game all-in-all, though a bit short and has a few performance issues at times. Looking forward to seeing what the modding community can do with it. As a side note, Tim appears to be partially colorblind. Kudos to the devs for adding some diversity to video games.  ",
            "review_score": "1"
        },
        {
            "review_text": "Psyhopath simulator 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to release your inner beast! Freeplay mode is the best, story mode is brutal.",
            "review_score": "1"
        },
        {
            "review_text": "Competent but rather short (5 hrs on easy) top-down shooter homicide game. There are plenty of semi-original and interesting mechanics, cool art style and some destruction. But also there is a lot of room for improvement. For example destructions are mainly decorative and floors, fences and trees are indestructible. Also there is no 'funneling' so antagonist always stuck in something.  Game not working properly in UWS and MM as of now, but can easily be windowed. (As of 04.06.2015)",
            "review_score": "1"
        },
        {
            "review_text": "wish to see more convenient mission marks on mini map  aim with right click mouse need more polish it is not convenient at all.  some fps drops while gpu in only 60% load. ( gtx 1080 + i7 4790k + 32gb 1600mhz ram + 1tb 850 evo ssd)  more saving points pls",
            "review_score": "1"
        },
        {
            "review_text": "If Hatred was more fully devoted to being either a comedy or a drama, its narrative may have been more successful. As it is, the most fun to be had in the game comes almost entirely from the moments when the player breaks away from the mission structure and massacre everyone around without worrying about the context of its plot.  The game only has 7 parts but all of them offer great replay value.  The highlight of this game is mostly due to itself being very realistic. What I meant by realistic is that the AI in-game actually act like how real people do in the real world. The female AI of this game often tends to run away instead of fighting back even though they are brave feminists. The protecting forces of the game which consist of police offers, the SWAT team and also the army are all male, and never a single female, leaving all the men to die on their own. Just like in real life! Has it ever occurred to anyone that the engineer at the ending was a male instead of a female? Shocking truth!  What the game lacks is diversity. Every single one of the civilians that you can kill in game are mostly normal citizens with no special traits aside from the difference in their skin color. To make the game as realistic as possible, the developers should have added AI like feminists or Social Justice Warriors like what Postal did. Besides that, there should also be gays and lesbians making out on the street. This should have already been implemented with no question ask since hipsters and drug junkies have existed in game.   The achievements created in this game are quite interesting as they contain references to other games such as Grand Theft Auto, Postal and the Witcher series. As you can see on my profile’s achievement page, I have gotten nearly every single Hatred’s achievement, they are really easy to accomplish and are able to be unlocked from time to time as you progress in game. The only achievement which I am having trouble unlocking is the one called “Feminist”. The objective to unlocking it is to kill 2000 men if I recall correctly. But sadly, I only shoot women. Due to this tough obstacle, I am unable to 100% the game. So I do hope they do something about it in the future as this achievement would also mark me as a feminist which I am not.   The game itself is not flawless but it clearly shows a promising future for a genre more like it to be produced and also be able to offer a lot of fun. Without a doubt this is the best open world shooting game in recent years. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "So, Hatred. I stumbled upon this game having never heard of it before. The title is what reeled me, and the fact that it was at the top of Steam. I checked it out quickly. I love a game that flips common tropes on their head and is not afraid to push the envelope to the point of breaking. The fact that this is basically a mass-murder simulator when (in the US at least) there are mass shootings every day really gave this game a lot of 'edge' for lack of a better term, which is what I like in games, whether that edge be due to controversy, difficulty, or in depth storylines. However, it is rare to find raw unadulterated controversial gore nowadays. I decided, despite the negative reviews to buy this game at its current price and play it.   Pay no mind to the negative reviews, this game is amazing. The black-and-white artstyle is amazing, the voice acting is amazing, the weapons, environments, enemies, civilians, executions, all contribute to a fun violence simulator. It is simple, easy to play, enjoyable in its brutality whilst still being challenging to the point of me damn near throwing a tantrum over losing a level 5 TIMES! The best part is, the developers and the game make no bones about what this game is: a mass-murder simulator, designed to simply and brutally explore in an arcade-like manner, the activities of a violent misanthrope bent on killing anyone in his path. Its simple, brutal, and violent, which is something that seems rare in today's gaming environment.  For god's sake even the credits are a heavy-metal music video of gore and death, showing the main character brutally killing both police and civilians alike.   It makes a good stress reliever, a good arcade shooter, and just a good game overall with great style and flow in the gameplay. 10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Not bad yet not good either not worth buying for this price maybe if it was 5 euro.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not worth buying at the moment. The tech issues make the game near unplayable, so you're better off waiting a couple weeks for developer/community patches.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid mechanics, amazing use of physics, interesting style, a bit short but worth the £15 especially with Workshop coming soon. Suffers from poor optimization.  8/10  Performance patch was released and added more graphics options.  Runs fine now but chugs a little when in crowded areas.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for the whole family!",
            "review_score": "1"
        },
        {
            "review_text": "A fun top-down blow em to bits game about murdering everyone. While it might have some optimization issues, the game is packed with a good chunk of content, a survival mode, and offers a decent challenge. The writing is pretty edgy, but has enough cheese to it and comes across that it wasn't meant to be taken seriously (As if that wasn't obvious enough already).  A good game if you wanna blow off some steam or want something not too hard to play.",
            "review_score": "1"
        },
        {
            "review_text": "this game is great, I loved it although it does get stale at some times like the respawning system is a bit annoying I had fun, a few ideas   - Multiplayer? join friends games and kill people together. survival type mode as well would be great - Hospital level - Movie theater level -Airport Level -Mall Level -Highschool/College (just to ♥♥♥♥ more people off) -More Melee Weapons?  -More weapons in General  -More Explosive weapons (exapmle: C4 to set and blow anytime you please) -More Executions -The destructive system is great, would be cool to add where if you destoy all walls on a building it collapses or if you burn a building enough it will collapse -MORE GORE Thats all i could think of what do you guys think?    ",
            "review_score": "1"
        },
        {
            "review_text": "Bretty Gud 6.66/9 -AI needs improvement +Sound Effects are satisfying -Optimization is poor +Good to take your anger out on -HUGE difficulty spike on the Downtown Level +Destruction Physics are fantastic -Hard to see where you're aiming exactly, (maybe if the crosshair was bigger)? +Very satirical (Subtle) -Pretty short.(But killing sprees usually are)  To be honest the way the media portrayed it made it seem much worse than it is.",
            "review_score": "1"
        },
        {
            "review_text": "Vary impressive game. Basic plot, Great graphics, Brutal kill animation, outright fun!!!   My new Guilty pleasure...    ….._\\____________________,,__  …./ `–│││││││││———————-]  …/==o ____________________  …..),—.(_(__) /  ….// (\\) ),——  …//___//  ../`—-’ / …  ./____ / … .  ",
            "review_score": "1"
        },
        {
            "review_text": "Pure fun! I reallyyyy like it! Art style and gameplay is great!",
            "review_score": "1"
        },
        {
            "review_text": "Graphics : 7/10 it's rather dark ((there is a mod to make it more colourfull :D )) Gameplay : 10/10 Really fun, Story 5/10 not really that 'intresting' i reccomend playing through it and grinding survival mode,",
            "review_score": "1"
        },
        {
            "review_text": "brilliant game (for the price). best Nathan Explosion simulator 2016 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is nothing like expected, runs very slow and is very repetitive.",
            "review_score": "-1"
        },
        {
            "review_text": "Ultra violent. Ultra tasteless. Ultra sick...   But most entertaining really.  It's like Postal, only much darker, in a SIN CITY styled way. The color red is almost the only color you see in this game. You play as a lone gunman(who wants to die) slaughtering hundreds of innocent civilians... that's the plot. What more does one need right?  If you like repetitive gameplay. Shooting and blowing stuff up, then you should definitely buy this game. Especially if you like to drive police cars through peoples living rooms, and then step out of the car to execute any survivors living there... that would be another reason to buy Hatred.   However I must point out that Hatred is a very detailed game, when it comes to death and mutilated bodies.  So there will be lots of blood and lots of dead bodies.   It is quite disturbing really... But not enough to stop me from playing the game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Playing 'Downtown' level on Insane difficulty = Having a hysteria attack simulation [-_-]",
            "review_score": "1"
        },
        {
            "review_text": "Well. This game is really misunderstood. Its metaphors and stuff. Subtle. Very subtle. It LOOKS like you are playing a complete psychopath that has finally gone berserk and started killing everyone and everything. But its the BURIED TRUTH behind his gaze that I find most compelling. What happened? WHY? I listen to his dialog for clues, and slowly, a deep tale of misguided masculinity and once good intentions gone astray begins to emerge, as the protagonist struggles with a world gone mad. The gameplay is solid, as you run around, guiding his wounded soul on a journey of healing and catharsis. Sometimes the terrain is difficult to navigate, symbolic of today's confusing world. Its a steal for a mere $20. In short, its an amazing action game filled with gun play, explosions, and fully destructible environments, but on another level, it is a deep emotional tale of old fashioned masculinity searching for a place and self expression in a modern world of over indulgence and leisure.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it",
            "review_score": "1"
        },
        {
            "review_text": "It's fun for what it is: a twin stick shooter about going on a cathartic rampage. It runs like ♥♥♥♥ but if you can forgive it's technical problems and simplistic game play, it's pretty enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it",
            "review_score": "1"
        },
        {
            "review_text": "TIP GO INTO CROUCHING MODE AND BECOME ALMOST IMPOSSIBLE TO HIT WHILE BEING SURROUNDED BY ARMY PERSONEL IN THE ♥♥♥♥ING OPEN, AND LAUGH AT THEM FOR BEING SO BAD BY GUNNING THEM DOWN.  beaten Hatred twice, first play through took me 6 hours, due to me getting over run by law enforcements on the city level and dying after getting the last objective completed which frustrated me to no end. but once i realized that crouching was just so broken and utterly laughable, the game is ♥♥♥♥♥♥♥♥ly easy even on EXTREME mode. you can at most get 3 hours worth of gameplay if you know what your doing the whole way through. and it's pretty much just run and gun. run and gun. grab these things. get this vehicle. yeah.. nothing really new or exciting here. just your typical dual stick shooter that's decent at best. But destructable buildings are a pretty cool feature i'll give them that much. every now and then i'd make my own entrances and exits through buildings by using grenades.  But I got most of the achievements and played through the game MOSTLY because of the controversy this game has gotten ever sense it was announced. and I'll be one of the many who have played this and say that it isn't any different then ANY OTHER GAME OUT THERE IN EXISTANCE! Let me go on Grand Theft Auto 5 here and do exactly the same thing here by Shooting every single person i see. and every single law enforcement i see. Hatred is a game that got most of it's sales because of it's trailer and the reactions from the most sensitive people on the planet mostly due to it's mentality. Thus giving reviewers, or any other person that had curiosity the incentive to go out of there way to buy this game. and i was one of those many people.  DO i regret buying this game? A little. but it's not as bad as people make it out to be. it's much better with an Xbox controller hands down. the small amount of guns i could say is acceptable as it gives out every basic form of gun out there except for sniper rifles or just regular rifles which is fine for a dual Stick shooter. however i don't think it's worth 20 dollars. i think at most around 10$ wait for a sale on this game first if you really want to try out a below average dual stick shooter such as this. but there are far superior ones out there then this.",
            "review_score": "-1"
        },
        {
            "review_text": "The best social simulator after The Sims, now you can do in virtual life all you want to your family, friends and neighbours.  And repeat.",
            "review_score": "1"
        },
        {
            "review_text": "Eric Harris and Dylan Klebold would be proud of this game.  'I just f.ucking hate this world.' The Crusader  _______████████__██████ _________█░░░░░░░░██_██░░░░░░█ ________█░░░░░░░░░░░█░░░░░░░░░█ _______█░░░░░░░███░░░█░░░░░░░░░█ _______█░░░░███░░░███░█░░░████░█ ______█░░░██░░░░░░░░███░██░░░░██ _____█░░░░░░░░░░░░░░░░░█░░░░░░░░███ ____█░░░░░░░░░░░░░██████░░░░░████░░█ ____█░░░░░░░░░█████░░░████░░██░░██░░█ ___██░░░░░░░███░░░░░░░░░░█░░░░░░░░███ __█░░░░░░░░░░░░░░█████████░░█████████ █░░░░░░░░░░█████_████████_█████_█ █░░░░░░░░░░█___█_████___███_█_█ █░░░░░░░░░░░░█_████_████__██_██████ ░░░░░░░░░░░░░█████████░░░████████░░░█ ░░░░░░░░░░░░░░░░█░░░░░█░░░░░░░░░░░░█ ░░░░░░░░░░░░░░░░░░░░██░░░░█░░░░░░██ ░░░░░░░░░░░░░░░░░░██░░░░░░░███████ ░░░░░░░░░░░░░░░░██░░░░░░░░░░█░░░░░█ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█ ░░░░░░░░░░░█████████░░░░░░░░░░░░░░██ ░░░░░░░░░░█▒▒▒▒▒▒▒▒███████████████▒▒█ ░░░░░░░░░█▒▒███████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ ░░░░░░░░░█▒▒▒▒▒▒▒▒▒█████████████████ ░░░░░░░░░░████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█ ░░░░░░░░░░░░░░░░░░██████████████████ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█ ██░░░░░░░░░░░░░░░░░░░░░░░░░░░██ ▓██░░░░░░░░░░░░░░░░░░░░░░░░██ ▓▓▓███░░░░░░░░░░░░░░░░░░░░█ ▓▓▓▓▓▓███░░░░░░░░░░░░░░░██ ▓▓▓▓▓▓▓▓▓███████████████▓▓█ ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██ ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█ ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█",
            "review_score": "1"
        },
        {
            "review_text": "You play as an edgelord/ cringelord who hates the world and sets out on a mission to kill everyone. It looks The Sims with the police from Grand Theft Auto.   Pros: * You can kill everybody, if that's what you're into  Cons: * Long load times * Isometric camera angle doesn't feel right  * Enemies can shoot you from offscreen * The difference between 'Easy' and 'Hard' isn't distinguishable * Vehicles control like ♥♥♥♥ * Very little variety - killing people actually gets boring * You can vault over some objects but not others * You throw grenades at your feet * Not much strategy - no blending in or hiding  * You can barely see ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Hatred only has controversy going for it. The black and white graphics are ugly and makes seeing targets a nightmare. The game runs poorly. Aiming is awkward (but not for the cops who shoot at you!). You can't revel in destruction, because ammo is limited and there's even a loading screen tip telling you the save your rifle ammo for cops. That might have been okay if you had a machete or something, but no, you end up having to JUMPKICK victims which is as ridiculous as it sounds.  Despite being a game about a spree killer, it feels like the devs actually  avoided  controversial elements as much as possible - there are no kids (even the old 2D Fallout games let you kill kids!), no religious elements (i.e. asking victims if they believe in God), no political agenda, no targeting of specific groups, no torture, no nothing.  One of my most memorable gaming experiences was a level of Cannon Fodder where you had to blow up several bases that kept spawning enemies. The only way to blow them up was with a cannon in the middle of the level, but if you tried to use the cannon, the enemy's bazooka guys would blow you up. So first you had to go around the whole level and kill every bazooka guy. After all that trouble, it was very satisfying to hop into the cannon and easily blast every base. THAT is how a game about a spree killer should work - killing helpless victims isn't challenging, so it isn't fun by itself, so it needs to be the REWARD after you've accomplished the game's real challenges. I mean, how great would it have been to play as the Hatred guy BEFORE the rampage? Imagine you're buying nails and fertilizer at the hardware store, and the cashier makes some crack about how happy is that you're finally going to fix up your busted eyesore of a house, and he 'can't wait to see the final product!' I mean, how much more satisfying would it be to blow up his store with a pipebomb then? SO much more!",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been a good game. Getting shot down by NPCs you can not see off the edge of the screen ruined this game. you sepend alot of time shooting blind off the endge of the screen to try and hit an NPC that is lighting you up.",
            "review_score": "-1"
        },
        {
            "review_text": "Controversy aside, this is just a terribad game. Enemies can and will shoot you from offscreen, and you while you can hurdle fences and other obstacles, you will also get stuck on random small items. A dual stick shooter that is basically unplayable on a dual stick controller. Couldn't even make it through shooting targets in the guy's basement in the first level because a slight touch on the stick sends your crosshair zooming around. Switching to mouse and keyboard made it tolerable, but keyboard mapping is not very intuitive, and had to keep going back to options in the beginning to check keymapping. Vehicle controls are crap even with mouse and keyboard. Got bored with this by the time I got to the actual city mission, with civilian vehicles zooming in from off screen at totally random intervals and killing your character instantly. Crap AI, Crap controls, Crap gameplay, Crap replayability, Crap story. 5/5 on the Crap-o-meter.",
            "review_score": "-1"
        },
        {
            "review_text": "Hatred is a top-down twin stick shooter where your goal is to kill everybody that moves. The game takes place over 7 distinct areas where you can free-roam (for the most part) and do objectives as you wish. The game does have requirements to move on to the next stage, mainly 'Kill X amount of people' or 'Get out of X'. There are several side objectives that mostly involve killing the majority of people in a given area. Completing these side objectives gives you respawn tokens to use if you die. If you die and you're out of respawns, you have to restart the level.  You yourself play as an edgy misanthrope who has long hair, wears a black trench coat, and spouts one-liners. You are controlled with WASD by default, and there is a sprint mechanic that you can use to vault over small walls, a crouch mechanic that makes you harder to hit and increases your aim, an aiming mechanic that allows you to precisely aim as well as aim higher or lower to compensate for the top-down nature, and this spidey-sense type mechanic that highlights living enemies on your screen as well as equipment pickups. You can carry up to three weapons at a time, from about 10 weapons There is a health system, where you can only regenerate a bit of health by executing 'not-quite-dead' enemies. It sounds all horrible, but trust me, you get used to the same 'stomp the guys head in' or 'shoot the guy in the head' animation after a hundred times. The player character does sometimes get caught on hard-to-see level geometry or a tiny chip of a wall still standing which can be pretty irksome if you're trying to get away from a firefight.  You aren't just shooting innocent civilians, you'll be fighting police, weapons dealers, vigilantes, hunters, SWAT, and the army. Even unarmed civilians will sometimes pick up a gun and start unloading on you. They aren't pushovers, either. On higher difficulties, SWAT can take three shots with a shotgun and still be standing, and you'll often be forced to retreat and find some civvies to execute. The AI has a lot of room for improvement, but I let it slide because it's not really something you ask for in an indie game. An annoying features is that enemies can shoot you from beyond your maximum view range, forcing you to rely on your (inconsistent) minimap to find your shooter.  The gunplay is solid and even the 9mm pistol manages to actually do something rather just being the equivalent of spitballs against tougher enemies. The physics engine is great and it's a lot of fun to play around with, though it can be pretty CPU-intensive. Speaking of graphics, I'm a fan of the style, where everything is grayscale except red, blue, and explosions. It can give me a headache playing too long, though.  It's a pretty short game, I beat it on hard in 3 hours, but like I said, they're free-roam areas and I was mostly just rushing objectives. Unless you want to screw around with the levels you liked later or get achievements, it's not a game that you'll replay a lot. There is workshop support and multiplayer/coop planned down the road, which would add a breath of fresh air to the game.  Finally, the moral panic. The game is not a fourth as bad as the trailers made it out to be. It's actually pretty tame. Like I said, you get jaded to the executions, and there's not really a lot of over-the-top gore except for bloodstains, blood pools, and some limb removal. I honestly don't see how this got an AO rating, it's M at best. For the tone, it gets pretty clear the game is parodying itself. The over-the-top one-liners by the player character (who is called the Antagonist by the developers) includes a line from the POSTAL DUDE. An important code for something later in the game is 666, for god's sake. Don't be offended.  Overall, I'd give it a 6.5/10, above average. Make sure you buy the game if you like it, not just to stick it to the people who don't like it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Damn Fun For a few minutes at a time, when ever u want to just sit back with a dualk stick shooter with really no sotry loan and no dificulty this is the game for you, say what u want about voilence and what not this game was stigmatised as theirs games way more voilent and graphic than this game.",
            "review_score": "1"
        },
        {
            "review_text": "imagine you are a guy.... now put a gun in your hands and go kill people... 10/10.. the best part of this game is the guys hair",
            "review_score": "1"
        },
        {
            "review_text": "Other than some problems with the optimization, if you like mindless destruction and fun I would say this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Good stress relief  Loved the game, would buy from again.  Note to the developers: Get working on those badges guys i seriously need to smear a Hatred foil badge all over some people's faces.",
            "review_score": "1"
        },
        {
            "review_text": "I came here to buy a game that was about killing, got what I asked for. Now honestly this game has fantastic shooting and moving controls like they are really fluid(car controls are pretty bad you guys need to get on that). The story is 1) guy hates the world, 2)guy wants to kill world, thats it whole plot, simple easy not hard to get. needs to be polished more, thats really it. great game, keep up the good work",
            "review_score": "1"
        },
        {
            "review_text": "good game , perfect to take anger out and relax",
            "review_score": "1"
        },
        {
            "review_text": "Well... this one is _just_ sick and twisted game. But still clicking it. :)",
            "review_score": "1"
        },
        {
            "review_text": "The game that Simpsons and the like parodied in the nineties after Mortal Kombat and such came out.  This is the game that all the hysterical parents didn't want their kids to play: a murder simulator, full of blood, gore, and mindless ultra violence, made with the intent of corrupting the young. Except it's not.  It's a goofy, over the top look into the minds of angst ridden kids who write misanthropic poems in their bedrooms, walls plastered with posters of extreme metal bands and drawings of satanic symbols, while hate filled music made by grown men wearing clothes either from a military surplus store or the hot topic.  It's a dumb game, but it's also a very fun game (when it isn't keyboard and mouse throwing out the window frustrating). It's fun because it allows you to do what every single one of us have wanted to do when we get bullied at school, fired from work or when a car drives by, hits a puddle and splashes water all over you ruining your brand new clothes. It's a polygons and pixels shooting other polygons and pixels for the sake of your entertainment, nothing more.  Plus you get to light a mob of people attending a political rally on fire with a flamethrower. Who wouldn't want to do that?",
            "review_score": "1"
        },
        {
            "review_text": "very good game with insane hardware requirements. unplayable on my mid grade pc (5-10 FPS). keep my money anyway. it is nice tribute to postal",
            "review_score": "1"
        },
        {
            "review_text": "Aiming is a bit weird.. All in all... Great family game!",
            "review_score": "1"
        },
        {
            "review_text": "Some people may say that this game iss 'bad' for you, but please let me clarify. The actions you perform in Hatred are just the same you wouldnt bat an eye at if you witnessed them in Grand Theft Auto series.  So PLEASE consider this game it is quite good fun and I have not felt an urge to do just what the antagonist in this game performs.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game! If you want to shot those suckers down. “I don't hate you.. I just don't like that you exist”  ― Gena Showalter, Seduce the Darkness",
            "review_score": "1"
        },
        {
            "review_text": "im recomending this to anyone that has played postal classic it kinda controls in the exact same way as opposed to like dead nation or geometry wars i thought the main character was going to be making a bigger impact but i was kinda let down by the quotes they gave him like if they come out with a follow up with the fat cash theyre making off this game i hope they come out with a guy thats more deep i mean hes deep but like all the quotes he gives out like i think hes a loser he seems like a guy that can get laid but dropped out of school or something and proly cries at the opening of all in the family and when mommy died he bought a bunch of guns and ammunition cause you can you could pawn stuff and buys a couple of guns with that money and in the tutorial it also looks like he bought a couple of things to use as target practice in the tutorial so hes just doing it cause hes a hater but i wanted him i mean i know one of the designers worked on a game in which you kill nazis but still before this game came out all i hoped for was more skins skins of neo nazis skins of people from the westboro baptist church maybe some videogame protesters some punks mental patients people that are like the main characters dopleganger you know content but you know i knew what they were going for when it was going to be released i just didnt know if i was going to like it i enjoyed it and glad i didnt pay more than i already did but maybe next game or if they get it to be kinda like workshop compatable or they just release a second game that really deserves an AO rating like id rather be playing as like a custom character not in some goofy saints row sense but they come out in the begining of the second game a custom create a loser and your character doesnt say anything at all just your victims but damn am i glad they came up with the idea to get rid of the main characters voice completely so i quit my ♥♥♥♥♥ing after that but i know its cheap now but get it when its on sale i mean it should be they made enough money its time to give back as best seller of the year sale but i know i type alot this is just coming of the top of my head but people shouldnt judge the control scheme like as if this game was meant to be a twin stick shooter its more of a postal classic successer to me like if you dont believe me im pretty sure you could find it on either an abandonware site or maybe its on steam and i just havent bought it cause i already have the directors cut of postal classic on my pc and dont feel the need to buy the original but try that out then try this game whichever way you want and youll proly be like hey! im starting to get the hang of this",
            "review_score": "1"
        },
        {
            "review_text": "When I first got Hatred, I didn't know what to expect. I'll admit, I did buy the game partially for the reason that it was controversial upon release. However, the game has a beautiful art design and stunning graphics for a twin-stick shooter.   My critiques for this game have been brought up before, but I'll say them again: - AI needs to be smarter - Needs to be slightly more optimized - Control over hurdling objects needs improvement.  Overall, a beautiful and challenging game for the price.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME!!!!! It got me banned from Twitch, but hey, some ppl are offended by human nature I guess lol",
            "review_score": "1"
        },
        {
            "review_text": "If you just want to blow brains out of some ♥♥♥♥ing moran people then this is your game. Leave no one alive. They don't deserve a natural death. Only your weapon understands you.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Controls are a bit wacky but easy to get used to. You'd never believe me, but playing this game is actually a pretty nice way to calm down and blow off steam. Trust me.",
            "review_score": "1"
        },
        {
            "review_text": "Competent and actively supported, this game will provide plenty of brutal entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "I feel guilty for buying this",
            "review_score": "-1"
        },
        {
            "review_text": "Best thing for Customer Service Consultant's 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing hunting simulator about american wildlife.",
            "review_score": "1"
        },
        {
            "review_text": "It's good. Fantastic destruction engine, nice fluid movement, pretty fire effects make for beautiful (if a little grotesque) scenes, and actually pretty challenging (simple and effective) game-play. Worth the dosh.",
            "review_score": "1"
        },
        {
            "review_text": "The equivalent of sitting down and smoking a sub-par joint but everywhere else is dry.  Hatred takes place in the outskirts of New York City, where you play as an unnamed man named The Antagonist (DID YOU SEE WHAT WE DID THERE?!). As the Antagonist, your goal is to murder as many human beings as possible, be it by fire, firearms, knife, grenade, or old fashioned curb stomping and kicks to the head.  The gameplay itself is below average. The controls are functional, but it runs into the Assassin's Creed problem of being able to run into walls very easily. Hit detection can be a bit dodgy as well, and it is entirely possible to fire a shotgun point blank and miss due to visual difficulties.  Which ramroads us to the next point in the visuals. Thematically, it's presented a bit like Sin City: all dismal greys and blacks and whites with some splashes of Red for blood or Blue for police lights. Your crosshairs can be different colours as well (which is hilarious when its green), but even then it's difficult to tell at the best of times where you, or anyone else, currently is, or what's hitting you to begin with.  The weapons are satisfying enough. You point guns in one direction, bullets fly out of them, and they interact with civillians in obvious ways. AI's dodgy though, so more often than not you have policemen completely missing where you are and civillians who run screaming -towards- you, for some reason.   Despite this, Hatred is fun in the sense that you are not playing it to beat it, nor are you playing it for a good story experience (especially not that, dear god the acting...). You're playing it because Dave at work flipped all your buttons, Sasha was able to emasculate you at the company meeting that day, and Darryl was busy being Darryl, the self centered idiot. So, you come home, flick on this murder simulator, and just blank out for a few minutes.  Hatred is a game that exists to unjudgementally help you relax and unwind after a long day until you're ready to do something productive, like playing a far, far better game. Postal 2, the GTA series 3 and onwards, Manhunt 2, they all accomplish Hatred's job better than it does. But Hatred itself accomplishes what it set out to do regardless; here is you, here are some guns, here are people who can be shot, go have fun.  Maybe get it on sale, but I'm not upset at paying ~20$ for this.",
            "review_score": "1"
        },
        {
            "review_text": "this game is too much fun the awesome feeling of stomping someones face is amazing. shooting thousands of bullets into soldiers makes me smile. and the agony the crusader has (thats what i call him) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have only put a few hours into this game and i ♥♥♥♥ing love it. The story makes no sence which i like your just some random dude who wants to kill as many people as he can. If your angry get this game it helps you let off steam so well.",
            "review_score": "1"
        },
        {
            "review_text": "It's like having a fap - A good substitute for the real thing.  All hail the Nuclear Satan.  666/666 ",
            "review_score": "1"
        },
        {
            "review_text": "Random white guy shoots up various locations with barely any motive its just like i'm watching the news",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great way for getting rid of stress and rage after a bad day on the job. We need a release and what a better way than to do it on here. If you remember the old rampages from the GTA III and GTA Vice City, its kind of like that. To be honest this is a condensed version of GTA rampages of just going on a random rampage and just killing everything in sight. Be warned though, there is a lot of blood and gore in this game. So its not for the faint hearted. But none the less its a great way to get rid of anger and rage. The downside is that the keyboard controls are a bit cumbersome as I would have preferred the GTA San Andreas control setup for the keyboard. So I would recommend using a game controller as it makes things much easier when playing. The graphics are better than what I was expecting and my Nvidia 2GB graphics card can run this game smoothly with no lag.   Overall Rating: 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "During the tunnel scene the homeless are basically healthpacks. (Executing them gives you back health) Which is helpful knowledge next time i get lost on one of my late night sewer adventures...",
            "review_score": "1"
        },
        {
            "review_text": "Damn! This game makes the violence in GTA look like childplay. Very Metal",
            "review_score": "1"
        },
        {
            "review_text": "Hard and good controls",
            "review_score": "1"
        },
        {
            "review_text": "Top Cho's score in a kill everyone situation. With isometric perspective and an art style reminiscent of Sin City.  Play as Nathan Explosion who is down on his luck after the show ended and decides to murder everyone just cause it'd be ♥♥♥♥ing BRUTAL!  Now go make the Columbine duo envious.",
            "review_score": "1"
        },
        {
            "review_text": "I got this through a bundle and i lost 36 minutes of my life playing the first mission. It is a meaningless little thing that will make you feel bad for the rest of your day, just because it had you doing things that are purely stupidi and quintessentially evil. There is no real story, purpose or concept behind this game. Just a thug with guns, killing innocents. Quite honestly, i had drawn myself a line in the sand, where i would just quit if it asked me to shoot children, but thankfully that did not happen, the only thing that salvaged my day. The narrative is very direct and the killer essentialy speaks to the player, a choice that i suspect meant to break the fourth wall and get you involved in the action. Sadly, due to the action of this specific game, that means identifying with a killer.  As far as the technical aspect is concerned, it has easy controls and an interesting aesthetic choice concerning backgrounds, bu that's about the only positive thing about this game.  Honestly i recommend staying away from this thing. I understand Steam had to publish it. Freedom of speech is paramount, even when that speech is just meaningless and vile. But you don't have to play this thing. Go play an actual fps or 3rd person shooter instead and protect your peace of mind.",
            "review_score": "-1"
        },
        {
            "review_text": "Not enough hatred.  Seriously, expected some gore, all I got was 2 second headbashing cutscenes. This should be PG-13 or smth at this day and age.  Please consider adding longer and better done executions like eye gouging, Colombian Tie or limb removal.  ",
            "review_score": "-1"
        },
        {
            "review_text": "mediocre, that's all it is, play GTA 4 if you want a decent murder simulator",
            "review_score": "-1"
        },
        {
            "review_text": "Only reason I bought this game was to see for myself what the outrage was about, and to spite the fascists who told me I am not allowed to have it.   That being said, what you get for your 20 dollars is buggy, unoptimized, and mediocre gameplay.   11/10, would make a statement again.",
            "review_score": "1"
        },
        {
            "review_text": "The game's not bad because of its theme (though to be honest it's pretty dumb) but rather it's bad because it's one of the worst twin stick shooters I've ever played. What with everything going on out in the real world I felt like this game, regardless of how violent or inhumane it is, would be a decent outlet for some deep rooted agression. Well sadly it wasn't as it only provided more frustration and aggression as the game went on. The shooting mechanics are bad, the top down angle has the worst view and when police start swarming it feels like you can't do much of anything to stand up against them. sometimes you can't even find a place to take cover as they home into your immediate location like a hord of zombies that smell fresh meat. the Truck Stop level is by far the worst offender of this as there are so many open areas that you can get swarmed at it's almost maddening. I guess this game wasn't meant to be taken seriously becasue of its rediculous nature, but even though the game is based on a sadistic psychopath that only wants to kill everyone in the world 'just because' and in the most graphic and violent way possible, there was nothing 'fun' about this game. But I guess that's the point? I dunno. The Postal games are more fun than this game. I'd recommend those over this any day.",
            "review_score": "-1"
        },
        {
            "review_text": "If Postal 1 was to come out today, it would be like Hatred.  An isometric run and gun game featuring fun gunplay, an astonising damage model/physics system, beautiful visuals and some great animations ranging from simple movement to close up executions. It's gory, brutal with lots of one-liners and above all fun to play. The npc's have great voice actors that help with the immersion. The developers also recently added new side quests and a new Survival mode!  The game doesn't take itself very seriously and I regard it as such. The story is as simple as a guy going on a rampage trying to kill as many people as possible, along with a couple of sidequests that usually involve even more killing. Nothing more, nothing less. It can be very challenging on the highest difficulty setting, found myself cornered by law enforcement one too many times. Challenge is good!  They've also fixed most of the performance issues in the latest update and added even more visual settings. I believe the game is definitely worth a try.  7/8",
            "review_score": "1"
        },
        {
            "review_text": "I'm not going to pull any punches here, this game is garbage.   It tries to recreate the mechanics of old-school Postal but has none of the wit that Running with Scissors used in their game and just becomes tired and dull very quickly. I played it for less than an hour and that's all I could stand.   Clearly the developers tried to sell this one on the back of controversy and to some extent that worked but there are so many games on Steam right now that are far more worthy of your time and money than this one. If you find this game in your queue then my advice is just to click next and move on.",
            "review_score": "-1"
        },
        {
            "review_text": "Ho boy, this game.  It's not gory enough to justify its AO rating, It's not gritty enough to justify its controversy pre-and-post-release, It's not rewarding enough to justify its executions = healing system, It's not long enough to justify its superficial difficulty spike, And it is most  CERTAINLY  not even  close  to being good enough to justify its title as 'A Functioning Video Game'  11/10 This game is shït",
            "review_score": "1"
        },
        {
            "review_text": "My Review is not important",
            "review_score": "1"
        },
        {
            "review_text": "Its fun for the whole family. Cant wait until they come out with a Chris Chan adventure mod so I play as a angry manchild hunting down Clyde Cash.",
            "review_score": "1"
        },
        {
            "review_text": "I beat the game on hard. It took 7 hours. It wasn't easy. I don't think it was a shallow shooting game by any means. The system of executing people for health is conceptually silly but it leads to some tense gameplay later in the game when almost everyone has a gun.   Levels are large and have interesting layouts and options for cover. I've seen some reviews say that cover in this game doesn't work and this is just a twin stick shooter, but in the later parts of the game you won't do too well without crouching behind everything you can. When it gets harder it almost becomes an overhead cover shooter if you are playing it right.   The destruction is the coolest looking feature and probably one of the coolest gameplay elements. Being able to make the cops/army trap you in a corner, just to blow an escape hole with a grenade, and then flank your pursuers through a window makes this a more interesting affair than just popping out from behind corners all day long. Grenades are plentiful for about half the game, too, so there is a lot of opportity to make rubble.  One thing I think is odd that people aren't really mentioning is that this is basically an exact remake of the original POSTAL. Not all of the levels are the same, but they both feature a similar perspective, a main character in a duster, a mission to murder everyone and nothing more, similar weapons, half dead enemies crawling on the ground and struggling to breathe and gurgling blood, and they both start out at the main characters house.   Only complaints are the camera makes it so that it's always easier to go north, but some levels make you come back south, forcing you to use different tactics just because your view isn't as good. The game is a little short at 7 hours, but not bad for the price. It was a crazy fun 7 hours, though. And the black and white is kind of blah, I wish there was a cheat for color.  If you enjoyed the original POSTAL, or Crusader: No R---- games, then you'll understand the minor control issues here and probably love this game. Or if you just like really awesome looking destructive violence.",
            "review_score": "1"
        },
        {
            "review_text": "A bit overpriced for the scope of the game. Gameplay is repetative, but in a good way. A lot of small options and functions seem to be missing though.  1. Why the hell can't i use civilians as bullet sheilds? Maybe add a grab option? 2. Hand guns and other munitions seem to lack any range. as in cops on the edge of the screen are often immune to shots that seem to dead end just before going off camera.  pretty sure most guns have more then the screens 25-30 m range, though I understand acc at that range is tricky with pistols. 3. How many civilians do you know that could take a 9mm in the face and keep on running. Aparently everyone in this game can. a 2 shot minimum for regular people is foolish. A little variation in peoples durability would be cool. 4. Driving system is so touchy moving at more then a crawl is tricky. If I cant shoot from a car then just make it a mouse control. Oh and also WHY CAN'T I SHOOT FROM A CAR? 5. Physical combat boils down to a kick. Id like to see more varied physical combat without having to first kick them down for execution. Maybe keep the kick at a range, but mix in some face smashing if you use the same button in close. (without annoying camera changes) 6. Grenade usage is painfully bad. If you can take the time to force us to watch badly directed shots of his executions you could at least use that same tech to create an accurate throwing system. I don't know about you, but I want to be able to nail the upstairs bathroom window. Put in an aiming system that gives the player short moments of first or third person control. Allowing the player to actually place grenades, instead of having them bounce off ♥♥♥♥ and come back 50% of the time.  Hatred is a lot of fun as is, but it seems the devs just didn't take the time for the little details that make a game great. The foundation is here, now we just need some detail oriented updates.",
            "review_score": "1"
        },
        {
            "review_text": "Short game, did not live up to the hype. Not worth your time",
            "review_score": "-1"
        },
        {
            "review_text": "The new FPS mod is excellent! ",
            "review_score": "1"
        },
        {
            "review_text": "Step into the shoes of Mr. Not Important, a moody blackcoated antihero brimming with angst, rage and hair conditioner.  Spend the next 4-5 hours running and gunning through the burbs', city streets and a moving train full of ♥♥♥♥♥♥ off gangbangers. Laugh maniacally as you gun down the weak and feeble, wading through crunchy bone fragments. Crush your enemies, see them driven before you, hear the lamentations of their women, and then stomp on their womanly skulls!  All in all, a fun little isometric shooter, a little on the easy side once you master the ancient art of crouchwalk-fu which will throw trained soldier's aim completely off. maybe they studied at the Stormtrooper school of marksmanship, who knows. They do suffer from 'PsychicGuard' syndrome though and will track you through walls, quick on the trigger once they get a clear shot too.  The game does get repetitive after a while, I found by the time I was getting bored I'd almost finished it however. I imagine it will be a good one to pick up and put down when you're in the mood for good ol' fashioned cathartic vidya game genocide. Controversy surrounding it can safely be ignored, it was not, is not and will not be the antichrist reborn into pixels, nor will it brainwash your sprogs into Charles Manson clones, not that they should be playing an AO-rated game in the first place.   As for performance, didn't experience much slow-down putting everything to ultra, although I understand some combinations of GPU and CPU are causing more issues than others. I hope they work some more on optimizing for those systems. Apart from a few freezes when starting the game all was good.  TL;DR - Fun, fairy easy isometric shooter with w@nky protagonist. Lots of shooting, explosions, etc. Gets old quicky but does the job.",
            "review_score": "1"
        },
        {
            "review_text": "Lack of Airport level",
            "review_score": "1"
        },
        {
            "review_text": "Its the best violet game ever! I am not joking, it is rly awsome.",
            "review_score": "1"
        },
        {
            "review_text": "As its core, Hatred is an interesting game because it reminds us how narrow, formulaic and claustrophobic gaming narratives can be. Imagine cinema without Scarface, Hannibal Lecter or even Mike Leigh's Johnny. Moral ambiguity is essential to the silver screen but remains only a distant hope on our monitors.   The game certainly has its limitations. The core mechanics are those of a middling-quality isometric shooter with some fine destruction physics. Moreover, no significant narrative is provided for the orgy of destruction. This could either be viewed as serving the nihilistic atmosphere, or be considered as a narrative failing when compared to cinematic anti-heroes.   However, considering that the utterances of Hatred's anti-hero are not especially inspired, it's perhaps for the better than the minimalistic approach has been taken - we are free to each craft our own reasons for the violence.  Positives:  - Good atmosphere; cold, grim visuals - Surprisingly good physics &amp; destruction via UE4. It works well when backed into an Apple Store's bathroom and gunning down soldiers, who finally bring the entire structure down, forcing a hasty run-and-gun exit through the rubble. - Good concept - One of the best flamethrowers since Return To Castle Wolfenstein.  Negatives:  - For a game so rooted in gunplay, the actual gun sounds lack punch. - Something of a manufactured controversy - not really as violent or drastic as people might expect, - A fundamentally simple game that would struggle to justify a higher price point.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not gonna bother too much talking about the controversial ♥♥♥♥. I'll say that mowing down civilians in it makes me feel kind of ♥♥♥♥♥♥ and uneasy but really going any more in to that is just beating a dead horse that most media outlets can't seem to get enough of. That said, at its core it's a pretty fun twin stick shooter. When it's time to deal with some actual threats the game's actually pretty challenging and rewarding. Ducking, dodging, and generally evading gunfire is pretty intense and the guns themselves feel like they have a proper oomph behind them.   The destructable environments lend a lot to that effect as well when desks, glass, thin walls, and just about anything in the level really is destroyed and blown up by gunfire and explosions. The destructable environments themselves also allow for some creative approaches to combat as well. SWAT team swarming the house you're holed up in and you need a quick way out? Shoot the conveniently placed oxygen canister in the garage to blow a hole in the side of the building to flee through. Need to clear out a heavily fortified building but can't get through the front door without getting mowed down? Steal a SWAT van and drive it through the side of the building.   That said, it's not without its faults. The driving mechanics feel extremely clunky and sometimes it's easy to glitch the vehicles out on the geometry in really weird ways. I mentioned before that just about anything in the level can be destroyed. Well the game can be pretty stupid at times about what qualifies as just about anything. It's pretty silly when you can ram an armored van straight through the side of a solid concrete building but at the same time it just stops dead in its tracks when it hits a chest high brick wall. The monochrome color scheme can be a pain in the ♥♥♥ at times as well. A good example would be the sewer level where it makes it extremely difficult to tell whats blocking your path and what isn't, which makes it fairly easy to get caught on the terrain during a firefight or duck behind what you might think is a pipe running along the floor only to realize after taking two shells in the chest is actually an overhanging pipe.  Overall though, while the premise behind the game might be understandably off putting to people the core mechanics themselves are pretty great. If nothing else, it'd be pretty cool to see what the developers could do with it outside of a mass murder simulator.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is pretty nice  great graphics and gameplay...even though the game glitched on me once i think the game looks beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "controls are really bad every door you will be stuck for 20 sec before you you can get out i cant see anything because of black and white the game need to be poilshed fells like early acces 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Now that I have beat the game, I feel like I am certified to write my review of this fun little shooter. This is violent, you should not let your 12 year old son play this, nor should his little ♥♥♥♥ mouth be stinking up the mic on any M rated game. (Please, us adults get online to game and get away from BS, not listen to more of it.)   ANYWAYS, here is my review. This game is really fun and have plenty of replay value, BUT, and a big butt at that, there is only 7 levels. Super short game. I beat it in less than 4 hours. SUPER dissapointed because the story was going so well, then it just ends. Thats it. Its not a cliff hanger, but it seems just way too short. With only 7 levels to go back through and beat on all difficulties, I just feel it was too short to earn my $20. If they fix the optimization issues, make the gameplay feel smoother, and every other little thing that certainly gets in the way of playing fast-paced, then I could feel better about my purchase. Please add a FREE DLC! Then I will be happy. If they add more stories onto it, then it will be worth the buy. But if you wanna try it, and have $20 you don't want, go for it. You can even play less than 2 hours and get a full steam refund (Check out the new steam refunds policy made today!)   7.5/10 I would totally run around murdering people while using a scottish accent, again!",
            "review_score": "1"
        },
        {
            "review_text": "Too much violence my eyes hurts",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun and addictive. The voice acting is authentic and believable including realistic gore. Though the animations can look a bit robotic at times it isn't even that noticable. If you need to kill time while postponing the point whereas you lose all hope in existance of life and go on a massive killing spree, then this game is a nice treat.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, lots of death and explosions xD Good game to relief stress after a bad day.  NOTE : This game does not make me wanna go out and kill people, I do that enough in games.  Also got me banned from twitch for broadcasting it, wusses.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest Western example of 'moe' presented through a grittier lens than most Eastern works.",
            "review_score": "1"
        },
        {
            "review_text": "Controls are a little chaotic, twin stick shooters are usually a lot of spray and pray but this one requires a bit of accuracy that is tough to get. Reminds me of the original Postal, just happily running around slaughtering people. Sure it's cheesy and probably will make the civilized folks who don't play games have a panic attack, but who cares?",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely underwhelming: 9/10, requesting refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Best Game Ever! I've always wanted to play as the antagonist and here's a game that delivers on that rather well!  Now, try to roleplay as a Social Justice Warrior, seeking justice against those who do not deliver it well in real life or against those who you despise the most. Now that is the fantasy you should be imagining when u pick up this game!\\\\  25/10",
            "review_score": "1"
        },
        {
            "review_text": "Elliot rodgers comes back from the grave to finish his mission in this isometric normie killing simulator",
            "review_score": "1"
        },
        {
            "review_text": "Thank you Steam refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Hype. Hype. Hype. Boring. Boring. Boring Not even that gorey.  Great destruction though. Good for a bargain.",
            "review_score": "-1"
        },
        {
            "review_text": "Really stupid game the civilians run towards you and stand about waiting to be killed... seems rather pointless its not fun when they are letting you kill them! they should be getting the ♥♥♥♥ out of there if a mad man is going on a killing spree not walking around casually or coming outside like nothing is happening... Ive only played the first level so maybe i will change my mind but so far the game is ♥♥♥♥! wheres all the gore...",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would rage fap again",
            "review_score": "1"
        },
        {
            "review_text": "Ok, I know there's a lot of people saying this game sucks...  but I kind of like it.  Relaxing, shooting, running around, getting killed by the cops on level 1, its all fairly fun.  recommended if you like twin stick shooters and just killing random people.  granted, the executions get old really fast, and shooting isnt as gory as people make it out to be.  but just a fun little relaxer if you enjoy human killing and want something a bit different.",
            "review_score": "1"
        },
        {
            "review_text": "When people asked me why I bought this, I say to support the statement Destructive Creations is trying to say about Violence in the Media and Video Games. Now that I have played it, It brings out mixed feelings in me. First, I think the gameplay is good for a pc isometric view, and the guns feel like they have effect to them. On the other hand, I dont know whether i should see a therapist because i find the game very enjoyable, even tho you mindlessly mow down innocent civilians while the antagonist spits out funny ♥♥♥ insults (my favorite is 'no more words, Worthless ♥♥♥♥'). so if you like top down shooters and can imagine instead of people, your mowing down aliens, then i reccomend it, If you like the statement they are creating, I reccomend you support the company by buying it. If you a bible thumping, extreme left or Right wing soccer mom who thinks that this game will inspired people to grab a gun and start mowing down people because you care more about censoring them, rather than educating them, then crawl under a rock, we dont need your kind here anymore",
            "review_score": "1"
        },
        {
            "review_text": "Every time I kill the public screams for more Trained to entertain A bullet through the head, eyes gouged out Hypocrites ignite Visionary exhumation I'm your savior  I pull the trigger and set you free from life Then mutilate for you all to see Honesty through vile and cruel incisions Visions of zealotry  Now I will kill everyone Everyone who's breathing There is no reason to feel Nothing's sacred in my world of hate Patriotic hatred My chaotic, patriotic hatred  I'm following my pure intensions to murder I'm sorry, but you have to die for us all It's time for reckoning And I'll be judged by the weak Politicians, necrophobic cuntss, ♥♥♥♥ing cowards Hiding precious artwork of my victims agony Indulge in death, indulge in blood This path I chose cause I will never deny who I am  Now I will kill everyone None can stop me",
            "review_score": "1"
        },
        {
            "review_text": "Postal 1: Remastered. Great little game for letting off some hard day steam.  For now, though, it heats my rig like hell. I get 80 degrees Celsium on my GPU and ~70 on CPU, with performance going batshit. I'll wait for some patches.",
            "review_score": "1"
        },
        {
            "review_text": "When people asked me why I bought this, I say to support the statement Destructive Creations is trying to say about Violence in the Media and Video Games. Now that I have played it, It brings out mixed feelings in me. First, I think the gameplay is good for a pc isometric view, and the guns feel like they have effect to them. On the other hand, I dont know whether i should see a therapist because i find the game very enjoyable, even tho you mindlessly mow down innocent civilians while the antagonist spits out funny ♥♥♥ insults (my favorite is 'no more words, Worthless ♥♥♥♥'). so if you like top down shooters and can imagine instead of people, your mowing down aliens, then i reccomend it, If you like the statement they are creating, I reccomend you support the company by buying it. If you a bible thumping, extreme left or Right wing soccer mom who thinks that this game will inspired people to grab a gun and start mowing down people because you care more about censoring them, rather than educating them, then crawl under a rock, we dont need your kind here anymore",
            "review_score": "1"
        },
        {
            "review_text": "Honestly since i bought the game i haven't had one problem about it...  the game is awesome if all you want to do is kill an destroy an watch alot of stuff blow up...  to be honest its like being the comic book character ( The Punisher) if he was really a villian.. this game shows that kind of feel.. so if your not into that kind of stuff then you won't like it.. but if your that kind of person like myself who likes all the above.. then welcome an enjoy your massacre \\m/",
            "review_score": "1"
        },
        {
            "review_text": "Despite the strong theme, the game is not well explored. The lack of arsenal and environment makes the game boring in a flash. You shoot people, execute 'em in a variety of ways to heal (that's the only way to heal here), reload, throw granades, molotovs, drive cars (I read the driving was bad but it is fine). And that's it. Rinse and repeat.  After 10 minutes it already feels like playing PAC-MAN with bleeding people instead of blue scared ghosts and a Black&amp;White environment.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed this game for the first couple levels but then it strays from a game based on massacre to just another 'I shoot Cops shoot' game where you're constantly needing to find ammo and cover since hordes of cops with automatic weapons come and overpower you. If that's what I wanted I'd play GTA or Battlefield but instead you have to constantly worry about cops coming up and how much ammo you have. Some mods are worth checking out though.",
            "review_score": "-1"
        },
        {
            "review_text": "'I'm f-cking sick of society simulator 2015'    Because f--k you, society.",
            "review_score": "1"
        },
        {
            "review_text": "Beat the game in an hour after countless amounts of crashing. You could instantly die on easy and I dont dare to try the higher diffculties.. So 0/10 - DONT BUY THIS GAME IT IS A WASTE OF MONEY!",
            "review_score": "-1"
        },
        {
            "review_text": "After spending a few hours with this game I'm ready to tell you what I think.  I have absolute no problem with the content of the game, I do the same in GTA 4/5 when I'm bored. It's a game, it's adult only, get over it.   The game is not that good though... I had fun for the first hour, after that it was just to kill some time. The controls are weird and a lot of times you can't even see who's shooting at you. I also have the problem of sometimes loosing the sight in all confusion and trying to shoot everyone everywhere. There is no reason to do what you're doing, there is no real quests or anything that matters just kill 20 people here, blow this up and kill 10 more people.. It's fun for a short time but it get old quick.  It's not the worst game out there, but its not worth it's price at all. This will be a game you buy to kill some time before work or something like that, do not expect to be knee deep in a dark and interesting story. If this game was on my phone, this is the game I would play when I'm taking a ♥♥♥♥.   So if you are thinking about buying the game, it wont be the worst game you ever buy, but knowing what I know now, I would wait for it to be on sale..",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I can't give this the fair review it deserves. Instead, a warning: DOUBLE CHECK THE RECCOMENDED SYS REQUIREMENTS BEFORE BUYING THIS!!!! you'll need at least a quad core or octo-core processor for this to be decent.  I'll still reccomend this game. BUT BE WARNED!!!!! CHECK YOUR SPECS BEFORE GETTING THIS!!!!  I've come back to write a review on this game after getting a system upgrade just so I could play it.  I'll still reccomend this game... if it goes on sale.  pros:  decent graphics, ok soundtack, insane physics engine, very dark atmosphere, lots of killing. great concept of a game. very challenging.   cons:  I'm still shocked at how much processing power this game needs to run. literally need a decent quad core to even get this to run.   Gameplay is a bit clumsy, aiming is irritatingly difficult, and gets hard to watch after a while with all the monochrome-style graphics... and I'm playing with a 32 inch lcd tv hooked up through HDMI. Also... gets kinda boring pretty fast? I don't know how to explain it. despite all the violence it actually gets kinda dull pretty fast.   Controller support sucks. Literally almost impossible to play decent with a controller for this style of game. I mean, you CAN... but, this is a rare case where a mouse and keyboard are more effective because of how the game is set up. There's also some gameplay issues you'll find annoying involving actually moving around and aiming.   overall:  I just can't bring myself to call this a bad game. It isn't a bad game.  It's a decent game with a lot of negative aspects going for it. Annoying graphics and gameplay are two of them. Very well made game though! But, I do have to put out the warning on the negatives.   but, CHECK YOUR SYSTEM TO SEE IF YOU CAN RUN THIS GAME!   I made the mistake of getting this (not on sale... ugh) before checking, and was shocked to see how much I needed to upgrade. DO NOT BUY IF YOU DON'T HAVE A QUAD CORE PROCESSOR!    Also, just wishlist this game and wait for a sale. Sorry, has to be said.   I will still reccomend this game, but not very highly, and not without a warning.",
            "review_score": "1"
        },
        {
            "review_text": "Reaper: 'Die, die, die!' The protagonist: 'What's up bro?' Reaper: 'Not much, just got POTG' The protagonist: 'Cool, I killed a whole city' ",
            "review_score": "1"
        },
        {
            "review_text": "This game just misses the key elements to make it worth. Where is the co-op? Where is the score attack like game mode? Why is there even a campaign?  I really hope the developers listen to the crowd and add something in, because at the moment the game isn't worth playing.",
            "review_score": "-1"
        },
        {
            "review_text": "After spending a few hours with this game I'm ready to tell you what I think.  I have absolute no problem with the content of the game, I do the same in GTA 4/5 when I'm bored. It's a game, it's adult only, get over it.   The game is not that good though... I had fun for the first hour, after that it was just to kill some time. The controls are weird and a lot of times you can't even see who's shooting at you. I also have the problem of sometimes loosing the sight in all confusion and trying to shoot everyone everywhere. There is no reason to do what you're doing, there is no real quests or anything that matters just kill 20 people here, blow this up and kill 10 more people.. It's fun for a short time but it get old quick.  It's not the worst game out there, but its not worth it's price at all. This will be a game you buy to kill some time before work or something like that, do not expect to be knee deep in a dark and interesting story. If this game was on my phone, this is the game I would play when I'm taking a ♥♥♥♥.   So if you are thinking about buying the game, it wont be the worst game you ever buy, but knowing what I know now, I would wait for it to be on sale..",
            "review_score": "-1"
        },
        {
            "review_text": "Hatred = Hate Hate = 4 letters Hate - e = HAT Hat = 3 letters 3x4 = 12 12 months in a year year = 8765.81 hours 8765 = chem ID for: 4,4'-Thiodianiline 4,4'-Thiodianiline = carcinogenic carcinogenic = cancer THC kills cancer pot reversed = top the top of the pyramid is missing Aliens built the pyramids Pyramids are a symbol of the ILLUMINATI  ILLUMINATI = CONFIRMED.",
            "review_score": "1"
        },
        {
            "review_text": "Pros Moddable Good arcade style gameplay Great graphics (esp with color mode) Great way to release stress / anger in a safe and legal way.   Cons Requires a great PC to play smoothly Repetitive gameplay  Not enough weapons  &lt;Rants by Eric Harris removed because of Partyvan visit&gt;",
            "review_score": "1"
        },
        {
            "review_text": "The best game EVER!  Kill everyone, smash everything and send to hell. And remember they all deserve it.  The only one minus this game has - it's not well optimized...  But try to play it while listening to Slayer, it's for sure a bloody orgаsm!",
            "review_score": "1"
        },
        {
            "review_text": "You just run around and shoot people. That's it. Leaves a little to be desired due to there being only seven levels but for $20 it's a solid game and hopefully new material will be created when the devs release mod tools.",
            "review_score": "1"
        },
        {
            "review_text": "i can practise 4 school",
            "review_score": "1"
        },
        {
            "review_text": "i love almost every moment of this game (apart from the army base that was hard af) but this was more than some controversy bait about a spree killer, it was an sadistic joruney to eliminate the human race and i loved every second of it  9/10 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Mediocre shooter at best. Only positive elements are the environments and the use of UE4. Prepare yourself for a game that can be mastered in a matter of minutes. Once you’ve got the basics down all the difficulties blend into one and fun becomes hard to find. Robotron did it better, for that matter so did the original POSTAL. Pick both of those games up instead of this pathetic excuse of a twin-stick.   Once you’ve exhausted the few moments of catharsis and irony, the game quickly devolves into a spinning record of the first 5 minutes of gameplay. Instead of buying this and giving your money to a bunch of angry Polish nationalists, give your money to the archdiocese or a police union. At least you know it’ll be used by pieces of ♥♥♥♥ here in the states.   Archie Bunker was right. Michael Stivic hangs his head in shame. Fool me once Destructive Creations, shame on me. Fool me twice? Shame on the Ottomans.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Fun to play, challenging, runs smooth as butter,   Cons: controls are weird, its hard to see some enemies because of the color scheme, and poor controller support (controls again as weird)  all controversy aside its fun and worth a buy. its not perfect but its different in a good way.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "an homage to our game....POSTAL! Glad someone modernized it and took what we did back in 1997. Wish the color palate was a little brighter and the view was a little higher up. Thanks Destrictive! -MikeJ~",
            "review_score": "1"
        },
        {
            "review_text": "A arcade shooter that plays well with some good ideas and great to vent your frustrations. With striking visuals that have a dash of colour and a black and white palette and some really fun if slightly reptetive missions that mostly just require you to go into different places such as supermarkets ot illegal weapon deals and blow the ♥♥♥♥ out of everything. The game actually features some really impressive destruction physics which enable every wall to be reduced to rubble, i'd go as far as to say its destruction is probable some of the best I've seen in a game. As you cause more chaos the authoritys force against you will scale up, starting at regular police forces moving on up to swat and the army. At which point the levels become like a battlefield of bodies and explosions.  All in all good fun and nowhere near as monstrous as has been made out. If you want an enjoyable arcade shooter and can easily seperate pixels from real life you could do a lot worse than this 5 hour destructive time waster.",
            "review_score": "1"
        },
        {
            "review_text": "In the memory of Marvin 'Killdozer' Heemeyer.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game boring and very unfun. These are MY reasons what I didnt like about the game, your reasons may be different.  POSITIVE: The executions The destruction (walls crumbling ect.) Steam workshop  NEGATIVE: The camera angle is just the worst. Aiming No stealth No firstperson Health regen too easily No melee All NPC look kinda the same Everyting is pretty much grey MORE BLOOD!!! Everything is small and I cant really see Doesnt really take my anger out just makes me annoyed  SUMMARY: Its a good game for about £2.50 but not worth what it is now. Honestly it feels like I should just go play GTA and go on a genocide. Also the game has steam workshop and I dont know if some of these positive/negatives will be crossed off the list.      ",
            "review_score": "-1"
        },
        {
            "review_text": "The game is more of a challenge than i originally anticipated. It gives exactly what it sounds like, every level starts with a general objective of massacreing the population of the town with little side objectives to find and complete as well before eventually pushing the narative forward one small step. I love the look of the game and the physics engine feels great, shotguns give a satisfying kick to enemies machine guns tear to ribbons. I can't say it's the best game ever made but it's a lot of fun to just ♥♥♥♥ ♥♥♥♥ up.",
            "review_score": "1"
        },
        {
            "review_text": "The game is more of a challenge than i originally anticipated. It gives exactly what it sounds like, every level starts with a general objective of massacreing the population of the town with little side objectives to find and complete as well before eventually pushing the narative forward one small step. I love the look of the game and the physics engine feels great, shotguns give a satisfying kick to enemies machine guns tear to ribbons. I can't say it's the best game ever made but it's a lot of fun to just ♥♥♥♥ ♥♥♥♥ up.",
            "review_score": "1"
        },
        {
            "review_text": "Re-doing this after I played some more of it.  The only reason Hatred is big at all because of it's brutal violence portrayed in the trailer that caught the attention of many overly sensitive idiots who think that it's really any different than Grand Theft Auto or even some movies.  The game, while it is fun as an isometric shooter, falls completely flat at what it was perceived as. It doesn't seem like it's trying to be ultra-violent for the sake of being ultra-violent and edgy, but rather for the sake of being controversial. This game is simply trying to make a statement about sensitivity and censorship in gaming.  With that said, the game is fun yet repetitive. The difficulty curve is sort of a vertical spike up in later levels, with armored enemy squads that group on you like crazy and even suicidal car drivers that will run you over and then explode.  The game is a fun isometric shooter, but with the fact that I can't take it seriously with it's overly angsty tone with the aptly titled 'Jeffrey Cuddletrousers' talking in a grizzled, gravelly movie trailer voice, spewing one liners after every execution that sound like they were taken out of a death metal band's debut album, there's nothing much more for the game to offer other than a stupid story and pretty graphics.  This game is a perfect example of what I would call good idea, flawed execution (no pun intended). The last 'genocide simulator' I can think of is the original POSTAL - and yes, I would call that game disturbing.   If you were looking for a disturbing game, it's really not here. And since that's what it was built up to be, there's not a whole lot more to recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "The Feel Good Hit of the Summer! had a 'Blast' with this game.. id 'KILL' to be able to play more!... i guess you could say im pretty 'CRAZY' about this game!",
            "review_score": "1"
        },
        {
            "review_text": "For some reason people starting dying around me. I try to help them but they just ♥♥♥♥ing run like a headless chicken. Deserve to die~",
            "review_score": "1"
        },
        {
            "review_text": "The Feel Good Hit of the Summer! had a 'Blast' with this game.. id 'KILL' to be able to play more!... i guess you could say im pretty 'CRAZY' about this game!",
            "review_score": "1"
        },
        {
            "review_text": "After 2 hours of this game I have to go watch some cat videos.   Wondering if they have a mod to change people to unicorns.  Camera really hard to control.  Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I have looked at these reviews and could see a lot of 'poor character writing' among them....  If you want a damm novel, go read a book or watch some english drama movie. This game is about killing, and there was no need to fill it with rainbows and sunshine. The man has a focus, the man executes his plan. Simple, lasting fun. Heil Gaben for not listening to whiny democrats and letting Hatred breathe in Steam.",
            "review_score": "1"
        },
        {
            "review_text": "so... i wanted to get this game for some time, i had under the pretense of our american economy POSSIBLY crashing in october 2015, though its not overly likly, i had purchaced the game after watching some reviews, and bearing through all the contraversey, i finallyh got it.  truth be told, ya the context for the murder is 'bad'. but overall, it didnt make me flinch. personally, i think this game is just semi boring, its not a chore to play through at all, but for me personally, it just doesnt quite meet the quota. in that, you go one place, shoot and get shot at, go to another, rinse and repeat, which is fine, just the levels seem all the same, that said, alot of people probably dont mind  if you like arcade style stick shooters, go ahed and get it, just make shure to play it with mouse and keyboard.  in conclusion, this game is not at all bad, its actually quite good, go for it if you see the reviews and like the style, if you want it for the pure sake of murder, dont bother, postal 2, or gta, or probably some other games are better for such a sake.",
            "review_score": "-1"
        },
        {
            "review_text": "Easily one of my favorite games. Extremely violent. And that is the only point. Violence.  Aside from the flashbang crash and low health heartbeat issue, i give the game a solid 4 / 5",
            "review_score": "1"
        },
        {
            "review_text": "Had high hopes for this game. It lacks entertaining objectives. I dig the art and the layout of the game, it could just use some more content with in the first hour of gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "The edge is so thick you can grab it by its coat and shoot it in the mouth point blank. 9/11 would be edgy again  On a more serious note... The game itself looks overall beautiful, and the extra touch with the flowing foliage and various things in the environment that move or break apart makes the world feel alive. The way the game is stylized gives it a darker look, only showing black, white, gray, and warm colors from blood and heat. The animations while looking down are decent, but the close up executions are very nicely done. The antagonists coat also adds to the movement in the game that makes it feel alive. The bugs are scarce, at least the ones that affect the gameplay. The only ones I noticed were that cops and military sometimes shoot their own, and the windows you can go through seem to be a hit or miss.",
            "review_score": "1"
        },
        {
            "review_text": "Exactly what I expected year ago when this was announced.  Fun, brainless and simple. If you have a 360 controller, just start it up and it's easy to pick up. Controls are solid and tested (dead nation, killteam etc..). Perfect game for short sessions and you can probably have a good time and laughs with your mates and couple beers while taking turns to shoot stuff and dest... oh right! the destructible enviroment is amazing! Extra points for that. Makes it more fun to loan a cop car and visit random NPCs home :)",
            "review_score": "1"
        },
        {
            "review_text": "After playing a little under an hour of this game i give it a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's intense, loud and nasty fun. It is very short, so don't blow your life savings expecting to be entertained for a couple of weeks. The environment destruction is *amazing* there is no other word to describe it. You can blow chunks out of walls, shatter windows. Blow out street lights and cause utter chaos and destruction on the streets. Explosions are pretty.  I played on the medium difficulty titled 'hard' and found that crouch was a little too powerful. It basically made me into neo and very hard for the police and soldiers to kill me. I did die a bunch of times though while playing. I expect I'll be coming back to this game the next time I feel like mass murdering the human city with a flamethrower, their screams are like music to my ears.  Overall extremely impressive for an indie game, in my opinion the best game in its genre. Well done destructive!",
            "review_score": "1"
        },
        {
            "review_text": "You play as Nathan Explosion from Metalocalypse. 11 dead unarmed civilians out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Just a game about a man exercising his second amendment rights nothing to see here. Also he lives in a world where more than three people go to the library.",
            "review_score": "1"
        },
        {
            "review_text": "After playing a little under an hour of this game i give it a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I think i have a mental problem..   And i love it!",
            "review_score": "1"
        },
        {
            "review_text": "You play as the lead singer to one of the world's best black metal bands, when without warning you are kicked out by the bass player. The horrible part is he's really not that great of a bassist. In fact, the bass player was the weakest link in the whole unit, so it comes as an absolute shock that the boys sided with him. Add on to the fact that the bass player is rude to the fans, and doesn't help to write any of the songs, only adds to the insult.   Unable to cope with the fact the masses are not hearing your music, you slide in to a depression. You lay around sleeping all day, and drinking, even going as far to start using drugs. Then, because of all of these things, including the fact you aren't making any money from your gigs, you awaken to find your husband (Hey it's 2015... Grow up.), has taken your adopted baby, and left you.  In a rage you decide life isn't worth living, so you are going to take as many people with you before you go.   Ok I lied, I gave him this background to make myself feel better as I mow down a mall. You just run around, killing any human that moves, along with police, and soldiers. All the while saying great dialog along the lines of... 'Take the shaft of hate.'   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Hitler simulator 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is sick and fun, Unreal Engine 4 looks great.",
            "review_score": "1"
        },
        {
            "review_text": "I was hoping for something worth the adult rating it wasn't. I wanted something so violent I would ask myself why I'm doing this. The moment didn't come with the COD Modern Warfare 2 mission or this game. This game is more mild than GTA V in violence. GTA V which would have been rated 'T' for teen in comparison to what was available when I was a kid pulling the skull from my friends dead body with the original mortal kombat. HYPE.",
            "review_score": "-1"
        },
        {
            "review_text": "good solid game for 20 bucks. supposed bugs i haevnt seen any after 5 or so hours",
            "review_score": "1"
        },
        {
            "review_text": "Our hero who goes by the name 'Not Important' has shown that he can hate, but can he love? Find out tonight on Lifetime.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game without cutscenes and things that interrupts the gameplay, it's just mindless killing fun this game is awesome 20$ for it is really cheap this game is for me a masterpiece it has gone a while since i play a Single player that is fun like these and also the game is really challenging the AI is pretty hard.",
            "review_score": "1"
        },
        {
            "review_text": "For 300% more immersion, scream 'Allahu Akbar' at the screen while you play.",
            "review_score": "1"
        },
        {
            "review_text": "The edgiest twin stick shooter ever, with predictably shallow gameplay and annoying movement controls.",
            "review_score": "-1"
        },
        {
            "review_text": "play as a crazy sadist killing innoncent people for fun! i like it!",
            "review_score": "1"
        },
        {
            "review_text": "First off, I have to say that my ultimate feelings on the game are... It's boring.  A lot of people have likened this game to a modern remake of the original problem. Here's the big problem with that notion. Postal offered a legitamite challenge to the player. There were varied forms of opposition, and a genuine challenge from level to level, and if you kept track of the journal entries of the character that were in the manual, there was a story about a man who was truly snapped in half. The reality of your actions in the game do not match the journal entries in the manual. You truly got more out of the experience than something like Hatred gives you.  Hatred has you playing a parody of a mass murderer. You go around shooting people. Then you do it again, and again, and again. Now, many will ask how that's any different from a game like Doom? Well, again, there's variety there. Different enemy types, and you're not *just* shooting things in a game like Doom. You're exploring a maze, you're tracking down key cards, or solving the hostility found within environments. Hatred doesn't have that. The only progression to be found in the game is that you go from completely unarmed civilians, to regular cops, to SWAT team guys, to soldiers. They're a little tougher. Ultimatel you're just slaughtering unarmed people with devastating firepower. It get's old fast.  My personal reccomendation? Buy Postal, Postal 2, and it's new DLC 'Paradise Lost' you'll have far more fun that way. ",
            "review_score": "-1"
        },
        {
            "review_text": "The good:  *Mindless fun, you dont have to think much to play this game. just shoot and run.  The bad:  *Badly optimized, I have exact hardware from the recommended and I can hardly run 60 fps on low settings. *Camera is not the best but can get used to. *Dialog.  My opinion: its good if you are drunk! :D",
            "review_score": "-1"
        },
        {
            "review_text": "I think the premise to this game and the 'story', if you can call it that, is what built all the hype around it.   But the gameplay it self is EXTREAMLY average and gets boring in around the 20 minute mark. Your doing the same thing throughout the entirity of this game. The death animations are crude and boring and for all the violance that was put around this game, its really not that bad. I would rather play GTA or Postal 2 if I wanted extream violance.  For 24 bucks, not worth it. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Gets boring really quickly unfortunately",
            "review_score": "-1"
        },
        {
            "review_text": "best just to pass on this one..  it get boring and pointless the more you play it..",
            "review_score": "-1"
        },
        {
            "review_text": "its fun but gets competiteve very fast",
            "review_score": "-1"
        },
        {
            "review_text": "This game is Impossible. I can't go five seconds without 50 cops trying to kill me. Worst civlians will pick up guns and try to kill you! Wow because that's fair enough. Worst is the respawns. You have to earn respawns so that once someone kills you you can respawn. But if you dont have those once you die YOU HAVE TO RESTART THE ♥♥♥♥ING LEVEL! The only way you can get this is by doing side missions. So basically the game forces you to do side missions. Also the A.I is bad....like really bad. Cops somehow knows your behind a wall. This game even gets boring. I can't believe i got hyped up for this ♥♥♥♥. Please update this game PLEASE!",
            "review_score": "-1"
        },
        {
            "review_text": "I wasn't supposed to stream this on Twitch, but I did it anyway. I said it was Path of Exile.  Rating: # of people killed / 10  Unimpressive in both concept and gameplay. Should have been rated T and sold for $5.",
            "review_score": "-1"
        },
        {
            "review_text": "I've had this game since it came out and have yet to beat it. While yes it is fun, it get very boring very quickly. The game is difficult, but that doesn't make it bad. It's a hit or miss with this one. It was fun (although i've never finished the game).",
            "review_score": "1"
        },
        {
            "review_text": "great game i actually have more fun playing this than i did playing gta!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Dont come to school tomorrow.",
            "review_score": "1"
        },
        {
            "review_text": "Wow this game is twisted and hilarious plus over the top but like it...",
            "review_score": "1"
        },
        {
            "review_text": "I have hatred for my laptop because it lags and is not a good PC,Hatred confirmed",
            "review_score": "1"
        },
        {
            "review_text": "Lowkey ♥♥♥♥ed up, but lowkey fun",
            "review_score": "1"
        },
        {
            "review_text": "Wow this game is twisted and hilarious plus over the top but like it...",
            "review_score": "1"
        },
        {
            "review_text": "Wanna go on a mass genocide and be on the NSA watchlist after buying this game then get it!  12/10 would Genocdie again",
            "review_score": "1"
        },
        {
            "review_text": "Pretty alright. Mediocre shooting Good destruction Meh camera Absolutely awful optimization. Nowhere near as grotesque as journalists would like to believe  10/10 would buy again to spite SJWs",
            "review_score": "1"
        },
        {
            "review_text": "Do you like to kill parasites? Do you hate life? Do you want to see the pain and suffering  BUY THIS GAME. ITS 100% AWESOME.",
            "review_score": "1"
        },
        {
            "review_text": "All told, this game has incredibly tight twin stick shooter gameplay. Mechanically, the game is near flawless, Movement is smooth, ammo is common enough to be forgiving without making the game a cake walk.  For all of its mechanics(ANd the modding added recently, though I'll address that in a bit) the game fell flat for me. I'm not averse to 'Mature subject matter' but the approach to the games content was just...bland, in my opinion. With mechanics so strong, I just wish the game actually had some rationality behind it. For me, personally, gameplay means very little if the story isn't engaging, and this doesn't even value being called an 'Excuse plot' or a 'throwaway plot'.   I know, and understand that this was the intention of the game design; it was meant to be an escapist fantasy focused on a single objective, and in that, it succeeds.   All of that said, the game was made in a way that made modding very accessible(People have even gone so far as to make it an FPS, which is crazy.) And perhaps somewhere in the mods there is something that would make this 'resonate' more with me, personally. The community seems very active thus far, so there will likely be fixes or changes for most things you might desire  But for me, the game wasn't worth the money; I don't recommend it for everyone; but if you're into this kind of game(You'll already know if you are), go wild.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game on the earth! Please add children and animals. ",
            "review_score": "1"
        },
        {
            "review_text": "Its ok but definitely 16,66 is too much for this. There is not much to it, just kill people. really low amount of content. Definitely going to keep it in my library.",
            "review_score": "1"
        },
        {
            "review_text": "The idea is good but the game lacks polish (ar ar ar) and you die more often for random reasons (like the protagonist can't seem to throw a grenade further than his feet) than for poor strategy.",
            "review_score": "-1"
        },
        {
            "review_text": "best thing to do when you had a bad day at work 10/10",
            "review_score": "1"
        },
        {
            "review_text": "For the family.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Unlike manhunt 2 it is not censored in any way. Not a very in depth story bet ehh it's not really needed lmao.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a dream, put on your fedora and fingergloves, close reddit /atheism and get ready to kill every feminist,christian or highschool bully on earth. Most enjoyed wearing a fedora.  Jokes aside it is a very fun game and the destruction is very good.",
            "review_score": "1"
        },
        {
            "review_text": "A game not for the faint of the heart. Epic slaughter carnage that shortly last with an intense gunfight between yourself against the authority that prevents you to do a massacre that the world fears.   Preview   The game got it's goods. It's objective were clear: Slaughter everyone into bits and show the world that you're not joking in attempt to do your massacre. One of the fewest games that is powered with Unreal Engine 4, showing it's potential on which the game predicts the massive physics that everyone dreamed of.  Massive amount of weapons, from harmless and innocent people up to the Military. From your powerful boot up to a ♥♥♥♥♥♥♥ pack of explosives to use for your endless carnage.   Story   While the story remains unclear of the Antagonist's hatred over humanity, it seems that the story is rather flat. The objective is clear: Kill everyone. But it's a little sticky when you don't know much of the guy's backstory even a bit for a reason why he would go carnage. Don't give me the ♥♥♥♥♥♥♥t that the guy is born to kill.   Funny thing is, the reaction of law enforcement and military forces in the area are tend to be laughable. They don't react but to shoot you and never try to find cover like you do.    Problems   Fortunately, the game got some flaws. Truck Stop Ending Cutscene somewhat glitches and forces you to restart the level again and again to get the time and spot right. It has certain lag issues, even if this PC is run way above than the Toasters would do ( Since I have a GTX Titan. ) the sync is not perfectly clear. With FPS trying to get to sixty when the game would tend to get down to 40 then 25 when it topples up to the maximum limit of destruction.  Despite that, it's either that there were too many elements that the game would handle. Or is it my problem in the Specs. Eitherway, you may experience glitches on the way. A good top-down shooter, but you'd have a terrible aim and the recoil for your assault rifles are mostly poor.   Final Score:  7.8/10.0   While it's a great game and it's goals in this game is anticipated and clear. There are problems on the way that may hinder your true dreams of carnage. The violent is too much, to be honest. But that's the game and I don't downgrade the score because of that. What I downgrade is that the issues that Hatred has.  The Difficulty of the game? Heck, even in Easy mode. You tend to have nothing to surprise yourself and you'll literally get yourself stabbed in the back by surprise. The higher the difficulty, the more it pisses you off up to the top. But hey, not bad for a challenge... Right?  Comparing the violence level of Postal. This game will make Postal a puppy of violence.   It's a great game with it's goals clear and the carnage being certain. But the game has failed to reach up to the maximum power of violence. Likely due to the laws in the US.  I don't recommend buying this game if you have a fear over the mass killing here.",
            "review_score": "1"
        },
        {
            "review_text": "It's a game exclusively made for all us kids living on the edge. 9/11 would be edgy again. FILTH &amp; GORE FILTH &amp; GORE FILTH &amp; GORE FILTH &amp; GORE     Play Slipknot or Disturbed in the background while playing this, just a personal recommendation.   It'll make the experience far more EDGY. Man do i love being edgy.",
            "review_score": "1"
        },
        {
            "review_text": "All it needs now is some pumped up kicks",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good mass murder simulator. Edge/10.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - would be a sociopath again!",
            "review_score": "1"
        },
        {
            "review_text": "You play as someone whose name is literally Not Important. Fed up with society for far too long, his waifu insulted and taste in trench coats mocked our anti-hero embarks on a code red fueled frenzy worthy of a savage weaboo. You begin your normie cleansing spree on a cold New York night. As you treat the local population to the sight and smell of your unwashed hair and attire you fall deeper and deeper into a spiraling trance of KILLING ♥♥♥♥ING NORMIES RREEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE  +Good Graphics +Fun and even at times challenging Gameplay +Open world and non linear spree killing +Cold Bitter Hatred +Not important -Can't use dakimakura as weapon -No soundtrack consisting of Linkin Park, Korn, or ICP.  9/11 would curbstomp chad's head in again.  ",
            "review_score": "1"
        },
        {
            "review_text": "'Did I ever tell you the definition... of insanity?' Well... It's this game.  I found myself playing this game when I'm angry. Oh boy... And it feels great! Now that I'm calm and thinking about what I've done, I think I might need some help. Please.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible. Awful. So reckless and insulting. Just, ugh...  'I just f****** hate this world and the human worms feasting on it's carcass.'  'It is' carcass? Seriously? People still get this wrong? I haven't been this offended since 2014. The gaming industry needs to grow up. Who cares about those wussy executions when the most offensive part of the game so far is in the intro?   I'm going to read some tumblr now. If you agree with me, please donate to my Patreon because I have to quit my job due to this trauma. Should have put a trigger warning for the merciless murder of the English language instead of virtual people.",
            "review_score": "1"
        },
        {
            "review_text": "Well. While I loved the concept, admired the art style and was looking forward to the script (I bloody love Infernal War) this is leaving me cold. It's clunky, unresponsive, badly written, buggy and has all the gravitas of an Amiga PD game from 1992. The art style leaves much of the game obscured and difficult to make out, occasionally The Antagonist seems to forget what grenades are and the words uttered after the (quickly repetitive and dull) executions are laughable, if never quite as bad as, say, Spill The Dirty Blood Of Jesus.  I *do* recommend this game, as I'll likely play a lot more (I'm hoping for some patches and performance improvements) and in my own brief correspondence with the team responsible they seem like decent guys, even if they hadn't heard any Deathspell Omega.   Put quite simply, if you're 14, have greasy hair and think Cannibal Corpse are the greatest death metal band in the world, this is likely to be your favourite game. For the rest of us, it's a broken but daft mess that will raise a chuckle in the same way a Troma movie or Rompeprop CD will. Take it for what it is, don't expect to be hugely impressed, and have fun!  Oh, and for a twin-stick shooter it's *abysmal* to play with a controller, which is unforgivable. I'll personally fight the next person who compares this favourably with Robotron...",
            "review_score": "1"
        },
        {
            "review_text": "I have been waiting for this game. I have wanted to play it so bad..and maybe that is contributing to this review..but I have to say I am severely underwhelmed. It gets repetitive, and much less of a stress reliever than I had hoped it to be. The controls are...good God the controls are terrible. I mean...just..wow. I can't even count how many times I have been standing less than a foot next to someone and putting 5-10 rounds all around them just TRYING to hit them. I have been stuck on chairs, door frames, rubble, hedges, small stones, and trees. Oh ♥♥♥♥ you you stupid damn trees. The cops are dead eye snipers, and the civilians are one of two things. either a.) Telepathic, x-ray visioned, absolute cowards, that run away screaming 'Oh my God! What's going on! He's shooting! or b.) balls of steel noodle-brained idiots who will WALK up to you saying things like 'Who are you?' and then blatantly pick up the fallen cop or hunters gun and start shooting you..meanwhile you flail around like you are on acid running into walls and getting stuck on chairs. The view is something else entirely...I don't mind the drab 'my life is all gray gray GRAY with RED BLOOD' look, but trying to find where the random shots into your midsection are coming from off screen is not entirely fun. At all. Good Lord I hope they enable Steam Workshop for this game out there because I know there are complete sickos on Steam (thank you btw..I love all of you) and will some amazing things, but wait for this game to go on sale. Sadly...thumbs down. Also, a car hit me at 3 mph and killed me. Also ran over my feet at 2 mph and killed me. Not cool.",
            "review_score": "-1"
        },
        {
            "review_text": "In Hatred, you play the role of Notten Portent, a meek and mild-mannered upstanding citizen who finds himself landed with CP possesion charges after a month of unresponsible binge fapping. Now that he must spend the rest of his days going door to door to let his neighbors know he's a registered sex offender; Mr. Portent realizes he's been given an ultimatum: Either live the rest of his days to die as a kid diddler, or die now as a legendary mass murderer.   10/10 a scathing commentary on the American Judicial System.",
            "review_score": "1"
        },
        {
            "review_text": "The art style is very good. If you like games like postal this is the game for you. Its a little glitchy and needs a patch asap",
            "review_score": "1"
        },
        {
            "review_text": "My review is not important. What is important is that this is a unique game that could appeal to people with similar mindsets as the antagonist.",
            "review_score": "1"
        },
        {
            "review_text": "If this game was a spoon it would be a very bloody spoon",
            "review_score": "1"
        },
        {
            "review_text": "It's just boring ...",
            "review_score": "-1"
        },
        {
            "review_text": "Extrem laggy, Dont buy this game, trust me, never had a such bad experience",
            "review_score": "-1"
        },
        {
            "review_text": "Live out your inner Psychopath kill all the humans!",
            "review_score": "1"
        },
        {
            "review_text": "This game had me wandering the meaning off life..... Nah Just kidding I had a boner throughout playing the game and wanked myself to sleep until I wanted to strangle myself.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game when it first came out and I thought it was fun. It was exactly what you paid for but still, it got a lot of backlash. Over the year I was always surprised to see how often this game was updated in my library. The makers really stuck with it through all the negativity and it's a mostly positive game! Good for them! They deserve it I'm sure after all of the hard work they have put in since release.",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty barebones, the only objective is to go kill people (That was expected). The camera is horrible, you can be getting shot at and not see who is shooting you because they are off the screen. All the maps/towns seem the same, just slight differences. This game is definently not worth $20, I say pick it up for $5 and try it out.   Overall, I give it a 4/10.  EDIT: Im getting a refund on the game, just in time for Steam's new refund policy.",
            "review_score": "-1"
        },
        {
            "review_text": "it used to be good game, since i like gore  but,TFW when i play this game all low set,still lag,meanwhile play gta v med-high not so lag   unreal engine 4 was a mistake...(for my laptop ghz lol )   so the cons is,this game heavy than gta v,nuff said    i've spent RP.136.000 for this game, already make it hatred itself",
            "review_score": "-1"
        },
        {
            "review_text": "It was a surprisingly fun game except it was too hard.",
            "review_score": "1"
        },
        {
            "review_text": "Well its pure genocide if u love killing thn this is for u.  Kids try this at home !    Will love to kill again 10/1o",
            "review_score": "1"
        },
        {
            "review_text": "First purchase I made from Steam in a while. Best 20 bucks I ever spent!",
            "review_score": "1"
        },
        {
            "review_text": "Well, um, ah.......  Yeah, I got nothing.  10/10 would be speechless again",
            "review_score": "1"
        },
        {
            "review_text": "NOW LET ME TELL YALL A MOTHER♥♥♥♥ING STORY REAL QUICK  THIS GAME AINT GONNA MAKE YOU GO OUT AND SHOOT UP SOME ♥♥♥♥ING SCHOOLS UNLESS YOURE A ♥♥♥♥ING PIECE OF ♥♥♥♥. YOU READ THIS ♥♥♥♥♥?! I PLAYED COOKING MAMA AND IT DIDNT MAKE ME COOK A ♥♥♥♥ING DINNER NOW DID IT? ♥♥♥♥ YOU , THIS GAME IS GREAT FOR ITS PHYSICS AND SHOOTING AND STUFF BUT ♥♥♥♥ OFF WITH THE TERRIBLE DIALOGUE  3.4/5",
            "review_score": "1"
        },
        {
            "review_text": "Most of the negative reviews appear to be expecting a heck of a lot from a $20 game. It does play like a $20 game, and you won't be disappointed as long as you understand that. It plays exactly as advertised.  Big thanks to Kotaku, Destructoid, Guardian, Polygon, and all the Tumblr SJW's for yet again bringing me to a great game by crying about how you don't like it so it shouldn't exist. Without fail, the more you whine, the better the game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game soley to help the developers because they took a stance against people petitioning it to be banned. I wasn't expecting a game with a story. It's a good time waster. 20 bucks.....I've paid a lot more for worse games that were supposed to be good and had more hype than this did so....whatever.  I'm going to list the cons first because a lot of that detracts from the game being any fun.  Cons: - The camera kills the game for me. I can never tell what my line of sight is. With it being isometric and no control over the rotation of the camera, you constantly have to guess if the AI is out from behind the wall or not coming up from the bottom left of the screen. Generally you can tell because you're being shot at. Which is my next negative. - THE CAMERA VIEW. Normal camera without aiming is absolutely atrocious. It's very claustrophobic and 9/10 times you're being shot at from off the screen. The aiming/zoom whatever they call it is very clunky cause it tends to follow where you're pointing so it doesn't work really well. Even then, you're still being shot at off screen. - Performance: It runs like butt. Even on a decently high end system. - Executions get old within the first 10 minutes. It's the only way you can revive health. So you end up having to kick people a lot to execute them and the animations get old so you end up just turning them off.  Pros: + Engine looks great even with the grey scale. + Destruction physics are a lot of fun. + Just a no thrills go to time waster.  What's the game about? Hell if I know. There is no plot really. Just some guy who's ♥♥♥♥♥♥ off with society and decides to go on a killing spree. That's it.  Your first mission is this.  Objective: Kill everyone in the police station.  Side Objectives: ~ Kill people at this spot. ~ Kill people at that other spot ~ Kill people at another spot.  That's it. It's all you do, and it's all you're tasks are, kill everyone. It's not nearly as brutal as the pre-release trailers made it seem.  So really, if you wanna waste time and just go on a killing spree, this is your game.  Sadly, realistically, the pre-release trailers were a lot more brutal and seemed fun than it really is. If they fix the camera issues, I'll revise my review, but until then, I would wait till this goes on sale for like 10 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Hatred got a lot of press and I fell for it. I picked it up because of all the hype, but looking back, I likely would have passed on this game based on looks alone. However, I pass on a lot of indie titles because they just don't appeal to me the way they once did.  Hatred's theme is dark, just like the media played it out to be. To that I say, 'Who cares?' What really matters in a game is whether or not it's fun to play, innovates at all, and sticks to its core theme or strays somewhere along the way. I will say that Hatred took a theme and stuck to it, but not at a loss.   The plot, if you can call it that, feels too familiar. We all remember that mission in GTA San Andreas where we infiltrated an army lab, stole C4, and blew some stuff up. Hatred isa re-write of that mission. In this version, instead of some straight up hood stuff, you're a troubled 20 something who feels he's been dealt bad cards by life and likely spends most of his days browsing 'teh Ch4n.'   Hatred plays like an 80's style shooter with updated graphics and little else. The weapon selection is subpar with only a few solid choices, an artificial difficulty with sending in hordes of enemies and a limited amount of respawns, and no story to grip you in. To anyone thinking this game could possibly spawn another tragic Columbine, I think we're safe for now. Hatred doesn't connect you to its character in the slightest. (Later identified as Clint Westwood)  Color me stupid, but I hoped that Hatred would connect me to a troubled character and try to make me feel the things he felt. I'm no psychologist, so maybe if just for a few minutes I could be inside the head of someone so disturbed and see what makes them tick, that would have made the game more fun for me. There are no scenes where he's picked on in high school, no bullies, no oppressive parents, or mentally abusive relationships. It's just some low-life, alcoholic 20 something with no life who goes on a rampage.   If you really want to play a 80's shooter style game, I recommend Bunch of Heroes. At least it has multiplayer!",
            "review_score": "-1"
        },
        {
            "review_text": "So... My girlfriend told me this game was awesome, so I gave it a try  Here we go.  Pros: - The game looks great, interesting style black-white with only a few colors (mostly red) - The game is addicting (not sure if pro xD) - The music is great! - Fun mechanics  Cons: - Voice acting is weak in my opinion - Aiming feels a bit weird and unstable - Driving a car feels a bit weird as well  I guess this is not really my type of game, but as long as my girlfriend for example enjoys it...sure why not?  I'm still not going to recommend this game though, sorry. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty fun, and it reminds me of the first Postal game. There's a great deal of destruction in the environment, you can even shoot holes through walls to get to the people on the other side. Explosions and fire look really amazing. For people wondering what the gameplay consists of, think of it like going on a rampage in GTA IV (not V, because V is trash), only your rampage is the entire point of the game. I think the only complaint I have is that the optimization definitely should be better. I can't even manage to get a solid 60 fps. Hopefully patches or driver updates will fix this in the future though. The butthurt brigade is openly welcome to downvote this review for recommending the game, just so long as they remember that we all get to chose what flavor we want to be. I chose to be orange creamsicle flavor, while you chose to be salty :^)))))))  Edit: The devs have been patching the game since launch, and they've added more graphics options and improved performance. I can now hit a pretty consistent 60fps in most areas with a mixture of high and medium settings.   And now for the part that normal, well adjusted, rational minded individuals can ignore: Apparently my review isn't helpful despite being an actual review for the game that gives useful information about the game and how it runs. This is due to the butthurt brigade downvoting this review because of how salty they are about the existence of this game. To anyone about to downvote this review even more because they don't like the game, I want you to know that I fully support your decision to fill your own ♥♥♥♥♥♥ with sand and then cry about it like a baby. Your tears are delicious, and you guys make everyone else look better just by comparison, so keep it up. I also encourage hateful comments towards me, the devlopers of the game, or even the game itself in the comments down below.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS MY LIFE",
            "review_score": "1"
        },
        {
            "review_text": "It's basically the No Russian mission from MW2 made into a 7 level twin stick shooter  I recommend this game for smalll children",
            "review_score": "1"
        },
        {
            "review_text": "This isn't what I expected at all, seems to boring and very very repetitive, shoot, execute, repeat. Nothing new going through the levels apart from a gun or two.",
            "review_score": "-1"
        },
        {
            "review_text": "All of the blood shed by the innocent victims have gone to my imaginary ♥♥♥♥ and given me a metaphorical hard-on. 69/10 I'll be playing this for a while.  Good job, Destructive Creations.",
            "review_score": "1"
        },
        {
            "review_text": " What you do in this game:",
            "review_score": "1"
        },
        {
            "review_text": "Its good",
            "review_score": "1"
        },
        {
            "review_text": "Despite all that controversy hooplah, the game is actually fun in the same way that Manhunt is fun, you just get to live out your sick fantasies of killing all those people you want to disappear out of your life.",
            "review_score": "1"
        },
        {
            "review_text": "Pfff.... Controls, animation , AI - all at 2/10 level. GTA 2 is better.....Someone can say: 'That isn't rewiew -you can't just compare two different games. This Game can't be another Game.' But really - if you use UnrealEngine4 for 1-2 years and say 'Look! - Me and my friends, we've done the game - Hatred! it's cool!' WOW! Yes- cool ,as learning result. Commercial product can't be at HomeVideo level. As I think.",
            "review_score": "-1"
        },
        {
            "review_text": "Played it and still don't feel like killing people 0/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice Shooter. LOL.",
            "review_score": "1"
        },
        {
            "review_text": "Meh. I didn't get very far in this game because of the ♥♥♥♥♥♥ controls. I bought this game on sale because the reviews on it were good and I heard alot about the game's development, but the controls killed the whole deal for me, so I uninstalled and refunded it.",
            "review_score": "-1"
        },
        {
            "review_text": "Would Fatal Error again...  Booted this pile of ♥♥♥♥ up, didn't expect much from it any way, and got just that, absoultely nothing, because the game wouldn't even load beyond the opening tutorial stage.  I'm running Fallout 4 on Ultra without a hitch, no FPS drops and this game won't even load.. yeah, awesome update dip♥♥♥♥♥... someone should maybe rain a little mass genocide down on the assoles who programmed this disaster.  From what I experienced from the tutorial, it's a twin stick shooter with terrible clunky ♥♥♥ controls and saturated colors... everything is black, white and grey... hurt my eyes after about 30 seconds... game is a waste of money and time any way... all aboard the hype train, choo choo.  I can't understand what the fuss was all about with this game any way, trench coat mafia is such a 90's cliche... I'm over it. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so brain ♥♥♥♥ game....",
            "review_score": "-1"
        },
        {
            "review_text": "7.5/10  A good twin-stick shooter with very little story behind it.  The graphic are pretty and there is allot of destruction  Feel like a remake of old Gta games",
            "review_score": "1"
        },
        {
            "review_text": "tommy wiseau is fed up with this world, the game",
            "review_score": "1"
        },
        {
            "review_text": "You know the arcade game easter egg in CoD: Black Ops? The top down crazy one? That's what this feels like...but imagine your character is drunk. That's what the controls feel like. Horrible. Instead of running around and screaming, the AI kind of just....casually and briskly walk away...like mindless zombies. Almost akin to the AI in GTA.  I really don't think it was interesting at all. Just pure killing pwnage. That's about it. Thought it would be a good stress reliever but it just made me more frustrated than when I started. Not worth the $20...but maybe worth it if it is on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Play as a man who is hated by his community due to him having weeaboo body pillows, brony posters, fur suits, 10 TB of pokephillia on his computer. He is so fed up he decides to take his agony on the normies on the town with guns. THe game is like Gears of Wars, its black and brown and tries to be edgy.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh. Very meh. I appreciate the hyper-violence and sadistic nature of it, but it's just sloppy. Poor design choices abound and the whole thing ends up being more frustrating than cathartic. And of course I bought into the hype of it all, and honestly... I've seen much MUCH more graphic depictions of violence in videogames countless times. This got its AO rating from being blatantly singled out and that's some ♥♥♥♥♥♥♥t. Either way, the game is pretty skippable. Lets not mention the graphics... this game is UGLY. After the forgivable first mission... it just becomes a visual mess. Maybe worth 5 bucks on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Very boring game overall, not to mention the optimization issues. I'd reccomend waiting for a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "What a beautiful, awesome piece of art this game is. The black and white really adds to the dark/evil atmosphere it presents...  SJWs, suck it and swallow, scum.",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who thinks that this game should be banned or is too violent has clearly never played GTA. It's a fun game that doesn't take too much thinking(kinda).",
            "review_score": "1"
        },
        {
            "review_text": "Funny game, if you dont take it too seriously.  But, as you know, there are people who are caused to be angered beyond their control.   They perhaps should play Metal Gear Solid 5 if they are right-handed; because that game is coded worse than this game, because only this game allows FULL KEYBOARD CONTROL Re-Mapping (Unlike MGS5), for disabled players, and/or for the left-handed, etc.  Well done Hatred; for not discriminatiing against 13% of the worlds population. We all have an equal chance with hatred.  Thats a potential 790,000,000 customers who could have an easier gaming life. ;)",
            "review_score": "1"
        },
        {
            "review_text": "A misguided prince sets off on a magical journey to learn about the power of friendship. After entering the secret code and rescuing the princess, he finally comes to terms with himself.  10/10 would Hate again",
            "review_score": "1"
        },
        {
            "review_text": "Don't bother paying for this game, I saw the trailer like anybody else and though how awesome this game would be but it's not good at all.  There are alot of bugs, boring animations, boring plot, boring character, etc.. everything about this game is boring  not exciting at all in fact   0 out of 10  would not play again",
            "review_score": "-1"
        },
        {
            "review_text": "To quote Hatred Guy 'One Nation Under Death, THIS IS THE GREATEST SHOOTER OF ALL TIME!'",
            "review_score": "1"
        },
        {
            "review_text": "One level in and I've played enough. The trailer looked like the gameplay would be much better.   -Clunky controls -Choppy gunfights - Horrible visibility due to the color - Off screen enemies",
            "review_score": "-1"
        },
        {
            "review_text": "9/10  When you get to the army base this game does NOT ♥♥♥♥ around. Jesus it gets hard...",
            "review_score": "1"
        },
        {
            "review_text": "Hatred is a top down shooter, and your mission is to kill civilians, to put it very bluntly. I don't mind that, and the sales prove that there is a market for games so edgy and violent that you can't really take them serious. It's kind of similar to Postal 1 and 2, considering how relatively easy it is to manage enemies that actually shoot back. Just like in Postal 2, some civilians will take up arms and try to fight you.  Pros: -Rather pretty visuals from what I've seen -gunplay is alright -cover works -the monologues are actually really funny -civilians will pick up weapons to shoot you -cars control fine for a top down shooter  Cons: -lots of effects like film grain and chromatic aberration, which might strain your eyes and can't be turned off right now -runs fine on i7/980, but many users with lower specs complain about poor performance and fps drops (bad performance most likely caused by the effects mentioned earlier) -movement is a little too clunky, it doesn't feel as responsive as it should -you can get stuck in furniture and between cars and walls if you're not careful -it's very hard to see weapons, so you'll have to use the ALT key a lot, which is a little awkward  Overall, if you do not mind shooting at animated textures in a video game and if you like top-down shooters and over the top characters, I'd recommend giving this a try.",
            "review_score": "1"
        },
        {
            "review_text": "4/10 Pros: Family friendly  Cons: Got stuck on the environment' 4 times Fps drops during executions Poor A.I.",
            "review_score": "-1"
        },
        {
            "review_text": "its ok",
            "review_score": "-1"
        },
        {
            "review_text": "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░▄▄▄▄▄▄▄░░░░░░░░░░ ░░░░░░░░░▄▀▀▀░░░░░░░▀▄░░░░░░░ ░░░░░░░▄▀░░░░░░░░░░░░▀▄░░░░░░ ░░░░░░▄▀░░░░░░░░░░▄▀▀▄▀▄░░░░░ ░░░░▄▀░░░░░░░░░░▄▀░░██▄▀▄░░░░ ░░░▄▀░░▄▀▀▀▄░░░░█░░░▀▀░█▀▄░░░ ░░░█░░█▄░░░░█░░░▀▄░░░░░▐░█░░░ ░░▐▌░░█▀░░░▄▀░░░░░▀▄▄▄▄▀░░█░░ ░░▐▌░░█░░░▄▀░░░░░░░░░░░░░░█░░ ░░▐▌░░░▀▀▀░░░░░░░░░░░░░░░░▐▌░ ░░▐▌░░░░░░░░░░░░░░░▄░░░░░░▐▌░ ░░▐▌░░░░░░░░░▄░░░░░█░░░░░░▐▌░ ░░░█░░░░░░░░░▀█▄░░▄█░░░░░░▐▌░ ░░░▐▌░░░░░░░░░░▀▀▀▀░░░░░░░▐▌░ ░░░░█░░░░░░░░░░░░░░░░░░░░░█░░ ░░░░▐▌▀▄░░░░░░░░░░░░░░░░░▐░░░ I like it",
            "review_score": "1"
        },
        {
            "review_text": "Edgiest video game character I have ever seen.   10/10 would gift this game to my kid",
            "review_score": "1"
        },
        {
            "review_text": "Best refund in my life!",
            "review_score": "1"
        },
        {
            "review_text": "Perfect example why guns should be legalized.",
            "review_score": "1"
        },
        {
            "review_text": "Shaky camera, dark screen, bizzare control. It's 3rd personal shooting with WASD (keypad) or L3 for sprint (controllor) which means keep pressing down left joystick on Xbox controllors. Your eyes and finger will sour before you can even enjoy this game.   There is a about 0.5 seconds delay for controllor joystick. I don't know if it is intended or just the game being buggy.  A weird bug made my character completely nonresponsive one time, right after tutorial. I had to quit and restart. Restarting the game took more than 1 minute.  Limited ammo and gernades - if this is a simply killing game, make them infinite, okay?  Idea is cool, but execution is awful. I heard this game is made by some veterans, for real?  1/10. Will refund. ",
            "review_score": "-1"
        },
        {
            "review_text": "Down with Political Correctness.  Can you feel the 'hatred' emitting from SJW's right now? It's kind of ironic ;)   One hour into the game and I don't feel like going on a murderous rampage in real life yet, despite already slaughtering 192 fools. But I forgot, violent games turn you into a serial killer and you aren't already born with mental issues to begin with so lets just blame games instead. Ok then ;)",
            "review_score": "1"
        },
        {
            "review_text": "Sick game about slaughtering people. Being isometric top-down shooter, it gave me less frames than GTA V.  Oh, and you can't rotate camera.  Controls made me suffer, almost as badly as  slaughter people   protagonist's greesy hair HUD. Press 4 multiple times to switch granade types and pay attention wich ones you have - there's no counter like they have for guns' ammo. Health bar leaves me guessing on how good character's condition is at the moment - it is just gray stripe of constant size and it turns red when that maniac wounded badly. Map. I wish there was none.  You can't drive any car, except for police vehicles, but you can kick it like 5 times and it would blow up. SWAT units could fire at you from outside the screen.  Buildings' top floors are separate locations and you can feel how these being loaded every time you walk the stairs. Aiming causes fps drops, cut-scenes too. You have ability to respawn up to 5 times in story mode. No idea how is that in line with plot of sick postal's dude-alike, who said he always wished to die violently.",
            "review_score": "-1"
        },
        {
            "review_text": "$20 is a small price to pay for all the sniffles and hurt feelers the game caused just by existing. You won't hear anyone admit to it now though, just people insisting it's boring or short and the people who buy it are suckers and edgelords. Stay mad, kids (and Doug Lombardi).",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought it was going to be a joke gamer just trying to be as controversial as possible. I still pre-ordered it because I liked that a compagny stood up against political correctness. Then I played it... I would give it 10/10, this game is extremely fun to play on the ganmeplay-side. I would definitively recommend it, especially at that price.  PS: The antagonist really needs a hug..... Vote for him about that!",
            "review_score": "1"
        },
        {
            "review_text": "The nest postal 2  but not as funny 8/10 wait a little bit but it is a great game",
            "review_score": "1"
        },
        {
            "review_text": "Everything I'd hoped for 10/10",
            "review_score": "1"
        },
        {
            "review_text": "my favorite game on steam from now on  upd:  &gt;girl begs for mercy &gt;whatever, ♥♥♥♥ you &gt;go away &gt;she picks up some pistol &gt;tries to kill me  i am now mysoginic",
            "review_score": "1"
        },
        {
            "review_text": "Crashed a funeral, killed everyone.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is glitchy for some reason, and it does'nt fully load. Please help!",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game.  10/10 IGN",
            "review_score": "-1"
        },
        {
            "review_text": "Gawd I love this game. If you love violent video games, then just buy this game. It's like Grand Theft Auto mixed with Diablo, mixed with Mortal Kombat fatalities, mixed with Duke Nukem's one-liners (But not as cheesy) all in one. It's also a game made by game developers with BALLS!",
            "review_score": "1"
        },
        {
            "review_text": "You play a delicate flower. A young spring chicken ready to blossom and take on the world! The protagonist quickly learns that life isn't so easy, but through perseverance and determination anything is possible!",
            "review_score": "-1"
        },
        {
            "review_text": "A game I like to call a 'Stress reliever' because of the killing. Yes this game could be offensive to some but in all in all the game has a cool 'story' you could say. It gets really challenging on the later missions and thats even on Easy. So yes again the game may be offensive but it does give off a good challenge and its really fun. So why not give it a try?  10/10- Would get run over by a poilce car again.",
            "review_score": "1"
        },
        {
            "review_text": "I havent had much time to play this game as you will see from my playtime, but as of right now I am enjoying it, the game isnt perfect but its not an AAA title nor is it priced at £50, its £15 and I think we can all agree we werent expecting a masterpiece here.  The destruction is great, shooting innocents and cops is fun, and all their screams make it pretty realistic. The controls take a bit of time to get used to, and at times aiming indoors can be awkward, but you can kick down and execute people instead in those situations.   Overall a fun game that I find best to play in short bursts when you just wanna shoot some people up.",
            "review_score": "1"
        },
        {
            "review_text": "I like to think that this game could be sum up by a quote from John Carmack, 'Story in a game is like a story in a porn movie. It's expected to be there, but it's not that important.'",
            "review_score": "1"
        },
        {
            "review_text": "This game is a white kids Fantasy",
            "review_score": "1"
        },
        {
            "review_text": "9 out of 11 would commit Mass genocide again",
            "review_score": "1"
        },
        {
            "review_text": "Good game.  + pros video 9/10 greyscale audio 9/10 missed some hardcore musics. screams etc. Gore 10/10 yeaah blood bloood blooooood! moooaarrr blooood! gameplay 8/10 sprint and jump sometimes lacking. performans 10/10 with maxed out settings.  -cons sometimes keyboard mouse stalls freezes. 'restart load save fixes this' not every weapon has ammos around map. sandbox repeating kill run kill explode execute kick actions. i hate flash grenades. and specops  ",
            "review_score": "1"
        },
        {
            "review_text": "Had this game for awhile haven't beat it cus it is really hard but it is so much fun to play as a bad guy in a video game for once.",
            "review_score": "1"
        },
        {
            "review_text": "Hatred.........Well i have to say i have not played a game quite like it. Its brutal reputaion did live up to its name. I have to say im gonna approve this one.   Pros: 1. Its quick/fast paced 2.Lots of Objective to keep busy  3.Good Gritty feel (if you like that kind of look in a game) 4.Action packed (Run'n'Gun, Violence, Destructive Enviroment, Blood/Gore) 5.Not a game for the faint hearted 6.Good Gaming-Engine and Fairly good Graphics  7.Good game for passing the time and just want a shoot'em up  Cons: 1.Short Gameplay (Me Three hours to complete) 2.Repetitive (That con is up to you or if you like repetitive) 3.Lacking of story-line 4.Slight problems with Camara Angles sometimes 5.Bad FPS/Gameplay for low-end Computers 6.Not worth the purchase 7.Has its boring moments   I really dont have much to say on this game other than (in My Opinion) has lived up to its reputation. The gritty gore fest of a man on a mission to Kill/Execute Everyone with no mercy and with out guilt. You will shoot Civilians, Law-Enforcment and the army. If you get put off by the death of countless innocent people then do not purchase. Its a Good Brutal Violent Action packed hell of a game! BUY ONLY IN A SALE!",
            "review_score": "1"
        },
        {
            "review_text": "Good luck trying to aim in this game with controller its soooo bad. Keyboard and mouse only way to enjoy this game",
            "review_score": "1"
        },
        {
            "review_text": "In real life, I'm a nice guy. I show others respect and consideration. I would never think of hurting someone unless it was to stop them from hurting myself or someone I care about. That being said, within the parameters of a videogame, I can be quite vicious. Vicious enough to thoroughly enjoy Running with Scissors' original game 'Postal', which made its debut in 1997. The expansion pack which followed, in addition to the sequels, were crippled with elements of self awareness and parody, turning it into a joke which paled in comparison to the bleak, nihilistic mindset of the original. About a year ago, I wrote Running with Scissors urging consideration of a remake, one that recaptured the initial vision with modern cutting edge graphics. I seriously doubted that such a remake would ever be in the making. Much has changed since 1997, a year in which most people had never even heard of Columbine.   Now, I'm nowhere egocentric enough to think that someone acted on this letter, but it's a good illustration of how others were having similar ideas. The result is Hatred, and it's a spiritual sequel to Postal. Right down to the anonymous maniac, the isometric perspective, and the executions. In many ways, the game surpasses Postal in brutality. For instance, first aid kits are nowhere to be found. The only way to replenish health is to execute victims writhing in pain on the ground. And while Postal kept the three-quarter perspective for an execution burst of gunfire to the head, Hatred switches to a close-up sequence in which your character will randomly act on a wide range of gruesome options. You can commandeer vehicles, kick in doors for a home invasion, and inflict a wide variety of damage to the surrounding environment. Perhaps the most effective decision in game design involved the use of color. Or rather, the lack of it. In a nod to Sin City, the world of Hatred is in black and white. The only color seen is linked to destructive acts: a fire, an explosion, a spray of blood. This has the effect of making the violence all the more striking. Simply put, Hatred is the Postal successor that Running with Scissors either could not or would not make. It surpasses it in almost every way.  Almost every way. And there lies the flaw of this potentially good game, at least if you're planning on playing with a mouse and keyboard. I haven't tried it yet on a twin stick gamepad. Here's the problem. In Postal, I would link my left and right strafing ability to the keyboard. My other hand would be controlling the mouse, where forward and backward motion were linked to the middle and right buttons. Actually moving the mouse from side to side would cause the character to turn in a 360 degree spin. Wherever your character would be facing when you stopped the spin determined the direction of your next action, whether it be forward, backward, or a strafe.   In Hatred, movement of the mouse likewise turns your character. However, the direction your character is facing does not determine the direction you will actually take when you move. Instead, forward is always going to take you to the top of the screen, backwards towards the bottom of the screen, strafing to the left and right. This... is... CONFUSING. I'm still attempting to get used to it. Perhaps I will. And to be fair, it makes some new moves possible, such as the ability to move and spin simultaneously while firing. Ultimately, however, this one factor ruins the game. Game control should be intuitive. Not so here. It's a mess. It took me thirty minutes before I finally managed to maneuver my way through the tutorial. Too bad. And over something so simple. I can only hope that someone mods the control scheme to the original Postal. Then we'll have something.  ***UPDATE 3/3/16***  I stand by my original statements regarding the control scheme, and still think that the game would benefit if it were changed. Since the game is essentially a Postal remake, it would have been nice if that game's control layout had been included. However, I did eventually get used to these controls once I was able to wrap my head around the concept. During intense firefights it's still possible to get them mixed up, particularly when simultaneously maneuvering through obstacles, but it is no longer a frustrating experience. To be fair, this game IS described as a twin stick shooter, and use of a controller makes the gameplay more intuitive. However, it does not provide the surgically precise aiming that a mouse offers, and a mouse/keyboard combination will simply require a moderate learning curve. Once mastered, recommendation of the game comes down to one point: If you enjoyed the original Postal, you are likely going to LOVE this twisted little jewel that seemingly arrived straight from the bowels of mass murder.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to be a killer? Have you every had a thirst for blood? If you said yes, then buy this game Hatred for only $9.99 you can kill all murder all and have fun doing it! so dont wait act now and start your genocide TODAY!!!",
            "review_score": "1"
        },
        {
            "review_text": "You play a delicate flower. A young spring chicken ready to blossom and take on the world! The protagonist quickly learns that life isn't so easy, but through perseverance and determination anything is possible!",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesn't run. You need a NASA computer just to run the damn game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game to relieve yourself of your anger.",
            "review_score": "1"
        },
        {
            "review_text": "A classic topdown isometric shooter, the game plays smoothly in highest settings. I have a few gripes with this title. This is definitely not a game you play for story, so that leaves you with gameplay and that is something that is sorely lacking.   Making enemies more difficult or levels more crowded does not make progressing through them feel like progress, more like grinding. Each level feels the same as the last one with no real progress between them.  You are a psychotic murderer and had you died at the beginning you'd been no further ahead than dieing at the end. This is a run and gun with little more to offer. This inability to relate to the psychotic murderer with his disingenious 'hatred' leaves you deflated for the experience.  This is hatred for people who do not understand hatred.  All in all, I'd recommend the game when it's on sale as long as you don't purchase it expecting to get more than a run and gun isometric shooter.",
            "review_score": "1"
        },
        {
            "review_text": "you play as a metal rock enthusiest that decides to releve the public of their stresses and issues",
            "review_score": "1"
        },
        {
            "review_text": "I only bought this game because the Mainstream Media told me about it.    Runs like crap for being black and white though.... Still fun if you don't take it serious.",
            "review_score": "1"
        },
        {
            "review_text": "I just had to get this to see if it really was as bad as our 'oh-so-accurate' media says it was.  Obviously its not, i felt worse in the old top-down GTA's shooting people, i definetly felt worse doing it in GTA V, where NPC's tend to walk around, do and say stuff, giving them some humanity, in Hatred the overall lack of context makes me feel akin to when im gunning down hordes of bugs in Helldivers, just a top down shooty dakkafest which is alot of fun in short bursts, sure the executions are pretty brutal, and the people actually seem like people not just targets when you do one(speaking directly to your hair since they cant see his face), but the hilarious and insanely over the top one-liners after each one... i cant see how anyone would take it seriously.  If your a fan of any game in which you cause ridiculous chaos, you might just get a massive kick out of this.  ",
            "review_score": "1"
        },
        {
            "review_text": "Good, mindless fun. Hatred is the equivelant to 'Postal' in the early 21st century. While it's content is... dark, it's slickly done visually. My only negatives are that it runs terribly without dumbing down the graphics a little, and the controls could be better. I had more luck with a microsoft controller than a keyboard/mouse combo, but it's still difficult to target when you get into a chaotic situation. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Pro: Good graphics, you can destroy structures with grenades, bullets also damage the enviroment.The game is full of hate and killing and if you are not a bit f***ed up you wont enjoy it. It has a bit of fps problems, but with a decent pc you will be fine:D",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game.I would give this game a 8/10 , but the terrible controls make it a 7/10.  Pros:Gore , fast paced , destruction physics are amazing , cool weapons , hard , controversial , makes annoying people cry and shout , beautiful scenarios Con:Short(6hours , terrible controls even on keyboard).  I will keep following this devs",
            "review_score": "1"
        },
        {
            "review_text": "Game is difficult and not in a good way. Mechanics handle bad, impossib le to tell what waste high scenery can be jumped over and which can't. This game just cashed in on controversy. Wouldn't reccomend.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 for the edgy antagonist  Highly recommend if you are an angsty teen who just hates everything, worships the greats Klebold and Harris, and wants to see the world burn plus don a trenchcoat with dethklock hairstyle and edgy attitude. Unleash the Hatred!!!!!!! jk this game is almost like a modern day version of a game called Postal so it plays exactly like that game and it definitely doesnt take itself serious, its like an exploitation film video game that tries so hard to be edgy but I really didnt see the controversy in this game but I guess its good for saying 'Ooo I have an adult rated game, Im so edgy!' or whatever",
            "review_score": "1"
        },
        {
            "review_text": " Performance:  This game is atrocious performance wise. I'm getting rather annoyed with developers releasing games that can't maintain a decent level of performance. In some areas game runs 50-60 FPS. In a lot of areas, especially those with a lot of AI performance tanks. Police station it's very noticable. I'll drop from 55 FPS down to 25-30 FPS in certain situations. Developers simply aren't optimizing their games anymore and are releasing trash left and right. Turning shadows completely off helps a little but doesn't solve the issue at hand.   Gameplay:  Fun concept but that's pretty much as far as it goes. I really enjoy the rustic feel to it (black and white) and who doesn't like running around killing massive amounts of people for no reason? I used to play Grand Theft Auto for this reason. Mass killing. But when the performance tanks it ruins the entire game.   Would I recommend?  ♥♥♥♥ no. Fix the performance issues and I might reconsider rewritting this review.",
            "review_score": "-1"
        },
        {
            "review_text": "The Most Satisfying Game I Have Ever Played. The entire experience kept me guessing the whole way through. I have never seen or played anything like it in all my life and I only hope there will be more like it. I praise this game. I am so glad to have been able to play this. I enjoyed every single thing about it.",
            "review_score": "1"
        },
        {
            "review_text": "Basically school shooting except it's everywhere but school. 9/10 grayscale is a great concept but it can be hard to see where the reticle is sometimes. Game is amazing.  /#/#/TRIGGER WARNING/#/#/  Dialogue is so edgy it's almost unbearable. ",
            "review_score": "1"
        },
        {
            "review_text": "this game is good, but do not bother contacting the develpoer as they are about as clued up as a nun about anal sex. i had to request a refund as it would not start to play, because i accidently changed screen percentage to 400 and playing with a 980ti, in the end rebrought and went into the settings folder and played around with some settings to get it to play again. will now start to play it again, but let down with support..",
            "review_score": "1"
        },
        {
            "review_text": "Forewarning: I have not yet beaten this game. If you think that discredits my opinion on this title, feel free to stop reading at any point.  Anyone still here: Hatred, as most Steam users probably know, is a highly controversial isometric twin-stick shooter with a unique Sin City-inspired visual design that has garnered far more attention for its tangles with the ESRB and Steam, as well as its content, than it has for its merits as a game. So, how is it as a game?  To be fair, this isn't my normal kind of game. I don't play many twin-stick shooters, so I'm fairly new at this type of thing. I am also primarily a console gamer--I play on both Playstation and Xbox, with my laptop mainly being used for listening to music and playing Rollercoaster Tycoon. So I'm approaching this green as can be--I'm a filthy console gamer new to PC, I'm not much into twin-stick shooters, and my Steam account is brand-spanking new. Take everything I say with a grain, nay, a ♥♥♥♥ing barrel of salt.  I like it.  With a concept like the one Hatred carries around, this was always going to attract criticism, something the developers obviously knew. You play as The Antagonist, a man who hates the world and all people in it, probably including himself, and the object of most levels is to flat-out murder as many innocent civilians as possible. The effect is initially somewhat shocking, even knowing what this game is ahead of time. Following the tutorial, when The Antagonist takes his first steps out into his neighborhood and starts firing rounds, it definitely got me a bit 'oh, ♥♥♥♥...'  That all said though, this game isn't nearly as nefarious as people have made it out to be. It's CLEARLY tongue in cheek, unless you're deliberately fighting that aspect. The game's tutorial made me laugh out loud, instructing you on how to move around, jump over obstacles, shoot at targets and throw grenades....and then, before you leave the tutorial basement, you're instructed, in a very videogame way, to 'kill your drugged captive'. I snorted, it was so genius. Also adding to the tongue in cheek feel, your protagonist looks and talks like Nathan Explosion went to emo school, constantly growling lines like 'And who ♥♥♥♥ing cares?' and, even better, 'Only my weapons understand me.'  In terms of gameplay, things are fine, if a bit standard. Weapons feel good, aiming feels good, etc. One thing Destructive Creations should have improved is doorway entry; The Antagonist definitely likes to get hung up on doors. Also, and this is a frankly unacceptable oversight, this is a largely black and white game where your target reticle is white. So it's FAR too easy to lose sight of your reticle during, say, a hectic fight with the military. Why they didn't make it red, I'm not sure, but they didn't, and it's just a silly thing that causes way more frustration than necessary.  Though I imagine most probably don't care about the story in a game like this, I feel like I should say it's fairly toss. It's basically a thin string of events to tie the levels together. That's fine, to be honest. It means we never learn much about The Antagonist, and that's really for the better, since if this guy was anything more than a charicature, it would probably become too silly.  So basically: this is a short, fun game with a brilliant art style and some minor gameplay flaws. I got it on sale for $11, and I'm satisfied with it for that price. I may not have been at $20, but I suppose it depends on your genre preferences. People need to lighten up. The developers of this game clearly knew what they were doing, and the tongue-in-cheek nature demonstrates that every step of the way. Check it out if you're into this sort of thing, or even if you just want to see what all the fuss was about.  7/10  Two side notes: If you are a fan of death metal, it would appear the developers are as well--I'm not sure of the specifics, but apparently they set up some sort of show with the band Decapitated, and if you're a metal fan, it's always worth supporting the community, so thanks to the developers there.  Also, on a downer--the game appears to be fairly poorly optimized. Granted, my laptop isn't the greatest, but this is really kind of a crapshoot. Sometimes the game runs absolutely flawlessly, other times it's borderline unplayable. This seems to have nothing to do with specific levels or activities. Just a note.",
            "review_score": "1"
        },
        {
            "review_text": "You must try the ISIS mod",
            "review_score": "1"
        },
        {
            "review_text": "the most brutal and edgey game on steam",
            "review_score": "1"
        },
        {
            "review_text": "this game doesn't pull out any stops to be as edgy and 'in your face' violent as possible.",
            "review_score": "1"
        },
        {
            "review_text": "Postal-like shooter. Great for short term relaxing sessions, but gets boring fast in longer sittings.",
            "review_score": "1"
        },
        {
            "review_text": "Its repetitive, story is plain and predictable.. but you keep playing to the end and maybe extra because its ridiculous and like the postal games that preceded it the game give some sick satisfaction",
            "review_score": "1"
        }
    ]
}