{
    "app_id": 341950,
    "name": "Lux Delux",
    "release_date": "2015-05-01",
    "developer": [
        "Sillysoft Games"
    ],
    "publisher": [
        "Sillysoft Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Board Game"
    ],
    "achievements": 27,
    "positive_ratings": 175,
    "negative_ratings": 55,
    "price": 6.99,
    "description": "Lux Delux is a fast-paced turn-based-strategy game of risk and world domination, with so much more! Highly moddable, Lux has over 900 maps, diverse random map generators, a biohazard mode, an AI SDK, and an online multi-player league.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/341950/header.jpg?t=1496362802",
    "minimum_requirements": "OS: Windows 98, XP, Vista, 7 or higher Processor: 1 Ghz or faster processor Memory: 512 MB RAM Storage: 350 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Decided to delete and rewrite my review since Lux Delux has roughly about 73% of Steam users who have purchased it gave it an upvote, meaning, the remaining 27% downvoted the game. First off, I went and read all the negative reviews, sure there are graphical glitches I'll give them that. However, the claims: there is other games better; its terrible; not worth it; a rip-off; free flash game; are in my opinion false claims. First off, there are only two other Risk type games on Steam besides Lux Delux. One of them is by Hasbro and is just called Risk and uses the standard Risk board without any online multplayer support except for hotseat. Then there is Risk: Factions by EA which does have online multiplayer but is otherwise buggy and playing the original Risk isn't all too intuitive as it uses assets from the factions part of the game breaking the immersion. Not to mention the constant multiplayer crashes and disconnects. Then there is Lux Delux which features 900+ maps and online support and two additional game modes. Again, yes occassional there is a graphical glitch, but the game is created in a 2-D flash-esc style. It's mostly composed of decals, which fits the game perfectly very much like Risk by Hasbro. Not only that, but the game doesn't crash and is very easy to get into.   Although, to be fair there is not a proper tutorial except for a small guide in the options menu giving you a quick idea how to play the game. What I am trying to say is Lux Delux is more for players who have played Risk before. If I may add one complaint, it would be that you cannot see the dice rolls. In better terms, two dice are rolled if you are defending and three dice are rolled if you are attacking with an army with more than three troops in it. Of course, a die has dots representing numbers 1-6. However, these numbers happen in Lux Delux instantanously. Basically, you don't get to see the roll all you see is an explosion of colours and the outcome of the attack or defence. You'll know if you conquored/defended the territory if your forces are still there. I believe the idea behind Lux Delux was to make Risk feel very fast paced and more than likely designed for expert Risk players who do not care to see what the roll was. To be honest, it really doesn't matter the roll is, its all probability, whenever you are attacking you risk losing all of your troops anyways to a bad roll. However, seeing the outcome of the dice roll gave the Risk game a certain asthetic that I think a lot of players like me enjoyed seeing. If the dice roll was visible it would also help out new players tremendously understand the game. If you don't understand Risk you can always google or leave a question on my profile's comment section.  To conclude this review, I believe its the best Risk game available on Steam, as mentioned invisible dice rolls does take away a little away from the asthetic traditional feeling of Risk, but Lux Delux makes up for it with its 900+ selection of maps and additional game modes. Fair warning though, if you aren't into decal/2-d style graphics then stay away from the game, but don't punish it with a bad review because you didn't like the way it looks. In a way its sort of like a Wargame, it's meant to have a paper-like/boardgame look to it.",
            "review_score": "1"
        },
        {
            "review_text": "The risk game you never knew you wanted until you play it; the premise is simple, it's risk with hugely impressive modding capabilities, the maps can play uniquely and there's plenty of AI around as well you can customize to your liking. Just when I thought I wasn't all that interested in risk, I picked this up in a humble bundle and definitely don't regret it at all, the maps are incredibly fun to play on and the special rules involved with them make each game unique, the game still ultimately comes down to chance but the amount of strategy involved here is a great deal more than regular risk. definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, I love it.   Can't recommend it because of this really annoying DRM. I constantly get an error telling me that my steam account can't be verified. Need to launch the game &gt;10 times to actually get it to work. So annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "Plays a lot like the Risk board game except with lots and lots of maps, someof which are made by the community. Strangely addicting, frequently find myself playing much longer than intended, and oddly relaxing for me. I just zone out and take over the world using different starting senarios.   Totally simple and fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is Risk. With many many maps for a variety of themes, and the ability to easily get more of them. The interface is good. While the graphics are not remotely impressive or memorable, they're not bad. The AI has significantly more customization than just 'easy-&gt;hard', so that's really nice.  In the end, if you want to play Risk on a computer, you want this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best version of the originaly game risk, despite haveing played very little of this game on here, I've played so much on DRM and iOS that I would reccomend it to anyone who has ever enjoyed a game of risk. Im glad this is on steam and I will be playing it a lot more soon. It has some great mechanics and multiplayer that makes Lux Delux what it is. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game similar to R.I.S.K. with some interesting differences. There are a ton of different options to changes, plugins, and maps to choose from. One downside for me is that the game looks a little blurry and has bars on the side for my widescreen 1440p monitor, (all except a few maps do the border thing for me). But for me it is worth getting because the sandbox elements are very fun and there is plenty of content that makes it well worth 10 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "I still remember when I played Risk the first time in my life. I was seven years old and I played it with my friend from Spain on the floor of his huge child's room.  Since then I played it together with different people in different versions. As classic board game but also as pc game.  I was really happy to see it in this new look with the fast-paced gameplay mechanics. So I played it versus my wife.  After a while we discovered that this isn't a tactical game at all. It only pretend to be.  This game is broken in a really hideous way. The player who is able to attack first, always wins the match. Does not matter what player number two does.   It's running like this:  -Everybody placing his troops -Player#1 gets 15 extra units and attacks first. Gets bonus points and destroys half of the army of Player#2 -Player#1 wins   TLTR:  If you're the player #1 who is able to attack first, you win. If not you lose. Always.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a fan of strategy games this is a very nice treat. It may seem simple but it definitely give a lot of fun. Game allows you to get additional maps which basically means you can replay this over and over.",
            "review_score": "1"
        },
        {
            "review_text": "Puts you staight into the cluster♥♥♥♥, no tutorial, no explanations.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a buggy pile of garbage. It was first released more than 10 years ago. There used to be an active community of online players but they're mostly gone. The game's owner is just using greenlight to squeeze out a few more bucks.  Don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Lux Delux is a game of chance, indeed. I reccomend that one would learn all the A.I. (Yakool is a complete ♥♥♥♥♥♥♥), so one can learn their weaknesses. One thing the developers botched, were the victory quotes I mean ♥♥♥♥ING 'The cow goes... Lux.' Pathetic, and quite annyoing seeing road-side crap whenever I spend 10 minutes securing Europe, and getting nothing back. Yes, this is a fun little game, and it's full of rage (When 5 of your men are destoryed to 1 of your enemies). But I recommend it if it's on sale.",
            "review_score": "1"
        }
    ]
}