{
    "app_id": 342260,
    "name": "Nevermind",
    "release_date": "2015-09-29",
    "developer": [
        "Flying Mollusk"
    ],
    "publisher": [
        "Flying Mollusk"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Psychological Horror"
    ],
    "achievements": 17,
    "positive_ratings": 241,
    "negative_ratings": 82,
    "price": 15.49,
    "description": "Nevermind ushers you into dark and surreal worlds within the minds of trauma patients. When played with biofeedback technology (via a standard webcam and/or supported heart rate sensor), Nevermind picks up on indications of fear—lashing out if you allow your feelings of anxiety to get the better of you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342260/header.jpg?t=1510258142",
    "minimum_requirements": "Минимальные: ОС: Windows 8 (64-bit) Процессор: i5 5000 series @1.6 Ghz Оперативная память: 4 GB ОЗУ Видеокарта: Intel Iris Pro Graphics 5200 DirectX: Версии 11 Место на диске: 5 GB Дополнительно: Familiarity with WASD controls is encouraged. Nevermind is playable on Windows 7, though it is not fully supported (e.g., Bluetooth sensor devices will not work on Win7). RealSense™ functions are operational on min spec machines, however RealSense™ heart rate detection may not work on some low/min spec machines.  For best results with RealSense™ heart rate detection, play Nevermind on machines with NVIDIA GeForce GTX 800 series graphics cards or better and processors with speeds of 2.50 Ghz or better.",
    "recommended_requirements": "Рекомендованные: ОС: Windows 8.1 (64-bit) Процессор: i7 4790 @3.6 Ghz Оперативная память: 8 GB ОЗУ Видеокарта: GeForce GTX 750 TI DirectX: Версии 11 Место на диске: 5 GB Дополнительно: Familiarity with WASD controls is encouraged. Nevermind is playable on Windows 7, though it is not fully supported (e.g., Bluetooth sensor devices will not work on Win7).",
    "reviews": [
        {
            "review_text": "$20 for a 2hr game?  Only 2 'clients available' and not listed as early access?  Entertaining but overpriced and way too short.  The promise of additional content should class this as early access.",
            "review_score": "-1"
        },
        {
            "review_text": "Really nice VR Implimentation. Some of the puzzles you have to use the headset to aim, like with the postcards, which was a bit disapointing. But some objects can be picked up and it has room scale. This type of game translates really well into VR and I have been very impressed so far. Without VR or at full price I would think before you jump in. But if you have a Vive or a Rift and this is on sale its a no brainer.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not an 'horror game', it can't be called like this, it's a game where you have to think.  It's more about psychological and thinking, if you like games where you need to think, I recommand you this game, whatever you like or not about horror I really don't like horror games ans horror movies, but I do love this game Get ready to have really strong emotions there. Again, this is psychological, not a game full of zombies or whatever monstrous  You will play as a 'psychogist' trying to understand trauma of patients, so it's a subconcious theme for environement (so it's 'that' kind of horror)  To speak about the game himself, at the beginning I was afraid of the graphic quality but it evolve when you go forward in the game... To become really immersive and cool  The gameplay is really simple but really efficient, you can play with additionnal specifical devices (which is awesome by the way). No bug found, even if sometimes you think there is one, indead it is part of the game play (you know, dreams, think differently...)  So, any defect on this game ? Sure... How did you do this bad trailer with this fabulous game ?!? C'mon, tell me, did you let that entire work to an intern... You don't need weeks to end this game, but for this price, we couldn't expect a 100h game, that's fair  Nevermind, I'm really restless to the idea to have a Nevermind 2 !! Best game since Portal 2",
            "review_score": "1"
        },
        {
            "review_text": "In Nevermind i completed both of the client's storys and was kinda disapointed... i seen soo much potential here with the storys and gameplay i wish there was an inbetween button for recommend because its not horrible but its not great... Hopefully they stay true for what i have read and give more client's cus as for now its not worth the asking full retail price.  AMD 6300 6 core 16 gig Ram EVGA gtx 960 FTW edition FPS 60-1XXX (no v-sync)",
            "review_score": "-1"
        },
        {
            "review_text": "p short.. would be more worth it if more stories could be explored",
            "review_score": "1"
        },
        {
            "review_text": "Not working properly with low FPS on windows 7. Works ideally only on windows 8.",
            "review_score": "-1"
        },
        {
            "review_text": "it's not horrid but it's SLOW, boring, and nothing more than a walking sim  Some might find a deeper meanig for this game...but I almost fell asleep while playing it",
            "review_score": "-1"
        },
        {
            "review_text": "I finished the game and then some in less than three hours, so I would definitely wait for a sale before buying this full price. This is a really well done psychological horror, and though I have a heart rate monitor, it doesn't have a USB. For shame! Still, my computer was super laggy playing this, even on the lowest setting. Perhaps it's better that I didn't have the monitor on top of it all. The environment designs are super cool and effective. It's like Silent Hill's symbolism meets American McGee's Alice in designs with a dash of Paprika as a storyline.",
            "review_score": "1"
        },
        {
            "review_text": "I finished the game and then some in less than three hours, so I would definitely wait for a sale before buying this full price. This is a really well done psychological horror, and though I have a heart rate monitor, it doesn't have a USB. For shame! Still, my computer was super laggy playing this, even on the lowest setting. Perhaps it's better that I didn't have the monitor on top of it all. The environment designs are super cool and effective. It's like Silent Hill's symbolism meets American McGee's Alice in designs with a dash of Paprika as a storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Played it in on monitor and then in VR, both without heart rate sensor. It's amazing game.",
            "review_score": "1"
        }
    ]
}