{
    "app_id": 342230,
    "name": "Air Guardians",
    "release_date": "2015-01-28",
    "developer": [
        "Lazy Bum Games"
    ],
    "publisher": [
        "Lazy Bum Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 70,
    "negative_ratings": 87,
    "price": 0.79,
    "description": "Air Guardians is a flight combat game set in the distant future. A world government is attempting to seal their grip on power, and an air force of advanced fighter craft is called upon to fight them. Fly through several different levels, with cut scenes between missions and in game narration.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342230/header.jpg?t=1447366899",
    "minimum_requirements": "OS: Windows XP+ Processor: CPU: SSE2 instruction set support. Memory: 1820 MB RAM Graphics: Graphics card: DX9 (shader model 2.0) capabilities Storage: 1820 MB available space Sound Card: Sound card required",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7 Processor: Intel(R) Core(TM) i7 CPU Memory: 1820 MB RAM Graphics: AMD Catalyst driver Storage: 1820 MB available space Sound Card: Sound card required",
    "reviews": [
        {
            "review_text": "For a one man show, that is a pretty decent game and it is only 5 dollars. Mouse controls need to be changed while playing the main game under the esc menu and controls. helps a bunch. Interesting physics, speed is required for maneuverability. Game updates have come that keep improving the game.",
            "review_score": "1"
        },
        {
            "review_text": "There isn't much to Air Guardians, but there there is, is actually decent. There are six brief missions, with only the last two really changing things up. You have three weapons, all with unlimited ammo, meaning the only thing you have to manage is your health, which will slowly regenerate. You can blaze through the game in about an hour without much frustration. If you want to fly around and blow stuff up for a bit, this game will do the job, just manage your expectations.   A difficulty select or a skirmish mode would have gone a long way to adding to this game. As is, know that you're getting an arcade flight sim that's an hour long at best. I wished there was more to play, which I suppose is as good a recommendation as anything.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game overall  Pros:-cheap  -simple  -fairly straightforward  -fun to be a plane  Cons:-controls are a tad clunky  -story/voice acting are mediocre at best  -the 'map' is effectively a single flat texture  6.5/10 Entertaining game that is definitely worth the two quid",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game...but needs a LOT of improvement. Let me go through the pros and cons: Pro's: fun gameplay action packed good-but short- missions decent graphics-runs very well on a low level laptop or pc...i would know...  Con's The 'ground' is nothing but a flat texture small unit variety-both of friendly and hostile units (3 friendly types of ship-fighter, cruiser and heavy cruiser, 4 hostile ship types-Heavy cruiser, cruiser, fighter and bomber) up/down controls are inverted by default and cannot be changed (to my knowledge) missions are too short campaign...is WAY to short, consisting of only 8 missions little/no story  missiles occasionally phase through enemy ships bug where if you swap from minigun to missiles while firing, missiles fire, but minigun firing sound is still active. enemy fighters only use missiles to attack you and friendlies enemy bombers literally have NO defence against you and rely solidly on their fighter cover...which have a hard time shooting down a single alied fighter  Basically, well made game, and has the potential to become amazing, but needs a LOT of work to reach it's full potential.   To any that read this, I'd reccomend it. If the developers read it and are still working on it, youve done well-extremely well, but please add more!  Thats all I have to say for now, sooo erm....bye",
            "review_score": "1"
        },
        {
            "review_text": "The game does not quite bad Interesting futuristic aircraft models and landscapes  Игра весьма не плоха Интересные футуристические модели самолётов и ландшафтов",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing in my opinion, i really like massive scale battles and this just has it haha, the only down side is that mission 1 is quite hard and there is only 5 missions but for a game with low budged and only costs 2 dolars its great!",
            "review_score": "1"
        },
        {
            "review_text": "Is this Frances air force? Sorry, i had to. Anyway, for real the steam controller isnt worth a darn, u can remap the controls but they still suck. Dumb fire and proximity missisle are essentiallly the same, its really hard to even control the craft. On the first mission i flew around firing missiles and guns hitting nothing, and then in 5 minutes i got a mission accomlished!!! So doing nothing you can beat the first mission!?!??! Meh, needs work, good first attempt, like the premise, but lack of weapons, controls, and upgrades leaves it at about a 15min play at best.",
            "review_score": "-1"
        },
        {
            "review_text": "PIECE OF GARBAGE PLAYS LIKE A TURRET GAME.... ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is more of a demo than anything else. It seems to lack essential options such as flares and boosting, leaving you unable to get rid of missiles that have locked on. They will eventually gnaw away at your health (which regenerates slowly), your only hope is to destroy the enemy before you're down to your last hitpoint.  The enemy isn't very difficult to defeat, there are simplya lot of them and aiming your weapons is somewhat difficult as there is no indication of a lock nor any indication of how much you have to lead your target.  I couldn't really recommend this game. It's somethign you would expect to be open source so that people can improve upon it rather than milk it for what it isn't worth.",
            "review_score": "-1"
        },
        {
            "review_text": "Dev, if you are reading this; PLEASE, PUT MORE EFFORT ON THIS THING, I KNOW YOU CAN DO IT!",
            "review_score": "-1"
        },
        {
            "review_text": "Bad controlls, the map is usless while trying to find your targets. Like it suppsoet to be in front of you but you dont see it while there is a red dot on the damn radar right in front of you. also the radar is 2D, no way to know if the target is above or below you. The 'plot' is not really a plot (you start a normal patrol, a sec later you are beeing haild by unknown force, when things start to heat up while both you and the other force trying to figure out what to do, you loose communication, so what the first thing you do? thats right, you are ordered to kill them all). there are no physics in the game, up or down, its all the same, no air drag, no lift speed reduction, no dive attacking. voice act is horrible!  2\\10, a cheap game to get for your 8 y/o if you want him to get bored after a day at best...",
            "review_score": "-1"
        }
    ]
}