{
    "app_id": 342300,
    "name": "Zombie Kill of the Week - Reborn",
    "release_date": "2015-03-13",
    "developer": [
        "Still Running"
    ],
    "publisher": [
        "Merge Games",
        "Tagstar Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Zombies"
    ],
    "achievements": 31,
    "positive_ratings": 736,
    "negative_ratings": 63,
    "price": 4.99,
    "description": "Zombie Kill of the Week - Reborn is a challenging, fast paced, 2D survival shooter! Featuring a compelling single player survival mode and cooperative multiplayer for up-to four players, this is one zombie firefight you're not going to want to miss!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342300/header.jpg?t=1478024009",
    "minimum_requirements": "OS: Windows 7, Windows 8 or Windows 10 only Processor: 1.2GHz processor Memory: 2 GB RAM Graphics: Dedicated graphics card with 128 MB memory Storage: 30 MB available space Additional Notes: Xbox 360 / XInput controller, Screen resolution of 800×600 (or bigger) recommended. 5MB/s download and upload speed needed for online multiplayer.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I can do this with my eyes closed !!!  In Zombie Kill of the Week you play as a badass dude who tries to survive as long as possible in vary stages full of easter eggs, weapons to pickup, doors to open, bouncers to activate and waves of deadly flesh eating zombies! The game is spiced up with awesome and very manly metal music! You can customize your character by purchasing clothing, hats and changing color of the pants. Unlock achievements, perks and get bots to help you destroy the undead! All purchases are done via ZKW Points, that you earn by playing. Features: - A very wide arsenal of weapons to find and buy, including melee weapons such as chainsaw and katana - Many perks, clothing, hats and achievements to unlock! - 3 hand crafted stages to play, in 3 different game modes and multiplayer. I recommend this game because i have alot of fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "Now I'm a almighty viking, which is accompanied by three maids. I have nothing to regret with my chainsaw and maids with miniguns!  So, Zombie Kill of the Week - Reborn is a 2D survival shooter. It is like Killing Floor but as 2D. There is no jobs, but when you level up you can spend points to upgrade your stats. Weapons can be bought around the maps.   You can play ZKW alone or with other players. When playing alone, you can add bots to fight with you. Believe me, those bots will save your life... Or ruin it.  Graphic is kinda nostalgic. It isn't breathtaking, but it is good for this kind of game.  I personally can't play this game in fullscreen because my eyes starts to hurt.  So switching to windowed is good for me.  Controls are working, but you may want to chance some keybinding.  Is this game worth it price? Well, I think it is. ZKW is enjoyable when playing alone and with other players. I like shooting everything that moves and painting walls with blood is always fun. In my opinion this game will be most enjoyable when playing with VoIP.  ZKW's chat isn't currently (14.3.2015) good for having talk about weather. ZKW is really good game for LAN-party.  Oh... I almost forgot.... Those grenades hurt!  ",
            "review_score": "1"
        },
        {
            "review_text": "This game has worse voice acting than Resident Evil and Sharknado combined. Neverless, it's still pretty good if you want to dish out some 2 dimensional pain.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, yes, it is a really good game, but the only problem that I have is the difficulty, this is too easy, even if you play it alone without friends or bots, it's still too easy.   Pros +Good pixel graphics. +You can have your own character. +Lots of weapons and upgrades. +It's still updating! +The music is OK... +Meh, there's not a lor of zombies, but it's acceptable. +A little bit of humor, it's really funny to play wtih friends... IF YOU DON'T MIND THE LAG!  Cons -2 Easy 4 Me. -Bad internet multiplayer. -Kinda simple. -Repetitive. -No weapon info, it cost me some time to know the stats of the weps.  But yes, if you like pixel, zombie, defense and leveling games, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "MONEY WELL SPENT!  I really enjoyed playing this game even in solo. Theres a lot of weapons to chose from. I just wish the 'chat' button is more accessible in controller mode. Its kind of hard to type when zom zomz try to eat your brains..lol",
            "review_score": "1"
        },
        {
            "review_text": "Great fun for low price!",
            "review_score": "1"
        },
        {
            "review_text": "It's like a more kick ♥♥♥ easier to play much more varietied version of COD zombies. Kicks COD zombies out the door, leaving you begging for more action~!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome side scroller with lots of win!  Devs join your game and make you win more!   Shotguns and flamethrowers and win!  How could you go wrong?  Win!",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game while it lasted, but found myself to get progressively bored the more hours I put into it. I think there's a few tweaks that need to be added. For example, if you stand directly below an edge then the zombies cant fall down to your level, this makes some challenges ridiculously easy.  If you can get this in a sale or bundle for less than £1 then this game is worth trying. Otherwise  5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly a lot of fun! It starts off hard but the progression system makes the game bearable pretty quickly.    Mindless, Zombie smashing fun.",
            "review_score": "1"
        },
        {
            "review_text": "I did this with my eyes closed.  Easy peasy.",
            "review_score": "1"
        },
        {
            "review_text": "So my computer was broken (the os was deleted so I needed a new one) and I got my old one and I needed a small (in file size) game, I came upon this and then everything changed.  First time playing it was AMAZING so many choices, so many maps but only 3 hours to try it out.  Next day I told my friends about it and I recently installed it on my kindle fire, i went for 5 minutes and next thing I know my friends are starngling each other just because they both wanted a turn, at this point I knew this game was going to be fun.  So my friends and I host tournaments to see who survives the longest/  10/10 and I plan to install this on my new pc.",
            "review_score": "1"
        },
        {
            "review_text": "Its is so bads i can even lok at my lap top sreen anymo. At most the install button did not worket.",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong it's fun to play, but the novelty and duration of enjoyment dies very quick; the fun did not last.",
            "review_score": "-1"
        },
        {
            "review_text": "This game feels like a game one might find at an arcade - The controls make it feel the same way, like it's meant for joysticks and buttons. Aside from that, it's a very mediocre game. It's enjoyable for about 30 minutes, however i'm sure it would be more enjoyable if I could play with some friends.  Basically, the way you play is that you kill zombies, and you start with a very underpowered pistol. You gain money by killiung zombies, which allows you to buy guns that are sitting around the map or open doors to allow yourself to have more space.  You also can gain xp and level up with this, which unlocks new maps, however they all feel the same.  This game kind of feels like a 2d, sidescrolling call of duty zombies game. However, it lacks much of the features and depth that call of duty zombies offers (this is coming from someone who despises all andany forms of COD, btw).  All in all, I would not recommend this game. It's simply too repetitive to give more than a few minutes at a time. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's ok if you're playing with friends. Pretty basic, maps are all pretty much identical in terms of gameplay. It's cheap so what do you expect and was originally released on android.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Like the 2D Side Scrolling version of Call of Duty's Zombie mode. You can play online with people, though I haven't tried it yet. If you want to have someone or something shooting along side you, you can find the Cell Phones Hidden throughout the levels. When you get a Cell Phone, that Permanently increases the number of AI Human Helpers/Survivors with you by 1. So If I have 3 Cell Phones, whenever I start a level, I can choose to bring up to 3 AI's with me. The AI's are dumb as rocks, and have some serious problems path-finding in certain levels, but they're way better than nothing, and actually do help you quite a bit. The first Cell Phone is easy to get, but the ones in other levels are harder.  As for the rest of the game, There are around 5 Official Levels/Maps in the game, with the option of either building your own with the games Level Editor, or downloading more from the Workshop. I don't know how many guns there are. bit O know there's at least 13 different guns, and they're different enough not to seem like just a reskin.  Weapons are spread throughout the level in fixed spots, so the harder it is to get to it, the better, usually. There's also Items you can buy with ZKW-R Tokens, which are dropped by enemies occasionally or awarded to you when getting an achievement or finishing the Daily Challenge. The Items include stuff like meat, which attracts zombies to it, a Dual Wield Pistol, Molotov's, 3 different Turrets, and a bunch more.  There's persistence throughout the game too, when it comes to your character and the weapons. There's a 'Weapon Customization' menu, where you can use your earned ZKW-R Tokens to permanently upgrade the various weapons damage, accuracy, reload speed, and firing rate. Honestly, I don't see much a difference with accuracy, since you're usually close enough for it to not matter.  Along with the weapon upgrades, your character earns experience when he kills a zombie. Once you level up, you get a point to invest into various skills. There's like, 8 different skills, but I found only 2 of them useful. Gun Expert and Money Finder. Gun Expert increase gun damage and reload speed, which is very useful. And Money Finder increases the value of money pickups.  There's also a crafting system, however to craft the good stuff, you have to invest quite a few skill points in the Handy Man Skill, which means less for Gun Expert and Money Finder, and to make things worse the crafting materials rarely drop to begin with. By the time the materials drop to craft even the simplest things have finally dropped, you could have just spent ZKW-R Tokens to buy 4 more, since the ZKW-R Tokens drop far more often than both the craft mats and the pickups.  Oh yeah, there are pickups too that zombies occasionally drop. They're stuff like temporary fire/plasma/piercing bullets, temporary armor, ammo refill, healing, etc. Power ups drop less than the ZKW-R Tokens, but far more than the crafting mats, so they're fairly reliable. And unlike crafting, you can level up your 'Lucky ♥♥♥♥♥♥♥' skill to increase the drop chance of power ups.  There's an option, also, that tells you when a multiplayer games is available to join, which is nice since while the game isn't dead, there isn't a endless list of join-able games either. More often than not, you wouldn't have to wait more than 10 Minutes to find a game, and whether you're in the menu or in game, a message will pop up alerting you. You can turn this off of course.  Well, there's some other features, but they're small, though still convenient, and you'll find them out soon enough. The gameplay is fun and what you'd expect: kill the zombie waves for money to buy guns. Unlock doors with cash to get further in. Find cell phones, etc.  The music is decent. Fits the game, but I wouldn't call it good, but I wouldn't call it bad either. The voice acting of your character is so laughably bad though, but I found it more amusing than anything else.  So, fun gameplay, plenty of persistence in weapon upgrading and character leveling, good amount of levels and weapons, AI companions, and funny voice acting. The Dev plans on updating the game too. I definitely recommend this game to anyone who likes Call of Duty's Zombie mode, or zombie arena type games.",
            "review_score": "1"
        },
        {
            "review_text": "Survived 21 round then CRASH to desktop... it seems it just a connection problem, check the review discussion for further info  and that zombie coins too hard to get, feels like a free android game that need so much grinding Zombie coins pretty easy to get after you get first Nokia and add bots, bot does useful and can save you from death",
            "review_score": "1"
        },
        {
            "review_text": "great game love it its worth the money!!! if u like shotgun fun fun then this is a game to get",
            "review_score": "1"
        },
        {
            "review_text": "Very fast paced and also very addictive",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game for when you're bored or just wanna have some fun with your friends",
            "review_score": "1"
        },
        {
            "review_text": "Simple, grindy zombie killer, exponentially more fun the more friends you play with. Repetitive and addicting. Well designed little game that does what it set out to do.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and stuff, dawg",
            "review_score": "1"
        },
        {
            "review_text": "It's an okay survival game to spend some time in. Not really great or amazing, just decent. I found the voice acting terrible and the controls + AI bad, but I kinda had fun playing it for a while and it was really cheap, that's the only reason I recommend buying this game.",
            "review_score": "1"
        },
        {
            "review_text": "Itz amazing game no bugs i have not seen yet realy fun to play 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best recommend to play in mutliplayer.  Sometimes server lost connection but it's ok, I'm still having fun.",
            "review_score": "1"
        },
        {
            "review_text": "love it on phone 10 hrs first day on pc 2 hrs and now buying a frined it 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Still Running is the Developer Wow OMG Never Knew that U Fr Are one of the Amazing Developers I Never Knew About Because I played this Game When it was on the App Store XDD &amp; I thought Panic Art Studios was the developer :p I've Been playing this Game Even when it was Took off &amp; It Was just Single player played it On my Mac Really Amazing Game Hopeing for More Amazing Updates to Come",
            "review_score": "1"
        },
        {
            "review_text": "12/20 I had so much fun with this game.",
            "review_score": "1"
        },
        {
            "review_text": "  +Smooth Gameplay. +Guns Guns Guns !! +Itchy Trigger Finger. +Upgrades.. ++Multiplayer +(Active Auto search on single player) ++Total Carnage !!!!  A fun 2D ZOMBIE SMASHING, HAVOC WRECKENING, RAMPANT PANDEMONIUM, EMINENT MAYHEM, GUT SPLATTERING, LIMBS DECAPATATING, HEADS BLOWING, TEAM's DYING, LEFT ALONE DYING shooter game...",
            "review_score": "1"
        }
    ]
}