{
    "app_id": 342450,
    "name": "Sword Daughter",
    "release_date": "2015-02-13",
    "developer": [
        "Hanabira"
    ],
    "publisher": [
        "Hanako Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Choose Your Own Adventure",
        "Female Protagonist",
        "Fantasy"
    ],
    "achievements": 15,
    "positive_ratings": 41,
    "negative_ratings": 42,
    "price": 4.99,
    "description": "Choose a path to adventure! Will you sneak into the dragon's lair, or challenge the beast openly? Will you fight for vengeance or for glory? Will you be tempted by elven romance? Will you be buried underground forever? Relive classic 1980s fantasy in this remastered gamebook.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342450/header.jpg?t=1447366946",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.2 Ghz Memory: 256 MB RAM Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Look, I didn't want to give this game a 'do-not-recommend', but... in the end, I can't justify the asking price.  The Good: -The art is very nice -The soundtrack is fun -The choices you make genuinely make a difference, and each choice provided tells a different story (well, not necessarily in plot, but the dialouge will be different).  The Bad: -Yikes. This game is SHORT. First playthrough took me about 35 minutes. I've played 10 of the endings and some are shorter than that, but none are longer. (My gameplay time is off, I've played a good 2 hours into it.) For me, its not much of a game if it doesn't last me a solid hour. Afterall, I did pay the same as a movie ticket--so in my opinion I should get at least an hour of play. -Too absurd, and not terribly amusing. The plot moves way too fast and relationships happen in a matter of what? 10 sentences? I can forigve bad and implausivble writting if I still get something out of it though--like humor. But this isn't funny. It's just sort of.... pathetic. Which goes into the following: -My warrior wasn't a warrior. BOOOOOOOOOO. Tryna's not terribly fierce. Or interesting even. She is just boring.  If Sword Daughter had been a two hour game, with some better character devlopment and better flowing plot, it would have been a cool visual novel. But as of now, it's just sorta meh.",
            "review_score": "-1"
        },
        {
            "review_text": "Good but (accurately) flawed Choose Your Own Adventure visual novel. If you grew up with those books you will probably love this game, but (as the creators point out in their patch notes) it has some faithful design elements that may seem incredibly odd or out of place to a more contemporary audience.  To cover the basic elements, this was a fairly generic story, set in the standard D&amp;D/Tolkien setting (made unique and innovative because these elves are typically *shorter* than a human!). The art serves the settings and characters quite well, with some beautifully illustrated backgrounds and relatable portraits throughout. There are a few effects scattered throughout for animation (ranging from parallax levels of sandstorm particles to the much more common but basic screen shake) but the character visuals mostly rely on swapping a handful of expressions per pose over the course of conversation; it certainly gets the job done, and is about what you should expect from a VN. The music and sound effects were similarly adequate, setting the tone but rarely sticking out or being memorable mere hours after finishing the game. The play system (including merciful quick save/load and skip options right on the main screen) is setup nicely for your first playthrough but really shines if you decide to go the completion route, restoring every choice you're given and plumbing their depths as we did through elaborate series of bookmarks years ago.  But even as a veteran of CYOA, there were some rough edges that stood out to me. Looking at the story as a whole, let's say there are three main main plots to encounter; any given ending might resolve one (maybe two) of those while letting the rest dangle, as they were never introduced in that sequence to begin with. As a corollary, one major plot element is encountered no matter which path you pursue, ignoring the conflicts of logic if you were to fill out your routes to see how each path makes it fit. It's hard to call this a fault, knowing how a good DM may alter their campaign on the fly to make sure players hit the various setpiece moments, but learning the whole web of choices does make them all seem a bit arbitrary. You can attempt to roleplay, and if you stick to your guns you can have a complete and satisfying playthrough in about 15 minutes, but the outcome might still largely feel like it was never in your control. This game will frequently throw you for a loop, when you are suddenly placed in an unwinnable ambush several story beats after your last meaningful choice, which makes the entire exercise of cause and effect feel a bit unpredictable - but again, that's entirely accurate to the books it is emulating, so maybe not that isn't a fair complaint so much as it is something to be aware of.  My only real complaint with the story is how much it leans into traditional romantic tropes at the expense of the main character. For a game that (at least in my recommendations queue) bills itself around its strong female protagonist, something like 90% of the 'good' endings revolve almost entirely around her forming an immediate relationship with the first man she meets. Maybe it's not for me to say, but that feels unfulfilling when the stated premise at the outset is her journey to complete the rites of adulthood and become a warrior in the Sword Games, and that plot thread is rarely heard from again after Love Interest McSavior is introduced. Again, not a bad story, if a bit heavy on cliche, but also not what I believe we were promised from the setup.  Overall I would happily recommend this game, even where it falls short of potential it's an enjoyable bit of generic fantasy action you can complete (and even 100% complete) in one sitting. It's got some elements that will be either baffling or nostalgic depending on your past experience with Choose Your Own Adventure novels, but as an old fan I feel it manages to modernize that format in a very successful way for the VN audience of today.",
            "review_score": "1"
        },
        {
            "review_text": "Sword Daughter is the latest visual novel released by Hanako Games although the story is not a Hanako Games original. It was originally written by Rhondi Vilott, and it's representative of the 1980's 'choose your own adventure' type of series. I bring this up now to keep things in perspective.  Although I'm giving this game a positive review, there were some aspects that did annoy me. So I'll comment on the negative things first and then highlight the positive things.  As anyone who's read my reviews of VNs by now, story is the most important aspect for me in determining if I will end up liking a VN. Although I do like the genre somewhat (I like some fantasy aspects although not all; I'm one of those people who isn't a LOTR fan), the writing did put me off at first. It's rare for a story to use the second person perspective, simply because it is difficult to pull off. But I think that the author used it to make the reader engaged more in the story. Most of the characters are either likeable or tolerable, and I thought that the main character Tyrna was in the middle. Now as for the potential love interest Gavin, I didn't like him from the start. He finds Tyrna and depending on the choices that the player makes, Gavin can either be helpful or an obstacle in helping to advance the plot. Aside from that, I really didn't like how in a lot of paths, Gavin would suddenly proclaim his love for Tyrna. I mean, really? No one falls in love that quickly unless they're extremely young and then I don't even think they would fall in love that fast. Gavin annoyed me so much that I wish there was the option to punch him in the face. That would have made me happy. lol  However, these are the only negative aspects I found. So moving on to the positive aspects. The art is extremely beautiful. It's different from the usual art found in VNs but I think that this is fine because of the genre. The music was great, too, and fit pretty well with the scenes. I liked that there were 22 different endings to get and there were enough CGs to make it worth replaying for them as well as the endings.   As I am aware that Sword Daughter is the first in the 'Dragon Roads' series, I do hope that the next book in the series will be adapted to a VN format. I look forward to trying it out and have more hopefuly expectations for it. So yeah, I'm giving this game a thumbs up because I hope to see more.",
            "review_score": "1"
        },
        {
            "review_text": "I wish I could, but I can't recommend the game for its current price (6.99). It is simply too short for that; the first playthrough took me about half an hour. Everything, especially relationships, happens way too fast to make any sense. There is simply not enough time to get attached to any of the characters. Speaking of which, I kinda expected Tyrna to be a fierce warrior (since the game is called 'Sword Daughter' and all), but she just ends up getting saved by her elven companion most of the time. The story is a bit bland, but enjoyable overall. What I fancied about the game was the art; it is beautiful. Soundtrack is pleasant to listen to as well and your choices truly matter! All of the 22 endings differ from each other. Perhaps not always plotwise, but you get a new piece of dialogue.   If you want to play this game, wait for a sale (like I did).",
            "review_score": "-1"
        },
        {
            "review_text": "It becomes obvious almost immediately that Sword Daughter has a generic plot with little to no character development. The adventure aspects of this game were mildly entertaining, but other aspects were a major let down. Most of the endings are romantic ones that I found myself rolling my eyes at...not because I'm against romance, but because I'd expect a female warrior-in-training to be more interested in becoming a fully-fledged warrior rather than arm candy to some half-elf-man she just met. *Insert strong female protagonist role rant here*   In a nutshell... Adventure - check Mythical creatures - check Quality soundtrack - check Decent art-style - check, although repetative Sound and visual effects - very basic...what does a collapsing cave sound like? Someone clapping. What do swords clashing sound like? Someone clapping... Humour - nowhere to be found  Very much a 'chick click', so I can't see many guys enjoying Sword Daughter.  If you want to get into visual novels, this might not be the best place to start as there are more engaging and visually appealing options out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Was attacked by a raiding band of orcs. Lost. Started my quest for vegeance. Kissed an elf. Killed the orcs. Game over.     10/10 Would play again.",
            "review_score": "1"
        }
    ]
}