{
    "app_id": 342550,
    "name": "Phantasmal: Survival Horror Roguelike",
    "release_date": "2016-04-14",
    "developer": [
        "Eyemobi Ltd."
    ],
    "publisher": [
        "Eyemobi Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Horror",
        "Indie",
        "Atmospheric"
    ],
    "achievements": 55,
    "positive_ratings": 117,
    "negative_ratings": 82,
    "price": 10.99,
    "description": "Experience Terror that is Never the Same Twice with Phantasmal, a Lovecraftian survival horror that evolves every time you play!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342550/header.jpg?t=1461004262",
    "minimum_requirements": "OS: Windows 7 Processor: 3.16Ghz Intel Core 2 Duo E8500 Memory: 6 GB RAM Graphics: 1GB (AMD Radeon HD 5550 or Nvidia GeForce GT 430) DirectX: Version 11 Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: AMD: Phenom II X4 955 - 4 Core, 3.2 GHz or Intel: Core 2 Quad Q9650 - 4 Core, 3.0 GHz Memory: 8 GB RAM Graphics: 2GB (AMD GPU: AMD Radeon R9 200 Series or Nvidia GPU: Nvidia GeForce GTX660) DirectX: Version 11 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "I enjoy the premise and idea of this game, however, I don't understand the Sleeper.  The sleeper spawns if you spend too much time in an area, preventing you from looting everything and giving you a sense of urgency.  However, I can not even sprint straight to the end of the level, no looting, stealthing, or even fighting enemies, without the Sleeper spawning and killing me through walls. I will sprint straight to the exit doing my best not to get lost (a guessing game with the procedural generation), and it will spawn without fail every time. Am I doing something wrong? Because so far I seem to be doing everything correctly.   It also doesn't exactly 'chase' you, as the game states... It simply flies through the walls to where you are, moving at what seems to be a faster pace, so unless the exit is right in front of you, there is no outrunning it.   I'm vexed by this mechanic to say the least, but I'm going to continue and try to get past it.  EDIT -   So, it seems that the Sleeper actually is based on your Sanity, which I wasn't paying enough attention to.  EDIT II -  So the Sleeper activates when your commotion goes too high. PSA - DONT SPRINT AROUND ALL THE TIME LIKE ME.   (:",
            "review_score": "1"
        },
        {
            "review_text": "I've only played for third of an hour but I think I can safely say that I have played third of an hour too long. I was tricked by all it's good looking videos, screenshots and positive reviews. I can't understand how reviews say the sound and atmosphere is good in this game. The sound and animation is simply garbage. The combat is super awkward as you just repeatedly smash the monsters until it dies as the character you control is made out of vibranium or some ♥♥♥♥. The game just plays like any Garry's Mod horror map.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy AF, not reccomended at current state, frequent crashing, menus that dont work, falling through the ground and cheap AI",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. No crashes for me (780GTX, 24GB Ram, Intel i5 4690, Latest NVidia Drivers) - Playing on Ultra settings and getting 70fps-55fps with a fps drop I describe below.  It's like a larger slower 'Unloved'. A bit creepier. There is a small tutorial level, and some backstory. You go to the famous Kowloon Walled City to find your aunt. You have to negotiate through demon-possessed Junkies, demons, darkness and your own sanity. I had the game way too dark to begin, so I checked some of the dev's screenshots and adjusted accordingly.   I'm a big fan of procedurally generated games, and this one does it very well.   I've noticed some of the rooms will look the same on different floors, no big deal I can imagine that 2 floors might each have a bar room.  There is an FPS drop if you stand in the light where it shows a bunch of dust particles, but that may be an easy fix. Dev is real responsive to the community.",
            "review_score": "1"
        },
        {
            "review_text": "In the short time I played Phantasmal I wasn't impressed. The character models all look the same and have very unpolished animations. The game is another really dark horror fps. Sure, everything is randomly generated, but if the game is unpolished and not fun to play then what is the point. Using weapons has no weight behind them. Also, the framerate is very inconsistent. You can usually tell where all the monsters are even in the dark simply by looking in one direction and watching the framerate drop to 25.   Give this title some time. Even past 1.0.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to play this game, but I spent hours trying to figure out how to set it up. At first it started on my second monitor (which is not my primary), so I worked with advanced settings in options to rectify the situation. Of course, on starting the game, no resolution, windowed or otherwise would show the game properly. The UI was beyond glitched, and when I'd adjust settings in game, it would not function the way it should. Scroll bars weren't working, the picture wasn't centered at all, and the image was stretched beyond recognition. It seemed like everything was against all attempts to fix it.  I'd spent my night exiting and restarting the client over and over and over again, to no avail. And, the intro would no longer play after the first attempt. So, that's a no go in every way possible. So, I've now given up.  I'm shocked that this game has come this far without even being tested for efficient functionality. Waste of money.. I'm really disappointed with this product.",
            "review_score": "-1"
        }
    ]
}