{
    "app_id": 342500,
    "name": "Human Extinction Simulator",
    "release_date": "2015-01-21",
    "developer": [
        "Machine 22"
    ],
    "publisher": [
        "Machine 22"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Indie"
    ],
    "achievements": 8,
    "positive_ratings": 13,
    "negative_ratings": 22,
    "price": 14.99,
    "description": "Tactical turn-based space battles. Elaborate war strategies to prepare against the inevitable alien invasion.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342500/header.jpg?t=1478024129",
    "minimum_requirements": "OS: Windows XP and up Processor: 1.5 GHz processor Memory: 2 GB RAM Storage: 130 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I had high hopes for this game after reading some of the other reviews, but after playing it for a few hours, I found it to be an exercise in frustration. My main issues center around the ship movements and the weapons firing arcs. It is impossible for any of the ships Ive used to move backwards or rotate 180 degrees. This results in having to loop around in order to fire at your enemies, much like you would in a sea battle piloting an old sailing ship. This in and of itself wouldn't be so bad but when combined with narrow firing arcs and blind spots in your weapons' field of fire, it becomes irritating very quickly. It's not at all unusal to have an enemy ship in the hex directly adjacent to you 30 degrees left or right of center and not be able to fire at it.  Also, many of the weapons are only effective at certain ranges or against either shields or the hull (not both). That combined with the limited movement and firing arcs results in your capital ships being almost useless. Because they are so slow, it seems almost impossible to move them into a position where you are pointed in the right direction, at the right range, with the right weapon to hit your target. And even if you do manage it, you will get one shot before spending another 3 turns looping around to try to get another.   Oh, and did I mention that you are always significantly out numbered?  I dunno... I got through the first couple of missions, but I just didn't enjoy it. If the movement were more free or the ship weapons could be customized, I might have liked it more.",
            "review_score": "-1"
        },
        {
            "review_text": "Spaceships with clumsy moving and very inflexible firing arcs. I got annoyed and bored during the first two tutorial levels.",
            "review_score": "-1"
        },
        {
            "review_text": "*UPDATE* 'If there was one thing I could say about Human Extiniction, it's that a lack of a detailed tutorial and an obtuse interface often interfere with the strategic focus (for new players).'  A unique, engaging and hard-as-strategically-placed-nails twist on Chess centered on alien craft blowing each other to bits--what's not to like?",
            "review_score": "1"
        }
    ]
}