{
    "app_id": 342580,
    "name": "12 Labours of Hercules",
    "release_date": "2015-03-23",
    "developer": [
        "Jetdogs Studios",
        "Zoom Out Games"
    ],
    "publisher": [
        "Jetdogs Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Time Management",
        "Strategy"
    ],
    "achievements": 22,
    "positive_ratings": 2391,
    "negative_ratings": 156,
    "price": 1.99,
    "description": "Accompany Hercules on a quest to rescue his wife, kidnapped by the evil Hades in 12 Labours of Hercules! You'll meet heroes from Ancient Greece as you vanquish beasts, repair roads and construct wonders in this stunning Time Management game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342580/header.jpg?t=1502363943",
    "minimum_requirements": "OS: Windows XP Processor: 1.6 GHz Memory: 512 MB RAM Graphics: 1024x768 resolution DirectX: Version 9.0 Storage: 300 MB available space Sound Card: On board",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " 12 Labours of Hercules  is a fun little resource and time management game by Jetdogs Studios which was designed for iOS and ported into PC due to its popularity later on. This first one in the series is fun, relaxing and a point on choice for a couple of easy achievements as the rest of the series. If you feel like sparing time for a series of automated actions to meet certain challenges and have a smile now and then, keep reading.  First and foremost, these games are vaguely based on the actual  12 Labours of Hercules , an epic poem written by Peisander in 600 BC, narrating the 12 years that legendary Greek hero spent in service to King Eurystheus to atone for killing his own family whence he was maddened by Hera. As you can see, these kiddy versions of the legend are not as gruesome as the actual tale. For the content of the game, there is little to no story. All we know is that Hades abducted Megara - Hercules' wife - for unknown reasons and we are to take her back by building a path between Hellas and the Underworld with the aid of our servants and some monster buddies of ours. The game - as the rest of its instalments - mostly consists of thrown around mythological figures and a most required happy ending.  As for the display, art is cartoonish and enjoyable; not the worst that I've encountered in these kind of casual games. Icons and animations are cute. Everything’s pretty much Disney-ish actually. Music is cute, but with this amount of repetition in each and every level you may prefer muting it down after some time.  As for the gameplay, you basically drive some servants to collect resources, build paths and activate certain encounters within a limited time while you and your monster 'buddies' overcome some challenges. Game mechanics are real simple and easy to master, and your abilities to buff certain conditions makes this a casual game with little strategic planning. The most you'd find to be challenging is the achievement to complete all levels on Gold Time. It is possible to finish all quests within 3-4 hours anyhow.  If you feel like taking a break from some serious business that you've been attending, this is the perfect game with little to no brain involvement. You mostly play it with your reaction rate. All these games do go for a decent sale most of the time, so you may prefer getting it in one of those times. Enjoy!  Please also check out Lady Storyteller's Curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game. I had a lot of fun while playing. Easy to achive all achivements.",
            "review_score": "1"
        },
        {
            "review_text": "Original got it for cards but went full Hercules on it for achievements too! Is a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun time management game. Story is rather short and silly, but obviously it's not the most important thing in these sort of games. If you play this game on regular difficulty it's rather easy, but if you play it on expert difficulty (as I did) it can be pretty challenging, since there are few rather tricky levels. So whenever you're looking for something pleasant and relaxing or slightly more challenging and even a bit frustrating - you'll find it here. In addition - nice graphic and music.  I can recommend it to anyone who like time management games.",
            "review_score": "1"
        },
        {
            "review_text": "  12 Labours of Hercules   is a casual time-puzzle game. Hades has kidnapped Megara, and it is up to Hercules, and especially his servant, to travel ancient Greece to save her.   Pros : While Hercules is taking a nap, you order his servant around in single-screen puzzles, where you must reach your objectives within a set time limit. The point is to optimize the order in which you pick the resources and accomplish tasks that consumes those same resources, tasks such as fixing the path or upgrading buildings that generate resources or supply additional servants. As you progress, you will get access to a few bonus powers, and gather allies such as the Medusa, the Pegasus, the Cyclops and the Cerberus, each of which can defeat enemies blocking your path or accomplish special tasks. The colorful map is overlayed with symbols of the game achievements you accomplished, and landmarks that gets build as you get gold rating at each levels.   Cons : The game is extremely easy, you'll rarely ever need to restart a level to get gold rating. Due to lack of randomization, it's unlikely you'll ever replay any levels except for the slightly less easy-to-get achievements. The story really is an excuse to give the world a setting.   Verdict : ★★★☆☆ - It's up to you  This game is basic, even for a casual game, and might be a bit more challenging for a much younger audience. But keeping in mind its price, I'd recommend it for children and achievement hunters, but anyone seeking any form of challenge in a puzzle should stay clear.  —————————————————————————   This was just my opinion.   If you found this review helpful, please consider giving it a thumbs up, and feel free to check out more of my (purely opinionated)  reviews . ",
            "review_score": "1"
        },
        {
            "review_text": "A set of four equally nice, neatly made (in every aspect) time managers. Slightly diversified (with new game play features, bonuses and surprises) to make each game a bit different, while keeping enough in common with the previouse one(s), which shortens waste of time and nerve on mastering the next game, that's valuable. Repetative, yet it feels all right here, can't remember myself being driven into bore even once. I beat all four games 100% on expert difficulty and still wouldn't mind to see the fifth. Taken into account the fact that games like these are not my idea of fun (or they weren't at least))) - what better recommendation could i give to a game. If you are looking for a highly involving and entertaining, not all that hard yet challenging enough game - check this one. Probably you will be pleased even beyond your expectations. --------------- Серия из четырех одинаково отличных и очень качественно(во всех отношениях) сделанных игр- тайм менеджеров. Слегка отличающихся друг от друга (по набору игровых аспектов, бонусов и сюрпризов), ровно настолько чтобы не быть совсем однообразными, и при этом не вынуждать учиться играть заново, что несколько сокращает затраты времени и нервов на освоение каждой следующей игры, что порадовало. В принципе они достаточно однообразны, но здесь это не кажется недостатком, не помню ни разу чтобы это как то обломало интерес к игре. Полностью прошел все четыре на экспертной сложности и не отказался бы от пятой. С учетом того, что сами игры далеко не из списка моих предпочтений (по крайней мере не были))), вряд ли я придумаю способ высказаться об игре в еще более позитивном духе. В общем, если вы подыскиваете что-нибудь достаточно увлекательно-развлекательное, при этом не слишком сложное, но тем не менее бросающее определенный вызов вашим способностям в пределах разумных затрат времени и сил - то это как раз то что надо. Вполне возможно порадует даже сверх ожиданий.",
            "review_score": "1"
        },
        {
            "review_text": "Simple but fun, the gameplay does not become repetetive as every level has something new to offer which makes this game an amazing value for the price!",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS of 2016, I love the combat, the tech, and the number employable strategies are out of this world.  Better than Sid Meier's Civilization V with the Brave New World Expansion Pack.",
            "review_score": "1"
        },
        {
            "review_text": "This is actually a great and yet a very simple game to play. The concept is so simplistic yet so much fun, reminds me of my early days in PC gaming when I was young. This is the perfect 'Casual PC' game as it's not something iOS could handle however it has features that would make you think it is from that platform.   In the game, you must go alongside Hercules to rescue a girl that's some famous goddess (My greek mythology is bad...) and needs to do so by clearing the path... and by he I mean his dedicated servants/slaves. Collect resources as you complete tasks in each level as you come across famous icons in the greek mythology, such as the Cyclops and Medusa. Clear the way and free the goddess (whose name shalln't matter right now) as you travel across the vast country of Europe!  All casual gamers should include this into their collection!    Thanks for reading! Check out these other links!   My Curator Group   Other Game Reviews ",
            "review_score": "1"
        },
        {
            "review_text": "Another 'this was way more fun than I expected' review. The art's great. The music is catchy but never became grating. I especially liked the cutscenes between the acts, which have a few lines of narration written in iambic pentameter, read by what sounds like an old guy telling a story to children too young to understand him. I don't know, it just somehow really worked for me.  The gameplay isn't difficult (I'm not familiar with time management games, but I only had to replay a few levels to get the gold time), but it's definitely fun and addictive. The game's longer than I expected, as well (maybe 6-7 hours once I adjust for the times I left it running to go walk the dog or whatever).  I got this from a bundle, but if I'd paid full price, I wouldn't be mad.",
            "review_score": "1"
        },
        {
            "review_text": "ok i know this i a mobile game but none of that bothers me. its a very simple game and casual. there is a hardcore mode for those who like it. its only took about 4 hrs or so to beat. you could probably get it less or more. i just went the casual route gold star most except maybe 4. there are 4 chapters about 10 missions in each. yes its time related and clicking but still its not that bad if you want to kill a little time and want nothing exciting.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year! Forget about Fallout 4, Witcher 3, etc. This is where it's at. Trust me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly interesting, enjoyable, and somewhat simple. While the game has mild RTS elements, I found it more like a time managing puzzler. The game incorporates greek mythology and has a nice short, but sweet story. The game can be easy and the achievements are not terribly hard to get. I found it was a nice little breather of a game with a decently set pace.  Pros: -Basic strategy/puzzler -Easy perfect game -Refreshingly different from your typical games -Pleasent game atmosphere -Great art/music  Cons: -Short -No editors (i.e. can't make your own levels) -No free build options  Mehs: -Music gets a little old fast since its on a continous loop  Overall: 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice, easy game",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty good and simple, don't expect a story line though cause that part makes no sense at all. Found no bugs that would ruinen your day. Even though its not my kind of game, it wasn't bad at all.  Once I finished the tradingcard farm (the reason I bought the game) it surprised me to see the prices, 8-9 cents each for a game you pay 14 cents for.  So if this is your kind of game or you're looking for a trading card profit, I'd say:  Get it  9/10 Would get their games again.",
            "review_score": "1"
        },
        {
            "review_text": "Cheese is as big as the buildings. Hercules is a lazy ♥♥♥♥♥♥♥. 10/10 would play through the whole thing again.",
            "review_score": "1"
        },
        {
            "review_text": "note to self, at first glance it seems pretty dull, but the game in a nutshell 'recource management' on a 'time table'",
            "review_score": "1"
        },
        {
            "review_text": "At the beginning it's very easy and the tutorial is quite long to make sure you learn how to interact with the materials, buildings and characters.  The more Hercules advances towards Megara's rescue the hardest tasks will be, resulting in large levels full of dangers which he, with your help will need to face. Also as you progress you'll be given less time to react to multiple choices as for example, clear one path before another or upgrade a warehouse instead of building a farm.   Pros:  Engaging and beautiful environment, graphics and sounds. Learn mythology while practising strategy and reflexes! No bugs that I'm aware of. Simple and attractive UI. Steam trading cards. Cheap (Sale).   Cons:  Short.  -  Duration: 4-6hours. (With all achievements included) Price I paid: 0,14€. Price I think it's worth: 0,5€ to 1,25€. (For every 1€ spent, a game should give 3-5h of entertainment)",
            "review_score": "1"
        },
        {
            "review_text": "A good stuff for killing boring time.What you need is klick everything you could see",
            "review_score": "1"
        },
        {
            "review_text": "What a fun little game! Worker management clicker, engrossing and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Short, entertaining, fun and easy 100%",
            "review_score": "1"
        },
        {
            "review_text": "I think it's time i review this masterpiece. really is one of the best loading screens i've ever played in my life tbh, the title of this game really is honest so i guess i can't say i was false advertised.  Pros - It's funny how many piece of cheese are on the map - It has a sequel  Cons - 2much cheese - Hercules is a lazy ♥♥♥♥ and isn't even the protag, ♥♥♥♥♥♥♥♥♥ just sleeps while his ho is kidnapped and continues to sleep while his slaves do all the work and save his ♥♥♥♥♥ - The music is terrible and the same song for pretty much the whole game from what i've seen - All the levels are the same with a few changes such as lame medusa enemies and building - Mini-games are just terrible and lazy - Everything requires is loading screen which is just boring asf to watch - Game is waaaaaaaaaaay too long seeing as all the levels are the same thing - It has a sequel - Overpriced - The dumb workers have to go back to the house every single time they do a single task meaning you have to go back and forth everytime you do something. omg it's so bad  All in all this game is pretty great, i can't wait to play the sequel. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "fun game. decreases boredom. not a 10/10 game. but stil fun. so up!",
            "review_score": "1"
        },
        {
            "review_text": "Challenging and fun! I'm proud to have finished this, and I challenged my grandma to beat my score!",
            "review_score": "1"
        },
        {
            "review_text": "A fun and relaxing game ! worth it if you wana take a break from all the other games that ir stresing you out !",
            "review_score": "1"
        },
        {
            "review_text": "soooooooooooo amazing. it is one of the goodest geme i played from a time. it took me like 6 hours to finish and 1 hour i just meked the achievements. i love it because is inpired by the grece mythology and because is a fu--ing fat hercules who just sit on a hammock and destroy boulders. love it and i will try to get the rest of the franchise. it was a cool game.   666 / 10 XD",
            "review_score": "1"
        },
        {
            "review_text": "Straightforward time manager with in a Greek mythological antiquity setting. You have workers for mundane tasks like collecting food, chopping woods, clearing paths, and have Hercules for bigger tasks like tossing boulders or buidling temples. Each task either yields food, wood. etc., requires a certain amount of those resources, or is some combination, e.g., requiring food and wood to mine gold, which is another main resource. The workers have to run back and forth to their little house which takes time, so the order in which you do the tasks matters. Not only is distance the workers have to run a factor, but how quickly you can upgrade your house to get another worker, or build a farm to generate food periodically, can also have a big impact.   All in all a solid time manager that is reasonably priced at $3. It is also available on iOS, but it is not clear whether this was a port to or from iOS since the release date (according to Metacritic) was Oct. 30, 2013 for PC, but April 23, 2014 for the iOS version. Regardless, this game stands on its on as a PC game, while it certainly would make a good touch-based game, since you are mainly just clicking the next task for workers/Hercules to perform, the game has enough depth and variation to retain one's interest.",
            "review_score": "1"
        },
        {
            "review_text": "Provides a few hours of brainless entertainment, good value for the price.  Pros:  + Crisp and vivid graphics + Catchy music and good sound design + User friendly controls + Easy minigames (even for one who sucks at action games) + Quite easy gameplay and achievements (Aside of one map, I got gold score for all of them for the first try. Damn that 3.8 map, I had to replay it 4-5 times :D)  Cons:  - The plot can de summed up by the damsel-in-distresss cliche - The gameplay quickly becomes monotone as is usual with this genre. From around thirdway through the player has to do some minimal strategic thinking before/during each map, but the gameplay is still mostly just mindless clicking on the next green circle. - The tutorial could be a bit more informative. I only realised after playing half the maps that the storage building actually increases output. (There isn't much time to try to decipher icon-based tooltips in the middle of the game.) Also even after finishing the game it's still not clear if the 'more resources' bonus speeds up the blue circles too or just the farm &amp; workshop.",
            "review_score": "1"
        },
        {
            "review_text": "Cutey mix of adventure and strategy game, that plays like a very simple King's Bounty. Recommended for kids who are into Hercules lore, and if purchased on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Bought for the trading cards. Was surprised to find a very enjoyable puzzle/builder hybrid game  Hercules and his servants must use the lands ahd what little resources they brought with them to brave such dangers as pits, eroded roads, fallen trees, blocked goldmines, landslides, and big rocks. While you're doing these tasks, you aquire more resources, which can then be used to clear out bigger obstacles, build buildings, upgrade buildings you already have, rent medusa's services, or get Hercules to leave his comfy bed and do something truly herculean.  Pretty solid, really.",
            "review_score": "1"
        },
        {
            "review_text": "12 Labours of Hercules  +easy +fun +cute +happy music  -too easy -gets boring  If you like time management games, you will love this, BUT it does not seem to challenge you at all.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game as my first experience with a time management game it was fun, challenging and funny. I recommend this game to anyone who likes innocent fun and using their analytical skills to complete the requirements for each level.",
            "review_score": "1"
        },
        {
            "review_text": "Since this looks and plays like a game for a tablet or phone, I really didn't expect to enjoy it on PC ... but I bought it because it was 29 cents. Surprise -- the game is really fun and enjoyable. Highly recommended at sale or at full price.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on sale for 98 cents but I would gladly pay the full price. Its a silly game, you won't even understand why you're playing it and then hours will go by and you'll still be playing. It may be silly and pointless but its super fun.",
            "review_score": "1"
        },
        {
            "review_text": "Buy it during the sales and really fun to play. This game is not hard and the achievement are easy to get. Definitely worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I am having a good time pass for just 14 CENTS! Feeling Good...",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for 0.14 euro . It was the best transaction I ever did !! 10/10 would play again .",
            "review_score": "1"
        },
        {
            "review_text": "....",
            "review_score": "1"
        },
        {
            "review_text": "Very new to playing games? Like point and click games? Want something easy and non taxing to play? Did you answer Yes? Then this game is for you!   12 Labours of Hercules needs only one thing to play it - a mouse! [or, if like me, you have a touch screen laptop or tablet capable of launching the steam client, that will also work too]   The premise is simple, you are taken back to ancient Greece, and must help hercules complete his tasks to save the day! Achievements are easy to unlock, making this game ideal for the first time steam user or casual gamer. Every so often through out the game, you will find mini cut scene movies, and the odd boss battle, but these can be easily over come with a click of your mouse pad.   Pros *nice clear graphics *easy to play - no gamepad or keyboard pressing required *easy to follow format *suitable for any age group from 5 to 105 (no onscreen violence)   Cons *not suitable for those who like a challenge *more basic than your average rpg",
            "review_score": "1"
        },
        {
            "review_text": "An interesting and amusing game.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit I enjoyed playing this simple puzzle game. The basic gist is to gather materials, clear paths, and build various buildings in each level. The challenge really lay in getting the full gold stars and attempting to beat the developer's score and even that wasn't too challenging. So if you're looking for a good game for your kids to play or something easy to play through then this is a game for you.  If you're looking for a serious challenge you probably want to avoid this game.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit I enjoyed playing this simple puzzle game. The basic gist is to gather materials, clear paths, and build various buildings in each level. The challenge really lay in getting the full gold stars and attempting to beat the developer's score and even that wasn't too challenging. So if you're looking for a good game for your kids to play or something easy to play through then this is a game for you.  If you're looking for a serious challenge you probably want to avoid this game.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game as my first experience with a time management game it was fun, challenging and funny. I recommend this game to anyone who likes innocent fun and using their analytical skills to complete the requirements for each level.",
            "review_score": "1"
        },
        {
            "review_text": "There are times when ive had my fill of cleaving heads in twain or double tapping mujahadin in the brainbox and all i want is a silly wee game with pretty colours and catchy tunes THIS IS IT! its not going to win game of the year but its awesome for a wee play or youre just too out of your face to concentrate on anything else!",
            "review_score": "1"
        },
        {
            "review_text": "As with many indie games on steam it's kinda fun at first then becomes repetitive. You just tap buttons in a specific order. Unfortunately I have a need to finish what I start and so I beat it and then seeing how it wasn't so difficult I got all the achievements. Whoops.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game! :D",
            "review_score": "1"
        },
        {
            "review_text": "I got the game for like 19 cents. Was not expecting much. Played for almost 2 hours straight! Suprisingly fun and progressively gets harder",
            "review_score": "1"
        },
        {
            "review_text": "It's painful to even try and get the trading cards to profit from this.  So I bought 8 copies to gift my friends for christmas. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. Pretty simple.",
            "review_score": "1"
        },
        {
            "review_text": "This game was great, not complicated, easy to do, and still a challange dependsing on what setting your on. Graphics are gret and the game gave a solid 6+ hrs of gameplay, and for the price it is great! I suggest you play it is you like any kind of stratagy games.",
            "review_score": "1"
        },
        {
            "review_text": "worth the money :)",
            "review_score": "1"
        },
        {
            "review_text": "12 Labours of Hercules is simple, easy, and fun. It took me 6 hours to complete and get all the achievements. The complexity of the game increases as you complete each stage, but it never gets hard really. Nice game for study or work breaks. No effort really! It would have been nice if it was a bit more challenging, but all in all, fun!",
            "review_score": "1"
        },
        {
            "review_text": "Wow, suprisingly good. I didnt expect that.  PROS: -Like a mobile game. -Only 14 Cents. -Easy and Fun. -Trading Cards.   CONS: Nothing",
            "review_score": "1"
        },
        {
            "review_text": "Fun game I got it for 0.14€ while on sale",
            "review_score": "1"
        },
        {
            "review_text": "Got this game for 14 cents and ended up playing for close to 4 hours. The game has a nice relaxing atmosphere but there is some strategy and planning required on the later levels but restarting is easy and doesn't feel too punishing. Overall, definitely worth it if you can pick it up cheap.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for 0.14 euro . It was the best transaction I ever did !! 10/10 would play again .",
            "review_score": "1"
        },
        {
            "review_text": "If you like Farm Frenzy, I recommend these series to you. Similar game style, even has a little bit of a story to go along with it. This particular one is fairly easy to beat each level, but the second game is more challanging if you need a harder difficulty level, but like this game style.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a kid game at first, but most likely the most addicting game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game a lot. Closest thing I could find to a negative is how difficult fending off the crabs can be with my comfy trackball.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun game. Boardgame-sized semi-RTS, easy to play, silly catchy music.",
            "review_score": "1"
        },
        {
            "review_text": "Good casual strategy / time management game. Excelent price (3€) for the fun. If you get it on bundle, like i did, its awesome. Cant wait to play the others instalments.",
            "review_score": "1"
        },
        {
            "review_text": "Simple but fun game, easy achievements if you're looking for a game for a perfection achievement rating, and super cheap!",
            "review_score": "1"
        },
        {
            "review_text": "This game is like sitting in the void. Moving neither forward nor backward as an infinite amount of space and time sits between you and fun. NothingToDoWithHercules/10 WhyIsHadesEvil?/10",
            "review_score": "1"
        },
        {
            "review_text": "it's a good game, if you like dash time management game,  you'll love this game, get it while it's on sale...",
            "review_score": "1"
        },
        {
            "review_text": "Well, I played it until I beat it, so it can't be that bad! Seriously though, it does what it does well, even though that is quite simple time/resource management. Very well presented, charming and cheerful, and there were plenty of achievements and challenges I did not complete, so you do get value for money. Would I play one of the many sequels? Yes, I think I would.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DNR = you can now play this game without having to connect to the internet first - but don't count on that remaining the case. Steam changes their minds about this stuff at will and you have no recourse because they already have your money. In the meantime - thank heaven for GOG.  I have recently discovered that you can now start and play this game not only in offline mode (Steam is NEVER really offline anymore and hasn't been for years) but even when there is no internet connection at all (which is the only way to force 'offline' mode in Steam to actually be offline. It is SO super annoying to start Steam in offline mode only to have it take 20 or 30 minutes to 'update' the steam client - which is what happens on slow internet connections).  So my objection to and disappointment with the game is assuaged, at least for as long as this remains true.  Sadly my son has recently discovered that he can no longer play the steam version of Civ IV in single player mode without an internet connection at startup, which has greatly reduced my interest in acquiring THAT game.   C'mon Steam, stop being such a jerk. There are a whole lot of us who don't have reliable (or sometimes ANY) internet access. Say, guys on oil rigs. People who live where there isn't cable. POOR people. People with crappy ISPs that go down all the time. We should be able to play our games even without going to the library to use the free wi-fi.  I am updating this review while weeding out my wishlist - mostly by removing all the games I can buy on GOG - because of nonsense like not being able to play when the internet is down or otherwise unavailable.  Original review follows:  This is a pretty typical time management game - except I recently discovered that it requires an internet connection. It will not start at all if you have Steam in Offline mode. If you bring Steam up in online mode and then turn off your connection, then you can start it, but it warns you that you will lose all your 'progress' - eg they are storing scores in the cloud.  Since I could care less about 'progress' per se, that's not really much of an issue for me. But not being able to play it in offline mode from the start IS a problem. I am frequently without internet and in need of a time killer. This is clearly not suitable unto the cause.  Now that I know, I looked for some hint of this in the game description and did not find it. I really object to being sold a game, any game, no matter how cheap, only to find out that there are restrictions on it that prevent me from playing it offline. This is why my GOG collection is so much larger (and older) than anything I have had on Steam to date. I expect it will likely continue to be the case.",
            "review_score": "1"
        },
        {
            "review_text": "its very easy game, and it looks like a farming game to proceed on the goals.",
            "review_score": "1"
        },
        {
            "review_text": "A real surprise. As for me, I don't like strategy games, but it's a great casual adventure. Attractive graphical interface with handy game mechanics. Highly recommended. -------------------------------- 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Colorful comic-like casual game. Uplifting music and a constantly raising difficulty. The game focus is mostly on time and task management.  You have to gather resources and build farms, workshops or shrines in order to complete the missions. A few boss-fights from time to time. Easy to learn and fun to play. A must buy, if you're in this sort of games.",
            "review_score": "1"
        },
        {
            "review_text": "Its a cow clicker game like farm frenzy but no where as good. I kept thinking it would get better but nope. Billy Mays is rolling in his grave to how bad this game is...p.s it needs more slaves I got like two from the 1st level then none after",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not a game.",
            "review_score": "-1"
        },
        {
            "review_text": "-",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "This game is such a ♥♥♥♥ing ♥♥♥♥ show, no hentai, no gay sex and no swag. I became disabled from this game, due to a lack of satisfaction. My picture is a real life picture of me now 10/10 reccomend",
            "review_score": "-1"
        },
        {
            "review_text": "ethan pierce is a ♥♥♥♥♥♥",
            "review_score": "-1"
        }
    ]
}