{
    "app_id": 342520,
    "name": "BoxesWithGuns",
    "release_date": "2015-04-14",
    "developer": [
        "Thomas Christof",
        "Giovanni Rotondo",
        "Thomas S."
    ],
    "publisher": [
        "Thomas Christof"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Arcade"
    ],
    "achievements": 40,
    "positive_ratings": 19,
    "negative_ratings": 58,
    "price": 1.59,
    "description": "BoxesWithGuns is a 2D neon vertex endless shooter game. Try to survive as long as possible by avoiding collisions with the enemies that spawn. One game equals the length of the background music track playing. Collect dollars and customize your spaceship by adding new boxes and weapons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/342520/header.jpg?t=1447366958",
    "minimum_requirements": "OS: Windows XP Memory: 250 MB RAM Graphics: Intel HD Onboard DirectX: Version 9.0c Storage: 150 MB available space Sound Card: Required",
    "recommended_requirements": "OS: Windows 7/8/8.1/10.x Memory: 300 MB RAM Graphics: Intel HD Onboard &gt; DirectX: Version 9.0c Network: Broadband Internet connection Storage: 200 MB available space Sound Card: Required",
    "reviews": [
        {
            "review_text": "Very basic twin stick shooter with somewhat intriguing concept yet horrible execution to say at least.   Gameplay  The game has one and only play mode. You shoot waves of squares that simply fly around you in order to gain points which you then spend on guns and gun upgrades inbetween the waves. There's an aspect of building the ship. You need to expand the size of your ship for every new gun you want to attach making you bigger target and sacrifice your movement speed in exchange for better firepower. If enemy hits your base section, it's game over. If it hits expanded parts, you lose only the guns attached to that part. This is interesting on paper yet you'll find out right after few games that it's more efficient to just keep your ship small with one gun you continually upgrade. Concept of buying upgrades and new guns is also very much undermined by the fact all guns are very weak against the enemies so you're basically waiting for power-up so you can kill something.   Graphics  Visual presentation of this game is at least atrocious. Every graphical part of this game seems what you would expect from very first InDev version of a game. Your ship is square, your enemies are square. Background seems to be squares. These graphics would be low for a flash or a mobile game. Everything feels lazy and undone. This theme is acompanied by visual effects that are beyond annoying. Half of the time you won't even see what's happening on screen. And this is game focused on precision. Imagine playing Counter-Strike with screen going bright white every few sec... oh wait.   Overall  The game is sold for a very low price of 2€ yet you won't get any content worth that much. If this was free flash game on a site like Newgrounds or Kongregate, it would still have a low score at best. The one positive thing is soundtrack which is very catchy but artists provided the music are not even credited? Shame. Thumb down.",
            "review_score": "-1"
        },
        {
            "review_text": "To be perfectly honest, you get what you pay for, The games graphics are dissapointing, and even on max, still leave much to be desired, I enjoy the concept, however the execution is poor, the game feels unfinished and lackluster, in addition, most of the music tracks played in the backround are also quite dissapointing, I used a 60% off coupon and still felt like i was cheated, perhaps makig the game free to play would lower the standards... Overall, the game's core mechanics such as flashing and pulsing often obscure your view and kill you, due to 80% of the screen turning white, and bluring, with the fact enemys dont radiate though the glow and blur, blindsiding and killing you. Combined with the terrible music, and unresponsive/ floaty controlls, and the games simple concept, of 'Upgrade guns and dont die' is quite dissapointing... Looks good, sounds good, just wish they would have spent more time to make it a quality game. Game tries too hard to be somthing its not.   3/10 Not recomended due to the games price, and poor execution and many dissapointments, The gameplay becomes stale quick.   As stated before, I used a 60% off coupon and still felt like this was a waste of money, time, and effort.",
            "review_score": "-1"
        },
        {
            "review_text": "Dev needs to fix this. Gameplay is smooth but the screen flashes like crazy and the bloom style of effect that is present makes the game unplayable as it largely goes one colour and you have no idea where anything is. It's also difficult to progress as a tolerable pace. Promising, but with an apparent lack of care from the dev.",
            "review_score": "-1"
        },
        {
            "review_text": "WHY SO MANY NEGATIVE REVIEWS???   Awessome game to play if you love eletronic music!  A nice game to play when you want to hear some music and have eye seizures xD  Nice soundtrack!   Low price!   Create your own space ship and survive a killer serpent boxes waves, getting powerups, and hearing the soundtrack of the game, and always the lighting is cool ;3",
            "review_score": "1"
        }
    ]
}