{
    "app_id": 343020,
    "name": "MagNets",
    "release_date": "2015-01-30",
    "developer": [
        "Total Monkery"
    ],
    "publisher": [
        "Total Monkery"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 24,
    "positive_ratings": 9,
    "negative_ratings": 2,
    "price": 5.59,
    "description": "MagNets: an intense arcade-style robot-recycling collect-em-up! Players must fight to restore order in Polarity City, one arena at a time. Do this by capturing malfunctioning Bloxbots in your Electromagnetic Nets, or use your MagNet to fight against a friend!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343020/header.jpg?t=1470736607",
    "minimum_requirements": "OS: Windows XP Processor: Intel or AMD Dual Core Processor Memory: 2 GB RAM Graphics: Intel HD 4000 DirectX: Version 9.0c Storage: 800 MB available space Sound Card: DirectX 9.0c compatible Additional Notes: The game does not run well on most of the integrated video cards such as Intel GMA. It also requires at least 256 MB of video memory to run smoothly. Xbox360 controller recommended.",
    "recommended_requirements": "OS: Windows 7 Processor: Intel or AMD QUad Core Processor Memory: 4 GB RAM Graphics: GeForce GTX 550, ATI Radeon HD75xx DirectX: Version 9.0c Storage: 800 MB available space Sound Card: DirectX 9.0c compatible",
    "reviews": [
        {
            "review_text": "having tried MagNets as an early version mid 2014 and then trying it again January 2015 I have to say the changes have been amazing it was in my opinion a good game in 2014 and now it is amazing1 Fun, Challenging, bright and colourful!  I find it much easier to play with a controler but it does cause a painful trigger finger because you just wannt get all the blocksbots!  I would highly recommend MagNets as a game to jump in and play adding the leaderboards means you can strive to beat your personal best!  I will follow up with a video on the local pvp!  GET THIS GAME",
            "review_score": "1"
        }
    ]
}