{
    "app_id": 343100,
    "name": "Overture",
    "release_date": "2015-02-02",
    "developer": [
        "Black Shell Games"
    ],
    "publisher": [
        "Black Shell Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Action",
        "RPG"
    ],
    "achievements": 4,
    "positive_ratings": 869,
    "negative_ratings": 236,
    "price": 3.99,
    "description": "Overture is an action-adventure roguelike which draws heavy inspiration from hits such as Diablo, Realm of The Mad God, Zelda, and The Binding of Isaac. Explore vast randomly generated dungeons and slay hordes of cunning enemies!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343100/header.jpg?t=1480022718",
    "minimum_requirements": "OS: Windows 7 Processor: 2.0 GHz Memory: 1 GB RAM Graphics: Integrated Graphics Storage: 50 MB available space Sound Card: Integrated Audio",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fun little game. I found it to be sort of 3 parts rogue-like and 1 part Gauntlet. You basically fight swarms of enemies in procedurally generated level and then a boss at the end. That's about all there is to it but there's a wide variety of classes that you can unlock and upgrade that all play a little bit differently.  It's got that addictive just one more game quality and you can play it in short bursts. Dying is not a huge deal because you keep your money and can use it to upgrade so you still advance even through dying. It reminds me a bit of Rogue Legacy in that regard.  Chiptune music is nice and works really well with the game. The price is reasonable and I think fair for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "  this game is pointless, it advertises itself as rogue-like and first you have the impression that it works like Rogue Legacy, you fight until you die and buy upgrades. But there is no point to keep playing, there are infinite levels even if the achievements pretend that there is an end and you just keep playing the same levels over and over. Feels like a cheap mobile game that isn't even worth a single buck.",
            "review_score": "-1"
        },
        {
            "review_text": "One game mode - spawning in a floor and killing the giant ooze, then another boss, and repeating (well, I assume, I only ever made it to the 3rd floor). Has potential but a lot of issues right now. Spawning of enemies is too eratic (I've pretty much died before my screen was fully visible) and it's way too difficult to see anything, especially when you die in only a few hits. There's not much of a tutorial and the game starts at a pretty fast pace without a lot of explanation about anything, but it's fairly intuitive so that's fine. It would be nice if there was a health and mana bar that wasn't right below your character, because it's almost impossible to see when you're swarmed. Could also be improved if there was a simple replay button instead of bringing you back to the main menu when you die (which you will do a lot). A more complex upgrade system would be nice, I only got my ranger to level 6 or so but from what I saw it only increased damage, but being able to upgrade armor, health, and mana as well would be nice. There are 5 item slots that are nice for a little bit of customization but each type of armor slot all provide the same buff (weapon is attack, armor is def, etc.) and maybe a random chance buff (8% more gold or something). There are 24 total characters I think, and there is enough variation between them where for the most part they feel unique, but ultimately the gameplay is all the same: hold left click and dodge, with an occasional right click; how oftten you right click is probably the main difference. Overall it's decently fun but it doesn't seem to have much depth and as others have pointed out, it's just a bit of a grindfest.",
            "review_score": "-1"
        },
        {
            "review_text": "  I was a (very) early adopter for Overture and had a lot of fun playing for 20-minute stretches here and there initially, but the difficulty and general pointlessness got old pretty quickly and I ended up shelving the game. Now that I have a couch-gaming setup, I was eager to inaugurate it with something that wasn't going to be too twitchy (wireless lag being what it is) and decided to boot up Overture again to see what improvements had been made in the eight months or so since I last played it.  And that's when I found out that in order to upgrade my Knight, I'd first need to unlock all twenty-something other characters, many of which I have no interest whatsoever in using due to their playstyles. Given my gold collection rates, it seems like this would translate to roughly 20-30 minutes of farming per unlock, with very little chance of making it past the second floor with my un-upgraded starting characters in the meantime. In other words, the only reason to play Overture at this point is to collect gold to unlock other characters to collect gold to unlock other characters... etc. For 12+ hours before you can even start progressing through the floors.  I hope this restriction will be rolled back in a near-future update, because frankly, if I were eligible for a refund I'd have done it in a heartbeat. WTF, Black Shell?",
            "review_score": "-1"
        },
        {
            "review_text": "How this game came to my library?  I dont know,dont care...  But this game is nuts!",
            "review_score": "1"
        },
        {
            "review_text": "Very hyper, fun and chaotic top down shooter RPG with lots of different characters, each with their own attacks and play styles. Even while just newly released, the game is still fantastic as-is. I'm looking forward to seeing where they go with it, and all they plan to add to it.",
            "review_score": "1"
        },
        {
            "review_text": "Pixelated game, sure. but it's still a great game on the inside. Rogue-ish dungeon crawler with an oldschool kind of feel to it. It's not too modern, and not too old. Gem in my heart any day of the week. If you're looking for a cheap, fun game to just waste time on, this game is for you.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a must have for 50 cents. Enjoyed it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "  Introduction:",
            "review_score": "1"
        },
        {
            "review_text": "ridiculous and stupid!  I hate Games, where enemys spawn on you and you are insta dead!!!  games without content have to do this 'trick'  and the percentage of the reached achievements are from the developers themselves. you know? ;)",
            "review_score": "-1"
        },
        {
            "review_text": "Loads of action and loads of enemies... can get a bit repetitive though.  Overture has basic pixel-art graphics and a great soundtrack.   You can pick a character from 4 distinct groups and every group contains a few different hero types. After that you're thrown head fisrt into the action. You can move around a medium sized arena and your goal is to descend 10 floors and kill the final baddie. Combat is simple: hold LMB for your basic attack, which can be a quick slash or a stream of fireballs depending on who you chose to play as, and RMB is your hero's stronger ability, for instance the Druid can shapeshift or the Arsonist can randomly lay down flames that continually damage your enemy. There is also a sprint mechanic where you make your character follow the mouse cursor and it will give you a small speed boost as long you don't attack during the sprint.  Action can get a bit hectic, because sometimes there is so much going on screen: enemies, damage numbers, loot, fireballs. It can be a total mess at times, but it won't last longer than a few seconds, either you kill all enemies or the trample you. After the battlefield calms down you can pick up t3h ph4t l3wt left by the enemies. Items like armor to raise your defense, heal you or boost your attack power are all present here.  After you die (this will happen a lot) or beat the game (this takes some practice to do) you will be shown the result gravestone telling you how many enemies you've defeated and how much gold you were able to snatch. Gold can be used to unlock new character classes and permanently increase their attack power - you will need to do this to stand a chance at the later stages of the game.  Final verdict: A simple and hectic hack&amp;slash that can get a bit repetitive, but overall a nice time killer. :&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Overture Review  PROS: +Infinite Replay Value +Tons of unique characters +Rouge-like +Randomly Generated Dungeons + Different themes +Permadeath/upgrades  CONS: -Only able to upgrade attack -Not many items in game -Little Enemies -Little Bosses -'Easy'  In short, amazing game. The developers are working on the cons and as long as Kabam doesnt buy it out like RotMG, should be a must buy for the rougelike fans.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great considering it just came out. For me it is very rage inducing, but other than that, the gameplay is phenomenal and each character is unique in their own way. The randomly generated rooms and bosses, just like The Binding of Isaac, makes the game a lot more chellenging and fun. I hope everyone else that gets this game enjoys it!",
            "review_score": "1"
        },
        {
            "review_text": "it is definitely one of my top ten games to tell my friends about 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like Gauntlet and Gradius had some kind of twisted lovechild.",
            "review_score": "1"
        },
        {
            "review_text": "This game, This game is a fast pace dungeon crawl you the option to between four classes mage, warrior, rouge, and shaman. In the classes there are four differnt type of hero to choose from. If you are ready to die over and over agian and still only make it to the second floor this game is for you and hopefully they will soon add a option to crawl through the dungeon, I really reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "ACE love the game and the music",
            "review_score": "1"
        },
        {
            "review_text": "This game is cute, i would recommend it for like 3 hours untill you unlock all classes . Its a good time killer and some classes are rather interesting",
            "review_score": "1"
        },
        {
            "review_text": "Fun game along the lines of HeroSeige and the like. Definitely worth checking out, lots of fun to play in bursts with no need to dedicate chunks of your life to it. Another great title by the developers of SanctuaryRPG.",
            "review_score": "1"
        },
        {
            "review_text": "  Incredibly fun and hookable (addictive).",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I am totally digging this game! It's got constant action and challenge which keeps me on my toes. Well worth more than what i paid for it in my opinion. Can't wait to see how far this game will go! If you love binding of isaac, you will love this game.  PS: Loving the variety of class choices!",
            "review_score": "1"
        },
        {
            "review_text": "This game seems so simple, which is one of the best feature i think.  not much to think, pick a favorite character and just play it.   i think this game can be still developed that there should be some modefier for the screen shaker - screen is too shaky that my head hurts after playing about 50 minute. :p   beside that, its good - 4 branch of class, several sub-branches for each job and leveling them up is quite a fun for me.   doesnt need lot of instruction, just running process is hard( wish that if we press shift we can run..as usual. too hard y'know)   never wrote a review before, this is my first one, that i actually think this is fun game.   keep goin for us :D   한국사람들중에 이거를 많이 가지고 있을지는 모르겠지만 단순한 패턴이면서도 중독성있는, 또한 끊임 없이 도전하고싶은 욕구를 만들던 게임. 아마 아이작 다음으로 중독성있는 게임이 될수도 있겠다는 생각이 듭니다.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good. nice to play.",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting ♥♥♥♥...but to be honest, this game is pretty freaking cool. Its not worth 5 bucks, get it when its on sale. You wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Reasonably fun, but sometimes a bit unfair.   If Realm of the Mad God is your calling in life, then you definitely want this game.",
            "review_score": "1"
        },
        {
            "review_text": "really needs boss debuff or faster move speed i found that i was taking ♥♥♥♥ loads of damge form the boss and bearly doing any to the boss and i could bearly doge his attacks.",
            "review_score": "-1"
        },
        {
            "review_text": "great lil game reminds me of diablo 1 sorta fun game but a pain in the butt",
            "review_score": "1"
        },
        {
            "review_text": "How cotrolner?",
            "review_score": "1"
        },
        {
            "review_text": "Simply cancer. Don't buy it. Obviously no one tested this game. Enemies are doing constant zerg rush from whole map to where you are. Tiny enemy projectiles which are barely visible to eyes makes it almost impossible to dodge, especially when whole screen is shaking and enemy minions take up 50% of your screen. Your scalling is crap and no feeling of progression. Only way to beat this game is by getting items which give % chance of hp potion on hit. Amazing... Also, most of the time boss fights between the floors are idiotic.Either bosses unleash bullet hell in a very cramped arena and with melee character it is instant game over or they use mega dash to stand on you and deal lots of damage.  Summary: This game was created by 5 year old who didn't have friends, that's why no one tested it and now it is garbage. With rebalancing and adding new item effects, this game could be good.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: 1. Can't see traps because thousands of dead corpses cover them 2. Can't see enemies because giant numbers everywhere 3. Can't see enemy projectiles, because they are going through ranks of your enemies 4. Can't see your health bar, because explosions and screen shake  Cons: 1. Cheeki Breeki  Conclusion: 1. Enjoy this lovely RPG, Rogue, Bullet hell kind of game",
            "review_score": "1"
        },
        {
            "review_text": "I have quite a few rogue lite and like games in my library, so whenever i see one i tend to get them and try them out. This one seemed like it could be fun given the classes etc...  However such is not the case in this game. It's fun when you boot up. Walking around and slashing and killing mass enemies, but when you find the boss it tends to be a different story. Sometimes the bosses can end up over poison, and they don't move which makes it hard to kill them without dying a painful death. Even if you manage to kill the boss that leads down the stairs, you end up fighting another boss that if it manages to hit you, locks you down until you die.  Weapons don't seem to add much of anything to your attack value as the damage numbers rarely go above 300 even after picking up a weapon.   This game has an excruciatingly bad boss system with zero chance of staying away once you get hit as they slow you down. If you're looking for a rogue lite or like game, this is not the one to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Not much to say here, its a decent game to chill on, but not a game to spend hours in",
            "review_score": "-1"
        },
        {
            "review_text": "Cannot recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A thoroughly enjoyable game. I dont normally care for Rogue-likes (I played Binding and quit after the first completion) however I just keep coming back for small sessions.   I describe the game asthetic as Dragon Warrior characters playing Gauntlet with some bullet hell mixed in for the bosses. There are a huge selection of unlockable characters, each one with variety for the two available powers. It seems to me the main (LMB) ones are fairly simple but the specials (RMB) are where the character flavor come from.  It takes some experminentation to determine one that fits your playing style. Its not the most friendly to new folks as there are very few explanations for what things do or how it goes other than the running fast mechanic which is really only essential in the boss fights. Heck, I STILL dont know what Essence is.  It can be brutally difficult if you randomly get a hard counter to your current player's powers, my first try I didnt get past level one. But perseverance and bit of luck will get your further and further each time.  Overall, I think this game will stay in my rotation for when I am doing things like listening to a short podcast or just have a limited amount of time. I had fun and I want to play more if it which I cant say about a lot of games these days. I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I generally don't like roguelikes, but this one is addictive. It's hard, but it's intuitive and you quickly get used to the chaos on the screen. There are also a TON of classes to play as, so eventually you are bound to find one that appeals to you. I recommend the monk.",
            "review_score": "1"
        },
        {
            "review_text": "A fast-paced, rougelike bullet hell thats highly addicting. 10/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "So, I won this game off a raffle, and I was told I should leave a review on the page.   I boot up the game, not quite sure what to expect. Picked a mage, and lo and behold I was plunked down on a map. I was wondering where the enemies were...until I was suddenly thrown into battle! Pretty soon I was frantically scurrying, shooting down whatever moved, and gathering as much gold as I could. It was pretty frantic and messy...and awesome.  Took me a while before I could even get off the first floor...I thought the slime that guarded the stairs was the floors boss, until I cleared one and faced the real boss...then realized there seemed to be much more to go.  This game is quick, brutal, random, and frantic. It has a host of different characters, and random gear scattered around. It's got a nice art style, and the music is pretty good too. It has randomly generated environments. And finally, I think that's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Initial impressions are very positive. Game starts, you pick your class, and you're thrown into a dungeon with only basic controls info. Items and upgrades are very self explanatory and simple. Easy to get overwhelmed, even on world 1-1, if you're not careful. Not easy, but not obnoxiously difficult. Plays very much like Realm of the Mad God. Only difficulty I had is it is sometimes very difficult to see enemy projectiles, especially if you are a mage class which is filling up the screen with magic effects. Usually when I died I had no idea what killed me, but it was always when I was overwhelmed by enemies on screen, so that could just be considered part of the challenge. Definitely worth a fiver and some attention if you dig Realm and are into roguelikes.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice Game, a good miscelaneous of Action-Rpg and Bullet Hell. It's very replayable due to his variety of class, each unique and different from other both in stats and moves. The game is very 'easy to learn' but 'hard to master', seriously...is difficult as hell to win...xD (good thing to me, I love to challenge myself :p). good sounds, fits well with this kind of game. Also the dev Daniel is really attentive to what's the people say, go and watch the forum for the proof &gt;.&lt; Ultimately: nice game, cheap too, really good developer. Worth it :p",
            "review_score": "1"
        },
        {
            "review_text": "Very nice and addictive. Worth playing. Also very hard.",
            "review_score": "1"
        },
        {
            "review_text": "fun, quick, action packed, with lots of classes and on the fly customization. it has rougle-lite qualities, randomly generated level, one life, lite rpg elements, but you collect gold the entire time, and you can use that gold, after you die, to upgrade or unlock new classes. lots of different monsters, mini-bosses and end-bosses to experience as well.",
            "review_score": "1"
        },
        {
            "review_text": "I am writing this review not only as a YouTuber who has a series on it, but someone who has been looking for an awesome game like this for quite sometime.   The soundtrack is epic. I love music with my games, and the soundtrack for this game is pure awesomesauce. I don't have to turn on my spotify for some music when playing this game.  The graphics are amazing. This takes me back to my childhood when I played Zelda. I love the pixel art type of graphics. Simple yet epic.  Overall game play is good, but I do wish that floor 1 was the easy of the boards. Meaning, Floor one is kind of like a tutorial and then as you advance you get harder boards. This game is hard from floor 1-1 so if you are ready to grind, get this game.  Overall a 8.5 of 10 on my scale.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun roguelike + bullet hell combo.  Has lots of characters to unlock, although balance issues are present.  Has fun mechanics and characters have passives, normal attacks and special attacks.  4 item slots but imo needs more variety on items.  Recommended to play on fullscreen mode because windowed mode is way too small, trust me.  If you haven't seen the gameplay videos, think Binding of Isaac - only 300% more frenetic.",
            "review_score": "1"
        },
        {
            "review_text": "The unlocks are quite easily paced, and the amount of different (quite different) classes is astounding. A lot of fun, even when you fail remarkably quickly at first, to upgrade those classes and unlock new ones.",
            "review_score": "1"
        },
        {
            "review_text": "Aight",
            "review_score": "-1"
        },
        {
            "review_text": "Decent time killer, gameplay isn't that fleshed out but satisfying enough, quite hard",
            "review_score": "1"
        },
        {
            "review_text": "This game is SO addicting, but the RNG is kinda bull s*** sometimes. EG: 2 skeletons spawn ON TOP of me, before I had a chance to move, (while I was moving floors.)",
            "review_score": "1"
        },
        {
            "review_text": "SUMMARY: A seemingly simple, brutally hard, speed roguelike that has unexpected depth and unlockables as you play. A fast, twitchy grab-the-gold, kill-the-monster, go-as-deep-as-you-can game great for people looking for that experience. Has a lot to offer, but takes some patience.  Overture is the classic, stereotypical dungeon crawler/roguelike boiled down to its basic - go into a dungeon as a given class, slaughter monsters, level up, grab treasure, live as long as you can. It's for fun, fast, short-term play - though you may be surprised how long you may play it.  You pick a class, which has two different attack abilities, and wander across a randomly geneated field, battling monsters of many kinds by using your various abilities. The monsters themselves have different abilities, though most are cannon fodder - but watch out, some more powerful versions (who have titles or are different sizes) and special monsters may surprise you.  Monsters and various chests, jars, and barrels will drop treasure. Most of this is gold and healing and mana potions, but the occasional piece of equipment drops as well. The equipment often has little game-changing rules and additions that can make a different and require some thought. You may even find NPCs who join you - until the inevitable onslaughts kill them off.  Each level has a boss monster guarding a stairwell, which leads in turn to a REAL boss monster. Defeat these much more difficult opponents and you get a bonus to mana or health, a chance to buy random equipment, and then move on to the next level.  The game at first seems overly simple and overly hard, but rewards retrying. Classes are different - radically different. You can learn strategies for different enemies. Gold and scrolls (which can become gold) that you recover can unlock new classes and level up ones you already have. There's a lot to the game, its just often concealed beneath the frenzy and the randomness.  The game's biggest flaws are erratic difficulty and limited documentation - made more painful due to the randomness. It takes patience to get into it enough to really enjoy it. More polishing and documentation would definitely help.  Do I reccomend it? Like many games, the question is 'is it your thing.' It's not something everyone must play - it is something for people who like dungeon crawlers and action, and want a 'hardcore casual' game that's challenging, but can also be picked up and put down. In the latter case, Overture delivers. ",
            "review_score": "1"
        },
        {
            "review_text": "An excellent top-doon rouge-lite adventure hack n slash rpg! Great 16 bit visuals are accompanied by an equally awesome soundtrack, add that with simple but addictive gameplay and you have a great game worthy of your time!  Also good for going back for a quick 15min game every now and then!  Looks: A* - I'm a little biased as a love retro styled game, but honestly amazing art style!  Gameplay: A - I enjoy the simplicity of the gameplay and how you can just jump into a game for a quick 10 minutes! Although I would like controller support :).  Sound: A* - Amazing OST and sound effects! I currently have the OST playing in my car it's THAT good!  Price: A* - £3.99 (via Steam) is an insane price for this game, value for money is something of a rarity and Overture gives you exactly that!  Enjoyment: A* - I'm having a blast on this game, damn it's addictiveness I can't put it down!",
            "review_score": "1"
        },
        {
            "review_text": "I rarely write reviews but I do not recommend this game. There is little dynamic game play available within individual runs... Instead, the games relies on many characters (some that aren't worth playing at all). I figured I would try it out since it is cheap - don't make the same mistake.",
            "review_score": "-1"
        },
        {
            "review_text": "  Is playing payday 2 Tabs out to pause a video for Shadow Raid run Sees gift window, looks at it, game calle Overture from a friend I met on payday 2 a day or two ago Clicks accept, adds to library, and installs the game Boots up the game after shadow raid is over Gets killed 6 times  10/10 would stop playing Payday 2 again for bullet hell roguelike. XD Definitely gonna play more between payday 2 rounds.",
            "review_score": "1"
        },
        {
            "review_text": "  A nice time waster. Very good idea for a dungeon runner type game. Definitely a recommend :)",
            "review_score": "1"
        },
        {
            "review_text": "Reminiscent of Realm of the Mad God, Nuclear Throne, and roguelikes, Overture is a fast paced bullet hell. The animation seems a bit spartan but it fits the overall visual theme just fine. However I found it very easy to lose your character onscreen when in the thick of heavy combat. Overall? A good time killer for short sprints that could use a bit of polish.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beast. Awesome arena shmup. So happy controller support came out for this too. Unlocking new heroes is easy and leveling up is fast. But the levels get so intense the further you go. Get ready to die a lot. I wish this game had co-op options.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure if there's any other way to play the game than frantic clicking and zooming about, but I like it anyway, and for the price, ♥♥♥♥♥♥♥ it's a great game to kill a little time on.",
            "review_score": "1"
        },
        {
            "review_text": "Greate exiting game!",
            "review_score": "1"
        },
        {
            "review_text": "'Bullet hell'-esque Twinstick shooter in a small area . Clear a level, fight a boss, rince and repeat.  I actually think this game is mind numbingly stupid. The heroes all play very similar (and yet seem so imbalanced!). Every run is almost the same. Gameplay is so minimalistic (but not awful). Graphics are bad.  Yet I keep coming back for more. The short runs, the 'you get to keep something from every run' meta game is great. One day I  will  get one of those achievements. (27 hours in, I've leveled lots of heroes 15+. Stage '1-5' as best right now, I wonder how many there are?).   Great as a 'a few runs a day'-game I suppose. The meta game is better than the actual game. But maybe that's fine. At least for a achievment whoer like myself.",
            "review_score": "1"
        },
        {
            "review_text": "This is actually a very pleasant but simple game, its not very in depth but because of how its implemented makes it a pleasure to play. I also enjoy games with increased difficulty and ones that punish mistakes, this one takes a bite out of the cake for sure. This game would be perfect for a phone/hand held device. I would consider this game a alittle more indepth than a mini game or compare it to the binding of isaac. If you see this in a bundle its worth the pick up for a cheap price.",
            "review_score": "1"
        },
        {
            "review_text": "All you have to do to get a good vote these days is remind people that the game 'draws heavy inspiration' from other, much better, more famous games.  This game is NOTHING like Zelda, Mad God, or Isaac, so don't believe that hock. It's just click-spamming everything to death, and dumping gold on your characters to incrementally increase their abilities. This feels like a click-game, minus the idle element, which is the only reason those games are attractive.",
            "review_score": "-1"
        },
        {
            "review_text": "To be completely honest, i have no idea how i got this game. One day it simply appeared in my inventory. ALREADY DOWNLOADED.  I have no idea how i got this game but that's okay because it is the most beautiful thing i've ever played.  10/10 would watch myself die and then explode into more blood than 30 elephants crushed by a car again",
            "review_score": "1"
        },
        {
            "review_text": "unique and solid game for the price! i enjoy the 8-bit style and the catchy music. Also, this just appeared in my library and im glad it did!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a crazy amount of fun. It's refreshing to just toss cumbersome plots aside and play a game for the fun of it.",
            "review_score": "1"
        },
        {
            "review_text": "  There are many reviews on this game saying they hate it because they think one class is op and they die instantly as any other class (1), it is pure chaos (2), they die instantly as any class (3), their finger hurts from spam clicking (4), or it's just crap (5).  1 Everyone has different strengths. I was gifted this game by a friend, and he can't stop ranting about how op the cleric is, but I die quickly as the cleric and am good with the rogue class and ok with the knight.   2 If you use good strategy, you can spread out the enemies and not get surrounded. If you don't, you could get surrounded. If you are one of the people that get surrounded, I would recommend the knight, as he is a heavy hitting melee character with a secondary that sends out a ring of poison to weaken enemes. The cleric also has a secondary that is like the knight's, but I don't know how to use it well. Back to the part about it being chaos, it is meant to be that way.  3 The maps and enemies are randomly spawned. If you die instantly, the enemies just spawned all around you. Try again and you'll get a different result. It has happened to me quite a few times.  4 If you hold the mouse button, it attacks automatically, and faster than you could ever click.  5 One, that is your opinion. Two, this game was originally a kickstarter just a year ago. Yes it will have flaws, but they churn out updates and new features. (That 4pack option just screams multiplayer)  Though I recieved this game from a friend, I think it is well worth the $5 for a chaotic, young, quick fix game.",
            "review_score": "1"
        },
        {
            "review_text": "This game...is very deceptive. On the surface it looks like a basic cookie-cutter Hack n' Slash that will take no time at all to win but it is actually quite extensive, rather difficult, and very addictive. It is (or used to be - the most recent update seems to have slowed things down a bit) one of the most fast-paced Roguelikes I have ever seen, and that is the rub because you need to play it in order to know what it is really like so I am not surprised that it doesn't get mentioned very often. I found this game because I wanted something cheap that I would only play every now and then but I keep coming back to it and that is saying something. Again, nothing spectacular or mind-blowing here, but Overture is definately a very underrated game. Roguelike fans will appreciate how intense and sometimes downright futile the levels can be and newcomers will enjoy how well Overture teaches them about the genre straight away. Nothing fancy; no elaborate opening or intricate plot. You just choose your character and go at it. The graphics are clear-cut (which I think is important in 2D games) and the soundtrack is fantastic. Simple mechanics and absorbing gameplay. Black Shell Games knows how to make a game that does nothing more than what it is supposed to do.  Two thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "  A very fun game ",
            "review_score": "1"
        },
        {
            "review_text": "A very very fun game",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but lacks local co-op",
            "review_score": "1"
        }
    ]
}