{
    "app_id": 343180,
    "name": "Top Trumps Turbo",
    "release_date": "2015-03-20",
    "developer": [
        "Good Day Games",
        "NYX Digital"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Card Game"
    ],
    "achievements": 0,
    "positive_ratings": 64,
    "negative_ratings": 123,
    "price": 2.09,
    "description": "Top Trumps™ Turbo is a brand new, exclusive fun and exciting Top Trumps™ card game brought to you by Funbox Media. Use the cards and your skills to beat the computer and become the ultimate Top Trumps™ Turbo Champion!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343180/header.jpg?t=1530529955",
    "minimum_requirements": "OS: Windows® XP/Vista/7/8 with latest service packs Processor: Intel® Core™2 Duo 2Ghz or equivalent Memory: 2 GB RAM Graphics: NVIDIA® GeForce® 8800GT 512MB or equivalent DirectX: Version 9.0c Network: Broadband Internet connection",
    "recommended_requirements": "OS: Windows® Vista/7/8 64-bit with latest service packs Processor: Intel® Core™ i5 or equivalent Memory: 8 GB RAM Graphics: NVIDIA® GeForce® GTX 460 1GB or equivalent DirectX: Version 9.0c Network: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "This game is broken.  So here's the problem, the music will make yours ears bleed, the graphics look like an old Playstation 1 game, and even after restarting and trying a much lower graphical setting the game still wouldn't run correctly.  Everything was pink and I couldn't even see what my cards said. Maybe in the future after some bug fixes this will be worth it, but it is definitely not worth the time now.",
            "review_score": "-1"
        },
        {
            "review_text": "Same issue as Pan. Lots of pink. Can't see cards. Can't play. Too bad, too. I was looking forward to playing. Hope they fix this. Can't recommend unless it's fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "  I like playing Top Trumps cards. I do not like this game.  There is the obvious, very pink, elephant in the room. All of the textures were pink when I loaded up the game, it's easily fixed by changing launch options but I expected the developers to have fixed that by now. Graphically it isn't very impressive and looks like a much older game than something released in 2015. The music is kind of terrible too.  You aren't told what some of the statistics mean and whether it is 'better' to have a higher or lower value. I assumed that 'Hall of Fame' was how high in popularity they were in some ranking somewhere, with 1 obviously being the number 1 entry and therefore better. But it is the opposite.  There is no option to play classic TT either, with a whole deck being dealt and playing until one person has no cards. Currently it is more like really short (1-2 minutes at most) mini-games followed by a slightly longer round. I don't mind the mini-games but it would be nice to have the option to play with a full deck.  Luckily I got a free copy of the game in a giveaway because I certainly would not pay £15 for this. I doubt it would even be worth buying when it is on sale. If you want to spend that much just go out and buy a few packs of real Top Trumps cards and play with your friends and family (or strangers on the bus).",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty fun to play game. It is kind of confusing at first, but once you understand it, it is pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good and fun game ,but not really for me , thanks!",
            "review_score": "1"
        }
    ]
}