{
    "app_id": 343120,
    "name": "Motorbike",
    "release_date": "2015-01-19",
    "developer": [
        "baKno Games"
    ],
    "publisher": [
        "baKno Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Local Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Full controller support",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 39,
    "negative_ratings": 19,
    "price": 7.19,
    "description": "A casual bike skills game full of action and real physics dynamics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343120/header.jpg?t=1503091167",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: XP Processor: Intel single core Memory: 1 GB RAM Graphics: 2004 GPU Storage: 400 MB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: 7 Processor: Intel multi core Memory: 4 GB RAM Graphics: 2010 GPU DirectX: Version 7.0 Network: Broadband Internet connection Storage: 700 MB available space",
    "reviews": [
        {
            "review_text": "this game is good cool and fun i love the bikes i love the riders and the tracks i love it !!!!!!!!!!!!!!!!1",
            "review_score": "1"
        },
        {
            "review_text": "Awesome!   Good [b\\] Built in replay Graphics Big choice of maps Weather    Bad [b\\] Small choice of bikes and colours  Slow replay exporting  ",
            "review_score": "1"
        },
        {
            "review_text": "first of all i have played another 10 hours of them ac version so don't complain about me playing the game for 1.5 hours  Motorbike is a nice casual motorbike sim but has a couple of problems  1. when making your own levels sometimes ramps and stuff can randomly become invisible 2. no fullscreen 3. some frame stuttering  overall with a simple patch this game could be one of the best motorbike games on steam plus it's 5 bucks 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Game needs work. No option to change controls, controls screen doesn't stay on long enough to read everything. Physics seems a bit off, especially the reverse gear power. This game wasn't for me sadly.",
            "review_score": "-1"
        },
        {
            "review_text": "dont get this game it is aids and cancer combined",
            "review_score": "-1"
        }
    ]
}