{
    "app_id": 343370,
    "name": "SLAMMED!",
    "release_date": "2015-01-30",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Choose Your Own Adventure"
    ],
    "achievements": 70,
    "positive_ratings": 92,
    "negative_ratings": 5,
    "price": 3.99,
    "description": "Turn a scripted steel-cage wrestling match into a real fight in this 250,000-word interactive novel, the greatest text-based pro-wrestling RPG in the world!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343370/header.jpg?t=1538621512",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought Slammed! when it originally released as one of my first COGs, and have played it many times since then, so I’m happy to see it finally get its day in the spotlight here on steam, as it is one of the best titles they have published to date.  I know a lot of you probably aren’t wrasslin’ fans, and you don’t have to be. If you enjoy interactive fiction, you’ll still find a great story with interesting characters and a TON of character choice and different routes for replayability.   For those of you that are or have been fans, however, you have the added bonus of enjoying loads of in-jokes and references that will make you smile – maybe even a few laugh out loud moments too – and have fun matching the game’s characters to the people they are actually based on. It’s always nice when a writer has such a grasp on and love for the material he is writing as the game’s quality can only be strengthened by it. Not only is it a great read, but it is a fictionalized walk through memory lane. (It is kind of sad to play as a female wrestler, though, as the fictional divas division is certainly better handled than the real one :p )   Tldr; Slammed is a lengthy CYOA of rising to fame in the GWA. There are many ways to make it, and more than a few ways to fail; do your skills have what it takes to make you the next HBK or Stone Cold? ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the better written interactive novels. Slammed takes you into the seedy side of 'professional' wrestling and does a nice job of delivering you an experience while still letting you make decisions within the framework of the story. I've only completed one play through so I'm not sure how interesting it would be to play again but I can see how things could branch into different directions. Especially if you wanted to play a 'Heel'. If you are at all interested and enjoy the genre then I give this a high recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "It's a wrestling CYOA with more branching paths than Alpha Protocol. Better gameplay and writing, too :)  Seriously, play this.",
            "review_score": "1"
        },
        {
            "review_text": "I bought SLAMMED! as part of a bundle not really thinking I would play it. I have zero knowledge or interest in wrestling, but this is one of the best interactive fiction games I've played. The writing is brilliant. I felt invested in the world and its characters as I played. I felt the rush of my victories and the humiliation of my defeats. My choices had weight to them. The stat system was implemented very well, and worked with the story rather than over powering it. I will definitely be playing again.",
            "review_score": "1"
        },
        {
            "review_text": "Best friend ruined my career. 10/10 it's ok",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly well written and fun game, I expected something light to pass the time, but actually got really invested in the story and couldn't put it down until the end. My only complaint is that I wish it was longer, but it's excellent value for money. Also, I believe it has some replayablity, even if I think I'll wait a week for my next playthrough, this time as a heel!",
            "review_score": "1"
        },
        {
            "review_text": "Got ♥♥♥♥ beat out of me by old man Met girl and helped her Got fired Wore a mask Had girl be my manager Take off mask 'IT'S ME AUSTIN!' Get title shot Punched in face Lose infront of 80000 people but still get the girl 8/8 M8",
            "review_score": "1"
        },
        {
            "review_text": "This interactive choose your own adventure story is truly amazing. It's filled with action, drama, and even romance. Work your way up to becoming the world's greatest wrestler, focus on gaining revenge against your childhood rival, or become the biggest villain in the world of sports. It's all up to you. The game is filled with crazy twists and turns and is fun to play through multiple times.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for wrestling fans and/or fans of good storytelling. Better storyline than any WWE game made in the last 10 years, and better storylines than a lot of wrestling on TV.  I just finished my first playthrough. It was a 6 hour thrillride of a story, with decision making that really affected the outcomes. You can get some things you want, but it seems impossible to have it all. I'm already thinking about what I can do differently on my next playthough.",
            "review_score": "1"
        }
    ]
}