{
    "app_id": 343690,
    "name": "Silicone-2",
    "release_date": "2015-06-03",
    "developer": [
        "Dima Kiva"
    ],
    "publisher": [
        "Dima Kiva"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 13,
    "negative_ratings": 17,
    "price": 0.79,
    "description": "Silicone-2 - a shooter with a first-person. In the story the player will have to quell the uprising of robots.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343690/header.jpg?t=1447367475",
    "minimum_requirements": "OS: Windows XP, Vista, 7 Processor: Core 2 Duo Memory: 2 GB RAM Graphics: NVIDIA GeForce GTS 250 DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows XP, Vista, 7 Processor: Core 2 Duo Memory: 2 GB RAM Graphics: NVIDIA GeForce GTS 250 DirectX: Version 9.0 Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "it wont launch and its about a week after launch :/  UPDATE: Its been like 5 months, still no fix",
            "review_score": "-1"
        },
        {
            "review_text": "The unlucky ones are not those who experienced crash issues but those who managed to find some temporary fixes as Silicone-2 is nothing but a bland sci-fi action shooter.  Not that I expect every indie titles to have high production value but everything in the game is amateurish at best. The characters look like balloon shaped sex dolls with armor suit. The weapon selections is quite boring to use and lack variety: laser pistol, laser machine gun, emp grenade (let's not talk about the mounted machine gun sequence). The cutscenes, while I appreciate the efforts, could have benefited from english subtitles although the russian voice acting sounds bland.  The only positive thing I can mention about the game is that it takes some inspiration from Terminator (see one of the screenshots in the store page)... and it's still better than any Digital Homicide productions (yeah I know, this was just too easy to plug).  To those who couldn't run the game properly, you didn't miss anything:         YouTube™ Video:  Silicone-2 | 01 | Playthrough&nbsp;",
            "review_score": "-1"
        }
    ]
}