{
    "app_id": 343750,
    "name": "Firefly Online Cortex",
    "release_date": "2015-01-29",
    "developer": [
        "Spark Plug Games"
    ],
    "publisher": [
        "QMx Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Space"
    ],
    "achievements": 0,
    "positive_ratings": 272,
    "negative_ratings": 304,
    "price": 0.0,
    "description": "The Cortex is your ultimate destination for Firefly Online news and information. This companion app is a great way to stay current with the game’s progress, take advantage of special offers and gain access to exclusive content!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343750/header.jpg?t=1447367489",
    "minimum_requirements": "OS: Windows XP or greater Processor: 1.5Ghz or greater Memory: 2 GB RAM Graphics: DX9 (shader model 2.0) capabilitie DirectX: Version 9.0b Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The Firefly Online Cortex was a nice distraction, for a time.  Intended as a companion app for the forthcoming release of Firefly Online. There are some nice banjo tunes, reminiscient of the Firefly series. You're given the opportunity to spent some money, in support of the team, developing Firefly Online. For 5$ you'll get to be a   'Big Damn Hero'.  Sounds shiny. For your money, you'll be able the access a devblog, which has rather been neglected, if not desserted. When there is a post, its saddly more fluff, than any real information.   Also you'll get access to a map of 'The Verse', where you are able to do Trade Runs. Meaning clicking on three planets on the map, to get a loot box. In this box are cards, with pictures from the series. Collecting these cards rewards you some in-game fluff for the game.  One run gets you 50 Brownie Points, the in-app currency. The random generator hates everyone the same, as the devs pointed out. So you can get as high as 500.000 Brownie Points, or higher, and still be  left wanting for some cards, to finish your set.   But you'll also presented with the oppurtunity to buy card packs, in different price categories. If you're easy to be enraged, you  should be careful, as these packs also can tend to give you duplicates of cards you'll already have.   Update:  The Big Damn Hero Package is, as of now, not more available.",
            "review_score": "-1"
        },
        {
            "review_text": "I invested a lot of time and money into this app in anticipation of the game coming out. Sadly I must face the truth that the game will never come out and any time or money invested in this is a waste. It's a sad thing too as the app was a lot of fun and what they were showing for the game looked very promising.",
            "review_score": "-1"
        },
        {
            "review_text": "I had high hopes for this, paid for the Big Damn Hero thing, and still nothing. No news, no updates, just nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "Paid for the BDH badge and they don't even have the curtesy to tell supporters if the game is dead or still in development. Would have been an awesome game.",
            "review_score": "-1"
        },
        {
            "review_text": "this has become pointless",
            "review_score": "-1"
        },
        {
            "review_text": "from my understanding the development for this game is dead as dead gets",
            "review_score": "-1"
        },
        {
            "review_text": "Unless you're willing to pay $5, there's quite literally nothing to do except sign up, click some stuff, and then look at news that hasn't been updated for over a year. 'Curse your sudden but inevitable betrayal!'",
            "review_score": "-1"
        },
        {
            "review_text": "They stopped selling card packs because it 'causes a sync issue with the other platforms' (instead of fixing it, or removing IAP from the problem platforms, and even though any other game can do this). They stopped posting on Facebook because management got their feelings hurt.  Almost two months since the last communication from the developers.  I'm guessing this game is dead.",
            "review_score": "-1"
        },
        {
            "review_text": "The very first game I made an in-game purchase, ever. By sheer, unbelievable coincidence, I finished rewatching the whole series on Hulu two days ago. And right after that I learned about FFO —&nbsp;what a pleasant surprise! My favorite genre, single player RPG, in my favorite setting, space western. This companion app is a welcome distraction for all the fans who have been waiting for the game for over a year now. The app is not much yet, but neat and simple. The purchases are really more like crowdfunding contributions towards the big game — and it feels nice to participate.",
            "review_score": "1"
        },
        {
            "review_text": "The game has gone Silent. I guess you can stop the signal :(",
            "review_score": "-1"
        },
        {
            "review_text": "Great game start... cant wait for the v2.10 to be released (^_^) Shiney folks, I highly recommend to any browncoats out there!",
            "review_score": "1"
        },
        {
            "review_text": "This is not a ♥♥♥♥ing game. I have been waiting for FFO since I was a junior in high school, and this is what you give me?",
            "review_score": "-1"
        },
        {
            "review_text": "One year after the last news there is nothing happening. This project is deader than Wash.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a damn shiny app! It's more of a news/info/map of the Verse app than a game, BUT there's multiple ways to earn BPs (Brownie Points - cute huh?), which, simply put, will turn into currency in-game once FFO is out! Plenty of 'making of' video clips while they make it too! (And just a taste of Nathan as Mal in the Trade Route mini-game!) This companion app has more effort put into it than MOST MOBILE GAMES.  And before I'm flamed, YES, this is kind of freemium, BUT you have the power to buy or not, and it's balanced enough that you can keep going *without* purchases. Those just speed things up. And the cash that goes in seems to be going to the development of FFO, so who knows? Might be buying them time and resources the company running FFO isn't giving them! (Not sure if this is accurate though. But hell, in game they offer links to ALL their social media. Ask them where the cash goes. As far as I know, the above is true. Even selling the show digitally/on disc to raise funds via Amazon. Amazon gets a percentage, as does the dev team.)  TL;DR: (AKA In short), It's free, interesting, and if you dislike it, easy to uninstall! (And if you're lost, start with the TV show, then the one movie. ;) )",
            "review_score": "1"
        },
        {
            "review_text": "it is terrible what they don't tell you is to play the game you have to but a pack. so don't try it unless you want tp spend five dollars on a game that might not even work. so i say this again dont get ",
            "review_score": "-1"
        },
        {
            "review_text": "bad developer there should be laws on games that misslead players and do not come out with what is promised",
            "review_score": "-1"
        },
        {
            "review_text": "This is not the actual game, it is a way to keep up with the news on the creation of the game. Still awesome, just I didn't know what it was until I downloaded it. Update as of 3/12/16 It doesn't appear to be going anywhere anymore. No updates since sometime in the middle of last year.",
            "review_score": "-1"
        },
        {
            "review_text": "A quick yet entertaining diversion, a few minutes of fun for interesting rewards, and hopefully some beneficial rewards in the game to come.  Pros- - Cool epsode snapshots in the form of annotated cards. - Pretty and dynamic map of 'The Verse'. - Keep upto date with developments in an entertaining environment.  Cons- - Repetative with little variety. - No leaderboard.   Whilst a leaderboard wouldn't show much but how much griding some people have done it would be curious to know. Worth a look and a quick browse, shows some early promise if such a simple app can be made this entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE THIS!!! Even knowing this isn't a game, the experience and wealth of knowledge it is giving me is worth it. Browncoats worldwide will love the chance to read up on The Verse, and collect cards,BP etc. This little teaser is just making the wait for the actual game more bearable and now i just can't wait for the game itself. Also the BDH pack is well worth the $ or £ in my case, The Map will be invaluable come game time i'm sure.",
            "review_score": "1"
        },
        {
            "review_text": "*****edit: My recommendation is solelly on the fact that this is not a playable item to download—at all...The only thing that is functional out of this program that you download is that you can link to amazon if you wanted to buy the TV series on DVD...as well as give the emails of people that you know to get points I guess...*****  How does one access the map, cards, or practically anything on this App—if you can't do the Big Damn Hero thing?  ***EDIT2: Hope died...last I heard...they were having issues with FOX on releasing*** FIREFLY THE GAME. They way they were describing on some of the things I was reading from their FFo website is that it will be turn based, much like the board game, but with animated graphix.   If this game fails at least there is still Star Citizen. 'what is Star Citizen?' Its a open universe space/ship/sandbox/fps/racing/co-op/pvp game... google it and if its your first time try using the free code: STAR-DLNC-TS2S to get 5000 in game credits...",
            "review_score": "-1"
        },
        {
            "review_text": "The music, the visuals, the TRADING CARDS. So much to love about this, and the game isn't even out yet! *makes grabby hands*",
            "review_score": "1"
        },
        {
            "review_text": "I'm really looking forward to this game. In the mean time, the Cortex is amusing/addictive enough to keep me content while I wait. Def worth supporting by becoming a 'Big Damn Hero'!!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a firefly fan then download it and keep yourself up to date with the latest info on the game which sounds awesome.  If you are a firefly nutter like me and you pay the $5 then you will soon have collected all the cards in a few days and wonder when the next set is coming out and more goodies that can be used when the game comes out.  Not had it long but really could do with some more info on the game coming out. Ideas/flavour etc.  The 3d map is pretty cool as well and again if you like firefly then you get to roam around the map and see how everything is connected.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, really makes you ready for the full game.",
            "review_score": "1"
        },
        {
            "review_text": "What this is, isn't much. It's not meant to be. It's just a companion app to the upcoming Firefly MMO, which let you reserve an account and check news on the game. Don't expect more than that.  Using this app gives you brownie points, which will be used in the game when it launches.  If you are willing to dish out $5 to support development, you can get the Big Damn Heroes package, which unlocks a minigame and additional features. I do not have this package to say what it does, but I am curious.   As far as the unpaid version, this is not a game. It's just a place for info on a game in development.",
            "review_score": "1"
        },
        {
            "review_text": "This is a decent little app.   The voicework is good, the cards are fun to collect, purchase is not required.  The best part is getting familiar with the planets in the 'verse and where they are located. That ought to help when the full game is released (this summer IIRC).",
            "review_score": "1"
        },
        {
            "review_text": "It's a game where you have to pay to play.",
            "review_score": "-1"
        },
        {
            "review_text": "The map is great. The info is great. The card collecting is fun in and of itself.  It's pretty, it runs well, but it can get a little repetitive at times.",
            "review_score": "1"
        },
        {
            "review_text": "I've been waiting years for someone, ANYONE, to get the balls to do something about Firefly's lack of game status. While it's still in early stages, I have high hopes and will be keeping an eye on it.",
            "review_score": "1"
        },
        {
            "review_text": "A cool little companion app that lets the hardcore browncoats support the game before its release. All the while giving them a bit of a head start and some bonuses at the games release if they are willing to put in some time grinding trade routes. Ohh and you get some exclusive news about the game and the creative process that goes into it. :3",
            "review_score": "1"
        },
        {
            "review_text": "Not really a game but a free app going forward for the release of Firefly Onine...can't wait!",
            "review_score": "1"
        },
        {
            "review_text": "not the actual game.",
            "review_score": "-1"
        },
        {
            "review_text": "The free portion of this app is limited, yes. If you wish to support the development of the game, then you can pay $5 to get early access to the whole thing.   Be warned, this is NOT Firefly Online; it's a companion app.",
            "review_score": "1"
        },
        {
            "review_text": "It says I'm logged in, yet everything remains locked and says I must log in ... yet I am logged in ...",
            "review_score": "1"
        },
        {
            "review_text": "It's nice to see interviews from the actors!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun, simplistic, and informative way to not only keep everyone interested in the upcoming game, but also to help build revenue so that the game has what it needs to succeed upon launch. Thanks to the team for releasing this and I look forward to the games launch more than ever! There are a few bugs, but nothing big.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking forward to FireFly Online then this is the perfect companion app to get you even more excited, plus earn loot for when the game is released! The route mini-game is fun and helps you learn the locations in the verse. If you have ever called yourself a browncoat check out this app!",
            "review_score": "1"
        },
        {
            "review_text": "Browncoat for life an this lives upto my expectations let alone the FFO:MMO in developement in connection to this; become a Big Damn Hero an join the 'Verse! Totally shiney...",
            "review_score": "1"
        },
        {
            "review_text": "I thought it would be a different game. there is really no interaction as in space flight or engaging others. boring at best at least for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Great way to get exciterd for the game, the 3d map makes it all worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Spent over $50 on collectible cards, and still haven't collected them all. I'm wasting all my money, but I don't mind because I'm supporting Firefly, and that's definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I am not sure what to think. This looks like a marketing app for an  upcoming  game. This is not that game. Just a portal into information about the upcoming game.   I was really bummed when this turned out to be simply an advertisment. I will probably try out the Big Damn Hero bundle which gives you more access to stuff, and will update this review  I think I am going to keep my review positive for the moment and see what happens. This is the first day on Steam after all. We'll see.",
            "review_score": "1"
        },
        {
            "review_text": "I have played on the Cortex on my PC and Android. PC play allows me to better appreciate the work that went into the Cortex especially 'The Map of the Verse'. As a longtime Browncoat, participated in the Serenity Movie push, the Cortex is quite enjoyable. I now have a resource to explore the verse while working on my captain's backstory or captains backstories since I have two accounts. The collections of Badges and Special Items has been fun while challenging also. Have great hopes for the future and frequent trips to Wu's in mind for both accounts.  Now to address some of the problems encountered. I do this mainly because I caused some of them. The devs never expected BP millionaires. It only took a month for several of us to notch that mark. With it came some problems.  The '1969' error came from switching devices without logging out properly. To be honest I do not recall if my Android had the option originally. I only played with my Android a few times because for me a little screen does not give the 'verse the depth I desire. As for why it affected my PC I put that down to hard drive failure. In 20/20 hind sight some of the older devices should have been left out. This problem has been addressed. BP counter lag. Purely a multi-millionaire problem but it has also been addressed.  As stated many times the Cortex was to also serve as a test bed Firefly Online. In my opinion it has fufilled that purpose.   The delay in releasing Firefly Online while disappointing is understandable. The devs want to ensure that they release a quality product. It is how I would handle it if I were in charge of the release.   ",
            "review_score": "1"
        },
        {
            "review_text": "Slightly too addicting, but has the right feeling and atmosphere already &gt;_&lt; can't resist. The Card collecting is a nice bonus too, also to unlock stuff... though I feel weird saying that &gt;_&gt;  Only wish more systems had detailed info, as I like those and one can already fantasize about stuff regarding the future characters. Though it might feel a bit weird to start with a small fleet ^_^' (Okay you can only pilot one at a time but still, ofc it would be hilarious if each ship had some negative effect too like a debt or maybe it was really cheap as it was 'found' somewhere, or it crated a rival..etc etc. &lt;_&lt;)  Overall I'm really excited about this and the future game.  ",
            "review_score": "1"
        },
        {
            "review_text": "SHINY SHINY SHINY SHINY  Let's go be bad guys!  Um, I loaded up the 'verse on my first vernture out into the black. ....this planet's called Miranda (women? screaming over the RT) 'Uh, Well let's go and visit there another time'.  11/10 Serenity",
            "review_score": "1"
        },
        {
            "review_text": "Absolutly a blast! Can't wait for the game to go into beta.",
            "review_score": "1"
        },
        {
            "review_text": "I mean, I think this is still gonna be a thing, right?",
            "review_score": "1"
        },
        {
            "review_text": "Yes it's the movie Firefly turned into a game on steam.  Please Hit Thumbs Up Yes and Funny bottom, If the code below help you gain the overland for free!   Please act fast as this is a 'Limited' Firefly Online Cortex Game Code: OVERLAND  Again, Please Hit Thumbs Up Yes and Funny bottom, If the code helped you gain the overland for free!  Code from LootCrate click here to the site ---&gt;  mbsy.co/lootcrate/9057235 ",
            "review_score": "1"
        },
        {
            "review_text": "Really wish it would be released.",
            "review_score": "1"
        },
        {
            "review_text": "a game about social interaction in space. those screenshots on the store page is what you get. that same 15 seconds of guitar playing constant in the background and the same crap ♥♥♥ copy pasted ship unless you pay a subscription fee. 2/10- atleast the interface works.",
            "review_score": "-1"
        }
    ]
}