{
    "app_id": 343740,
    "name": "InMind VR",
    "release_date": "2015-01-19",
    "developer": [
        "Luden.io"
    ],
    "publisher": [
        "Nival"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "VR Support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "VR",
        "Free to Play",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 307,
    "negative_ratings": 81,
    "price": 0.0,
    "description": "InMind is a short scientific adventure with arcade elements designed for the Oculus VR. Submerge into the microworld and experience the miracles of the human mind.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343740/header.jpg?t=1550837867",
    "minimum_requirements": "OS: Windows 7/8/8.1 Processor: Intel 2.8 GHz Dual-Core or AMD 2.8 GHz Dual-Core Memory: 4 GB RAM Graphics: GeForce GTX 650 or Radeon HD 7790 - Resolution: 1920x1080 DirectX: Version 11 Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Things like this make me excited for the future.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing and I didn't even play it in the rift (It's probably alot cooler and easier to control). But anyway I highly suggest this game I mean it could be a little more in-depth and have more things to do in it but other than that i would play it again in a heart beat. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Before the game starts, you get to choose between two options: play with keyboard and mouse or play with Oculus Rift. I do not have the latter so I chose the former.   You are taken on a short adventure into the human brain, and you are the chosen one who has to heal a depressed patient by looking at his disordered neurons.   And so the journey begins, and you can admire the view inside the human brain. It is a short game which rewards you at the end based on how many neurons you got.   Try it. It isn't long, but offers insight in how VR-games could work. They have another game in work which will take place in human cells.",
            "review_score": "1"
        },
        {
            "review_text": "Nice visuals.   No Vive controllers used  Experience is entirely on rails, so more of a roller coaster than some folks might like.   Voice over is poor, using synth voice, rather than a decent actor  Hard to see what more of the same would bring to VR, but nice enough to try a single run through for free.",
            "review_score": "1"
        },
        {
            "review_text": "  I enjoyed this pleasent rail based guide, again another simple introduction to vr that is free, no it is not useful for a medical student but hey, this is the beginning so this is where we start to see how this evolves and I personally believe this is good beginning to see if people entry this way of learning or just the visuals. I am sure the medical vocabulary will join later once they have established what works and what does not, makes sense to me. Cheers Devs!",
            "review_score": "1"
        },
        {
            "review_text": "Great visuals! Can't wait to get the oculus!",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic little free VR experience that gives an amazing sense of scale. Considering this is free I would highly recommend it. ALthough I didn't suffer from it I can imagine how this may give some people a feeling of motion sickness! This would be a great demo to show off the potential of VR to friends.  Played on HTC Vive with GTX 970 and ran smoothly with no issues.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Creative. Beautiful. Fun. But... Short.  It's too short to even be called a demo really. 1 level. I also don't know how it would hold up for an entire game, without some variety put into the gameplay but  so much potential...  I am glad to have experienced it.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool though use oculus rift",
            "review_score": "1"
        },
        {
            "review_text": "Even though the game is free and pretty short, I advise you to consider, whether you want to waste your time on something like InMind VR. If you plan to play it with a VR device, you should take a note, that this game is really messy in terms of delivering a good and enjoyable VR experience, causing motion sickness and sometimes bugging. If you plan to play it without a VR device, then you should take a note, this game is very short, simple and pointless. In my opinion, the artistic side of the game may be the only reason to play it, and this side isn't quite remarkable to save the game. It was obviously created for usage WITH a VR device, and it fails there miserably. So, I can not recommend it.  + Decent artwork + At least, it's free  - Motion sickness. - Graceless VR design. - Doesn't really require any skill. - No storyline, setting or even idea. - It is, basically, just a short VR-demo.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a trip man. Too short though.",
            "review_score": "1"
        },
        {
            "review_text": "Love the style! Quickly giving you a taste of something that could open up a new world!",
            "review_score": "1"
        },
        {
            "review_text": "Very Relaxing Comfortable Experience For The Oculus RIft",
            "review_score": "1"
        },
        {
            "review_text": "I am not one easily prone to motion sickness. In only 5 minutes, this made me want to vomit.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing! I love seeing VR games like this and I highly recommend it to anyone who is interested in occulus rift games",
            "review_score": "1"
        },
        {
            "review_text": "short but fine!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty amazong experience in VR. I really like to looking mechanic and shooting as objects are coming at you, the game is challenging and there seems like quite a bit of gamelay from what ive seen so far.   At times the looking for aim mechinic gets abit tiresome, but overall I cant really think of abetter way of aiming unless you make it only for the vive with motion controls. maybe that could be added in a future version.",
            "review_score": "1"
        },
        {
            "review_text": "As long as there are quality creators out there making well crafted games like this the future is bright for VR. Highly recommended, to those who complain of motion sickness, maybe VR isn’t for you.",
            "review_score": "1"
        },
        {
            "review_text": "after the last update DK2 doesnt work anymore",
            "review_score": "-1"
        },
        {
            "review_text": "VR Nausea warning!   Good simply game except for the movement setup. The highspeed movement combined with lack of any other physical input creates a disconnect which manifests as an extreme sense of nausea.  The use of visual input works for this game, much better than standard 2D keyboard and mouse.",
            "review_score": "-1"
        },
        {
            "review_text": "Is there a way to remove the crosshairs?",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome,   I just tripped some serious balls ",
            "review_score": "1"
        }
    ]
}