{
    "app_id": 343930,
    "name": "Fort Defense",
    "release_date": "2015-05-22",
    "developer": [
        "Creobit"
    ],
    "publisher": [
        "8Floor"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Casual",
        "Strategy"
    ],
    "achievements": 13,
    "positive_ratings": 144,
    "negative_ratings": 59,
    "price": 3.99,
    "description": "All hands on deck! Pirate armada dead ahead! Take part in an uncompromising struggle repelling freebooters' assaults. Watch out, the enemy may catch the tide for ruining your fortress. Build towers, collect crystals, upgrade spells and believe in your victory!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/343930/header.jpg?t=1518537867",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 1500 MHz DirectX: Version 9.0 Storage: 250 MB available space",
    "recommended_requirements": "OS: Windows 7 or later Processor: 2000 MHz Memory: 1 GB RAM",
    "reviews": [
        {
            "review_text": "This is a game from publisher Creobit, who seem to specialize in casual games. This can be considered sort of a trilogy with their other tower defense games, Royal Defense and Day D: Tower Rush, in that if you've played one, it seems like you've played them all. I went with Fort Defense, since I liked its aesthetic the most. Instead of dealing with enemies traveling by ground or air, here every level is water-based, with enemies to match.  I wasn't expecting to enjoy Fort Defense very much, since reviews are pretty mixed, with some saying it doesn't work at all for them. It does for me, and after about an hour I've found it a decent game, so you long as you accept it doesn't really do anything that innovative. The ocean aesthetic is mostly window-dressing, as the levels are fairly standard (although quite pretty), and on them I've fought quick, fragile enemies, tougher slow ones, medic ships that heal others - standard stuff. Your towers are a bit more interesting, with your first pea-shooter having an upgraded form that stuns enemies, and the cannon becoming a machine gun. There's also factories you can build to harvest extra gold if you're willing to give up a few tower positions for them, although on Easy that doesn't seem wholly necessary; the game isn't a complete push-over on that difficulty, but so far it's been mostly clear sailing.  Fort Defense is a fairly obvious mobile port, and not an in-depth one. The buttons for your settings, including a pause and extra speed, are only clickable without any hotkeys assigned to them, and the game actually refused to go into windowed mode because my screen resolution was too small for it. I can see the framework for it in other places, like certain spaces in levels requiring you to pay barrels, your upgrade currency, before you can build on them. It doesn't ruin the game, but it is apparent.  There are only two campaigns in the game, the former in tropical seas, the latter arctic ones, and it seems like you could complete the game in only a few hours, so if you're looking for an 'in-between game' or a simple introduction to tower defenses you could do worse. However, this only applies to the base game; Fort Defense does have two DLC campaigns for half the cost of the main game, but both of them are apparently glitched(?) in different ways to make them impossible to beat. Oops.",
            "review_score": "1"
        },
        {
            "review_text": "A small and fun tower defence game. Though it's not adding anything new to the genre and is kind of generic, it's still fun enough and worth playing if you are into tower defence games. You get to play through 40 levels of naval battles. Build giant crossbows, cannons, and other mounted guns to take down pirate ships that are coming at your base kamikaze style.  The variety in enemy ships is quite big and each one has its own distinct weaknesses which you have to exploit via certain towers. The towers mostly come in 4 basic types, which in turn can be upgraded into other types. You have crossbows which are fast but weak. Cannons which are slower but strong. Artillery which are very slow but can hit groups. And finally the support buildings that generate you money on a regular basis, which I think is a pretty cool idea in a game like this.  The levels are divided into 2 acts: Caribbean Sea (first 20 levels) and Arctic Ocean (last 20). When you beat each level, you get a rating out of 3 stars. Not letting any enemy attack your base grants you 3 stars. If, however, some did manage to damage it, you get only 1 or 2 stars. Unfortunately the stars do not mean anything in this game. In other tower defence games the stars act as upgrade points of some kind, hence incentivizing the player to replay missions and do better. But this game doesn't do that and collecting stars is only there for boasting.  The upgrades are instead handled via collecting barrels, which randomly drop from destroyed enemies. There are tonnes of upgrades for each tower and magic spell, and you're unlikely to upgrade everything by playing through the game once. This means you might occasionally have to grind for barrels by replaying earlier levels, which is a bit of a bad design in my opinion (when in doubt, keep replaying level 20 of Caribbean Sea; it gives A LOT of barrels usually). What's worse about this design, some of the tower spots on each map are locked and require you to spend several of your barrels before you can build anything on those spots. Those are usually good, strategic spots, so you have to either waste some of your precious barrels on one map, or compromise on your setup.  Visuals are very beautiful and shiny. Sound effects are nice, and the music is all right, although you pretty much have the same short track playing in every level, so a bit more musical variety would've been nice.  Overall this is a fun TD game. There are better TD games out there, but if you're looking for a new one that you haven't played yet, then this one is well worth a try, since it's very affordable and will entertain you for several hours.",
            "review_score": "1"
        },
        {
            "review_text": "Great challenging and enjoyable tower defense game. Highly recommended if you enjoy strategy / tower defense games.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible game not worth your money.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun and quite easy, most of the times.  Only real downside is the music - I had to turn it off, it's so repetitive.  A few minor gripes: The logic behind the pathing isn't really explained - some levels have circles which some, but not all enemies take. When you beat the last wave of the last level (difficulty easy), there is nothing - not even 'Hey, do finished the last level of this episode on easy!'. A few more achievements would be nice, like an achievement for clearing an episode. As much as I like having all achievements, I feel there could have been a few more that take more effort. When you place a new tower, the position of the individual types isn't fixed, this is annoying - you can't always expect the crossbow to be at the top, for example. Fortunately, you can pause any time. Keyboard support would be nice - something like SPACE for pause/continue.  I like the in-level upgrade system of the defense towers - previous upgrades are counted towards the cost of the next upgrade, so you don't lose money by upgrading incrementally.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to pass your casual time, cant complain for being too easy or repetative. Why? Well, i like casual games to be less of a challenge then nerve wrecking, hair pulling games....maybe that's just me, but being too easy or next to zero learning curve is perfect for my casual gaming time",
            "review_score": "1"
        },
        {
            "review_text": "If this game it was a potato it would be an average potato 11/10-IGN,Illuminati",
            "review_score": "1"
        },
        {
            "review_text": "Has potential. Too grind heavy and drawn out within the levels. If they were shortened but made a bit more difficult. The abilities take a bit long to go through them. These games aren't meant to be long as hell. Perhaps a continuous endless survival thing with tweaks instead. Campaign is lengthy for a TD. No story.",
            "review_score": "-1"
        },
        {
            "review_text": "Same as Royal Defense the developed. A very typical TD game, nothing special",
            "review_score": "-1"
        }
    ]
}