{
    "app_id": 344160,
    "name": "World of Cinema - Movie Tycoon",
    "release_date": "2015-04-02",
    "developer": [
        "Pepi Games"
    ],
    "publisher": [
        "Pepi Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 12,
    "negative_ratings": 24,
    "price": 3.99,
    "description": "1 – 4 players manage a film studio and compete in a thrilling challenge for fame, money and awards. Each player starts as head of a small film studio with small budget.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/344160/header.jpg?t=1447367624",
    "minimum_requirements": "OS: Windows XP Processor:  Memory: 1024 MB RAM Graphics:  DirectX: Version 8.0 Storage: 600 MB available space Sound Card:",
    "recommended_requirements": "OS: Windows XP Processor:  Memory: 1024 MB RAM Graphics:  DirectX: Version 8.0 Storage: 600 MB available space Sound Card:",
    "reviews": [
        {
            "review_text": "I really like the idea of the game, but it's still a good way off from bring a great game. There are too many negative parts within the game, such as being robbed, shot at and losing a lot of health for not paying $6,000,000 to the mafia, then losing 28 million in a fire at the studio caused by the mafia anyway, are ridiculous, along with losing 12 million at the casino and never winning one of the hollywood races! Anytime i get near $100 million i lose half of it for the reasons above.  The markting and merchandise sections could do with some work too, i dont think the marketing even has any effect on sales  There is a function that allows you to create scenes and scenery for your films, they are too boring to even want to do, could do with sprucing that up, or even having the option to hire staff to do that for you.  A bit disappointed but still like the idea of the game",
            "review_score": "1"
        },
        {
            "review_text": "Very basic, graphics and gameplay, when you consider THE MOVIES game was over ten years ago this game seems to be ten years before that, lacking in content and playability.  In making your own movies? well unless this games animation improves later on with owning a studio, forget it.  I found this game boring for the most part but might revisit it because I like the genre.  Don't waste your money hopefully a decent updated movie game will come along soon.  Summary - Plays like an old Commadore 64, text and pictures and not much action also webpages link not working.",
            "review_score": "-1"
        }
    ]
}