{
    "app_id": 344130,
    "name": "Cataegis : The White Wind",
    "release_date": "2015-09-25",
    "developer": [
        "Acido Cinza"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 41,
    "positive_ratings": 236,
    "negative_ratings": 115,
    "price": 3.99,
    "description": "Welcome to Cataegis - The White Wind: Ziggurat Chapter, a frantic 2D arcade action retro-style game that pays homage to the glory days of 8-bit side scrolling gaming.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/344130/header.jpg?t=1447367619",
    "minimum_requirements": "OS: Windows XP or above Processor: 1 GHz or Better Memory: 256 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Cataegis is a 'Old School Retro Plataformer' or how i like to call those 'An excuse to make cheap bad looking games and call them Retro'.   With a bit of work this could turn into something really good, but needs a lot of polish, also In a way I'm getting kind of tired of these old 'retro art' gimmick used to excuse poorly designed games, in this case is not excuse... retro yes... but it's still horrible and badly animated.  The gameplay is straightfoward, a sidescroller in the likes of Ninja Gaiden but without it's charm. You control something that looks like censored japanese genitalia (lots of pixels together)and you move to the right killing unfair enemies until you get to an unfair boss so you can progress to the next level, you can also jump and strike with your sword, that can also get powerups 'contra wise', game is not bad and it's very fast paced, a bit unfair sometimes but enjoyable. Also the music is one of the best points of the game.  My mayor complain on this game is that I usually play games in short sessions and on this one there's no savepoint or 'password', so if you leave the game you have to start from the beginning.  Should you buy it? To be honest, wait for a sale or a giveaway.  It's Not bad.... but there's plenny of 'This' on steam.  Still I recommend it, since even with all his flaws I kind of like it....",
            "review_score": "1"
        },
        {
            "review_text": "  well is a bit dificult but is good, i think the price is too high however if you want this game only get it at discount or on a free giveaway",
            "review_score": "1"
        },
        {
            "review_text": "Good! Love that game",
            "review_score": "1"
        },
        {
            "review_text": "  The White Wind  + Classic old school side-scrolling gameplay + Exciting Retro soundtrack + Fast and fluid gameplay with a myriad of techniques and varied weapons; + Gorgeous pixel art cinematics + Unlock art and background information on the game + An engaging storyline + Over 20 endings available based on the choices you make in the game  If you like retro games like Megaman or Contra, you will love Cataegis: The White Wind too, a fast placed action game with good graphics and also multiple endings.",
            "review_score": "1"
        },
        {
            "review_text": "graphic hurting my eyes owwwwwwwwwwwwwwwww",
            "review_score": "-1"
        }
    ]
}