{
    "app_id": 34410,
    "name": "Death to Spies: Moment of Truth",
    "release_date": "2009-08-07",
    "developer": [
        "Haggard Games"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Stealth",
        "Action",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 260,
    "negative_ratings": 42,
    "price": 4.99,
    "description": "The Most Mysterious Secret Service Agency of WWII This is a third-person stealth-action game describing the activities of the SMERSH, the most mysterious secret service agency of World War II. Moment of Truth is a sequel to the popular stealth action title Death to Spies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/34410/header.jpg?t=1553189012",
    "minimum_requirements": "OS: Windows XP SP3, Windows Vista SP1 / 7 / 8 / 8.1 / 10                     Processor: Intel Dual Core 2.0 GHz or AMD Athlon 4000+                     Memory: XP – 1 GB RAM, Vista – 2 GB RAM                     Graphics: 3D Hardware Accelerator Card Required – 100% DirectX 9.0c compatible 256 MB Video Memory. ATI Radeon X800, Nvidia Geforce 6800                     Hard Drive: 4.5 GB + 1 GB Swap File                     Sound: DirectX 9.0c compatible sound card",
    "recommended_requirements": "Processor:Intel Core 2 Duo 2.4 GHz or AMD Athlon Dual Core 5200+                     Memory:2 GB                      Graphics: 256 MB 3D Hardware Accelerator Card with Shader 3.0 support. ATI Radeon HD 3870, Nvidia Geforce 8800 GT                     NOTICE: Some 3D accelerator cards with the chipset listed here may not be compatible with the 3D acceleration features utilized by Death to Spies. Please refer to your hardware manufacturer for 100% DirectX compatibility.                      Supported Chipsets                     ATI RADEON X800, ATI RADEON X1300, ATI RADEON X1600, ATI RADEON X1900, ATI RADEON X1950, ATI RADEON HD 2400, ATI RADEON HD 2600, ATI RADEON HD 2900, ATI RADEON HD 3450, ATI RADEON HD 3850, ATI RADEON HD 3870, ATI RADEON HD 4850, NVIDIA GEFORCE 6800, NVIDIA GEFORCE 7300, NVIDIA GEFORCE 7600, NVIDIA GEFORCE 7800, NVIDIA GEFORCE 7900, NVIDIA GEFORCE 8400, NVIDIA GEFORCE 8500, NVIDIA GEFORCE 8600, NVIDIA GEFORCE 8800, NVIDIA GEFORCE 9600, NVIDIA GEFORCE 260 Supported Mobile Chipsets                      NVIDIA GEFORCE GO 7600 (XP Only), NVIDIA GEFORCE GO 7900, NVIDIA GEFORCE GO 7950, NVIDIA GEFORCE GO 8400",
    "reviews": [
        {
            "review_text": "Just about won this game so here is my review:  TLDR: 10/10 Best Stealth game series on Steam right now.  You have to be a lot more cunnnig than in most of the stealth games. This is very realistic. Unlike HITMAN there is no 'Body box' near every kill. You have to actually find hiding spots.  The strategy is the best part of this game. It lets you choose your equiptment! (or hit the button for a recommended loadout). So basically you are pretty much open to do whatever you want withthis game.  Ways to kill in this game :  *Total stealth. - Sneak up on them and Garrotte, or Chloriform them.  *Brutal Stealth. - Cut their throat, Beat them up with your fists, Hit them with countless blunt objects. *Non-Stealth. - Landmines, Booby trap bodies, Rig doors to explode, or set up countless 'scripted events' to happen. *Stealth at a distance. Throw Knives. Throw Coffeecups, and otehr map objects. Use silenced guns (including silenced sniper rifles.)  Lots of startout items!! Poision First aid Throwing knifes Garotte Chloriform landmines Grenades Huge selection of guns. Every mission has its own unique guns too it seems.  The maps are really BIG when needed, You truly get an 'Open world' feel to the missions. Windows are realistic too, you can see inside every building!",
            "review_score": "1"
        },
        {
            "review_text": "this is a must for any hitman blood money / contracts fan !  this game is fun to play , it require thinking and stealth , most of the levels are beutiful it seems to use the same game engine that hitman use.  get it along with the first game (death to spies)",
            "review_score": "1"
        },
        {
            "review_text": "An extreamly challenging game,but you still can get so much fun of it.  Scores : 79/100",
            "review_score": "1"
        },
        {
            "review_text": "If you like Hitman then you will love this Graphics are okay Very many ways you can do stuff You can ride veichles so thats great :D Atleast you need to think what you doing before youre doing it I dont suggest fighting better be off sneaking or sneak killing So yes i like the game even know i havent played it much",
            "review_score": "1"
        },
        {
            "review_text": "Tips: Turn ON vertical sync Turn OFF depth of field If new to the series, use a walkthrough for the first mission to get a hang of the game mechanics.  A great hybrid of Hidden &amp; Dangerous 2 and the Hitman series, though the shooting mechanics are a bit rough. Stealth is pretty much the only option throughout the game, so patience and trial &amp; error are needed for each mission. Its difficulty and subtelty scratched an itch left by the Hitman series. It's still possible to beat missions that go sour, which adds some variety and spontaneity.",
            "review_score": "1"
        },
        {
            "review_text": "This superb stealth game is even better than its predecessor in various ways.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, it's realistic, and the hardest game I've played. I recommend this game if you want a challenge. (Don't rage at this)",
            "review_score": "1"
        },
        {
            "review_text": "Death to spies -Moment of truth (..or D.T.S 2) is very similar to the first Death of spies, with some slight improvement of the graphics, as well as even better designed levels too !   -First,I do really NOT think that this is a kind of game for everyone..This game must be among one of the hardest stealth-games ever made ,..just like Hitman, just maaybe harder?..LOL it`s key to succed the missions is about timed moves, being patient before you pick the right time to 'strike'..but it`s sick how rewarding it is when you succeed  Things to do: -Infiltrate bases, track and kill spesific enemy officers, find top secret documents,,Kill enemy-guards without being discovered, hide their bodies, steal their clothes for your own disguise.  If you like a spy/stealth WW2 game with excellent/maximum challenge, This must really be it ! :)",
            "review_score": "1"
        },
        {
            "review_text": "  7/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "I Got That Metal Gear Solid Feeling Again ! ( With a touch of being the Russian Version of James Bond )   10/10 'A Must Buy'  Would Play again and again ' Literaly '",
            "review_score": "1"
        },
        {
            "review_text": "Same as the other death for spies game, its well, boring, the voice acting isnt too great. I didnt play this much just put me to sleep. Maybe others wont fall asleep playing.  Rating: 5/10 Value: $1.99",
            "review_score": "1"
        },
        {
            "review_text": "The game looks like crap, it has very low framerate, i can barely see what is going on, and even hitting [Restart] after randomly exploding is a challenge. thats right using the mouse to move your cursur is challenging. not worth the 2 dollars i paid for it.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like the semi-open world stealth of the Hitman games, then this is right up your street. It utilizes some of the great stealth mechanics of the classic Hitman titles (like the disguises, gadgets and semi-open worlds) but has some other interesting elements that set it apart from them; like vehicles, a military setting and a different pacing to the levels, so I never felt like I was playing a clone of the games it's trying to emulate. Overall, it's a good game that brilliant for anyone who's overplayed their copies of Contracts and Blood Money, like me. ",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS ALOT BETTER THAN THE ORIGINAL!  THIS IS WHY!...  +RUSSIANS SPEAK RUSSIAN! +NAZIS SPEAK NAZI-GERMAN! +NAZIS DO HITLER-SALUTES! +LOTS OF SVASTIKAS EVERYWHERE! -BUT YOU STILL CANT FLY PLANES OR DRIVE TANKS!!!!    HOWEVER, THE FOLLOWING THIS STILL PERSISTS FROM THE ORIGINAL...  YOU CAN STUN ENEMY SOLDIERS AND TAKE OFF THEIR CLOTHES, BUT WHY THE HELL WOULD YOU DO THAT??? ARE YOU SUPPOSED TO MOLEST THEM? THIS GAME IS SICK AND SHOULD BE AVOIDED!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing and vastly underrated gem for those looking for a Hitman type genre with a realistic story and depth. NPC AI is very intuitive and boasts some personality—they are quick to catch on when something is amiss, To fool them will take practiced skill, patience, and a lot of game-saves. This is Splinter Cell meets Hitman, meets the original COD.   One thing Death to Spies is not, is a full blown FPS—the AI breaks down once a full on fire-fight ensues and the game mechanics simply aren’t suited for intense action. You may fire the occasional shot, but you'll mainly be sneaking around, collecting, quietly assassinating, sabotaging, poisoning, and changing your cloths often to avoid detection and gain access to restricted areas.   Aesthetically, the graphics and sound are good for the day—far from next-gen, but more than sufficient to create a compelling, immerse atmosphere where hours will pass before you know it. And although your objectives are clearly laid out, you'll find a moderately high replay value here, where you can go about your mission in a variety of ways.   The Score  Gameplay 9/10 Graphics 8/10 Sound 7/10 Fun Factor 10/10 Overall 8.5/10",
            "review_score": "1"
        }
    ]
}