{
    "app_id": 344260,
    "name": "Agapan",
    "release_date": "2015-05-29",
    "developer": [
        "Kursed Studios"
    ],
    "publisher": [
        "Kursed Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 20,
    "negative_ratings": 5,
    "price": 5.59,
    "description": "Agapan is a 2-D story and exploration game taking place in a mysterious and ominous setting. In this narrative oriented experience, the player controls David Garcia while he ventures into the town of Agapan. His goal: search for his last relative and uncover the secrets of a town where an ancient deity still reigns.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/344260/header.jpg?t=1447367665",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.8 GHz Memory: 512 MB RAM Graphics: 3D Graphics card compatible with DirectX 7 Storage: 75 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This isn't as much of a game as it is more of a play through story. There is no challenge or threat of death other than the story itself has. There are several diffrent endings depending on choices you make, I got four diffrent ones but it seems like there are more. At first there is a lot of walking to find the main areas where events take place and once you have found them all you can easly travel to each one. It may be hard to advance if you do not find all the events or items which are easy to miss. I was stuck on day two for a while because I was unable to notice an item on the floor near the clinic. Keep in mind this is just for the story and doesnt have any real gameplay value.",
            "review_score": "1"
        }
    ]
}