{
    "app_id": 344800,
    "name": "World of Mixed Martial Arts 3",
    "release_date": "2015-03-19",
    "developer": [
        "Grey Dog Software"
    ],
    "publisher": [
        "Viva Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Simulation",
        "Management"
    ],
    "achievements": 0,
    "positive_ratings": 83,
    "negative_ratings": 34,
    "price": 14.99,
    "description": "Step into the world of MMA in World of Mixed Martial Arts 3. In this simulation title, you control every aspect of the MMA world. Take control of an MMA company and run it the way you want. Decide who to hire, what matches will take place, and who doesn't make the cut!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/344800/header.jpg?t=1447367767",
    "minimum_requirements": "OS: Windows 98/ME Processor: Pentium II (or equivelant) 800mhz or higher Memory: 128 MB RAM Graphics: 1024x768 display capable of running 16-bit color of higher Storage: 75 MB available space Sound Card: Windows compatible sound card, plus the newest version of Windows Media Player",
    "recommended_requirements": "OS: Windows 2000, XP or Vista Processor: Pentium III class (or equivelant) 2GHz or higher Memory: 512 MB RAM Graphics: 1024x768 display capable of running 32-bit color mode Storage: 75 MB available space Sound Card: Windows compatible sound card, plus the newest version of Windows Media Player",
    "reviews": [
        {
            "review_text": "If you like MMA, then you NEED this game. If you have a good imagination, then you're set with the default database. If realism is what you're after, you can download and incorporate a real UFC mod/mods. Either way, it's worth the price. 10/10  EDIT: WMMA-4 is/has been out now, have around the same time on that as WMMA3. More in-depth options, reality shows, and noticeably improved UI in general are the highlights. Not on steam, but on the devs store, worth a look if you liked WMMA3",
            "review_score": "1"
        },
        {
            "review_text": "Being a fan of MMA and also a fan of management/simulation games, I figured this game would be right up my alley. Boy, was I right. By 'right up my alley' I mean life-consuming time-destroyer. Very few games have ever actually made me emotional. The part of Red Dead Redemption when you first ride into Mexico as the sun is setting and the music starts playing, that made me emotional, I felt a sense of freedom and adventure that no game has before, or since, evoked in me. That, however, is not the kind of emotion I get from WMMA3. The emotions I have felt in this game have ranged from 'NO! I just spent 5 fights getting this dude up to main event status and now he refuses to resign with me!?' (Anger) to 'HOW DID SHE POSSIBLY LOSE TO THAT BUM I ONLY HIRED FOR ONE FIGHT' (Also anger, and confusion) and also 'This dude wins the belt and now wants to take a hiatus to spend more time with his family? WHO CARES ABOUT YOUR FAMILY! GET IN THAT CAGE AND MAKE ME MONEY YOU JERK!' (Anger again.....hmmmm, this game really seems to anger me). But I digress, although the game can be infuriating at times it's also supremely satisfying to set up a ripper of a card and have everything fall into place as you get fight ratings of Great/Fantastic and the ever elusive Excellents. I usually judge games based on $/Hr of Gameplay. My base ratio being 1:1. I spent $22CAD on this game on a sale and so far I'm at 142hrs on record so a ratio of 22:142 or $1/6.45hrs so I am extremely happy with my purchase. If MMA and Simulation games are your thing and you're not on a hunt for mind melting visuals and sweeping orchestral soundtracks and would rather just have some fun setting up MMA fight cards and building up your own MMA company, this is the game for you my friend (I assume if you are looking at this game on Steam, we'd probably be friends, unless you're a jerk, in which case, I don't want to be friends, you jerk).",
            "review_score": "1"
        },
        {
            "review_text": "Why can't somebody make a Boxing game as dope as this!? Nobody wants to watch two half-naked men roll-around on the ground in a homoerotic embrace! ...Or maybe that's why MMA is so popular. But I'm not here to debate the reasons for MMA's popularity. I'm here trying to tell you that this is a great management simulation game for fight fans who love to do imaginary match-making.",
            "review_score": "1"
        },
        {
            "review_text": "Doesnt work using 1920x1080.   Cant click on the right spots, wont use the full window.    I wish I could play it but I dont have a computer from 95.",
            "review_score": "-1"
        },
        {
            "review_text": "Weirdly enough the simplicity of a smaller game world, blow-by-blow flavour text, and a far less complicated way of dealing with show set ups makes this game play better than TEW2010 (at least in the short term). Its comparative lack of depth doesn't hinder it for players new to show management and makes it a better place to start than its big brother. This said, both games have things to learn from each other. Insanely addictive once you get into it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little time killer. It would be a lot better if you could see the fights like Punch Club though.",
            "review_score": "1"
        }
    ]
}