{
    "app_id": 344910,
    "name": "Sun Blast: Star Fighter",
    "release_date": "2015-04-02",
    "developer": [
        "OBLONE Software"
    ],
    "publisher": [
        "EQ Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Indie"
    ],
    "achievements": 24,
    "positive_ratings": 371,
    "negative_ratings": 225,
    "price": 0.79,
    "description": "Sun Blast is the best 3d space shooter on Steam. Earn upgrades as you fight your way through a huge seleciton of levels. Full gamepad support!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/344910/header.jpg?t=1492978798",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.8 GHz or faster Memory: 512 MB RAM Graphics: 128 MB, OpenGL compatible video card with latest drivers installed Storage: 200 MB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "better than most of shooting/arcade games at this price range",
            "review_score": "1"
        },
        {
            "review_text": "6min of gameplay         YouTube™ Video:  6min of Sun Blast - highlights&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It's a crummy Star Fox clone that's a lot better then it seems! ^w^ (still gotta beat the first boss)",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of Star Fox... I like this game",
            "review_score": "1"
        },
        {
            "review_text": "Sun Blast is a fun star fox based game that will consume you for hours, if you have the time to play it, a must for the guys who loved Star Fox",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard as hell.. Better not get hit, either you'll need to retry collecting thoose power up.. You crashed? Okay time to start from a scratch..  Farm the Steam Cards and sell at the market,, got money,, spend it for another game.. :)",
            "review_score": "1"
        },
        {
            "review_text": "i really enjoy this, game. the options menu was a disapointment, and controls are tight, but not change able enough, you can use a wiimote, but cant use a mouse in a similar way. the story is lame, but the challenges you unlock for doing well in the story is where it is the most fun.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, so this game has a few flaw, but overall it is an enjoyable experience. I myself am a huge fan of the shmup genre, with Starfox (the original for SNES, not 64) being the first game I ever played to completion, and this game definitely deserves a spot on the shelf with other shmups. Let's get right into it, shall we?  Pros:  - MUSIC! This game has some of the most up-beat, driving, and overall motivating music I've heard in an indie shmup for a while  - Variation: This game doesn't just ask you to shoot everything. It requires you to master all forms of gameplay presented.   - Well paced. This game doesn't have a difficulty wall. It gradually eases you into the harder and harder levels. And even as the levels progress, it is preparing you for what's to come.  Cons:  - Control... No matter your ship, you control like you're flying a blimp  - Graphics: The graphics are lacking a bit. I gather that this is an indie game, but everything looks a bit too flat and uninspired. There's no real art direction other than 'Standard space shmup.'  I rather enjoy this game and can see myself playing it quite a bit in the future. That said, it's not the best game I've ever played. There is certainly better, but for $2, I'm not going to complain.",
            "review_score": "1"
        },
        {
            "review_text": "Game with that old classic feel but with better graphics. Was able to get all the way to the final boss but I just couldn't beat the dam thing and its just so frustrating. Especially when you die, you go all the way back to first level you did after you beat a level, if your just starting then I assume you go back to level 1 if you died to the first boss. Theres 4 levels before getting to that final guy and part of the reason I'm mad at the dam thing is because that giant bar going across the top of the screen that shows your buffs, it gets in the way whenever the final boss fired something at me from behind it and I wouldn't know so I couldn't dodge it half the time. Besides that little annoyance, fun game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun. It's a quick space shooter and is for sure worth the price very affordable price tag. It also works with a controller which makes it even more fun. :) I'd recommend giving it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "This is whats happening when Apple tries to make planetside 3...",
            "review_score": "1"
        },
        {
            "review_text": "Bestest game steam in store has steam valve develope is good my frend : )",
            "review_score": "1"
        },
        {
            "review_text": "This game amazes me with 3D graphics and very beautiful particle effects. However if you go to bottom left corner and keep tapping space you will eventually win the whole game.  Even the developers are embarassed of making this because I couldn't find credits in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ don't ever",
            "review_score": "-1"
        },
        {
            "review_text": "  Absolutely not worth your time or money. The description says it's like Star Fox, Panzer, or Space Harrier. It's not, just play those instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor, even for the 24c it cost me.  The graphics are dated, the aesthetic is generic, the level designs on the early levels are incredibly boring, the enemies just fade in and stick in one spot, the sound FX aren't anything special, the ship is set way too close to the camera, the controls feel unresponsive, the settings menu requires you to exit the game to apply graphics settings (really?), etc.  If you absolutely adore tunnel/rail shooters, I could see maybe being amused by it for a short period of time, however, I think there are much more interesting/better games in this genre. It feels like a mobile game in the worst ways.",
            "review_score": "-1"
        },
        {
            "review_text": "i played it for 10 minutes. I GOT BORED ",
            "review_score": "-1"
        },
        {
            "review_text": "Buy the game for trading cards... This game doesn't deserve to be played. 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "The control are disgusting, the hit box is lagged. I always take damage even while being out of range of everything. The gameplay isn't there and even the boss battle are completly lagged and not fun at all.",
            "review_score": "-1"
        },
        {
            "review_text": "This thing has to be a joke right? I should have taken the candies instead....",
            "review_score": "-1"
        },
        {
            "review_text": "This game doesn't deserve a thorough review. ",
            "review_score": "-1"
        },
        {
            "review_text": "Plays like a really boring and lame version of starfox. You are locked to a circle like playfield and have to avoid obstacles or shoot stuff in order to progress levels. Later levels get extremely punishing and the flat gameplay gets boring way too fast.",
            "review_score": "-1"
        },
        {
            "review_text": "+ Music's not bad + Cheap (Got it for $0.24) + Trading Cards + Only 89Mb - Graphics from 1996 - Plays like an early Smartphone game - Very little enemy variation - Max Resolution of 1920x1200 - 45Fps lock - Scaling was messed up until I Alt-Tabbed in and out of the game  I wouldn't be suprised if this game was made as a High School project. Played it untill I died then uninstalled it. If you want to play Starfox or Space Harrier you'd be better off playing those games in an Emulator than bothering with this.",
            "review_score": "-1"
        }
    ]
}