{
    "app_id": 34500,
    "name": "Light of Altair",
    "release_date": "2009-06-04",
    "developer": [
        "SaintXi"
    ],
    "publisher": [
        "SaintXi"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Simulation"
    ],
    "achievements": 30,
    "positive_ratings": 31,
    "negative_ratings": 7,
    "price": 11.99,
    "description": "Light of Altair is a sci-fi colony building game with a deep plot. Grow colonies from landing pod to metropolis, while sending off new spaceships to expand your territory to other worlds. You are not alone in space, 8 factions from different parts of the world are all following their own agendas in the solar system; diplomacy and...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/34500/header.jpg?t=1447352171",
    "minimum_requirements": "Supported OS: Microsoft Windows XP / Vista                     Processor: Pentium® 4 1.5GHz or Athlon™ XP 1500+ processor                      Memory: 256MB RAM                      Graphics: 3D hardware Accelerator Card Required - 100% DirectX® 9.0c compatible Hardware Accelerated video card and latest drivers                     Hard Drive: At least 1 GB of free space                     Sound Card: 100% DirectX® 9.0c compatible 16-bit sound card and latest drivers DirectX®: 9.0c (included)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a strategy game where you build up planets and asteroids to then attack the enemy and destroy their bases. The graphic are pretty simple, so nothing grand there but they are ok for such a game. The strategy is also simple from what time i played, but i guess it gets more complex later in the missions. The story for the campaign is a bit boring from what i could see. Maybe its me.  I will cautiously recommend this game. It's not great but at the low price below 10$, it should be worth a few hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Thought i found something like spacebase DF9, huge mistake. Huge letdown.",
            "review_score": "-1"
        }
    ]
}