{
    "app_id": 345390,
    "name": "King's Quest",
    "release_date": "2015-07-28",
    "developer": [
        "The Odd Gentlemen"
    ],
    "publisher": [
        "Sierra"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Fantasy",
        "Puzzle"
    ],
    "achievements": 53,
    "positive_ratings": 1735,
    "negative_ratings": 219,
    "price": 0.0,
    "description": "King’s Quest is a collection of five different chapter releases, each focusing on an untold tale in Graham’s past. Discover a wondrous world full of whimsical characters, charming puzzles and perilous dangers in this fun and enchanting coming of age story.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/345390/header.jpg?t=1487889204",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Windows Vista, Windows 7, Windows 8 Процессор: Intel Core 2 Duo E6300 @ 1.86 GHz or AMD Athlon 64 X2 4800+ @ 2.4 GHz Оперативная память: 1 GB ОЗУ Видеокарта: GeForce 8800 GT or Radeon HD 4770 / 512 MB DirectX: Версии 9.0c Место на диске: 13 GB Звуковая карта: DirectX 9.0c Compatible",
    "recommended_requirements": "Рекомендованные: ОС: Windows XP, Windows Vista, Windows 7 Процессор: Intel(R) Core(TM) i3 CPU 530  @ 2.93GHz Оперативная память: 2 GB ОЗУ Видеокарта: GeForce 8800 GT or Radeon HD 4770 / 512 MB or higher DirectX: Версии 9.0c Место на диске: 20 GB Звуковая карта: DirectX 9.0c Compatible",
    "reviews": [
        {
            "review_text": "I am one of the old guys who grew up with all of the Sierra titles and this was such an amazing reboot of this franchise. The use of the Unreal engine was amazing and hats off to all of the artists and creative team behind this beautiful game. The puzzles and game play were easy to get use. The writting and voice casting was amazing. I l ove puns. Any game that makes me angry at myself when I finally figure out a solution to a puzzle is a winner in my book. I hope that this game is so successful that we will get Roger Wilco back in a new adventure.   Get this game if you care about good games.",
            "review_score": "1"
        },
        {
            "review_text": "King's Quest is not your father's King Quest (to borrow heavily from the now defunct Oldsmobile commercial) or your mother's for that matter but it is a welcome return. Having played the original series when it was released, I was looking forward to the game. Be warned, I'm an ancient gamer (ancient as in I started my computing on punch card machines) and I'm a huge fan of adventure games. If that bias isn't your thing, you might be happier finding something else to read. Also note, the game is an eposidic release so this is just the prologue and Chapter 1!  The mechanics of the game are quite good. The graphics are overall very good and in some cases stunning. The music is spot on and the voice work is superb (given the cast, no surprises there). I am the universe's sorriest controller user yet I had only minimal trouble using the controller. I am not a fan of the whole WASD thing so I broke down and got a controller for the machine. My kids enjoy having a good laugh watching me try and use it. I did find a couple of times where the character would get stuck in the corner. I would then exit back to the main menu and start over. That was a tad annoying. If I had any complaint on the mechanics it was one I've read elsewhere: 'WHERE IS A MAP SO WE DON'T HAVE TO KEEP WALKING (SLOWLY) OVER THE SAME GROUNDS AGAIN AND AGAIN?' Yes, you do a lot of back and forth in the game but the old favorites of teleport stones, magic maps, or even a disgusting taxi are no where to be seen. From what I have seen on Facebook, the gang at The Odd Gentlemen recognize that this needs fixed in the final four chapters.   The game trips down the lane of nostolgia by opening up with Sir Graham retreiving the fabled magic mirror of King's Quest I. It is an interesting retelling and it does set up the story to come but I wasn't too thrilled with solving puzzles by spinning wheels and shooting objects out of the way. I played the first three Call of Duty games and enjoyed them but I don't think I need the tatics mucking about my adventure games. Oh well, must be that old thing again. Still, shoot some stuff, jump around some stuff and solve a couple of very mild puzzles and the prologue is completed.   For Chapter 1, Graham has to perform three tasks (why is it always three?) to become a mighty pirate. Scratch that, to become a knight. King's Quest does play like Guybrush Threepwood had he starred in the film 'The Princess Bride'. Some of the scenes are lifted nearly verbatim from the film. The completion of the tasks (and all the side tasks you need to perform) is the stuff of classic adventure games and works quite well although the puzzles are not very difficult once you find all the pieces. There is a puzzle in the dragon's cave involving tying a rope around the dragon's tail that was quite good. But this is 2015 so of course there are a couple of sequences involving lots of shooting of obstacles (or goblins) and my pathetic controller skills were stretched. My 15 year old plowed through them with ease. I'll have to replay to see if the first two tasks have to be played in the order I played them (I'm guessing yes but I haven't tried yet and I have a couple of ideas how it could work) but the game appears to be pretty linear. I looked up a couple of play throughs and I see some folks tackled the side quests in a different order than I did but that was about it. That is a bit of a sad departure from the original series where you really could tackle the big tasks one at a time and more or less in any order or work on them as a group.   Why this review is a yes vote: It is a new take on the adventure game format and it shows promise. There was some nice character development for Graham (there are a couple of serious moments) and with some clean up work on moving around the map and skipping dialogue, the game could be far more enjoyable. Chapter 1 isn't perfect, but it is a nice return to some familiar and new characters in a land that holds fond memories for many of us. The voice work and music and the background scenery show the developers have a lot of the big pieces in place. The writing, while not fantastic, was better than most and while it is not a Roberta Williams game, they have shown they have a lot of love and respect for the original. I bought the season pass so I'm in this one for the long haul. Thus far, I'm glad to be along for the ride.  Update, October 26, 2016. Just finished Chapter 5 and wow how they pulled it all together. I loved the ending and it really pulled the whole game together. Now I can't wait for the epilogue.",
            "review_score": "1"
        },
        {
            "review_text": "This was a risky game for Sierra to publish but I think, after the epilogue's release, I can finally say with certainty that I recommend it. Oh, and sorry for the wall of text you may or may not be about to read.  Ch1: 4/5 - Obviously, being free is a plus and it did succeed in bringing the King's Quest franchise to a modern platform without feeling aged, even adding branching pathways without making them feel too important, however it doesn't quite capture the feel of the originals.  Ch2: 2/5 - Probably my least favourite chapter in the game, due in part to its addition of needless survival mechanics. While it did follow up from Chapter 1 as promised, this was one mechanic change I was not a fan of.  Ch3: 3/5 - Definitely a step up from the last one, starting with time travel elements and later featuring a twist on the end of King's Quest II, seeing you attempt to woo two candidates for your queen, urging you to answer a quiz honestly and solve problems with either brain or brawn in a series of tests not disimilar to the questions you would see in dating sims to find your wife. Despite the dating sim exterior and a slightly more linear playstyle in comparison with the first two chapters, it still manages to return to the charm of the first one.  Ch4: 3/5 - A lot of puzzles. Needless to say, do not play this chapter if you don't like puzzles. Although there are a lot, most of them are only slightly challenging, so feel satisfying to complete without having to mean 10 minutes to solve a puzzle. Follows up from the previous chapter a lot more smoothly than most other chapters do.  Ch5: 4/5 - King Graham, on his deathbed, tries to remember his final adventure with his misremembering playing a key role this time around. A very creative game mechanic, giving an excuse to show cut content and makes it arguably the best chapter. Switches to retro graphics at one point and... (I can't really add much more without giving major spoilers)  Epilogue: 4/5 - Some of the most creative uses of items in a much more animal based adventure starring King Graham's granddaughter. Would be 5/5 if it were longer, had any achievements and wasn't exclusive to Complete Collection. While I might not be in the majority here, I feel that the Complete Collection is worth buying purely for this.  Tip for people who have played Chapter 1 but not bought any others (and a reward for reading): Go to Help, then Steam Support and remove King's Quest from your games, as you cannot buy the Complete Collection with it in your library. As long as you do not uninstall the game, you will not lose your progress and achievements will be kept.",
            "review_score": "1"
        },
        {
            "review_text": "Went into this with little interest, left with a sense of incredible hype for the next chapter in the series. Seriously guys, keep up the good work. A nice modernization of an older franchise that still keeps true to its roots, but with gameplay that doesn't require a walkthrough to finish (I had to look up exactly one thing, but in retrospect, I was stupid and the game had given me plenty of hints that I was doing it wrong).",
            "review_score": "1"
        },
        {
            "review_text": "I rather enjoyed Chapter 1 and 2 so far, I played the original series as a child. I wouldn'nt mind seeing remakes of the space and police quest series also.",
            "review_score": "1"
        },
        {
            "review_text": "Another choice game where your choices have abosolutey no impacy whatsoever, only this time the game actually leads you on to think that they do and then cops out at the end (twice, I might add). and the second chapter is completely shoehorned with one area, no difficult puzzles, no consequences for your actions (despite, again, outright stating that there would be), and a predictable story that shoves in a cliffhanger at the end just so you can't say it isn't important to the overall plot.   what a waste of time",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a love letter to Roberta Williams and our childhoods. It is full of heart and pays great respect to the original games, while forging ahead to make a new story.   The graphics and sound are wonderful, and the voice acting is superb. The choice of Christopher Lloyd for the aged King Graham is perfect and he brings the character to life in a way only he could.   If there was anything not to like about it, it would be the excessive use of puzzle-gimmicks...one of the chapters is dedicated to (I thought) annoying puzzles that didn't do too much to advance the story...but even these were wrapped around a father's love for his children.   There are plenty of references to the original games, both obvious and subtle, and plenty of new interpretations on them that don't make you say: 'but that's not what happened.'   The user interface is incredibly, perhaps overly, simple. King's Quest I-IV had parser interfaces, in which you could type whatever sentences you want. KQV-VI had point and click interfaces with five options...this new KQ reduces it down to one button, which is context sensitive, and does feel a bit oversimple. The game isn't hard, but it is fun.  I nominated this game for the 'something in my eye' category. The Sierra Games were a big part of my youth and seeing Graham so well handled made me very happy. I hope you'll give this game a chance, it really deserves it.  But is it King's Quest? Yes. Yes, it is. I really believe that Roberta would be proud of this.   ",
            "review_score": "1"
        },
        {
            "review_text": "Holy crablettes on a crutch! This game is both witty and charming as I remember the series from back in the day I bought Kings Quest III for my Apple II\\c.  Seeing that old Sierra logo... Good times, good times.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR Play the free and wonderful Chapter 1, and leave it at that. Wait for a decent sale for the rest if you must.  I immediately bought the complete collection after playing through Chapter 1, which was amazing. I was a big fan of all the classic point &amp; click adventure games back in the 90s (though the only King's Quest I had played previously was KQ7). Chapter 1 introduced a vibrant world, with lots of great/original characters, a perfect amount of cheesyness in the story, and puzzles that made you think a bit but never required pulling up a walkthrough (as I often remember having to do with some games back in the day). 10/10  Chapter 2, was a pretty sharp downturn. Many of the fun characters introduced in Chapter 1 were gone, and for the ones that did remain, your interaction with them was reduced to trying to feed them so they didn't starve in prison. This goal of not having your friends starve actually turned into the main plot device in this chapter, taking the game in an unneccessarily gloomy direction. The world itself was also confined to what felt like a cramped atmosphere after the openness of the first chapter; and the mechanic of having to go repeatedly go to sleep and wake up, and then have to try to keep your friends alive day after day only reinforced that feeling. 5/10  Chapter 3 was quite a bit better than chapter 2. While the story line with the princesses still wasn't quite as fun as the Chapter 1 tournament story (and the princess characters themselves were rather one-dimensional), at least I no longer had to worry about anyone starving to death. 7/10  I haven't played Chapter 4 yet, but based on the other unenthusiastic reviews here, I don't think I'll get to it for a while. My verdict so far: play the free Chapter 1 and leave it at that. Wait for a decent sale for the rest if you must.",
            "review_score": "-1"
        },
        {
            "review_text": "best adventure since monkey island 3 for me ! also when you think episode game its short but literally the first episode takes as long as around 3 or 4 telltale game episodes",
            "review_score": "1"
        },
        {
            "review_text": "Adventure games have come back in a big way and this first episode of Kings Quest is a great addition to the adventure library!   Pros:  - Great voice acting.  - Fun and engaging story.  - Interseting and varied characters.  - Interesting choices that may impact later events.  - Beautful graphics with some scenes that make you stop and admire.   Cons: - There can be a lot of going backwards and forwards to solve tasks mid-game.  - Price is a lot compared with Telltale games.  - Can't skip already heard dialogue/scenes.  - Episodic (Which is fine for me but I can see why people hate this business model)  For me the first episode is a 9/10!",
            "review_score": "1"
        },
        {
            "review_text": " Disclaimer: this review is for episode 1 only. I will update if my opinion changes over time with more episodes.  ---   The latest installment in  Sierra's  historic line of point-and-click adventures is an absolute joy to play.  They managed to do everything right, and seem to have cut out many less desirable aspects of the  King's Quest  series.   I actually find it hard to fault this title for doing much wrong.  This time around you actually get to control your character directly (controller support is great - Steam controller too). They added in some really awesome action sequences in between the classic point-and-click puzzle solving. Its all very interactive. The artwork and graphics are superb. The voice acting is some of the best I have seen (they even have some A-list actors). The narration reminds me mildly of  Bastion  in the sense that you are actively living a story/fairy tale. Its all very well done.   Pros:  +They manage to keep the same  feel  as the classics; details such as a nonlinear fairy-tale world and creative solutions to puzzles. +Graphics are beautiful. Very much attention to detail (ie. the lighting and the cape, the forests feel alive) +Cinematography is top-notch. It feels like you are playing a  Disney  or  Pixar  movie. The characters are well developed. +The story telling is really fun, and sucks you in. My wife and I couldn't stop playing. It is a joy. +Controller support is smooth. +Voice acting is absolutely great (and I will also mention the volume mixing levels are perfect - they focus on hearing the voice front-and-foremost, which for some reason tends to be problematic in these types of games). +There certainly seems to be several paths one can take - hinting at tons of replayability. +One major welcome difference from some of the old titles is that the puzzle solving is not as random or silly. Things tend to be fairly logical (or as logical as they can be in a fairy tale world).   Cons:  -Very minor, but it would be nice to have a button or a way to skip certain animations while puzzle solving. Some can get redundant, but it is minor because of how short the animations/sequences tend to be.   This title is just really well done - a very welcome surprise for those that loved the  King's Quest  games of yesteryear.  Totally worth full price, IMO.",
            "review_score": "1"
        },
        {
            "review_text": "if you enjoy playing the old series, this game is for you. Amazing work, beyond my expectation!",
            "review_score": "1"
        },
        {
            "review_text": "A great adventure game, with rememberable characters, good laughs, and immersive story. I was expecting a full on point and click game it instead had varied game mechanics from qte to point and click, etc. Cant wait for the next chapters!",
            "review_score": "1"
        },
        {
            "review_text": "This game is riddled with problems and zero help. DO NOT purchase. It shouldn't really be sold. They know it crashes and all they advise is to start the game again. Don't bother, it will only crash or nor let you proceed past the point where the game failed.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately I never got to play any of the original King's Quest games but I thoroughly enjoyed this new game from the moment it started right up to the very satisfying ending. I really cannot wait to play the next chapter.  I found the game to very amusing even if the setting is a generic fantasy one. What elevates this game above other similar ones though is the superb writing, the memorable characterisation and the spot-on voice-acting (including an instantly recognisable Chris Lloyd of Back to the Future fame). Visually the game is fantastic with expressive faces as well as (and I know it is a cliche to say it) Disney quality animation that brings the many characters to life. It really is a joy to play and thankfully the game is not too difficult either. It took me around 7 hours to complete.  Loved it. Cannot recommend this highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "wait for a sale. not like the Kings quest i remember from years ago....Precious; cant even kill your character when mistake is made, and NO dead ends. BLEH! Would suggest avoid, avoid, avoid. shame, shame, shame",
            "review_score": "-1"
        },
        {
            "review_text": "I was really excited to hear about this 'new' King's Quest. I was a huge fan of all the Sierra Games, particularly the King's Quest series. I feel this new version is true to the spirit of the old King's Quest and is a joy to play. It is not a remake, but rather a new game told from the perspective of an aging King Graham. He shares his adventures with his Grandaugher through wonderful stories, which is the 'game' you play. It is more adventure game then a 'choice' game, like the Tell Tale Games (which I also thoroughly enjoy). It is presented in 'chapters' and I felt the first chapter was generously long. I have played many 'episodic' games, and I really felt like I got my money's worth for Chapter 1. I'm really looking forward to the next Chapters. The quests/puzzles aren't necessarily hard, but you will have to think about a few of them. I went back to my old school adventure roots and 'mapped' out the areas, so I could keep track of places I still had things to do and where items where. If you enjoyed the old King's Quest games, then this is a no brainer as a delightful walk down memory lane.",
            "review_score": "1"
        },
        {
            "review_text": "The nostalgia is strong with this one. Brilliantly done. A credit to the game that started it all for me. I just wish it had lasted longer.  Edit: Just completed chapter 5 and thought I would update my review. The only disappointment was chapter 2. Chapter 1, 3,4, and 5 were masterful. Chapter 2 was very... meh.   For those of us who came of age playing games like the original Kings quest, you can tell it is made with a reverence and love for the original games. Cannot recommend it highly enough.   Great story, great music, and wonderful acting. The puzzles ranged from very easy to annoyingly difficult (but not so much you really want to quit). This is a rare game where you actually enjoy the cutscenes instead of skipping through as fast as you can.  Really hope there are more to come, maybe a remake of Space Quest next? :-D",
            "review_score": "1"
        },
        {
            "review_text": "The writing, art, voice acting, and animation are all excellent. If you can remotely stand adventure games in a Fantasy setting, you need to give this game a shot.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would embezzle again",
            "review_score": "1"
        },
        {
            "review_text": "This review is currently for Chapter 1. I'll try and edit in reviews for subsequent chapters.  Full disclosure: Age 27. Grew up playing largely PC games as opposed to console. King's Quest 6 and 7 were two of the most influential games of my childhood and were extremely, extremely formative for me. Not just in my taste in games, but in my taste in fantasy over all. I can't fairly say how much of this review is truely blind nostalgia, and how much is influenced just by me liking this style of game due to being exposed to them early on and loving them.  Actual review: I loved this. I thought it was a good outing in the KQ style that kept crucial aspects of the series while updating some basic mechanics (using WASD to move as opposed to pure point+click). When compared to the entirity of prior KQ games I've played this did have a touch more light whimsical moments and the puzzles were a touch simpler. That said, this is only the first 20% of the game, and when comparing it to the first 20% of other KQ games I've played it seems par for the course.  Voice acting was top notch. Hit at least one stumper puzzle that required Beloved Adventure Game Logic to complete (I had to get a hint. It was a pretty quirky solution). Backrounds were rich and painterly. Game was colorful, and aesthetically pleasing. The puns were as well... 'quality' as you can get with puns. And yes - there's snarky call-outs when you die.  I look forward to the rest of the episodes!  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! Made me laugh many times and I couldn't stop playing, finished it in one sitting! CAn't wait for the next episode!",
            "review_score": "1"
        },
        {
            "review_text": "Great storytelling and magical animations. The whole adventure witth its witty comedy is captivating. Can't wait for the next chapters to come out",
            "review_score": "1"
        },
        {
            "review_text": "A fun filled adventure game reimagined and reinvigorated with colouful animation and a great vocal cast, is a must for lovers of the genre. Cant wait for the next chapter to be available . ;)",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, if you are a fan of Walking Dead or other TellTale games. IF you are looking for an experience on par with the original KQ, you will be disappointed. All in all, this is pretty cool nod back to a classic game.",
            "review_score": "1"
        },
        {
            "review_text": "So far this game has been visually stunning, with incredible characters and a charming (and sometimes surprisingly brutal) story! The different paths you can take through different puzzle approaches are interesting too, and I found that although the second episode is different to the first, it's no worse!  As for the Complete edition vs. Season Pass, it does mention it in the descriptions- however, hopefully there'll be some way to get the epilogue once all the episodes have been released, especially for those who preordered- it's still early days yet! If not, I'll be joining in the debate despite getting the complete edition (which was on sale for the same price as the regular season pass). ",
            "review_score": "1"
        },
        {
            "review_text": "This game was incredibly amusing and well done. It brought back memories from my old point-and-click days, while managing to keep things modern with an excellent voice cast and really funny cutscenes. I'd reccommend this game to anyone who wants a nostalgia-filled, relaxing good time.",
            "review_score": "1"
        },
        {
            "review_text": "Warning: Puns! Puns! Puns! This game is for you who like flesheating mountaingoatunicorns and bridgetrolls striking for better working conditions. King's Quest is a beautifully made point &amp; click game set in a storytime setting. After playing episode 1 of 5 I can't wait to play through the next episodes. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I am an old king's quest fan. This has a great story and graphices. Just need to make it a bit longer and put out the other chapters. Also it would be way cool if the old king's quest series was remade and put out.",
            "review_score": "1"
        },
        {
            "review_text": "This is an immaculate game that doesn't skip a beat in taking up the role as the next King's Quest. The visuals are incredibly on-point with an absolutely BEAUTIFUL painterly style and camerawork that does an amazing job of mimicing the background perspectives of the classic games without becoming stiff. The characters are full of personality and the world feels completely alive with a surprising amount of nods and references to the originals. There are even multiple solutions to some problems that seem to have an impact on the overall story (although I've not played it over to check).  This is being written when only the first chapter is out, which itself is about the length of one of the older King's Quests if not just a tad bit shorter than KQ5, and this is only the FIRST chapter. My only complaint would be that the puzzles are a tad easy, but everything else more than makes up for it and the puzzles are a lot of fun nonetheless.  In the first thirty seconds of this game, I took about twenty steps towards a well, with absolutely no gameplay in between and in that short and shallow moment this became my absolute favorite game, period. The game had that much strength to me and I could recommend this to anyone who at least enjoys an adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a bait and switch.  Chapter 1 was decent, a nice trip down memory lane, so I picked up the whole series. The rest of the game was hot garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "I highly recommend this game. It's extremly enjoyable, with a great story, graphics, and gameplay. The artwork is overwhelmingly amazing and the game is a very refreshing and welcome break from the increasingly violent and gore-infested games that seem to be what so many developers are shooting for nowadays.   ",
            "review_score": "1"
        },
        {
            "review_text": "Phenomenal voice acting that you'll recognize from movies such as The Princess Bride and Beauty and the Beast, excellent story and terrific artwork make this a must get. It is a game of light adventure that does not take itself too seriously as you'll see based on the amount of jokes in the game. The King's Quest series have always held a special place in many gamer's hearts and this one has become an instant classic.  It does not support ultra widescreen monitors and you'll get black bars on either side of the game. This is not gamebreaking in anyway though and is still strongly recommended. Also it is a relatively short game (as most episodic games are) and can be finished in a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Underappreciated and absolutely amazing game. King's Quest is a chapter style visual/puzzle based novel about an old King who tells his grand daughter about his journey as a young teenager, who goes on a long adventure to become the newest Knight of Daventry.  The game is riddled with puzzles, interesting characters, and amazingly fun storylines. From old chemists who like to lick frogs, to bridge trolls, to heel sharpening royal guards, this game is full of entertainment and truly amazing storytelling(And puns, lots of puns. Don't worry though, you'll warm up to them!)  It's important to understand that nothing in this game is truly important other than the story told. The graphics are simplistic, the sounds are simplistic, the gameplay is simplistic, but it's all good because the only thing you should really be noticing, is the story!  I'll give you some pros and cons all the same:  Pros: +Very fun, entertaining story that'll keep you going for hours +Fun chain based puzzles that take you across several places in Daventry to find what you need to progress your adventure. +Interesting, well-rounded(especially the baker!) characters who have very distinct and unique personalities(Just wait till you meet Kyle and Larry XD I lol'd so hard) +Well suffice it to say that the developpers are 'pros!' Get it? (I'm saying there are lots of puns in this game...) +Bridge Troll guilds +You're a bandicoot, apparently? +Buta? Affa Nata! c: +Things are dirt cheap. One shiny gold coin for a 5 feet long starshroom pie? HOW DO I GET TO DAVENTRY!? +Millions of times better than Undertale.  Cons: -Simplistic graphics that water down the glorious views you could have of the landscape. -Each chapter is relatively short(Manny should know), and there are 5 of them, but you need to pay for each chapter to continue. -Lots of backtracking and retracing steps. The puzzles force you to run hither thither and fro to find the pieces needed to continue. It can get sort of frustrating when you're standing with what looks like a pile of junk and you KNOW it's important, but you have no idea how! -Scheming fast speaking merchants with goats disguised as unicorns :c -Buta? Stalama! :c  Overall, the game's absolutely brilliant, and worth the money the developpers want for it. Now I know you guys don't like that you need to pay $10 for each chapter of the game. But honestly, I'm fine with spending that to motivate the developpers into creating bigger, longer, and better future chapters of this game. Can't wait to see what these brilliant minds come up with next!  But please, do me a favor:  DO NOT. I repeat: DO NOT USE ONLINE GUIDES TO FIGURE OUT THE PUZZLES!  It's so much better if you actually figure it out yourself. Cheating, and using the guides, will completely destroy the fun in the game, and provoke negative reviews because, quote 'it was boring and lame, cause I was a 10 year old who wasn't smart enough to figure out the puzzles, boo hoo, rant rant rant' Seriously. Do us all a favor, and just play the game with no guides. You'll thank me later.",
            "review_score": "1"
        },
        {
            "review_text": "This is the review of only playing chapter 1. I may change it after I play the 2nd or more chapters when they get on sale for a reasonable price. I go the first chapter for a dollar and it was truly a dollar well spent! I found this a delightful cross between a point and click adventure game and chapter driven story game. The jokes were extremely amusing set in a very well designed world. Plus the fact they picked really great voice actors with a great idea for what they wanted. Granted, I hear they dropped the line in the next chapter but I'll judge that then. I really liked this game. Plus its the first chapter based game where a chapter was actually longer then an hour or two. I think that everyone will enjoy this nice game and a great game for the family. In a world filled with depressing mature titles, its nice to have a game that is more leisurely and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I was looking for a fun, quirky puzzle game and I think I found it. I've only played episode one though, but I still enjoyed it. I would recommend it to everybody to just give it a try",
            "review_score": "1"
        },
        {
            "review_text": "I've only played the first chapter, but this is legit the most fun I've had playing any game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Just completed Ch 1 &amp; 2 and I've spent 14 hours already, and it's good!  I'm always a fan of point &amp; click adventure since the old Sierrra &amp; LucasFilm days (changed to LucasArts, but I think now it's no more). I'm more toward the LucasArts style of adventure (you can't go wrong nor die in the game) instead of the old Sierra style, although I liked them too.  This is the way the new modern point &amp; click adventure should be. It's retains its old beloved style, yet the gameplay and graphics have been adjusted to modern times, Full 3D with moving cameras, yet still maintain that look &amp; feel of the traditional games.  Some devs still stick with pixel arts style (mostly indies because of the lack of funding), but AAA point &amp; click adventure should be like this. Middle tiers developers usually go with 3D characters on 2D rendered backgrounds (Gray Matter, etc), which is also nice, OR with high quality &amp; high resolution 2D hand drawn sprites (Secret of Monkey Island Remake, Days of Tentacle remake, Broken Sword 5, Runaway 3, etc) which is also nice.  Just like old Sierra style, you can still die in the game (sometimes you need to for achievements), but the whole mechanism feel so polished and you're put right back before you die, thus giving no penalty for exploration, which is a good thing. In fact, this game encourages you for exploring as multiple solutions are sometimes provided for a puzzle.  The humors and the whole atmosphere of the game feel good so it doesn't feel boring.  Chapter 1 is more like the old traditional style, with multiple paths for solutions and mostly inventory based puzzles. Most of the puzzles are logical, although a few here and there not so much, but still feel very entertaining and you don't feel like you're cheated.  Chapter 2 is smaller and have a slightly different mechanism. More paths for solutions are in this chapter 2. You're probably want to re-play ch. 2 more than one time if you're curious on 'what if I chose that path' in the game.  Highly recommended, and I still have 3 more chapters to go :)",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the first chapter, and was blown away by everything. I instantly cared about the characters and the storyline. I'm eagerly waiting for the following chapters. I am one of those oldies who played the original King's Quest and fell in love with them back in the day. Even though they have changed the gameplay around a bit, I feel they have kept the charm of the series intact. I would like more difficult puzzles like in the old games. Though I do say to those wanting to play this to play the original ones first. Not that you truely have to. Thank you to The Odd Gentlemen and The Williams' for continuing such a missed and beloved story. This brought back such wonderful memories for me, and I really needed it right now.",
            "review_score": "1"
        },
        {
            "review_text": "King's Quest Chapter 4 is one of the worst games I have ever played. As a lifelong sierra fan, this pains me to say. Chapter 1 was great. Chapter 2 was not nearly as good as 1, but at least it brought some elements of the original kings quest 3. Chapter 3 veers suddenly off into mostly narrative and very easy puzzles, but still I thought it was building up for an excellent Chapter 4.   Unfortuanately I was very wrong. For the first 20 minutes at least you do almost nothing but watch cutscenes. Then, after Mananan steals alexander for 18 FREAKING YEARS he comes back and casually mentions some of the events of Kings Quest 3. Instead of being mad happy his son is back after being a slave to an EVIL WIZARD King graham gets ♥♥♥♥♥♥ that he uses cat cookies and can summon fireballs. So he decides to take everyone on vacation. now you watch a lot more cutscnese.   Well I've been playing for over an hour and maybe have done 2 puzzles (not very good ones)? Maybe this sweet ice l labryinth will make me forget this excruciatingly slow and nonsensical first HOUR. OH MY GOD THIS ENTIRE place IS JUST ENDLESS, REPETETIVE, SOUL DESTROYING, NEVERENDING, ROOM AFTER ROOM OF: FOLLOW THE PURPLE LINE! MOVE BLOCKES AROUND! MOVE BLOCKS THAT HAVE A PURPLE LINE! repeat that maybe 20 times also add a ton of useless cutscenes once again  Ok I just did over 2 hours of the same puzzles, whats next? Oh just a couple more PURPLE LINE AND BLOCK PUZZLES. then you get to play the game of wit chess game again from chapter 1! SWEET! great oh now that girl you didn't marry is an ice queen, and manny/mananan was the sphinx. Thats ok your son alexander that youve already learned to love (and you even made a fireball!) just shoots the sphynx in the mouth with a cat potion. again. i guess 2 cat potions was the necessary amount to keep him a small cat.    oh and the ice queen, aka the girl you didn't marry from chapter 3 aka the girl thats basically been a slave to Mananan, She.♥♥♥♥ing.Shatters. dies maybe the most horrific death ever for absolutely no reason at all.  now the game is over.  this chapter is an insult to adventure games, and spit in the face to consumers.  ",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best modern 'Point and Click' Adventures in a long time. The Controls are now direct (XBox 360 works great).  It has the right amount of being silly, being funny and drama.  This game wipes the floor with the Telltale way of doing things and proofs that you don´t only have to watch games, you actually can play them.  Kings Quest back to former highs.",
            "review_score": "1"
        },
        {
            "review_text": "I have played all four chapters (the fourth having just come out at the time of writing this) through and through, and let me tell you,  buy this game.  The incredibly captivating story, visuals, and music alongside the charming humor and heart of this game will quickly envelop you. I have played all of the original King's Quest games, but you do not need to have in order to enjoy this. Yes, there are many fun callbacks and references to other KQ games, but there's nothing crucial you need to know before going in.  The one piece of advice I have before purchasing this is to consider the complete collection, because it seems I am now unable to play the epilogue because I bought the first chapter and then the season pass. So, just be careful about which option you choose to buy.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of King's Quest since I was young, I was so excited to hear there was a new one! The graphics are beautiful, the voice acting was incredible, the story line is mesmerizing and the ability to play a different way throughout the chapter was wonderful. I played the first chapter several times just to go back and do each option differently, as well as for the giggles on certain parts (like part at opening the door and you pick the wrong lever to have the bed slam into Graham) only for the portion to hear Graham say something funny and restart.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic character design, humor, animation, and sound. The puns are relentless. I'm so happy that Daventry is alive again after so many years. Seriously. Just play it.",
            "review_score": "1"
        },
        {
            "review_text": "The first chapter is really good but the rest of the content feels really flat. Skip it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very good, funny and well written adventure game. One of the best in recent time. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and graphics. Loved it. Loved the story, too.",
            "review_score": "1"
        },
        {
            "review_text": "One of the puzzles really had me stumped. I had to really go out on a limb to solve it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've always been a King's Quest fan and this is no disappointment!",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend this game until such time as they fix the Complete edition purchasing mess. I want to buy the full game with the epilogue but because i bought episode One steam won't let me me. This is rubbish.",
            "review_score": "-1"
        },
        {
            "review_text": "  8/10 due to some miner bugs",
            "review_score": "1"
        },
        {
            "review_text": "not a bad game i grew up on the original serria games and this one is ok feels a bit to much like a TellTale Game than and old serria game though but it was a fun game",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game while on sale, didn't even know it existed until it popped up in my queue. I wasn't expecting all that much from it, but what I got was a grand adventure in the best sense. From the little things like being bitten when you stick your hand in a bush to even feeling for characters you only spend a short time with everything in it was been thoughtfully planned.  I'm only 3 hours in to the first episode (chapter 1) but I'm amazed it's actually lasted that long considering it's episodic.   *Gameplay* Overall it's very simple, you move around the screen select a few things and do a few puzzles, using your items is a bit weird at first, since you need to go to your menu and select the item instead of having a pop up that says you can use it here (I don't play many puzzle/quest games so I'll assume this is the norm) While not complex, it is very satisifying to play.  *Voice acting* Some of the best voice acting I've heard in a game in a long time, with some very famous talent thrown in. The biggest one being that Wallace Shawn (Vicinni, Princess Bride) is in this and just put a huge smile on my face when I noticed it. It also has Christopher Lloyd (Back to the Future), And to my surprise Zelda Williams.  *Story* Not going to give anything away, but it keeps you on the edge of your seat, which shocked me as I haven't wanted to hear more or see more of a story in a game in a while. If you like silly humor, bad puns and some underhanded jokes you'll enjoy this a lot.  Overall even if I did not get it on sale I would still highly rate this game.",
            "review_score": "1"
        },
        {
            "review_text": "Wow....what a beautiful game! its so well made, fluid... very fun for sure. I grew up with Kings Quest (We miss you Roberta Williams). I also played all the other games (Space Quest, Police Quest, Leisure Suit Larry, etc...). These games were all fun for the time they were made! I was just a young kid playing on a AT&amp;T PC 6300 (8086 computer with CGA!!) they were so much fun and bring back good memories. This is only part 1 of the game with more fun to come. I see a bunch of people complaining about that but good things comes to those wait! and I want more beautiful releases not half the crap that comes out these days.",
            "review_score": "1"
        },
        {
            "review_text": "prety good for a reboot !",
            "review_score": "1"
        },
        {
            "review_text": "I tried Chapter I. I liked story, music, sounds, ability to pause at any time. Graphics felt average. I disliked interface (no map, no dialog skip), lots of running around combined with slow character movement.  I had a feeling that 3D engine limited creators in many ways.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful. I've had a great time playing through each of the stories. Highly recommended to anyone who enjoys great storytelling, characters, voice acting, and puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful retale of the stories of King Graham I so fondly remember playing as a kid. Totally worth to play, if you like adventure games!",
            "review_score": "1"
        },
        {
            "review_text": "I recently came across King's Quest in my Steam library. I am not sure when I originally purchased it was. However I am so glad I did. The look, feel, and polish allow for a great conduit to deliver the story. I loved the voice acting and comedy.  In the end I am very glad I tried this game out. For a long while I have been finding it hard to get lost in a video game. In this case however, since launching the game I have completed all three released chapters and am eagerly awaiting the last two. Sometimes I just want a good story it seems. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Lots of replayability. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is quite possibly one of the best games i've ever played. Not because it had the most epic battles or realistic graphics, but because of the fantastic story telling and beautiful artistry. This an all around magical compostion of game creation.",
            "review_score": "1"
        },
        {
            "review_text": "Having played the original King's Quest series, I can vouch for the accuracy of the description 'reimagined'. The stories, setting, and puzzles are different, and the graphics updated, but the general idea and feel are quite similiar to the original. Each of the 5 episodes is a self-contained story, within the over-arching story of the life of the principal character.  The good: - nice graphics (cartoon style) - excellent voice acting! - good range of characters (main character and protagonist, plus several secondary characters) - heart-warming overall story - humor well done - not overdone - good range of puzzle types - almost no combat (not everyone will agree that this is a good thing, but I appreciated it) - it's almost always clear when a puzzle component has been found/solved (although not necessarily for which puzzle) - major choices matter  The bad: - not much clue-following; many puzzles require only straightforward (if sometimes complex) reasoning, while many other puzzles have arbitrary solution components (solveable only by exhaustive search) - puzzle solution components are oftern widely separated, requiring a lot of repetitive travel that does nothing to advance the story - sometimes solution component 'hot spots' are very small, and not necessarily in the most expected precise location, making them easy to miss; no cross-hair assist - some puzzles require a change in state that is triggered solely by leaving and re-entering the area -    the non-selected princess gets a rotten deal    - it's often unclear which choices matter, until after they have been made (sometimes long after); with limited save/load ability, re-do is usually not practical  FYI: I bought the first chapter on PSN for my PS3. Switched to Steam when the full suite went on sale for $15.  The bottom line: 9/10 for on-sale value (7/10 at original price).",
            "review_score": "1"
        },
        {
            "review_text": "+ Puns + Probably good for kids  - Slow pacing - Unexciting puzzles - Boring game world/characters  ",
            "review_score": "-1"
        },
        {
            "review_text": "I was a big fan of the old King Quest games. A miracle as occurred and this new one is actually good!",
            "review_score": "1"
        },
        {
            "review_text": "More bad puns than Mickey Mouse Club House. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "What a beautiful game! The Odd Gentlemen did such a wonderful job of throwing you, unapologetically, into a beautiful world filled with zany characters, a compelling story, and many different paths to take. What you choose to do makes a difference! I have read reviews of fans who were disappointed that this game doesn't play like the old games. Though I can understand that their nostalgia button isn't being mashed, it is certainly being caressed. This is a new game for a new generation of gamers. The puzzles are simple, true, but this game is true to the original King's Quest games: It is a means of interactive storytelling for children. A++ to the artistic team behind this spectacular game. I so look forward to the new chapters!! (And to replay this one :P)",
            "review_score": "1"
        },
        {
            "review_text": "all in all an amazing game with extremely funny and witty humor xD. Fantastic environment :D heartwarming personalities &lt;3 truly a game for each and every person who loves a magical adventure! :)",
            "review_score": "1"
        },
        {
            "review_text": "Oh my god! This is amazing! I grew up playing Sierra adventure games, and you can tell the developers of this game really did their homework. This is an excellent tribute to King's Quest, but more than that it's an excellent adventure game by itself that requires no prior knowledge of the series. I've been waiting for adventure gaming to make a comeback, and it looks like it finally has.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game! Takes a bit to get the chapters released but so far it's very much worth the wait. Plus, it will keep you interested.",
            "review_score": "1"
        },
        {
            "review_text": "Started this game with the free first chapter ..After 10 mins of playing actually figured I would get the season pass.. The graphics were great, voice acting on point, and the game itself was funny and involved..  I was willing to over look the crappy switch over from consol to PC control, Quick time events which I hate, and the auto saving...  Then it happened...Went to play again and the last save I had wouldn't load...It kept defaulting back to the first save..I checked the save games list and my second save was there, just wouldn't load it.. Played around for a while trying to get my second save to load...no luck..  Well if the crappy save system is going to ding me 2 hours of game play each time I leave the game I am putting my wallet away..Which is a Shame...would have been a fun game to keep playing...  Going to have to give it a thumbs down because of the lazy way they handled the switch over from consol to PC, and the crappy save system...Fun game from what I could see, to bad they screwed up the basic stuff..",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty graphics, but that's about it. I must be getting old, but I remember my parents buying me the KQ 1-3 pack for Christmas back in the day on 5.25' floppy disks.  The original had that amazing charm of being one of the first amazing graphical adventures I played. This however just seems to be (as other reviewers have mentioned) nothing more than a bunch of quicktime aciton sequences.  Half the fun (or is that frustration) of the original Sierra game/s was to use the typing system to determine you surroundings and to find a solution to your problem.  This looks too much like that horrid Dragons Lair game of the 90's that invaded pinball parlours with pretty graphics and non existant playability. If you're feeling nostalgic like I was, and remember the original, grab the first chapter for free. It only got about 20 minutes of my time and just didn't emote the same childhood enjoyability of the original. ",
            "review_score": "-1"
        },
        {
            "review_text": "When I saw they were making this I thought, 'Oh great, another remake of a classic series.' But the fact it was the King's Quest serious hit me particularly hard. It was hands down one of my favorite series of games growing up. Easily one of the most influential it was the first time I recall actually caring what happened to the pixelated dude on my screen.   I refused to be involved in it. I knew nothing I said or could do would stop it but I wouldn't even acknowledge it. And then I heard that Christopher Lloyd was going to be involved. He is without a doubt my favorite actor. And then I heard Tom Kenny, and Wallace Shaw and WHAT THE HECK IS GOING ON HERE!?!?! So I decided to check it out. And I got excited. But I've been burned in the past so whenever I saw it pop up in my steam queue I'd click on past it. Until yesterday when I pulled the trigger.  I was IN DAVENTRY AGAIN!!!!!! It's not a rehash of the old series, this is CLEARLY made by fans for fans and has all of the charm of that silly little 8 bit game paired with the BREATHTAKING beauty that today's modern gaming allows. Actually to compare it to modern gaming isn't fair. Most games today, the scenery is just there to make the levels more interesting as you breeze past and shoot the next unknown random person in the face.   This game is a work of art. From the talented acting of Mr. Lloyd, Mr. Kenny, Mr. Keaton, Mr. Wallace, and .... Miss Williams. That's right, Robin Williams daughter. The one that when she was born was named Zelda because of her dad's love of adventure games, is the voice of Amaya Blackstone.   This, game producers is how you relaunch a series. This is lovingly detailed and an homage to the original while being a beautiful masterpiece fitting of the King's Quest name. I *HIGHLY* recommend you purchase this and I look forward to many more adventures to come from these guys. Activision.....you and I....we haven't been the best of friends....you've hurt me many times in the past, but I gotta hand it to you, you made the right call going with the Odd Gentlemen. This team knocked it out of the park,",
            "review_score": "1"
        },
        {
            "review_text": "It's terrible.  The cutscenes, including simple 'look at an item' ones, are all unskippable, even if you've seen them before or are reloading after death. If a three-line dialogue pops up on screen when you look at a road sign, then you get to spend 10 seconds listening to the (awful) narrator read it to you, even if you can read it yourself in a fraction of that. God help you if you accidentally click that thing again.  Half of the fun of the original King's (and especially Space) Quest was finding ways to die, since the animations were often funny or gruesome, and typically had mocking quips from the narration. The deaths in this game are dull and sanitary. They use Prince of Persia: Sand's of Time's 'wait, that's not what happened' reload gimmick, but the KQ narrator is unpleasant to listen to. Adding insult to injury, dying means reloading and being forced to watch unskippable cutscenes again, so I quickly lost my desire to find ways to die.  The puzzles are cake. There's no satisfaction in clicking on the only usable thing on the screen and watching a cutscene. The one time I felt some tension to solve a puzzle, the game dissolved it immediately. After recovering the magic mirror from the dragon, the dragon notices you. I started thinking of how I would get away, but it didn't matter; Cutscene Graham handled it himself with what could've been a fun little puzzle sequence. After that, the game turned into a rail shooter with quick-time events, and then more boring cutscenes with unskippable dialogue.  Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay is excellent. Strikes a perfect balance between classic P&amp;C adventure and a modern game. Would recommend this to anyone not just retro gamers. I love all the nods to the classic series and I especially love how the theme music incorporates the main theme from King's Quest V which in my mind is the main theme of the series. The graphics are gorgeous, the controls are perfect, the story is fantastic. It really weaves into the existing series without nullifying what came before it. It's untold tales from Graham's past.",
            "review_score": "1"
        },
        {
            "review_text": "I remember learning to read playing King's Quest 2 when I was 5 years old. Although it plays a lot more like Dragon's Lair, it's a great story that made me fee like that 5 year old kid again. They do a great job of capturing humorous deaths from the old Sierra games, too. The scenery and ambiance are spot on, beautiful landscapes and spooky forests. The only downside is, now hardware's so fast you can't watch the game draw all the lines and fill in the colors, like in the originals ;)",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed every minute playing through the first chapter, would definitely reccommend this to anyone of any age. Great art, funny and well-acted dialogue, can't wait for more episodes to come out. As for the controls, I was expecting it to be more of a point and click game but after a few minutes it was pretty apparent it's more of a controller game so I used a controller for the rest of it.   My only complaint is early on it's pretty linear and the gameplay is very simple and straightforward, though it opens up shortly after that and does get a little more challenging.   If you're on the fence I'd say buy the first episode and see if it's for you, I had no idea what to expect and was pleasantly surprised by how much i liked it. ",
            "review_score": "1"
        },
        {
            "review_text": "My brief review:  As an adult, and a fan of adventure games both classic and modern, King's Quest feels frustratingly linear and patronizing. There's potential, but it misses the mark in a few small and big ways and I can't recommend it for most people. However, it's definitely worth a look if you have children or younger family members.  Slightly longer:  The 2015 King's Quest is a mixed bag, but not one that I can recommend for most players. Graphically, the game feels very last-generation (except, bizarrely, for the cape animation) with few options to choose from. Just the ability to enable some higher anti-aliasing would have been nice as the game is pretty jaggy. It's obvious that the developer is trying to ape the Telltale style, but there's a level of charm in the animations and writing which don't hit their goal... which is unfortunate because King's Quest is desperately -- gaspingly -- trying to be charming. They overdo it.  The gameplay is incredibly linear and patronizing (a bit simple even by Telltale standards), the tone is forcefully schmaltzy, and I can only begin to express how BRUTAL it is that the game lacks a dialogue/animation skip. Seriously, the fact that you can't skip anything just puts a huge spotlight on all the flaws. The dialogue, which is inherently (mind-numbingly) repetitive, grates after just the second time.  I'll say this: the lack of outright failure does NOT bother me and the way that's handled with the narrative device is genuinely inspired. I hated in old adventure games when I could die or completely screw myself over because I didn't do a small thing earlier in the game. I'll never miss that, and I don't think that King's Quest is missing anything by being 'easy.'  I also got the sense that the publisher is eying an eventual mobile release. There's just something about the structure of the world, and its controls, and its options, and it's graphics that tells me a mobile release is in the future.  It's not all bad. It's not even mostly bad. If you're looking for a game that can be played by your children, this probably hits that sweet spot. While it's difficult to call this game an “homage” to the Princess Bride, since through sheer quantity of lifted elements it can only be called a ripoff, nonetheless the core story beats and voice acting are a cut above. I expected Christopher Lloyd to come off as depressingly old, but his performance is actually perfect for his character. The only character that annoyed me was the granddaughter, Gwendolyn. She's such a well-worn trope, a cliche, that it had me rolling my eyes whenever she chimed in or we got a glimpse of her B-plot.  There's a potential to this new King's Quest that goes unrealized, but it's there. It's enough that I haven't completely written off future acts, but I'm not counting the days. A Steam sale and a dialogue skip might be enough to sway me. Until then, I can't recommend this game to most people... but if you have children, give it an honest look.",
            "review_score": "-1"
        },
        {
            "review_text": "I find the game very amusing and decently challenging.",
            "review_score": "1"
        },
        {
            "review_text": "First chapter showed potential, I skipped the second after trying a couple of times (Telltale gameplay and 'real' adventures don't go well together), I gave up on the game as a whole when I saw the beginning of chapter three.",
            "review_score": "-1"
        },
        {
            "review_text": "A great point and click game. Pays homage to it's Sierra roots. The animated graphics make it a modern day Dragon's Lair or Space Ace.",
            "review_score": "1"
        },
        {
            "review_text": "(Based on Chapter 1) Wonderful story, atmosphere and voice acting. Puzzles are fun and logical (for the most part). The game looks and runs great on my old PC. I highly recommend to give the first (free) chapter a go, especially if you loved the classic adventure games back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "The best way to start this review off is by saying I have absolutely zero experience or knowledge of the original King's Quest series. Also, I'm not an extensive player of Adventure type games; I've played The Wolf Among Us, Year Walk, and, if these count, Dear Esther and The Stanley Parable. This should give you a fair idea of my experience and expectations for King's Quest. Having said this, I really enjoyed this first chapter of the game. King's Quest: A Knight to Remember, is sort of an adventure game. I say 'sort of' because it doesn't fit the usual mold I expect for the majority of adventure games. It isn't point'n'click, nor are there obtuse puzzles to solve. While playing I felt like there was some familiarity in gameplay to The Wolf Among Us, however there were a few differences.  There is a heavier influence placed on your inventory items in King's Quest, and while there are story choices to be made, they don't feel altogether that consequential, at least in this first chapter. Further, the gameplay has some interesting elements, such as a few first-person rail shooters segments that stand out, among other fun (but short lived) moments.  A Knight to Remember does contain a fair number of puzzles, but they don't ever feel too unreasonable or illogical - most of the puzzles make sense. I found there was some thought required, but never in a way that was potentially frustrating or that could derail the pace of the game. This is good, because it fits well with the light-hearted nature of the game.  The visuals of King's Quest are excellent. You could certainly draw comparisons to several Telltale games, such as the aforementioned The Wolf Among Us or The Walking Dead, but I find the aesthetic of this game to be much more colorful - this is especially apparent in some of the water-color inspired backdrops.  Overall, King's Quest is fun, light-hearted, not too challenging, and beautiful. The story and dialogue are done nicely, and I enjoyed the few hours of entertainment I got out of this chapter. I'd recommend it, for sure. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is smart, witty, and rewarding",
            "review_score": "1"
        },
        {
            "review_text": "First episod is very good for my taste! Visually it's not so great, and mouse/keyboard controls are just awkward (gamepad really helps!). But atmosphere, complete with fun characters and great voiceover (they've got Christopher Lloyd and Wallace 'The Grand Nagus' Shawn) are excellent! And it's all I really want from King's Quest game.  Can't wait for second episode!  ",
            "review_score": "1"
        },
        {
            "review_text": "Nice game....great approach of telling the story... many ways to win one puzzle/test....excited for the second part....!!!  if you smart enough the chapter can be completed like in 5-6 hours :)   *There's a bit of slight glitches in the game here and there...i got one snap shot in my profile....otherwise...its all good...  one of the good Classic game....!!!",
            "review_score": "1"
        },
        {
            "review_text": "As an orignal Kings Quest player I hated this game in beta. HOWEVER I did'nt test for very long SO I thought I would give it another chance.  I love this game !! I have'nt had so many giggles and enjoyed the art with a game in a very long time.  (WoW was funny for a while then got to serious.)   Kings Quest is enchanting. Refreshing and a riot to play  I really hope they can keep up the standard on other chapter releases and not get chewed up in the corporate grind.    The only con I have is the short 8 hour play time left me waiting for more.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the sexiest thing I've tamed in my life. The music is Jesus. The art is Jesus. The story is Jesus. The gameplay is Jesus.  THIS GAME IS JESUS. ",
            "review_score": "1"
        },
        {
            "review_text": "takes a while to get going. But then you find yourself in love with the characters and the story. It's like a good book - you just want to continue (even with the ... suboptimal graphics). Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This game felt like the classic king quest i remember but with better graphics and excellent voice acting. This game was a joy to play and i cannot wait for the next chapter.  I found the game completely worth it!  If you ever played the original Kings quest you will remember certain locations with an, 'OMG I REMEMBER THIS PLACE!' type of reaction. plenty of reminders of old while being introduced to new. An instant classic and fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "i've never felt so many different emotions from just one game, let alone one chapter. ending is a cliffhanger thought so be prepared to suffer irresesitible urges to buy the next parts. I know i'm going to.",
            "review_score": "1"
        },
        {
            "review_text": "I was a little skeptical about this game at first with me being a huge fan of the original Sierra Online games from the 80's and 90's. I was also not keen on the overall comedy vibe present throughout the game as I was expecting something a lot more serious. But after playing it and completing the first chapter I must say I really enjoyed it! It's definitely worth getting for any adventure game fan. The graphics are beautiful and the soundtrack is really enjoyable (am pretty certain I recognized the KQ5 theme in there somewhere which was a pleasant surprise ;) ). The only critism I have is the lack of an in-game map of some sort. It was a little frustrating having to remember where all the locations were but that's just a minor gripe. The developers did a great job and I'm looking forward to playing the rest of the series! :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice revision of an old classic. I imagine you get a lot more out of it if you actually enjoyed or remember playing the old KQ games. The worst part about the game is that in the first episode you cannot skip through the cutscenes, but this has been corrected in the second episode. They will probably continue this episodic improvement so keep that in mind as you play through. I don't understand the negative reviews about not being able to get the epilogue, as most of the content hasn't even been released. It is unclear at this point what the epilogue even is. It could simply be a deluxe edition type video, and it will most likely end up being released with some kind of stand alone package if enough people whine about it.",
            "review_score": "1"
        },
        {
            "review_text": "Really amazing graphics, fun gameplay, good puzzels and really funny senarios. This game really took me in the adventure, can't wait for the entire season to come out!   Loving this game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for 99 cents. Best spend 99 cents in mine life.",
            "review_score": "1"
        },
        {
            "review_text": "Only play episode 1 so far, but ... Wow... love this game, really well done ! more review later",
            "review_score": "1"
        },
        {
            "review_text": "King's Quest is an odd duck of an adventure game. On the one hand it tries to be like Telltale with linear story 'choices' for some chapters. On the other hand it tries to be a little bit more like old adventure games where you pocket everything and figure out puzzles.  King's Quest is uniquely interesting in that the story tries to keep all of the other older Kings Quest games in canon as much as possible. With a majority of the game taking place inbetween the various older games as we watch King Graham get older.  Some chapters are easily better than others with Ch. 1, 5, and 3. Leagues better than chapters 2 and 4.  That said when taken as a whole package King's Quest is surprisingly funny and full of heart with an exceptionally emotionally charged ending.   I would recommend it if you'd like to try something with a little bit more story oomph than what Telltale has been providing.   That said prepare yourself for variation in quality between chapters.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a KIng's Quest fan for the past a couple decades. I've always enjoyed the series (except for the horrible King's Quest Mask of Eternity). This series was, for the most part, a delightful return to those long ago games. The storytelling was rich, the graphics beautiful, and the gameplay fun and smooth. Players have the option of three different story routes Bravery, Wisdom or Compassion, which gives the game some slight replay value. The early chapters are light-hearted and are most aligned with the old game series. The later chapters place more emphasis on solving puzzles and less on collecting objects. The puzzles themselves pose some challenge, but no overbearingly so, which I enjoyed. Also, the storyline in the later chapters beoomes rather dark, and I can't say I was too thrilled with it, though I will concede it was good storytelling. It's just not what I'm looking for in a King's Quest game. If you're a fan of the old series definitely check this one out.   That being said, I'm really disappointed that the game developers are releasing an Epilogue chapter that will be unavailable to those players who purchased the Season Pass. I think that's utter ♥♥♥♥♥♥♥t. If you're planning on purchasing, then I suggest getting the complete series or you will be unable to get the extra chapter like me.",
            "review_score": "1"
        },
        {
            "review_text": "This is great. And even greater if you know the originals.",
            "review_score": "1"
        },
        {
            "review_text": "A funny and beatiful homage to the old kings quest games. The more you know the old ones the better this is. And its NOT like telltale games it has real puzzles and real gameplay. Some nice riddles as well. ITs not hard like the classics of course but its a superb trip down the Kings quest lane.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun, especially if you played the previous King's Quest games. Rewrites some minor pieces, but mostly falls between the other stories and ties them all together in a great way",
            "review_score": "1"
        },
        {
            "review_text": "Great way to spend time and improve puzzle solving. Plus this game is an epic tale that will definately hit you in the feels,",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - no bugs, well written, visually gorgeous and loyal to the original series.",
            "review_score": "1"
        },
        {
            "review_text": "King's Quest is a puzzle game that blends crafty lateral thinking puzzles and rich story-telling into a great experience. I thoroughly enjoyed its variety of branching patterns. The voice acting is really on-point and the characters are really memorable. It mixes fantasy and sharp modern wit so the writing is never dull. The scenes and graphics of this game are amazing, and the colors just pop.  It's an amazing single-player experience, and I'm definitely going to buy the other episodes when they come out. For 10 dollars, it entertained me (without frustrating me) for over 15 hours.  Guys, just buy episode 1 and see if you don't love it!",
            "review_score": "1"
        },
        {
            "review_text": "Very charming in it's presentation and character. An array of talented actors voicing each character, such as Christopher Lloyd as and older King Graham, Josh Keaton as a younger Graham, and other notable voice talent such as Tom Kenny and Wallace Shawn. The game follows a fashion of story telling reminiscent of 'The Princess Bride.' In that, you control young Graham in his adventures narrated by an older Graham, who is telling his stories to his grandaughter Gwendolyn.  The only thing that may turn off seasoned King's Quest players is that the puzzles aren't as difficult as in older games, and as of the first episode, there aren't many ways to die. However, there is still a lot of fairly good humor in the game to make up for it. Maybe not burst out laughing kind of funny, but the kind of humor that'll give you a good grin or smile.",
            "review_score": "1"
        },
        {
            "review_text": "Voice Acting: Fantasmal, Zelda, Lloyd, and the rest nail this. Good new action / puzzle game when plenty of throwbacks to the classics (check my SSs for KQ VI throwbacks) Great amount of play time per chapter. Very easy to revisit and beat a childhood revamp then get back to dumping on people in Ark: Survival  I hope the chapters continue along as Grahm matures. A bit zany and easy of a game at first, but I did try and die. Thats all that matters.  Lets hope Sierra is back for good. KQ, SQ, PQ, and the Qs",
            "review_score": "1"
        },
        {
            "review_text": "Totally amazing what ive seen so far.   Graphics/Style of the game is very beautiful, Story 9/10 for now and how the Story is telling from Grandpa to his little girl is very cool. Cant wait for the next Episodes. &gt;Definitally worth to buy.&lt;",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful Game Graphically...Love it BUT  I really hope that the next chapter has MORE items to discover and use... I really hope the next chapter has more things in the environment to click on and explore...  The game was so straight forward...the 'choose your own adventure' type effect was really cool but I guess I expected more complexity from each scene...you know the things you can look at and responses...the items you can pick up interact with ect...the number of ways you can die...LOL  My Aunt's first comment was...'Wow it's really amazing looking...but there's nothing to DO in this scene...or this one....or this one...'  Great first chapter...for a revival game....*crossing my fingers*   Willow ",
            "review_score": "1"
        },
        {
            "review_text": "This is an absolutely beautiful game filled with fun puzzles and entertaining characters. Truely unique art that really makes this game a pleasure to play, and the tone of the game is so fun and easy going it's difficult to put down.",
            "review_score": "1"
        },
        {
            "review_text": "Playing through this game i immediately began to wonder whether it would live up to any sort of rebirth of the franchise or even the idea and aspirations the original games gave, that sense of wonder and intrigue the world offered, no matter how big or small. Even with the original creators blessing i was skeptical, but to my surprise Odd Gentleman not only hit the mark but really pinned down what King's Quest did for me back in the 90's: atmosphere and story. Yes a lot of people may say they lacked this back in the day due to graphical and storytelling limits for computers then, but it was the world and environment and fantasy that helped it tell the story it needed to, and the reboot here does that perfectly. Aside from a few minor gameplay glitches i experienced as well as being somewhat simpler in difficulty, this was greatly superseded by the music, characters, and overall atmosphere and artwork that really accomplished far more than i expected. Voice work, backgrounds, the world itself has been given a lot of love and it really shows as you play. If you came for the difficult, open-ended world of the original KQ games this might not quite do it for you, but if you are looking for a game that delivers a calm and serene world and be taken into bite-sized tales woven by King Graham himself in his older years, this game delivers and more on what it has promised in the first game alone in this reviewer's experience. Play it, and may Daventry be all you dreamt it would be!",
            "review_score": "1"
        },
        {
            "review_text": "Even with my nostalgia goggles off, I was blown away by this first installment. I highly recommend this worthy successor that's faithful to the original series.  The gameplay isn't too difficult. No KQ5 rat problems here, especially considering that there's now an AutoSave feature. I only struggled with the Battle of Wits. Also delighted to find there's multiple ways to solve problems, which means I'm going back two more times to take the options I didn't take the first time around.  The visuals are gorgeous, the soundtrack is delicious as it helps tell the story with music, and the voice acting is a real treat.",
            "review_score": "1"
        },
        {
            "review_text": "I cant stop playing someone help!!",
            "review_score": "1"
        },
        {
            "review_text": "I'm a long-time Sierra / King's Quest fan, played King's Quest 6 when I was younger and to this day it remains one of the best games I've ever played. *I'm updating this review to a positive one after having fixed the 'exclusive' epilogue issue. If you have chapter 1 and want the full game including the epilogue I recommend looking for a 3rd party supplier (search the web for 'title' cd-key) instead of buying the season pass.  -The good: -beautiful graphics, especially the environments -a well-crafted game and enjoyable experience -light-hearted and humoristic -fun for the whole family  the bad: -practically no graphic settings to tweak, visuals could have been even better -no way to skip cutscenes previously seen -maybe too humoristic, sometimes goofy...will please some but personally  I think a slightly more serious approach would have been better. -the 'complete collection / epilogue' issue (see workaround above)",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderfull adventure game. If you are a fan of the genre of want to try it out for the first time, then King's Quest is the adventure game you're looking for. It's funny, thoughtfull, warm hearted, and the puzzles are well done. How more adventure games should be made.",
            "review_score": "1"
        },
        {
            "review_text": "A heartwarming adventure filled with charm and wit that will leave you smiling and may even generate a few laughs.  It is a much lighter form of fantasy than what we are used to as an audience these days, filled with a lightheartedness that sets the player at ease despite the somtimes dire events transpiring in the story. Filled with multiple paths to success, the game draws replay value from the people you help. How you choose to go about your quests and aiding in their lives will casue them to have different reactions to your progression through the game. Their favor waxing and waning based on how you choose to approach a problem.  When combined with a simple yet effective soundtrack and memorable voice acting the game comes together wonderfully and makes for great relaxing fun. It's art style at once feels like an old style animated adventure movie and a finely polished modern game.  All in all this game is worth buying and playing whenever you have the chance to do so.",
            "review_score": "1"
        },
        {
            "review_text": "Very nostalgic, relaxing, fun and the story is great!",
            "review_score": "1"
        },
        {
            "review_text": "I just recently got into story typed games, i had been looking around for alot of time to find something that looked promising, i can't completely say that this was it when i first looked at it, but when i played it, OOOOH BOY! i was intrigued, i absolutely loved it, would recommend it to ANYBODY. 6/5",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing Kings Quest Games for over 30 years now. I like the story line but I have to agree the game was much too short in Chapter 2. I remember paying 50 bucks for a full game at the store along time ago. What people dont know if they didnt grow up on Kings Quest is that you have to do the right things in the right sequence. If something doesnt work go back and try something else. Think outside the box. I really like them bringing in characters and jokes from movies from my Era. Manny resembles the guy with the lisp in the princess bride movie. Amyra resembles the female companion of Harrison Ford in Raiders of the lost ark. My fav is when the guards are talking about the new addendum 867530-lol 9 just like the song in the beginning of Chapter 2. It was enjoyable but make a bang out Chapter 3 please.  Something you didnt know but back when there were floppy disks my brother changed all the responses in the game and he added a few fancy words and responses of his own. Think that was KQ3 Romancing the Stone.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the classic old school Sierra games this is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely gorgeous - like a playable Disney movie.  I love the characters and the environment. I caught myself a few times getting entranced by the effects of water.   If you watch someone on YouTube (it was Steam Train for me) play this and enjoyed it - trust me, you're going to love playing it more.",
            "review_score": "1"
        },
        {
            "review_text": "Great series so far even though I never played the originals. Akin to Monkey Island, Grim Fandango and Toonstruck. Relatively short but satisfying and seems to have some replay value (although I have not yet).",
            "review_score": "1"
        },
        {
            "review_text": "So far I have only played Chapter 1. I am still deciding if I want to get Chapter 2 or not. Although I found this game to be somewhat fun, it was also very predictable and easy. After playing it, I now believe the target audience was children? I have only played Kings Quest VI: Heir Today, Gone Tomorrow (back on windows 95 I think...?) and it was much more challenging, more of a teen/adult game. Also Gwens voice is like nails on a chalk board...another reason I may not purchase the next chapter.   The backgrounds are very nice, but I sometimes don't care for the camera angles, especially when you are running away from things, the camera has trouble keeping up and you can't see where you are going.   Overall I like this game for its thoughtless / casual playabality -- ie, when I get home from work and am so drained I want to play something relaxing that takes very little effort. Would recommend for children.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. I feel nice like playing a good old adventure game in 90s.",
            "review_score": "1"
        },
        {
            "review_text": "amazing storyline, i love the graphics its just the save files that they f****d up, but really f****d up. Worth buying, 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "chapter 1: 9/10 chapter 2: 6/10 chapter 3: 8/10  recommended, but probably should just skip chapter 2",
            "review_score": "1"
        },
        {
            "review_text": "Great game, you can play with the wife and family and not get in trouble for hogging the TV",
            "review_score": "1"
        },
        {
            "review_text": "This game has good story telling for an epic adventure in Daventry. The game is funny and quite lovely. If like me you've enjoyed the old King Quest games back in the days, you're gonna like this one. If you do not know the old ones, you just need to know that this is a very good adventure game with puzzles in a charming world.",
            "review_score": "1"
        },
        {
            "review_text": "I bought these games last week before I even knew that an epilogue was going to be released in the complete collection only. I didn't see a difference between the season pass and the complete collection so I got the season pass. Now that the epilogue came out and you can only get it with the complete collection I am really bummed!! So now I would have to buy the whole collection too even though I paid for the season pass??   Aside from that, I really enjoyed playing the games with my kids. I grew up in the 80's with the originals and had a blast reliving and sharing that part of my childhood with my 5 children.  I REALLY REALLY hope they make the epilogue avalible for purchase separately or for the season pass... I can't justify re-purchasing ALL the chapters for just one.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most interesting and fun plots",
            "review_score": "1"
        },
        {
            "review_text": "Just finished playing Chapter 1. Very nice puzzles and a good length. Could have been better if there is a skip option for dialogs and cut scenes.",
            "review_score": "1"
        },
        {
            "review_text": "I love the puzzles and graphics for this game and the puns I find enjoyable as well. The only thing I do not like is the Quick time events. I was unable to complete chapter 3 because of the quick time event in that chapter. If the developers can work on the controls for the quicktime events it would be appreciated.",
            "review_score": "1"
        },
        {
            "review_text": "Retains the charms of the original games. This is what we should of got instead of King's Quest VIII!",
            "review_score": "1"
        },
        {
            "review_text": "If you like story driven games Kings Quest is a must.  Its a compelling story where your desissions matters and change the story later in the game, good puzzles, loveable charaters.   The voiceover by Christoffer Lloyd and the rest of the cast is really good.   You dont like pon-jokes? - you will when your done :)  Its a great game!! what i wish for chrismas - Kings Quest 2 if it's pon-sible :D",
            "review_score": "1"
        },
        {
            "review_text": "If you take a look at my time played, you'll definitely see I've played this a lot. I may or may not adore it with all my heart, haha.   It got me into the original KQ games when I was initially far too disconnected from the series to properly go through it. This game helped me gain a want to know about the characters enough to go through them all.   Though, don't get me wrong -- this game definitely has some issues. The issues don't ruin my enjoyment of the game, though I'm definitely disappointed with how chapter 2 came out after seeing the things left out of it on the wikia.  - Chapter 1 - 4/5 ; I've played this chapter so many times that it's physically painful, but in the best way possible. It's only a 4 because of the lack of skips for cut scenes and talking. The music is beautiful, as is the art, and the characters are so amazing. I love them all, my dude.  Chapter 2 - 2/5 ; Not a fan of escapist sort of gameplay, not gonna lie. And like I said before, a lot of things were left out of this chapter, which makes me long for what more it could've been. Still, it's nice seeing Graham dealing with very real feelings of doubt and anxiety.  Chapter 3 - 5/5 ; GIRL IN THE TOWEEEEEEEEEERRRR -- okay, sorry. This chapter is pretty amazing. I adore it. The new characters introduced are both so charming and lovable. The music, by far, is my favorite part of the chapter, though. I want the soundtrack for it real bad.  Chapter 4 - 4/5 ; This one is pretty nice. More characters are introduced, and there are a lot of puzzles. Not a HUGE fan of the fact that it was mainly just puzzles, but the story of the inbetween bits are still real good. I loved those bits.  Chapter 5 - 3/5 ; Unfortunately, this one didn't make a huge amount of sense to me. Some parts were fairly nonsensical, mirroring something that happens at the beginning of Chapter 3 that didn't make sense either. However, this chapter was the chapter to make me cry during my first playthrough of it. So, that's a plus.  Epilogue - 4/5 ; I WISH IT HAD BEEN LONGER. I was an idiot and spent too much time on this, ngl. But ultimately, it was pretty good.   So, overall, I'd definitely give it a 4/5. Would buy again. Have bought it like 6 times. \\ o vo/",
            "review_score": "1"
        },
        {
            "review_text": "I was fearing the worst remembering the old classics, but apart from the budget 3d, which I do not like, the games revive the magic of the old Sierra titles.",
            "review_score": "1"
        }
    ]
}