{
    "app_id": 345350,
    "name": "LIGHTNING RETURNS™: FINAL FANTASY® XIII",
    "release_date": "2015-12-10",
    "developer": [
        "Square Enix"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "JRPG",
        "Female Protagonist"
    ],
    "achievements": 42,
    "positive_ratings": 2135,
    "negative_ratings": 527,
    "price": 12.99,
    "description": "Lightning Returns is the concluding chapter of the Final Fantasy XIII saga and series heroine Lightning's final battle. The grand finale of the trilogy brings a world reborn as well as free character customization and stunning action based battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/345350/header.jpg?t=1547742062",
    "minimum_requirements": "OS: Windows® XP SP2 or later Processor: 2GHz Dual Core CPU Memory: 1500 MB RAM Graphics: NVIDIA® Geforce® 8800GT / ATI Radeon™ HD 4770 VRAM 512MB or later DirectX: Version 9.0c Storage: 22 GB available space Sound Card: Sound card compatible with DirectX® 9.0c Additional Notes:",
    "recommended_requirements": "OS: Windows® Vista/ 7/ 8 Processor: Intel® Core™ 2 Quad (2.66 GHz)/ AMD Phenom™ II X4 (2.8 GHz) processor Memory: 2 GB RAM Graphics: NVIDIA® Geforce® GTX™ 460/ ATI Radeon™ HD 5770 DirectX: Version 9.0c Storage: 22 GB available space Sound Card: Sound card compatible with DirectX® 9.0c Additional Notes: *Maximum supported frame rate: 60fps*Graphic Options*A game controller using Xinput is recomended for this game. (If using a DirectInput based controller, please use the driver side key configuration to adjust settings as required )",
    "reviews": [
        {
            "review_text": "It is clear that the extra time they put into the pc port of this game was worth it.  The graphics settings are much greater than the two prior iterations, however at least in the first hour of gameplay, there have not been any bugs or glitches. The game runs at a consistant 60 fps on maxed out 1080p settings on my GTX 970.  So far, it seems that holding off and waiting for the pc release of this game was certainly worth it!",
            "review_score": "1"
        },
        {
            "review_text": "As a PC Port, this is definitely the best of the lot. PC players will remember the multitude of crashes that pestered XIII and XIII-2. I played this game on the PS3 and loved it, clocking over 200 hours on it.  All core gameplay remains the same, and Square Enix has rather generously given access to all DLC except the Aerith set. You're really not losing out on anything special. Outerworld has been disabled on the Steam port, making it potentially more difficult for PC players as they can't get Turbo Ethers and Ethers off random NPCs. As mentioned before, DLC does make up for this by providing fairly overpowered equipment. If you want to experience the game with some challenge, try not to use Yuna's Summoner Garb and Cloud's Soldier 1st Class.  I hate the fact that you can't truly customize your key assignments. This port forces you to bind keys to the PS3/Xbox configuration, such that Jump/O/A. Full customization of FFXIII and XIII-2 was possible. Why not here? This is arguably more important for LR, where button preses are even more important than past games. If you don't have a Numpad, you're going to find it difficult to find space to bind keys into a comfortable configuration.  First, some background. Lightning has awoken from crystal stasis 500 years after Chaos flooded the world. When Chaos flooded the world, it had the side effect of stopping humans from aging. Humans did not age, and thus no longer died of old age. They could, however, still be killed by monsters, or die of disease. Lightning was awoken by God, Bhunivelze, to be the saviour. Her duty is to save souls from the remnants of the world so that they can be reborn in the new world that Bhunivelze is creating. Lightning has 13 Days to fulfill her duty before the world ends.   Now let's address the content. Lightning Returns is completely unchanged from the PS3/Xbox version. So let's look at some of the graphics: The NPCs don't look great, the dogs look horrendous. However, the environments bring across each individual theme well. Lightning, however, is of course well animated, although there's some visible tearing in her hair when Lightning touches the crest on her chest where her L'cie mark used to be.  Story: One of the main issues with this particular installment of Lightning Returns is the terrible English translation which ends up contradicting itself. The English localisation does not differentiate between 'Heart' (Kokoro) and 'Soul' (Tamashi). This is a key point of contention within the mythos, and has to be cleared up. As a result, I highly recommend having audio in Japanese and reading the English subtitles. However, always keep an ear out for the above two Japanese terms, 'Kokoro' and 'Tamashi', as the English translation makes no distinction between the two.   Characters: One of the most obvious problems since XIII has been the bland, one dimensional characters. While we may be tempted to continue the bashing, there actually is justification for a one-dimensional character this time around. Imagine if you've lived for 500 years with no true end in sight. No new lives are being born, and death is common. Nothing changes. You'd be depressed too. Each character has their own motivations, but they all end up the same. 'I'm in despair, Lightning, save me whether I like it or not.' It is bland, and this time, understandably so.   Gameplay: I'm going to be breaking the gameplay down into 3 parts, Adventure, Time Limit, and Combat.  Adventure: Lightning Returns gives you four fairly large regions to explore. In each region, you'll need to clear a Main Quest, and do a fetch quest for the 5th Main Quest. The rest of the Side Quests are fairly simple fetch quests, which tends to be boring more often than not. The mythos is well fleshed out, however, and you'll finally understand what the hell is going on when you clear Main Quest 4. But as with non-linear stories, depending on the order in which you choose to clear the Main Quests, you may find yourself confused at one point because you may not have the context of XIII or XIII-2 to back up your knowledge.  Monsters are in limited quantity, as befitting a game where the world is ending. Large scale enemies like Zaltys and Zomok have a population of 30, meaning there are only 30 of them in the game. Monsters do NOT give experience upon defeating them. Instead, stats are given as quest rewards. Basically, the more souls you save, the stronger Lightning becomes.   Time Limit: Take it from a player who has over 200 hours into the PS3 version of this, there's more than enough time to do everything. The clock DOES dictate some actions. Some NPCs require you to report to them at a certain time of the day to advance a quest, and some quests are time-sensitive, meaning if you don't fulfill the requirement about visiting them the 'next' day, you fail the quest. You are going to have to keep track of things, so it is recommended to clear Side Quests city by city. As the days pass, monsters also get stronger and drop better abilities. Thus, please don't hunt them to extinction within the first few days. Take your time.  You start with 7 days, and you extend time as you complete the five main quests to a maximum of 12 days before the Final Day arrives. If you complete enough side quests, you unlock a bonus dungeon and a bonus day for a grand total of 14 days.   Personally, I like the time limit. XIII and XIII-2 had themes about time. The party of six in XIII were counting down the days till they turned into C'ieth. Serah was counting down time as well. Lightning Returns makes it literal, forcing it into your face, 'TIME IS PRECIOUS', and you only have THIRTEEN DAYS to save the world.   Combat: This is where Lightning Returns shines. Unlike XIII and XIII-2, where Auto-Battle was your main option, Lightning Returns has a very immersive combat system, and is extremely customizable. Think of Lightning Returns as more of an Action JRPG than the traditional turn based JRPG. The Stagger system makes a return, although it's not as necessary as it was before in XIII and XIII-2 for normal encounters. Do note that for Boss encounters, you are expected to know how to Stagger the enemy, so build up your knowledge on normal encounters, and check the Bestiary regularly.   You control Lightning; ;her equipment, every movement, every Guard, every attack. Both your strategy in setting up Lightning's loadout and your execution of your strategy is extremely important, and this is what makes combat in Lightning Returns so satisfying when you are successful. However, inversely, every failed fight is also the fault of the player. Not Guarding, or not reading the Bestiary to find out stagger conditions is a recipe for failure. There is good news, though. Tons of players before you have beaten this game, so if you need an active demonstration, Youtube is an excellent teacher. Unlike old Final Fantasy games, stat grinding doesn't win fights. Execution of your strategy does. Keep that in mind.  Summary: While the characters are justifiably one dimensional, the story itself is actually fairly decent as the mythos of this series of worlds is finally explained in greater detail. This is, however, let down by a bad English translation (I'm running on the assumption that most people speak English here...), which makes the story seem self-contradictory. As mentioned above, it is recommended to play with Japanese audio and whatever language you prefer.   The combat system shines. I would really love to see a combat system similar to this in the future, but with hopefully more customization of Locked Abilities. However, for new players, the learning curve might be fairly steep especially if you run into an encounter you're not prepared for. All I can say is, keep at it.   While I do recommend this, I can't give this game a really high score because of the HUGE GLARING FLAW in translation, which is integral to storytelling. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first review for a game I have been waiting for over half a year. TLDR at the end.  Good things overall:  - It's a good game. - It's not perfect, but it's a good port. - Good price. - Good cards. - Achievements are not hard (+100 hours if you want all of them) - Most DLCs included.  Good ingame mechanics:  - Lightning. - NG+ system like in Dark Souls II - Tons of items and garbs to get. - Tons of quests to do. - Tons of monsters to exterminate. - You can switch schemata mid attacks and do A LOT of combos, which makes the game more than just atackattackattack, switch and repeat. - The days system is not bad, it's just that most FF games are endless. This one is just different. - You only grind gil, you won't need to slay specific monsters for most missions as you will get the items eventually. - Missions are only hard if you don't explore (on a sandbox game, duh) - Game encourages you to go to NG+ to get upgrades and other items.  Not so good ingame mechanics:  - Game is only hard (but enjoyable) during NG on normal mode. It will be REALLY easy on NG+ even if you play on hard mode. - Enemies don't scale on each playthrough, while you do, The game becomes easier and easier the more you play. I'm on NG+ on hard and only final bosses and last ones are challenging... sometimes. - Some garbs are better versions of other existing ones, and others are niche and would require a complete garb setup to work. - Aeronite is a ♥♥♥♥♥. - Ereshkigal is a ♥♥♥♥♥. - Most weapons and shields are just enhaced versions of previous ones.  Note: Game tends to crash sometimes in the Dead Dunes laberynths for some reason.  TL;DR: Tons of stuff to do, good replayability potential, but it eventually becomes too easy because monsters don't scale and it starts to get boring. Lightning is love.  I'm seriously waiting for a mod to make enemies scale on each playthrough, it's the only thing keeping me away from wasting 1k hours in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry about my English Skill...  I buy controller for this game. It's so amazing to play. I think, System this game is better more than Final Fantasy 13 and 13-2. If You want to play This game I recommend you must buy a Gamepad",
            "review_score": "1"
        },
        {
            "review_text": "Lightning Returns is diffrent from other Final Fantasy games. Why? Because you are limited to one character, you don't have a party and you don't have time! But is this bad?  PROS: -Dynamic Day/Night Cycle -Many Weapons and Customs -Many Quests -Good-looking graphics -Choicebased Story Progess -Openworld -Good voiceacting -Movielike Cutscense -Chocobos  CONTRAS; -No party -Sometimes you need to hurry up -Complex story (if you haven't played XIII or XIII-2)",
            "review_score": "1"
        },
        {
            "review_text": "I love none linear rpgs  I love when rpgs discorage grinding  And i love customisation options  Honestly, it feels almost sacrelige to say, but its honestly one of my fave ff games :)",
            "review_score": "1"
        },
        {
            "review_text": "Thanks SE for offline mode and resolution patch up to 4K. ",
            "review_score": "1"
        },
        {
            "review_text": "I got a refund Always on-line DRM The game does say it just needs steam cloud enabled but it will not launch in offline mode of steam at all thus requireing online at all times.  Also, I couldnt play the game as I had graphical errors that made it literally unplayable and unable to see what was going on. The cutsences played fine for only 50% of the screen and in game looked like a strobe of horizontal bars with the UI and subtitle overlays working fine. Even the pause screen worked fine with no issues.  So with not being able to ever play this offline combined with spending an hour trying to fix the graphical issues i just got a refund instead. If i can run the latest DMC game i should be able to run this.  EDIT: Not changing my review because they fixed some stuff later on, once a review is posted your done son.... That being said apparently they fixed the AMD 4800 graphical issue and 'supposedly' removed online only DRM so it can start in offline mode. But this should of not been an issue in the first place so review stands.",
            "review_score": "-1"
        },
        {
            "review_text": "Lightning, Chocobos, and cosplay ... the game is great story and gameplay are good minor bugs fixed  plug and play and have fun",
            "review_score": "1"
        },
        {
            "review_text": "I have never played a Final fantasy game before and to be honest im the guy who dosnt like this kind of games.  But this game is actually good, i really like it. Its very easy to get into and its simple to understand.  The story is maybe not the best but its ok, the graphics are great and the game runs very good (even on my laptop)  Im playing this with my Xbox one controller and it works great, I really recommend playing this with a controller :) since its pretty frustrating to play with keyboard and mouse.  The combat system is also good and easy to get into, easy to learn and fun. Its not as great as 'the batman fighting system' but its not far away.  Like i said I have never played a Final Fantasy game before but this game got me intrested for more. So i will probably pick some more FF game up.  I give this game a 7 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Liked FFXIII. Helped to understand the importance to manage the time and powers while challenging the quests. Very nice cg. Beautiful music. Hope for pc version of new FFXV.",
            "review_score": "1"
        },
        {
            "review_text": "It's dead rising with jrpg battles where you control one character who switches among 3 forms with the aid of different outfits. Fashion is the best part of Dark Souls and the huge variety of outfits and the customization options for them are a strong selling point. Not just asthetically, but you can min-max the library of stats, attacks, and equipment to suit your playstyle.    There's several gigantic maps littered with sidequests as well as the excellent overarching main story quests to keep you entertained. Don't fret over finding every little sidequest, once you do the important missions just skip to the last day.   I'm still not sure why the game had to take place centuries in the future if everyone looks the same. How about having the game take place a single year in the future? Scant half-baked plot elements aside, this game is worth your time and deserves better than to be associated with the grindy ♥♥♥♥mess that was the first in this trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10 Not enough Lightning",
            "review_score": "1"
        },
        {
            "review_text": "I was really hoping this game would make up for the disappointment I experienced with XIII-2. There's not a lot Square could have done to rectify the ridiculous convoluted story (90hrs into the trilogy, and I'm still not confident I could explain it to someone if I had to), but I think they have done the best they could to make it reasonably motivating. Games of this length have to be motivating to keep the player interested, and that's where XIII-2 fell down, and where Lightning Returns ultimately picks it back up. Part of this is due to the fact that the game is completely open-world, more so than any other FF game I've played (possibly due to the complaints the previous two XIII games got for being 'corridor simulators'). Literally all of the explorable world is accessable right from the word go, but you quickly realise that there is a logical order to the locations you should visit. The combat system is reminiscent of XIII, but rather than customising paradigms across the party, Lightning herself is able to switch roles on the fly and perform different actions. There is seemingly endless customisation options for these roles using the vast array of outfits which can be purchased from stores, found in containers or won from battles. The game looks fantastic at higher resolutions, in fact much better than I was expecting from what is essentially a port of a PS3 game. SE clearly put some effort into making great visual improvements, and it's just a shame the same effort wasn't put in to optimisation. At launch, this game ran pretty terribly. After a number of patches, the game runs acceptably, but was still prone to pretty serious dips in framerate for seemingly no reason. In conclusion, if, like me, you enjoyed the previous XIII games but were slightly put off by one thing or another, then I'd definitely suggest picking up Lightning Returns, as it makes an effort to correct most of the complaints the previous two games suffered, and it does it very well. It's probably not worth picking up if you havn't played at least the first XIII game, as it may not make a lot of sense - not that it does even if you have played it!",
            "review_score": "1"
        },
        {
            "review_text": "Greate GAME Greate Story i like this gameplay... i like the combat control... Play your own style... challenging...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Eternal battle of Fashion VS Effectiveness Continues.",
            "review_score": "1"
        },
        {
            "review_text": "  This is going to be a block of text of me trying to go as in-depth as possible into FXIII Lightning Returns",
            "review_score": "1"
        },
        {
            "review_text": "WOW I can run this on my toaster. Much better port than XII-2 if I can run it so can You(!)  Lightning Returns:   - Lightning returns (duh) - ATB System is still good - One party member most of the time ( Cant control the companions anyways) - The Angel of Valhalla likes you  - The boss battles are fun  - Music is nice - You can change Lightning's garbs ( Some of you guys make her wear the cat costume. Perverts! )",
            "review_score": "1"
        },
        {
            "review_text": "Square Enix finally fixed the FPS problem that XIII and XIII-2 had on PC version. The game runs well and i enjoyed it very much.   P.S : Lightning becoming sexier ;)",
            "review_score": "1"
        },
        {
            "review_text": "Yeeeeyy can play offline now!!! Thanks Square E",
            "review_score": "1"
        },
        {
            "review_text": "just your ol'classic Square Enix story FF Series With Hack&amp;Slash battle system    the only thing make me sad  The 'FFVII Aerith' schemata is not included in this pack. Furthermore, there are no plans to make this schemata available in future.",
            "review_score": "1"
        },
        {
            "review_text": "And finally here it is , Lightning Returns : Final Fantasy XIII Well to be honest , the graphic options are a bit limited , but its good enough Frame rate has improved , and the port is fantastic  The included DLC is enjoyable but , it'll make everything much easier (Comsocrator is pretty much 'powerful' and at the same time extrextremely wesk due to low HP , but its fantastic )  So to put it in a nutshell , Square has done a great job  I recommend Lightning Returns : FF13 for everyone , you'll enjoy it Looking forward to VII Remake &amp; XV",
            "review_score": "1"
        },
        {
            "review_text": "The game's introduction sequence does a very good job of grasping your attention and getting you to ask questions..   Unfortunately, all that awaits is endless MMO inspired fetch-quests, sub-plots that you really couldn't care less about and Time Restrictions that frustratingly get in the way of the plot and characters you actually want to see.  Gameplay is better or worse depending on how you look at it.. combat is smooth, customization is at an all time high but a cast of likeable party members has been removed entirely. It's only Lightning and her amazing cosplay talent so no more group combos like before.   The entire game is governed by a Game Over timer. The timer itself is not an issue, you gain additional time very easily by doing quests. The issue is all of the restrictions that come with it. Numerous zones of the game are locked off at specific times so if you have a quest there then tough luck. You have to report back to HQ everyday at 6AM. Some quests are vague as hell so unless you Youtube it then you will waste valuable time searching every corner. Honestly a lot of the time the game feels like a job and you have to organize each day like you are putting together a college schedule.. it really got under my skin.  I've tried to like the 13 series, I really have. The sad truth is that only original 13 game deserves its Final Fantasy title though even that was one of the weaker entries in the series. 13-2 and Lighting Returns feel like completely different games and do very little to actually improve upon the original with all the potential they had. Can we ever get a real sequel to a FF game that isn't an experiment designed to cater to a different demographic?   Really all they had to do was throw the original cast into a new adventure where they all had to band together to save the day.. but 13-2 gave us some time paradox non-sense with Serah who nobody cared about and newcomer Noel then Lightning Returns finally gives us Lightning but no supporting party members to tag along and threw in more fetch quests than WoW with a timer emphasis.-  If you read until the end then just buy FFX HD, FF4, FF6, FF7, FF9 or even 13.",
            "review_score": "-1"
        },
        {
            "review_text": "An RPG who's main mechanic is time limits.  If you are a casual gamer/rpg'er/Final Fantasy player stay away. This game is a load of stess.  You have 14 in game days till the game ends. For every minute real time 'x' minutes pass in the game. This time does not stop for menues, dialog, nor battles. Missions are only avalible in a set time window inside those '14 days' and have requirments in them like 'find these 6 things and be at point Z at 7am sharp' STRESS STRESS STRESS  You don't gain exp or levels from battles but from competing quests (saving souls) you do get gil (money) and items though, but overall battles are somethign to avoid. So, again, stress.  There is a mechanic to 'pause time', for a time, but it's a finite resource in the game, only obtainable via completing more quests. In which you may be missing, or find yourself needing to use this finite resource to complete!  I am curious who the desginers thought they where making this game for as so many central game mechincs run completly counter to so many who enjoy RPGs and past Final Fantasies.  The central time mechianic is by far my biggest reason to cautioning people from buying this game. But there are plenty of other cons.    Dialog seems bad even by FF standards, graphics are quite poor, yes, certain things look pretty, but it seems like another step in what I feel like has been FF's direction of making certain things look good for screen shots, but everything else look terrible. Such a large studio on such a large franchise should have everything looking much better then this. So many just... boxs. They may be skinned like other things, but they are a straight up polygon box. Nothing is even bumb mapped. It's... really mind blowing for a game made past the ps2 era.  Buggy. If my controler turns off because I walked away for a while it reverts to keybaord/mouse controls and won't change back until you restart the game.  Lazy port. Menus literally tell you not to turn off your PLAYSTATION 3 when saving. uhg. Mouse curse floats over screen.  Spent an hour just getting the setting set the way I wanted because not only do you have to relaunch the game for most of them, the 'main' setting page doesn't seem to affect existing saves. Nope, have to load the save then open the menu and change those same settings there instead.  Honestly, I have grown so disappointed in the franchise over the years. I keep trying to like it again, maybe 'that one' just wasn't for me, trying to dawn some rose colored glasses of nostalgia for the franchise in which to grade it on a curve... but they dont' take. Square failed on this. This is a bad game.  I would have used Valve's refund policy for the first time ever on this, but unfortunatly between the time I spent getting the settings right, walking laps in frustration, and getting far enough in to the game to get a reasonable feeling for what the game will ACTUALLY be like (which I probabaly didn't even get there, always takes a while in any Final Fantasy game) I had rung up 3 hours 'play time', one hour past the max allowed for a refund.  Just skip this ones guys, Square really doesn't deserve the money. I'd go as far to say they should be ashamed, nothing contained within is deserving of the FF name. Nor a good review if it had been called something else and held at the standards any other game is.",
            "review_score": "-1"
        },
        {
            "review_text": "I just chopped off half my review because the DRM is gone. I fully recommend this game to any jRPG fan.     The combat system is more flexible than the previous two iterations. It follows the 'scheme' design, but you ONLY play as Lightning in this version. She gets three 'schema', which are builds with their own set of ability points that you can switch between on the fly. You get to choose an outfit and equips for each scheme, and get access to four abilities for each one as well, essentially giving you a rock/paper/scissors style fighting system. The combat is pretty engaging. It's more active than the previous two iterations, and less like any other Final Fantasy because of this. Unfortunately, Lightning doesn't gain experience in this game...combat is optional, minus scripted fights, and only worth doing for items for quests. Which bites, because the combat is truly that enjoyable that I still find myself going out of the way to do. The scripted fights are all fairly unique and dynamic. The bosses are all interesting to go against and it is fun to figure out their weaknesses and defeat them in battle. Quests are how LIghtning increases her stats. Every time she completes a quest, she saves a soul and becomes stronger. This game is essentially 'Errands and Dress-Up Simulator'. But, it is a nice little wrap up to the trilogy, and provides closure to that cliffhanger ending that is FFXIII-2.",
            "review_score": "1"
        },
        {
            "review_text": "i play the game on easy, i can kill all bosses in the 1st try. i dont know how difficult normal is, but i think it would need a few tries for every boss.if you, like me, dont like difficult games, i recomment to play it on easy first.  i dislike the time-system but mehh, well it doesent influence the game much. also i have controll issues with my logitech controller, even with x360ce it does not work perfectly. for me ff13-2 was the best part and ff 13 the worst. this here is somewhere in between.",
            "review_score": "1"
        },
        {
            "review_text": "Blends the best of 13 and 13-2 (as much as I didn't really care for 13-2).  One of the best games I've played in a very, very long time.  Also, 60fps. Finally a good port.",
            "review_score": "1"
        },
        {
            "review_text": "I only paid 10 dollars for this game and still feel ripped off. I know now that I'm not going to finish it, and I tried to convince myself that my first impressions were wrong and that the game is anything above terrible, but I just couldn't lie to myself any longer.  The plot is focused around your strong female avatar traveling the world and gathering worthy souls before the end of times. If this sounds like a plot you want to play out, I suggest getting yourself a copy of Valkyrie Profile. It's the same thing, just done a lot better many years before FF13 came out.  tl;dr - Buyer's Remorse",
            "review_score": "-1"
        },
        {
            "review_text": "Lightning Returns is perhaps my favorite of the XIII trilogy.   Pros:  +Lightning is Back +Dynamic battle system +Decent story surrounding Lightning's new path +Love all scenes with Lumina in it +Time limit gives quest urgency +Able to get 1080p 60fps on GTX 750 Ti +Graphics are improvement over PS3/Xbox 360 +Great soundtrack from Square as usual +Comes with most DLC minus Aerith's costume +Square Enix reversed their online drm from feedback  Cons:  -Hope Estheim is annoying as hell -Most customization can't be unlocked till NG+  Final Verdict: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "- runs like ♥♥♥♥ - garbage combat system - lots of grinding - horrible side quests  - generic npcs + nice looking main character with lots of costumes and gear = this is literally a generic mmo without online mode. Add constant time pressure and lock quest progression behind time zones and you get a very poorly designed game.",
            "review_score": "-1"
        },
        {
            "review_text": "For once, the port isn't trash. This game runs better at 1080p 60FPS than FFXIII at 720p 30fps. This should be the standards for SE ports from this point forward.",
            "review_score": "1"
        },
        {
            "review_text": "Time limit -   Just to get it out the way since its a none issue with traction for some reason..... After a day of grinding and exploring I can say the time limit everyone is so scared of means little to nothing against the gameplay; if anything it just serves as a catalyst to make gamers fight more often (which you have to do anyway) to collect something called EP that lets you stop the clock for a set amount of time. I'm still in the first day and I've completed 5 side missions, 4 parts of 2 different main missions, and have collected much. If the time limit scares you, don't let it  Review -   I'll make it quick, there are no bugs in my play through so far and the graphics look amazing. The FPS can be locked or stuck on Dynamic and the graphic options are all present. The graphic options are basic however with only Normal or Advanced to choose from and the screen size stops at 1920 x 1080. I love the cut scenes, action, and combat as its different but a take on a few things other titles had; if I had to explain it I would say a mix of FFXII and FFX-2 as you can move freely during combat and switch what you do by switching outfits during combat and there are a lot of outfits to choose from. This title ends the story and the gameplay gives a sense of urgency and grandeur you don't see often, I believe this game to deliver in both presentation and execution.  ",
            "review_score": "1"
        },
        {
            "review_text": "I always knew, deep down inside, that Lightning would look great with glasses.",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Good port, fun gameplay, neat story.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not the best in FF series, true. But it is not as bad as your friends or critics say. Good graphic (although the structures have low res textures), good music, new mechanic, okay story, and superb lightning as returning female protagonist. If you are a FF fan, this is a game you shouldn't miss. 7/10 total score.",
            "review_score": "1"
        },
        {
            "review_text": "Personally Final Fantasy 13,13-2 and 13-3 (A.K.A Lightning Returns) are my favourite final fantasy series.",
            "review_score": "1"
        },
        {
            "review_text": "I throughly enjoyed this game. I had played it on the PS3 and was close to finishing it but never got the chance. I am glad I waited though, the additional graphics options for the PC were very welcome and the game looked and performed beautifully. I have a 4K monitor, and a high end setup, GeForce 970 etc... But really people, how many games actually perform well at 4K even with high end hardware such as that? The answer is not that many, most new release games I still play in 1080p so I will not complain about the capped resolution. This port ran buttery smooth at 1080p which is more than I had whilst playing on the PS3 anyhow.   I have been playing Final Fantasy games since Final Fantasy 3 on the Super NES, and always loved the length and exploration factor of these games. The one thing I did not like about Lightning Returns was the always looming time limit I had to deal with on the PS3. The time limit makes it feel like something other than a Final Fantasy game and that was my only major gripe about this game. Once again I am glad I waited to play it on the PC, as I was able to download a trainer for the game that allowed me to freeze time which basically removed the time limit. I was free to explore every nook and cranny of the game and thoroughly enjoyed the more Final Fantasy like experience it gave me.   Trainer or not, time limit or not, the game is still fun, and very much reccommended.",
            "review_score": "1"
        },
        {
            "review_text": "please fix the frame rate issue when loading assets in new area.",
            "review_score": "1"
        },
        {
            "review_text": "IMO, this is a great game, and a great port. I have 0 issues running on my 3 year old custom PC, with an i5 overclocked to 4.4ghz and a GTX970. Online only isn't an issue for me, my internet sucks and cuts out all the time, yet I never have gotten a message about it.  I have only gotten about, what I can imagine is, halfway through so far. The gameplay is challenging and fun. The action oriented combat is a great take on FF, and probably the most enjoyable to play since XII. I loved the gambit system in XII, and hope they bring it back one day.  Anyway, any fan of FF should try it, although changing dresses like X-2 is a little disconcerting. It is still a really fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game. A bit random but ths is my forst FF game and I just love it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Would solo God again",
            "review_score": "1"
        },
        {
            "review_text": "Ok, this is one of the best games I've ever played. Thats a pretty high honour. Here my top ten list.  1. Ratchet and Clank 2 2. Terraira 3. MGS 2 4. Lightning Returns: Final Fantasy 13 5. Megaman X 6. Dragon Quest 9 7. Super Mario 64 8. Garry's Mod 9. Sonic CD 10. Game Dev Tycoon Anyway, onto the review  This game was a HUGE step forward from Final Fantasy 13 and Final Fantasy 13-2. Final Fantasy 13 was good but it was kinda linear and it was a bit hard for my taste, the story was.....kinda good, the gameplay was a bit hard to get used too but It did fair well. Final Fantasy 13-2 was just all around confusing. What do you get when you mix Time Travel, JRPGs and a fairly good game? Did you say Chono Trigger? No? Final Fantasy 13-2 of course is the game I'm talking about. I just found the story confusing, random mumbo jumbo, Hard puzzles and lots of other stuff got on my nerves, BUT LRFF13 was better than BOTH of them combined.   Why? Well, the gameplay is just perfect. Non Linear areas and story, Graphics was amazing, Music, New and Old was perfect, The bosses were Not to hard, if you had the right magic and equipment and the PC version had DLC in it. It surely helped alot. The leveling system? What leveling system? You get items and stats from quests. Its just amazing. TRY IT NOW! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is good but there are potions and comusable items",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good I rate it 10/10 would love to to play more if there was more content",
            "review_score": "1"
        },
        {
            "review_text": "Lightning-sama is life 13/10",
            "review_score": "1"
        },
        {
            "review_text": "Now waiting for FFXV !",
            "review_score": "1"
        },
        {
            "review_text": "Well, they tried. 'Do not turn off PS3 system while this icon is displayed' Apparently we are running a PS3 emulator. They have improved a bit, giving very basic graphics options for PC. The controls are for keyboard/mouse, even with Xbox controller plugged in and working. I can't for the life of me find the pre-emptive strike button on the controller. It has 2 types of control setups. That sucks. 1080p is max resolution. That sucks as well. I'm assuming you came here to know about the port. Well, 7/10 mediocre port, as expected. BUT MUCH BETTER than the previous two, it appears they are trying. The game itself? Love the FF13 trilogy, so great game here. The game is great, the port is not. That said, nothing major to complain about here, so for fans of FF you can muddle through it to experience a great game. Port/gameplay 7/10, game itself 9/10.  EDIT: Seems to have an always online requirement for Steamworks. The game will not launch/play in offline mode.   EDIT #2: Some people are getting massive framedrops in busier parts of cities, on a range of moderate to highend systems for both AMD and Nvidia. I however have had no issues, with a constant 60 fps.",
            "review_score": "1"
        },
        {
            "review_text": "OMG!!! The starting Storyline is already so nice... and the graphic O^O Lightning ~ :3",
            "review_score": "1"
        },
        {
            "review_text": "Actually a nice game on par with Final Fantasy XIII. It's not the best Final Fantasy or RPG game out there but it's good enough to keep you entertained for a while.  The port is well made with a couple flags here and there.",
            "review_score": "1"
        },
        {
            "review_text": "Porting -60fps stable even on the battle. -Must online steam to launch the game, you can disconnect at the middle game, (i tried this), i've got 4 achievements on offline mode, then save the game when go online, every achievement that i got still updated when go online  (it might be wait several minutes when i play online). -Default keyboard control is very dificult! it's full keyboard control without mouse. Feels like playin PS3 emulator. LOL -Did't crash yet in 9 hours playtime.  Gameplay -Unique Battle System, it's called Style-Change Active Time Battle (SATB). Very cool! -There no lvl grinding from battle, Lightning's stats are increased by completing story events and side quests.   Artwork -Very nice texturing on main character 'Lightning' but poor texturing and detail on several NPC. -Themes on the world are gothic, mechanical, and fantasy.   By spending IDR171.000 ($12.27) it's worthed for me. 11/10  Make sure press 'F12' when u watch the cutscenes, very nice graphics tat u can archives, and i've got 100++ screenshots (on my disk)  ===== EDIT: =====  24th December 2015 Game Update",
            "review_score": "1"
        },
        {
            "review_text": "Can setting graphic/Can run on 60 fps/Can support xbox 360 controller Good Graphic/Good battle system/Good to port to pc 7/10",
            "review_score": "1"
        },
        {
            "review_text": "No mouse support when the previous XIII games had it. 10/10 port.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic port, keyboard controls usable but a little wonky for my taste. I was never a fan of Majora's Mask but the concept of a timed game is really well executed here. Couldn't care less about online only, didn't even know it was a thing until I saw everybody whining about it.   All in all, loving it so far. Feels like a really genuine cap on the series and I'm excited to play through the rest of the game, definitely a must have for fans of FFXIII. Combat is minimal which is good in a game like this, really it's about the story and I think that kind of game is undervalued.   tl;dr pros: -great port -great combat/story -all around well executed  cons: -somehow some people don't always have internet on their pc so that may be a problem cause you cant play without it -graphics leave me wanting personally but its not a deal breaker. would kill for an hd remake though ",
            "review_score": "1"
        },
        {
            "review_text": "Good PC port out of all 3 that released for PC. I was gonna post a negative review because I faced some lag issues but OBS (Open Broadcaster Software) was the culprit responsible for the frame lag.  The game runs butter smooth on my rig.  CPU: Intel i7 4790k 4.0GHz GPU: GeForce GTX 970 4GB RAM: 8GM DDR3 OS: Windows 10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game! Worth the price",
            "review_score": "1"
        },
        {
            "review_text": "This game is terrible. I don't know why I love it.",
            "review_score": "1"
        },
        {
            "review_text": "This game sums up how religions work in real life.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game if you're fan of the previous entries. I've had very little--if any--performance issues.   The initial keyboard and mouse controls aren't great; I played with a XBOX 360 controller instead. Naturally, this worked perfectly.   'Always online DRM' is stupid, but it's not enough of a reason to give this game a negative review, IMO. Hopefully, they do fix this, however.  EDIT: It seems SE has removed the 'always online DRM.' So, hurray for that!",
            "review_score": "1"
        },
        {
            "review_text": "The person that translate this game to english should be fired immediately and send back to primary school.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game if you travel and need to play in offline mode. you will be able to now! as of christmas day 2015, SE actually released a patch in response to feedback from fans (wow). ill update my other content as well. SE has enjoyed quite a thorough shaming at the hands of its fans. now its our turn to return the favour and give them encouragement.  i have changed my recommendation to recommend the game.  Here is the plot synopsis if you dont mind a spoiler:    TLDR: This game is the server reset after a long beta period basically. some people will get a beta-test bonus if lightning manages to save them. The rest were useless noobs who didn't send in feedback to the developers and won't get to carry over their beta characters.  Long: Actually.  everyone dies in the end. its one big crusade for Lightning to right wrongs until the last day. and to try and save as many souls as possible. Or to discover the ones worth saving, make them worth saving etc.  It's a bit weird in that respect. As you approach the end of the game, it becomes clearer and clearer that this is the 'final fantasy'. When the game ends, everyone and I mean EVERYONE dies. They are gone forever. Maybe to be reborn; who knows. This pantheon of gods is quite alien, they don't care much about the life they created except to gather data and see how things might occur.  and as we saw in the previous games.. even their 'demi gods' and 'lesser gods' they created were flawed and needed to be deleted too.  ",
            "review_score": "1"
        },
        {
            "review_text": "best PC port from Square Ever !",
            "review_score": "1"
        },
        {
            "review_text": "Seems like a good port so far. I'm enjoying the game quite a lot as of now... I'm still a little confused about the whole 13 days mechanic, though (but this could be due to my own ineptitude). The price seems very good for what you get from it which is a full game with a lot of DLC. I missed Final Fantasy XIII-2 (played the first one) but it doesn't feel like I am missing too much of the story to still be able to enjoy it. I would reccomend it to any fans of the Final Fantasy series!",
            "review_score": "1"
        },
        {
            "review_text": "Five centuries after XIII-2 the world is going to be destroyed in thirteen days and it's up to Lightning to get the band back together ... in heaven. While it might not be as dumb as it sounds to me, what I do know is the plot will be delivered almost exclusively through forced exposition that DOES. NOT. STOP. You will hear conversation after conversation repeating the same exposition, often several times in a row! Need a thing? Don't need a thing? Don't worry, your loyal resident Navi, Hope, will remind you every five minutes to get that thing, even if it so happens you can't get the thing, don't want to get the thing or are trying to find a different thing.  Honestly, this game has opened up a new genre for me that I dub the 'chore' game. Lightning Returns is quite literally a series of expositional cut scenes intersped with fetch quests. The chore is both literal, the never ending fetch quests, and metaphorical, as in this game is a chore to play. Yet, as awful as that sounds, every character is in on this joke: even Lightning herself contually bemoans her fate before begrudgingly accepting these countless, thankless tasks. It's not a good sign when the lead character's only motivation is to acquiesce because she has to, but tell me game, what's MY motivation. Every quest, and I mean EVERY quest will work as follows: a person will tell you something they need, get that thing and take it to them. This either completes the quest or leads you to the next person who needs something. Yay. This formula will not be deviated from.   While we could have a philosophical debate that nearly all games work this way, other games usually try to pad this out a bit with dialogue, minigames, crafting, inventory management. Something! In Lightning Returns you are either fetching an item or looking for a person to fetch for. I would have been shocked if a SINGLE character you spoke with said, 'I can help you, right this way!' Spoiler alert: that will never happen, and neither will anything else. So it's basically what it looks like, a cosplay fetch quest fantasy. I'm not really sure what Square Enix was trying to create here but while I admit it might have some charm and appeal for some, personally I found it too limited to put up with for more than my recorded play time.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent multyplayer game!  3 players control 1 charachter! = 1st using gamepad, 2nd keyboard, 3d move mouse each minute for removing screensaver.  One of the worst port of all times with huge graphics bugs.  Save your time, money, thoughts and mouse clicks for not purchasing this game.  TOTALLY NOT RECOMMENDED!",
            "review_score": "-1"
        },
        {
            "review_text": "Solid port, and an overall fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Better port than the first two of course.  How do you change the interface/subtitle language tho?",
            "review_score": "1"
        },
        {
            "review_text": "60min 1st good, no problem at all  1min 2nd i start the game again fps drop!!! WTH?!?!  i forgot i change resolution to 1600*900, so i change it back to 1920*1080 full screen fps back to normal..",
            "review_score": "1"
        },
        {
            "review_text": "A far better port than the previous two installments. They've actually given us some options this time around and its great to see that there was some effort put into it. The game has been running very smoothly at a consistent 60fps with max settings on my gtx 970 and I haven't had a single major fps drop or bug or really anything.   The only thing I've had trouble with for this title is the key mapping, for whatever reason I just couldn't get it running optimally, mainly during battles but this was easily remedied by simply using a controller instead.  Fantastic port, would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "For Graphic is sooo great...Fps got 60.. my GTX 750 Ti can handle this game,this series's look very good more than the before series XIII and XII-2 awsome gameplay... 'but' the keyboard setting's really weird in battle mode....not recommended for the keyboard stuff,better play with your gamepad... i hope SquareEnix can make the patch for keyboard setting in battle...that would be perfect",
            "review_score": "1"
        },
        {
            "review_text": "Pro: + Constant 60 fps + Lots of customizable customes to choose from  Cons: + The 13 days limit makes the game feel rush.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Finally some good news for the Final Fantasy 13 Trilogy on Steam! It's a decent port everybody!  This port doesn't use a launcher to start the game but instead just starts the game up from the get go and if you hover your mouse near the top of the window you will get a drop down consisting of a Quit and Reboot option, Graphical settings and a choice of 2 button layouts (where X and O (or A and B) get switched around). The game supports 30 FPS (Fixed mode) or 60 FPS (Dynamic mode). It also has graphics options including: Shaders, Shadows, Bloom, Lighting and others but you can only choose from two options from each; Standard (For lower end PCs) and Advanced (For higher end PCs).  I have never had a problem with the other two ports so I cannot talk from experience here but I have had no problems with this port of Lightning Returns and I have been playing it at its maximum graphic settings (that is until someone realeases graphical mods for it eventually). To be honest the only problem I have had is a very, very tiny drop in FPS for about 1-2 seconds when walking into a crowded area but it goes back to 60 FPS before you can really make a comment about it.  Overall it is a very well ported game in comparison to the other two FF13 games that have come to Steam and I am very happy with it.  And to make it even better it comes with the majority of the DLC and it only costs £11! It's a steal not to buy it!  Side Note: If you do experience problems with this port; please keep in mind that it *may* be your computer and not the game and also I am pretty sure there will eventually be solutions to issues in the community hub for this game!",
            "review_score": "1"
        },
        {
            "review_text": "The game is outright boring what the ♥♥♥♥ is this story made for..... Its boring and made me easily delete the game over 3 times because of how slow pace the story becomes. The story here is to solve people's problems from there past and make them feel better so u can grab there soul and save the world. But u only have 6 days which is a slap in the face after the time runs out. Everytime u save a soul you get 1 extra day because *God can stop time* This game is just pure Running acrossing the ♥♥♥♥♥ city for 2 hours. There this is my game play of this game in a Nutshell 90% of the time is running in the city doing nothing but helping people with there problems which dont even give u the slight idea where to go at times. 5% is cut sences which are laughablely useless at times and your just lost of whats going on. And the last 5% is just me raging at how badly they messed up this game i played ff 13 and loved it but this Garbage is more like 23 dollars worth of running shoes then a good game Thats all i have to say",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game absolutly amazing worth the wait but i have a question my video card is a 9800 gt wat would be the best settings other than that my comp meets all the requirments it would be helpfully if someone could tell me",
            "review_score": "1"
        },
        {
            "review_text": "Runs on my computer. 10/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Wow such an amazing PC port. They really did an amazing job. I recommend you have a controller and if not just take some time to re-do the keyboard schematic. The graphics are amazing and the combat is fluid. They really did an amazing job on all aspects.   I highly recommend this game to all RPG fans.   9/10 Great Job Square Enix  System Specs   Nvida GTX 970M 4GB  32 GB Ram  500GB SSD + 1TB HD  Intel(R) Core(TM) i7-6820HK CPU @ 2.70GHz Running on MSI GT72 6QD Dominator Pro   60 FPS",
            "review_score": "1"
        },
        {
            "review_text": "first of all, this game is good since i cant afford to get ps3 and so on. i cant find any problem and my fps drop also at the playable situation but, what i found in this game maybe it just a bug is having problem japan audio missing or no voice. i will will change the recommended to yes if this problem is fixed.   *i already retry download the game but still the same *the game must be in japan audio to get the feeling *hope there is a fix",
            "review_score": "-1"
        },
        {
            "review_text": "Game is nice, would give a positive review if it HAD A BLOODY MOUSE SUPPORT Terrible controls.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know why sequels to Final Fantasy are so hard (FF X-2, and FF XIII-2), but this sequel is just bizarre. You are literally going around saving peoples soul's from eternal destruction. It is a Jesus story- you play Lightning who is saving souls and you were sent by God (yes, that's his name in the game) to complete the task. I wanted to enjoy the game, but this was too eery.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun!",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE YOU!!!! LIGHTNING!!!!!   Though some defects still exist, it doesn't matter any more, I have my Lightning in my PC again, mua~  Nice job, SE",
            "review_score": "1"
        },
        {
            "review_text": "Got a refund. DLC breaks the game imo.",
            "review_score": "-1"
        },
        {
            "review_text": "this isn't final fantasy more like final quest! spend more time talking to people and doing stupid quests like finding 13 clocks in the city or talking to gaurds between a specified time.... this is dumn as hell, whoever though of this needs sacked. most boring Final Fantasy I have ever played. plus runs as crap as ff13-2 (56-60fps) apart from in battle which runs at 60fps... graphics settings make very little difference lol.",
            "review_score": "-1"
        },
        {
            "review_text": "It's crashing my video driver on a very regular basis.",
            "review_score": "-1"
        },
        {
            "review_text": "Needs proper controler support, not playing this with a keyboard.",
            "review_score": "-1"
        },
        {
            "review_text": "Online DRM for a single player game, top kek.",
            "review_score": "-1"
        },
        {
            "review_text": "Characters are speaking japanese but mouth works like spanish 420/69 P.S. i can't speak spanish",
            "review_score": "1"
        },
        {
            "review_text": "Long time FF fan here, Ive played a major catalog of FF games but this one?!?! TRASH! IDK WTF they did to it but my god is it horrible. The fighting system is straight trash.... I just hope when the new one comes out it doesnt end up like this....",
            "review_score": "-1"
        },
        {
            "review_text": "Pc controlls are absolutly awefull.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay: 3/10 Gamepad Controlls: 1/10 - Keyboard &amp; mouse Defintly better to play on. Battle System: 0/10 Graphics - 8/10 Customisation: 10/10 Story: 5/10 - If you have played the other FFXIII games  Overall Terrible, Bearly playable, This is honestly the first Final Fantasy game i have decided not to finish playing through to the end because its that bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good Final Fantasy game that is pretty open compared to the original Finally Fantasy XIII.",
            "review_score": "1"
        },
        {
            "review_text": "Better gameplay and port than other two. Really recommended for FF fan with something new battle mechanic.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome!!",
            "review_score": "1"
        },
        {
            "review_text": "Best one out of the FF13 series  - Great port as compared to the other two - 60 FPS almost throughout the game  - Maybe lacking abit in story but full of action",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good port of the original LIGHTNING RETURNS™: FINAL FANTASY® XIII. It drops frames every once in a while, and has some input lag but if you can bare with that, it's a really good port and would recommend it. I give it 5 rotten bananas out of 2 sunken Titanics!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this game for over 70 hrs. now and I don't think I can't stop myself from playing this over and over. At first I thought this game was gonna tie me tight on schedule due to the story line of the world is gonna end in the 13 days but after I got a hang on how to manage time and learn how to use EP ability instead of game will end in 20 - 30 hrs. as I expected, it got me playing over 40 hrs. just to get end this game normal mode.  For battle system I think it was a lot better than FFXIII and FFXIII-2. When I start playing this game I thought I just walk in stagger the enemy and then pound thier HP down like I did in earlier FFXIII series but it differents. Every enemy I face in the game have different way to stagger them and since I only have only 12 ability to work(3 schematas , 4 each) with instead of a lot of number like in the past and don't forget about guarding. Eevery enemy I face have at least one way or another to get a huge chunk of your HP if you don't guard against its attack. For example when I face nibblet in the first time I thought like 'Oh what's a cute little monster' and then 'thud' I have to say good bye to good chunk of my HP so that's what make this real time ATB system very interesting.   For side quest and farming. There are a ton of side quest to do to keep you occupied until the last day come for sure but sometime it throw me off schedule sometime. Farming in this game is fun until the extinction system kick in. I think this is making farming very interesting since you can't just farming all day like old time because monster now can come to extinction so it make me have to come up with other plan when one monster come to extinction.  So far playing on the Hard mode NG+ now all I can say is This game was a blast.",
            "review_score": "1"
        },
        {
            "review_text": "Great open-world rpg , lightning returns has the worst story of the trilogy but most definitely the best gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Game, if my playtime is low it is because I have completed the game numerous times on the PS3 and 360.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best game of the Fabula Nova Crystallis trilogy. Square Enix definitely learned from the problems people had with the first two, but I feel like people that would have played this game didn't because of those two. Overall, way better game than people give credit for.",
            "review_score": "1"
        },
        {
            "review_text": "Two thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "great game, if you like the FFXIII trilogy and you really really like lightning you might as well give it a go, don't like it refund it but i think you will like it #givememysteambadge",
            "review_score": "1"
        },
        {
            "review_text": "10/10 recommended",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this games to fans of FFXIII Saga, this 3rd game learned from xiii and xiii-2. The story is more easily to catch up for those who didn't invest too much time on the lore of the game. And the story is something that is enjoyable for those who got an interest for the characters. (my recommendation: If you like other languages, play it on Japanese because English voices could be annoying for certain characters).",
            "review_score": "1"
        },
        {
            "review_text": "I don't like the timer thing",
            "review_score": "1"
        },
        {
            "review_text": "what can i say?! nothing",
            "review_score": "1"
        },
        {
            "review_text": "This is the best PC port from the FFXIII series so far. There is some choppiness from loading in some of the larger city areas, but battles and everything else runs fine for the most part. There's no need to worry about technical issues like there has been for FFXIII and FFXIII-2, previously.  The gameplay is action-oriented this time, with a focus on timing your attacks and blocks during battle that is new to the series. The game in general has an emphasis on keeping things moving, rather than taking your time to think and explore. I am an old-school turn-based RPG fan, and it wasn't so action-based that I couldn't enjoy playing. I haven't found a battle so far that required timing skills to succeed, as long as I have setup Lightning's equipment effectively before-hand so that I had enough HP to survive despite my poor hand-eye-coordination, for example.  The story is bonkers, but that's just how FF games are now. It's a good thing the gameplay is fun enough that it doesn't really matter.",
            "review_score": "1"
        },
        {
            "review_text": "Since they removed the online DRM, i tell you. This game worth playing ! Your high tier waifu is yours anywhere, anytime :p",
            "review_score": "1"
        },
        {
            "review_text": "i love this game :)",
            "review_score": "1"
        },
        {
            "review_text": "i really love this game XD",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very well optimized, it's an amazing port of a great PS3 game, my favorite of the series. Gameplay is fast paced like the others in the series, but instead of pre-set roles you can customize Lightning's abilities to suit your paystyle. Lots of customization options from abilities to weapons and shields to armor Lots of open exploration. All Lightning, all the time.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have been a huge fan of the FF series since the very first one. This game is the countinuation of the FF13 series with Lightning and her friends but the gameplay has completely changed.   Remember the outfit system? Apply that to this game in a matter of speaking. Also, you are completely solo fighting against 1-6 or more enemies at once (except for one area, but that's spoilers). The fighting system is complicated at first at you try to master when to stagger, when to use magic, what type of magic, etc. But once you grasp that concept, most battles will come easier.   I, personally, had to restart after playing it through halfway the first time. You NEED time management.   I highly recommend this game, I've been playing nonstop since I picked it up.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, epic story :)",
            "review_score": "1"
        },
        {
            "review_text": "Yay I finally chose my favourite adornment... Oh.. look.. Tiara of the Goddess.... I... Halp.",
            "review_score": "1"
        },
        {
            "review_text": "if you hate final fantasy XIII and final fantasy XIII-2, you're forgiven to think this game would disappoint you. As a long time fan of final fantasy series, I am one of these people who are alienated by Final fantasy XIII gameplay and only played the games because... well it's final fantasy.   However, it seems squenix has learned from its past mistakes. LR is truly a good game, the best in trilogy. the gameplay is fun, with a large open world and side quests that made you feel as if you are doing something and rewards you handsomely in the end.   Don't forget about the costumes. Lightning has a lot of attires and attributes that look too cool or just incredibly stupid (anyone uses that moogle hat during serious scenes?)  the only catch is the time system. At first it really gives a sense of rush. This game is designed to be SHORT. a day in-game equals to an hour. You need to finish the main quests and complete the side quests later with new game plus.  Story wise, the story is dragging FF XIII's mediocre plot and FF XII-2 overly confusing plot to a whole new level. Fortunately the writing is good, so it will keep you interested and intrigued till the end. I think this is the game where the writers explore Lightning's personality which has been neglected in the past two installments.  The PC port is wonderful. Squenix should make Lightning returns as the new standard when releasing a PC port since FF XIII-2 pc port is the most horrible port I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "f you have played FFXIII and FFXIII-2 and enjoyed them then I would recommend this game. A great way to end the 13 series, plus the paid DLC from the console version is free on PC.  +Graphics are improvement over console +Comes with free DLC +1080P, 60 FPS stable +Combat system +Good end to FFXIII",
            "review_score": "1"
        },
        {
            "review_text": "superb action game! Great storyline from start to finish",
            "review_score": "1"
        },
        {
            "review_text": "very good &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A great ending to Lightning story. Would play again 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "amazing gameplay, different from classic FF playstyle ejoying it so much",
            "review_score": "1"
        },
        {
            "review_text": "when in game = this is awesome ",
            "review_score": "1"
        }
    ]
}