{
    "app_id": 345610,
    "name": "The Fruit of Grisaia",
    "release_date": "2015-05-29",
    "developer": [
        "Frontwing"
    ],
    "publisher": [
        "Frontwing USA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Visual Novel",
        "Anime",
        "Nudity"
    ],
    "achievements": 0,
    "positive_ratings": 692,
    "negative_ratings": 37,
    "price": 29.99,
    "description": "SIX FRUITS BARE THEIR FANGS AT THE WORLD. --The academy was their orchard. In this place of learning, protected by high walls from the outside world, there arrived a single young man who'd lost his purpose in life. He'd lost sight of what he wanted to protect.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/345610/header.jpg?t=1547719733",
    "minimum_requirements": "Минимальные: ОС: Vista Процессор: 1Ghz Оперативная память: 1 GB ОЗУ Видеокарта: 1024x576 DirectX: Версии 9.0c Место на диске: 7 GB",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7/8 Процессор: 1Ghz+ Оперативная память: 2 GB ОЗУ Видеокарта: 1024x576 DirectX: Версии 9.0c Место на диске: 7 GB",
    "reviews": [
        {
            "review_text": "I recommend the game, I do not however recommend buying off steam, buy from denpasoft website and you will get the H scenes, which are missing in the steam version, I bought the steam version and the H scenes have a lot of character development in them and some are completely cut from the steam version, there is also no way to patch it in. Ultimately by the time I discovered this I had played over the 2 hours that warrant a refund so I had to spend 80$ just to play the full game. Don't make my mistake just get it from denpasoft.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite playing the 18-R version already, I bought the game to support Frontwing for their amazing visual novels.  Not really wanting to spoil it, this is one of my favourite visual novels.  Play the 18-R version on Amane's route. The amount of sex scenes is amazing :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is My absolute favorite game. It tops any anime and any game ive ever played. It tops Hunter x hunter, code geass and stein;gate all together.   The Emotional thrill ride this story offered had me crying due to the sheer amount of love for each of the characters and the backstories of everyone made it that more depressing.  I can honestly say this game is unmatched and i will return to this in the near future.  If you play this play the route Michiru, Yumiko, Sachi, Makina then Amane for the best experience",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would watch Tunafish Man again.  but seriously, the emotional joy I experienced going through the game and reaching the 'good' ending is possibly greater than a young me several years ago finding out that Kraft Dinner exists.",
            "review_score": "1"
        },
        {
            "review_text": "I looooooovee it so wonderful so sad so devistating, poor Amane poor everyone, fantastic game wonderfully done. get the adult patch from imouto works makes it better.",
            "review_score": "1"
        },
        {
            "review_text": "Baby Baskest cried. It's good though.",
            "review_score": "1"
        },
        {
            "review_text": "I had initially left a preliminary review after finishing a single path. This is an update after having finished the entire game. All five paths, all ten endings. Having done that, I've gotta say. Holy ♥♥♥♥, that was an incredible experience. Maybe, my expectations (tempered by the likes of Sakura Swim Club...ugh) had an effect on this, but... I literally ended up dropping everything else I was playing on PC at the time just to consume more of these narratives. I know that the localization of The Labyrinth of Grisaia is in progress and I'm very much excited for when it will come out.  Pros:  -Since this is a VN, let's get the most important bit out of the way first. The writing in this game, while it takes it a bit to get started, is absolutely PHENOMENAL. Each of the character arcs is handled incredibly well. Each of the five characters are thought through and are very interesting character studies. Not to mention, the way the character personalities clash is often hilarious. It's to the extent that I've found myself contemplating some plot points or speculating about possible upcoming events while at work or on my commute. -On the note of writing, I've gotta give major props to the writers that handled the translation. The amount of vocabulary that I've learned from this game exceeds most natively english titles. There were even times when I saw a word, thought it was a typo, looked it up, and learned that it was an actual word. Well done.  -This game doesn't fall into the pit trap of having copy/pasted narratives. Yes, there's some similar themes that happen on occasion, but I was pleased to see that each of the paths is basically unique and even each of the endings is distinctly different.  -The voice actors have done an excellent job. While I, no longer, speak Japanese, but the emotion, intonation, and delivery have left me often just letting the VA finish the particular line before advancing to the next bit....and, that doesn't happen often, as I'm usually speeding through dialogue, not bothering to wait on the VA. -The music, while I feel that some of the loops could have been handled a bit better, otherwise, I have no complaints. Each individual track is fantastic, been pleasant enough to listen to, and I don't recall any of them having become grating, even after a multitude of repetitions. -The art in the game is superb. I won't even deny that a handful of scenes have made their way into my wallpapers collection. -Unexpectedly enough, there's also quite the collection of bonus material. I know that VNs commonly include their art and a few other things with them, but this is even more generous.  A couple of other comments, though they are not exactly cons: -The way each of the routes is set up, once you branch off, what happened in the other route no longer exists. As a result of that, there were points where I couldn't help but feel a bit guilty choosing one option, knowing that I've avandoned the fate of a character in favor of another. That being said, I believe that this VN's character progressions would have suffered quite a bit if it was a 'help everyone' type of story, so I'm not really complaining. Hell, it's not often that a narrative has left me to care this much for a character. -I've gotta mention the censorship. I've gotta give credit to Frontwing to having included additional content in the M-rated version to make up for the cut scenes, but... It does (apparently) have an effect on one of the character arcs and it's the matter of personal principle to note this. I suppose, at least, that's easily enough remedied if you desire to do so.  TL;DR: All in all, though, it's been a marvelous and enjoyable experience (to the point of considering this to be the best VN I've consumed to date). I know that the $40 pricetag may seen intimidating, but if it'll help, I'll say this much. The first story arc I complete was Sachi's. In my opinion, even if the game had ended with just that, I'd still consider this to have been money well spent. I'm very much excited for the sequel to be released.",
            "review_score": "1"
        },
        {
            "review_text": "BEST visual novel i have EVER played, was never bored once, finished my first route in around 30 hours and i intend to go back and do the others, the voices, the music, the humor..10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Period.  The interaction between the characters is well done. Had me laughing most of the time and emotional at some parts.  The music is one of the best. It fits really well with the situations and just adds more feelings to it.   If you checked out the anime before coming here, then you'll be in for a surprise. They are different. Just like books and movies, they change it up.  I'm a fan of this game. I've played this before with the fan-translated version and plan on playing the rest of the series. I got the steam version just to relive the experience once again because this game is that good.  There are a few mistakes in the steam version of this game. A few examples are spelling errors and a few mismatched dialog.  This is of course not 18+ so if you are in it for that version, just wait a bit. I did hear that they made a few changes due to not being 18+ including taking out some scenes but also adding few more. I did notice when I compared it to the fan-translated one. It does not make much of a difference, so far.  I absolutely would recommend this game that is looking for an incredible story to laugh until your sides hurt, relaxing to idle chatter of philosophical questions with music that just makes you so comfy it is like you are melting, and the.. well you just have to see for yourself. :D",
            "review_score": "1"
        },
        {
            "review_text": "The only other vn i've read was Steins;Gate and it was pretty good and i can tell you that The Fruit of Grisaia is worth more than $39.99. I recommend this to anyone who likes a good story and interesting characters.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 game WAY better then the anime but buy it from denpasoft for the unrated version :x",
            "review_score": "1"
        },
        {
            "review_text": "Was my write in for The Steam Awards, under 'Best Visual Novel'. Definitely a game that more than deserves that title, with humor, emotion, cute girls and kickass scenes. I adore this VN to hell and back, and will keep playing it for literally forever.",
            "review_score": "1"
        },
        {
            "review_text": "50% off, get it One of the best modern VN out there",
            "review_score": "1"
        },
        {
            "review_text": "Nice game :3",
            "review_score": "1"
        },
        {
            "review_text": "storyline so good  artworks so good   10/10 would rate",
            "review_score": "1"
        },
        {
            "review_text": "we want cards and achievments but GREAT GAME",
            "review_score": "1"
        },
        {
            "review_text": "Honestly it isn't worth the 40$ but if you can get it on sale it is worth your money. I've played for a good while and still havn't gotten to the end so it isn't good for people who can't invest a good 3 hours per sitting. I would give it a 9/10, for the fact that it just costs too much.",
            "review_score": "1"
        },
        {
            "review_text": "Made me bawl through the first playthrough. Made me cry even more every time I played through it. Best girl is Sachi second best is Michiru.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the visual novel masterpiece you have been looking for.  The game blew me away, and I am not new to visual novels by any means. If you are concerned about the removal of adult scenes, you can get this game legally from denpasoft and you should do so if this is a deal-breaker. Personally, I enjoy them being removed so long as it is not done awkwardly because I think it actually improves the flow and pace of the story. With this game we still got all of the build-up and even some racy images leading to these scenes, so I was really glad the game did not just skirt around the issue or totally ignore that aspect of the romances.  The characters in this game, and one girl in particular (Amane) will stick with me for a long time. Some of their stories connected with me more than others, but the ones that did were absolutely riveting and unforgettable. There were moments I laughed out loud and times I cried. I was genuinely rooting for every character, including the protagonist, who has a face in many scenes although he is not voiced. His character, however, was very interesting...just as interesting and intriguing as the heroines and that is a real accomplishment in this type of game!  If I had any criticisms of the game, it would be that the beginning (the common route) is on the lengthy side. I went into this game knowing almost nothing about it (and I recommend not spoiling ANYTHING), and I was really starting to wonder where the author was going with this game. However, I did enjoy it...it was amazing for short half-hour sessions as the common route is broken up into distinct scenes that take place during different times of day, creating many amusing vignettes. Once I got into the main routes, I would read for hours, dying to know what happened next. It's almost like this was 2 games in one, since the way this game made me feel was so different between the common route (very long, very amusing) and the main routes (suspenseful, heartrending).  If you are still reading this by now...buy the game! Unless you are looking for fanservice only, you will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Great visual novel, my favorite so far. Sequels getting english releases soon! ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite visual novels, great story throughout.",
            "review_score": "1"
        },
        {
            "review_text": "The Visual novel is good and the choices you make do have a effect on the story like all others. I would recommend this game to others only if they like the anime that is made with it, or the manga. it isn't like the full version which isn't sold on here but the novel is pretty much the same just some of the more exposed parts are not soon more like skipped. Other then that it is a great novel.",
            "review_score": "1"
        },
        {
            "review_text": "I originaly bought the game through  Jlist.com  and used an english patch to play this game.The game on Jlist was 90$ (at the time) and after playing it i would have gladly payed 200$ for it, it is truly incredible. After hearing that is was given the 'Green Light' on steam i decided to buy and give it a go and also support the Sekai project in their efforts to making the other sequals as well. What surprises me is that there is a slight difference in the games so far, nothing to claim it a horrible remake but enough for me to realize the difference. It could be that the english patch was just a fan made version (totally plausible) or they decided to spruce it up in this remake but i digress.  I completed the non steam version 100% and i have to say that this is one of the best visual novels out there. The story at first seems nice and the charecters are cool but it the further you delve into the game the more story you get. Each of the girl charecters is unique with a brilliant back story that turns into a magnificent work of art and each story you complete the more is revealed on the protaganists story. While this game is beautiful it also is able to realy pull on your heart strings if you give into the game. If you have watched the anime and then play this game you will realize how much has been stripped from the anime so that they could air it in just one season. Also, if you try and base the routes off of what was on the anime you will probably have a rough time. Im not 100% sure if the earlier on choices have much of an impact to the game in the long run but deffinently give it an intresting change for the moment. While the steam page claims it takes 50-80 hours to complete it actually is a lot longer because those 50-80 hours are for one route and there are a total of five routes. Speaking of which, if you happen to get the good ending the first time dont be affraid to go back and choose the bad ending. They generally have quite the spin of events on the story. Overall, this game is amazing and if you have 40 bucks (or less, you know the sales steam have) this is anything but a waste of time. I hope you guys found this helpful!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest VNs I've ever read.  The main character is a badass  The story has a deep plot and is funny as ♥♥♥♥ The story is long and absolutely entertaining  It's worth the money...regret spending for NEKOPARA but Fruit of Grisaia is absolutely incredible..",
            "review_score": "1"
        },
        {
            "review_text": "Great game, extremly good depth of story and plot with chances to work onto different routes of your choice. Very fun to play, loved the anime and is very recommended.",
            "review_score": "1"
        },
        {
            "review_text": "this game was quite good for only have playing one of the routes i cannot wait until the transtlators sell the next game in the franchise   ",
            "review_score": "1"
        },
        {
            "review_text": "The game was much longer than I thought it'd be. Gameplay is very minimal, with there being about 5 choices per playthrough. This is fine though, since it's a visual novel the appeal is in the game's story, which I quite enjoyed. All the girls have very detailed backgrounds and reasons for why they ended up how they are. I really enjoyed my time with game. And yes, this is the censored version, meaning there are no adult scenes. You'll still know when they happen though.",
            "review_score": "1"
        },
        {
            "review_text": "OMG I just finished the game for the first time (Amane route) and I nearly cried my eyes out. This game is absolutely amazing.",
            "review_score": "1"
        },
        {
            "review_text": "To sum everything up, I enjoyed this game 100%, but before I go into detail about the game I should make a note that for the people playing a visual novel for the first time, you shouldn't expect much 'gameplay' from this game. Yes, there are choices but they are very few compared to other choice-based storytelling games, you should expect to read a lot of throughout the game. Expecting otherwise will probably leave you disappointed, if you don't like reading you should turn back, because The Fruit of Grisaia has A LOT of reading. It's admittedly a different experience from reading a book (the BGM, voices, and illustrations help guide you on the atmosphere and the appearances/emotions of the characters rather than just leaving it up to your imagination), but you shouldn't buy this game if you hate reading.  * (If you don't want to read the long paragraphs of text you can skip to the short paragraph at the end for a summary) ____  Moving on, The Fruit of Grisaia is a standard visual novel, with choices that lead you to different routes that each focus on six different heroines. It's pretty lengthy and depending on your reading speed, it will probably take you somewhere around 60-85 hours to go through everything. Despite it's length however, there's a great attention to detail throughout Grisaia. An off-hand remark in one route becomes something the character actually does in another route, and the storywriters took great care in interwining each route indirectly with each other. The other thing is that all of the main heroines in Grisaia have background and purpose behind their characters. What might seem like a silly anime trope has a deeper and perhaps darker backstory behind it.  Even if the characters started out as simple archetypes, they sure don't now. Everything the characters do has some explained reasoning for it, and again you can see that the writers took a lot of careful detail in weaving the character's backstory with their personality and actions. And again, despite the fact that there's thousands upon thousands of lines of text, the story for each route is quite diverse. I was surprised at how the seriousness and setting could change within each route, and it's nice to see that the routes for each heroine have their own little slice at all the different atmospheres and backgrounds a story can possess. The other thing I enjoyed was the fact that throughout learning each heroine's backstory, you also learn more about the past of the main character, Yuuji, and his personality as well.  It's something of an intricate puzzle piece, where all the different parts of Yuuji's past and personality connect across all routes, and over the course of the game you learn more and more about him. In addition to the diverse storytelling is that the writers of the story aren't afraid to pull their punches. Each route has a bad and a good ending, and even though you know that there's a better alternative ending, you can't help but be surprised, or even disturbed about the endings that just happened. Some of them can be absolutely brutal, and others can be lighter and less emotional.  ____ * Short Version  To put it all succinctly, the Fruit of Grisaia is an absolutely enthralling and intersting visual novel with a diverse set of characters and storytelling and prose that is enrapturing in it's own way. The writing isn't afraid to hit you with a few punches, and the amount of detail that goes into crafting each route and character is amazing to say the least. This game is fantastic, and is worth every penny (for me at least).    If you're on the fence about whether or not you'll enjoy the game, you may want to watch a couple episodes of the anime adapation (I wouldn't watch more than 3, otherwise you'll be spoiled a bit) which will help you get a feel for the writing style of the game. It doesn't really showcase everything, but it should give you an idea of whether or not you'll enjoy the game (but don't judge the game solely by the anime, it doesn't really do the VN justice). If you have watched the anime before and enjoyed it, buy this as well. The anime doesn't really do the game complete justice, and although I watched the anime prior to playing the VN, I still found myself surprised at the turns the story took.",
            "review_score": "1"
        },
        {
            "review_text": "One of the gold standards of visual novels. Read it.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game back before it was on steam and loved it then, so seeing it brought to steam made me squeal with joy. So let's get this review going. This game is a 'Visual Novel,' meaning that there's really nothing in the gameplay department apart from making a few choices at certain plot-relevant crossroads, but gameplay isn't what we're here for, this genre is all about the story, so what sets this apart from others in the genre? (list of differences to the non-steam version at the end)  The first thing that catches my eye is that instead of a bland, everyman, blank-slate protagonist like a large portion of visual novels, we get Kazami Yuuji, an unsociable, military-raised teenager not so different from Sagara Sousuke (for anyone who has watched Full Metal Panic). Yuuji is blunt and a bit bad with handling personal relationships, but I honestly have to say that he's a great guy; he is incredibly capable and very rarely does anything negative without a good reason. Our supporting characters are also very unique and each play off of Yuuji and each other in very entertaining ways (though I will freely admit that Makina can get on my nerves). Here's a quick overview of the other students while keeping spoilers to a minimum (skip a paragraph if you don't want to see): Makina: Girl with stunted growth and childish tendancies. Ends up picking up a lot of bad habits and harsh language from Amane and Yuuji. Amane: Well-developed body and lots of erotic teasing made towards Yuuji. Very maternal and watches over Makina carefully. Also seems to want to take care of the socially-hopeless Yuuji. Michiru: Girl who is outright stated to be purposefully attempting to fall into the 'Tsundere' archetype, but more often than not ends up looking like nothing more than a contrarian idiot who's the butt of most of the jokes around the dorm. Sachi: Highly devoted girl who will listen to any order given to her. Often goes around wearing a maid uniform do to an offhand comment about it suiting her getting mistaken as an order (not an uncommon occurence). Has some obvious issues with common sense and flexible thinking. Yumiko: Aloof and introverted, but has some violent tendancies when annoyed or threatened. Despite this, she is probably the most reliable of the group for tough conversations (if you exclude Yuuji since we're kind of playing as him)  The aforementioned choices in the game will lead you down the character arcs of different heroines depending on what you choose, though this game makes it pretty easy to get to your favorite heroine since there are very few choices in the game and the ones that actually matter are essentially 'Go down this girl's route right now or continue the main route until we give you another choice.' Ostensibly, each girl has one more choice leading you to the bad end or the good end, though I'll be honest and say that I can't agree that every girl's endings split into those two categories   more specifically, one girl's endings would be better described as bad/worse while another has good/better  . Every heroine (Yuuji as well) has some sort of emotional baggage holding them down which got them put into this school to begin with; needless to say, if you go into a route and get details about these incidents, you can get drawn into some seriously heart-wrenching moments of fear, depression, desparation, and rejection as you relive the most painful moments of someone's past.  Having just replayed the Matsushima Michiru route in celebration of getting my hands on the steam release, I will freely admit I was brought to tears multiple times despite knowing everything that was going to be said, and this girl's route probably wouldn't be considered heaviest of the tragedies presented here (though, paraphrasing some words from the game, 'You can't really compare two tragedies to each other,' so I feel a bit bad trying to order the routes by tragic-ness). I look forward to replaying my favorite two routes next. As a side note, knowing the characters issues in advance actually explains a few strange moments that I hadn't noticed the first time around, so the replay was quite worth it.  As promised, I will list out the differences I've noticed between this and the non-steam release. First off, this is absolutely the exact same translation that was provided in the original version (not that this will surprise anyone who knows what a pain translating a game can be). Though I noticed that there don't seem to be translation notes popping up in the corners anymore, so either those got removed or I missed the option to toggle them. Also, on the steam page, you might notice some CG that weren't in the original game; there's a fair number of those scattered throughout the game. Anyway, next up, Steam doesn't like erotic content, so the intercourse scenes have been removed. Judging by the routes I've replayed so far, usually this is just taking a hacksaw to the scene, cuting out the part of the game with erotic CG/descriptions, and skipping to the conversation afterward (leaving a very awkward transition), but sometimes they change the scene slightly and toss in a new CG to make the transition slightly less abrupt, turning it into a chaste, heartwarming moment as opposed to a lustful one. There are also some other changes to the non-heroine moments, like a certain flashback scene involving the captain of Amane's old club in middle school being changed to be less suggestive. Some of the other changes: There was some nudity in the original version besides the erotic scenes, such as when some 'girl-talk' was happening in the bath, so the character sprites were changed slightly to cover the naughty bits with soap. Also, some scenes got cut in places, but were removed so subtly that I didn't even notice until I went back and looked at a CG set for the original game (Michiru and Sachi building sand...stuff on the beach got drastically shortened, but I didn't even notice until I realized I never saw the CG of Michiru being burid in the sand (This review has ended up mentioning her quite a lot, hasn't it)). This all being said, they kept a very large amount of content in the game. For example, stuff like Amane standing around in Yuuji's room in her underwear ended up making it passed the censor stick, and if that made it by unscathed, I highly doubt they made many big cuts besides the one beach scene that I happened to remember.  Conclusion: Hilarious characters, engaging story, and fun to replay despite (and/or because of) knowing the plot. Easily a massive thumbs up from me. I really want to play the two sequel games, but the complicated language used in this game is making my doubt my Japanese is fluent enough for the task, so I might have to wait until the others get translated...that or watch the anime versions for the condensed story.",
            "review_score": "1"
        },
        {
            "review_text": "++++++++great game   - but it needs cloud saving",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again!",
            "review_score": "1"
        },
        {
            "review_text": "i love this will buy the next 2 installments buuuut am a bit upset they dont have the H scenes qwq i mean  I'm paying 40 dollars for a game with content removed (i know this is a port from psvita but still.....)",
            "review_score": "1"
        },
        {
            "review_text": "This has a fairly standard basic setup for a VN with a lone male stuck in a group of females and your choices determine who you end up with. The first major difference in this one is the quality of the story (its quite good for a change) and second is that all the major characters are the standard tropes (tsundere, horny big sister role-player etc etc) but pushed to the limit and actualy given plausible (if fanciful) reasons for being the way they are, rather than just the usual ‘just because’ + good story good translation (only a couple of errors) characters you are able to connect with Long story with multiple choices which aren’t all clear cut obvious ones - The all ages version cuts some of the smuttier humour (and obviously the H scenes) which kind of lessons the story slightly, they could have left some of the ‘closer to the bone’ jokes (but obviously not the scenes) and not had any real issues.  For some reason I have a real urge to eat tuna and buy a box cutter..strange",
            "review_score": "1"
        },
        {
            "review_text": "One of the best visual novels I have read/played. Starts as a light rom com kind of thing then goes south pretty fast. 11/10 would cry for every route again.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a great Virtual Novel that you can spend over 40 hours on or in my case 48. Great storylines with all rewarding endings. A memorable experience for sure",
            "review_score": "1"
        },
        {
            "review_text": "Amazing visual novel. It's not a very interactive VN, and there're barely any choices you have to make in the game. Really, the only choices you get is when deciding which route you take and if it's a 'good' or 'bad' ending. It's a great read nontheless that'll keep you going for hours.  It's filled with great and funny dialogue, although the inner monologue can drag out a little too long sometimes. Every route tells the story about the tragic past of the heroine, so the more serious stuff happen after the common route.",
            "review_score": "1"
        }
    ]
}