{
    "app_id": 345660,
    "name": "RIDE",
    "release_date": "2015-03-27",
    "developer": [
        "Milestone S.r.l."
    ],
    "publisher": [
        "Milestone S.r.l."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "achievements": 50,
    "positive_ratings": 1053,
    "negative_ratings": 361,
    "price": 14.99,
    "description": "Bikes from the world's most beloved motorcycle manufacturers, breathtaking races, and a round-the-world trip taking in 15 different locations, all this and more in the new videogame: RIDE.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/345660/header.jpg?t=1503305223",
    "minimum_requirements": "OS: Windows Vista SP2 / Windows 7 SP1 / Windows 8 / Windows 8.1 Processor: Intel Core i3-530 @ 2.93 GHz / AMD Phenom II X4 810 @ 2.60 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 460 @ 1GB / ATI Radeon HD 6790 @ 1GB* DirectX: Version 10 Storage: 35 GB available space Sound Card: DirectX compatible Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "recommended_requirements": "OS: Windows 7 SP1 64-Bit / Windows 8 64-Bit / Windows 8.1 64-Bit Processor: Intel Core i7-3770 @ 3.4 GHz / AMD FX-8350 @ 4.0 GHz Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 780 / AMD Radeon R9 290X* DirectX: Version 11 Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "reviews": [
        {
            "review_text": "Do you like loading screens? Do you like random fps drops that will put you off an make you crash? Do you like racing the same 4 or 5 tracks with the same 4 or 5 gimmicky game modes?  All this an more in ride the game! 99/10",
            "review_score": "-1"
        },
        {
            "review_text": "First of all the game looks nice. It presents a lot of options in terms of customization, but only just touches the surface in that area. The physics are below average. Bikes doesnt react to surroundings correctly, and the man himself desperately needs a ragdoll effect, which cant be that hard to make since we've seen that in lesser good games like Flatout, Flatout 2, Motocross game from 10-15 years ago. Milestone doesnt have any real competition on the Motorcycle game market and therefore do not feel the need to up their game at all. Same physics and controls as the last 2-3 MotoGP games. Poor network options - that rarely works, and when you succeed in connection to your friends, the game lags out and people disconnect with each other leaving you alone with bots.  The WORST thing about MotoGP through ALL the years and now also RIDE is the quality of sound. Computer sounds, made by what obviously must be people who havent heard the real thing IN REAL LIFE. The sounds these machines make are worse than car games 15 years ago. You have the rights to MotoGP, you dont have any competition - GO out and record the ♥♥♥♥ing machines to deliver it to us when we game it. Most of the purchases unfortunately done of this game, is by people riding a motorcycle, so we KNOW the sounds. My first machine was a Yamaha MT07 with an IXIL exhaust on. That doesnt exist in the game but Akrapovic does. Its looooud like a beast with Akra on IRL - but ingame it sounds like the engine sound comes from an iPhone.  Disgustingly bad :).  If you can come to terms with having to mute your game, because having no sound will annoy you less than having the sound on?! - then its STILL almost a waste of money.  Now RIDE 2 is on the way. People are ALREADY in the comments to RIDE's trailers and also RIDE 2's trailers writing 'WE WANT REAL SOUNDS' - if they ignore us, us being the ones who pay for the damn thing, one more time.... i HOPE it will have consequences. Or at least give another studio the ide to start making Superbike or MotoGP bike games again!",
            "review_score": "-1"
        },
        {
            "review_text": "Corrupted Save :( I have played Ride since it came out and have worked hard winning races to build up my Bike collection over 44 Hours of gameplay. Today I go to play and my Save is Corrupted and I have lost everything I have worked for! Great game but don't waste your time as you will be disappointed when you lose eveything!",
            "review_score": "-1"
        },
        {
            "review_text": "I admired the screamer games long ago.  Then Milestone lost a fan with their buggy WRC game (corrupt save games). I thought I will never buy a Milestone game again, when I read about the save game errors in Ride.  But I liked the demo and I like motorcycle games. Bought it finally during the sale (Read some developer feedback, they seem to care a bit more now than back with WRC).   Played for 7 hours on the first day and it is a great game. (It crashed once but save game was not lost).  Looking forward to tune my bikes in the next weeks!  Forget what I wrote save game bug still there! Back up does fail as well.  Developer is no good indeed  (and steam will not refund bugged game because save game corruption struck after 12 hours gameplay)",
            "review_score": "-1"
        },
        {
            "review_text": "i will talk about this game in sections.  1st is that from a technical standpoint the bikes are great, awesome models and great weight and feel. The sense of achievement from upgrading and racing is 'gran Turismo' like. The difficulty makes you feel good when u get it right and punishes you for mistakes.  sound quality isn't as great as i thought it would be but it doesn't break the game.  Graphics are good.....textures are brilliantly detailed, But, it does use about half my 980's raw power and seems a little OTT for a racer.not too many options could limit its scalability.  i am not a biker and i love car sims to pieces but this is my first foray into bikes and i love it. the track selection could be bigger and i would love the isle of man TT to be on here, but i feel DLC's will be incoming.  it is worth the money i paid for it and i recommend it fully. i welcome questions on my review and hope for feedback.  B.",
            "review_score": "1"
        },
        {
            "review_text": "30 fps max, slow controller responsiveness, devs stopped working on it...  How much more do I need to say?",
            "review_score": "-1"
        },
        {
            "review_text": "GOOD.  I good game to play, plenty of bikes to ride, shame about the new R1 being a DLC",
            "review_score": "1"
        },
        {
            "review_text": "I love the game but the stuttering and freezes even though i have a Lenovo Y50 i7 4720 8GB ram NVIDIA GTX 860 2GB DX11 Win 8.1 64bit really needs to be patched. Everyone has complained about this practically. The game runs smooth at max video settings and max resolution when it runs but midway through any race you get freezes and stutters. No crashes to desktop but restarting the game helps but only for a short while....PLEASE FIX THIS GAME Milestone!!  My system runs all other racing sims (PROJECT CARS Asseto Corsa Real Racing Experience etc at FULL SETTINGS so dont try to tell me my system can't handle it...the demo was fine....no freezes",
            "review_score": "1"
        },
        {
            "review_text": "Is this game good? Yes... at sale price. The pros of this game is the basic gameplay, it's a really fun hybrid of arcade and sim that really nails the balance. It reminds me alot of the old MotoGP game from the early 2000s that leaned more towards sim racing. It has a good variety of bikes, could have used more tracks and variants to keep things fresh as you play. Now the problem is the content, it really isn't anything to write home about. It very much feels like a 90s game where gameplay was pretty much what you got. I'm comparing to modern racers where there is more than just racing. Think of that Gride game where there was a progression from season to season. Think of games like NFS shift (that this game borrows from a bit) where you had different categories you raced in. Yes you kind of have it in this where you race in different classes but it's not as well done. Think of how much customisation you get nowadays. Basically this is a nice game but quite bland. There aare still some bugs and glitches but nothign that broke gameplay or crashed the game for me. It's all just unpolished and could use more game modes and content.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game great fun could do with a few patche,s for graphic,s on the tracks the bike,s look really good   defo would buy good game",
            "review_score": "1"
        },
        {
            "review_text": "Online does not work. I would not buy it before i see it is working, unless u wanna play single player",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is fun to play, but its VERY irritating to put some hours in the game only to have corrupt save files... and this is apparently a common thing for this game, im NOT doing all that crap again, screw this. Your rep on the steam forums even commented saying they released the fix but it doesnt seem to work does it? other wise i wouldnt be typing this. To make matters even worse, you STILL did not fix this even on your next game. Apparently ride 2 has the exact same problem so needless to say i will not purchase that game based soley off that fact, nor any of your other games.",
            "review_score": "-1"
        },
        {
            "review_text": "sick as game love it",
            "review_score": "1"
        },
        {
            "review_text": "this game can‘t be saved",
            "review_score": "-1"
        },
        {
            "review_text": "(+) -Bikes -Tracks -Gameplay -Multiplayer and splitscreen -i love this bike game  BUT  (-) -some glitches when play offline. sometimes i got not responding when i set up my controller but its fine. -very rarely people playing multiplayer -and this game DLC is too expensive  if you love superbikes, just play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best motorcycle racing game I've played. It's like gran tourism for bikes. Great camera views.",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the massive savedata progression-halting bug, I think this game is quite nice.  9/11",
            "review_score": "1"
        },
        {
            "review_text": "Has such potential, but unplayable in it's current state.",
            "review_score": "-1"
        },
        {
            "review_text": "bad online multiplay !! cant invite friend !! many disconnect !! Really annoying!!",
            "review_score": "-1"
        },
        {
            "review_text": "+ Lots of motorcycles to unlock + Rider view and detailed dash + Acceptable physics, good feeling + Variety of categories and events + 4 cylinder bikes sound decent + Replay mode lets you take good screenshots + Wheelie control can be turned off for more fun  - Unrealistic amount of grip, even on grass - Many bikes aren't competitive in their category - Most 1, 2 and 3 cylinder bikes don't sound right - AI difficulty spikes - Minor visual oddities",
            "review_score": "1"
        },
        {
            "review_text": "ALot of modern and classic bikes. Lets be honest, there isnt too many good motorcycle games on the market but this is one of the better ones. Not buggy like Milestones other games, this ones acually works.  The graphic are amazing, and the rider detail is the best Ive seen in any motorcycle game to date.   The sound of the bikes could be alot deeper, dont get me wrong all the bike sounds unique but the game is lacking that deep rumble you get after upgrading to a proper exhaust.  The handling of the bike feel really good although the bikes feel like they drift more then a real bike would under heavy stand up braking, but not a huge problem.  I love the game, its basically Forza for motorcycles. I am hoping for more tracks in future DLC.",
            "review_score": "1"
        },
        {
            "review_text": "really good game! beside the control set up was a bit awkward but after awhile you will get it great graphics and gameplay! awesome bike models! such a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Raced with Rossi Will race again 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I've read lots of reviews about Ride being unplayable; I had to agree with this at first, but after many tweaks and playing with settings I finaly got the game to run moslty trouble free.   I had the track detail set to about 3GB and the AA at 2x. with everythign else set to high. This setting seemed to work well and would jump between 30fps-48ish, with only a few tracks and sections of the game dropping to unplayable fps.   I recently installed windows 10 and tried the game again. with everythign set to high and AA at 2x ( for now ) I get a constant 50fps. have played about 7 races on different tracks and had no trouble at all. Defnitely an improvement.  The game itself is great. looks beautiful, bikes sound awesome and the game play is fun.   If you've had trouble with the game in the past, give it a go with windows 10 and see if that helps. I'm not saying it will make it better, but it appears that way on my system.   enjoy,  M  I ran the game using an fx 6300 / R9 290x, hopefully that helps you make a judgment on how it may run with your spec.",
            "review_score": "1"
        },
        {
            "review_text": "Do you enjoy playing a game that insists on locking @24fps slideshow?  Do you enjoy f****ing around forever to unlock the framerate only to find that regardless of whether you are V-synced @60fps or unlocked @120+fps on a GTX970 the game has TERRIBLE STUTTERING?  If so, youl love this game! MotoGP has EXACTLY the same problem. The developers are F*****G C***S!",
            "review_score": "-1"
        },
        {
            "review_text": "This game, is a real shame. It had such an oppurtunity to be a fantastic game, unfortunately, it's fallen flat on it's face.  Let me explain, now, Ride, as you might guess is a production motorbike racing game. Something I have been wanting for ages.   The problems start at the thing the game is about, motorbikes. Or the lack there of.   ***CONS***  - Now we have some bikes on here for sure, don't get me wrong. But we are missing some essentials. Hayabusa, ZXR1400, etc. The bigger bikes.   - The sounds of the bikes. Some are pretty good, others? Crap. I mean really, really bad. The 2 strokes? They sound like a smaller 4 stroke. Annoying.   - Stuttering, low FPS around corners. It runs at 60FPS constant until it suddenly decides to dip to around 10. Usually happens when going around corners.  RIG: Intel i5 4670K GTX 690 8GB 1866Mhz bla bla bla  - Sometimes you come off for no reason. It just happens. You'll be flung off your bike, for apparently no reason. No idea why, but you do.  - Menu's are not good. Pretty ugly, slow, not very well laid out.  - Small one, but very annoying for me, changing your exhaust doesn't effect the sound of the bike at all.  - The AI seem almost impossible to knock off, where as you come off very easily.  - The walls can sometimes just push you off your bike even if you aren't touching them.  - You cannot practise, or even qualify for a race. You are straight into it. This is so annoying.  - Not much customization for bikes. When you first play it, it seems like a lot. But then you realise, most of it is the same for every bike. I'd like more exhausts, own decals, racing fairing, that sort of thing.  But now the good bits.  ***PROS***  - The ability to change your ride style. How far you lean, how far you tilt your head, the lot.  - Being able to change your kit.  - There is nothing else like it. The closest is Tourist Trophy back on PS2.  TL;DR I don't like it.",
            "review_score": "-1"
        },
        {
            "review_text": "JeuxActu Apr 5, 2015 65 Ride was off on the good foot to be the bike's Gran Turismo with its generous roaster of over 100 bikes and a lighter roaster of 15 tracks. But with all the official licensing and the aftermarket parts, the salvation was in sight, until Milestone's incompetent devs ruining of the final product with major bugs blossoming all over it, including corrupted save files and game instability. ",
            "review_score": "1"
        },
        {
            "review_text": "Game is really good and I enjoy playing it however its extremely laggy my computer lies a tiny bit under the recommended hardware i have GPU : Gigabyte R9270X 2GB CPU : AMD 8320 8-core 4 GHz and 8GB of RAM i have seen a R7 GPU performing better on this game??? on similar graphics, but the game run at a roughly high FPS it is just massive lag spikes -_- so if anyone could help that would be appreciated. Also the crash animation is ♥♥♥♥ but overall I give the game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "you can barley drive without falling off your bike if i could get a refund i would",
            "review_score": "-1"
        },
        {
            "review_text": "Boring with MotoGp ?  This game is for Motorcycle Lovers The Rooster is awesome. 600cc-1000cc honda, yamaha, ducati, bmw, Ktm, etc.  i hope developers make 150cc-250cc DLC.  Pros - Graphics is Awesome* - Customization ( Bike, Rider , Etc ) is Cool * so many manufacture like Akrapovic, Arai. even you can change your OIL ! LOL. - World Tour is Great! - Super Fun for Motorcycle Lovers! - Exhaust sound is different when you change your exhaust manufacture*  Cons - No wheather effect ( this game need this seriously ) - Damage Effect is to arcade ish, the glass cannot break lol - Track Texture is not next gen ( is ok, but not next gen ) - I cant Repaint My Ride , WHYYYYYY??? - Exhaust sound is little bit more same like real - Need more track.  Should you buy it? YES IF YOU LIKE MOTORCYCLE LOL.     ",
            "review_score": "1"
        },
        {
            "review_text": "so so, i expected something better",
            "review_score": "-1"
        },
        {
            "review_text": "Uninstall and refund while you still can.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent expanding selection of current and historic sportbikes, attention to detail, managable learning curve, bike modifications, realistic tracks, good core game.  Overshadowed by stacked loading screens, game breaking exit-game issues, championship crashing, multiplayer ending bugs. Obvious quick port to PC. No social modules for chat, or user interface for mouse selections.  This one is a gem that needed more time being cut.  With hardly any competition in the 2 wheel market, a polished version of this might have cornered the whole niche.  Recommending with a large dose of 'It's far from perfect, but it has good potential.'",
            "review_score": "1"
        },
        {
            "review_text": "Great selection of bikes but the physics are a real shame, I own a CBR 600rr and the games CBR handles nothing like mine, sorry guys, you cant actualy full throttle through every turn. It almost feels arcadeish because of the physics. All and all its enjoyable and I cant deny that it is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best bike racing sim ever!",
            "review_score": "1"
        },
        {
            "review_text": "amazing as close to the real thing as you can get perfect.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Awesome!! Would be nice if there are more customisation!",
            "review_score": "1"
        },
        {
            "review_text": "Dont Buy This Game  Because whatt ???? ..  Dificultyy 12/10..  this game is not for weak rider..",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, Although has a console feel that I really dont like that much (going between menus with bizarre loading times) The driving feel is very good. I played SBK X for a while and I liked that one as well, IF you've played a milestone bike game you should feel at home. Still some problems with the not so realistic feel of the bike sometimes, I mean a bike is VERY nimble in real life, you can lean from one side to the other very quickly : in this game you have to change suspension settings to get closer to reality, and you get negative effects from that (less stability). Still this is acceptable and you can have a lot of fun.  Does not have a lot of tracks at the moment, which is strange because they already had them in earlier games (in SBK X and previous moto GP games you had most popular tracks like brno, mugello, mazda raceway laguna seca etc.  A few open road tracks : need way more real open roads (and i mean not going in circles with laps, i mean a real road like there are sometimes in rally games)  Also city tracks , which I dont like so much (all 90° turn... it gets old)  Lots of bikes ! That's awesome. very well detailed, many categories like historical, naked, sportbikes, of all displacements.  Some groups are unbalanced for racing (you get MT07 or 696 pitted against a 848 , I think they should categorize in relation with horsepower instead of displacement.) Other example in supersport category: 600cbr, 636 ninja, MV agusta 800 3 cylinder : too much difference in hp  Wasn't very expensive so I got what a paid for but.. I really hope they develop on this base because it could very well be a wonderful title. I won't hesitate to buy DLC's to expand on it (bikes, tracks)  So.. why do I not recommend it ?  -Milestone is deaf and mute , PR is nowhere to be seen, many users have game breaking bugs and nothing happens -Loading screens are actually preventing me from launching the game right now, I mean it feels like playing playstation 1 back in the day",
            "review_score": "-1"
        },
        {
            "review_text": "How to play online with friends i don't see lobby my friends ",
            "review_score": "1"
        },
        {
            "review_text": "Uninstalled the game, Was not happy with my save data not being saved properly.  Every time i went to run the game it would have me restart all over again.  Its a shame, since i liked the game quite a bit.",
            "review_score": "1"
        },
        {
            "review_text": "this is one of the most exiting and realistic racing games in the bikes world. highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Game is dead fora long time, you wont find a single soul playing online, it´s sad because game is really fun and have awesome bikes and tracks! I recommend for career mode but if you are looking for online play you can just give up, i wont be able to do all achievements because there no people online :(",
            "review_score": "1"
        },
        {
            "review_text": "Despite all the negative reviews, I decided to give this a try..and boy, how wrong these reviews are is incredible!   When it comes to the bike models, the level of details and customization, it is a masterpiece. You will spend 80% of the first race just looking at your bike and be impressed, they look awesome! The bikers customization is also on par with many options and gear to choose from.   The sounds though..might use some improvements, but they are not as bad to force you stop playing.   The ingame options are limited to sound and hud, the rest is either managed by your GPU's control panel or the game's launcher.   Overall it is an ARCADE, don't expect super physics, feedback from the tires or anything that could make it feel more realistic or sim-like, it is 100% arcade. They clearly spent all the money on the licenses and the amazingly good looking models and left the gameplay and overall feels somwhere..far from the game xD.   I will list the things you will read the most in the negative reviews and try to explain/solve them if possible:   FPS drops - Yes, the drops were there when no fps lock was in place, from 120 to 80 on different areas on the same track. As this game is a console port you can't expect it to work over 60 fps without drops. Lock to 60 using your GPU's control panel and you will be fine. It NEVER dropped below 60 for me.    Long loading times - Lies. Got the OS on SSD and the game running from a 5900 rpms HDD and it takes like 15 seconds, sometimes less, to start racing.    Corrupt saves - As simple as backing up your save after each session. Yes, it is a pain in the ♥♥♥, but if you are a bike nurrrrd and like the game, you won't have any problems with doing a simple copy-paste.    Game keeps running in the background. Close Logitech's Profiler and problem solved.   Crash on loading screen. Don't press any buttons at all during loading screens and voila, no crashes.    Bad AI. I agree, to a certain point. The AI is not bad, it can be a real challenge, specially at the beginning, even more if you go with the Yamaha as your first bike, but from time to time they might act like you are not there, crash into you and force you to either finish in the last positions or restart. It is annoying, yes, but, you can simply avoid them by keeping your distance or using the rewind thingy to go back in time.    Xbox controller not working. I am guessing these people were using third party 'xbox' controllers and they did not work because the original one from MS works pefectly fine. In menus and in races.   For 9.99 € it is worth every cent.  ",
            "review_score": "1"
        }
    ]
}