{
    "app_id": 345750,
    "name": "Idol Hands",
    "release_date": "2015-02-18",
    "developer": [
        "Pocket Games",
        "Fluid Games",
        "GodSpeed Games"
    ],
    "publisher": [
        "Green Man Gaming Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Sandbox"
    ],
    "achievements": 20,
    "positive_ratings": 55,
    "negative_ratings": 65,
    "price": 3.99,
    "description": "Idol Hands is a strategy game where you gradually take over the world by guiding your people and defeating other gods.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/345750/header.jpg?t=1504608445",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i5 or equivalent Memory: 2 GB RAM Graphics: Intel HD Graphics 3000 DirectX: Version 11 Storage: 540 MB available space",
    "recommended_requirements": "OS: Windows 8 or Later Processor: Intel Core i7 or above Memory: 4 GB RAM Graphics: Intel HD Graphics 4000 or above DirectX: Version 11 Storage: 540 MB available space",
    "reviews": [
        {
            "review_text": "Feb 2016  UPDATE: I can easily recommend the game now, as they fixed a lot of the issues I had a year ago. It's also only $5 as opposed to $20. Changing my review from negative to positive.  ---  Feb 2015  Oh, how I wanted to recommend it. On the plus side, it’s a god game that lets you reshape the land so that your furlings can construct their own structures as well as cast powers like earthquakes and volcanoes (similar to Populous). On the surface, this sounds great! On the other, there are some really odd things about this game that make me scratch my head in wonder as to what the developers were thinking. There are no time controls, no WASD or arrow key camera movement, no zooming (there is a fixed bird’s eye view), holding in right mouse click and moving the mouse up and down (not left or right oddly) rotates the camera, no HP bars above buildings, your score decreases as you play (rushing you into beating it more quickly), and more. As far as I can tell, there are eight levels on the campaign menu and no skirmish modes. The inclusion of the latter would have given the game some replay value and could have made it worth $20 despite these short-sided gameplay mechanics. As it stands, it just doesn't do enough to justify that price tag (in my opinion).          YouTube™ Video:  DGA Plays: Idol Hands (Ep. 1 - Gameplay / Let's Play)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "great game to play i love it",
            "review_score": "1"
        },
        {
            "review_text": "So far, so good.. It really is a good throwback for people who enjoyed games like Populus or Black&amp;White in the past, and it's definitely worth the $5.",
            "review_score": "1"
        },
        {
            "review_text": "Battle. Hamsters.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Idol Hands takes a godly amount of time to actually start getting interesting and that's only if you can survive the dodgy voice acting during the unskippable tutorial which, let's face it, sounds like it was recorded from a tin can connected to some string. The fact that in a game where you literally play a god, it was bizzare that my actions were limited by mana and subsequently I never actually felt like I had any meaningful input and didn't feel empowered as a god. All this and a bizarre choice of camera controls all added up to a pretty boring experience.          YouTube™ Video:  Idol Hands | PC Gameplay &amp; First Impressions&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Executable is missing for Linux",
            "review_score": "-1"
        },
        {
            "review_text": "this game is so ♥♥♥♥ing ♥♥♥♥. It's just levels that last for like 5mins. Every 2 missions is a tutorial which is prety basic which tells you what you know already. The game is also nothing like the pics and videos. Don't get this game it is ♥♥♥♥♥.",
            "review_score": "-1"
        }
    ]
}