{
    "app_id": 346040,
    "name": "Joe's Diner",
    "release_date": "2015-03-31",
    "developer": [
        "VIS-Games"
    ],
    "publisher": [
        "United Independent Entertainment GmbH"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 7,
    "positive_ratings": 56,
    "negative_ratings": 106,
    "price": 5.59,
    "description": "Somewhere along the venerable Route 7, in the middle of nowhere, you will find Joe’s Diner. The old Diner was built on the site of a former Indian cemetery. Amongst the buried, two rival chieftains are laid to rest; while alive each could not stand the other.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346040/header.jpg?t=1517298150",
    "minimum_requirements": "OS: Windows® Vista / 7 / 8 Processor: Intel® Core™ 2 Duo / AMD® Athlon™ X2, min. 2.4 GHZ Memory: 2 GB RAM Graphics: Nvidia® / AMD® with 256 MB memory DirectX: Version 10 Storage: 1 GB available space Sound Card: DirectX® 10 compatible",
    "recommended_requirements": "OS: Windows® Vista / 7 / 8 Processor: Intel® Core™ 2 Quad / AMD® Phenom™ X4, min. 3,4 GHz Memory: 4 GB RAM Graphics: Nvidia® / AMD® with 512 MB memory DirectX: Version 10 Storage: 1 GB available space Sound Card: DirectX® 10 compatible",
    "reviews": [
        {
            "review_text": " KAMGUSTA's mini Review   This game is so bad I had to say a few words... First of all, it is not 'horror', 'adventure' or 'action' at all, it is just boring as hell! All you have to do is cleaning the tables of a diner while keeping the surroundings as quiet as possible (answer the phone, shutoff the machines, avoid falling sleepy on the keyboard while playing, etc). Yes, that's it.   Score 3/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "I have finished the game before getting all the trading card drops. But I've liked it.  I would add a pointer for the mouse tho'",
            "review_score": "1"
        },
        {
            "review_text": "I do not believe that their is enough content in this game to justify the price they are charging for it.",
            "review_score": "-1"
        },
        {
            "review_text": "There is not much of storyline but, being hunted by an indian ghost because you couldn't filled out your duties in the restaurant was priceless...",
            "review_score": "1"
        },
        {
            "review_text": "  Not recommended...  ",
            "review_score": "-1"
        }
    ]
}