{
    "app_id": 346180,
    "name": "David.",
    "release_date": "2015-02-16",
    "developer": [
        "Fermenter Games"
    ],
    "publisher": [
        "Fermenter Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Physics"
    ],
    "achievements": 21,
    "positive_ratings": 572,
    "negative_ratings": 154,
    "price": 1.59,
    "description": "You play David, an awfully small abstracted chosen hero tossed into a blissfully simple world overrun by giant culminations of evil physics-beasts. As David, you are given a slingshot-esque gift that you will have to use to conquer your colossus foes. Be there AND be square.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346180/header.jpg?t=1456195044",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.2+ GHz Memory: 2 GB RAM Graphics: Direct X 9.0c compliant video card with at least 512Mb DirectX: Version 9.0c Storage: 20 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "David. is a game that includes a period as part of its title. We're going to pretend David. knows better and it's actually called David. Argh! That period there was to end the sentence not describe the title. Moving on. Let's discuss David.  Here's a bit of advice: if you're going to write a review that hinges on you spending two and a half hours to climb to the top of a leaderboard, best make sure the game will update your score and said leaderboard when you quit out manually rather than waiting for a game over. Now, this statement should tell you three things. One: this game is engrossing enough to keep playing for two and a half hours. Two: while David is good fun, it is lacking some technical touches that can be frustrating. And three: yes, I am petty enough to gloat about temporarily being the best David! My name's not even David!  So, David is an interesting little shooter/platformer that invokes the vector graphics of ancient arcade games like Asteroids. I'm not going to try and sell you on that. I think you either know if that's a deal breaker, a nostalgia trip, or just a valid aesthetic choice you can live with. What makes David interesting is its primary mechanic. The game is frantically paced and the platforming is very loose and floaty. However, you have the ability to charge up a shot of rainbow colored orbs and while charging the game will slow down, allowing you to get your bearings, aim, and dodge. You'll often have to choose between spamming the charge to keep time slow or returning to heart attack pace to allow your orbs to return to you for another shot. It works nicely and after a few tries, you'll no doubt find it simple and elegant.  The bulk of the game is the 'story' mode. The story being: you are a square (of course you are, you are playing a vector based shooter in the 21st century). Evil rhomboids are invading, but you've got the rainbow balls to stop them! This plays out over a handful of levels that are basically boss fights with a dash of puzzle. Each of these can be quite tricky, though I dove in on hard where getting hit instantly ends your existence as a regular quadrilateral. I'd actually recommend picking the hard mode right off the bat since it gives this short game a bit more weight and satisfaction. That said, it's nice the option is there for a more casual experience. One way or another, the reload time is fairly quick, so if you do die, you won't spend too much time waiting to get back into the action.  David also includes an arena mode where you can find an endless number of baddies. I definitely recommend giving it a try since it adds some fun new mechanics, including a power-up and the ability to upgrade David with more projectiles and some new abilities. The difficulty curve is a bit peculiar, however, since you upgrade David by spending points from your high score and, though the enemies are endless and do increase in volume for a time, the challenge does reach a plateau. This creates a situation where getting a high score is more a matter of patience and attrition than skill as the more you win, the better a David you can build, so the more you win. I guess that takes some of the glow out of being the best David, since even a schmuck like me can claw his way to the top.   In fact, in this mode, it could be argued the real enemies are your bodily functions (you cannot pause to pee) and boredom once you settle into a routine. And perhaps your computer's memory. Despite the extreme minimalist graphics, I had slowdown to almost unplayability once I'd been playing arena for long enough. I suspect dead enemies weren't being properly recycled. Of course, all of these issues will only be found by mad men, not anyone just casually playing the game.    Update    This was the part of the review where I complained about things - lots of things because I'm difficult like that. But I'm difficult for you, the reader who is maybe about to spend money on this pile of numbers in the shape of a game I'm writing about.   Thing is, there's a lot less to complain about now. David's dev has been a real class act, lowering the price to a much more reasonable deal for the content, adding more content for free, and sanding down some of the rough edges. You can rebind keys and alt + tab works right! Joy!  That kind of attention alone makes me want to say emphatically: get this game! It's earned it.   Yes, it's still missing volume sliders, resolution options, and a pause button. Ah to have a pause button.   Sure the levels are short, but my bits still start to itch when I'm about to win, no?  That and I'm now only the third best David in the world. Still, I can hardly blame David with a period for that. That blame is squarely on the other two dudes who had lots of time to misspend. And by blame I mean congratulations! Probably. I don't know, I'm still petty enough to mention this sort of thing in my review. I'll get back to you.  Anyway, David: I had fun and if it looks like your kind of thing, I'd say it's now a pretty good deal for what's offered.",
            "review_score": "1"
        },
        {
            "review_text": "David. is a cute little game about a small cube named David. If you want to skip the lengthy part of my review and go straight to the pros and cons, you can find them below.  There isn't much of a story here. You're playing as the cute cube David who is destined to obliterate evil and destroy sin. To be able to do that a mysterious entity (which also narrates the game (intro and outro)) grants David a special power with which he may defeat the evils of the world.   The game is comprised of several levels you have to beat before going to the final boss, Sin. Every stage features a different kind of enemy/enemies or presents a different kind of challenge through enemy behaviour, environment or David himself.  There's always two difficulties for each level - 'okay' and 'very'. Okay-difficulty has you pitted against the misshapen geometry monsters with six hitpoints, so you may get hit five times before dying which makes the game a whole lot easier. Very-difficulty however strips these hitpoints from you, effectively making you a onehit-target. This makes the game far more challenging. Especially the end boss battle against Sin takes some time before you can defeat it with only one hitpoint.  Gameplay wise the game's pretty simplistic but good. You can move up, down, left and right, you can click to charge your power and aim somewhere to slingshot it in that direction. Your power will then come back to you so you may do it again. Charging your power slows time which is essential for beating the whole game on 'very'. It's a nice game mechanic that I like. The controls are responsive, the game runs well, no bugs, no crashes.  The music of the game is quite relaxing, even though the game itself can get pretty stressful. Although you might not hear a lot of the music because you're probably busy slowing time so you can plan your next move. That's what happened to me at least.  And there's not much to say about the game other than the above. Oh yes. It has hats in it. As a little reward for doing things. And a little secret.  So, go to the pros and cons:  Pros:  + responsive controls, no crashes or performance issues + challenging gameplay + a lot of different challenges + relaxing music + the game's just cute and simplistic + Steam achievements (once you start trying to get them you wanna have 'em all) + hats!  Cons:  - it's a very short game (after 2.5 hours or so I unlocked every achievement) - if you're bad at skill-based games like this you will indulge in pure rage sometimes - nothing more, it's just short  Would I recommend this game? Yes. It's a good 2-3 hours of fun. The price tag is a bit heavy though. Five bucks is a bit much to ask for a game that only lasts for a couple hours. So get it while the special promotion offer lasts or wait for a sale before you buy it unless you're extremely into this kind of game and wanna have it NOW.",
            "review_score": "1"
        },
        {
            "review_text": "David is a small, hollowed out square, with a special power. David contains several little ovals, which he can fling at enemies. He has been tasked with fighting and destroying evil, which he does by destroying 12 (very large) bosses. Presumably David's story is based on the biblical David, as you are a tiny hero taking on humongous foes, and the developer is quite clearly Christian (in addition to fighting sin, Jesus is the first thanked in his acknowledgements).  The boss fights are fast-paced and frantic. They're also very challenging and often frustrating when playing on the high difficulty (which you have to do, in order to get to the final boss). After playing the first boss, you'd be forgiven for thinking that the game will become repetitive quickly, and while this is true to a certain extent, the bosses in David are actually fairly original and varied. There are an impressive array of novelties that make each boss fight unique and feel fresh. For example, in one of the bonus boss fights, your ellipsoidal ammunition no longer follows you, meaning you have to go to it, and fire it from where it lies. Little variations like this really keep the game fun.  The downside is that this game is extremely short. Even with the arena mode, I would not expect more than a few hours. Five dollars is not an unreasonable asking price for something so different from the usual fare, but if you're uncertain, you can pick it up on sale. It is worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "The game seems fun enough but the control scheme doesnt seem like it was designed with the thought of someone using a mouse and keyboard. You will become frustrated very quickly at how floaty they are and also how unintuitive moving your mouse back to David to shoot again is.   I would give this game a 5/10 simply because of the controls.",
            "review_score": "-1"
        },
        {
            "review_text": "  Before I start this review, Thanks Michael. I really appreciate getting the chance to play games in general, even if it sounds kinda cheesy but I really appreciate being able to play games I normally wouldn't think about picking up that are phenomonal(I'd regret it, although technically I wouldn't of known... I'd still regret it some how xD)  TLDR; An amazing unique bullethell-like game with a simple style and tight mechanics that brings a very unique experience as well as a challenging one. Just play in windowed mode and you'll be good! I highly suggest this game to anyone who seems interested!  So, I don't really know what to call this game... I'm going to try though. To me, it feels like a very unique bullethell with physics and neat mechanics. Theres not much else to it, but the uniqueness stems off its slow down mechanic. The slow down mechanic allows you to aim and shoot, however it comes with a negative as well. Whenever you shoot, you'll be brought back to slightly faster speed than before, leaving you a little vulnerable for a short moment. The games gameplay overall is just this specifically, but with different unique 'bosses' that have different things going on in each level, as well as neat ways to beat them.  Pros:    - Fun and definitely a unique experience   - Easy to pick up, hard to fully understand/master   - Amazing game mechanics that I haven't seen before in any other game. Its pretty genius to be honest.   - Simple and easy to look at  Cons:   - A bit buggy at times, although fixable if you just look in discussion.   - Although the game mechanics are amazing, I feel as if one or two levels were just too tedious, and were pretty disorienting.  Overall David. is a great game thats easy to pick up, fun to play and brings a pretty unique gaming experience for a really low price. It has some issues with some bugs(just play windowed mode) and well, some levels are a little disorienting(one I can think off the top of my head). This is a really unique game thats super fun to play. I had a blast playing this basically the whole time(Which... never really happens for me).",
            "review_score": "1"
        },
        {
            "review_text": "Heres my opinion on David. It took me 2 hours to 100% this game, all achivements. I enjoyed about 80% of that time, there were times where it was very tedious, for example, the arena achivement. But the art was fantastic, 60 fps no problem, physics can take some time to get used to, but once mastered are good, and the music was very zenlike, yet also exciting, and fun to listen to. I certainly recomend you buy this game, even at $5.",
            "review_score": "1"
        },
        {
            "review_text": "  David. is an interesting physics based platformer, with abstract and minimalist graphics. You play as a cubed named David. who must defeat some evil based on a very, very brief backstory given to you in the intro that teaches you how to play.  The game is pretty straight forward. You’re a cube, you use WASD to move and jump, and you have little “orbs” that float around you that are your projectiles. You left click near your cube, and then move the cursor towards enemies and release to fire them, and while doing so the game time slows down. Each projectile is independent and will bounce of some obstacles and you are unable to fire again until they return to you similar to a boomerang. Interestingly you don’t need to wait for all of them to return, so you can instead fire just the few that have come back to you so you have no down time while waiting for all of them. Sometimes it’s beneficial to fire the few you have to get enemies away, other times it’s best to wait and fire the whole salvo at once so you can clear more enemies at a time.   There are 13 levels plus a final boss level for you to fight through. Each level is different from the last, and keeps you on your toes. Some levels are easy and fun, and one or two are frustratingly hard; but the variety in such a simple game is impressive. An example being in one level there is water and the enemy blocks are under it. You can go down into the water, but your projectiles can’t, so you have to lure the enemy out and kill it from above. Another level has you trying not to touch the sides while you run from an enemy, as you don’t start with your projectiles in that level and must retrieve them. There are also two difficulties, “Okay” and “Very”, the difference being in Okay you can take a few hits, and in Very you only have one hitpoint, so being touched at all will kill you. Each level and difficulty also tracks your times on a global leader board which adds a bit of a competitive element if you so choose.   Aside from the main levels, there’s also an Arena where you have to survive as long as you can against various spawning enemies. Each enemy you kill nets you a point which you can use to upgrade David. in arena mode. The upgrades are more health, more projectiles, a shield, and two different abilities one being a “blink” where you can teleport short distances.  The game isn’t terribly long, and I beat the game to 100% achievement in two and a half hours. It’s both fun and annoying to play through, but if you’re an achievement hunter or completionist it’s certainly a game worth picking up. The developer also added in two secrets to find in the game that take you to bonus rooms that are kind of silly. My only gripe with the game is the lack of a pause option. Pressing Esc while in a level instantly returns you to the main menu, and I found myself doing this a lot (especially in Arena since it lasts a bit longer than the regular levels).   Pros     Fun and interesting mechanics    Despite the short length lots of variety in the level design    Easy to complete    Arena mode to change the pace    Secrets    Cons     No pause option    Game is short and offers little replayability once finished    All in all it’s a fun little game. Aside from cursing one level on the harder difficulty (and lack of pausing) I enjoyed the game and think it’s a great addition to your library for 1.99, or less on a sale. Despite that I was given this for free from the developer, I still think the game is worth the price tag, and had full intentions on picking it up after I played their newer game SPINGUN. If you like indie games with cool mechanics, try David..",
            "review_score": "1"
        },
        {
            "review_text": "Short, strange evolution of the twin-stick shooter format: one hand moves/leaps, the other is aiming your 'mass' to fire at enemies, because you have a boomeranging chunk of yourself you fling around as a weapon. It's sort of like a physics-inspired platformer with the move/fight balance of a TSS.  The above has already probably said whether you want to play this or not. It's good at what it does, it just does nothing amazing.",
            "review_score": "1"
        },
        {
            "review_text": "A really cool indie game made with Gamemaker studio. It's kind of a platformer where you control this box that has the ability to shoot a stream of stuff at enemies to kill them. There aren't so many levels but each is a challenge especially on the harder difficulty. It's a playable well-made little game.",
            "review_score": "1"
        },
        {
            "review_text": "The price drop finally happened (neat to know Valve enforces rules to prevent bait-and-switch launch prices still) so I've decided to update. It's still not amazing, but the game works well enough to be a good value. It grew on me a bit, and the promises of more content should improve things, but it's surprisingly short and easy once accustomed to the game.  David is a series of boss-rooms, contrary to my expectations. There is no real story, limited tactics, and not much replayability in the bosses. The particle shot system made me expect strategy on kills to gain particles, but nothing happens like that. Click-and-hold to charge, release to fire the particles in range. The only real tactical element is timing so that particles rebound into your range. Jumping is more like floating, and can be repeated infinitely to fly. With gameplay being the core, it could be better and more strategic. The awkward physics system driving everything means that dead enemies can still hit you for damage, and the biggest threats are the accelerating enemies offscreen.  The game is fairly short, and I have completed everything so far in around 2 hours. A fair amount of that time was adjusting to the controls, learning how to handle the physics and slowmo. I really don't like the comparisons to Shadow of Colossus. That game had personality to the bosses and stunning environments to tell a story. David is decent as a short game, but this is not a classic. David is Mega Man without the adventure areas or upgrades. Beyond price, my remaining criticism is that the game is not unique nor impressive. I purchased on a whim, and it's decent enough for that. It's not a game I'd mention to friends, but I can't really criticize the value anymore. If you are truly interested, the game is a good deal now. 50% off for 1.00USD recommended.",
            "review_score": "1"
        },
        {
            "review_text": "'David.'  A cute little game that feels more arcadey than most. The principle is simple; slingshot your orby things at anything that moves, and avoid anything you can. There is of course plenty of variation on the theme, as no two levels are alike, but that remains the heart and core of it.  I heartily recommend this game to anyone who ever enjoyed the classic Asteroids or any softcore bullet hell shooters, or to anyone who wished Thomas Was Alone had more shooty action. 'David' is short but sweet and slightly challenging, like a sundae that makes you work for the flavour, with enough charm to add sprinkles to that metaphor.  Had I encountered this game as a child, I would've lost hours to it with fascination and frustration and gratification to show for it. Having encountered it today, I spent just over one hour, and feel quite satisfied. If not for yourself, grab it for the kids. But mostly for yourself.  Oh, and if you're still not convinced: there's hats.",
            "review_score": "1"
        },
        {
            "review_text": "David. is a very unique and interesting game. It has a very different style of play than anything I've ever seen before and it somehow makes playing as a little square fighting against big geometric shapes exciting and fun.  The game has you playing as a little square named David, and as this square you have to defeat a whole bunch of big geometric monsters that chase after you, shoot you, and jump on you. You accomplish this with a slingshot like weapon you are given in the intro, you use it by clicking and holding in a circle around David, letting it charge up, then releasing your click while it is aimed at where you desire to shoot and it sends these little oval ball projectiles wherever your mouse was aimed. After you shoot though, you have to make sure to let the projectiles go back into your circle otherwise they will not fire. And during the entire time you are holding your click, the game goes slow motion.  The game is somewhat aestetically pleasing, depending on your opinion of how geometric shapes look. It also has some nice music to set a certain mood while you are in a level, sort of pumping you up as it like a challenge themed music. Overall I like the music, but It's not like It's a soundtrack or anything, it is just little bits of music for the levels to further set the mood of the challenge.  Overall I like the game in almost all aspects, the only con I give to it is the playstyle. While I love the playstyle, it is also a con for me as the playstyle is basically you keeping the game in slow-motion all the time to stay alive. This is not something that can neccessarily be fixed as It's really hard to stay alive without being in slow-motion 90% of the time. This is the only problem I can think of with this game, everything else is spot on for its price.  I have played the game completely throughout, beating every level on both difficulties and getting all the achievements other than the achievement for reaching 100 in the Arena. From this amount of time I put into this game, I can easily tell you that it is worth it, I got the game for $1 on Steam and it has given me 3.5 hours of fun, and will be giving me more as I continue to try and get to 100 in Arena, and even now that the game is $1.99 on Steam it is still worth it. This game is perfectly priced as It's only $2 and still gives you at the very least an hour of fun on it. As long as the game looks interesting to you and you have a bit of money floating around in your steam wallet, I highly reccommend purchasing this game.  Plus, hats.  This is my first real review of a game, please tell me what you think of it. Thank you and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Its a simple game, charming really. But you find out, even at the first level, that the game is anything but easy. I like tough games, but this one was brutal. I'm giving this an 8/10 since the dev didn't shy away from difficulty AT ALL.  The controls feel a little weird, but whatcha gonna do?  It was on sale for $1, definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The controls are ment for a mobile game, they dont work well with keyboard and mouse.",
            "review_score": "-1"
        },
        {
            "review_text": "In the span of an hour, I ripped through David. and saw every little oddity and battle offered. For many games I've played, it's a depressing detriment, and I crave more, but somehow the makers found a way to cram enjoyment and challenge without ever overstaying their welcome. Polished, gorgeous, and simple, and with a buttload of variety.   The boss rush style set up can be make or break, but David. captures the excitement of high production fights with simple, genuinely fun boss fights that always bring something new to the table you have to adapt to. Going in, I played all the matches on the hardest difficulty, making it a one shot kill for me if I messed up or failed. In my humble opinion this is how the game was meant to be played, but regardless, there is a lot of reward to be had when clearing out a particularly difficult boss.   Gameplay wise, you are a square that floats around and can blast the evil triangles away with your giant throbbing balls of light. It takes tact, understanding of the physics and decent aim. That's it. You will die. A lot. Few games do you learn from death so well, so expect a good challenge and a lovely, minimalistic abstract art style. For the miniscule price, David is worth the pennies. It sticks with you well after you finish, even though it doesn't have anything in particular to say. The music's also wonderful, so if you're looking for a great game that's off the beaten path, look no further.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game and very unique mechanics. Loved it",
            "review_score": "1"
        },
        {
            "review_text": "it took me about 1.5 hours to complete this game -definitly worth 1.99!great game!",
            "review_score": "1"
        },
        {
            "review_text": "I mainly bought this game because my real name is David. Once I actually played the game I quickly found out that it isn't easy. Looks great and everything about it is awesome but if you get mad easily and tend to rage quit, good luck with this game!",
            "review_score": "1"
        },
        {
            "review_text": "Sad to say: this game is no good. The game has a few levels, all of which consist of a bad guy. Whom you shoot. Over and over. Until he's dead. I've played more in depth platformer games on any ol' flash game website.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite quirky, definitely worth the $1. Good game, David.",
            "review_score": "1"
        },
        {
            "review_text": "It's short fun cheep and posible to 100% if thats your kind of thing",
            "review_score": "1"
        },
        {
            "review_text": "the level of difficulty of this game is very hard,but the control is bad and an tutorial of its control less",
            "review_score": "-1"
        },
        {
            "review_text": "great fun for the price. quite short but great experience. took me almost 5 hours to complete every level on 'very'(hard).",
            "review_score": "1"
        },
        {
            "review_text": "It has very interesting physics and an interesting combat system. Definetly worth it for 2 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "It's alright",
            "review_score": "1"
        },
        {
            "review_text": "It's like a frustration platformer if you took all the satisfying bits out. It's equally frustrating when you lose and when you win.",
            "review_score": "-1"
        },
        {
            "review_text": "nice little game, thanks friend :D",
            "review_score": "1"
        },
        {
            "review_text": "cancerous",
            "review_score": "-1"
        },
        {
            "review_text": "The name of this game is David. My name is David. Nothing more to say, really...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "After 10 minutes, I feel like I've seen all this game has to offer - and I don't care much for it.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game only because my name is David but it sucks. Even Indian movie David is better than this garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of time with mouse and keyboard. Impossible to try and play, never consistent controls.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game so I could play with myself. 10/10 would play with myself again",
            "review_score": "1"
        },
        {
            "review_text": "Short game. Pretty fun. You get what ya pay for. A .99 cent game.",
            "review_score": "1"
        },
        {
            "review_text": "My name is David. So it makes the fun and experience better than you none-davids. poor you. GREAT GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Great game loved it!",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game, stuffed full of very interesting mechanics. It's short and sweet without any dull moments or fights.   However, I don't think it would be worthwhile at full price - I've managed to get everything but the kinda-grindy achievement in just a couple of hours, and I could probably get that last one in another hour of playing.  That being said, if you want something small and perfect this is great.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very interesting combat mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Very bad controls, don't even worth 1$.",
            "review_score": "-1"
        },
        {
            "review_text": "This game proved to me that looks can be deceiving. Originally I bought this game because I had some extra cash my way, and I thought to myself, “Why not get it? It has your name anyway.” After playing for half an hour I was hooked. The levels are fun to go through, and the hard modes were addicting. It’s a nice ‘break game’ for anyone, whether you like the flow of arcade-styled games or not. Definitely recommend giving this game a shot. ",
            "review_score": "1"
        },
        {
            "review_text": "Its got my name, it also took a couple hours of my life. Enjoyed it. makes you feel really good when you jump miles high and shoot a enemy. 9/10 for its price.",
            "review_score": "1"
        },
        {
            "review_text": "Warning! The challenge in this game is to get the mother - f***ing little thing to move as you want, or indeed do anything predictable at all. If that's your idea of a good time...",
            "review_score": "-1"
        },
        {
            "review_text": "BULLET POINTS!!  +unique game mechanics- you have a 'gift' that makes moving around feel awesome, and allows you to shoot +the controls are super fluid. movement feels very free, and the gift gives you a slow-mo effect while aiming +(SPOILER)   you get a hat    -the gift also gives a slow mo effect while the projectiles are being shot. this feels a bit awkward -it is pretty short (but worth the price)  Verdict: Highly recommended, especially for such a cheap price.",
            "review_score": "1"
        },
        {
            "review_text": "This game takes a single mechanic and explores it in several short action and puzzle-solving scenarios. The game is short, which is the perfect length for what it is trying to accomplish. It's a fun little passion project.",
            "review_score": "1"
        },
        {
            "review_text": "Although short - I enjoyed this game.  I'd like to see multiplayer perhaps :D   Good job either way.",
            "review_score": "1"
        },
        {
            "review_text": "In David, you play as a square and you have to avoid a bunch of other shapes and shoot bits at them. It's kinda hard to explain but it's a fun addictive game. (oh, and it's cheap) 7/10 (really good)",
            "review_score": "1"
        },
        {
            "review_text": "David. is a one-trick platformer—you have your biblical slingshot which you use to sling shot against your foes—but it's a pretty good trick. Controls take some getting used to, at least with keyboard and mouse, but it's a manageable learning curve. Enemies and levels are varied enough in form and tactics to keep the platforming and combat interesting, and there are enough levels and secrets to make the purchase worth the small price. Add in achievements for perfect runs (i.e. taking no damage), leaderboards for speedrunning, and an endless Arena challenge mode, and there's enough to keep you playing past the first run through.",
            "review_score": "1"
        },
        {
            "review_text": "David is a perfect example of why I love Steam Sales. ~$1 for amazing little indie games that someone/people poured their heart and soul into!   David is another one of those amazing finds.   Despite looking fairly harmless, there is a surprising amount of skill required to beat some of the levels on hard. It also does a fantastic job of showing how much better you’re getting and subtly teaching you. At the start of the game, I thought there would be no way I could beat the ‘very’ stages in order to get to the end but after playing the stage where your orbs are stranded about, I managed to figure out how to aim them based off their orbit around the ‘firing zone’. From there the game only got more rewarding as I practiced time shots looking at both the target and the orbs.   The Atari/polygonal style, the atmosphere, the sound effects, the retro music the simple yet interpretable story!  I’ve only spent a little time with David but it was a blast, and there’s still an endless mode and few levels left to beat on Very!",
            "review_score": "1"
        },
        {
            "review_text": "Very hard to control and i cant turn off full-screen.",
            "review_score": "-1"
        }
    ]
}