{
    "app_id": 346200,
    "name": "Drew and the Floating Labyrinth",
    "release_date": "2015-02-04",
    "developer": [
        "Dust Scratch Games"
    ],
    "publisher": [
        "Dust Scratch Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 26,
    "negative_ratings": 22,
    "price": 3.99,
    "description": "&quot;I just want to go home...&quot; A hand-drawn 3D puzzle-platformer. Control Drew find her way back home, through a series of abstract levels requiring you to find invisible paths, gaining color to her black-and-white character as you progress. Featuring unrestricted 2D animation in a 3D environment.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346200/header.jpg?t=1447368086",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 8.1 or later, 32-bit or 64-bit Processor: Intel Core 2 Duo Memory: 2 GB RAM Graphics: Intel HD Graphics 3000 DirectX: Version 9.0 Storage: 2400 MB available space Additional Notes: Supports keyboard only, keyboard and mouse, or game controller input.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well....  It's a fairly interesting puzzle platform game (yes, platform, not platformer). If you think you would enjoy a puzzle game in which you are trying to use clues to traverse a path of blocks, I do recommend it. I enjoyed it, with the exception of one of the levels which had absolutely no way to 'solve' it without simply doing trial-and-error and falling again and again.  That brings me to the first complaint I had. The companion Drew has helping her through this puzzle space is very willing to tell you the advice for the current sequence of stages. The first time he says 'shadows can tell you something about your surroundings' [slightly paraphrased], it's helpful... the eighth time he says the same thing, I started having flashbacks to Zelda OOT's Navi 'Hey Listen!'. This could be solved by putting an option to turn off the random 'help' in the options, but the option screen is somewhat bare, with no option to turn off the repetitive comments.  My second issue: Its length. This game is very short. I completed the whole game blind [no previous information] in 90 minutes, which is actually much shorter than how long it took to download the game (how is this game so big and so short?). Anyway, that's really just a minor issue in my book, but I figure I should mention it just in case it's important to you.  My third issue: Every time you finish a level, which in some cases can be &lt;15 seconds, it sends you back to the level selection screen. This seems fairly redundant, as unless you want to skip levels (and make the game even shorter!), you'll just be going to the next level. It makes the game feel less like a contiguous story and more like a free flash game you would play online.  Again, I do recommend it, as long as you're in the target audience. The first and third issues above could theoretically be fixed by a small patch. The second could make-or-break-it for you, but I find length less important than other issues.",
            "review_score": "1"
        },
        {
            "review_text": "„Drew“ is a charming little game. The art style is very basic but 1) functional and b) extreme neat and lovely. The puzzles have all the same goal to find a way from point beginning to end. But the puzzles change every few level, become more difficult and challenging. The gameplay is basic but well made.  There is not a lot of story and it is only revealed very slowly and remains open to (huge) interpretation.  Overall a neat little game that can be beaten within two hours.  7,99 € seems to me a bit of a harsh pricing. I got it in a bundle and if so or bought while it is in sale it is definitely worth it.  ",
            "review_score": "1"
        },
        {
            "review_text": "A simple, if somewhat melancholy puzzle-platformer. Graphics are cute, but atmosphere is depressing. I don't mind the mildly unique gameplay, even though it's a fairly easy game. The story however is what probably makes it hard for me to recommend the game. It's not a bad game, it's just bland with no real challenge or engrossing story.  If you don't mind a sad story couple with a short game, then go for it, however it doesn't warrant a full price in my opinion, get it on sale - I ONLY recommend it if you can pick it up for a few $, and even then it's not going to excite you.",
            "review_score": "-1"
        }
    ]
}