{
    "app_id": 346550,
    "name": "Cylne",
    "release_date": "2015-03-05",
    "developer": [
        "Cylne"
    ],
    "publisher": [
        "Cylne"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Exploration"
    ],
    "achievements": 0,
    "positive_ratings": 30,
    "negative_ratings": 31,
    "price": 5.99,
    "description": "Cylne is a first person surreal exploration game having a poetic and philosophical side. Explore and feel unreal worlds filled with environmental enigmas to try to achieve the chapter called &quot;The Choice&quot;...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346550/header.jpg?t=1538727865",
    "minimum_requirements": "OS: Windows XP SP3 or Vista Processor: 2.0+ GHz dual-core processor Memory: 2 GB RAM Graphics: NVIDIA 8800 (SM3-compatible video card) DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: 3,10 GHz Intel Core i5 3450 Memory: 4 GB RAM Graphics: NVIDIA GTX 560 or higher DirectX: Version 9.0c Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "always confusing, always beautiful, mildly difficult at times. not exactly sure what the prometheus level was about, it seemed unfinished. oh and the jump function is utterly useless, not that you need it. all in all though, the devs put a lot of effort into the design.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. I kick back after a long day, open a random chapter, and my mind completely melts because I have no idea what's going on and don't really feel the need to know, either. There's a lot of emotion tied into the environment, and you really have to feel the game out for yourself to enjoy it.  One thing though, devs....am I supposed to get stuck in Chapter 4? I get up on this walkway, zoom through a wind tunnel, and the camera pans behind me ... then I get indefinitely stuck until I quit to the main menu. Pretty sure that's a bug.",
            "review_score": "1"
        },
        {
            "review_text": "My only thoughts....  WHAT?!? As in... What the ♥♥♥♥!?  This game is butiful, but mysterious. please explain it to me becaust i dont know. ",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking an experience lacking purpose, context, or calories. This is your game.",
            "review_score": "-1"
        }
    ]
}