{
    "app_id": 346730,
    "name": "GOCCO OF WAR",
    "release_date": "2015-11-17",
    "developer": [
        "peakvox",
        "O-TWO inc."
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Casual",
        "Action"
    ],
    "achievements": 44,
    "positive_ratings": 829,
    "negative_ratings": 106,
    "price": 14.99,
    "description": "Welcome to Gocco Studio Japan, a futuristic playground where kids come together to play make-believe war — a tradition started almost a hundred years ago. Up to 32 people can join a lobby, and up to 8 players can join up to take on quests.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346730/header.jpg?t=1554706109",
    "minimum_requirements": "OS: Windows7 / Windows8 / Windows10 (64-Bit / 32-Bit) Processor: Intel® Core™ i3-530 @ 2.93 GHz or Better Memory: 2 GB RAM Graphics: NVIDIA® GeForce® GT 640 or Better DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DirectX®-compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A cute anime chibi style game that I figure encourage interaction with players from all around. It allows an 'Online' or 'Offline' choice for you to play within, playing offline would occasionally allow AI bots to help you during missions while online doesn't due to the fact you can ask people to help you. There are around 20 story quests and 2EX quests, giving it 22 quests in total. Each quest has 3 difficulties--Easy, Medium, and Hard. The game has a good amount of customization for your character and a large range of costumes you can craft. The game has both melee and range weapons, however range weapons would be used most of the time in my opinion. The community is extremely friendly, one of the best I seen, you basically can ask anyone inside the community and they'll help you on quests and such.  The game isn't fully done, I have read some of the developers comments and shown that the game will continue to expand with everything. So overall, i'm really looking forward to the future of this game, hoping the community and game will grow much larger.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game to anyone that likes 3rd person shooters combined with anime style chibi characters. As for cost vs. gameplay time, you will definitely get your moneys and more.  The gameplay is basic, there arent many things you have to memorize which i think is a great thing and wgich keeps the game simple. The game has an 'mmo feel' to it, but is not one. You are placed into a hub where you can accept quests, craft, and purchase items. There is no story, you go to an NPC, grab a quest, do said quest, and earn rewards. And that is it, you can also repeat quests on same or higher difficulties to earn gold.    Combat gameplay is fun, not the greatest, but is solid. Although it does feel a bit sluggish, possibly due to the 30fps lock(?), but nonetheless still playable. Controller is recommended to play this game. Im a mouse and keyboard person, but the game feels better for controller.  ***The keyboard and mouse controls have been updated. It feels much more smoother now and there is no drag when aiming with the mouse. I now suggest using the keyboard and mouse for playing instead of controller :) ***    Now for the good stuff, where I feel the game shines is its character customization. The crafting system is excellent. With the materials you have gathered you can discover and make new outfits, head, body, and legs. Also, you can upgrade your weapons and make them more powerful. Lastly you can earn things called badges which give you stats, as far as i can tell the stats are random so there is much fun in trying to find the perfect one.  Downside which may be a turnoff for some is the 'air' mechanic. Shooting/slashing and doging use up air, so think of it as ammo and stamina combined. As you drain your air meter you either have to let it recharge by not shooting or dodging for a few seconds or pick up air orbs. But there are badges which give you increased air and air recovery so this mechanic is a little less frustrating.     Another turn off to some is that quests have a time limit, currently at 15 minutes. Now i hate time limits myself, the feeling of being pushed is not fun, but in this game it is bearable...and doable. You do get a bit of time back by clearing monsters out in a given area. If it werent for the other good things this game offers this would have been a deal breaker for me, so do keep this in mind.  ***this has been updated, the devs have added about 10-15 minutes to all missions. The quests are much more bearable now for solo play and hard mode solo play***    And last downside is there is no local co-op. Only one person can play at a computer, but is multiplayer capable by joining online game rooms and joining up with others to complete quests.  Overall this game is excellent and one of a kind. If you have an interest in this game, dont hesitate to buy it, you wont regret it. I hope my review is thorough and helps you decide if you want to buy the game or not :)",
            "review_score": "1"
        },
        {
            "review_text": "A fun Third Person Shooter with cute art that never gets dull. The customization aspect where you can buy and craft clothing with which you can dress up your character is great. You can also build your character's stats with equips and weapon upgrades. It's these things that keep a shooter from being pointless.  I hope to see more character customization options, clothes, and quests in future updates! :)",
            "review_score": "1"
        },
        {
            "review_text": "Rarely anyone plays this game... The game looks promising, and the gameplay is fun, but, Its heavily multiplayer based and because its heavily multiplayer based, its kind of boring",
            "review_score": "-1"
        },
        {
            "review_text": "Step 1: Download  Step 2: Afk in lobby  Step 3: Profit",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, but the online is very dead. I wish people would give it a chance.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun,cute and really interesting it have few problems but thay will fix it also the anime style of this game make all anime fan to play this I shound give it a try if you don't like that you can't always get your money back",
            "review_score": "1"
        },
        {
            "review_text": "It's a great fun game for people who love anime and chibi characters.",
            "review_score": "1"
        },
        {
            "review_text": "Gocco of war is an awesome cutesy anime shooter, where you play in a simulated virtual world and complete quests. The goal of the game is all about grinding, you have to get new weapons, upgrades, new materials, and most importantly, clothes. There's a huge amount of cosmetics you can get, around 200+. The grinding isn't boring though, because it's challenging. The game is a lot harder then it looks. Fun gameplay, cute characters and visuals, enough to do to keep you satisfied for a long time. If you're an achievement hunter like me, you will spend many hours in this game. The only downside it has is that there could be more quests, and maybe more info on badges and on how to upgrade stuff. The music could be more varied too. No other downside except for that, this would make a great mmorpg too. 9.5/10, one of my new favourites.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed Gocco of war!It has that Nintendo vibe to it that takes me back to those days of playing Mario Party 3 for the N64.  Long story short,its a really fun and enjoyable game everyone should have!  10/10  btw id reccomend getting it on a sale since its 50% off then",
            "review_score": "1"
        },
        {
            "review_text": "The game is cute and fun, however, there is little to no player online (in Australia anyway). This is crucial since the game advertised itself as an multiplayers game with a lot of interaction with other players and friendship etc.  The game itself is ok-ish, it has everything you would expected in an mmo game (quests and grinding etc.). It can be fun and itneresting sometime. The art design is cute and anime style.  6/10, if there is more players then 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "when i saw it i thought it was a chibbi anime mmo type game with a nintendo wii-u kinda feel to it and was deebating for a whole hour to get this or mugen souls since their both on sale at close prices and i felt like getting something with competativeso i those this and was dissapointed to find out that its a kids game about playing make belief with waterguns it was a waist of my money and i feel stupid. if your someone like me and think oh its an online anime style game i wanna get it tred carefully cause its not what your looking for again kids game",
            "review_score": "-1"
        },
        {
            "review_text": "it's pretty boring tbh",
            "review_score": "-1"
        },
        {
            "review_text": "Cant stop playing! D;  Pros:  1.chibi  2.many weapon and equipment to get when using mats to mix  Cons:  Never ending fun!",
            "review_score": "1"
        },
        {
            "review_text": "Basically 3D TinierMe",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and cute with lots of character customization options. I recommend controller but my friend says mouse and keyboard works fine too. Only thing for me is I'll start randomly slowing down or speeding up while everything around me stays constant.",
            "review_score": "1"
        }
    ]
}