{
    "app_id": 346810,
    "name": "Marble Age",
    "release_date": "2015-03-04",
    "developer": [
        "Clarus Victoria"
    ],
    "publisher": [
        "Clarus Victoria"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Simulation"
    ],
    "achievements": 19,
    "positive_ratings": 453,
    "negative_ratings": 86,
    "price": 4.79,
    "description": "Turn-based historical simulation strategy. Develop the Greek civilization from the small village to the great city-state when it will dominate the world!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346810/header.jpg?t=1480355118",
    "minimum_requirements": "OS: Windows XP + Processor: 2.33GHz or faster x86-compatible processor or Intel Atom™ 1.6GHz or faster processor for netbook class devices Memory: 1 GB RAM Graphics: 1280x720 minimum resolution, most cards (check compatibility in Additional Notes) Storage: 100 MB available space Additional Notes: Check your graphic card compatibility here: <a href=\"https://steamcommunity.com/linkfilter/?url=http://helpx.adobe.com/x-productkb/multi/stage3d-unsupported-chipsets-drivers-flash.html\" target=\"_blank\" rel=\"noopener\"  >http://helpx.adobe.com/x-productkb/multi/stage3d-unsupported-chipsets-drivers-flash.html",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a flash game. Don't get me wrong it is good, but before you buy it try the game for free on  Kongregate.com.  Alot of the cheaper games on steam are coming from Kongregate, a free flash gaming platform. This game is more in debth than the flash version, requires low computer needs, and is better than most high quality games (games made by the big companies).",
            "review_score": "1"
        },
        {
            "review_text": "when you feel like civ but don't have the time or the patience.  liked: the game is civ on speed without the boring bits and the translations to english made me laugh sometimes. disliked: replays mostly the same way with the same events, but for $2.50 a bargain and well worth the full purchase price of $5.  someone described it as 'poor mans civ' and while it has a bit of civ feel, it is a totally different game. no real exploring. no units to move around. but there are buildings and science. I've given it way too much time over the last 2 weeks because i have enjoyed it. i'd happily give it a 9/10.   ",
            "review_score": "1"
        },
        {
            "review_text": "Really Interactive Game! I have played the browser Pre-Civilization Games and they are really fun with tons of events. This one has the Persians, Alexander, Romans and more! Honestly they say Sparta is harder than Athens but Sparta is easier for me probally because you start with more citizens. I highly recomend this game. If you cant rack up 5 bucks try the demo! Excuse all my grammar mistakes if there are any.",
            "review_score": "1"
        },
        {
            "review_text": "Sid Sivilization version mini ! Nice graphic tho ! Gameplay is kinda hard to get used to, and there are a lot of effect per turn, btw, 500 turn is max ! Music is fair enough ! Replayable ! 7/9 !",
            "review_score": "1"
        },
        {
            "review_text": "  Public Review on behalf of the Opium Pulses Steam group ",
            "review_score": "1"
        },
        {
            "review_text": "strategically interesting and amusing gameplay",
            "review_score": "1"
        },
        {
            "review_text": "worth the five euros",
            "review_score": "1"
        },
        {
            "review_text": "Decent game, but wait until it's on sale. It's not worth the $6. Probably around $3 or under but overall good game ",
            "review_score": "1"
        },
        {
            "review_text": "THIS  IS SPARTA!!!  Ummm.... I mean, it was a fun game and you can't beat 5 bucks!",
            "review_score": "1"
        },
        {
            "review_text": "Decent game, but wait until it's on sale. It's not worth the $6. Probably around $3 or under but overall good game ",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR 5/10 A 1-track forced development of a civilization. Turn-based exponential clicker game.  5/10? That is not great. Why am I still recommending it? Well--I enjoyed myself for what it was.  As another reviewer warned before I played, this game plays like a clicker game, except turn-based. Like all clicker games, the game goes through obscene levels of growth. The result is that all of the action and growth that were done previously are quickly made irrelevant by the present state of growth.  The first time I played, I layed out a carefully managed plan of my resources. Timed events occurred expecting me to be at a certain level of the growth curve. I failed most of the challenging event (invading civilizations) because I thought that I could play the game at my own pace. Since I conceded each of these overly unfair wars, none of my people died, and I was allowed to continue with a 40% reduction rate of some resource. So, I lasted through half the game until the Huns came in and utterly wiped me out even with conceding the war. During this first playthrough at my own managed pace, the game would feel sorry for me at certain checkpoints. At least 8 different times, the game simply said, 'Your neighbors are progressing well; so you benefit from the collective prosperity. Here is a reward of XX population, XX money, XX culture, XX army.' Literally 4 huge boosts to my present inventories of resources to try to level the playing field for where the game expected me to be.  Like other clicker games, your own army is irrelevant. They participate, grow, and die in wars--but they are only meaningful as 5% of your army strength. Your power comes from allying with neighbors and using their armies (20% of them) through treaty. So, often, your army is your least important resource. (The booster %bonuses to your army are very important, because they apply to your allied army)  Since it is a clicker game but turn-based, growth is mandatory at a certain time pace. You must grow your population as fast as possible. You keep them fed, while boosting 4 other resources--Production, Culture, Gold, with Army mostly irrelevant. The only way to grow those resources is by allocating your population to each of the various tasks, fully changable each turn.  The second playthrough, I knew and could anticipate the non-random pre-timed events. You shift your population into growing whichever resource is more important for the temporary challenge of the time.  The Production resource will purchase booster Buildings for your civilation layed out in a progressive tree of choices (along with a maintence fee to manage from your Gold resource.) Culture will purchase boosters from a progressive Technology tree. Both trees are mostly an illusion of choice. You cannot purchase anything other than 2 or 3 options, and you are forced to purchase the other options soon afterwards. Especially in the Technology tree, you are not allowed to purchase a more important technology from a different branch of study--the game forces you to purchase the remaining options first from earlier availability. So, your only choice is what exact order of purchasing do you make in a forced, linear consumption track.  Many random events occur over the course of the 280-330 turn game. 'Here are some free armies.' 'Here is some free culture.' 'A city was poisoned; XX population die.' In a progressive game, these one time events are manageable and mostly shrugged off as a 1-3 turn delay. However, I just hit mid-game the Starvation problem again. You must have your farmers keep up with your growing population; yet because of the controlled expansion of farmers by the purchased Technology and Buildings, they can be maxed out. So, my population got slightly ahead, with no ability to increase my farmers yet. So, a few people die off and the population returns to an equilibrium of sustainability, right? WRONG !! No joke--0.05% 100/200K of my people starved. So, the game presents 3 punishments: Give up some Culture growth for 10 turns, Spend an exhorbant amount of your Gold balance, OR murder 30% of your population. OK--fine. I took the Culture punishment. However, next turn, the same problem is still there with no ability to rectify the food with increased farmers. Again, 96/200K of my people die. The game forces one of the remaining 2 choices of punishment. So, after a few turns, the game forces you to murder 30% of your population because 0.05% were dying.  This kind of absurdity is the norm for this flawed game. Well, I suppose it is similar to real life. In RL, you planned and managed your resources, got an education, worked hard at a vocation. Guess what? Today, a truck hit you OR you got fingernail cancer. You may not be dead, but which crippling result will you now manage for the rest of your life?  Grow your civilization along the path that the game expected, not much deviation is allowed. Do this, and you will win the full achievements. Almost. Now do it one more time with the other Home city. (Athens or Sparta)  Pay no more than $1.25 on sale for this.",
            "review_score": "1"
        },
        {
            "review_text": "I've put way to many hours into this little game. If you like managing resources and like min-maxing then this is your game. Its a small and simple game at its core but trying to get the best score possible is freakin hell.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to play. I learnt about this game from another game the same developer developed called stone age. I love both games. It's a very exciting math game.",
            "review_score": "1"
        },
        {
            "review_text": "i need to build more farming",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play. it's only 4,24€ atm so why hesitate? if you like what you see in the trailer, buy it. :-) beware of semi-bad english grammar, tho.",
            "review_score": "1"
        },
        {
            "review_text": "301/301 would spartan again.",
            "review_score": "1"
        },
        {
            "review_text": "There's not much I can say about this game, since it's not just essentially, but LITERALLY a glorified flash-game, but I will make an effort at pointing out just how miserably bad it really is.  First of all, the gameplay. Wait... gameplay? I didn't even know this game HAD any gameplay! Yeah, no, to be serious, the essentially only thing you do in this game is to assign/reassign your villagers to different tasks. That's it. No, really, that's it!  Okay, sure, you can 'research' some new 'technologies', but unlike tech-trees in actual games such as Civilization or Endless Space, the ONLY thing the so-called 'technology' in this game does is to raise the amount of villagers you can have, and how many villagers you can assign to specific tasks.  But frankly, that's about as substantial of an addition to the game's overall value as a single, paper-thin slice of cucumber is to a foot-long sub. In other words, none at all.  Then there's the fact that despite the seemingly 'culture neutral' nature of the name, you can ONLY play as the greeks. No foolin'. And unlike certain other greek-centric games, like Master of Olympus: Zeus, you don't get to explore greek myth, culture, legends or hell, even architecture!  No, you pick between Spartans or Athenians, and then depending on which one you picked, you either prepare to go to war against literally every single foreign party you encounter, or ragequit to the main menu and restart as the Spartans after losing 80% of your population after the first raiding party when you're the Athenians.  The insanely poor balance between the two barely even functionally different 'factions' you can play as is laughable at best, and borderline depression-inducingly tragic at worst. Spartans get an invaluable military bonus, and the Athenians get just about bugger-it-up-the-ärse-all by comparison.  Adding insult to insult and injury (that is, twice the insult to once the injury), the game has literally zero replayability. The game-world is STRICTLY pre-determined, down to what foreign parties you encounter, and their so-called 'personalities'.  If you can't have the mind-implodingly vast random-factor complexity of the Civilization series as a whole boasts, then that's fine, but really, if you're going to make us PAY for your shïtty game, then at LEAST give us ANY kind of incentive to play it for more than an hour, and then thank GabeN for the refund policy on Steam, simply because we could play better games literally for free on any flash-games site that's ever existed since before the words 'Call of Duty' was any more than an actual military term. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "i like the game, but i think it is too short if they have expansion, i would recommend it.   however, the concept of the game is good. :) ",
            "review_score": "-1"
        },
        {
            "review_text": "Anything that has strategy, I buy. But this game? This is not strategy.  All you have to do in this game is move the sliders to assign workers and maybe click some stuff during the events which themselves are rare. The technologies which can be researched and the buildings which can be built doesn't do much other than increasing the limit of the sliders.",
            "review_score": "-1"
        },
        {
            "review_text": "What is the best part of gaming? If you answered 'moving sliders”, rejoice! Who needs all those AAA graphical or sound settings screen: with this nifty little game, I can move sliders around all-day long, without having to worry about ruining the planet too much as it won't be taxing my GPU or CPU in any way.  I always thought trying to compute the best frames/second by moving sliders was too taxing for my brain. Problem solved: there is next to zero thinking required in this slider-moving feast.  Let's move my sliders, here comes a breakthrough! I can increase the number above one of my sliders tenfold and move those sliders again, but wait! A bad event! One of my slider has been set back to zero: I will have to move the others around next turn, until everything gets back in order and I get the next upgrade which will increase the numbers above one my sliders tenfold! Unless it is a bad event that set back one of the sliders to zero! And I am sparing you the excitement of having to move some of the sliders (which scale crazily high) to the exact pixel they need to be, or else you'll have to cope with big letters pop-ups telling you are doing it wrong. That's another theme of this  endearing  game: it loves to tell the player how much he is wrong. And what better way to do that than by throwing in predetermined events the player can't do anything about the first time around? Please, enjoy reading the big old dialogue box telling you what you should have been doing all that time, 'doh!'. ... In short: unsatisfying and predictable.",
            "review_score": "-1"
        }
    ]
}