{
    "app_id": 346830,
    "name": "FINAL FANTASY IV: THE AFTER YEARS",
    "release_date": "2015-05-11",
    "developer": [
        "Square Enix"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 12,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "JRPG",
        "Singleplayer"
    ],
    "achievements": 50,
    "positive_ratings": 160,
    "negative_ratings": 96,
    "price": 10.99,
    "description": "Take part in the epic sequel that unfolds nearly two decades after the events of FINAL FANTASY IV. Now enhanced for Windows PC.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346830/header.jpg?t=1547739205",
    "minimum_requirements": "OS: Windows Vista, 7, 8 Processor: Pentium 4 2.4 GHz Memory: 2 GB RAM DirectX: Version 10 Storage: 950 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The official Sequel to the classic Final Fantasy IV (1991) set 17 years after the events in the original game. Originally released on the wii in episodic format. You would play each part or 'tale' following one of the many characters, all of which follow the same story leading to a climax in which everyone will reunite to save the world yet again.   The release on ios &amp; steam was tossed on the cutting board and sadly it loses most of it's charm in the process. Challenge dungeons that ended each tale were removed from this version. Which leaves you very underdeveloped and geared by the time you reach the final chapter. In episodic format they encouraged you to farm until the next tale was released to the public. But instead of adding a fix they just decided to cut them from this version.   The second huge disappointment from the steam release is after playing nearly 30 hours through the 9 character tales. You enter the final stages of the game, In which if you have watched any trailers for the game you will see the many many bosses and optional bosses that the game offered you to challenge. In the original release you could fight 12-15 optional bosses in the final dungeons. Which encouraged you to level your party to max level. Some of those included past final fantasy bosses such as Lich (FF1) Kraken (FF1) even Ultima weapon (FF6). All of these have been removed from the game, leaving the final dungeon quite barren.   A good handful of achievements from this game are also luck based and require you to literally farm for potentially hundreds of hours for items that are obsolete and not necessary since the optional content was all removed.   So even after all that, I leave the game with a positive review only because of the nostalgic strings it pulls, I enjoyed my playthough. But if you want to experience the game in it's entirety I suggest you purchase a copy of Final Fantasy IV The Complete Collection on PSP or Vita.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to say whether I do or don't recommend this game, because it's so  bad  in a lot of ways. However, you'll like this game if:   You like episodic games.   You liked the graphics in the DS remake of FF4.   You unironically enjoy next-gen fanfiction.   The Underground Waterway was your favorite dungeon.   You enjoy the idea of Edward being a political badass.   You hate the idea of Rosa having any sort of agency.   You think it's normal to harbor an unrequited crush for seventeen. Freaking. Years.   You want Golbez to be a playable character.   There are problems. A lot of problems. ...not all of the bullet points up there apply to me! But I personally liked seeing what all the characters were up to seventeen years later, and I liked a lot of the new characters, too. If you're wavering, wait until it goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "While I ultimately recommend this game, be warned. Its a lazy port of the Android version. They edited out many things. Overall, if you were a fan of FFIV, this is worth a play. That being said, the end game is poorly designed. I believe this is in part due to the editing out of many levels of dungeon, but not scaling back the bosses. As a result, you have to do some serious grinding to overcome several of the bosses at the end.   The graphics are meh, but then again, Final Fantasy games are traditionally desired to story and gameplay.  The score is not very original, but then again, this is aimed at FFIV fans so of course they would re-use music for the characters.  There is not much in the way of replayability, however, the game will easily take up 40+ hours.  Overall I'd say a solid 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Although I've only played a small portion of it so far. I am in love with this game. It has that real Final fantasy feel that I personalt felt FF13(the entire series) didn't have. Call me old fashioned but I love it and I recommend it to all FF fans and to everyone who hasnt played Final Fantasy yet.   It's a great way to get into the games &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy at its best.",
            "review_score": "1"
        },
        {
            "review_text": "Been great so far! If you are looking for a great blast from the past, or are hunting for a great piece of nostalga, get this game!",
            "review_score": "1"
        },
        {
            "review_text": "I'd like to consider myself something of a critic in regards to JRPGs, as far too many have stereotypically bland plots, environments, and characters. If you can't tell it apart from its predecessors in regards to gameplay, it's not worth a good review, or any comment for that matter. That's why I had to stick up for this one, especially since FF4, this game's prequel, was markedly less interesting.  For one, the episodic nature of the game (not in the present-day sense of splitting up games needlessly into multiple cashgrabby installments) gives the story surprising depth. Each character is cast as a protagonist in their own 'tale', left to interpret and respond to the overall game's events differently. They have their own strengths, challenges, and settings that make adapting enjoyably difficult. And to make it all worthwhile, in the endgame you can reselect your favorite combinations to take on the final struggles.  The combat system saw a subtle revamp that considerably smoothed gameplay compared to FF4. The newgame+ feature was also buffed enough to give the game actual replay value, and for once you got the refreshing feeling that nothing was truly missable.   Except maybe summons.   It's definitely worth at least a single playthrough anyway, and experience with the first game is not required as many of the main plot points relevant to After Years are covered in cutscenes.",
            "review_score": "1"
        },
        {
            "review_text": "Just like Final Fantasy IV, it is fun. The only downside to me is really the fact how most things are borrowed from FFIV, same/similar bosses, same/similar dungeons and so forth. Some people will complain about a 15FPS cap during battle but really, it doesn't make too much of a difference for me when it is basically just flipping though menus so that is more your opinion there, but overall, it is still good, decent story, music is always good and game mechanics are good.",
            "review_score": "1"
        },
        {
            "review_text": "The game in itself is fun for any classic FF fan, even though it's a terrible phone port. My only real grievances is that I notice several spelling / grammar mistakes that you would have expected to have been picked up by Square's QA team. As well, the music often just stops playing through my gameplay. I'm not sure if it has to do with the game itself or my PC, but it was annoying.  All in all, I recommend this game for any FF fans out there.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing but a cash-in trying to appeal to nostalgia: There is nothing new here, or at least nothing new that matters. The story is nearly identical to the original game, though even well into the final dungeon you have no idea who the antagonist really is.  Other than the introduction of Ceodore and Ursula and some minor characters from FF4 becoming somewhat more important, it's the same crew. And enemies. And bosses. And locations. Well, obviously you would revisit locations, right? It is the same world after all. But after seeing the underground waterway five times, it really hits home how lame this is.  Despite the fact that the game was originally released one episode at a time, there is no plot development until the final chapters, and even then it is limited to a twist-that-isn't-a-twist. Instead, each character's chapter involves them clawing their way from around level 10 to about 30, then in Chapter 10 you find out they're all still horribly underleveled anyway. That's ok though, because only a few of the characters will actually matter.  The one new element to the game is the Lunar Phase system, the cycle of which increases one and decreases one of the four types of actions' effectiveness - attack, white magic, black magic, and special actions (Edge's ninja tricks, Yang's kick, etc.). At first, it seems like this would cause you to think carefully about your strategy depending on what phase the moon is currently in, but since you don't choose your own party until Chapter 10, you always get stuck with a setup that is objectively good or objectively bad. Why would you NOT just sleep through a new moon in Yang's tale, during which your party of nothing but monks has their attack power crippled?  Also, the moon phases affect characters on the moon as well (that's not a spoiler, there's a 'Lunarians tale' chapter). Huh?",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to love this game, but as of now I have to give it a negative review.  I should preface this review with the acknowledgement that I am an avid fan of all the FF games, and FFIV, FFVI and FFX all hold a special place in my heart. I think they are some of the most powerful stories ever told, and some of the most enjoyable and well-made games that I've had the pleasure to dump hours of my life into. I have hardly gone a single year of my life since these games came out without re-playing them. I love them that much.  Which is why I had such high hopes for this game... Unfortunately, it feels too much like a cash-grab by Square-Enix. All the familiar characters are there, all the familiar places, but they didn't bother to come up with a story beyond, 'Hey, you know all the stuff that happened years ago? It's happening again!' Ugh... This would be bearable if it weren't such a *tedious* game to play. Even with auto-battle on and the fastest battle settings, grinding through four or more hours per tale to get, 'Yep, the Tower of Babil is back' is kind of a slap in the face to players. Grinding was acceptable in the original games because one felt a sense of progression. There is a humungous difference between being at level one and level twenty; not so much in this game. Every level up is such a microscopic improvement to your character that you have to gain 25-30 levels to even be competetive against the bosses at the end of each tale (read: not get killed by their first attack). Rydia's tale has been particularly painful to play, as you are not given anyone with the ability to heal, making you rely on potions for dungeons that beat the crap out of you until you are above the mid-twenties in level. This game really feels like a job, which is just sad.",
            "review_score": "-1"
        },
        {
            "review_text": "yeah i bought it but that was a poor decision",
            "review_score": "-1"
        },
        {
            "review_text": "This is essentially a game based around reusing assets. The models are reused, the music is reused, and even parts of the story are directly reused from the original Final Fantasy IV. This really becomes a problem because, while there are a lot interesting game mechanics to explore, there is little reward to continuing forward. The few silver linings (mostly involving Kain) are all buried under a mountain of unneeded 'nostalgia.'  This is a game I keep wanting to finish in spite of it's faults, but I just can't bring myself to do so. There are just so much better games that stand on their own that warrent more attention. This sequel is so focused on reminding you about the original that it ends up destroying it's own potential. What a waste...",
            "review_score": "-1"
        }
    ]
}