{
    "app_id": 346920,
    "name": "Undead Shadows",
    "release_date": "2015-02-02",
    "developer": [
        "Ignition Games Inc."
    ],
    "publisher": [
        "Ignition Games Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 18,
    "negative_ratings": 42,
    "price": 2.79,
    "description": "Undead Shadows is a fast paced action zombie shooter that keeps players on their toes and tests their survival instinct. You are a survivor in the harsh post apocalyptic world looking for any means of survival against never ending waves of zombies from sun up to sun down – and even worse in between.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/346920/header.jpg?t=1447368285",
    "minimum_requirements": "OS: Windows XP or greater with latest service packs installed Processor: Dual-Core Intel or AMD processor @ 2.0 GHZ or better Memory: 3 GB RAM Graphics: nVidia or AMD based video card with 700mb or more video RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP or greater with latest service packs installed Processor: Dual-Core Intel or AMD processor @ 2.8 GHZ or better Memory: 4 GB RAM Graphics: nVidia or AMD based video card with 1GB or more video RAM DirectX: Version 9.0c Network: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "This game could've been something good, but they ♥♥♥♥ed up. Badly.",
            "review_score": "-1"
        },
        {
            "review_text": "so i know what everyone is thinking ( why is this dude playing this god awfull game anyways ?? ) well heres my simple theory and answer to everyone yes some games are generic and yes this is just a generic zombie game but honestly its not that bad if you give it a chance and put some thought into it ( like there are times where developers are inactive but then again you never know tthey might become active again   final jury on my thought 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little game i got for $1 at a game bundle website called groupees.  Decent graphics Excellent framerates Functioning melee combat (this developer actually implemented real melee unlike dayz devs) Actual in-game map that updates as you move around Loot Guns  If this developer makes more progress and goes the survival route i think this could be a very promising game (i dont really like the waves on enemies i would rather have multiplayer survival)",
            "review_score": "1"
        },
        {
            "review_text": "Froze upon initial load screen, then I'm looking at a bunch of ♥♥♥♥♥♥ textured trees. Says 'Push E to Start the Game', so I do so and, for some reason I teleport to a low poly restaurant. That's when I see counter ticking off and realize I'm playing a tower defense game...or something.   Zombies drop money when you kill them. Why? I guess because making money in the usual way that survivl games do things was too complicated. There were a bunch of apples in that restaurant, each worth $100 which you apparently just leave on the shelf for whoever was kind enough to set this one room in a pizza place up with apples.  This game has an identity crisis going on, ♥♥♥♥ graphics, ♥♥♥♥ model animations, and a variety of other issues. Total NOPE. Glad it was in some bundle I bought just for the better games that were in it.",
            "review_score": "-1"
        }
    ]
}