{
    "app_id": 347440,
    "name": "Pneuma: Breath of Life",
    "release_date": "2015-02-27",
    "developer": [
        "Deco Digital",
        "Bevel Studios"
    ],
    "publisher": [
        "Deco Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "VR Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Puzzle"
    ],
    "achievements": 12,
    "positive_ratings": 118,
    "negative_ratings": 51,
    "price": 15.99,
    "description": "Pneuma: Breath of Life forces you to think outside the box through a narrated story of self-discovery, whilst exploring the ontological mystery of the breath of life. Features award winning voice actor 'Jay Britton' as Pneuma.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/347440/header.jpg?t=1457537240",
    "minimum_requirements": "OS: Windows 7 64-bit Processor: Core 2 Duo E6600 / Athlon 64 X2 6400 Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 560 / ATI Radeon HD 5770 DirectX: Version 11 Storage: 12 GB available space Additional Notes: Virtual reality mode not recommended on minimum specs.",
    "recommended_requirements": "OS: Win 7 64bit / Win 8.1 64-bit Processor: Core i7-920 / A8-3870K Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 670 / ATI Radeon R9 280 DirectX: Version 11 Storage: 12 GB available space Additional Notes: GTX 970 or higher recommended for virtual reality mode.",
    "reviews": [
        {
            "review_text": "I recommend it due to its philosophical nature and amazing puzzles. The concept for the puzzles is quite new and interesting, and some puzzles might take you time before solving them. The ending is interesting, with Pneuma struggling the whole game to understand his nature, believing he is a God and that the whole world is his...oh how wrong he was, though in the end he fully understands himself.  Despite enjoying this game a lot, i felt the concept compensates for the length of the game. For 20 euros i would have liked to see more content put into the game (free future dlc would be nice). A little bit of resolution issues, but otherwise, this game is a fun experience, coming close to The Talos Principle, but giving it a much funnier air (however the ideas are totally differrent: Talos Principle is about you choosing between following God or going against his word, while Pneuma is about...i'll let you find out on your own :D - great philosophy in both of the games however).",
            "review_score": "1"
        },
        {
            "review_text": "Playing with the Oculus DK2. Hands down one of the most beautiful games out, that is actually a game. I'm not a hyper puzzle geek with crazy criticism, but an hour in and I'm loving these puzzles, they suit me well. Listening to the narrator is hilarious and has humorous remarks about society and we as people. Worked right out of the box with the dk2, no issues at all, and theres room for tweaking since its built on UE4. It is a beautiful ESCAPE in vr. Definately recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, difficult enough puzzles, good narrative even if Pneuma is a bit annoying I think he is supposed to be.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Suffers some technical problems with lighting and shading.  A little too short and extremely easy. But the ease was not a problem, because the experience was entertaining in every way.   Walkthrough time for me was approx 45min, so it's really short. I tried to play it a few times in a little bit differently, but there is no chance for it. Pity.   I highly recommend anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Overall grade: A-  The game is a very fun, the puzzles are well made, and the changing mechanics keep you on your toes throughout the game. The game also boasts a very beautiful and detailed world, with differing environments and actions that mingle well with the dynamic mechanics of the world. Not to mention the VERY interesting story, and a (metaphorically) EXPLOSIVE ending! (Seriously, the ending is the best part, in my opinion.) And the main story of the game, albeit somewhat short, is not the end of the game's content, as you will soon find out that there are special hidden(ish) puzzles interlocked with the main puzzle.whether or not the price tag for this game is justified is completely up to the user. Personally, I would pay $20 for the game, but I think a price of $15 or maybe $10 would have fit the brief story better.   My PC can be considered extremely average by most, and this game continued to do a number on it for the duration of my playtime. I ran at a maximum of 40 fps, but hovered around 10-20 fps for most of the game. I commonly find myself lowering the graphic settings for other games I play, to accomodate for my less than amazing tech; Pneuma: Breath of Life does not have the ability to do so, or has very little ability to do so. The fact that I stuck around to finish the game and play the puzzles definitely says something about this game.   Get i?: Yes, if you like inventive puzzling and semi-comical narration about the purpose of life and your place in the universe, definitely give it a go.  Edit: while I'm at it, I'd like to nominate this game for a 2016 award! It's certainly deserving of at least one.",
            "review_score": "1"
        },
        {
            "review_text": "At the end you just don't wanna complete it. It's so sad :(",
            "review_score": "1"
        },
        {
            "review_text": "Pneuma: Breath of Life is a wonderful puzzle game. The puzzles are all clever and creative, and they're all set within a pretty world that's a joy to explore. I really don't know what else I can truly say about it. It looks good, it plays well, the puzzles are rewarding and clever -- and what more do you want out of a puzzle game? I feel like I can recommend it to anyone that loves a good puzzler. It's not quite perfect though, but even the downside isn't much to write about.  The biggest problem with the game is the narrator, the protagonist, who talks endlessly. The things he says rarely interesting and they do little more than make you dislike him more and more, little by little. There's an arch to it, surely, but the moment I just put the voice volume down to 0 and turned off the subtitles, suddenly I was exploring a truly wonderful world, without this stream-of-consciousness semi-philosophical blabbering. The game just got better. The other thing is a pretty blatant mistake, which raises pretty big alarms.  In the very tutorial, at the very start of the game, you're asked to interact with a lever. Click and hold, then use W/D to move it --- wait, what? D does nothing. A does nothing. W does nothing. No, it's supposed to be W/S. Backwards and forwards. Easy to figure out, but how does something like this make it through playtesting? Seriously! Anyone testing the game should've found this from the start and it should've been fixed instantly. So really my first impression with the game was 'oh dear, did anybody actually test this before release?'.  Thankfully it was the only real problem I had. A couple of finicky puzzles, sure, but all doable. The one time I actually managed to just 'break' the game was by locking myself in a room by undoing the puzzle I had solved to open the door. I slipped inside, the door closed behind me, and then the puzzle within the room was solved -- but I had to go back. But I couldn't. The door was closed. Oops. Not a big deal since I could just quit to main menu and resume again, which saved me having to backtrack to the little puzzle hub.  All in all, I liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous world. Smart puzzles. Annoying protagonist who tries to hard to be filosophical. Get it during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "The setting is pretty and the puzzles are clever (if not particularly difficult), and their a nice ambiance... that is all but ruined but a constant, annoying, obnoxious voice over that plays over the whole thing. It's enough to make one want to play the game without that audio, though if you did I suppose you wouldn't understand the pseudo-intellectual masturbation session that was the story. Still, the puzzles were pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "2.5 hours of fun and mostly newish concepts for puzzles. Has a slightly annoying narrator and a originalish storyline.   Pick it up in a few months when it goes on sale or appears in a bundle, Too short to justify this price.",
            "review_score": "-1"
        },
        {
            "review_text": "Getting this on sale was great, since I had played it before on a friend's xbox. I would feel that the original price of $20 is a waste of money, but for $5 this was definitely a great way to kill some time. It's a beautiful puzzle game with great narration. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics, bug free, solid puzzles. It's a little short, but I'd rather pay for quality than quantity. The narrator is a bit annoying, but that's really the only bad part.",
            "review_score": "1"
        }
    ]
}