{
    "app_id": 347510,
    "name": "Rats - Time is running out!",
    "release_date": "2015-08-19",
    "developer": [
        "Citeremis Inc."
    ],
    "publisher": [
        "Citeremis Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 244,
    "negative_ratings": 32,
    "price": 3.99,
    "description": "Pressed for time?! Same for this rat, but he can manipulate it! Join RedEyes the Rat on the heist of his life. Sneak into the bank, steal the diamond, evade the guards . . . and then get out! But most of all, be clever, trick time, and take back what’s ours from the Pigs who control all the banks in Swine Island City.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/347510/header.jpg?t=1450711534",
    "minimum_requirements": "OS: Vista/Windows 7/Windows 8 Processor: Pentium IV 1800+ MHz Memory: 2 GB RAM Graphics: 128 Mb Video RAM or better DirectX: Version 9.0c Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a fun puzzler with bundles of cartoonish charm. You play as RedEyes, a kleptomaniacal rat. The aim of each level is to run through the building, nab the diamond and then leg it before the time is up, picking up bonus coins along the way and trying not to get caught whilst doing so.   The game has been well designed and is satisfying to play. I found myself replaying levels over and over to complete all the tasks and get that elusive final gold star, and yet it rarely got tiresome to do so as it can with other timed puzzle games. What helps with this is the fact that the only way to get a 'Game Over' as such is to run out of time, which is when the police arrive (I say police, it's a single grizzly bear in a uniform. A really, really fast bear). Even if you run out of time, if you're close enough to the exit you can still complete the level if you out run the bear. This leniency really helps keep frustration levels down. Getting detected by guards doesn't lead to automatic penalties either - instead you only lose time beating them up if you get caught. Sometimes it's much faster and easier to run to the exit alerting all the guards, resulting in a mad, Benny Hill-type chase through the corridors.   The visual style is nice and cartoony. The animal characters have been well thought out, with funny expressions and sound effects to match. It also has a great soundtrack, which really puts you in the mood for sneaking around in a black polo neck.  The trailer for the game didn't impress me all that much, but I found that the time just flew by when I first started this game up. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Good stuff, some challenging levels and looks pretty long for the price. Try it!",
            "review_score": "1"
        },
        {
            "review_text": "Rats is a really cleverly made little indie title. You only control the movement of one rat attempting to steal stuff and escape the level, so it shouldn't be that difficult. However, the levels get very complicated and tricky as you go deeper into the game with so many things to do in each level that it really does get quite difficult. I like the music too and graphics are alright. Definately worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "This is an Awesome games, Try to play this. It gives you Hype when someone noticed you in the game, time strategic game that will help you smile when your day is bad. Thanks for Everything RATS, and Steam hope i got some more games like this in the future.",
            "review_score": "1"
        },
        {
            "review_text": "The game is so much fun!! What you do is take the diamond and leave the place before the time ends And if you did not leave in time so there's no way you get out of there without getting caught !!! The game's soundtrack is excellent Excellent control Well I have to go before they catch me ... :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of rats and cats and dogs. Play with your controller! Fast paced gameplay. Really good fun!          YouTube™ Video:  RATS: Time is running out - Gold, Keys, Rats and Cops!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Rats is a very fun and original game!I had a lot of fun playing it!  Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": " Received free copy.",
            "review_score": "-1"
        }
    ]
}