{
    "app_id": 347620,
    "name": "Gaokao.Love.100Days",
    "release_date": "2015-05-30",
    "developer": [
        "高考恋爱委员会"
    ],
    "publisher": [
        "NVLMaker"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Visual Novel",
        "Dating Sim",
        "Multiple Endings"
    ],
    "achievements": 30,
    "positive_ratings": 4592,
    "negative_ratings": 215,
    "price": 6.99,
    "description": "Getting a girl-friend before National College Entrance Exam, I know it's crazy, but from today, we will face everything together.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/347620/header.jpg?t=1551269431",
    "minimum_requirements": "OS: WIN7(Recommended)/WIN8/Vista Processor: 1000MHz Memory: 1 GB RAM Graphics: Memory 128Mb DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "So basically, I paid $10 for my own biography. Over the course of the visual novel, I broke up with my girlfriend, failed all the important tests that would determine my future and became a video-game addict. All that's missing is a sub-plot about killing tourists and burying them in the Blue Mountains.",
            "review_score": "1"
        },
        {
            "review_text": "I was so hyped to play this VN. I've never played a Chinese VN before, so that alone was a new experience for me. But I think, like most other people who bought this game, I was most attracted to the idea of the game's sixty-one endings (that's including the ones the free DLC adds). After a couple of lucky coincidences, fate brought this game to my Steam library, and I am happy to be reviewing it today.  So what do I think about this game? Well, let's start at the beginning. I'm very much used to the typical style of visual novel where all you do is pick choices and watch the story unfold. But this is a game about passing a test! Of course you'll have to study for the stupid thing! So the developers added a Tokimeki Memorial-esque system where you can choose your activities for the day in-between other scripted events. These include studying, exercising, talking to friends, equipping items, and sleeping. I don't mind this system all that much, but the randomness adds a level of challenge that I feel at the time of this review may make certain endings almost unattainable without a great deal of luck. (For the record, I did not use the official guide during my first playthrough, although I think it may be necessary to reach some of the endings.)   But what's a dating sim without a story? Turns out the very first thing that happens is that you're tied to a girl named Muxin after 'accidentally' confessing to her. She happily accepts, but both her and the main character (whom I affectionately named Eisen) know that it will be difficult to maintain the relationship when GaoKao is closing in. Eisen unfortunately scored relatively low on the first mock test, and both Eisen and Muxin grew depressed. After breaking up, Eisen became a gaming addict, cutting himself off from the rest of humanity to find acceptance in another world. His friends and family desperately look for him, eventually finding him at a net cafe. Eisen receives the grave news that his mother is in the hospital, and he quickly breaks away from games to finish GaoKao. However, the damage has been done. Eisen not only lost his touch with the ladies, but he scored low on the GaoKao, just barely making it to a low-ranking university. Three months pass, and he finds out Muxin has scored love with someone else. There seems to be no happy ending for poor Eisen... ;_;  And you know what makes that worse? I would have done almost the exact same thing in his shoes. Out of all the variety of canned situations presented in most visual novels, this one has the nerve to read out my future in Chinese academia as Episode 7 of Charlotte. (Obligatory Key reference, check. ;) ) And that's not a bad thing. :P  While the ending I got at the time of this review hit me in the heartstrings, I think the journey there was just as enjoyable, especially concerning Muxin. She's an incredibly sweet character to be around, and seems tailor-made to be the ideal girlfriend. Most people come into this VN after already being dumped IRL at least once; I don't have such a medal of honor. What I can say is that it comes as crushing to see her move further and further apart from me, even after all I did. It's a learning experience, in more ways than one. Whenever I do find myself dating in real life, hopefully I can take something away from this game.  Anyway, on to the technical stuff. For a company that's only put out  one  VN so far, the art style looks very pretty. Every single character is well-drawn, the backgrounds are good, and the CGs are crisp and clear. The game utilizes the KiriKiri engine, a popular commercial engine used for such notable titles as Fate/Stay Night. Perhaps that has something to do with how professional-looking the game is. The UI is clean and user-friendly, the transitions between days and scenes are smooth, and it's capable of many different banner effects. After reading this and F/SN, I can see why people love using the engine so much.   In terms of sound quality, this is where the game starts to falter a bit. The music feels like the kind of music you would listen to while studying: slow, calm and inoffensive to the ears, but not catchy enough to be memorable. The music is by no means bad, but compared to higher-profile VNs (again, citing F/SN and its awesome soundtrack) it can't really work outside the context of the game. The voice acting isn't necessarily bad either; in fact, it fits the characters exceptionally well. I'm no expert on Chinese dialects or social etiquette, but the tone of delivery seems a little off in some situations. The characters seem like they're speaking in indoor voices throughout the entire game. This doesn't hurt the quality of the voice acting since there is a volume slider, but perhaps I'm a bit desensitized by the outlandish, hammy screaming Japanese VAs like to do. :P  Then there's the script... *takes a deep breath to calm nerves*  Although it's still readable, the translation is less than stellar. No offense to the translators, but the usage of English grammar or sentence structure comes off as a little awkward and imprecise. Granted, Chinese is a very difficult language to translate to English, because there are words and phrases that just don't translate well. But quite a few sentences in this game look like they were put into Google Translate and pasted on to the script to save time. I hate being critical, but the script is the most important part of a VN! When a native English reader has to stop reading to think about what the people are actually saying, something's wrong. I'm sure it's something that could be patched, but as it is, the awkwardly-translated dialogue bothers me the most out of anything in this VN.  Something else I noticed about the script...a few terms exclusive to the Japanese language are used in the English script, when the characters say nothing of the sort. It's not exactly a problem I have with the script, but it speaks something to me about how much passion and respect for Japanese culture (even though it's a VN about Chinese culture) went into this VN...  Beyond the smaller details, such as a clean, responsive backlog and autosave saving my life on a couple occasions, I don't have much else to say about this game. So, do I recommend this game? Yeah. Although the script is a somewhat garbled mess, it is still readable, and it offers a lot of insight into the social consequences surrounding the GaoKao exam, as well as an interesting, heartwarming subversion of the dating sim formula. It's worth checking out to see if your own future in Chinese academia will look bright without a walkthrough. :D",
            "review_score": "1"
        },
        {
            "review_text": "Dear China,  I thought they were speaking in Japanese.   -Sincerely Me   P.S I am a terrible person, sorry China.",
            "review_score": "1"
        },
        {
            "review_text": " First Thing First:  This is a ♥♥♥♥♥♥♥ excellent game.   If you're on the good track:  I feel like I'm in love again aww I'm still in Senior High School but this story is nothing like what's happening to me hahah But it's really warm to see story like that, as if it cures my heart. Such relationships are really hard to find in reality. Sometimes, to see the good and beautiful side about the world is probably good for your psyche... At least this beautiful game makes me feel like I'm living in a nasty world... This game is everything that I expect, which is also what I can never have. So that's why I'm so addicted to it because I still long for it althogh it could never be mine. Just an ask-for-too-much super-duper stupid little wish of mine... Give your heart a little break with this game :D   If you're on the bad track:  You'll have the chance to see the darkest side of the world, where they love and care about you based on your scores, where nobody understands or trusts you. The pressure pushing on you is hard to imagine, it's an evil world, they are obsessed, even diseased with the numbers on your test scores. I felt it hard to breathe when I saw 'me' like that. It makes me sick of the reality, sick of everything around me. I'm in Senior High and I totally understand why this is going on, and such correlations make me feel bad. It makes me wonder and question myself about my future, too. Just so educational, about the world, everything.    Last thing to Say  I'm obsessed with this game because it's almost illustrating my life, I mean, the cruel 'test scores' part; and also I've found one of the characters similar to me, I've felt such empathy. No matter if you ARE or you HAVE BEEN a student, you'll feel the resonance, that is either reminding you of the beauty of love when you were still a little puppy, or killing you with the cruel criteria based on which other people would evaluate you.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game.  I came into playing Visual Novels/Dating Sims fresh out of Katawa Shoujo (Which recieves my whole-hearted recommendation) and had high expectations for Gaokao Love based off it. These expectations were not met for me.  While I like the concept of balancing a relationship and test grades/scores in a simulator type way, but the execution of this was not fun, especially when the game seemingly worked against me by auto lowing my stats every other in-game evening through random events that had nothing to do with the decisions I had made up to that point, or to things that made no sense. (Previous Year's Champion's Motivational Speech tripled my stress huh?)  I understand that Visual Novels are pretty much entirely 'on-rails' in terms of story, you can at least nudge them in different directions to change the plot. This holds true with Gaokao Love as well, but I felt extremely restricted here, even for the ten different routes the game promises. While the story's direction did indeed change, it all felt hollow as our character (and with him the story) constantly focuses on the same person (Muxin) regardless of character route chosen, each ending I have experienced made mention of her when she did not matter at that point.  Because of the story's focus not shifting to prioritize other characters, they felt wasted as they were never the focus for long. While each personality is well established off the bat, I never felt like they were properly fleshed-out. If you (like me) are looking for a feels-heavy Visual Novel, this isn't the place.  I got bored close to the end of each run, as each day's conversations held the same topics but with different wording...  I'll be honest I have not gone though each route, but the four I have gone through has not left me with any desire to try the others...",
            "review_score": "-1"
        },
        {
            "review_text": "When I first viewed this game, it seemed like it would be a good title to play. Upon my first playthrough, I found out how important getting a good score in the tests were and how that changes the story. At the end of my first playthrough, I ended up isolating my friends and becoming so focused on studies that I eventually ended up not liking myself. I still ended up with a positive ending, the journey good have been a lot better. I had to look up a guide in order to get the ending I really wanted. While it's not a bad game, it's not exactly great either. The designs, settings, and music are great. The characters, especially the protagonist's parents, were not as great. Some felt like stereotypes while others could have been done so much better. As for how you handle your day to day life in school and how that impacts your health and overall your studies, the premise is great, but honestly games like Persona 4 have it handled much better. Though I will give credit to the makers for trying to bring a more realistic approach to the visual novel genre with this game. End of the day, I give this game a solid 3 and 1/2 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, wasn't sure what to expect playing this.  After being obsessed with If My Heart Had Wings for a very long time, I've been playing a load of visual novels recently and thought this one was worth a try, and the idea of having so many choices gives it a lot of replayability.  It's a game about student life that I promise was vastly more difficult than your own and kind of makes you feel bad for slacking off on homework back in high school since the students in this game do kilos upon kilos of papers every day. And at the same time, you're trying to balance a relationship that was probably destined to fail in the first place. You can focus completely on love or completely on work, or try to balance it out whichever way you feel will work best. It's actually quite difficult and reminds me of a relationship I had while in college. It can honestly get quite stressful, and almost every choice you make will have some kind of possitive and negative consiquince.  The translations are of acceptable quality, but they could be much better. Sound is honestly perfect and visuals are pretty good. Could use some better writing since the most common lines you'll hear are '... ... ...' and 'Alas.'  7.5/10. It's worth a play",
            "review_score": "1"
        },
        {
            "review_text": "I am a Chinese, but I have to write this in English. Why? Because this is China's first AVG Steam game, and it's perfect. You deserve to try this game. Finally, I want to say that I love Xiaohan.",
            "review_score": "1"
        },
        {
            "review_text": "This game really twist my mood and feelings, I screwed the 1st ending(no girlfriend, didn't reach Gaokao and stayed in the computer cafe for months), because of this, I regret for being absent in school just to play computer &gt;,.,&lt;",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent, well desighed visual novel!  Not gonna do pro/con because others already did.  All I wanna say is, this game is full of feels, strong feels. Sandess, happiness or sometime regret, depends on what route you take, what endding you get.  And you know if a game can move and touch you in such degree, it's a recommandable game. ",
            "review_score": "1"
        },
        {
            "review_text": "It's a lovely game. I got a sad ending at the first time. However, I could get what the story tells. I've earned more 20 enddings now. The endings are a lot. Some are really interesting.   I'm also playing this game and hope my Chinese will be improved. I'm glad to hear that the Eng Ver. will be improved, but I'm afraid that the points of some Chinese jokes will not be got easily. I cannot wait to play the new version.  Though I don't think it is that much difficult to find a girlfriend in China, I've heard some Chinese friends discussing about the difficulties to get a boyfriend/girlfriend. I think, the girls or boys who set high standards for boyfriend/girlfriend are seeking for a potential better half before starting a relationship rather than trying to find a boyfriend/girlfriend to build a relationship with. Their ways are nothing wrong, but they cannot represent all Chinese, right?  Anyway, in this game, I've learned 'love' is love in Chinese culture. Of course, love has various shapes in different culture backgrounds and love is also shown in a specific way by every individual. Like Muxin and Xiaohan, or other characters in the story, they own their vision of love and life, which makes the diversity of endings. : )  Those are my points. Chinese gamers who want to share your opinions with me are welcome. Sorry, my Chinese is not good enough to write understandable comments. English will be fine.",
            "review_score": "1"
        },
        {
            "review_text": "NICE! This is the status quo of the college entrance examination in China！ ",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea what I'm doing.",
            "review_score": "1"
        },
        {
            "review_text": "After all of the overwhelmingly positive reviews I decided to buy this game. This is not my first visual novel, and in all honesty I am quite dissappointed. In the game, I studied very hard and tried my best to keep my health up, but chance events kept lowering my abilities until all my hard work was ruined. Perhaps I don't understand the game mechanics, but I expected a fun, cute, and positive game and instead got a roulette game with choices.",
            "review_score": "-1"
        },
        {
            "review_text": "where the tiddie",
            "review_score": "1"
        },
        {
            "review_text": "Poorly Translated. Instant turn off for my visual novel tastes",
            "review_score": "-1"
        },
        {
            "review_text": ":p great game but cant manage the balance, i tried so hard to keep the relationship and didnt get to anywhere. propably wont try to unlock all 50 endings by myself.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished my first playthrough, which took me around 8 hours. It was great, and at the same time frustrating. Started my second playthrough a few hours ago, and now I'm just wondering what the hell I need to do to get the ending I want. I'll figure it out sooner or later ¯\\_(ツ)_/¯  The biggest downside to this game is the ~30 last days. It gets really repetitive and boring, with less interaction with a lot of characters (or maybe it's just my route lol).   If you enjoy VNs, definitely get this one.",
            "review_score": "1"
        },
        {
            "review_text": "Gaokao Love is a Visual Novel/Micro Manager game that takes place in China (not Japan?) and you play as a senior in highschool trying to not fail the Gaokao (imagine SAT's if they were 10 times harder and on crack) while you also try to keep your sanity and newly made relationship with your new girlfriend and longtime crush 'Muxin' afloat.  Will you get good enough grades and pass to a top tier university with your girlfriend? Or will you fail at absolutely everything and fall into a pit of depression as you ruin your future completely?  I give this game a 7.5/10, it's pretty good : )  (although beware that there are minor spelling errors scattered throughout this game and although they don't affect it much at all, it's still important enough to mention)   STORY TIME  'DAMMIT (insert name here), STOP GOING AFTER MUXIN, I WANT XIAOHAN! NO! DON'T DITCH THE DATE YOU SET UP WITH XIAOHAN TO GO TO THE AQUARIUM!'  *few days later*  'Hey, where did my (future waif) Xiaohan go? Better go find her...'  'SHE'S BEEN IN THERE FOR THREE DAYS?! DAMMIT (insert losers name here), IT'S ALL YOU FAULT! WHAT?! YOU DIDN'T GET THE HINT SHE LOVED YOU?!?! GODDAMMIT, SHE ALMOST DIED BECAUSE OF YOU! I SWEAR, I BETTER GET A CHANCE NOW TO BE WITH HER NOW!'  *a few days later*  'oh hey, Muxin disappeared again, I might as well try calling her for the last few days since my love interest Xiaohan is pretty much set in stone'  *like a year later, idk*  'Oh, I got them both? That's cool I guess.' : /  THE END",
            "review_score": "1"
        }
    ]
}