{
    "app_id": 347610,
    "name": "Hidden Object Bundle 4 in 1",
    "release_date": "2015-10-06",
    "developer": [
        "Alawar Entertainment"
    ],
    "publisher": [
        "Alawar Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 144,
    "negative_ratings": 10,
    "price": 5.59,
    "description": "This 4-in-1 bundle includes 4 Hidden Object games: Stray Souls: A Dollhouse Story, House of 1,000 Doors: The Palm of Zoroaster, Dark Strokes: Sins of the Fathers, Eternal Journey: New Atlantis",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/347610/header.jpg?t=1478067098",
    "minimum_requirements": "OS: XP/Vista/7/8/10 Processor: 1600 MZH Memory: 1024 MB RAM Graphics: 512 MB DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": "OS: XP/Vista/7/8/10 Processor: 3 GHZ Memory: 2048 MB RAM Graphics: 1024 MB Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": " Hidden Object Bundle 4 in 1  is a collection of four fun games for a bargain value, three of which are not available on Steam outside of this bundle. This is a great collection to pick for fans of this genre.   Dark Strokes: Sins of the Fathers   The first game in the bundle that I played was  Dark Strokes: Sins of the Fathers , I was attracted to the title’s name and the preliminary artwork of the protagonist Ethan and his fiance Claire. The story starts off with the two of them being summoned by Ethan’s father to come visit, simple enough. Though, as soon as Ethan utters the words “Everything will be fine” players are thrust into a world of supernatural mystery and family secrets. Claire soon finds herself kidnapped, shock, and Ethan must save her from the clutches of a mad man.   The game itself plays like a basic hidden object game. Finding items in a variety of different scenes with puzzles and mini games thrown in. One feature I enjoyed was that you could find more than one useful object at a time during the hidden object scenes. So instead of having to replay a scene countless times you could say pick up the knife and puzzle piece needed in one go through. Artwork was lovely in the game and the audio was good as well, voice acting was a bit on the cheesy side though but that added to the charm.   Eternal Journey: New Atlantis   I next jumped into  Eternal Journey: New Atlantis  again, based off the title. I was expecting a mystical journey through the lost city of Atlantis, instead what I got was a space odyssey. The story starts off with Amrite, a famous archaeologist, going to explore the newly discovered ruins of a temple from the fabled city of Atlantis. However, tragedy strikes as the excavation site is destroyed taking all mortals with it. Fast forward over a century later, Amrite is on her way to a Martian archaeological site to lend her expertise. After being suspended in cryogenic sleep, it’s time for her to use her skills to help mankind find a new home as they flee Earth.  The game’s story is rather far-fetched but refreshing as Amrite wanders around a deserted space station with only a kitten as company. While I wouldn’t look for deep inner monologue or reflections of the emptiness of space itself, the game does present a very good mystery element as you try to figure out what happened to the crew. The artwork is alright, I feel it’s a bit weaker than the other titles in the bundle but not bad at all, it certainly feels other worldly along with the music. The game also has voice acting which is a plus, and it’s not bad either. The game plays smoothly but be prepared for quite a bit of backtracking, thankfully there is a map.   Stray Souls: A Dollhouse Story   In my opinion the weakest of the four titles, I played this one last because it had a creepy clown in it. You play a woman named Danielle who has just witnessed her husband Sam being kidnapped. A talking pin cushion doll instructs you that you must return to the town that Sam grew up in to find him. As is the case with many protagonists in these games, Danielle shows the minimal amount of shock at her current situations and rushes to find Sam. The story is weird, involving magic, orphans and clowns. The story is also slightly predictable, many twists being obvious before they happen. The biggest example being the clown, never trust a clown people.  What the game lacks in a compelling story and interesting characters it makes up with good gameplay and artwork. The artwork matches the setting of the story, it’s dark and moody along with the music. The visuals draw players in and the puzzles and hidden object scenes keep them there. Tasks move from one to another smoothly and it’s usually easy to figure out your next step, the game also isn’t too difficult either which can make it a little short. I wasn’t even prepared for the sudden ending of the game as things seemed to wrap up very quickly despite the slower pace of the rest of the story, though I found the ending to be one of the better parts of the entire game.   House of 1,000 Doors: The Palm of Zoroaster   I saved this one for for last because it’s the only one of the four games available on Steam separately. The difference being that the separate version is the collector’s edition which has bonus content as well as a bonus chapter for more gameplay. I played the game again to see if there were any other differences between the two but there are not. The issue with this game is the story, you play Kate who is returning to the House of 1,000 Doors for really no reason, she isn’t summoned and she never outright states why she’s going back after her adventures in the first game of the series, also available separately on Steam. Once you arrived you’re sucked into supernatural escapades. The story offers no real sense of urgency, however, as you try to stop a mysterious fireball you only find out is the Palm of Zoroaster at the end of the game. The unfortunate part is that the bonus chapter, not available in this bundle, adds more story than the main game offers.  The game is still fun, however. It is hidden object scene heavy with a few puzzles as well. The artwork is good and the game has a great map feature which makes the backtracking less tedious.  House of 1,000 Doors: The Palm of Zoroaster  is filled with lovely artwork as well and rich scenes from different areas of the world. The only real technically issue I had with the game was the voice acting, it was very wooden and sometimes pretty bad, especially the main character Kate. This is a minor issue, though, in an overall pretty solid game and nice addition to the bundle but I would certainly recommend buying this and  House of 1,000 Doors: Family Secrets  on Steam separately.   Lunar Productions  [lunarproductions.tumblr.com] ",
            "review_score": "1"
        },
        {
            "review_text": "Great set of HOGs! They felt like playing some of Artifex Mundi's better games. Eternal Journey was my least favorite, but it was still pretty decent, and the other three were great.",
            "review_score": "1"
        },
        {
            "review_text": "If you like hidden object games just go ahead and get this bundle. Cant go wrong with it.",
            "review_score": "1"
        }
    ]
}