{
    "app_id": 347730,
    "name": "Wait - Extended",
    "release_date": "2015-10-29",
    "developer": [
        "rest.less Games"
    ],
    "publisher": [
        "rest.less Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 18,
    "positive_ratings": 38,
    "negative_ratings": 4,
    "price": 5.59,
    "description": "&quot;Wait&quot; is a mystery horror game, inspired by the works of H.P Lovecraft and the Silent Hill series. The gameplay is put together by elements of exploration and riddle solving. Experience horror without jump scares or fighting monsters, but with the fear of the unknown and unimaginable.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/347730/header.jpg?t=1530197009",
    "minimum_requirements": "OS: Microsoft Windows XP/Vista/7/8 Processor: Intel Pentium 4 2.0 GHz or faster Memory: 512 MB RAM Graphics: 1024x768 or better video resolution DirectX: Version 9.0 Storage: 180 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Really nice game. Wonderfully thick atmosphere and very original story. The music does a great job creating just the right feeling for every scene. There is alot more to the game than what you see at first glance. Definitley looking forward to the second playthrough. =)",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. If you're look for an unsettling, psychological, mind-bending puzzle of a story, then look no further.",
            "review_score": "1"
        },
        {
            "review_text": "  I absolutely love this game.  When I got this, I was not expecting what it handed me. What I thought would be a short, easy-to-see-coming mind twist ended up being something so much more than that. I was so involved in this game that I got a friend of mine to play with me and try to figure out the puzzles and craft theories before I reached the end. The mechanics are unique and the puzzles actually make you think. (There was one that I had to come to the Community Guidelines to figure out which I'll touch base on further down to avoid spoilers.) The atmosphere is tense and has you scared and confused WITHOUT JUMPSCARES. The music is fitting and certainly adds to the tense situations throughout the game. My only wish was that I could figure out how to turn the music down a bit. In total, if you enjoy games that scare you and get you thinking, you'll love this adventure.   *SPOILERS BELOW, PLEASE DO NOT READ FURTHER IF YOU HAVE NOT PLAYED THIS GAME*  The only puzzle I didn't find too enjoyable was the one in the sewers. I searched and found all of the pictures, I found the notes that give 'hints', but could not figure it out to save my life. When I looked it up and saw the explanation, I thought 'No wonder I couldn't get that.' The puzzle is set up nicely, yes. It has a lot of potential, but some of the conclusions I would have had to come to felt a little farfetched to think up on my own without using simple 'Guess and Check' standards.  That does NOT take away from this game though! It's only one small part that I got stuck on, the rest was a fantastic rollercoaster of fitting together pieces of diaries to try to make sense of what was going on. I LOVE the fact that unlocking achievements unlock the books on the shelf and I can't wait to get them all so I can see what that locked book has in store for me.",
            "review_score": "1"
        }
    ]
}