{
    "app_id": 347710,
    "name": "Perils of Man",
    "release_date": "2015-04-28",
    "developer": [
        "IF Games",
        "Vertigo Games"
    ],
    "publisher": [
        "Vertigo Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 14,
    "positive_ratings": 125,
    "negative_ratings": 31,
    "price": 6.99,
    "description": "When Ana receives an unexpected gift from her missing father, she is catapulted headlong into a mystery that will take her on a journey through time. At last she must decide if a perfectly predictable world is a curse on humanity or a triumph for mankind.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/347710/header.jpg?t=1449048044",
    "minimum_requirements": "Минимальные: ОС: Windows XP Service Pack 3 Процессор: Core 2 Duo 2GHz or equivalent Оперативная память: 3 GB ОЗУ Видеокарта: DX9 (shader model 2.0) capabilities Звуковая карта: Direct X 9.0c sound device Дополнительно: Not Recommended for Intel integrated graphics",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An enjoyable point and click adventure with a unique story, and an interesting 'risk' mechanic. Puzzle difficulty is enough to be interesting, without overly stalling progress. No complaints here.",
            "review_score": "1"
        },
        {
            "review_text": "Very good. Yes yes. Also British.",
            "review_score": "1"
        },
        {
            "review_text": "Good gameplay and great story. It's not THE best adventure point and click, but it's very good. Storyline is very interesting, authors managed to combine funny and sad elements - that gives a bittersweet flavored tale.   If you're looking for a light and not too long game for a few evenings - take Perils of Man. You will be not disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Although not a long game, a decent exampleof a point and click. and fits fine in the sub $10 category. I do have to say that one thing incredibly irked me. And that was the incredibly high pitched voice acting for the main character. It may seem petty but it really is incredibly annoying and over the top. This game though not unenjoyable for an adult is well suited for teens.",
            "review_score": "1"
        },
        {
            "review_text": "i'm half-way and think this is a good point and click adventure, maybe not an exceptional game but a well made one.",
            "review_score": "1"
        },
        {
            "review_text": "I wish my verdict could be kinder than these two words: Wasted potential.  The fantastic premise could have offered so much more in terms of character development, storytelling and most importantly: MEANINGFUL CHOICES. At least in the end, multiple choices for multiple endings would have saved some grace. Because you know: for a game with a story that dramatically emphasizes the worth of risk and the consquences of change, the whole plot, down to every little segment in this story is tightly on rails.  At least point'n'click games of the TellTale variety *try* to give players a somewhat individual way of navigating the broadly pre-defined story - in Perils, all important choices are entirely made by Ana, without any player involvement whatsoever.   The result is a game that utterly betrays the very lesson it is trying to sell story-wise.",
            "review_score": "-1"
        }
    ]
}