{
    "app_id": 347830,
    "name": "Fairy Fencer F",
    "release_date": "2015-08-04",
    "developer": [
        "Idea Factory",
        "Compile Heart"
    ],
    "publisher": [
        "Idea Factory International"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "Anime",
        "JRPG",
        "RPG"
    ],
    "achievements": 29,
    "positive_ratings": 1997,
    "negative_ratings": 208,
    "price": 15.49,
    "description": "Long ago, the Vile God and the Goddess waged war with each other. Equally matched, they were sealed away in another world… Now a lazy young man named Fang somehow finds himself a key part of this war he’d really rather not deal with, but fate beckons in this uncommon RPG!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/347830/header.jpg?t=1529518030",
    "minimum_requirements": "OS: Windows XP Processor: 2.13GHz Intel Core2 Duo or equivalent Memory: 4 GB RAM Graphics: DirectX 9.0c compatible graphics card with 512Mb RAM and support for v3 shaders DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 7 or later Processor: 3GHz Intel i3 or equivalent Memory: 4 GB RAM Graphics: DirectX 9.0c compatible graphics card with 1GB RAM and support for v3 shaders DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "I'll be brief as possible with this review since this game has been out for some time already on the PS3. You should really look at those reviews on the game content itself.  What I really want to focus on is why this is a good PC port and why you should consider it.  + It's reasonably priced (at launch was $14.99) + DLC is $0.99 a piece and totally optional to the core game + It runs at 1920x1080 (1080p) at 60FPS without issue + Works with my older gamepad just fine (Logitech Cordless Rumblepad 2)  Now I can't say whether or not the core game itself is your cup of tea; but I do want to say that many of the technical issues that plauged the PS3 version shouldn't be present here. At worst, it's a cleaned up smooth running PS3 port. At best, it's a JRPG that at least feels like it belongs on the PC unlike other half-♥♥♥ attempts recently from other publishers/developers.",
            "review_score": "1"
        },
        {
            "review_text": "Its good, a traditional JRPG with a few gimmicks such as a heavy visual novel approach (Tears to Tiara 3, Hyperdimension for example) and extremely flashy encounters that you'de normally see on consoles. Some of the best parts of this game, despite the combat being simplistic is how pretty it looks. All of the spells, and abilities have their own little cutscene and all actions happen snappily and quickly. The audio is good, the English dub is liveable but the Japanese dub is better (especially if you understand things that don't translate well).  The story is anime influenced and is more on the silly/moe side of that. It is a fun story, nothing too serious and slightly cliche at points. The story is self aware of just how cliche it can feel, and sometimes makes fun of itself. There is a deeper undertone but I doubt it'll matter. Now get the boy his damn /FOOD/! It is more cohesive then most straight up Visual Novels, but there isn't much choice as it only has 3 possible endings without much deviation in your activities.  As a PC port, it works perfectly. And really that is the #1 criteria for any game that exists. The game only has resolution settings, including borderless mode. That is pretty much all there is for PC related enhancements, everything looks crisper and cleaner then the console version so I can't really find anything to complain about this. Its a fast game, the FPS feels smooth, the action is smooth.  Overall it is a fun game to play, especially at its current price of $15. Its a competent port, and is pretty to look at. Its a bit easy, so you won't enjoy this game if you want a challenge. Nor will you want this game if you're looking for a deep engaging story that will make your brain think on all cylinders. But if you want something light hearted and easy to digest then this games story will pass for you. Thumbs up~!",
            "review_score": "1"
        },
        {
            "review_text": "A fun turn base game with an easy to follow and comical story to help you along. The initial campaign is easy to clear, followed by an extensive grind period to attempt a boss tower (if your looking to kill lots of hours to 'clear' the game).",
            "review_score": "1"
        },
        {
            "review_text": "I was pleasantly surprised by this game. Since it's made by the same company as the Neptunia franchise, I wasn't really expecting a  good  story but my expectations were wrong.  Let's start off with the positives. The writing is still very anime-y but the story is told like a Visual Novel so it's able to flow nicely and coherently. The characters are pretty likeable (despite the main protagonist being unlikeable at the beginning) and there are a lot of optional skits that help develop some personality in each of them despite being a pretty short JRPG (20-30 hours for the first playthrough).  Combat is standard. If you've played a Neptunia game, it's the same thing: Turn-based in a 3D realm. A different aspect of the whole leveling process is the 'Weapon Point' system where you can spend points to obtain new skills or magic in (mostly) any order you like. This lets you see noticeable differences in your strength.  Oh, and the music is pretty great. The game takes a 'Tales of Symphonia: Sylvarant -&gt; Tethealla' route with the music where the normal battle and Fairize music change after starting the 2nd half of the game. It's a nice touch that I personally love. The final boss music is fantastic as well. Without it, the final boss would not have been so great.  I noticed a lot of complaints about bland characters. The thing with that is you can easily pile any JRPG or anime character into a single archetype without regarding any of their other traits or back stories. It's just dumb to have that mindset. All of the characters, from the main cast to the villains, are very unique and memorable. One of the secret characters in particular play a great role in developing the main character's motivations which made me actually  feel .  Another complaint I've seen is the fact that the game re-uses assets. Without going into spoiler territory, I'll just say that the whole direction of the 2nd half of the game actually played out the way the story intended so that complaint is just moot. I definitely did  not  get the feeling that they were just trying to 'prolong the game'.  Now on to the bad. Combat. It's either way too easy or you have to suddenly start grinding. The difficulty is really...weird in this game. There are no options to select a difficulty so everything is always going to be fixed. Given that info, I'm surprised there was such a weird fluctuation in difficulty since you'd think it would be  easier  for the devs to adjust the difficulty with only 1 setting.  Another thing that is a side-effect of the weird difficulty is how some of the fights play out. There are always cutscenes before, during, and after the boss fights which doesn't always match up to how easy/hard the boss was. For example, I completely stomped one of the bosses and right after a cutscene plays where my character is saying 'I don't think we can beat him...'. It's pretty awkward but it does that to fit the narrative of the story I guess. They could have fixed that by giving different dialogue options (Scene A plays if you win, Scene B plays if you lose/don't kill him in x amount of turns) but I shouldn't expect that much from a low-budget game. Thankfully the final boss' difficulty is  just right  and that left me with a great feeling at least. There are a few other minor gripes like the moments of  completely  random fan service but it's from the Nep-devs so what else could I expect.  Overall, Fairy Fencer F is a pretty great game with some complaints that can just be forgiven if you just focus on the drive of the story rather than the gameplay. I will give a warning for completionists though as this game is incredibly grindy if you're going after achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Well.. IF you are a IF (idea Factory) fan you know what this game will be like before you start it.  Compare to all the neptunia game out there this game is just IF's try to create other story worlds.  It's done pretty good with some flaws in the story plots as a lot of story junction feels forced or not very logical...  Graphics is the same top effort of japanese animation styles and all the character designs (good or bad characters) are all very lovable.   Music is actually one the strong point of this game and it have way better in game music then most neptunia games.(unlock sound gallery pretty earlly in game to listen to the full songs).  Every story script of this game is either plot advancing or trying to be funny. It was really funny some of the time but i couldn't get the joke some times.  There are 3 endings but they can be gotten in one story run as long as u save before trigger the event inside desert santuary. The subevent is in the 5 star inn.   All the acheivements are very easy to get except that masscure kill count achivement that will require a lot grinding.  7.5/10 as a very enjoyable RPG with less grinding compare to neptunia games.",
            "review_score": "1"
        },
        {
            "review_text": "Good turn-based JRPG with likeable characters and a decent story.",
            "review_score": "1"
        },
        {
            "review_text": "-SHORT SPOILER FREE REVIEW-  Before receiving this game from a friend, I was already aware that the developer of the game was the infamous 'compile heart', renowned for their 'waifu simulator neptunia' series. So going into Fairy Fencer F, I was expecting a game with a half-arsed story, terrible game mechanics and a million anime girls. Needless to say, I was pleasantly surprised to find out that the Male-to-Female character ratio is, rather than 100% female, closer to 1-1. There is almost an equal number. So the game delivers in providing a diversity of characters. tl;dr FFF character design &gt; HDN  Fairy Fencer F is rich with dialogue, dialogue which comes in all forms. So far in fact, that as you collect 'furies' throughout the game and the corresponding fairies to each fury that are displayed in your inventory, each will have something to say on every topic in the game, it's endless fun to sit and browse through your fairies and learn each fairy's individual thoughts and point of view. The comedic value of the game is significant, I was provided with a significant portion of laughter. There are feels, and the soundtrack matches the artwork and tone of the game almost spot on.  A significant flaw in FFF is the difficulty level, this game is far too easy, it doesn't take a lot of skill to play, which is fine for the most part with JRPGs since they are mostly story-driven (You only have to look at final fantasy to see that). However, it wouldn't hurt to throw in an actual challenge once in a while.  All in all the game was pretty good, I grew attached to some of the characters, I was pleasantly surprised by FFF, I was going into this game expecting to be utterly disappointed by a subpar game, drenched in 'waifus'. HOWEVER, as was made clear in my review, this game was far from that.  Gameplay - 7.5/10 Character design / development - 8/10 Story - 8/10 Soundtrack - 9/10 Artwork - 9.5/10  Room for improvement, but a fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very similar to Neptunia. If you played Nep before and looking for other game of this type, then you may buy it. However, if you did not played any of Hyperdimension Neptunia games before, i woukd strongly recommend to start from Nep, not this one.  Fairy Fencer, unlike Neptunia, lacks something you can call zest...or soul. No unique atmosphere, stupid repititive plot, no kawainess almost at all, and much more grind without any possible tricky ways to lvl up fast without cheating. I dropped it, cause after intriguing start, it gets very repetitive to play, and dull story provides not enough motivation to do so.  Summary: dropped",
            "review_score": "-1"
        },
        {
            "review_text": "Took me about 40hrs in total to finish off the game and get both the true ending for tiara and eryn! All thats left for me is to clear the tower which im looking forward to. Definitely a game worth trying, a friendly tip for those who are still playing this. Always make multiple saves here and there to avoid missing any subevent cause in this game some of these sub events are quite as important as the main events itself.  enjoy and goodluck!",
            "review_score": "1"
        },
        {
            "review_text": "This one is Cool Game other than Neptunia Series  Pros :  - While it still use live 2D and Voice over - Different feature to make the character stronger - 'Henshin' animation  - HD quality graphics + Cute Characters - Funny Storyline - Still have trading cards  Cons :  - Main story boss is kind of easy peashy, but the sub event boss is challenging.  What else I can say...umm... Overall rating 9/10  Worth to grab especially on Sale :&gt; ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much an instant must buy for jrpg fans. Story is great, gameplay is great, characters are fun It runs at 4k and fps isn't capped. Seriously just buy it and play the crap out of it.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best Idea Factory RPGs I've ever played since Chaos Wars and Blazing Souls.  I have to admit: Idea Factory's earlier RPGs were enjoyable too, but had too many flaws and unpolished features so that I couldn't recommend any of them as a stand-alone game of a genre. Fairy Fencer F is different in my opinion.  It's a turn-based rpg with a combat similar to Hyperdimension Neptunia Rebirth series and Mugen Souls. If you played those games you'll probably notice many familiar things.  Fairy Fencer actually has a lot more useful and polished features compared to Neptunia Rebirth series. While the game starts off simple, its core gameplay gradually gains more and more stuff. And I'm not talking about just crafting feature or sub-quests. There are unlockable combos, enemy weaknesses, team-attack system, character-unique actions, fairy card bonuses, etc.  Sure there is still quite a few in-game stuff which makes you wonder 'This could've been so much better if you added X', or 'Why did they not exploit this further?', or even 'This system doesn't make much sense.' But all in all I wouldn't call it a wasted potential.   The game is not the best, but a very solid and enjoyable JRPG in my opinion. I would definitely recommend trying it out. I also have to mention that Fairy Fencer F has a really good optimization. It runs on my pre-historic dualcore like a charm.",
            "review_score": "1"
        },
        {
            "review_text": "Its an awesome game! If you like an RPG like Final Fantasy I think this is it. Great storyline and soundtrack even though i dont like it dosent have an auto-save feature. Its still a good game. I rate it 8.5 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "A turn based JRPG. Really fun and the games take a different approach than your normal game. Still a lot of fun and if looking for a game to mix things up or kill time, this also is it. Personally, I think the game is a bit easy, but still fun. I have been gaming for about 20 years +. 6/10 (no game is perfect).",
            "review_score": "1"
        },
        {
            "review_text": "A good romp for $20",
            "review_score": "1"
        },
        {
            "review_text": "After playing all the Neptunia games, I didn't really have any games to play afterwards. I've played all the Rebirth games and Megadimension, Action U and never really finished the Noire game on my PS Vita.  Fairy Fencer F takes the battle system I'm familiar with and throws in a completely new story with new characters. This game can be as funny as Neptunia whilst being completely serious at times. They've handled it so well to keep me so interested for the banter the characters thrown at each other.  I mainly played because someone on /nepgen/ said it used the same battle system and in 'some cases', better than Neptunia. I completely agree with this, there are times where it is better, where as at other times, it's flawed. I feel like so many people would absolutely enjoy this game, but because it's 'anime', normal♥♥♥♥ won't play this game.  Performance is great in my experiences, I did have a few issues when booting the game up (Like being locked to 15fps), but just restarting the game is an instant fix.  Seriously, pick this game up if you're coming from Neptunia.",
            "review_score": "1"
        },
        {
            "review_text": "Okay I'm going to keep this short and sweet folks. Pretty much if you have played Re;Birth 1 with all of the DLC you would know something about this.... somewhat. Aside from that there will be similarities with most of the dungeons and monsters as well too if you've played a NepNep game as well.  In any case it is worth getting since this has a bit more of a serious storyline to it than what NepNep has at times. Also, since this is an Iffy game expect a Grindfest for certain things, such as the Pub Quests, and sometimes leveling to do other things like the DLC dungeons.  Although there is also things that can be easily missable if you don't check everything before progessing into a storyline dungeon. Most of the things that can be missed is Lola's Side Quests, and thankfully there's a guide for that along with getting another secret character too.  So if you're thinking this is just :nepnep: reskined, you're only half right. Since they do have male Fencers involved in this..... and Pippin too, since I have no idea what that cat creature really is, just like the rest of the members in Fang's Party too.  In any case if you're on the fence for this game, I would suggest buying it when it goes on sale of course. :Eryn:",
            "review_score": "1"
        },
        {
            "review_text": "great games great story great rpg battle system great soundtrack too!  similiar to neptune but this one provide more interesting feature, also you can run this on 2 GB ram pc lol",
            "review_score": "1"
        },
        {
            "review_text": "A game for Nep fans who can survive without Nep.  Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Neptunia without Neptune. F*nal F*ntasy F lol",
            "review_score": "1"
        },
        {
            "review_text": "To sum up this game in a single sentence: Fairy Fencer F (FFF) is a Compile Heart RPG.  For anyone who has played Hyperdimension Neptunia (HDN) you'll know exactly what that means, and if you enjoyed those games then you will enjoy this one just as much. For those who don't like HDN there isn't anything here that will change your mind about the Compile Heart's style. The gameplay is the same, the characters are all full of tropes, the dialogue is hilarious for all the right/wrong reasons, and there's a whole lot of disjointed visual novel style scenes to go through.  Now for those who have never tried a Compile Heart game before to sum up the gameplay briefly: There's an overwold map with minor interaction where you point at the next dungeon, all dungeons are fairly short and samey, the combat system has some pretty good depth to it but due to how easy their games are any depth becomes meaningless, and most importantly you can spam jump while in dungeons.  Now speaking specifically about this game the gameplay, as mentioned above, has a serious problem in the difficulty department. There will never be a point you'll find yourself grinding for levels because the game doesn't start punishing you harshly until the enemies are basically 1.2-1.7 times your level. A cool new feature this game has is also the ability to distribute the stats into the character the way you want, AND while you perform actions with your characters they gain stats for the traits that relate (ex, jumping a bunch in the dungeon boosts agility, using magic a lot boosts SP, collecting items a lot boosts luck) unfortunately there is almost no noticeable difference because everything is just so incidental.   That may all seem negative, because it kind of is, but for some reason none of that matters once you start getting into the gameplay. The semi-strategy RPG style layout with aoe hit zones and movement zones mixed with the turn based combat is indescribably way more satisfying than it ever should be. It's hard to explain why and can only be experienced first hand.  Moving onto the story... well. It's a JRPG and Compile Heart really likes doing the classic (you're a hero now, you need to do x, and stop y from returning and save the planet) JRPG story, but they enjoy doing it with large parties of really enjoyable characters who are all quite hilarious. Also the main character in this game is quite possibly the most unlikable likable main character to come out this year.   Overall: While FFF might not be as good a game as HDN was it is certainly a fantastic addition to the library of any fan of JRPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic storyline and visually stunning. The game allows for a lot of customization in the way of building characters up like a traditional rpg. FFF is a great game overall and is something that grabs you and makes want to play it more each time you start it up. Definitely worth the money and worth the hours you will log in it.",
            "review_score": "1"
        },
        {
            "review_text": "I only beat it once (Normal Ending) but it was fun to play :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing the story is amazing the combat is amazing and just this game overall is wonderful loved it from beginning to end and i bet anyone who plays this will say the same :D and there was parts that were hard but that just made it even better! i love a good challenge! Overall i say 10/10",
            "review_score": "1"
        },
        {
            "review_text": "to anyone considering this game i highly recommend it for the funny dialogue and great characters! the one complaint i have is... WHY ISNT THERE A SOUNDTRACK TO BUY??? IT IS THE BEST MUSIC EVER!! -cough- uhm that is all",
            "review_score": "1"
        },
        {
            "review_text": "It's a great rpg game that follows most of the old classic rpg elements.  level grinding: check loot farming: double check unforunately (you'll know why) GREAT and LOVEABLE CHARACTERS: YES! (except for that one guy, spoilers)",
            "review_score": "1"
        },
        {
            "review_text": "It is made by the same dev team who is behind the Neptunia Series. It is very good in terms of story and gameplay. It borrows from Neptunia from its gameplay. The character designs also have inspiration from it too. I recommend this game at least a try.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great rpg game that follows most of the old classic rpg elements.  level grinding: check loot farming: double check unforunately (you'll know why) GREAT and LOVEABLE CHARACTERS: YES! (except for that one guy, spoilers)",
            "review_score": "1"
        },
        {
            "review_text": "Bought it the day before it went on sale. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, but there is no difficulty slider and eventually you end up just playing it for the story and not for the gameplay.  Exploring dungeons is pointless, there's nothing to look at (graphics are console/outdated), nothing to explore too. You're better off going in a straight line to the objective in every dungeon instead of looking for loot/monsters to kill. Side quests are practically worthless, rewards are ok but when you literally stomp every enemy your level (and then some) you don't really need to be careful when playing. For perspective, I had to play against enemies 2x my level to even get a sort of challenge, since I couldn't roflstomp enemy mobs then. So don't buy it for the gameplay.  Story wise though it was fun. Funny to play through, has funny little bits of trivia that you can pick up while you're in town by other civilians, though those interactions are just going to a menu (kinda) and selecting characters to talk to. Ignoring the side stories, the main storyline is quite enjoyable. Only 'problem' would be that it's not particularly deep in terms of character development, but that's irrelevant since it's pretty much a casual game to enjoy for say... 14 hours or so.   Characters also have weird challenges that you could grind if you wanted to, but those seem to be put in for those who wish to punish themselves. Like 'jump 10, 50, 100, 2000, 5000 times in a dungeon with &lt;x&gt; character'. And the reward for completing more and more jumps/attacks/whatever doesn't stack well, so eh.   7/10, worth getting on sale. Not sure about full price though, since I'm fine with spending 7.99 for what I got, but full price of $30 is a bit much. I really would've liked a bit more depth to gameplay/story for more fun, but it's ok as it is.  Buy on sale (like all games), grab the additional dlcs (get the ultimate armor pack to enjoy the OP playstyle faster), could skip the cosmetic sets though.",
            "review_score": "1"
        },
        {
            "review_text": "Nep V1337. JRPG Anime Perfect",
            "review_score": "1"
        },
        {
            "review_text": "Not a whole lot of reasons to replay after you beat it but still a pretty solid game!  Buy on sale and you feel like you got a great deal!",
            "review_score": "1"
        },
        {
            "review_text": "Choose A route B dies. Choose B route A dies. Choose C route...... i dont have waifus.  10/10 will cry again.",
            "review_score": "1"
        },
        {
            "review_text": "i really enjoy the game the grapichs and the story this is 1 of my favorite game",
            "review_score": "1"
        },
        {
            "review_text": "When I started to play with this game my first impression was along the lines of: God These characters are annoying!  The main character Fang acted like a lazy ♥♥♥♥♥♥♥ who cares about nothing but food. The main heroine and the face of the game Tiara acted like a giant SOB. The other heroine and the partner of Fang Eryn always seemed to have a few bad words for him. Though to be fair Eryn did have a reason to act the way she did. Just imagine you wait (for only God knows how much) for a lifetime partner to finally show up. And then when he finally arrives the only thing you get from him is verbal abuse, unwillingness and constant complaining about food. You wouldn’t be happy about it either would you? And then I kept on playing and the magic happened. When the characters started to really interact with each other and solving the problems life gave to them they turned out to be really well thought out and lovable. I would say the main strength of the game is it’s brilliant writing. The plot is the average the bad boys wants to resurrect the bad God the good boys wants to resurrect the good God but fortunately it’s written in an entertaining way. The characters are not only good but they keep on developing and they get rid of their initial annoying quirks. The story itself is not ground-breaking but has it’s nice touches and has a plot-twist around the middle I DID NOT SEE COMING! For the actual gameplay: If you played Hyperdimension Neptunia Re;Birth 1 or Re;Birth 2 then all I say it’s exactly the same. You enter dungeons from the main map. Inside them you control your assigned leader in the map picking up treasures and avoiding or hitting enemies. The actual battle system is turn based so when you are hit by one of them a battle sequence is initiated where your party fights against the monsters. When the battle is won you get back to the dungeon. Interesting take that you can’t change weapons since each character has to fight with the fairy he or she has a contract with. In exchange you have a weapon upgrade system where you can raise your characters stats, teach them new abilities and moves, skills and magic trough Weapon Point earned by battling. However thank to this system your usual equipment are close to useless and the mostly serve as fanservice. In the game you will gather fairies you cannot equip as weapons but they can grant buffs and add dungeon effects using a system called world shaping. With them you can make the game a little bit harder or easier depending on you. I think the biggest flaw of this battle system is that you became overpowered very very quick. After that battles are a chore instead of a challenge and the game becomes rather boring. The other downside is the quest system which requires extreme levels of grinding. There are 3 endings available but there is little difference between them. One for Tiara one for Eryn and a normal ending if you chose neither. Tiara’s ending takes priority so avoid scenes with her if you want Eryn’s. You should chose Eryn by the way.^^ The game offers a new game+ too. Many content is unavailable in your first playtrough raising the replay value of the game even harder. If you are interested in missable content then there is two playable characters who cannot be recruited unless certain conditions are met and a bunch of time limited sub-events. All in all I recommend this game for everyone who loves jrpgs and doesn’t mind grinding. ",
            "review_score": "1"
        },
        {
            "review_text": "I don't do many of these, and I don't really intend to do many more, mostly because I usually don't care enough for the games to do a review about them.  As you can see, i still haven't played this game for that long but I think i can already write something about it. This is a fun game. It's not amazing, it's not the best thing ever, it's simply what a game should be, fun and entretaining. It doesn't try to go beyond and break any new barriers, but it also isn't lazy or badly done.  The story is not really that special, but it keeps you engaged enough to keep on wanting to know what's going to happen. Not going to give any details because that would take forever.   The characters are stereotypes that anyone is used to see in any anime. Though the main character is by far the most entretaining character because he really does not seem to care for the main quest, not even for the other characters... to a certain extent. But his interaction with Eryn, and the rest of the group do make them more interesting then what they are in their roots.   The gameplay is redundant. It's always the same thing over and over again. Usualy this is a problem, except for the fact that the gameplay is rather fun, so it doesn't really matter. The special attacks feature some nice animations and the transformations get you really pumped expecially when you are fighting a boss.  The music complements the game nicely and the world in itself is rather charming.  Overall this is a really nice game that will make you want to play it for hours and hours. There is alot of stuff to do like side quests and other fairies to find, skills to upgrade, etc, so you will always have something to do.  If i had to rate, i would give it an 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Spent 10 hours farming for Earth stones and Blaze stones. 100/100",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically Hyperdimension Neptunia gameplay and animation wise; hence the same creators.   But with faires, and swords, and sword fairies; fairies that transform into swords...  But unlike Neptunia, it actully has dudes in it, that are vital to the story!   If you like anime, buy this, or jrpgs in general  It's fun, silly, awkward, has amazing artwork and direction and surprisingly very action packed and with a good story.",
            "review_score": "1"
        },
        {
            "review_text": "Tiara for love, Eryn for Justice",
            "review_score": "1"
        },
        {
            "review_text": "How da f*ck do I jump in this game!? Can't even complete the first dungeon!!!11!",
            "review_score": "1"
        },
        {
            "review_text": "Love everything about this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the perfect amalgam of a high quality visual novel and modern jrpg form. It has moe fairies and lolli's, sometimes even moe fairy lolli's... you need to have a particular love for modern anime humour i think, in order to truly enjoy this game, or even just a love for the standard format of modern jrpgs...or not, i don't know. the battles are fast-paced, simple and enjoyable. the writing is standardized at best and the characters are nothing if not isotropic, but that's not a bad thing. i usually like this kind of thing, and the game has made me giggle a few times allready, and i've only played through the prologue. the characters are standard anime, but in a good way. you have the foul mouthed, bedroom eyed alpha male protagonist. the cute and temperamental super kawaii girl sidekick, and the slightly masochistic lolita maid...take from this what you will, but i really like it. it has some big names attatched to it also. Nobou uematsu of FF fame composed the music with his band the earthbound papas, so that should satisfy and intice some of you, it has yoshitaka amano working as an illustrator, but this is mostly a gimmick and pr stunt, i think, as none of his work can be seen in the game, i think it was mostly promotional work and limited edition stuff he did, maby a poster...the character portraits seem very much alive when you enter into the standard visual novel portions of the game, wich has become a standard for idea factory. everything is very crisp. the graphics are also standard for this type of genre, if you are into this culture of video games this should come as no surprise, but rather comfort you. it's a ps3 port, and i must say that it's a very good port. everything is super responsive, 60+ fps and it shows. fast paced anime fun. it's addictive to fight, and you need to fight a lot.  definitely give this a try, even if you are not a fan, this might just change your jaded mind. ",
            "review_score": "1"
        },
        {
            "review_text": "At first it was really nice. Nice music voice actors and the art is just sweet and great. But it crashes at Sol Plains everytime I try to enter it. So I couldnt play more than the Introdution &amp; the first town. I really hope that you can fix this issue cause it seems I am not the only one with this problem. The tips from the forums didnt help.  Please fix it this game started really good.",
            "review_score": "-1"
        },
        {
            "review_text": "story is garbage but its got some choice ♥♥♥♥♥es tiara's a bae 10/10 would verbally abuse",
            "review_score": "1"
        },
        {
            "review_text": "great game and a great story ",
            "review_score": "1"
        },
        {
            "review_text": "If you played the neptunia games this is pretty similar. Main diffrence being you don't get to change weapons but you upgrade them with wp and unlock the moves like that instead of just leveling. The second is the shaping mechanic. You can put unused fairies into a dungeon and can get vartious boosts like more exp or more damage but get a negative effect in return like take more damage and stuff like that allowing you to customize dungeons the way you need atm. And probably biggest diffrences is there are dudes in your party.",
            "review_score": "1"
        },
        {
            "review_text": "must play",
            "review_score": "1"
        },
        {
            "review_text": "The Pros : 1. The story. 2. Character designs. 3. If you have experiences with Hyper Dimension Neptunia especially the battle system, this will be a piece of cake. 4. Multiple endings. 5. Musics 6. Anime girls.  The Cons : 1. The terrible version of Hyper Dimension Neptunia's battle system. 2. Boring Guild's Quests 3. Lack of dungeons designs. Boring as hell. 4. Fang is a motherf*cking ♥♥♥♥♥♥♥.  7/10 - And now they decided to remake(enhance/remaster/whatever that is)  the game. Like WTF. Hope that turns out well.",
            "review_score": "1"
        },
        {
            "review_text": "this game answers a very important question in life, while maintaining the balance of the universe asking another: first, red-twintailed x flat-tsunderes = best-girl. now, Advent Dark Force port to Steam, f'ing when?  _  that said, for the game itself, it's essentially Neptunia without nep-nep, but slightly more 'serious' as a JRPG (for what that's worth)",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good! The story is not so deep but it's also ok with me :3 This is the first time i've finnished this game! And i feel so Great! It's take me 30hour for finnished it. The music it's about 6/10 Characters : 8/10 story: 7/10 This game not just have 1 end - so u can enjoy it for at least more 3 times ^^",
            "review_score": "1"
        },
        {
            "review_text": "awesome game once you're in the story you keep playing it and a beautiful ending",
            "review_score": "1"
        },
        {
            "review_text": "I did'nt wanna refund it, but that new Payday 2 DLC looked pretty nice...",
            "review_score": "1"
        },
        {
            "review_text": "+The gameplay was prety good, but...  -The game's story is just............ too short, and too predictable.  -It's too VN like, but with only three different ending that doesn't seem to be that different one with another. The player's choice doesn't matter at all. At first i was like 'cool, i can set free the vile god instead of the godess!', but it does not change the storyline even a bit.  Overall i was a bit dissapointed ",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty solid JRPG. I bought it for the voice cast because the Japanese cast is almost all A or B-list seiyuu and I can even recognize some names in the English cast. The voicework alone justifies the purchase for me.  8/10 PC Port. It's missing:  - Ultrawide support (though props for 4k support) EDIT: There are some hidden options in the config, but some of them don't seem to do anything.  That doesn't make this a bad port by any means. It still runs smoothly and the gameplay isn't so intensive as to require any more than 60fps.  Also, Tiara best George Foreman grill.",
            "review_score": "1"
        },
        {
            "review_text": "Its fine, but the new console version on PS4 is more polished in everyway.",
            "review_score": "-1"
        },
        {
            "review_text": "So, here we are again, another jrpg game...  Now before I go into detail about certain game elements, I want to tell you that the recommandation is completely biased and you should try to decide for yourself if the game is worth the money or not. Also, you might've noticed I played this game for over 40 hours but I'm not reccomending it, and well, the reasons for that are explained below, if you want to read them.  First of all let's start with the gameplay, it's the usual IF dungeon turn-based combat in which you have certain characters to select from and you make a party of maxium 3 and go beating up monsters and leveling, and all those other elements you'd expect to usually find in a rpg. The combat is alright, and the controls aren't that bad either, considering the guys that made neptunia made this it's bound to be good right...  Next let's talk a little about the story and characters. The story is so blend it makes me puke, it's the usual ♥♥♥♥♥♥♥t there's an evil God and a good Goddess and you must revive the goddess and stop the guys who want to ressurect the God, and all that nonsense, seriously, the plot is also a mess, and they try to squeeze in all these elements inside just to cover up for certain plot holes. The easiest element that can do this for you: time travel... And the ending is exactly what you'd expect it to be if you have this kind of stories.  Well, you might be thinking, okay, if the story is bad, maybe the characters might help. Well, the characters are so typical, and tehy're the sterotypes of anime, which is what I hate the most about games such as this, unoriginal character concept is seriously a turnaway. You've got a typical lazy mc who wants to do nothing, two main love interests a tsundere and a yandere, the usual loli, the big boobed chick that's there for fanservice and don't get me started on the fact that there's a cat that talks or whatever that thing is. Now, don't get me wrong, the characters are what they are but there is certain plot development.  Next, let's go in detail about the music and voice acting. The voice acting is decent, I would say good, but that's still not enough to sell this game for what it is, considering the music feels repetitive and every song feels like the other, seriously I'd rather listen to my own songs than to the ingame music at some points.  The final element I'd like to talk about are the achievements, and how insensitive some of them are. Now don't get me wrong, getting the achievements is not a matter of skill but rather a matter of time in this game, with that being said there are a couple of achievements which are if not impossible, then they would take about a couple hundreds of grinding without using any dlc. And even with the dlc they would still take tens of hours to achieve.  Pluses: -decent gameplay -well implemented turn based combat -good voice acting -skippable animations Minuses -overused plot -stereotypical anime characters -repetitive music -mindless grinding  All in all Fairy Fencer F is not a bad game, neither a good one, it's in the middle and everyone can have an opinion about it. Seriously if not for the story and characters this would be a game to remember, but as it is of now, it's all about the grind, and even if you are to finish grinding you would still feel like you achieved nothing... ",
            "review_score": "-1"
        },
        {
            "review_text": "'Most relatable MC 20'whenever this game was released''  Played as animu grills in swimsuits, raging-boner/10  Played for the plot (insert lenny face here)  Fun gameplay and battle mechanics... No, I'm actually being serious.  Rating- 1 (Because I was raised to reduce my fractions (10/10) and not open the doors for door-to-door salesmen)",
            "review_score": "1"
        },
        {
            "review_text": "If:  * You loved Hyperdimension Neptunia Re;birth 1 * You bought Hyperdimension Neptunia Re;birth 2 immediately afterwards, and loved that one too * You failed to sign up for the Hyperdimension Neptunia Re;birth 3 closed beta by mere minutes * You watched the first few episodes of the anime to make up for it, but you can't go any further because of spoilers * You watched the full longplay of the PS3 Hyperdimension Neptunia game (and you were glad that you didn't play that version) * You still want more of the same, and you want it now * You are okay with the fact that every single time you activate HD--- I mean, 'fairize,' whatever encounter music is playing is replaced by the same cheesy engrish song * You are okay with the stares oblique stares about becoming THAT kind of person who plays THAT kind of games * You are okay with your favourite Steam tags cementing forever to 'RPG', 'Anime', 'JRPG' and 'Cute' (but not with 'Female Lead') * You hated hunting for hidden items in the Neptunia games, especially Re;birth 2 * You are okay with a somewhat more clunky interface * You are okay with giving up on all the strategy involving guard points and hurtboxes * You are okay with giving up on the HDD Drive meter carrying over between battles, so there's not really a reason not to rush straight for the end of each level * You are okay with having to unlock each tier of combo attacks with a hard-to-come-by resource (you need 1,000 'weapon points' to unlock the fourth normal attacks in a turn; the final boss is worth 6 WP). * You were annoyed by the forced losses in Rebirth 1 and instead prefer being yanked out of a perfectly winnable fight only to be treated to a cutscene where your party immediately gives up * You are okay with bosses announcing their final super-special ultra awesome attack... only to see they usually do two-digit damage.  ...then congratulations: Fairy Fencer F is more of the same stuff you liked, and you can stand its most glaring issues. I did, however, appreciate seeing chirprers being replaced by actual short cutscenes: the more character interaction the merrier.  All in all I really didn't care too much for the changes in actual gameplay and the way plans work in this game is somehow even more infuriating than Hyp-Dim-Nep-Reb (you can't see plans if you don't have any ingredients for it).  Here's a weak 'no' from me.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed play every single second, one of the best RPG games I ever played!  History: 9.5/10 Comedy: 10/10 Gameplay: 10/10 Visual: 10/10 Music: 10/10 Worth to pay: 100000/10  Awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "So far a pretty good JRPG, seems to be a competent port. Will update if any crazy crashes.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Hyperdimension Neptunia? If so this is that but with a new story and slightly different mechanics. If you did not enjoy Neptunias combat system you wont enjoy this games one.",
            "review_score": "1"
        },
        {
            "review_text": "I found Terriermon on this game",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Good Port. -Good Story. -Hilarious MC. -Funny Conservations. -I love the sound when they are in fairze mode . Cons: -I need ps4 controller layout =)) -Where is Tiara Simwear Set ?",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty disappointing in every way you can imagine. Lackluster dungeons with the most simplified designs possible, it’s not even an issue of the graphics being dated, that’s understandable. The issue is that they drew up these maps in about 30 seconds and said “we’re good to go!” By the way I just checked and this game came out originally in 2013! WTF! Xenoblade Chronicles came out in 2010 and for an inferior console and it looks about a billion times better than this! - Extremely simplified turn based combat, it’s all about keeping healthy and doing more damage, no crazy strategies here. If the game wants to give you a tougher boss they don’t actually come up with an interesting boss that will keep you guessing, instead they just do more damage and take less damage, quite simple and uninspiring.  - A story that on paper seems like they could have done something good with it but in reality there is no story here, just an intro, and a bunch of clichéd fan service crap and cookie cutter bad guys. - Oh, btw, there’s no walking into towns, digesting beautiful sceneries, exploring and adventuring, etc. Oh no, this game was made in power point, it’s just slides of text after slides of text with anime girls in questionable outfits and when you think you are done and you can go out and explore the world, all there is for you is a menu and several options to choose from before going to your next lame dungeon, there’s not even a real world map. There is but you can’t walk around it and fight monsters in it, it’s just a screen where you move a cursor to pick which dungeon to go into. - There is one thing that does make this game playable (barely) and that is the dialogue. 99% of the dialogue in this game is excrement but that 1% can be hilarious in ways you haven’t laughed in a game for a long long time.  My recommendation is don’t buy this horrible excuse for a JRPG and buy The Legend of Heroes Trails in The Sky instead (it’s on steam and it’s an incredible, incredible game) But if you must play it, do yourself a favor and buy the armor pack DLC that costs less than a dollar, that way you can breeze through bosses and finish this game as quickly as possible so you don’t keep hurting yourself.  OH, and a very important thing. If you are like me, married with family and happen to play your videogames at night when the wife sleeps, on the big screen TV with headphones, make sure she is very deeply asleep because my wife wakes up in the middle of the night and sees the tv and goes “oh, playing the witcher? Cool, have fun!” and goes back to sleep.  It’s not cool when she wakes up and sees cartoon gigantic boob dangling around the screen. Scratch that… 13 year old gigantic boobs and then looks at you with a “did I marry a serial killer ♥♥♥♥♥♥ pederast Hitler?!?!?”   AVOID PAIN, AVOID THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy this game and give Fang some food.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanna kill myself after playing this... -10/-10 IGN 'I was banging my wife while she was playing this game and instantly went flaccid' -Bill Gates (MicroSOFT)",
            "review_score": "-1"
        },
        {
            "review_text": "I was gifted this game as it is not the type of game I would normally play. I understand there is a following of this type of game, but honestly it is just a princess fairytale game with a paper thin story and repetative simplistic combat.  As the game started I immediately wanted to end my own life. I persisted through the weaboo trash and horrid story in hopes the gameplay may be good, Unfortunately the gameplay was equally awful.  Would strongly not recommend this game unless you're a weaboo - '0w0 *giggles* tehehe xD'",
            "review_score": "-1"
        },
        {
            "review_text": "Made by the same company of Hyperdimension Neptunia, so if you have played Hyperdimension Neptunia before and liked it, then you will love Fairy Fencer F. It has the same funny line but now with a male protagonist in it, the story is more interesting. There are also more fanservice!",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game I know of where you can put a socially awkard assassin in a school swimsuit and bunny ears.  If that isn't enough I don't know what to tell you.",
            "review_score": "1"
        },
        {
            "review_text": "For my first JRPG this game is amazing, and it has made me want to buy more JRPG's so i guess thank you dev team!",
            "review_score": "1"
        },
        {
            "review_text": "Funny, cute, stylish and serious when it needs to be. Kind of like a Tales series game with a turn based combat system.",
            "review_score": "1"
        },
        {
            "review_text": "it's really cute",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game is a bit short for me but the story is pretty impressive for me(if you compare to HDN series lol) This game needs some requirements on graphics, i5 4210u+840M=LAG If you love for Tsunako's drawing and want to enjoy the game besides HDN or even DaL series, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "If you love playing Hyperdimension Neptunia mk2 and Victory, then this game is for you. It has the gameplay style of mk2 and control of Victory. Nothing more to say.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great fast-paced RPG, with a great story line to if. I played with the DLCs the first time, which made it really easy to play, but over all, it was a great play through. Would reccomend to any gamer who loves to play JRPGs with a great story and wonderful graphics.",
            "review_score": "1"
        },
        {
            "review_text": "so..... much...... grinding.....",
            "review_score": "1"
        },
        {
            "review_text": "Rek is fairy, rek is pippin, pippin is life.",
            "review_score": "1"
        },
        {
            "review_text": "I was never able to play the Ps3 version of this game so when I heard it was getting a release on steam, I couldn't wait. Long stry short it was wrth it! Now recently, console ports and steam have not been getting along very well but this port is a good one.   Pros -Pretty good graphics -Dual Audio -Good music -Great Characters -Very fun battle systym -Tons of quests and items  Cons -Story is kinda bland but didn't mind -Framerate drops from time to time  Other than that, to me, Fairy Fencer F is easily an instant 8.5 / 10. This is one of the better ports on steam.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty funny and enjoyable JRPG. Nothing else to say that others didn't already. If you played any of their Hyperdimension Neptunia, then you know what to expect.",
            "review_score": "1"
        },
        {
            "review_text": "*NOTE IN HERE FOR ANYONE FACING A CRASH WITH A 'VideoCard.cpp (279) : DXFAIL : E_FAIL' WARNING* Before I say anything, let me say that there is a simple way to fix the above issue. I have Windows 7 and every time I ran the game, shortly after I start playing, I received a warning that said 'VideoCard.cpp (279) : DXFAIL : E_FAIL' and the game would automatically close. After looking at the forums, I found that by going to the local files and changing the game file compatiblity to 'Windows XP Service Pack 3' that issue disappeared immediately! To even prove it to myself I played it for an hour just now and it never appeared! As for the game, I DEFINITELY recommend it to ANYONE who loves a good anime sword fighting game! The graphics are AMAZING! The story is EPIC! The characters are BAD@$$! Everything about it is truly amazing! I was hesitant to buy it at first due to the price, and I even got it for steam for 8.99 through another site's deal too, but I do NOT regret buying it in the slightest! I honestly can't get enough of this game! Even at full price it is NOT a rip-off imo! Definitely try it out and see for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "It only took 11 hours to make a team comprised of girls. And they are all support roles.  10/10 would Nep Nep again     Ethel is best girl.                 ",
            "review_score": "1"
        },
        {
            "review_text": "many plot convenience but the story still good",
            "review_score": "1"
        },
        {
            "review_text": "The game's awesome, has a great story, some really funny characters, and a fun RPG overall. Sad I cant play it due to computer issues, but you should enjoy this treasure if you can.",
            "review_score": "1"
        },
        {
            "review_text": "NAO TOUYAMA MASTER RACE",
            "review_score": "1"
        },
        {
            "review_text": "A good waste of time.",
            "review_score": "1"
        },
        {
            "review_text": "- Fried Rice Simulator Teach you how to spell Fried Rice with 'Z' in it  - Nepgear Simulator With diff personality thou. Still top class  - Male NepNep Simulator Without 4th Wall breaking but still funny like NepNep  - JRPG Grinding as usual Welcome to JRPG where Grinding makes ur life easier for next battle.  - Standard storyline. Usual Good vs Bad or Dark vs Light stuff I prefer Grey mentality but this 1 is also good  - Nice OST Many good OST Esp transform Phase. Cool Stuff  - Hyperdimension Neptunia Battle System Similiar coz both are from same Company. Except u can't Cleave. Single Target is single target. No Cleave!!  Nice Game. Worth!! Tiara/10. More worth coz i bought this with -70% WInter Sale. Fried Rice/ 10   Some Cons for my Taste: - Keybinding is ♥♥♥♥. Took me a while to make the keybind similiar to my NepNep Game. Aka 'What is this button do? Where should i put it?' I am using KeyBoard btw.  - Grinding for 100Mil Gold Trophy is PITA Seriously... PITA. This Game has the hardest 100mil Money Trophy compared NepNep Rebirth 1/Rebirth2/ Rebirth 3.  - No Weapon Changing in term of Stat/ Changing Weapon Equipment U can change ur Armor/ Ring to get higher stat like buy from Store. But ur weapon is same. This Game use 'Upgrade System' to raise ur Weapon ATK. Not bad. But on late game when ur Upgrade System already max it started to feel weird. No feeling for 'What is the Best Weapon for [Insert Character name here] coz u always wear same weapon from begining lol. So on late game pretty much only stat from Level to raise ur Damage aka ur Weapon stat will be same. I prefer a Game with 'This is the Late Game Weapon for X Character' Stimulates me to grind for that Late/End Game weapon for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game! big fan now! pls bring 'Fairy Fencer F: Advent Dark Force' to PC :)  (Eryn best waifu)",
            "review_score": "1"
        },
        {
            "review_text": "Hmmm... What is my opinion ? If u are a fan JRPG i reccomend this game. Of course if u are a fan nep just buy this game, this is it. Many hours of good fun. Cute heroes. Addictive story. And Tiara, ohhhh mann...(i'm not a masochist of course) My rate : 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  1. Nice art. 2. Can walk around with other characters. 3. Can avoid enemies.  4. Stats are adjustable acording to fighting style 5. I don't regret playing this game haha  Cons:  1. Characters feel boring.  2. The levels are reused and boring. So boring I literally just looked at the minimap when running around.  3. Characters unlock late when you're invested into the first three.  4. An option to change costumes but hardly any costumes. 5. Game feels exactly like every blan JRPG that I forgot what I was playing. 6. Repainted enemies. 7. Jumping felt unnecessary. If you jumped only when needed you would maybe jump 30 times. That being said there is side achievments for jumping like 5000 times.  8. Faires collected are just cards. Like trading cards but they are only helpful to the character with the corresponding elements. So no trading the trading cards :P 9. The magic elements are divided among characters which prevent mix and matching of faries.  Final verdict:  5/10 Average ",
            "review_score": "1"
        },
        {
            "review_text": "I am loving the game 15 hours in so far. My favorite thing about the game are the characters and their personalities, and their interactions with one another. Feng is a lazy and hilarious MC, and the other characters compliments him very well with their unique personalities. The story is progressing great so far and the music is excellent. It lets you know when the funny moments are and when things are getting serious.",
            "review_score": "1"
        },
        {
            "review_text": "I believe that this game gives people a sense of adventure and can give a bond with the character in a certain way it gave a challenge and gave me something to work for in short terms it's a good game",
            "review_score": "1"
        },
        {
            "review_text": "Just finish this game. so far so good, been enjoying both endings,  I hope Fairy Fencer F advent dark force will release in steam. sinceI have high expectation on this company though they really not that big company.     Tips: if you want to recruit hidden characters just read some guides :D  ",
            "review_score": "1"
        },
        {
            "review_text": "THANKS BASED TSUNAKO",
            "review_score": "1"
        },
        {
            "review_text": "Played through the PS3 version years ago and gotta say I loved it. How this PC port is going to work? I dont know, but I'm sure I'm going to have great time with this one :D.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the BEST JRPG games i have ever played. Brilliant story with hilarious characters.  A lot of grinding is to be expected from the game, but what game doesn't have a grinding aspect?  Buy it, play it, love it.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is the best RPG I've ever played. anyone having doubts about the fighting style should still try it. gameplay videos cant show the game's beauty. It's amazing and everyone should try it for them for themself before judging it. I can honestly say I misjudged this game and never thought it would be this good. so far I have a total of 10 hours and i got it today ewe it's hard to stop playing ^^",
            "review_score": "1"
        },
        {
            "review_text": "Now then your looking for a review right? well here it is. buy this game.  nah not really but i can recommend this game to anyone who likes anime or the neptunia seires   The pros +entertaining battle system +likeable characters (but avoid tiara like the PLAGUE)  pro/cons +-MANY references to MANY things  +-the obvious fanservice here and there  The cons -much like neptunia you must grind (and i mean MUST) -quite short for this type of game (20 hours if you rush)  -Tiara   A game you will love if you liked hyperdimension neptunia i almost cried at one of the endings but i am a MAN who will not cry most of the time. Did i say that i hated Tiara? well i hate Tiara.",
            "review_score": "1"
        },
        {
            "review_text": "Like the Story Line of the game it's really Fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a great game. It has all i want from a jrpg, Good story, good characters, good gameplay n good soundtracks",
            "review_score": "1"
        },
        {
            "review_text": "Pretty funny and enjoyable JRPG. Nothing else to say that others didn't already. If you played any of their Hyperdimension Neptunia, then you know what to expect.",
            "review_score": "1"
        },
        {
            "review_text": "Even better than the neptunia titles. If you like those you will like this even more.",
            "review_score": "1"
        },
        {
            "review_text": "Good fun... until it completely regurgitated half of the content, lost all semblance of difficulty and ended without resolving other integral parts of the game.  You are introduced to the Godly Revival system in which the premise is that you have to collect the furies and revive the Goddess. The concept had potential and provided some drive for the story, but was promptly thrown aside for a seemingly separate storyline.  Enjoyable for the first few hours, but I was left feeling more and more disappointed as it went on.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the BEST JRPG games i have ever played. Brilliant story with hilarious characters.  A lot of grinding is to be expected from the game, but what game doesn't have a grinding aspect?  Buy it, play it, love it.",
            "review_score": "1"
        },
        {
            "review_text": "Thought i would buy this game as it was on sale and i was so glad that i did too, great game, funny asf story, good battle mechanics. Defo worth buying it in the sale or even full price.",
            "review_score": "1"
        },
        {
            "review_text": "This game, I have been playing for over 40 hours. the playthrough is amazing. I really enjoy the story and there is plenty to do. It is a grind game but at least they make it fun. I hope to see more add ons to the game",
            "review_score": "1"
        },
        {
            "review_text": "Fairy Fencer f was beautiful. This is going to be a long review, so if you don't like reading, then the first sentence sums it up.  I've played many RPG and JRPG games through my life, and most of them were pretty spectacular. Golden Sun, Persona 3 and 4, Pokemon (if that counts), Chrono Trigger, Fire Emblem: Awakening, and Skyrim, to name a few. So I'd like so think that I've seen all the odd's and ends of what RPG/JRPG games should feel like.   Fairy Fencer f had every good thing RPG's have to offer. The story, the art, the music, the characters, the combat system, the customization, the grind (maybe not good to some people), and most importantly for me, a DYNAMIC main character. I'll be going into details, trying to avoid spoilers since I always hover over them anyways.   Story:  FF's story seems basic at first. Two deity's, the benevolent Goddess and the vile Vile God, each fighting to take over the world. They both get sealed away, and the world is left alone all normal. Your quest is to collect Furies (sealed fairies) in order to revive the Goddess and get your wish granted. Seems prety run-of-the-mill, right? But then you meet your two protagonists, the unlikeable Fang and the sarcastic Eryn, and you quickly get pulled in by Compile Heart's signature comedic dialogue. And in classic JRPG form, a TON of twists happen throughout the game that make you upset, confused or heartbroken. They come fast and strike hard, leaving you devastated or driven enough to keep playing; to solve whatever just happened. The story is far from basic. It's a wonderful tale of treachery, love, heroism, justice and cookies. Oh and Pippin I guess...   Art &amp; Music:  Everything in this game was gorgeous. The landscapes, the cutscences, the characters, even the menu's were well designed and easy to use. The music gave emotions to the dungeons and aligned with events in the story; mystery, excitement, regret etc. I will say that you'll be sick of hearing the word 'Metamorphosize' halfway through the game, since it's the first word of the theme song that plays when you Fairize. I figure I should also mention Voice Acting since that was pretty great too. I used the English voices because I knew Christine Marie Cabanos was in the cast. There was plenty of emotion, and none of the voices were painful to listen to like Compa from HD (Except Pippin)   The Character's:   I'm as much of a fan of your 'Tsundere' or 'Onee-Chan' trope characters as the next guy. Heck, I played through Hyperdimension and found it enjoyable. For those of you who don't know, basically a trope is a stereotype, for example the 'Rich girl with the annoying laugh'. But there were only three characters I can think of that fit into a solid trope: Soji, Apollonius and (maybe) Zenke.  All the characters were so completely diverse, and their chemistry was amazing. You had the 'Tsundo-masochist', 'Jarl Ulfric the Baker', 'Kill, Kill, Kill', and the 'Japanadian'. All the characters had interesting backstories, and you really felt like you were growing with them on their journey. Just not Pippin though.   Combat/Customization/Grinding:  The game consists of an Overworld, a single Town, Goddess Revival and Dungeons (Shukesoo's Tower included). Similar to most RPG's, the dungeons are filled with non-random enemy encounters that trigger a battle sequence. You can gain the advantage outside of battle by hitting the enemy first (akin to Paper Mario).  The combat system is almost identical to Hyperdimension; turn-based strategy. You can customize your team in many, many ways. You can change combos, armor, Fairies, stats, formation, members, partners, accessories and even fighting styles (Turning a brawler into a gunner, for example). The only thing I was disappointed with in terms of customizations is that   there are only two costumes per character  . Everyone gets a default costume and a bath towel/bathing suit (DLC, by the way), with the exception of Ethel, who has three. I love grinding in RPG's. Shoot me, I'm weird. But this game was special in that it was actually fun to grind. You can upgrade each character individually using points earned from battle. Tiara can either be an all-out magic user or a Glavie wielder, or a swordsman, or an archer etc. It's very fun to play around with different strategies. I never used Pippin though, so I can't give analysis on that...   Fang:   Fang get's his own section because I hated him at the beginning. If you've ever watched a Romance/ Slice of Life anime before, you've met Fang; Lazy, undecided and unworthy of the ladies he's surrounded by. But oh my word. That is all I'll say. Let him annoy you, allow him to get at you and then you will feel all the emotion I felt through this game. Amazeballs.  In conclusion! Story: 9/10 - Draws you in. Makes you think, work and FEEL. I got the ending I didn't want, so maybe I'll edit this later.  Gameplay: 10/10 - I love the mechanics. Dungeons, shopping for armor, grinding. The whole RPG shindig.  Character's: 10/10 - Individualistic, lovable, and well defined. But Pippin...  Music: 9/10 - Electronic? Orchestra? J-pop? Rock? Yup, and it's all great. But one over repetitive song robs this of a 10.  Replay Value: 10/10 - Hard Achievements, three endings I'm dying to see, and ridiculous character customization.  Overall: 9.5/10 This game truly deserves to be among the great RPG games out there. Where Hyperdimension is niche and weird, Fairy Fencer f is a beautifully crafted masterpiece of a game that I would kill to play again for the first time. I highly recommend this game if you are a casual, hardcore or die-hard fan of RPG, JRPG or Anime games. ",
            "review_score": "1"
        },
        {
            "review_text": "Harley is love, Harley is life",
            "review_score": "1"
        },
        {
            "review_text": "Great game and I really enjoying play this game. The story so far is great with amazing story. 20 hours af playing this game and i think the story still very far from ending so it really worth your money though i buy this on sale about $5 or so. If you like Neptunia series then you'll like this where they came from same developer.  What I don't really like about this game is that you have to learn from net about monster, tactic, and what kind of attack that monster weak for. You'll get basic tutorial and stuff but it not really tell you what element weak against what element so it abit difficult for new player in RPG genre like me. And when you play with keyboard i just don't get it about why they map keyboard button like that because it's kinda absurb like you jump with backspace LOL, so i recommended using controller instead.  But overall I love this game so I recommend this game for you who like TBS game, visual novel story and anime style character.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it already!",
            "review_score": "1"
        },
        {
            "review_text": "Like Nep, but with some dudes too",
            "review_score": "1"
        },
        {
            "review_text": "Well Contructed game   will keep supporting developer 10/10 (expect their otome games..)",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it already!",
            "review_score": "1"
        },
        {
            "review_text": "really good game so far",
            "review_score": "1"
        },
        {
            "review_text": "IF game. Always enjoyable JRPGs, provided you like VN/JRPG games",
            "review_score": "1"
        },
        {
            "review_text": "Like Nep, but with some dudes too",
            "review_score": "1"
        },
        {
            "review_text": "Quite good enough JRPG, per sure.  This game have a nice, enjoyable storyline, and if you're just a speedplayer, you're definitely losing the main plus side of this game. Though the repetitive battle is abit boring plus annoying (especially if your characters are underleveled in a chapter), the Tower itself could help you to get some easy cash. (lol)  Let's head to the storyline. A lazy man who is forced to join fencer's adventure. The story balance is quite perfect, you'll get a dramatic and humor part at the same size. Don't forget to read all the subevents to enjoy the story at its fullest.  That's it? That's it. Don't ask where is Nepu.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed HyperDimension Neptunia, you'll love this. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun JRPG, its battle system is familiar and fun, grinding is pretty enjoyable and pays off significantly. There are many areas where your characters will be tested even if you grind like crazy, the best thing is that these areas are optional so you don't need to worry about needing to grind in order to advance in the story.  I'd strongly recommend it to anyone who enjoys JRPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! Great game, great story. Another good JRPG in the steam.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to be short, if you like visual novels and Jrpg this game is for you. in case you don't like these genres or hate stupid jokes stay away.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely an enjoyable game. The battle system is intuitive, and you get to improve stats/skills as you choose. It gets a bit spammy with certain moves later in the game, and there were definitely times where I felt the game expected you to grind somewhat for levels, but it IS a JRPG, and it wasn't that bad.   Honestly, the main negatives to this game (and I say that as someone who would absolutely suggest getting this game) are the fact that the Godly Revival choices don't affect the plot, even if you never touch the Goddess and only remove Furies from the Vile God.  And there's a 'new' version of the game that they created called Advent Dark Force where exactly that happens, so. The only thing I'm hoping for now is that FF:ADF gets a Steam release, since it's currently only slated for a PS4 release in the West later this month. Fingers crossed.",
            "review_score": "1"
        },
        {
            "review_text": "This is a light hearted JRPG. It’s not too long nor too small. It’s perfect to spend some time. While not particularly groundbreaking in any sense, it’s a very good game. It starts in a very comedic tone, and even when it gets into the main plot it never goes near dark. The dungeons are somewhat repetitive, but there are no random encounters, you can see the enemies on the screen and avoid them. The Tower is a very nifty way to take away the grind in dungeons, almost all side quest important items can be found there, and it’s a quick way to gain exp, money. Don’t try to do everything on the first run. If you try to finish all side quests it might go for about 20h. On NG+ you’ll stomp everything that moves and are finally able to do some other side quests, recruit extra characters, get another ending (there are three different one) and focus on other stuff, like crafting. It’s a good game. Ig you like the art style and jrpgs, this one is a good one, not the best, but good to relax form others like the Agarest series (80h a game with obligatory battles every move, it’s nuts).    About the DLCs: the important ones are already included in the game (the tower ones). Some aren't very good (like the bath set) and other just break the game until lvl 30 zones (in first run you'll end up around lvl 40) so it's your call. ",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR -&gt; Even if I recommend you play this game, be aware that it's NOT for everyone. This is a jrpg (and a fairly easy one I'd say) with a visual novel-like narration and very interesting characters, lots of grinding and several 'meh' plot twists, so if any of this bothers you, you're probably not gonna enjoy it. Otherwise, go for it.   There's plenty of things to dislike in FFF: Running into dungeons for hours because Fire Stones aren't spawning. Those stupid plot twists where almighty gods and creatures are inside people and objects. The fact that the boss hit you for 50 damage and the cutscene's like 'AW, MAN, HE'S SOOO STRONG, WE NEED TO RUN AWAY'. And about this point, the game's too easy. Enemies do very little damage, and if they do, you've plenty of healing magic to deal with them. Also, Fang is in the game. And even if with time he gest a little better, your first impression of him is that he's a patented ♥♥♥♥♥♥♥. Not a good quality for your supposed protagonist, isn't it?  But what FFF does good, it does VERY GOOD. The music is FANTASTIC. The fact that everytime you break a seal of the Goddess she loses a shard that covers her, and reveals her voluptuous body, keeps you motivated. The characters are wonderful, and probably the best aspect of the game. Everyone of them has a fairy companion, so you basically interact with a 'couple' instead of a single character. These couples are funny and have very well defined personalities: there's the noble-like girl with her pokemon, the lazy girl with a big bald man that scolds her, a dumb and lovely fellow with her fairymom, and, well, a green cat with a blue afro and a sword through his skull, and his sexy male butler. I couldn't make this up even if I wanted. The point is, it's a funny bunch. It's lively, it's noisy, and it feels like a real adventuring party where everyone is given a bit of spotlight. Also Harley is the best thing in the game and so is the fanservice regarding all of the female characters.  The combat is also good. You've got this weird combo system instead of a single attack, you can chain combos between allies and air juggle enemies with the right setup. It's not really intuitive, but as soon as you get it, you're gonna go full Soul Calibur on those bizarre monsters. You can transform, or Fairize if you'd like, and use super-final abilities. Both of those things feel AWESOME every time you watch them, it really spices up your regular jrpg turn-based combat. So even if you're levelling up or grinding WPs, you're not gonna get bored. Well not immediately at least. WPs are basically experience points to upgrade your characters. It's fun to have it, but you're soon gonna find yourself in the mental state that 'you're gonna unlock everything', so it's not like you can 'build' characters. Keep that in mind.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i have ever played. It's fighting with Fire Emblem (FEA OR FE6) to be in first place. All the characters are lovable and funny, the story line is great. Its just like the nep games, but they have a decent story (not throwing any hands tho). I enjoyed this game so much i even decided to get platnuim for it ( all trophies)",
            "review_score": "1"
        },
        {
            "review_text": "Combat system works fine. The story and characters are a bit cliché but still enjoyable. The game globaly lack ambitions.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Hypderdimension Neptunia but just couldn't relate to the Moe All-girls cast then this game is for you. The game also suprisingly gets progressively more 'edgy' as the game goes along as well, changing from usual animu shenanigans to spec ops:The Line moral questioning",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR -&gt; Even if I recommend you play this game, be aware that it's NOT for everyone. This is a jrpg (and a fairly easy one I'd say) with a visual novel-like narration and very interesting characters, lots of grinding and several 'meh' plot twists, so if any of this bothers you, you're probably not gonna enjoy it. Otherwise, go for it.   There's plenty of things to dislike in FFF: Running into dungeons for hours because Fire Stones aren't spawning. Those stupid plot twists where almighty gods and creatures are inside people and objects. The fact that the boss hit you for 50 damage and the cutscene's like 'AW, MAN, HE'S SOOO STRONG, WE NEED TO RUN AWAY'. And about this point, the game's too easy. Enemies do very little damage, and if they do, you've plenty of healing magic to deal with them. Also, Fang is in the game. And even if with time he gest a little better, your first impression of him is that he's a patented ♥♥♥♥♥♥♥. Not a good quality for your supposed protagonist, isn't it?  But what FFF does good, it does VERY GOOD. The music is FANTASTIC. The fact that everytime you break a seal of the Goddess she loses a shard that covers her, and reveals her voluptuous body, keeps you motivated. The characters are wonderful, and probably the best aspect of the game. Everyone of them has a fairy companion, so you basically interact with a 'couple' instead of a single character. These couples are funny and have very well defined personalities: there's the noble-like girl with her pokemon, the lazy girl with a big bald man that scolds her, a dumb and lovely fellow with her fairymom, and, well, a green cat with a blue afro and a sword through his skull, and his sexy male butler. I couldn't make this up even if I wanted. The point is, it's a funny bunch. It's lively, it's noisy, and it feels like a real adventuring party where everyone is given a bit of spotlight. Also Harley is the best thing in the game and so is the fanservice regarding all of the female characters.  The combat is also good. You've got this weird combo system instead of a single attack, you can chain combos between allies and air juggle enemies with the right setup. It's not really intuitive, but as soon as you get it, you're gonna go full Soul Calibur on those bizarre monsters. You can transform, or Fairize if you'd like, and use super-final abilities. Both of those things feel AWESOME every time you watch them, it really spices up your regular jrpg turn-based combat. So even if you're levelling up or grinding WPs, you're not gonna get bored. Well not immediately at least. WPs are basically experience points to upgrade your characters. It's fun to have it, but you're soon gonna find yourself in the mental state that 'you're gonna unlock everything', so it's not like you can 'build' characters. Keep that in mind.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR A mediocre JRPG + small doses of PLOT.  I've played a lot of jrpgs in my time but these days I usually don't have the patience for them. That said I did finish the game and even had the intention of playing a NG+. Spent the time to make sure I had everything important maxed. And then I saw the ending (eryn's)... and I lost all motivation. It's not to say it was bad.. just meh. After that I watched the other endings on youtube and imo I got the best of the three. What probably kept me playing was the VN-like vibe to the game. But in the end the game is mediocre across the board. Get it on sale if you want a time waster.  +Random/Area transitions are quick. If you like to grind for some reason you'll appreciate the efficiency. +There's fan service.. even if there's not a lot of it and gets tired after a while. +Thank god they kept the Japanese voices. Listening to the other endings in english made my ears bleed.  -Combat lacks any practical depth. Supposedly mobs have weaknesses but you can pretty much mash your way thru. But who buys this for game mechanics? -The PLOT sucked all of the plot from the story. If you're hoping the game might defy your expectations you'll be disappointed.  -40 is not equal to 100 furies. Sounds like development ran out of steam or they gave no fairies that the intro goal had no correlation to the ending. -There are a couple points gathering mats for quests becomes a real pain. If you don't intend to play ng+ save yourself the time and don't even bother with the side quests.",
            "review_score": "-1"
        },
        {
            "review_text": "Compa and IF really did a great job on this game.     Pros",
            "review_score": "1"
        },
        {
            "review_text": "Hey I'm not the biggest fan of JRPG games (well, not since my old Gameboy Advance days anyway) but if you remember games like Golden Sun or others of that ilk, you'll like this one... it is almost fully voice acted with native english speaking voice actors... the game is fun and filled with lots of instruction to help you learn... Again, if you love turn-based JRPG's from the old days You'll love this one!",
            "review_score": "1"
        }
    ]
}