{
    "app_id": 3480,
    "name": "Peggle Deluxe",
    "release_date": "2007-03-06",
    "developer": [
        "PopCap Games, Inc."
    ],
    "publisher": [
        "PopCap Games, Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Arcade"
    ],
    "achievements": 0,
    "positive_ratings": 1106,
    "negative_ratings": 66,
    "price": 4.25,
    "description": "Take your best shot with energizing arcade fun! Aim, shoot, clear the orange pegs, then sit back and cheer as 10 whimsical teachers guide you to Peggle greatness. Conquer 55 fanciful levels with 10 mystical Magic Powers, racking up bonus points and shots you'll smile about for weeks.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3480/header.jpg?t=1447350989",
    "minimum_requirements": "Minimum Requirements: Windows 98/ME/2000/XP/Vista, 256 MB RAM, 500MHz or faster, DirectX: 7.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wow!, what a colorful and addicting game this is. When I first played Peggle several years ago it took me back to the old arcade games I used to play when I was a kid, standing on the pier spending all of my money on those machines. That game was called Pachinko, (where you send a metal ball bearing spinning around a series of peg like mazes, trying to get your ball to drop into various cup like recepticles on the board) and it is still all the rage over in Japan where whole arcades are devoted to the game.   Peggle has become one of my favorite 'short term' arcade games of the last decade barring Ricochet Infinity and Gish. What I mean by short term, is the ability to play for just a few moments in between other games, or when on a coffee break from more important things. With Peggle, you have to attempt to knock out all the orange pegs from various arrays of blue and orange pegs (55 levels in the adventure mode) using a ball launcher/cannon that fires a ball from the top of the game board. You get 10 balls to clear the board of the orange pegs. If you can clear the whole board of both orange and blue pegs plus any special pegs, you get extra bonus points. There's a bucket like object that is constantly on the move at the bottom of the board. If your ball falls into this you get your ball back which in turn makes it easier to complete the round. There's also more points gained depending where your ball finally comes to rest, with a jackpot score of 50K from the central well, 25K from the two adjacent wells and 5K from the outer wells. The first time you fail to hit any pegs you will get your ball back, but this only happens once on each board. Each new board includes two green pegs that give you one of several special powers when you clear them away. These can help you clear the orange pegs away easier, for example you may get a double ball that enables yopu to clear away a lot more pegs, especially if you get it early on in the level (as more pegs get in the way), or extend the length of the ball catcher to give you a greater chance of catching the ball and getting it returned to the ball launcher or a marker that shows you where your ball will bounce. Some of the powers come into effect immediately (like the double ball which only lasts for that turn) or on the next turm that last for the next three turns; (the latter power is very useful for aiming your ball for maximum effect). Each of these specials continues through several levels before changing to a new power, that are introduced via Peggle Masters. There's also a purple peg that when hit gives you bonus points. Each time you flick a new ball, the purple peg changes position. Scoring over 250 000 on one board gains you an extra ball as well.  There's four different modes included with the PC version, Adventure mode with 55 levels spread over 10 stages, quick play, which allows you to play any board you've already unlocked, duel that allows you to play against either the computer or a friend (with the X-Box version you can play online against up to 4 players) and finally theres the challenge mode, which has 75 harder levels and is locked until you've completed the adventure mode.   There's two different versions of the game available on Steam, Peggle Deluxe and Peggle Nights, both of which are well worth buying if you like arcade games. Sadly there's no level editor, but Steam do have a free version Called Peggle Extreme that features levels dedicated to Half-Life 2, Portal and Team Fortress. There's only ten levels with one special (also known as Peggle Masters), and five Challenge levels, but it's enough to gives you an introduction to the game. It's more like a demo, but is different to the two commercial versions, so is worth getting if you like the game. I think they also made a second free themed version that's not available on steam, but I've forgotten what the theme was.  The beauty of this game for me is that it never gets boring. The levels are vibrant and enjoyable to play; each time I replay the adventure mode or replay levels via the quick play mode the game is never the same and it's great playing against friends or family, sadly it's only local play on the same computer and you share the 10 balls. If you play against the computer you can select one of four difficulty modes.   The game is only £4.99 on steam in the UK or $4.99 in the US (it's cheaper to get a freind in the US to buy it for you if you live in Europe). I oriignally paid $20 for each version via Reflexive Arcade when it was first released seven years ago.  You can see a video speed run of the whole game   HERE   (it's 2hr 14mins in length), which gives you the opportunity to skip ahead and check out all of the various levels available in the deluxe version or you can check out the free Peggle Extreme version   HERE  ",
            "review_score": "1"
        },
        {
            "review_text": "Addicting and amazing, but you shouldn't buy this on your PC. You can't change the resolution from anything other than 800x600, compared to Peggle on Xbox 360 and iOS which take up the maximum screen real estate. If you can, get those versions instead. However, one advantage to the PC version is that you can use your mouse cursor as a de facto crosshair to aim your shots more easily.",
            "review_score": "-1"
        },
        {
            "review_text": "why am i so good at this game",
            "review_score": "1"
        },
        {
            "review_text": "Peggle is a fun pop cap game. This is a game thats very easy to play and most people can understand what it is and how to play. This is a fun game but it is a game you can play some were else for free like online on game sites so i would get it only if it is on sale. Other than that this is a fun shoot the ball hit the orange pegs and you will win. The colors are amazing and bright. This game can be played by all ages i strongly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "For those who like coin pusher machines but don't like risking your pennies.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and addicting game. It's a good time waster if you feel like playing something simple and quick.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the graphics fool you. This is probably the most addictive high-score-fest that I've played in a good long time, and was def. worth the dollar I picked it up for on Humble Bundle. (What can I say? Minimum Wage.)",
            "review_score": "1"
        },
        {
            "review_text": "It's mother♥♥♥♥ing Peggle, you shoot the ball, it bounces all over the place and you get points and it never lands in the middle pit at the end, nope it's always the side pit with less points.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I first played this game on Xbox and it was fun lazy activiyt, so I was excited to find it on PC as well, the graphics are not as great looks like they did not actually remastered it for the PC versin, but the lazy fun game it is still good. I would recomend this game to anyone who has some time to kill and wants something to relax with.",
            "review_score": "1"
        },
        {
            "review_text": "peggle is super addicting and fun, for me its a bit challanging but its worth it",
            "review_score": "1"
        },
        {
            "review_text": "It's typical PopCap brain-candy. Tons of fun when you wanna kill time without thinking too hard. Destroy pez-like pegs with a pinball. Win and you get fireworks AND opera music. Seriously...what's not to love?!?",
            "review_score": "1"
        },
        {
            "review_text": "A solid mix of strategy, fun and replayability.",
            "review_score": "1"
        },
        {
            "review_text": "Peggle is more fun than any game has any right to be.",
            "review_score": "1"
        },
        {
            "review_text": "Tags : Casual - Clicker - Slow Paced  Basically this is like a mutated version of pinball. Instead of controlling pallets at the bottom you just gotta shoot the ball from the top and try to catch it in the bucket in the bottom, with a bunch of bouncy pegs on the way down, hit all the colored pegs before you run outta balls and you win. Popcap did a really great job here, despite the aging software it still runs nice and smooth, fullscreen and with as always non annoying background music and pleasant sound effects. Addictive. Unlockables with more modes and special conditions as you progress through the campaign, which is symbolized by cute cartoon animals that still dont come across as overly childish. Great pick here  I recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best casual game on steam. (Even maybe the best casual game ever) This game is just perfect!",
            "review_score": "1"
        },
        {
            "review_text": "Most relaxing game ive ever played!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Most fun with balls I've ever had!",
            "review_score": "1"
        },
        {
            "review_text": "I don't even need to reccomend this, just get it when it's on sale and you'll play it forever.",
            "review_score": "1"
        },
        {
            "review_text": "horrible game. i went through the ENTIRE adventure part, which took me 5 hours, and i went back to do the challenges and ALL my work was gone. THUMBS DOWN",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. It is terrible converted from consoles. It don't even have proper graphic menu. ♥♥♥♥. I want my money back. Thank you.   BTW. Peggle nights is the same.     DO NOT BUY!",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "-1"
        },
        {
            "review_text": "The pinnacle of casual gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most relaxing, casual, and overall super fun to play. Easy to pick up and hard to put down this game has an expansive amount of nice puzzles to keep you entertained for quite a few hours. Maybe to kill time, cool off, or just have fun Peggle is definitely a good one.",
            "review_score": "1"
        },
        {
            "review_text": "A fun time killer that can be deceptively complex on higher challenges.",
            "review_score": "1"
        },
        {
            "review_text": "This game seriously sucks ♥♥♥♥, however I like having my ♥♥♥♥ sucked. Therefore I reconment this game",
            "review_score": "1"
        },
        {
            "review_text": "What's better then peggle? More peggle!",
            "review_score": "1"
        },
        {
            "review_text": "Remeber plinko? This is kinda like that, except there are magical unicorns and fireworks when you win.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game on steam 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Peggle makes me happy. It's a stupidly pointless game that heavily resembled Pinko and I'm super ok with that. You launch a ball and try to clear all the orange 'peggles' so you can proceed to the next level. Depending on who your character is, if you hit a green 'peggle' it ignites their speical power which allows you to play the game a little effectively. Not exactly but close enough.   Some of the levels are trickier than others. I know I've played some countless times just to try and clear it. Then again I have horrible predicting the trajectory even if the game is helpful enough to tell me where it will go after I position it to its first target. Though I am wicked at getting free balls.   If you like time killers and casual, brainless bliss, pick up this game.",
            "review_score": "1"
        },
        {
            "review_text": "HOURS of ball-bouncing, peg-smacking, Ode to Joy MADNESS. I've had Peggle across 3 different platforms with enough hours played to feel ashamed of, and I still can't get enough! A variety of characters (each with their own special ability) and maps keep the point-and-click gameplay fresh and entertaining throughout. Duel mode is great if you've got a friend over, however some character/level combinations are imbalanced, especially if you're able to activate the special power at the right moment. Selecting the same, or random, characters in duel mode keeps it less cheesy. Peggle is great for younger gamers as well. Think of it as an excitingly colorful, goofy Pachinko game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the first games I got on Steam and still one of my favourites. I enjoyed working through the challenges after completing the adventure mode and it's a good game to dip in and out of if you don't want to be playing for hours (though I have lost many hours to it :D ).",
            "review_score": "1"
        },
        {
            "review_text": "I've loved this game ever since I was little, and recently discovered it on steam. I bought it, opened it, played it, and closed it. Now, it won't open again. A 'fatal error' shows up every time I try. Wonderful game, but too bad I can't actually play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Need to kill some time? Here you go. Gameplay is simple: launch balls at the pegs, try to clear as many as you can. Each character has a different power that aids you as you play. Make epic shots, save replays of them to remember for the ages.  It's inexpensive and gets even more inexpensive during sales, so you're really only cheating yourself by not getting it.",
            "review_score": "1"
        },
        {
            "review_text": "I have bought this game twice now, once for my mother and once for my daughter (and me). It's a great game for those who want a fun experience without much overhead. The mechanics are simple enough for a child to understand and at the same time, the level design can get extremely challenging. I have found it to be great mouse practice for my daughter.",
            "review_score": "1"
        },
        {
            "review_text": "I played Peggle Deluxe and Peggle Nights on PSN getting all the trophies and did just about everything you can possibly do in the games. When I saw the opportunity to pick them up as part of a Humble Bundle on Steam recently, I decided to go ahead and start playing both on Steam.   It's definitely difficult describing the joy that is Peggle. Regardless of what kind of games you like, there are very few people who dislike this game. Even my wife who doesn't play video games loves Peggle. Rather than describing the game which would sound pretty boring in description, I simply suggest that anyone of any age or sex try it out.   The game is non-violent, simple yet requires quite a bit of strategy as you get into harder levels, and rewards you well for your skill.",
            "review_score": "1"
        },
        {
            "review_text": "A survival horror, which makes other games of its genre sleep with the lights on. Possibly the most horrifying game i have ever played, in the same vein as Doom3, but with elements of Insomnia, such as when you have to traverse the minds of convicted serial murderers unarmed.  The graphics are incredibly sharp, which on several occassions made me physically duck when dismembered limbs are hurled towards the player, trailing gore and pus in equal measures.  The revolutionary new ambient sounds are so perfectly and subtly programmed, that once or twice I could hear what i thought was Peter Sutcliffe, the infamous 'Yorkshire Ripper' killing and eating a prositute in my kitchen.  This game also supports a new variation on the 'lives' policy. The game doensn't use a conventional heath bar or damage meter, rather if your character is harmed there is a 1/1000 chance that the design team will send round a bloke to break your arms with a cricket bat, which really adds to the tension.",
            "review_score": "1"
        },
        {
            "review_text": "This game may seem silly or stupid cause of how basic it is but once you start to get into it you can't stop.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. The kids really enjoy it too which is a bonus. Highly recommend for some casual fun.",
            "review_score": "1"
        },
        {
            "review_text": "Peggle....Not much I can say bout it other then its good when ur bored and have nothing else to do...if u have Peggle Nights..if almost the same...Peggle is an easy game relitivly and fun!..highly Recommended :P",
            "review_score": "1"
        },
        {
            "review_text": "I really don't know what to say about this game. Peggle is a fun, mindless game which is good to kill time. Seriously, grab it if you can, cheaply I may add. Sometimes it can be a bit luck based but, overall, something anyone can pick up and play",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, very addictive. I first heard of this game back in the earli 2000s through Computer Gaming World (later changed name to Games for Windows), specifically through their Editor in Chief, Jeff Green. To this day, I still curse Jeff Green for introducing me to this game. I have wasted so many hours playing this god forsaken game, BUT ITS SO FUN, DAMN YOU JEFF GREEN. I also wrote a quick comment/quote to the magazine damming him, which they printed, so that made up for it. Superb game, though, really simple, yet incredibly fun.",
            "review_score": "1"
        },
        {
            "review_text": "I spent a dollar on this game. I don't know why...",
            "review_score": "1"
        },
        {
            "review_text": "Another wonderful game from Popcap.",
            "review_score": "1"
        },
        {
            "review_text": "t's SO ♥♥♥♥IN EXCITING WHEN YOU GET THE LAST PEG AND TEHRE'S A RAINBOW AND SINGING OH NO IT'S SO GREAt I FREAK OUT EVERY TIME",
            "review_score": "1"
        },
        {
            "review_text": "~~IT'S PEGGLE~~",
            "review_score": "1"
        },
        {
            "review_text": "It's Peggle. You shoot a ball at some bricks and it's the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "My wife says, 'Just one more addictive game from the makers of Plants VS Zombies.'",
            "review_score": "1"
        },
        {
            "review_text": "A good game for when you've got home from the pub and can't even see straight.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games ever created by mankind",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly addictive. Very bright, very colourful, actually a lot of fun",
            "review_score": "1"
        },
        {
            "review_text": "look...don't be a doof...just play peggle...",
            "review_score": "1"
        },
        {
            "review_text": "This game is best game. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. It is good.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously can not go wrong with youngs kids, and this game. I got it so that my nephews will not fight over who gets to play minecraft on the tablet. But now it is turning into fights about who gets to play this haha. And also it is pretty addictive for myself.",
            "review_score": "1"
        },
        {
            "review_text": "this game took up my whole summer",
            "review_score": "1"
        },
        {
            "review_text": "This game is addicting. It's like pinball but upside down? To pass the levels you must take out orange pegs (dots) on the board. As you journey to be 'a peggle MASTER' you will meet some along the way (ten to be exact). Every master gives a special power to help you in different ways. Towards the end of the game it gets frustratingly Hard. There a more orange pegs that appear on the board and you only have 5 shots, you'll have to plan your shots strategically. But don't worry there are also several ways of getting more shots. The only thing i dislike about this game other than the difficulty is the lack of levels. There are 55 of them but i tend to finish them quickly. Other than that i think that this game is enjoyable to play if you have free time. This game is also made by popcap the same people who made plants vs Zombies. If you do enjoy this game you should check out Peggle Nights and Peggle Extreme which is Peggle with valve based levels. Boy that was a lot of writing.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to play, and so addictive too. Great fun!",
            "review_score": "1"
        },
        {
            "review_text": "!!Warning!! You will spend copious amounts of time bouncing balls off of pegs. 74/74",
            "review_score": "1"
        },
        {
            "review_text": "Can waste time forever and not get tired of it",
            "review_score": "1"
        },
        {
            "review_text": "Murphy's Law: The Game",
            "review_score": "1"
        },
        {
            "review_text": "Endless hours of pointless and horribly addictive fun",
            "review_score": "1"
        },
        {
            "review_text": "Donk, donk, donk, donk, drum-roll... donk! Yay!  A disarmingly-simple game in a rather surreal world, with hidden depths and challenges that make it an incredibly addictive and rewarding classic. Always worth having around for a quick five-minute blast once completed.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle game for the ages. Clear the pegs with the balls!",
            "review_score": "1"
        }
    ]
}