{
    "app_id": 34820,
    "name": "Combat Wings: Battle of Britain",
    "release_date": "2009-10-14",
    "developer": [
        "City Interactive"
    ],
    "publisher": [
        "CI Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Flight",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 373,
    "negative_ratings": 101,
    "price": 4.99,
    "description": "Destroy the Luftwaffe! There’s something new in the air, and it’s more than the hum of hundreds of aero engines... As the Luftwaffe launches its aerial offensive, the outnumbered Royal Air Force is scrambling to bring into combat new planes that will ensure victory over a stronger foe. Will they succeed?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/34820/header.jpg?t=1551951696",
    "minimum_requirements": "OS: Windows 98/ME/2000/XP Processor: Pentium III 1 GHz CPU or faster Memory: 256 MB RAM Graphics: DirectX 9 compatible Video Card with 64MB RAM DirectX®: DirectX 9.0c Hard Drive: 700 MB Free Hard Drive Space Sound: DirectX compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Holy ♥♥♥♥ I used to play this back when it came out retail in '08  Some 10/10 nostalgia  Also the germans keep calling me Tommy...wait why are they even on our frequency anyway?!",
            "review_score": "1"
        },
        {
            "review_text": "Combat is fun, but is repetitive and the same every level. Because aiming and hitboxes are inconsistent trying to use rockets is a complete waste, so you just use machine guns every level. The turret levels are the worst I've every played, because you can be shot from guys that are too far away to hit or are over your head and you cant look up high enough to see them, which seems like a huge design flaw and ruins many levels. On these levels the hitboxes and aiming are the worst. Sometimes you need to be directly on a plane to hit them, sometimes you need to be way over their head. You think you get an idea on how aiming works and then you try it again on another plane and none hit. On some planes I moved the aimer on top, slighty in front, way in front, and all around them, and none of the positions registered hitting, which showed lack of polish. No wonder this was a budget title.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent-looking WWI action-flightsim. Not too hardware-demanding (runs on most laptops). Worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, but is almost unplayable if you have a multi monitor setup. in the missions where you are a gunner the mouse isnt locked, so it will drift from monitor to monitor, and as soon as you click you will minimise the game. the only fix i have been able to come up with is to turn off monitors 2 and 3 so this game can be in its happy spot.",
            "review_score": "1"
        },
        {
            "review_text": "M8 This Games Sic [:",
            "review_score": "1"
        },
        {
            "review_text": "I am not able to use a joystick properly",
            "review_score": "-1"
        },
        {
            "review_text": "Nice graphics, but even a noob player like me finished it in 2 (TWO!) hours!",
            "review_score": "-1"
        },
        {
            "review_text": "For the age of the game, it has great entertainment value and doesn't tax your system too much either!  And at the current price, its an absolute bargain!",
            "review_score": "1"
        },
        {
            "review_text": "Not worth 5 bucks, repetitive, low replay value. This is looking at a 2009 B-list title in 2014, so what did you expect?",
            "review_score": "-1"
        },
        {
            "review_text": "this game is alot better than it looks, its a very stern game with great dogfights! the AI are pretty smart while still feeling pretty realistic, and you have tons of planes with each having a few neat paintjobs and symbols you can chooe from.  I wouldnt say this is the best game in the world, but its really fun while staying incredibly addictive.",
            "review_score": "1"
        },
        {
            "review_text": "In Combat Wings,you are a pilot in the British Royal Air Force. The game controls pretty well and the graphics aren't that bad,but are a little bit dated.The Gameplay,however,is fun for about an hour and a half and then becomes a bit repetitive. The flying gameplay is a bit mediocre either as the game gives you 2 options to control your weapons. You can either control them in what the game calls the 'Arcade' style,which is where you use the mouse to move your crosshair and fire, or the Realistic option where your guns only fire forward. The German AI is not too bright and they constantly use the same lines of dialogue. All-In-All the game isn't too bad to pick up on a sale,but doesn't have a whole lot of long term value. Each mission can be finished in around five or ten minutes max and they don't have very much replay value. Also,the game has several different flyable planes,though you are only going to be using one or two.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good flying game. nice controls, nice plane selection, though theygive you special ordinance for seemingly no reason. multiplayer mainly though, which is a shame.",
            "review_score": "1"
        },
        {
            "review_text": "This game didn't take long to beat but the fun was unmeasurable. You can play this game with a view from the cockpit, making this game an engrossing one. The graphics are good enough to convince you of your role as a fighter pilot in world war II. After a few brutal sorties smearing death throughout the skies I felt accomplished. If you ever wanted to shoot down planes in a world war II setting then this game could fit the bill. It is affordable convincing and fun.",
            "review_score": "1"
        },
        {
            "review_text": "They game is great! I bought 2 copies, one for me and one for a friend. I hosted a server ( its so easy! :D ) and we had a lot of fun.  Controls are very similar to War Thunder. 100 fps in VERY HIGH quality on intergrated graphics. Thats fantastic!  10/10 i will recommend to other people.",
            "review_score": "1"
        }
    ]
}