{
    "app_id": 348250,
    "name": "Google Earth VR",
    "release_date": "2016-11-16",
    "developer": [
        "Google"
    ],
    "publisher": [
        "Google"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support",
        "SteamVR Collectibles"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Simulation"
    ],
    "tags": [
        "VR",
        "Free to Play",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 1788,
    "negative_ratings": 71,
    "price": 0.0,
    "description": "Google Earth VR lets you explore the world from totally new perspectives in virtual reality. Stroll the streets of Tokyo, soar over the Grand Canyon, or walk around the Eiffel Tower.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348250/header.jpg?t=1508799201",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 SP1, Windows 8.1 or later, Windows 10 Processor: Intel i5-6400 equivalent or better Memory: 8 GB RAM Graphics: Nvidia GeForce GTX 970, AMD Radeon R9 Fury equivalent or better Network: Broadband Internet connection Storage: 4 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 Processor: Intel i7-6700 equivalent or better Memory: 8 GB RAM Graphics: Nvidia GeForce GTX 980 or better Network: Broadband Internet connection Storage: 8 GB available space",
    "reviews": [
        {
            "review_text": "This is the 'ULTIMATE' VR experience. A whole Earth to explore. Perfect use of scaling as you zoom in and out. Comfort mode is optional. Google, Thank you for this experience. This is a MUST GET. Once StreetView/Oceans are added in, it will make this product even better. But as it stands its AMAZING. So download, head to Tokyo and pretend to be Godzilla!",
            "review_score": "1"
        },
        {
            "review_text": "Sure, if you zoom as much as possible it is extremly blocky, but this is a free software that let you see the whole planet in vr, so it's really hard to complain.",
            "review_score": "1"
        },
        {
            "review_text": "I spent the first thirty minutes in total awe, saying oh my god over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "TRuly an awesome experience! But it has it's flaws:  The streets from human sized view looks like an earthquake hit it  And it needs to be updated to load what's closest to yopu first, then foxus on everything else. Cause it uses too long to load anything decently fast at this rate even with 100Mbit.",
            "review_score": "1"
        },
        {
            "review_text": "I don't really know what to say. This brought tears to my eyes, which I really did not expect. It was a really intense emotional experience. It gives you an amazing new perspective of the planet. If you like Planet Earth and similar documentaries, this is a must see.   Honestly, just as you can't really describe VR to someone who haven't tried it before, I don't think there are any words to describe Google Earth VR to someone who hasn't tried it either. This was so much more incredible than what I imagined it to be, I can't recommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "'Oh my god.'   'Wow.'   *gasps*  My three responses to everything I did in it.  If it had a high quality street view you could completely trigger flashbacks by revisting old places. Pretty awe-inspiring even in its current form.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing experience.  Just enable human size.",
            "review_score": "1"
        },
        {
            "review_text": "Mind = blown  If you have a HTC Vive, you have to try this. This is why VR is the future.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Just astounding. Watch the milky way atop the very summit of everest, drive up Pikes Peak, take the train from Peace Arch to Vancouver city center. And of course, look at your house and everywhere you know. Atop mount baker in WA was good, Central park stunning.   I just spent 2 hours flying like a god. astounding. Hope they add more 3D models of everywhere.  Recommend you don't turn off the comfort mode.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best VR app made so far. I adore nature and geography, so being able to sit on the edge of a highway overlooking a lake in Oregon is an incredible experience.  Some things to improve would be holding a larger cache of 3D data at any one time, as well as fine tuning the 3D data and textures as far as possible. At which point it would simply become a world explorer app, but isn't that where Google is headed anyway?  Being free is a gorgeous bonus, I'm probably going to spend a lot of time in this app.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best VR app made so far. I adore nature and geography, so being able to sit on the edge of a highway overlooking a lake in Oregon is an incredible experience.  Some things to improve would be holding a larger cache of 3D data at any one time, as well as fine tuning the 3D data and textures as far as possible. At which point it would simply become a world explorer app, but isn't that where Google is headed anyway?  Being free is a gorgeous bonus, I'm probably going to spend a lot of time in this app.",
            "review_score": "1"
        },
        {
            "review_text": "Wow - I've always loved Google Maps, but this is something else. Amazing that the definitive VR experience is totally free.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you google! GoogleVR is far best experience I have had in VR. Great for education, great to relax, great in everyway and free! It is my go to game for showing people.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite VR apps",
            "review_score": "1"
        },
        {
            "review_text": "Jaw-dropping. I can see myself losing hours upon hours in this thing. What Google has built here is not just a neat way to view Google Earth but a powerful tool for viewing and learning about the world. The potential for this is endless and this is a great foundation to build on. Excellent work, Google!",
            "review_score": "1"
        },
        {
            "review_text": "Google Earth VR is crazy. I don't think I've had quite the same sense of elation from any other VR app. Yes it's using data that they already had and yes there were hax versions of this, but damn this is a VERY nice VR edition of Google Earth. If anything, the only real bummer about Google Earth is arriving somewhere and finding its not 3D. So much for touring Pyongyang!",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best vr experience i have had so far and i have had a lot",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best vr experience i have had so far and i have had a lot",
            "review_score": "1"
        },
        {
            "review_text": "Nothing more to say, other than Absolutely Stunning.",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best vr experience i have had so far and i have had a lot",
            "review_score": "1"
        },
        {
            "review_text": "Love this so much. I believe that this can only get better with updates - i.e. higher res images.  I was surprised to find my home (in little 'ol Perth, Western Australia) rendered in 3D, but Sydney (the bridge, CBD and Opera House) not rendered yet? Wow!  Still, this is one of the best VR titles out there - and FREE!  For people who downvote this due to not being able to get a street-level perspective - check the options.   This is one of my go-to apps for demonstrating VR to VR naive friends.",
            "review_score": "1"
        },
        {
            "review_text": "Works great on my HTC Vive, too bad for the losers with Oculus",
            "review_score": "1"
        },
        {
            "review_text": "To the creators at Google...  Imagine the whole world beginning a slow clap that ends in a thundering applause.  That is how well of a job you have done with this.  It is absolutely fantastic in every way. I cannot say enough good things about the experience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best experiences with VR, with added bonus of being on sale for the price of free",
            "review_score": "1"
        },
        {
            "review_text": "Absolutley amazing! Currentley stood with a cup of tea looking over the whole of my neighbourhood like some kind of crazed giant fool. Jaw is on the floor! Simcity on steroids!",
            "review_score": "1"
        },
        {
            "review_text": "This is quite simply amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing. AWESOME! Must have Application to use with your Vive",
            "review_score": "1"
        },
        {
            "review_text": "Amazing experience!",
            "review_score": "1"
        },
        {
            "review_text": "This is really amazing.  You can make yourself any size and explore any part of the world. Of course, the higher resolution that Google has on an area, the better your experience will be. Any city with 3D buildings looks really great.   This feels like having a scale model that you can walk across (or through, if you make yourself human size) - it feels like being in Legoland, but the buildings are more realistic.   You can grab the sun and move it through the sky to change the time of day, also.   It is also possible to grab snapshots of places for your favourites and jump to those places instantly at any time.   All of this and it's free.  Downsides (an I am nitpicking here): No search function (this is really surprising - you'll need to know your geography to find places you are interested in)  You can't rename your favourite places (and depending on the place and scale you took the snapshot at, the name can be very generic)  Places with little data are very flat (but this will constantly improve with time)  No Google Streetview (you can go down to street level but it uses the Google Earth data so the detail ranges from ok to non-existent) - I am pretty sure this is because Streetview would be just a 2D 360 sphere which would be quite jarring compared to the amazing 3D of the Earth.   ",
            "review_score": "1"
        },
        {
            "review_text": "I had just been researching way to get Google Earth to work in VR mode so when I saw this on here, I was estatic. It is really nicely done, simple controls, very clear. Of course not all the world is mapped so depending on where you go you will find very simple images or 3d models to, downtown London for example that is esquisite. The posibilities moving forward with this and other add ons they can place in it, are awesome!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing experience. I want to say that of all of the vr software i own, this may be the best. The largest recorded map of earth, available to walk around in, in tyour living room, for free... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of experience that makes VR feel worth it. It's free too, so there is no reason not to try it out.",
            "review_score": "1"
        },
        {
            "review_text": "One of those special VR titles that really has to be experienced by everyone. While it is not a 'game' you can spend hours roaming around. Far from perfect but you can't argue with free.",
            "review_score": "1"
        },
        {
            "review_text": "Great vr experience ... It really is a wonder and its FREE....",
            "review_score": "1"
        },
        {
            "review_text": "Spectacular. If you have a Vive then this is a must have. Plus it's free, that helps.  Thanks Google.",
            "review_score": "1"
        },
        {
            "review_text": "One of those games that goes straight into the demo rotation. Whether its viewing places you know well from a new perspective, visiting those locations you've always wanted to go to, or your best godzilla attacing Tokyo, Google Earth VR rarely ceases to amaze.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must have.  I saw this, saw that it was free and figured it would be interesting for 10-15mins.  I was wrong.  Nearly an hour had passed before I wondered how long it had been since I started. There's just something awesome about being able to stand, 2000 feet tall, looking at the Snowdon mountain range around you.",
            "review_score": "1"
        },
        {
            "review_text": "Ok....  Keep it short...  I love it... My daughter had a blast also looking for our home... The only issue SHE had with it was that she was unable to find the hollywood sign in las vegas...",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best app we've got in awhile. The only negative I can say about it is that the resolution gets really bad when you zoom in at human scale level (which you have to turn on manually in settings), it is off by default. For something that is free and to be able to fly around the world in vr how can anyone not recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! Get to ground level and the details are not there, not yet, but you certainly get a sense of how large things are like the Manhattan skycrapers. It actually list the street names and even street numbers for bigger cities. It is very detailed when flying over places from above. I am using it to help me decide where to vacation next, there is nothing like this, really useful for travellling to see the landscape ahead in such detail. The only thing missing is detailed street view, right now the houses on ground level look blocky, view is exceptionally detailed from above though, the higher above the ground you go the more crisp and detailed the view is. Many cities/mountains/Attractions are in fulll 3D glory, but again street view level not detailed yet. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This is incredible, going somewhere you know extremely well and then slowly zooming out, seeing the massive scale of the planet and realizing how small you really are.",
            "review_score": "1"
        },
        {
            "review_text": "i felt like a god when i discovered you can move the sun.....only to be slightly disapointed that the buildings lights dont show up at night",
            "review_score": "1"
        },
        {
            "review_text": "This is an incredible experience, if the location features height data use the human scale mode. You can sit on the next tall building and pretend to be batman! Also it is possible to easily drag the sky and make really nice looking day and night effects.  ",
            "review_score": "1"
        },
        {
            "review_text": "Gives a new perspective of Earth. Feeling like a giant, or a human, you have to keep reminding yourself that you actually live in this simulated level design...One of the most Profound and Powerful VR Experiences you will ever have.",
            "review_score": "1"
        },
        {
            "review_text": "It appears to have some memory leaks but overall is pretty amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Loading times still atrocious (why can't we save bulk caches of that?) but....amazing. Just amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! What a great app!  Had fun visiting places.  I hope they keep making things more defined but its already very impressive!",
            "review_score": "1"
        },
        {
            "review_text": "mind blown! comfort mode off is much more enjoyable but i loose my vr legs after about half an hour",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful. If you have the HTC Vive headset, this is a must get. If you dont have the headset, please dont download and then complain that it doesnt work. You need the headset. Flying around is easy, selecting locations is easy. In a future update, it would be nice if we could select a larger number of labels so it doesnt take quite so much time getting to a specific location. Not a complaint, just a request. Thanks for putting this out there. Is there a way we can contribute local photos and such?",
            "review_score": "1"
        },
        {
            "review_text": "This is incredible..",
            "review_score": "1"
        },
        {
            "review_text": "Breathtaking application that doesn't get old. THIS is what VR is tailor mode for. 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "I can, in fact, see my house from here.   Suggested activities: pretend to be King Kong in Manhattan, do the limbo under the St. Louis arch.  (note - this game has the worst pop-in I've ever seen, but holy ♥♥♥♥ is it worth it.)",
            "review_score": "1"
        },
        {
            "review_text": "The best thing in VR, even at this early stage in their development, once they add details for every city and remote area this is going to be much better yet.",
            "review_score": "1"
        },
        {
            "review_text": "Wow... this is simply amazing. I'm shocked it's free. This is a must-have for Vive owners.",
            "review_score": "1"
        },
        {
            "review_text": "Whoa, this is JUST AWESOME! Dear Google, this is just excellent:) Thank you!  The usability is smooth, easy to use.   I was hoping to get more details of my summer cottage area, but maybe it will be scanned later...:=)  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a must have.  I saw this, saw that it was free and figured it would be interesting for 10-15mins.  I was wrong.  Nearly an hour had passed before I wondered how long it had been since I started. There's just something awesome about being able to stand, 2000 feet tall, looking at the Snowdon mountain range around you.",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing. VR at its best. Showing Google Earth data in a very new way that is just worlds beyond what you can experience on a monitor. Google just blew my mind once more.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! Get to ground level and the details are not there, not yet, but you certainly get a sense of how large things are like the Manhattan skycrapers. It actually list the street names and even street numbers for bigger cities. It is very detailed when flying over places from above. I am using it to help me decide where to vacation next, there is nothing like this, really useful for travellling to see the landscape ahead in such detail. The only thing missing is detailed street view, right now the houses on ground level look blocky, view is exceptionally detailed from above though, the higher above the ground you go the more crisp and detailed the view is. Many cities/mountains/Attractions are in fulll 3D glory, but again street view level not detailed yet. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Love this app, and for free !?! everyone should at least try it!!",
            "review_score": "1"
        },
        {
            "review_text": "I mean it's not bad",
            "review_score": "1"
        },
        {
            "review_text": "Today I flew around the world.",
            "review_score": "1"
        },
        {
            "review_text": "Weird issue i ran into, the game will not launch unless the audio is set to the Vive USB audio. If you have your audio set to your external speakers the game will not launch. Other than that, this brought a tear to my eye. I get to explore places Ill only dream of going.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing. Incredibly polished for a first version. I can't wait to see where they take it. I turned off 'comfort mode' which increased the immersion and I was able to handle it just fine.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible experience. Gave me a sense of nostalgia visiting places I've lived like I wouldn't have expected. Worth having a Vive just to experience this. I mean, seriously, you can stand as a giant on any place on the globe. If that's not living in the future then I don't know what is. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Now there is no reason to take off the headset. Thank you Google :)",
            "review_score": "1"
        },
        {
            "review_text": "You just get it...  I hope that in the future we can get more detailed models.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! Having lived in many places, it's a crazy feeling to go back and revisit them. I definitley recommend.",
            "review_score": "1"
        },
        {
            "review_text": "OMG! The scale of this is GREAT! I feel like superman!",
            "review_score": "1"
        },
        {
            "review_text": "Wow! I can look at the entire world...better go look at my house! Sarcasm aside this rocks and if you want to show off vr then this is a cool FREE place to start.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. This application alone could replace half of the geography lessons in school. Must have for Vive owners.",
            "review_score": "1"
        },
        {
            "review_text": "One of those games that goes straight into the demo rotation. Whether its viewing places you know well from a new perspective, visiting those locations you've always wanted to go to, or your best godzilla attacing Tokyo, Google Earth VR rarely ceases to amaze.",
            "review_score": "1"
        },
        {
            "review_text": "A borderline spiritual experience. Short of actually physically going to space I think this may put your existence in perspective in a way nothing else can.  The comfort features are excellent but may annoy people used to VR. Thankfully it's easy to turn them all off and experience the wobbliness of flinging the landscape beneath you.",
            "review_score": "1"
        },
        {
            "review_text": "Completely mind blowing. Went on a world-wide tour of famous natural landmarks.",
            "review_score": "1"
        },
        {
            "review_text": "Only went to my the eiffel tower, then spent 15 minutes around my house. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and amazing. Well done- can't wait for more.",
            "review_score": "1"
        },
        {
            "review_text": "An all around amazing piece of software and this is only the beginning. It's also my new go to for demoing VR to first-timers and it really sells the increased potential to digitize and visualize the world that VR gives you.",
            "review_score": "1"
        },
        {
            "review_text": "Oh, this is awesome! I can walk through my hometown without even leaving my flat! Yay!",
            "review_score": "1"
        },
        {
            "review_text": "This is quite amazing. First Vive experiance my Wife actually requests to have a go on. I dont experiance any issues with any other vive title regarding motion sickness....But this does put me on the edge when i spend more than 1.5 hours flying around. Although there is a mode to limit this and it does work, i just dont like using that mode. Seach facility and street view would be great additions. Well done google. This is quite amazing what you have done here.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite amazing. First Vive experiance my Wife actually requests to have a go on. I dont experiance any issues with any other vive title regarding motion sickness....But this does put me on the edge when i spend more than 1.5 hours flying around. Although there is a mode to limit this and it does work, i just dont like using that mode. Seach facility and street view would be great additions. Well done google. This is quite amazing what you have done here.",
            "review_score": "1"
        },
        {
            "review_text": "This is a lot of fun in HTC Vive... I just wish we could get down to Street View. As it is, I feel like Godzilla when I roam around an area. Still, it was really neat making a virtual hike up Mt Fuji, then jumping into the Grand Canyon for a river trip, all while standing in my living room on a Sunday Morning.",
            "review_score": "1"
        },
        {
            "review_text": "As of 2016-11-18, the game doesn't even start if you have surround audio. F this BS.",
            "review_score": "-1"
        }
    ]
}