{
    "app_id": 348270,
    "name": "Social Justice Warriors",
    "release_date": "2015-02-27",
    "developer": [
        "Nonadecimal Creative"
    ],
    "publisher": [
        "Nonadecimal Creative"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Memes"
    ],
    "achievements": 23,
    "positive_ratings": 57,
    "negative_ratings": 51,
    "price": 5.79,
    "description": "Social Justice Warriors is a satirical role-playing game that transforms the standard medieval fantasy heroes of RPGs into social media crusaders facing an endless horde of internet trolls.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348270/header.jpg?t=1547066025",
    "minimum_requirements": "OS: Windows XP Memory: 1 GB RAM DirectX: Version 9.0 Storage: 60 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I was looking forward to this, but it is repetitive and hard to discern how points work. I wish it was a system where you could pick a reply and based on how that reply is weighted, your attack would resolve or you would lose points. But it just lets you pick the same options that are not clear what they do. There's very little substance to this game. It should be free if the only point it wants to make is, 'see you fight people on the internet like it's a supremely crappy RPG or something!'. I doubt I'll play it again and I think I was ripped off.",
            "review_score": "-1"
        },
        {
            "review_text": "First I want to say I played this for about 4 hours on the client before the steam launch  I really wanted to love this game but the problem is it is repetitive and quite random (in a bad way). Well lets start off with the positives   Quite an interesting concept    Really doesn't take a side on SJW or Trolls    The champions designs are quite nice    The pixel art is quite nice    The player and the Trolls look the same, probably a message on that    The game changes when you become a champion which is quite intresting   Now the cons   Like said above repetitive from the build I played (v2-2) only has about 5-10 messages for the trolls, this could also have some meaning to it but doesn't really make for a fun experience     Lacks alot of stuff a old school rpg would have and is really random    companions come in at similar points and don't stay around.   Sidenotes: This game would of worked best as a mobile title since a run can be completed in about 5-10 minutes.   This game has alot potential but sadly at the current update it is quite an empty game with repetitive gameplay, I hope this game is updated and adds in more content but at the current time not worth the purchase",
            "review_score": "-1"
        },
        {
            "review_text": "An interesting but utterly botched concept. Provides a few chuckles but gets boring after an hours playtime. Avoid unless at a very significant discount.",
            "review_score": "-1"
        },
        {
            "review_text": "im trying to think of an insult bad enough and nothings coming",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine the Myth of Sisyphus by Albert Camus best represented in a video game. This is that: a game where one engages in pointless arguments on the internet that no one will benefit from. Perfect for any absurdist gamer!",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever spent time involved in discussion on forums, then you will likely have seen a number of architypes of behaviour from those that are popular, friendly and discuss any topic to those that literally hide behind a dosen aliases with their only intention being to cause mischief and misery (if of course they can target the right people that are emotionally volatile enough to bite)  This game is a simulation of those occurances online and places them into a turn based 'quid pro quo ad nasuem'.  Funnily enough some of the 'canned troll' comments used within the game you do actually see alot on real forums. While it might be costly in price for it's simplistic and shortlived escapade, hopefully the developers will perhaps consider a more indepth version in the furture.  I'd only recommend to those that collect such oddities for the reason's of obscurity as opposed to being a Triple 'A' game. (If you play this game you'll be asking yourself if this was written in character/spirit of the game... ;) )",
            "review_score": "1"
        },
        {
            "review_text": "....Nice game.... BUUUTTTT..... 3/4 times crashes while loading. But otherwise, it's interesting.",
            "review_score": "1"
        },
        {
            "review_text": "i feel triggered by people who disagree with me",
            "review_score": "1"
        },
        {
            "review_text": "It is incredible. Take on the role of Twitter, Reddit, Tumblr or ♥♥♥♥♥ to fight against the trolls of the internet.",
            "review_score": "1"
        }
    ]
}