{
    "app_id": 348240,
    "name": "Gun Wings",
    "release_date": "2015-12-08",
    "developer": [
        "Mercury Stone",
        "Angels Blue Digital Entertainment",
        "DigitalEZ"
    ],
    "publisher": [
        "DigitalEZ"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Bullet Hell",
        "Anime",
        "Shoot 'Em Up"
    ],
    "achievements": 21,
    "positive_ratings": 190,
    "negative_ratings": 32,
    "price": 2.79,
    "description": "A mysterious meteorite from deep space was detected approaching the Solar System, before the meteorite is due to hit the Earth, three of the girls who had their bodies modified as weapons are sent, along with all the hopes of humanity, to destroy the meteorite and save mankind...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348240/header.jpg?t=1547699692",
    "minimum_requirements": "OS: Windows XP or Higher Processor: 2.0 GHz Pentium 4 or Higher Memory: 1 GB RAM Graphics: Integrated Graphics DirectX: Version 9.0c Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Thank for the DEZ studio to bring this great game to us. Any Shoot em up fan should try it!  It works flawlessly on Win 7-x64 pc with my Logitech F710 gamepad! ",
            "review_score": "1"
        },
        {
            "review_text": "pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Played it briefly (and blindly, as I only found out about the bullet absorbing mechanic at the end of the first stage,) and I have to say, for only 4 bucks, it's a fairly competent shooter.",
            "review_score": "1"
        },
        {
            "review_text": "9/10   Play as a girl made out of Gundanium and stop Jenova from invading the planet.",
            "review_score": "1"
        },
        {
            "review_text": "There is the worthless game which has the sole virtue of the elegant background. Perhaps, it’s just a semifinished game.  Low resolution with the weird bgm which sounds like the noise stemmed from the crude puzzle game. Familiar operate mode and game settings maybe take the cue from a certain game. This game lacks the story and character setting cause of the producer’s laziness. Nevertheless , that’s not the worst. The barrage has no sense of beauty, which is the maddest fatal fault and disappointing me so much. It’s no need to play such an awful game. ",
            "review_score": "-1"
        }
    ]
}