{
    "app_id": 3483,
    "name": "Peggle Extreme",
    "release_date": "2007-09-11",
    "developer": [
        "PopCap Games, Inc."
    ],
    "publisher": [
        "PopCap Games, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Free to Play"
    ],
    "achievements": 0,
    "positive_ratings": 707,
    "negative_ratings": 58,
    "price": 0.0,
    "description": "Mayday! The Peggle Institute has been invaded by a host of other-worldly creatures. It's up to you, Peggle Master, to report to duty and shoot and bounce the critters to oblivion. Take your best shot with energizing arcade fun, now exclusively themed with art and sounds from The Orange Box!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3483/header.jpg?t=1447351145",
    "minimum_requirements": "Minimum Requirements: Windows 2000/XP/Vista, 256 MB RAM, 700MHz or faster, DirectX: 7.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Since Peggle 2 doesn't exists on the PC, this perfectly satisfies my thirst for peggle.  It's just what you'd expect it is.",
            "review_score": "1"
        },
        {
            "review_text": "Peggle with a twist.......",
            "review_score": "1"
        },
        {
            "review_text": "Galton Board, 'Dangerous Addictive'.   λ  ",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game!",
            "review_score": "1"
        },
        {
            "review_text": "Funny, nice, easy and very addictive [7/10]",
            "review_score": "1"
        },
        {
            "review_text": "It's Peggle. It's FREE.  Oh and Valve has stepped in for some glorious headcrab, Team Fortress and Portal interaction too.   May only take you 30 minutes to play but come on - FREE PEGGLE",
            "review_score": "1"
        },
        {
            "review_text": "I'm so ♥♥♥♥♥♥♥ hard right now.",
            "review_score": "1"
        },
        {
            "review_text": "it's exTREME",
            "review_score": "1"
        },
        {
            "review_text": "this was a pretty omgwtf discovery. my first thought was ohh nooee you got valve all over my peggle, and the first thing you see in game is the peggle unicorn infested by a headcrab, also the sun has the g-mans face so this is a pretty crazy thing Ive stubled upon and I recomend you take a look, the games like a hidden gem.",
            "review_score": "1"
        },
        {
            "review_text": "Basiclly a hype up for the actually peggle game, this FREE game only has 10 levels and 5 challenges. Cool Themes but only one character and no real reason to go back and play it, for your actually peggle fix just buy the real deal. Deluxe is the classic but Nights is cool if you're looking for a more challenging verson of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so extreme that when I started playing it Shaun White and Tony Hawk flew through my bedroom window.",
            "review_score": "1"
        },
        {
            "review_text": "haha contains rage",
            "review_score": "1"
        },
        {
            "review_text": "Pachinko with superpowers and (probably) no organized crime connections. For free!",
            "review_score": "1"
        },
        {
            "review_text": "It's free and from PopCap Games!",
            "review_score": "1"
        },
        {
            "review_text": "ive played this to much for an arcade game",
            "review_score": "-1"
        },
        {
            "review_text": "not only is this peggle but its EXTREMEEEEEEEEEEEEEEE!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A smart collab between Valve and Popcap, one word. WOW. Just wow. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ YEAH, FREE PEGGLE WITH ALL THE EXTREME STIMULATION A ♥♥♥♥♥♥♥♥ 7 YEAR OLD REQUIRES!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Valve levels! (3 Half-Life, 3 Team Fortress 2, 1 Counter-Strike and 3 Portal stages, with 5 Challenges post-game) - Voice-clips from these games play when you win or lose! - It's Peggle, dammit. - Bjorn being eaten by a head-crab. (Don't show the kids.) - 22 Megabytes of space. - FREE! - FREE PEGGLE!  Cons - One Peggle Master (Bjorn) - Really, Really Short  Whether you call it an expansion pack or a demo or just a neat lil' crossover, there's no harm at all picking up this game. Did I mention it's FREE?  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Why pay money for the original if you can instal that :) Good Games guys!  -Feregan",
            "review_score": "1"
        },
        {
            "review_text": "Heavy yelling 'OH NOO!!' When I Fail  10/10 Would Play Again",
            "review_score": "1"
        },
        {
            "review_text": "It really just has a valve skin on it. Nothing particulaly new.  3/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "A very extreme peggle experince....Stalin would approve",
            "review_score": "1"
        },
        {
            "review_text": "It's Peggle. It's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Great classic game. One of the first I ever played! Just like the original game but with a twist.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a trip with some drip on the side ",
            "review_score": "1"
        },
        {
            "review_text": "cool free game, note the headcrab zombie unicorn and gman sun.",
            "review_score": "1"
        },
        {
            "review_text": "Is fun... and free... what more do you need.",
            "review_score": "1"
        },
        {
            "review_text": "Fun even thoug not full game",
            "review_score": "1"
        },
        {
            "review_text": "A fun freebie. Do yourself a favor and get the Peggle Bundle to really enjoy tons of great Peggle action.",
            "review_score": "1"
        },
        {
            "review_text": "A bizarre tie-in of Peggle with Valve's Half Life 2 and PORTAL games. Good fun, if very odd.",
            "review_score": "1"
        },
        {
            "review_text": "A short Orange Box (Half-Life, Team Fortress 2, Portal) and Counter-Strike themed version of Peggle. Sure it may be tough but at least it has some interesting levels. Just give it a try. And don't pay too much attention to messages about 'they're taking over' and whatnot.",
            "review_score": "1"
        },
        {
            "review_text": "Pegging is pretty extreme, I will grant you that.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting demo that will get you interested in Peggle. The Orange Box twist just makes everything better. 84/100",
            "review_score": "1"
        },
        {
            "review_text": "its okay but its to extreme",
            "review_score": "1"
        },
        {
            "review_text": "I thought there would be more gopher-sex.",
            "review_score": "1"
        },
        {
            "review_text": "the game is pretty good i like how it has hl2,portal,and tf2",
            "review_score": "1"
        },
        {
            "review_text": "About one hour of fun for the price of Free. Kinda hard to beat that, you just need to ask yourself if it's a good use of an hour of your time.",
            "review_score": "1"
        },
        {
            "review_text": "great time waster ",
            "review_score": "1"
        },
        {
            "review_text": "i like this game....something i can handle",
            "review_score": "1"
        },
        {
            "review_text": "Peggle is one of the most addictively awesome series I have ever played. It's got a simple premise, but the satisfyingly brilliant arcade action will keep you playing for hours.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  popcap has a baby with lord gaben",
            "review_score": "1"
        },
        {
            "review_text": "    A great game for a little distraction.",
            "review_score": "1"
        },
        {
            "review_text": "you should add ALL of your games you ever made, to Steam! You are the best, but you made a mystake, by joining Electronic Arts!",
            "review_score": "1"
        }
    ]
}