{
    "app_id": 348300,
    "name": "Chip's Challenge 2",
    "release_date": "2015-05-28",
    "developer": [
        "Niffler Ltd."
    ],
    "publisher": [
        "Niffler Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Puzzle",
        "Sokoban"
    ],
    "achievements": 29,
    "positive_ratings": 56,
    "negative_ratings": 7,
    "price": 3.99,
    "description": "Chip is back and this time he's teamed up with Melinda to try and solve even more puzzles built from a combination of new and old monster, hazards and game elements created by Vladimir Gerajkee The Puzzle Master.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348300/header.jpg?t=1524940177",
    "minimum_requirements": "OS: Vista Processor: 1 Ghz or faster processor Memory: 512 MB RAM DirectX: Version 6.0 Storage: 100 MB available space Sound Card: 16-bit sound card",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: 1 Ghz or faster processor Memory: 1 GB RAM Network: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "I've been waiting for this game for over 15 years, and it does not disappoint. The levels are just as varied as in CC1, and have marginally better design sense as well, with a few exceptions very late in the game. There's a good balance of long and short levels as well, and puzzles that really make you think about the quirks of the game mechanics. While I personally found the soundtrack a little boring, it's easy to change simply by replacing the music files.  At the time of writing the editor needs a little bit of work, as it lacks features for creating levelsets and doesn't let you view a lot of the level at once without zooming out. Unlike a lot of games with editors, though, you can use any element in the game in your levels, which lets you make intricate puzzles on par with the ones already in the game. I'm really looking forward to seeing what the community can do with this game.  One more thing: If the size of the game window bothers you, Windows has a utility called Magnifier that lets you zoom in. Although it seems like the developers are working on built-in zoom as well.",
            "review_score": "1"
        },
        {
            "review_text": "Chuck Sommerville done a very good job to get this game out after 25 years of delay due to Publisher wanted money  well worth the money and time, hope Chuck get to make a new one",
            "review_score": "1"
        },
        {
            "review_text": "In short, go play Chip's Challenge 1 instead.  In long, why the heck is this nearly 200 megs? Especially given the lack of features and overall bare-bones presentation. It's ridiculously bloated in terms of memory footprint. There's a lot of new puzzle elements, some of which seem like they overlap a lot, like did there really need to both be one-step tiles that turn into water AND one-step tiles that turn into blocks instead? And the point flags, different colors of theives, and blocks that you can only pass if you _DON'T_ have a certain item? It's ridiculously bloated in terms of puzzle elements as well!  The puzzle difficulty starting out is really strange, too. Unlike Chip's Challenge which has a nice slow ramp to teach you how the puzzle elements work, this game has a really long, boring single level that throws it all at you at once, then come some stages that don't feel like they're part of a cohesive plan, but rather just grab bag picked and strewn about. The difficulty level similarly seems kind of arbitrary.   I have a lot of fond memorie sof Chip's Challenge, and I appreciate that I'm able to go back and experience it again and see that it still was a decent puzzle game, but this sequel doesn't do anything that the first one didn't do as well or better. Take a pass on this one unless you're getting a good deal on a bundle with this and the Editor, because at least that can provide some value.  Otherwise: Pass.",
            "review_score": "-1"
        },
        {
            "review_text": "I had no idea about this sequel. I first played the original on the Amiga and ZX Spectrum, and I eventually got it for the PC in the mid 90’s. I found out about the sequel via LGR, and paused the video as soon as he said ‘on steam’ and bought the full pack. I am so pleased to have the original, and to play the sequel, and hope the creator gets his due for it. This was an insta-buy for me, hands down and I love it. I’m not bothered about it being windowed, I bet they upgrade it later anyway. I just sit back with my fingers on WASD and enjoy. Great game, blast from the past, and gets the brain firing. Perfect.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing and so freaking nostalgic. It's a game that makes you think, tests your finger speed, and is easy to play, but hard to master. This game has everything that made the original a classic and then some. It has single screen levels, hurry up and figure out our puzzle levels, and busy dungeon like levels. If you get tired of the included levels, you can always make your own, I recommend the bundle since it includes both games and the editor, $10 worth of content for half that price or even less when there's a sale, totally recommended...",
            "review_score": "1"
        }
    ]
}