{
    "app_id": 348470,
    "name": "SAMURAI WARRIORS 4-II",
    "release_date": "2015-09-29",
    "developer": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "publisher": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Hack and Slash",
        "Historical"
    ],
    "achievements": 54,
    "positive_ratings": 757,
    "negative_ratings": 215,
    "price": 39.99,
    "description": "The latest iteration of the 10th anniversary &quot;SAMURAI WARRIORS&quot; series is here at last! Naomasa Ii appears as a playable character for the first time, and the various personalities of the age are explored in more depth in &quot;Story Mode&quot;, which is now focused on individual characters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348470/header.jpg?t=1550180167",
    "minimum_requirements": "最低: OS: Windows® Vista, Windows® 7, Windows® 8, Windows® 8.1 プロセッサー: Core2 DUO 2.4GHz or better メモリー: 1 GB RAM グラフィック: 640*480 pixel over, High Color DirectX: Version 9.0c ネットワーク: ブロードバンドインターネット接続 ストレージ: 11 GB 利用可能 サウンドカード: DirectX 9.0c over",
    "recommended_requirements": "推奨: OS: Windows® Vista, Windows® 7, Windows® 8, Windows® 8.1 プロセッサー: Core i7 860 better メモリー: 2 GB RAM グラフィック: 1280*720 pixel over, True Color DirectX: Version 9.0c ネットワーク: ブロードバンドインターネット接続 ストレージ: 11 GB 利用可能 サウンドカード: DirectX 9.0c over",
    "reviews": [
        {
            "review_text": "Not a bad port for a Warriors game.  Pros:  - It's fun and more fun with a friend. - It doing it's job as a Warriors Game. - Soundtrack is badass as usual. - Good characters, good story. - It works well with old PC's, like mine. - Create a Warrior - Gamepad is nicely configured...  Cons - Overpriced DLC, please Koei learn the PC market is different from the console market. - You don't play a Warriors game for graphics, eh? - Where the hell is  Chronicles mode  from the 4 and why the hell we can't play Survival mode in coop? - One more time, overpriced DLC. Because they don't want to learn. - ... but you have to learn the buttons by yourself.  3 more years and Koei will learn to port a game at 100%, I think.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing, it's basically every earlier Warriors title but hyper and faster. It feels great and all the mechanics aside from horse calling works great. If you have to choose between this and Dynasty Warriors 8XL, I would highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Since I'm nearly done with the game myself and by the end of all this, I'll have around a bit over 70 parts, here's my honest take on it. Well since I've been a fan of the series since the PS2 days, there's a lot I can say about this game that they really improved upon. For one, the character roster. The roster I have to say has improved since 3 and good to see some new faces as well as similar in the previous games. I'll also add that they taken notes from Chronicles in the tag aspect since it really does help and it doesn't harm you in anyway but instead help you all the more. You'd still have to keep your eyes on your health bar but that's a given. The pathfinding is also a big help since Samurai Warriors is more objective based than goal based like in Dynasty Warriors. In its own respect, Samurai Warriors 4-II gives more of a challenge since you're on the clock on the field and you'll need a partner to help cover these goals so you can survive the battle. As for the story aspect, I do like how the characters interact with each other more in-story than just by game itself. The character development is in a word: beautiful. At the most I can say, it gives you a more understanding feel to the characters than in previous games where the event was more important than the characters. Now I know and from what I read from other reviews, yes it's a hack and slash and to those with a very small view to say it's repetative, the work that was put into the stages are gorgeous and the music is just stellar. Even if you might be repeating some stages, it's the point of view that's mainly important. How he/she perceive the view of the situation and all, how it affects them..that's what make this installment different. The skill tree reminds me of the one in FFX but simplied, and all you would need is strategy tomes to access these skills. Most being useful on the field to either bolster your attack and defense, heal or net you more experience along with bettering your innate skills, I also need to add that when you hit 1000 KOs, you do get a bit of a super effect which says a lot more than being just the strongest in the land. I think my only gripe is how come there wasn't a stand alone story for your created characters, I feel they shouldn't be limited to just Survival and Free mode alone, I mean it could've been done like in Chronicles where your characters are given a choice on what they think and thereby going by relationship towards their peer or ruler depending on their way of life. It's a longshot saying this, but I hope SW4 Empires comes to Steam and like with Dynasty Warriors Empires change up on how unification be done in a more simplified tone. As a whole, would I recommend getting this game for yourself? I'd say if you can look past it being a hack and slash and being moderately challenging for a Warriors game, then yes go for it. Try it for yourself and I think you'll find it that it's worth getting for your library.",
            "review_score": "1"
        },
        {
            "review_text": "Best warriors game yet... I hope they bring Samurai Warriors Empires to Steam, and the Dynasty Warriors series atleast gets this quality of a game next go around.",
            "review_score": "1"
        },
        {
            "review_text": "Having played Samurai Warriors 2, 3 and Katana, I say this one is an improved version of SW 3. With new characters, more combat features added [Hyper attack, Second ultimate musou, etc.] and a few changes to game modes ...   +Game modes: * Story mode - Most champaigns are clan based with one fixed primary character [Clash of wills: Ii Naomasa, with other few selectable character throughout the champaign.] there are also champaigns that focus on individual character  * Free mode - any stages, any characters . * Survival mode - Turns into rage quit mode after 30 minutes....  * Online multiplayer ...   + Good for playing during tea time, or after having rage quit from CS GO to calm yourself down. [this game is quite relaxing if you're not playing on hard difficulty.]  + You can play two characters at once, making missions/objective easier or if youre bored with playing one charater :/  + Can run at 60fps on max setting on any decent pc. + Low requirements. + 50? playable characters, each of them has unique design. I'm not gay but damn... Takakage ( ͡° ͜ʖ ͡°) + Good soundtracks. + Japanese voice. + Each stage/battle are well designed, very fun to play.  + Many difficulties - from easy to nightmare.  + Many attack variations for each weapon  + More choices in custom character customization.  + They jiggle ( ͡° ͜ʖ ͡°)  + Naotora chan... Is Naomasa's mom?! Milf video game character detected ( ͡° ͜ʖ ͡°)  + Naotora chan ( ͡° ͜ʖ ͡°)     There are some downsides to consider... :   - Story mode doesn't always focus on single character, as I mentioned before that most champaigns are clan based.  - Better to play with a controller: I have no problem playing with keyboard but it feels awkward playing without a controller...  - Tutorial doesn't show the key/button, instead, shows icons. you will get used to the key binding easily anyways - Console Graphic [ps3 texture, ps4 models and may be outdated...]  - Overpriced DLCs, I want the costumes so bad! Too bad they cost too much and aren't for all characters.  - Unstable multiplayer [Either you or the other player gets constantly disconnected, even with good internet connection]    If you ever thinking of buying this game, buy on sale when it's at least 30% off, which you just missed -_-",
            "review_score": "1"
        },
        {
            "review_text": "Amazing warriors title. Again as all musou games, FUN. Just lots and lots of fun. Slashing trough 1000 enemies. Grinding for the best weapons. Enjoy !",
            "review_score": "1"
        },
        {
            "review_text": "well , amazing fun but we need CHRONICLE mode on PC please !",
            "review_score": "1"
        },
        {
            "review_text": "Samurai Warriors 4-II is the 2nd SW game to come out on PC since SW2 in 2006. The PC port for that was basically ripped from the PS2 version which is kind of weird seeing how the 360 version came out a year before the PC version. Samurai Warriors 4-II is supposed to be a 'complete' version of SW4... meaning KOEI just put 1 more character, removed Chronicle Mode and replaced it with Survival Mode from SW1 and 2 and removed all the Legend stories.   Gameplay: The gameplay has changed a lot from its predecessors and it feels more like you can crush everyone in your path easily without having to run around slowly looking for enemies and wasting time on them just for KOs. It's pretty easy to get 1000KOs in a battle now and its easier to kill enemies. This is probably because of the new Hyper attack they added which replaces the useless charge attack from SW1, 2 and 3. It's OP on weaker enemies but any enemies with shields or main officers can't be killed with them unless their defences are weakened. So I guess that's okay. You can now control 2 officers at once which makes it easier to plan out attacks, unlike in the previous games where you did all the work, you can now order the secondary officer to move to this place or attack that guy while you do the main thing.  Story Mode: The story of Samurai Warriors is the same as the other ones, but this time instead of playing the same levels as each character and basically getting bored, you play stories from a clan/group's perspective. Also you can choose who your secondary officer will be from a list so you can choose who's perspective you want it to be personally.   Survival Mode: I never really enjoyed playing this back in Samurai Warriors 2 and tbh it's pretty boring here too.   Creating a character: It's the same as SW2 and 3 but now you can upload your own images onto your character so their clan symbol could be anything you like.   Graphics: The textures are taken from the PS3 version but the models are from PS4. It's annoying that KOEI never decide to enhance the graphics for PC version. Luckily there's a graphics mod that makes the textures look better, the colours more like the PS4 version and just stuff like DoF or lens flares. The map still fades from a close distance though which is annoying. The game runs at 60fps easily at full settings.  Basically, if you enjoy the Warriors series, whether it's Hyrule Warriors, Dynasty Warriors, Warriors Orochi or even the past Samurai Warriors games... you'll enjoy this game. The only thing you need to worry about is changing the graphics, but that's only if you're picky like me lmao    ",
            "review_score": "1"
        },
        {
            "review_text": "Game is worth every penny!  I love Dynasty Warriors. I was unsure about this game although it looks sick! and when I bought it, and tried it, I love it!  ",
            "review_score": "1"
        },
        {
            "review_text": "A pretty great port, though a fixed camera option would be good. That said, DO SOMETHING ABOUT THE DLC PRICE SERIOUSLY! THE COSTUME DLCs ARE EVEN MORE EXPENSIVE THAN THE GAME ITSELF!",
            "review_score": "1"
        },
        {
            "review_text": "One of the better ports Koei has done for the PC. The textures aren't from the PS4 version but the game lookf perfectly fine to me. The importance of stunning graphics doesn't really matter because you'll constantly be in action packed and fast-paced combat. I recommend this game if you are into hack and slash and are fond of the dynasty warrior games. It also runs very well on my Lenovo Y410p Gaming Laptop on max settings.",
            "review_score": "1"
        },
        {
            "review_text": "If you love KOEI's franchise since DW2, you'll love this as well.  Pros -Great graphics settings -None of that fail port bugs bull ♥♥♥♥ for once -ya beat that ♥♥♥♥ up  Cons -Keyboard control settings for camera is tad bit ♥♥♥♥ed up, but you'll get used to it (Use controller if possible) -Extremely ♥♥♥♥♥♥♥♥ settings placement, like why tf is this ♥♥♥♥ doing in this part of the menu -DLC costs a kidney and your first unborn child -Naomasa Ii is a mega ♥♥♥♥  I r8 this 5/7",
            "review_score": "1"
        },
        {
            "review_text": "pls fix the controller koei",
            "review_score": "-1"
        },
        {
            "review_text": "WOW it's great",
            "review_score": "1"
        },
        {
            "review_text": "That last chapter's last scene, OH god.... Katsuie Shibata, WHY?",
            "review_score": "1"
        },
        {
            "review_text": "I literally couldn't stop playing this game when I got it a while back. You will love everything about this from riding horses to the battles.",
            "review_score": "1"
        },
        {
            "review_text": "Say what you want to about how they should've ported the PS4 textures and not the PS3 textures, but it's not like it looks terrible. It's fine. Good, even. Just not the best. The main issue in question isn't that, it's Koei's supposed disregard for the PC community, but honestly, Koei will get around to porting PS4 stuff eventually, they're beginning to hear us, so can we just be happy that we finally have a modern Samurai Warriors game on PC in the meantime? I've been looking forward to this since they released 2, and it really is a fantastic game. I'm going to certainly put more than my fair share of time into it for the price, plus with the online functionality, my friends and I can get a fair amount of play out of it too. The only thing I really dislike is the lack of Xbox button prompts, but I'm sure that's something that they'll either patch in later or modders can fix soon enough. It isn't that much of a bother if you've ever played a Warriors game before. All in all, the game is great, and if you can get over yourself on the 'Boycott Koei' front, it's definitely worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "Is it really that much to ask to get a common resolution supported? Or allow me to use something over it so I can play beyond 1024x768?  Apparently, it is, because this is the second time this has happened to me. I guess even when online multiplayer gets added Koei manages to screw things up, and that wasn't even a buying point; I just wanted to play the game and have it look nice.  Oh well.",
            "review_score": "-1"
        },
        {
            "review_text": "Got banned for buying this",
            "review_score": "-1"
        },
        {
            "review_text": "Koei said a patch to fix network issues was on it's way. 3 Months Ago.  Maybe by the time they release the 15th installment to the series we'll have a fully playable game. Ah fug, I'll still keep buying those because of PS2 nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "this is perfect game if the controller have support succesful, good game well play lol",
            "review_score": "-1"
        },
        {
            "review_text": "Only play for one round but I think Koei has definitely learned from their mistakes with Bladestorm and Toukiden.",
            "review_score": "1"
        },
        {
            "review_text": "I love Japanese traditional culture and history Samurai Warrior has wonderful designed, good port, easy key binding supported  Bgm is good at all, special is 'Ikusa' of Waggaki Band",
            "review_score": "1"
        },
        {
            "review_text": "Game crashes often and no support from Developer",
            "review_score": "-1"
        },
        {
            "review_text": "Gamepad configuration with a Razer Sabertooth (XBox style controller) was an extreme exercise in frustration and futility. Spent entirely too long trying to make it work.  If you want to play this game on a gamepad, I would recommend buying a console version of this game.",
            "review_score": "-1"
        },
        {
            "review_text": "buggy online",
            "review_score": "-1"
        },
        {
            "review_text": "Runs great but graphics are terrible (PS4 character models but everything else is PS3) I had to refund.",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked the Xtreme Legends versions of any of Koei's titles or you've been waiting tirelessly to see Samurai Warriors join Koei-Tecmo's lineup (much like me), then this is definitely down your alley and worth the buy. Its focus on specific characters and their own personal stories and the new playstyle with Naomasa Ii are great hooks into those who've played the original Samurai Warriors 4.   However, if you were aiming to buy this because it was advertised as the 'perfect version of the title' (said title being Samurai Warriors 4), then you may want to hold off on picking it up immediately. The original factions' stories of Samurai Warriors 4 Story Mode are not included, as well as leaving out Chronicle Mode, a mode where you took your own personally created characters into Japan and have them interact with the original historical figures. The DLC is priced higher than it was previously, but this is tied to the fact that the DLC is made up of complete sets of single pieces.  Ultimately, if you love Koei Tecmo's games, Samurai Warriors, or Sengoku Era games, then I'd definitely recommend it without a doubt. However, if you were hoping for a fuller game or a Complete Edition similar to Dynasty Warriors 8, then you may want to just pick up DW8's Complete Edition. Despite being proclaimed to not be an Xtreme Legends expansion, the stripped parts of Samurai Warriors 4-II leave you feeling like it was just an Xtreme Legends expansion.",
            "review_score": "1"
        },
        {
            "review_text": "They did well with the stories. So it's not a straight forward hack'n slash. I always loved how they used real people from history. Once you get used to the controls on the keyboard (If you don't have a controller) it ends up being one of the better Samurai Warriors and Dynasty Warriors. I hope they do the next Dynasty Warriors in the same way. However, I would like to see an Empires version of this game.  -Orizonta",
            "review_score": "1"
        },
        {
            "review_text": "brought honor to my clan",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the Xtreme Legends versions of any of Koei's titles or you've been waiting tirelessly to see Samurai Warriors join Koei-Tecmo's lineup (much like me), then this is definitely down your alley and worth the buy. Its focus on specific characters and their own personal stories and the new playstyle with Naomasa Ii are great hooks into those who've played the original Samurai Warriors 4.   However, if you were aiming to buy this because it was advertised as the 'perfect version of the title' (said title being Samurai Warriors 4), then you may want to hold off on picking it up immediately. The original factions' stories of Samurai Warriors 4 Story Mode are not included, as well as leaving out Chronicle Mode, a mode where you took your own personally created characters into Japan and have them interact with the original historical figures. The DLC is priced higher than it was previously, but this is tied to the fact that the DLC is made up of complete sets of single pieces.  Ultimately, if you love Koei Tecmo's games, Samurai Warriors, or Sengoku Era games, then I'd definitely recommend it without a doubt. However, if you were hoping for a fuller game or a Complete Edition similar to Dynasty Warriors 8, then you may want to just pick up DW8's Complete Edition. Despite being proclaimed to not be an Xtreme Legends expansion, the stripped parts of Samurai Warriors 4-II leave you feeling like it was just an Xtreme Legends expansion.",
            "review_score": "1"
        },
        {
            "review_text": "only been playing this an hour but played all the rest i really like this version the upgrades are stackable still got the button bashing mayhem more enamys and support this is a game i will play threw and come back to",
            "review_score": "1"
        },
        {
            "review_text": "Still the same mindless mass murdering fun with additional move sets and characters.",
            "review_score": "1"
        },
        {
            "review_text": "I like koei game and i very like samurai game i wait samurai warriors 4 empire come in pc empire is my main warriors games",
            "review_score": "1"
        },
        {
            "review_text": "I just got this game and so far have been having fun, however i go to load it up and it just stays in a black screen and never loads, all my other games work wonderfully besides this one ",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy hack 'n slash and a little bit of history of japan this is the game",
            "review_score": "1"
        },
        {
            "review_text": "I swear dis is best game if u like play Hack and Slash. Cz im old player SW in ps 2 rofl :D",
            "review_score": "1"
        }
    ]
}