{
    "app_id": 348450,
    "name": "Lex Mortis",
    "release_date": "2015-02-09",
    "developer": [
        "Dennis Esie"
    ],
    "publisher": [
        "Dennis Esie"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 66,
    "negative_ratings": 73,
    "price": 3.99,
    "description": "Lex Mortis is an open-world horror game set on a fully explorable island. The game’s atmosphere is directly affected by the time of day. During the daytime you will study the island and it’s mysteries. But at night the enemies reveal themselves, and the worst nightmare becomes real!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348450/header.jpg?t=1484703068",
    "minimum_requirements": "OS: Windows Vista, Windows 7 or Windows 8 Processor: Intel Core i5-750 or AMD Phenom II X4 955 Memory: 2 GB RAM Graphics: Nvidia GTX 560 or AMD Radeon R7 250 DirectX: Version 11 Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows Vista, Windows 7 or Windows 8 Processor: Intel Core i5-2400S or AMD FX-8320 Memory: 4 GB RAM Graphics: Nvidia GTX 660 or AMD Radeon R9 270 DirectX: Version 11 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "I don't like to bash small dev team games, but this is not a good experience. The developer is obviously interested in modeling because the island is impressive in that regard, but the gameplay is severely lacking. it feels more like flying through an empty multiplayer map in dev mode than actually playing a game. there didn't seem to be any sound aside from a couple of music tracks. The game is basically an unfinished benchmark program. Only play if the graphics alone are of great interest to you. the translation issues are the least of problems here.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a horror/exploration type of game created from what I know by one person. Game runs on CryEngine so of course it looks somehow good. Sadly developer abused the reflection effect on the objects to the point that everything looks like its wet/shiny. No matter if inside or outside of houses. It looks weird and I'm sure it eats those few FPSs.  Other than that design of the terrain that player needs to explore its not bad (CryEngine vegetation always looks great). The real problem with the design decision is the simple fact that game is too dark. Its pitch black at night and light sources in houses dont really cast any light on the surrounding. And the player have no torch/light source of any kind. Due to this it gets really uncomfortable and almost unplayable and it's a shame because I was actually getting into the games atmosphere/mystery. I dont know if the developer is still working on this project but I would not buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Seeing that the developer did the last update a year ago, there seems to be little hope that this game gets good. It has some potential, but too many flaws.   Pros: - nice graphics - decent voice acting - some good jump scares  Cons: - overused effects like specular lighting - night too dark - boring level design (the first house is just scattered with random objects) - terrible(!) written journal messages  - boring 'search for key and open doors'-errands - player character doesn't react to environment at all (blood pools etc.)  Don't spend more than 2€ for this until there has been a major update.  DAMNIT ITS THE GRAMAR MURDERERR, I CAN HEAR HE COMING AT FOR ME !!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is sucks ♥♥♥ has awful voice acting and the scares are so stupid. Do not buy this game at all. It may look cool from screen shots and the video, but its an awful game.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even get it load....so couldn't tell you if to buy....just hangs on the play game  At the moment...do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "This game has so many bugs it puts the national history museum to shame, and grammar that defies the english language and makes you question humanity's existance. so why do i recommend this game. Through the countless never ending bugs and diabolical grammar, there is a great horror game with a unique experiance, and for the price of under £10 is quite good. Up to now, im really enjoying the game although feeling like smacking my head on the keyboard for every bug i encounter... Oh and it runswell on amd cough cough cough dying light cough cough.",
            "review_score": "1"
        },
        {
            "review_text": "I don't remember my old experience, than i got wet pants. So.. yeah. Go a head.",
            "review_score": "1"
        }
    ]
}