{
    "app_id": 348510,
    "name": "Autobahn Police Simulator",
    "release_date": "2015-08-26",
    "developer": [
        "Z-Software"
    ],
    "publisher": [
        "Aerosoft GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Casual",
        "Driving"
    ],
    "achievements": 26,
    "positive_ratings": 173,
    "negative_ratings": 322,
    "price": 8.99,
    "description": "Autobahn Police Simulator is the first simulation to realistically reflect the working life of a police officer on the German Autobahn. In numerous and diverse operations the player is responsible for enforcing law and order on Europe’s fastest roads.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348510/header.jpg?t=1556187241",
    "minimum_requirements": "OS: Windows 7/8 (64 Bit) Processor: Quad-Core CPU 3 GHz (64 Bit) Memory: 4 GB RAM Graphics: GPU 1GB VRAM, e.g. NVIDIA GTX 760 or similar (no support for onboard cards) DirectX: Version 11 Network: Broadband Internet connection Storage: 5 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well i spent over a week deliberating this one, in light of the mixed reviews. I ended up watching video reviews online to help me make up my mind.  I'm glad I bought this game. I prefer sims over any other genre, and I always thought a highway police sim would be cool.  Personally, I really can't understand why there's so many negative reviews. I guess a lot of them were written prior to the updates/patches, which appear to have corrected most of the bugs and glitches. It's really not a bad game at all if you're into simulators. And i think this is where most people make the mistake of reviewing it like a regular game instead of a sim.  It can become very tedious and involved, and you can easily lose track of time and your surroundings while playing it. But for me, that is essentially what simulators are all about. They do, after all, have to replicate their real life counterparts. So be prepared to spend looooong periods of time driving, inspecting vehicles and talking to drivers.  That's not ALL there is to do in this game though. You can stop ANY vehicle whenever and wherever you want on the autobahn. You can issue speeding tickets, warnings, fines for offences and defects, and of course arrest the serious law breakers for being under the influence of drink or drugs, or for trying to evade you when you go to pull them over. There's a variety of offences to be found, such as erratic driving, using a mobile phone while driving, not wearing a seat belt, and driving an overladen vehicle.  You can choose from either a marked or unmarked patrol car each time you leave the police station, and attend accidents, investigate reports of suspicious vehicles, and even pursue and recover stolen vehicles. In the boot/trunk of the car you'll find traffic cones, axle scales, and road warning lamps for securing accident scenes. You'll even be working a mix of day and night shifts.  Sooo, let's wrap this up.  Pros: - Half decent graphics - Variety of events and incidents to keep you entertained - Extensive procedures for each task - Ability to decide what action to take when dealing with drivers - 40km of Autobahn to patrol - Promotions awarded as XP increases  Cons: - Blue light is distracting during in-car view - Documentation in the game is displayed in German (licenses, waybills etc) - Vehicle controls aren't great when using keyboard, so a wheel is recommended - An understanding of German traffic law is almost essential with a few of the tasks, as the manual does not explain it  These are just a few thoughts off the top of my head following a few hours of gameplay.  In summary, I love this game. It does what any decent simulator SHOULD do. It puts you in someone else's shoes and gives you an insight into a different world. I can see myself playing this for a long time to come, and I personally believe the replay value will be quite high.  I only hope the developers might introduce some more scenarios and vehicles over time.  If you've been pondering this one. Get it. You won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "This Game is really fun. The problems with lag can be resolved very easily by turning off anti-aliasing in the options tab. This is very common with many games. There are many controls which are not in any other Police Sim game like this like seperate controls for lights, sirens and pull over. This really helps with the way teh traffic reacts. Top game for a cheap price.",
            "review_score": "1"
        },
        {
            "review_text": "  there is a bit of a problem this game is really laggy and my other steam games dont lag if someone knows the solution please tell me because i really want to play.",
            "review_score": "1"
        },
        {
            "review_text": "Please get this for Mac! It would be sooo nice to get it on the Mac!",
            "review_score": "1"
        },
        {
            "review_text": "This is A real police simulator, which I like very much but they should do different jobs and little bit better looking characters...   But I say Yes for this game and I'm waiting for the sequel!",
            "review_score": "1"
        },
        {
            "review_text": "This game is but it's not worth £14.99! Wait for a deal or get it for much cheaper.  It is quite fun and you can have some very funny moments but the steering is extremely hard!  If you want to get the full experience from this game then get a steering wheel that you can plug into your PC.  There should be less driving and there should be a GPS system that higlights the quickest route from A to B. It should be shown on the mini-map and on the road!  Graphics- 4/10  Steering- 2/10  Braking- 5/10  Realism- 7/10  Price- 1/10  Lights (sirens)- 3/10  Average Score- 7.33333333333333333333333333333333333333333333333333333333333333333333333333333/10",
            "review_score": "1"
        },
        {
            "review_text": "game did not select my gtx970m instead used my intelhd and would lock up. but even after that was straighted out. Game controls would come and go as they please and with no torurial i found the game was not worth 20.",
            "review_score": "-1"
        },
        {
            "review_text": "i really wanted to play this game but unfortunately the control mechanics are that insanely ♥♥♥♥♥♥♥♥ that it is impossible to control your police cruiser at any functionable speed....even with a controller it is horrid. I come back to it every few weeks or so and try to stick with it but it takes about 10 mins of driving on average 40 kph so i can stay off the barriers lol....after 10 minutes i throw my hands up in despair and close the game...",
            "review_score": "-1"
        },
        {
            "review_text": "Please optimze for the Nvidia M cards. I can play GTA V on high with my 970M but I cant play this on low at 720p becasue the fps is 15. Game looks good but unplayable",
            "review_score": "-1"
        },
        {
            "review_text": "This game was so horrible i couldnt even f***ing load the game:(",
            "review_score": "-1"
        },
        {
            "review_text": "the game is not working anymore",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe its just my game, but the controls are terrible and driving without a steering wheel is hard",
            "review_score": "-1"
        }
    ]
}