{
    "app_id": 348620,
    "name": "Voices from the Sea",
    "release_date": "2015-03-24",
    "developer": [
        "Zeiva Inc"
    ],
    "publisher": [
        "Zeiva Inc"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Visual Novel",
        "Anime"
    ],
    "achievements": 0,
    "positive_ratings": 1083,
    "negative_ratings": 75,
    "price": 0.0,
    "description": "Follow the story of a young boy, Cantus as he meets Maris, the mysterious girl by the sea - an experience that will change his life forever.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348620/header.jpg?t=1554753245",
    "minimum_requirements": "OS: XP Processor: 1Ghz Memory: 2 GB RAM Storage: 130 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's like your first girlfriend, where you don't know what to expect, but then it shanks you in the heart without warning  10/10 would feels again",
            "review_score": "1"
        },
        {
            "review_text": "  One word for each aspect of this game.",
            "review_score": "1"
        },
        {
            "review_text": "This definatly deserves a 10/10, would recommend to anyone looking for a lot of heart in a story, it made me tear up at the end, it was that good. Download it, it wont be a waste of time i promise.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful story...  Beautiful art... I love this game... so sad that it's quite short... ",
            "review_score": "1"
        },
        {
            "review_text": "No jokes about tentacles, WTF steam community~?!&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Heartwarming Decent story Short but enjoyable Loveable characters Friendship Great animation  10/10 Enjoyed the game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Because it made me cry The end went 0 to a 100 really quick,and a good twist at the end.Played only the free version.",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet. 10/10 would wanna feel again.",
            "review_score": "1"
        },
        {
            "review_text": "It's just a simple little VN running on a flash player, what could be so special?  Nothing, and that's good. It's a simple little story, touching the heart where it matters most within a span of 30 minutes. The seashells were a nice little addition for some replayability, but I'm on the Free version and not the Plus version, so who cares?  Not a 10/10, but easily a 7/10 for something so beautifully simplistic. Thank you for the nice short story.",
            "review_score": "1"
        },
        {
            "review_text": "This was just a ploy to get us to care more about our families, wasn't it?",
            "review_score": "1"
        },
        {
            "review_text": "I get all the ♥♥♥♥♥es with my seashells!",
            "review_score": "1"
        },
        {
            "review_text": "Nice short visual Novel. Simple story line, nice visuals, but it's free, so you can't complain about it being so short and simple. If you have an hour to spare, go for it.",
            "review_score": "1"
        },
        {
            "review_text": "I see this game I give in and play it I slowly start to love it I want more to it Then all of a sudden  The FEELS THROUGH THE HEART!  10/10 will always keep and remember.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing short vis-nov, great graphics with nice sound effects and music, plot is pretty good too. There are some things I could go against, but overall I'd recommend playing/reading. ( ^ - ^ )",
            "review_score": "1"
        },
        {
            "review_text": "Weather report says its worth reading.",
            "review_score": "1"
        },
        {
            "review_text": "Really beautifull story! i really recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet, thoughtful, and had a beautiful soundtrack. Loved it. :)",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing  i liked the girl she is so nice and cute &lt;3 why the girls in real life are not like her the game is nice the game have a deep Message and i feel like this boy is just like me.. --------------- [9/10] you have to try this game",
            "review_score": "1"
        },
        {
            "review_text": "It's beyond me how a game like this got so many positive reviews. O.o  The prose is incredibly weak and akin to that of a fanfiction, the characters are plain boring and the OST gets repetitive rather quickly. The life changing experience was also rather dull, even more so when you consider time would likely teach the boy those things by itself. Maris is really generic as well and could have had a better development, there are many ways to give depth to the kind of character she is.   All in all it was a pretty bad game save for the okayish art and funny faces every now and then. The characters decide to tell each other jokes at some point and that was honestly the game's highlight... It takes around 30-40 minutes to finish the whole thing and I'm sure you can find something better to do with that time. :p",
            "review_score": "-1"
        },
        {
            "review_text": "Best 60 minutes i had this year!",
            "review_score": "1"
        },
        {
            "review_text": "A short and cute little drabble about an idealized little boy who loves his mommy.   That's it. You get what you pay for.",
            "review_score": "-1"
        },
        {
            "review_text": "Gr8 visuals. Gr8 Story. Free. Feels . 10/10 would seashell again",
            "review_score": "1"
        },
        {
            "review_text": "Worth the time. Great game, and a kinda touching story, really didn't think about that plot twist. I strongly recommend this game to every Visual Novel games fans.",
            "review_score": "1"
        },
        {
            "review_text": "How do I stop feels? They won't stop.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game with a beatiful story. Great job :)",
            "review_score": "1"
        },
        {
            "review_text": "I kept dreading when I would play this game. I knew just by looking at it that I would be mildly bored by it for it's 40 short minutes of play time, and you know what?  I was right in dreading it.  Voices from the Sea is another interactive Japanese-culture-inspired interactive novel. It follows an angsty boy named... Cantus, who lives on an island and is plagued by all the 'noise' in his world, like his mom telling him to make more friends, or a kid named Garrio poking fun of him. Honestly, Cantus comes across as a bit of a pr*** in the scenes away from the ocean. Like a moody teenager pouting about how life sucks and no one understands him.  But, unbeknownst to our unlikeable protagonist, he meets a mysterious girl from the ocean named Maris, who is... just strange. Not really charming or enlightening. Just strange. She tries desperately to make him smile in the 7 days they talk, but all of their scenes are as awkwardly-written as everything else in the game. There are SOME points where they start talking like real people (about, you know, real feelings and relationships instead of angsty bullsh**), but they're soon cut off by the pretentious narration. And the blackout with a sentence-ending to close each day is the icing on the pretentious cake.  The game does have a little quality put into the backgrounds, but the actual animation and music are just... bland and cheap-looking. Sure, Everlasting Summer is one of my favorite interactive novels and it looks very similar to Voices from the Sea, but it's the story that made Everlasting Summer such an engrossing game. And Voices from the Sea just doesn't have it. A kid is depressed about vague stuff in life, a girl talks to him in some cringey and awkward scenes, and he realizes he loves his mom out of nowhere at the end... even with how sh**ty he's been treating her up to that point. It just doesn't add up.   But, wait! Voices from the Sea does involve interactivity! REAL interactivity! As in, you can make decisions in this game! Guess what you can choose?  What f***ing seashell looks best.  Are you f***ing kidding me? What is this bullsh**? It's not implemented into the story, save for the end, and it's just a mindless bit where you stare at the same blank screen (Even though you might be moving right or left, according to the game) and you just pick a seashell for the day. It has no impact on the plot. It's just there.  Voices from the Sea is as pretentious as it is artless. As I expected, I was mildly bored while playing, but all those little irritating things culminated into an overall unpleasant 40 minutes that I feel were honestly wasted on this bland interactive novel. It might be free, but I heavily recommend you spend your time on an actually well-written interactive novel, like Everlasting Summer. As for Voices from the Sea, I'm giving it a 3/10. There's a little quality here, but it's so bogged down by the rest of the bullsh** in this game, that I cannot see myself playing it again ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Its short story, written by a teen likely, about your average asocial autistic cynical kid who happens to be lucky enough to find a girl that by God's design want to make him specially happy (no real reason, just because anime protagonist), is not really that bad (is the typical anime boy-girl ♥♥♥♥♥♥♥t scenario) but is too short, the relationship is hyper-rushed and the delivery is predictable.  At least the music goes good with the game and hey, it was short.",
            "review_score": "-1"
        },
        {
            "review_text": "only 1 ending with free version, dont have many choices, but the art and plot nice  the feels too heavy",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked this game it had a really good story and some good twist's and funny moments. I would recommend this game for anyone who likes a good SHORT story",
            "review_score": "1"
        },
        {
            "review_text": "Always wanted to relive the moment that I had with my girlfriend but I can't feel her beside me anymore.  Good game,we can finally talk to each other again for 7 days.atleast.Worth it for my feels",
            "review_score": "1"
        },
        {
            "review_text": "Installed this on a whim.  Short and sweet little VN. Cute story and characters. Adorable art.  Only issue I had was that in full screen mode, I was unable to use my mouse. Forcing me to play in windowed mode where it worked. (using a Surface Pro 2)   Other than that, great little game. Free too, no reason not to try it.",
            "review_score": "1"
        },
        {
            "review_text": "I loved her i she loved me visited me everyday then the most terrible things happens i realize this is a game and am sitting infront of my pc talking to myself real story bro",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this Viusal novel, the young age of the protagonist being cause for a non-perverted/non-harem/non-ecchi. Many save slots for barely nothing, not meaning the content being just barely necessary to mention, but the options, not having any impact on the further story. The first option (like 'Change the topic') should always be chosen, because 'collecting sea shells' is just a skip, since you are going to do it either way. A nice, lightly flowing story sometimes kind of confusing you, to strenghten the total impact of the story on you and maybe also your opinion about certain realtives of yours.  Really well done, I recommend this highly.",
            "review_score": "1"
        },
        {
            "review_text": "The writing for this game is only okay, and at times actually quite poor. But the story's short and sweet, and the game is free, so there's no drawback to trying it.",
            "review_score": "1"
        },
        {
            "review_text": "God damnit.   I absolutely HATE getting a bad case of the feels.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Although it was more of an interactive story than a game.",
            "review_score": "1"
        },
        {
            "review_text": "this game's ending is just like an anime's end. it fuills me with happyness.the game's free so why not give it a try. I dint have any probloms with it",
            "review_score": "1"
        },
        {
            "review_text": "This visual novel is short and cute, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "I played it the first time and it was great... It was a wonderful story and very beautiful. Even when i dont like those games i really enjoyed playing. I wanted to make a funny review with jokes but this game was so great so i couldn't make fun of it. Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "I cried for the last part T.T...........Cantus......this anime makes me realize that everyone do really care about me and I too care about them also.........sniff...sniff............it's so touching T.T........I really want an imaginary friend that I can physically see and physical talk to them(not a ghost by the way)...but it's impossible for that.........",
            "review_score": "1"
        },
        {
            "review_text": "...My god.... It''s....beautiful Highly,HIGHLY recommend playing this game It really tugs at the heart strings and I can REALLY relate with it",
            "review_score": "1"
        },
        {
            "review_text": "Voices from the Sea is a short visual novel that has reasonably good artwork throughout. It's heavily reliant on blue and white for most of its color scheme. Depending on your reading speed, you’re looking at a 40 to 60 minute experience.  The story has plenty of funny moments and goes for charm and sweetness when the characters aren’t being goofy. You can expect to be a bitter, lonely 13 year old male, at least in the beginning. I strongly suggest taking the dialogue choice that isn’t the seashell one first to maximize your experience since the latter is the critical path.  You can also expect a lot of seashells by the seashore. Multiple playthroughs will allow you to collect every single seashell if you desire them all.  Finally, I want anime eyes. I would be able to see in the dark so well. ",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. The art is fine. If you have some spare time (About 30-1hr or more) then play this game. The story is kind of sad, but it's a great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game destroyed me heart and soul. This game will make you fall in love with your inner being. It is so amazing that your eyes roll back in your head and your spine slides out your ♥♥♥♥. 10/10 would rekk again. Thank you Morgan Freeman",
            "review_score": "1"
        },
        {
            "review_text": "short but sweet visual novel. it can be finished in about a half hour, but I spent 2 hours collecting the seashells so I could hear the extra dialogue. I bought the dlc for the voice acting mainly. while it wasn't needed, the VA added a very nice touch to the game.  10/10 would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "...is the 'Timetravel-Romance' Steins;Gate?",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet, and free. Great artwork with a simple interface. This story made ME smile! :)",
            "review_score": "1"
        },
        {
            "review_text": "9/10 I wish it was longer, I cri evry tim  -Good story between the two - Wish there was more in the story, or more choices that gave a bad ending at least. - Emotional",
            "review_score": "1"
        },
        {
            "review_text": "Such a beautiful visual novel. I love everything about it. It made me laugh, smile, and sad. I recommend this game to everyone ~",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most beautiful games I have ever played.. I think many people can relate to Cantus, and you make a progress with him. It shows how you should realize the good things people do and not always focus on the bad stuff. Appreciate the small things and put yourself in someone's shoes before you are pis.sed or angry.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "this was very touching, it's heartwarming and has a really good moral",
            "review_score": "1"
        },
        {
            "review_text": "This game give me speechless.  10 out of 10  If you can make a story that let you make more choice that effect with a story, that would be awesome.  If you can do that. This game is 15/10.  sorry for my bad deutsch. ^-^ Pftt",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Lie down &gt;Try not to cry &gt;Cry a lot  10/10",
            "review_score": "1"
        },
        {
            "review_text": "good game, nc story 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Contains waifu material = Yes.",
            "review_score": "1"
        },
        {
            "review_text": "This game was beautiful, the story line was amazing and the characters were great, it is certainly a game I would recommend to anyone! It is one of the best visual novel games I have ever played :)",
            "review_score": "1"
        },
        {
            "review_text": "The story's kinda short, but it's good. I recommend it. Should give you something.",
            "review_score": "1"
        },
        {
            "review_text": "Want to experience having your 1st gf and having ur heart broken? then play this ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "the Feels",
            "review_score": "1"
        },
        {
            "review_text": "It has a short easy story to follow, great drawings and very nice music. Its short sweet and to the point, i recamend this as a pass time for those who are just geting into manga/anime.",
            "review_score": "1"
        },
        {
            "review_text": "Played it for 30 minutes and when it finished i got the feels.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing. This is the first VN game I've ever played and I want to play more VN's if their stories are as interesting as this.   In Voices from the Sea you are a young boy named Cantus, an anti-social kid who has problems with his mother and the people around him, and one day you meet a strange girl named Maris while on the beach and she becomes your friend. Maris wants to cheer Cantus up, so she vows to make him smile within seven days. Each day they have a different discussion and each day ends with you collecting a seashell and giving it to Maris.   The story is beautiful and I personally was able to connect with Cantus (due to the fact that I'm an anti-social as well and I'm only one year older than him, about to turn 15 in a month myself although my age is irelevent). The only qualm I have with it is that at the end of every day you have to collect a seashell, and I wish that there was more ways to interact with Maris. But other then that, I HIGHLY RECOMMEND this to everyone. I hope you enjoy this game like I did. Game Time: 1 Hour. Rating: 9.5/10 Deserves an Anime or OVA series",
            "review_score": "1"
        },
        {
            "review_text": "great game and a touching story about a once in a life-time experice ",
            "review_score": "1"
        },
        {
            "review_text": "No matter what choice you make... it always ends in an awkward situation  its like call of duty without guns  10/10 would get derpressed again",
            "review_score": "1"
        },
        {
            "review_text": "This being the first visual novel i've actually finished, i gives high expectations for the next.",
            "review_score": "1"
        },
        {
            "review_text": "a game that we can all reflect on at one point in life",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. I actually teared up. I think everyone should check this game out, especially for depressed people or sad people. Thank you Devs ;)",
            "review_score": "1"
        },
        {
            "review_text": "What an awesome game. Left me crying at the end. Recommend 10/10",
            "review_score": "1"
        },
        {
            "review_text": "As a game, I wish there was more, but because it is a visual novel I understand why there is not. That being said, I really enjoyed the story here and it's really easy to complete (completed it in about 45 minutes). The backgrounds are cute and the character designs of Maris are adorable! So yea I guess I enjoyed this visual novel.",
            "review_score": "1"
        },
        {
            "review_text": "The best short VN I've ever played. 10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "A short visual novel. There really isn't much to it; has a good story, we can make choices too, although those choices are quite pointless considering they don't change much or anything at all in the game. It's worth trying it, this version's free after all, so if you like VN, do not hesitate to download.",
            "review_score": "1"
        },
        {
            "review_text": "It hit me in the feels. The game lasted for a short amount of time but it was still a piece of art. For a Flash Game, it has a great story line.",
            "review_score": "1"
        },
        {
            "review_text": "Almost brought me to tears in the end, but its so touching and amazing!",
            "review_score": "1"
        },
        {
            "review_text": "All I gotta say is wow, beautiful story, great ending, amazing characters. Amazing art too! Its a short story I finished in about an hour but it was worth it, besides its free anyways. I recommend getting this for a good quick play.",
            "review_score": "1"
        },
        {
            "review_text": "I may have finished it all in one day, but it was a really good game with a really good story line. I totally recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Not much gameplay to it. More of an interactive story. A beautiful story too. If you like anime story games then this one is for you. And free too!",
            "review_score": "1"
        },
        {
            "review_text": "'Short and sweet' is the phrase for this one. It doesnt take long to get through it but it's actually kind of beautiful. As a suggestion, pick the first option before looking for seashells. It feels more like a full experience that way. If you're not really sure about this sort of game, here's the question you should ask: What do you have to lose? The game is free, it's a small download and at most it will probably take about half an hour of your life. So try it. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute-c. I liked the art style and best of all, it's free! However, I didn't like how they did nothing with the dad. Why even include him if you never even see him? Worth a playthrough, it takes about 45 minutes to an hour. This was my first visual novel I played, and I chose this one because it is one of the few visual novels on steam that DOESN'T have to be censored, which was nice ^-^ (but seriously, Beach Bounce, Sakura Spirit and Nekopara all just came out or had a new release. I didn't even bother seeing what they were about because all of them had 'nudity' as user-tags). Overall, 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "da feels is strong in this one :3",
            "review_score": "1"
        },
        {
            "review_text": "Quite edgy.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cute and pretty. Really liked the music, and the story wasn't all that bad. Being free also helps.",
            "review_score": "1"
        },
        {
            "review_text": "A short and sweet game. Comes with a little bit of feels.",
            "review_score": "1"
        },
        {
            "review_text": "this great story planted a smaile right on my face, thank you for working so hard on it.",
            "review_score": "1"
        },
        {
            "review_text": "Feels. Oh god darn those feels. I can't believe this is free for this amazingness! I mean, I'm not complaining. Honestly, this totally deserves a sequel. It also deserves an anime. But, the most important thing is, the ending. It's almost too cute. Almost too feely.   I love it too much. I love the art style, the ending, the characters and their designs, everything.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would cry again",
            "review_score": "1"
        },
        {
            "review_text": "For those who wants a really heartwarming story,then this game suits the part,it also has great Art and music 10/10 would play it again. ^ ^",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a feels story",
            "review_score": "1"
        },
        {
            "review_text": "very good game. short story but still is good time for the time. best part is no cost 26.95",
            "review_score": "1"
        },
        {
            "review_text": "My entire time is just listening to the music on the menu screen. Then after listening to it twice, I got to the game and was bored.  10/10 Menu Music",
            "review_score": "1"
        },
        {
            "review_text": "I Cried like an Idiot ;~;   Voices From the Sea  10/10 would fall in love with this story again.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful music and a great story.The character relates to a relatively great amount of people such as myself. I had a good few laughs from this and a few emotional parts.A very good game to play when you're bored and looking for something good to spend the extra time on.",
            "review_score": "1"
        },
        {
            "review_text": "I personally really enjoyed this game. The storyline was amazing! I really liked the music and the cheery colours. I just wished there was more though",
            "review_score": "1"
        },
        {
            "review_text": "Its a pretty short casual visual novel, which took me around 70 mins to finish (probably could've been 30 if I wasn't distracted my my friend messaging me...). It a sweet story of how to find the true value of things. However, it felt more like an intro even though I know it was finished. I wouldn't say it was one of the best visual novel but more casual, and with how short it is there is nothing stopping you from not reading it.",
            "review_score": "1"
        }
    ]
}