{
    "app_id": 348790,
    "name": "Wooden Floor",
    "release_date": "2015-02-13",
    "developer": [
        "pheenix93"
    ],
    "publisher": [
        "pheenix93"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 101,
    "negative_ratings": 88,
    "price": 1.69,
    "description": "Wooden Floor is a first person horror game full of visual trickery ... Not being able to predict what is going to happen next you need to make your way through the haunted house.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348790/header.jpg?t=1493662743",
    "minimum_requirements": "Mínimo: SO: Windows XP Procesador: Dual Core ~2,6 GHz Memoria: 2 GB de RAM Gráficos: GeForce 8600GT or comparative card DirectX: Versión 9.0c Almacenamiento: 2 GB de espacio disponible",
    "recommended_requirements": "Recomendado: SO: Windows 7 Procesador: Intel Core i5 Memoria: 4 GB de RAM Gráficos: GeForce GTX650 DirectX: Versión 11 Almacenamiento: 4 GB de espacio disponible",
    "reviews": [
        {
            "review_text": "Pros: - Graphics are not bad - Sounds create an eerie atmosphere  Cons: - No options menu. Made myself sick due to a lack of mouse sensitivity options/motion blur options. - Too many spelling/grammar errors to count - Not scary - Developer uses the same prop/model over, and over, and over again - Buggy - Left Ctrl to jump (seriously, when has Jump ever been bound to control?) - Cannot look all the way down  No, just no.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game for someone who just wants to get a taste of a horror game and I feel the game was put together somewhat well. The game in general leading up to the end was decent, of course being a cheap price as I got it for under 50 cents. With that said, it definitely gives you the creep factor and makes you always wondering and hoping nothing happens. Atmosphere I would rate a solid 8/10, gameplay 7/10. Now for the bad, this game doesnt have too much content and it really suffers, and the thing that raises the finger for you to flip off the game is the fact the end part where you basically have to learn from trial and error without any save. This game has great potential and I do like it, however it needs be advised a bit because the end basically ruins the experience.   Overall: 5.5/10 which is actually decent considering.",
            "review_score": "1"
        },
        {
            "review_text": "I would like to start off by saying that this game is just not good. Story doesnt make any sense at all, theres no run key, and its not even scary. Its more of just suspende than it is scary. Thank god i only paid $2.39 for this game because it is crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Only played for 20 minutes in the dark with headphones.. I was ~just~ creeped out enough that I'd wait for daylight to play it further, I don;t want to get completely creeped out -lol. If you are at all jumpy or yielding to your own imagination this simple idea is quite effective. If you are jaded and not easily swayed move onto something more grand.   I have played many games and creatures with big pointy teeth are not as scary as my own psyche. This would be truly frightening if the graphics were as detailed as the audio effects which are just flawlessly executed. So far, I feel this game is something like a creepy Stanley Parable, less the humor; I've spent more money on worse.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very solid structure. One of the best First Person Indie, Horror, Role-Playing, Inspiring, Fighting, Hack-and-Slash, Mash em up, Roguelike, Space, Survival, Adventure, Tower-Defense, Builder, MMO, of the Byzantine Empire.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Well i got this game thinking hey ill have my friend watch me play as i screen share so im playing eveything is going niice hes laughing because the music alone is scaring me then i died and yeah i stopped oh well 5/10 wouldnt buy full price pretty trash game",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't play long, but I will say this, it has atmosphere. I found myself spinning around at the slightest sound.  I'd read it's short, but I got it for free, so it's money well spent",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for around 10 cents. this was the biggest waste of 10 cents i have ever experienced. the game, if you can even call it a game, consists of trying to locate keys in vague locations, and oftentimes the game glitches out and you cant see the key even though it is right in front of you. the scares are weak, and in all, it felt like a waste of time and money. i hope that the game developer stepped up his skills fror the sequel, not that i plan on playing it. also, the secret room on the 3rd floor was way too easy to find.",
            "review_score": "-1"
        }
    ]
}