{
    "app_id": 348870,
    "name": "Night Mysteries: The Amphora Prisoner",
    "release_date": "2015-02-26",
    "developer": [
        "Anvate Games"
    ],
    "publisher": [
        "Anvate Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Hidden Object"
    ],
    "achievements": 0,
    "positive_ratings": 69,
    "negative_ratings": 40,
    "price": 1.69,
    "description": "You'll enjoy a whole lot of fascinating minigames, an excellent quest for the necessary items, and a captivating and outstanding storyline. A great atmosphere and storyline provide the deepest possible gameplay involvement.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348870/header.jpg?t=1556219944",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium 4 Memory: 512 MB RAM Graphics: DirectX 9.0 compatible video card DirectX: Version 9.0 Storage: 835 MB available space Sound Card: Any sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Written As of 6/1/2015: &amp; there are no present plans by the creators to add them. There are no Achievements. There are no Cards.   Overview",
            "review_score": "1"
        },
        {
            "review_text": "For 99 cents it's a nice game. Don't read the negative revieuws. For this price you have nothing to complain. Sometimes you really don't know where to go, but there is always a hint to get you there. Puzzles are simple. The story? Most of the times I play a HOG I don't care what the story is, I just play it for surching things and solving puzzles,so I don't care what the story is, and don't know if it's bad or good. Just buy it on sale and you have an enjoyable game.....  It would be nice though when it had trading cards.",
            "review_score": "1"
        },
        {
            "review_text": "This game have a nice mystic atmosphere! Sometimes even was a scary moments:)Especially like the feeling that you are completely alone with dark spirits. Also this game has interesting puzzles,tasks and nice graphics. I recommend this game for all who likes old school quests;)",
            "review_score": "1"
        },
        {
            "review_text": "This game was ok, but I found it rather frustrating and ended up using hints more often than I prefer to be able to find objects or know what to do next, and I played it on casual/easy mode. A previous review had mentioned that there was no icon to indicate an item could be collected, so I was aware of that going into the game, but it was incredibly difficult to find necessary items. You had to click on a specific part of some items to be able to collect it/use it, and for items in hidden object scenes that need an extra step to find, it was nearly impossible to find it as you just have to click everywhere possible. When a new item is needed to move forward in the game, you need to backtrack and search everywhere possible to find either a new hidden object scene or some new area to interact with, again without an icon showing you an item you can suddenly interact with. The map only shows you where you are, not any area with an available action, so that was no help at all during the game - same with the journal. The story was interesting, but left a lot up to the imagination to fill in storyline gaps. If it's on sale, it's an alright way to spend some time, but otherwise it just isn't worth it.",
            "review_score": "-1"
        }
    ]
}