{
    "app_id": 348820,
    "name": "FIM Speedway Grand Prix 15",
    "release_date": "2015-11-30",
    "developer": [
        "SoftPlanet"
    ],
    "publisher": [
        "SoftPlanet"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Simulation",
        "Racing"
    ],
    "achievements": 35,
    "positive_ratings": 210,
    "negative_ratings": 21,
    "price": 19.99,
    "description": "Tremendous power and no brakes! Experience the thrill of speedway! FIM Speedway Grand Prix 15 is the ultimate speedway simulator of all time. Show your skill and tactics in the fight for the title of World Champion in all events and stadiums of the Grand Prix 2015 season!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/348820/header.jpg?t=1506341454",
    "minimum_requirements": "OS: Windows Vista 64-bit or greater  –  ༺ 64-BIT OPERATING SYSTEM REQUIRED ༻ Processor: AMD Athlon 64 X2 Dual Core 6400+ / Intel Core 2 Duo 2.4 GHz (3MB cache) Memory: 2 GB RAM Graphics: AMD Radeon HD 7770 / Nvidia GTX 460 / Nvidia GTX 675M DirectX: Version 11 Storage: 3 GB available space Additional Notes: Integrated laptop graphics cards may work but are NOT officially supported.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Such amazing little game! Never been a fan of Speedway but i can tell you, after playing this i now love the sport!  Graphics looks great. Just wish there would be more mud flying around and impair your vision and making a mess of things, but no biggy.  The bikes are great fun to ride and it feels really good slinging it round the corners! I would like to see a greater emphasis on the career mode for the next game. Like creating your own rider and work your way up from a lower classed Grand Prix.  All in all i can't recommend this game enough for any fan of two wheelers!  /Hugs and Kisses",
            "review_score": "1"
        },
        {
            "review_text": "A must buy , ever since watching this type of racing at Costa Mesa fairgrounds I have been hooked , it's a challenge but what isn't . Enjoy",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic, steep learning curve but well worth it. Great job it really feels like your not only riding, but also really competing. I hope 2016 will be even better.",
            "review_score": "1"
        },
        {
            "review_text": "well having only put 30hrs into this game i feel ive done alot in that time, the game is great for any fans or riders out there. it covers novices to hardened pro's in my opinion. its graphically beautiful and very enjoyable i get angry when i get wiped out in a bend and get excluded for it but i suppose alot of desisions go against the pro's too your out there trying to get a perfect score and wham! you get taken out and then excluded! WTF but again i kind of like this feature i like the fact the track physics change with every race, and that no 2 tracks race the same. some can be almost full throttle circles and the next will be long straights and tight bends so you need to take your time in the corners. any fan of speedway and racing games should buy this",
            "review_score": "1"
        },
        {
            "review_text": "Terrible. Tried to install 4 times and keeps freezing on the splash screen. No assistance from helpdesk.",
            "review_score": "-1"
        }
    ]
}