{
    "app_id": 349530,
    "name": "TableTop Cricket",
    "release_date": "2015-02-25",
    "developer": [
        "Big Ant Studios"
    ],
    "publisher": [
        "Big Ant Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Indie",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 19,
    "negative_ratings": 9,
    "price": 9.99,
    "description": "Find the gaps in the field or just smack the ball out of the stadium, TableTop Cricket is a fast and furious take on cricket that takes you on a world tour with tense matches and challenges aplenty.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/349530/header.jpg?t=1547089083",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: Pentium Dual-Core CPU E5700 @ 2.00Ghz/AMD Athlon II X2 250 Processor 2.01Ghz Memory: 512 MB RAM Graphics: ATi Radeon HD2400 pro or NVIDIA Geforce 8 Series DirectX: Version 9.0c Network: Broadband Internet connection Storage: 180 MB available space",
    "recommended_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: Intel CoreTM I3-3210 CPU @ 3.20Ghz (4 Cpus) /AMD Phenom II X4 960T 3.0Ghz Memory: 1 GB RAM Graphics: Radeon HD 7790 or NVIDIA GeForce GTX 650 with minimum 1GB Memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 180 MB available space",
    "reviews": [
        {
            "review_text": "The controls are fluent, it's really fun to play... FOR THE FIRST 5 MINUTES. After you bat, you bowl, like in normal cricket, but in this game I cannot figure out how to bowl if my life depended on it. I select where I want to bowl, then hit A (or enter) but then the game just seems to give up and leave you staring at your screen wondering why you payed 10 dollars for it.  Overall: The batting is really fun and fluent, you will never see me without a smile once I've hit a six against England. Really, it's just the bowling that is the sledgehammer to the gut for me.  EDIT:  I've found out how to bowl but I shouldn't have to review the controls/mash buttons mindlessly to find out how to bowl...",
            "review_score": "-1"
        },
        {
            "review_text": "Great fun and cheap via Big Ant's store. Worth picking up at that lowered price as a fun arcade type game (or for cricket tabletop nostalgia) to complement their cricket simulator, Don Bradman Cricket 14.",
            "review_score": "1"
        },
        {
            "review_text": "Table Top Cricket is the best way to have fun and relieve yourself from stress whilst playing your most loved game , Cricket!  Gameplay is pretty good, very less lags in online which will make it more enjoyable!! (Y)  Awesome work by Big Ants to come up with this game and let us enjoy! ;)   #ThanQ :)",
            "review_score": "1"
        }
    ]
}