{
    "app_id": 349680,
    "name": "Supercharged Robot VULKAISER",
    "release_date": "2015-06-04",
    "developer": [
        "ASTRO PORT"
    ],
    "publisher": [
        "Nyu Media"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Indie"
    ],
    "achievements": 33,
    "positive_ratings": 213,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "70s giant robot anime-inspired side-scrolling shooting from the creators of SATAZIUS and GIGANTIC ARMY!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/349680/header.jpg?t=1447368964",
    "minimum_requirements": "OS: Windows 2000/XP/Windows 7 Processor: Pentium III 1GHz or better Memory: 256 MB RAM Graphics: NDIVIA Geforce series, AMD(ATI) Radeon series DirectX: Version 8.0 Storage: 120 MB available space Sound Card: DirectSound-compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "what an awesome and nostalgia-filled shoot 'em up/bullet hell game. the game is full of character from the art style to the great soundtrack, i spent many years of my childhood watching anime series like (Grendizer and such). even my nickname on Steam is based on a character from Grendizer series.   gameplay wise, the game plays great and the easy difficulty would suit new comers very well and even medium is good. the harder ones are for the vets of course and they are lots of fun too. you start with your robot and you have the normal attack and there is a charged attack that takes a few seconds to charge and there is the omega bomb wich is usable only 1 time per stage. also there are ships that you can merge with to get an extra weapon like rockets or thunder and they are really helpful. i loved every second of this game and i would highly recommend to anyone interested in old animes like Grendizer and such or any one interested in bullet-hell games &lt;3.",
            "review_score": "1"
        },
        {
            "review_text": "Even for full price ($5), this game is amazing. It's hands down the best $2.49 I've ever spent on Steam.  Classic anime visual style? Check Mech suits? Check Exo weapon modules to connect with? Check Bullet hell? Check Interesting enemies and bosses? Check References to popular anime? Check  What's not to like?  On a more serious note, the controls are incredibly responsive. There's a bit of a story, but it's mostly just the characters chatting with you in between levels. This game is just a straightforward shmup that is a ton of fun on the easiest difficulty and a real challenge on the hardest. It's short, but the replayability is there. I can literally think of nothing else that could make this game better.  If you're a fan of shmups or even if you just like classic mecha anime, I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "The cheeseball story is great, the shooting's pretty good Had a little slowdown when there's lots of enemies This and MEGLILO go together, play em both",
            "review_score": "1"
        },
        {
            "review_text": "True stories of 1977.",
            "review_score": "1"
        },
        {
            "review_text": "80's horizontal shmups (and 70's anime) nostalgia in the vein!",
            "review_score": "1"
        },
        {
            "review_text": "Get this game... What not good enough for you as a review? Dude.  Literally.  Get.  This.  Game.  (pls)",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun shoot em' up game. Story is ok, graphics are good and the controls are perfect for what it is.  ",
            "review_score": "1"
        },
        {
            "review_text": "For a game I got in a bundle, I ♥♥♥♥ing love this game. The only problem is the higher the difficult you go, the more asian you need to be to even survive. :\\",
            "review_score": "1"
        },
        {
            "review_text": "An incredible little Shoot Em Up, especially if you are a /m/an of good taste who enjoys his old-timey super robot shows.  You've got your honorable alien prince, who wants nothing more than a fair duel and runs away to fight you again in the next episode, your well developed five man team of pilots, who you can learn as much about as you want, the super cool moment where ALL THE WARRIORS combine forces to fight the Big Bad Evil Guy (even if in the end they don't help all that much and Grendiz- uuh, i mean Vulkaiser has to do all the hard work).  All in all, this is a very fun little game with a lot of replay value that any fans of old timey super robots and/or shmups should check out.  Do be warned though; it's brutally difficult. It'll take you a lot of time to git gud.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I'm not even familiar with the anime that this game is based off of, but this is a mechanically amazing space shooter/bullet hell game. You can team up with your 4 robot companions to add their various weapons to your own base weaponry, but take too much damage while they are equipped and you lose them permanently for that playthrough. It's an arcade style game, so its fairly short. My only complaint with it is that all achievements related to beating the game are currently not working (this includes the achievements for beating it on each difficulty, as well as the one for beating it without using your omega weapon). I'd like to see these achievements fixed but the game itself is great!",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything you'll ever need. Robots, rocket, lasers, needles, drills, aliens, and even giant monsters",
            "review_score": "1"
        },
        {
            "review_text": "A throwback to classic shoot em up of the 80's and 90's. Good for a short dose of fun, but is quite short. I think I finished close to 50% of the achievments in my first playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "It's a well polished game and does what it does well. Just don't expect too much replay for this price. It's a nice visit to the days of bullet hell shooters.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun, responsive shmup. Short and sweet.",
            "review_score": "1"
        }
    ]
}