{
    "app_id": 349720,
    "name": "Audition Online",
    "release_date": "2015-06-03",
    "developer": [
        "T3 Entertainment"
    ],
    "publisher": [
        "Redbana Corporation"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "MMO"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Music",
        "Rhythm"
    ],
    "achievements": 0,
    "positive_ratings": 751,
    "negative_ratings": 410,
    "price": 0.0,
    "description": "The popular dance and rhythm game, Audition Online, is available for Steam! Create your avatar and play on 20 different game modes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/349720/header.jpg?t=1489460523",
    "minimum_requirements": "OS: Windows 2000 or later Processor: Pentium 4 @ 1.4GHz+ Memory: 512 MB RAM Graphics: NVIDIA FX5200 128MB DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX compatible",
    "recommended_requirements": "OS: Windows XP or later Processor: Dual core (Athlon II or Core 2 Duo) @ 2.0GHz+ Memory: 1 GB RAM Graphics: Any PCI or PCI-E discrete card DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX compatible",
    "reviews": [
        {
            "review_text": "I've been playing this game since beta when this game was under Nexon. I'm writing this review because the other reviews were upsetting. Many of the other reviewers only did it to get $40, which was what Redbana was offering to those who left good reviews. That is why many of the reviewers left their IGNs in their review, which is not usually seen in a Steam review. You'll also notice that many of these reviewers don't have any other games and/or have only reviewed one game (this game). So the reviews are very biased. It is very disappointing to see this kind of abuse.  TL;DR This game is fun, but most of the people that play are terrible. If you plan on playing this game, be prepared for a lot of drama.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing this game for 600+ hours. I know it's not much but i still have something to say. To be honest, i found out about the bribed reviews like last week i think. I'm very dissapointed. The people who wrote positive reviews for in-game currency basically lied to everyone about how 'great' this game is. I won't lie, i got sucked into the game right after i saw the video of it on Steam. I thought it would be fun. Well the first 2 weeks were awesome to be honest. I loved the game very much, but then it changed. As i've noticed, in some of the reviews, people are saying that the graphics are horrible, no settings, etc. Sure, the graphics aren't that great and a game having no settings is just ♥♥♥♥♥♥♥♥, but i don't look at the graphics and all that, i just look at the whole gameplay. Yet i am unsatisfied with some things in this game, so i'm going to write some of my Pros and Cons.  Pros and Cons in my opinion:  Pros:  +The songs might be old, but i still love them and i wouldn't change them. I would just add some new ones. +There are a lot of modes to play, so you won't get bored so easily. (My fav is actually Guitar and Choreo 4 keys CC4) +There are a lot of friendly people in this game and you can talk to them. (Like i said, everything is my opinion) +You don't have to pay2win, which i find very annoying in any kind of games. +It's sort of an 'online dating site' i guess, from my experience some people actually have long lasting online relationships. (I'm also in a online relationship atm, but that's not important)  So i guess these are all the Pros i can think of in my opinion. Now for the Cons and oh boy, i have a lot of them in mind.  Cons:  -Bugs in this game are pretty terrible, especially in Club Dance and Beat Rush. -Crashes. I'm not saying they happen often, but it would be still nice to fix that problem. -The updates are ♥♥♥♥♥♥, since after each update, i've noticed that they don't do anything about the bugs in this game. -As far as i know, the GM's have IQ's of snails, since they banned my FAM for 'hacking' because some guy reported it without any evidence of that crime at all. -A lot of drama. -Most of the stuff in this game costs real money, so if you want to look 'pretty' and you want to stay that way, you have to pay up. -There are also ♥♥♥♥♥♥♥♥ people. -The Events always require for you to pay for something, so ♥♥♥♥ that. -The Tournaments are dead, but they start at a very different time, so i can't really attend them.  So yeah, like i said, these Pros and Cons are basically my thoughts about the game. True, i would be dissapointed if the game was shut down. And i have quite the history with this game. But if it does shut down, i'll just move on. Though i really want to say 1 thing to GM's of this game: Fix the ♥♥♥♥ing bugs will ya? And try turning on your brains, since, as you can see, you're losing people and getting bad reviews. And bribing other players? That's just pathetic. ♥♥♥♥ing pull yourself together.   ",
            "review_score": "-1"
        },
        {
            "review_text": "I was going to leave a positive note, but I changed my mind. This game, since Nexon has been a great game. Very simple to play and friends to make. However, the GMs and people who runs this game now all over the place, yes, in a negative way. GMS favors certain players, so basically those with powers are able to abuse it. Yet, GMS can tell a player they are hacking and abusing the game, while GM's behaviors are no different. Also, situations, mostly security and general issues are dealt with in a very un-morally way.  Therefore, great game, bias GMS, Weak security. Play at your own risk.",
            "review_score": "-1"
        },
        {
            "review_text": "Audition has come a long way and it has changed a lot over time. There are several modes, different maps, new outfits, a new marriage system, etc. However, since changing from Nexon to RedBana, the community has become pretty dead. Most of the time, game rooms are locked because of people playing with others that they personally know or are close to in game. There are barely any males, making the marriage system difficult, as well as ballroom dance and couple dance modes a challenge to even start. High levels tend to dominate over this game leaving new comers feeling at a huge disadvantage. (It's not fun when you continue to keep losing right?). The songs don't update often so you're stuck with having to pick from the same song list. It would be nice to have more up to date, popular songs. Despite all this, I find that I like to play Audition when I'm extremely bored because there is still pleasure in being able to punch in all the arrow keys before your time limit. Audition seems more fun when you're married because you can spend your time trying to upgrade your ring and work on your garden. Otherwise, the game itself and community has a lot of work that needs to be done.",
            "review_score": "-1"
        },
        {
            "review_text": "This game won't run for me but download if you like things similar to this game. (This game is not comparable to osu! just saying.)",
            "review_score": "-1"
        },
        {
            "review_text": "Um... well the gameplay is alright, however the game expects you to press over 10 keys in half a second; I mean what? When I played this game, the community was friendly however sometimes you would cross over some harmless discrimination. Moreover, whilst your trying to find a 'decent' lobby, ('decent' meaning a beginner newbie like me who doesnt have sonic fingers), its extremely hard to come across one, and you'll end up creating a room yourself, waiting like 15 mins to find an afk player chilling in your lobby, and then you'll be playing in your own game ALONE for like the rest of your day.   Okay. So clothing options. I remember these quite briefly, however they were quite interesting. In game, the currency which enabled to buy clothes are BEATS/DEN, and Cash. Beats/DEN are in game currency which you get through levelling up, opening gift boxes, and other general stuff with gameplay. I dont realaly remember the DEN currency, however it was quite tight on how most of the clothes in the store required cash, which you could only acquire with real money. These clothes were legitimate, whereas the in game currency ones were quite run down and basic.   I recommend this to people who really can master the keyboard keys - be a pro at this game and you'll get many fans. If you can't play, you'll find this gaming experience very boring.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played this game for years... sometimes coming back... and leaving again.. but now i've understood there's no point in coming back because it's boring, they aren't really doing anything to get more players and some just afk in rooms which are locked by passwords.",
            "review_score": "-1"
        },
        {
            "review_text": "Nexon, where are you? We need you!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "First, let me just say that I love this game so much. I've been playing audition since back in 2010. Its a game that allows you to interact with other people from all over the world. The music is amazing and yes, it will be kind of hard at first to get used to the arrows and the speed , but it is definitely worth it. You can just lock yourself in one of the rooms and practice, it gets easier like everything in life. This game is like my second life and I love meeting awesome new people everyday. This is indeed a very old game, but the fact that it still remains perhaps 'alive', says it all. People who stopped playing before, always end up coming back to audition xD However, one of the cons of this game is that the shop is a little bit expensive, but you can still buy your clothing with 'beats' , its just not going to be as cute as buying cash clothes. Overall, I highly recommend this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A different take on the traditional rhythm game genre, with having you have to input combinations of directions to the beat as opposed to single key strokes. I played this a lot back when nexon owned it, and haven't found another game that has quite the same type of mechanics. Definitely worth a shot if you enjoy rhythm games. It's free, after all.",
            "review_score": "1"
        },
        {
            "review_text": "How the titan has fallen. Level 45 veteran here. This game was gold at the start with Nexon. Once it switched to RedBana it became a cult. There was a lacking newer population joining the game and the existing one went to college, new games, better games, etc. I haven't even touched this or remembered it exists for a long time until I hear a song I use to play. It's honestly just a dying game since the new management isn't trying to revive the game. It offers a lot and still really fun if you like a challenge. Problem is you won't level up since it's hard to find people to play with now. Try it out, soon as anything annoys you(except the difficulty, that would mean you're a scrub) get out. It's not worth investing time on anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Need a region server",
            "review_score": "-1"
        },
        {
            "review_text": "Pay to look good and extremely dramatic. Honestly I see no other way around this review due to my 284+ hours.",
            "review_score": "-1"
        },
        {
            "review_text": "E-Mail for sing up never appeared... so I'm not able to play the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing this game for a long time, perhaps about 6-7 years. The community is great, MOST people are nice( about 95%) and people arent as lowkey. Most players get along well, as well as noob-friendly. Although the game my be difficult at the beginning, as you progress and put more time into the game, you'd improve. Making friends is also pretty easy, as Audition can serve as an alternate social media type game. I definitely enjoyed my time on Audition, and still play this day and on.     - Shouyou",
            "review_score": "1"
        },
        {
            "review_text": "So nostalgic. I used to play this game back when it was under Nexon but couldn't play after a while because eventually it wasn't available in my region (Australia). I'm really happy and excited that its on steam now and that i can play. Things have hardly changed and I like how new songs are still getting updated :) The community is super friendly too.",
            "review_score": "1"
        },
        {
            "review_text": "♥ Nice game",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing Audition Online for many years and I was very excited when they announced that the game had been publised on Steam! It's a game everybody should try playing. The community is the best aspect of the game, and it is likely the reason most players will stick around.  IGN : Confidant",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for a long time. After Alaplaya audition got removed i changed to this server. This game is very fun, you can meet new people and make friends. There are different modes u can play. Hope u will have the same feeling about this game as me. IGN: KM",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for almost 6 years. I started off playing on the EU sever but i decided to go to Audition Redbana, here i found some of my best friends that i still talk to today.  - Easy to learn, you'll be pro in no time :')  -This game can get very addicting and its really fun whenever your playing with friends. -Playing this game through skype with my friends you can hear then laugh and rage. -Your FAM members become your 'virtual' family   [Talk to me In Game, i dont bite : IGN; Incredible]",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun and friendly. I always go on everyday because I love Audition. I am mostly in lobby talking to people c: So I hope you guys can join in the fun too!!! If you are on, find me. As I said, I am mostly in lobby but you never know cx My IGN is Cookiies so feel free to stalk me heh.",
            "review_score": "1"
        },
        {
            "review_text": "I've been on the game for 2-3 years now.  Great game (considering its a rhythm game and tbh besides Touch, World In Audition this is all I would play in the same genre) The friends I have made in this game has kept me in game from time to time just to chat with them, but with today's social media it has made it easier to communicate. The game is a good time passer (1-2 hours)   IGN: Angle",
            "review_score": "1"
        },
        {
            "review_text": "This game is okay.  Can't wait to keep playing  Play with me IGN: Verso",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game. Been playing it for a while... met lots of people and I'm grateful for it.  IGN: Enuii",
            "review_score": "1"
        },
        {
            "review_text": "This is an updated and honest review.  I used to play this regularly from 2007-2010. Not so much anymore.  -Core gameplay is decent. Some modes are great, others are completely ignored. -Graphics are dated but I wouldn't expect great graphics from a mid-2000s game which has a sequel. -Half of the community is nice, other half is made of jerks. -Not friendly for beginners but once you learn, it's rewarding. -Song list needs work.  -Doesn't patch very often but it used to be worse. -Low amount of players. -Plenty of locked rooms. -It's expensive to improve the look of your character. -The time box alarm... please remove that.  As of now, it's a 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Good memories, Good Game, Good Dance,... But need more music :D  Good Experience",
            "review_score": "1"
        },
        {
            "review_text": "cool :3",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to be honest, every now and then I lose interest in Audition but when I get back into it I can't get off. 1123 hours of gameplay and I'm level 32. I can't get off of it.  P.S: Block Beat is the best mode I'm being honest play it omg it's amaze. ",
            "review_score": "1"
        },
        {
            "review_text": "Took me 10 minutes to sign up and create a character, then it crashed and now it crashes everytime on startup.  11/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "Old game",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually fun if you play it with friends. IGN: Shego",
            "review_score": "1"
        },
        {
            "review_text": "i met my waifu for laifu on this game so 10/10 would recommend  IGN: Astraeus  i love Amenthes!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Hit me up in-game! IGN: Timothy",
            "review_score": "1"
        },
        {
            "review_text": "Not a game i thought it would be. Seen this running around for years, and tried it out now. Horrible gameplay, traditional MMO matchmaking and a horrible framerate. Wanna play a real rhythm game? Go play Osu!",
            "review_score": "-1"
        },
        {
            "review_text": "This game has entertained me for many years, I have always been a loyal player of Audition. It has many good qualities and friendly players! It is a fun, social, interesting game. There is plenty for you to do from story, missions, and just earning in game money. I love the game and will stay loyal to it for many more years.   Plenty of things to do in the game. Tournaments. Couple dance. Garden. FAM. Marraige. Baby. Friends. Story. Missions.  Come Join~ It really is a wonderful game.  AUDITION INFO:  IGN: Gains  ",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game on and off for about 7 years now. The graphics aren't anything too great, but the community and many of the features make it highly addicting. It's be tough at first (like all games), but it's not too bad once you get used to the modes and faster song speeds. This game's really fun once you get the hang of it   IGN: Prinsex",
            "review_score": "1"
        },
        {
            "review_text": "Best game what i'm ever played. Highly recommended. Game of the year",
            "review_score": "-1"
        },
        {
            "review_text": "Audition Online is my date",
            "review_score": "1"
        },
        {
            "review_text": "Played since 2007. Very friendly community and a lot of great modes. Would highly recommend.  IGN : Blast",
            "review_score": "1"
        },
        {
            "review_text": "I spent years lg hunting on this game back in the day..... good times :')  IGN - Syen",
            "review_score": "1"
        },
        {
            "review_text": "This game is so gay I like men now just because I played this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Good luck on keeping up after round 4. 3fast5me",
            "review_score": "-1"
        },
        {
            "review_text": "I started playing this game about 5 to 6 years ago and I guess it is a good game since I haven't really stopped playing it until now. I played in the EU-Servers though, but I think that the Music in this version is way better! A good thing about this game is that there are so many different modes, so I think that anyone will find at least one mode he or she can enjoy, or maybe even more modes! You get to know quite a lot new ppl who become good friends. You also meet ppl from all around the world! I have to admit that the Community could sometimes be a little bit harsh, but you'll definitely find at least 5 good friends for the next years of your life.  I would recommend you to try it yourself! I myself enjoy this game very much. But I have to admit one last thing. If you are not that much into this type of gameplay, the game gets boring quite fast. Sometimes its actually just funny to go and play this game, only if you are with your friends, cause most of the time you chat with each other or try to learn different modes together!  IGN: xMeloTea",
            "review_score": "1"
        },
        {
            "review_text": "Was really looking forward to playing the game after all this time...  I can't recommend this game to anyone with a low-medium graphic setting  for games. There isn't a settings menu, so you won't be able to change anything.  The unique input system is different from that of DDR or OSU. So if you're  going in with the mindset it'll be similar, don't.   From what I was able to play though(the tutorial), it seemed alright. It just went  downhill once I tried to play with other people. It was LAG CITY.",
            "review_score": "-1"
        },
        {
            "review_text": "Came expecting DDR. Was disappointed. Still a good game tho.  Add me for butt stuff.  Ign: Daylon",
            "review_score": "1"
        },
        {
            "review_text": "Outdated graphics but I still enjoy the game as it is.  IGN: Aniya",
            "review_score": "1"
        },
        {
            "review_text": "Decent rhythm game with decent mechanics. Obviously not ddr or osu if that's what you're into.     IGN: Rayne",
            "review_score": "1"
        },
        {
            "review_text": "I've played this yeasrs ago but since then i moved to a different country (Japan) trying to make a new account again and wont let me",
            "review_score": "-1"
        },
        {
            "review_text": "slightly different with the sea server, i didnt get the beat",
            "review_score": "-1"
        },
        {
            "review_text": "server not found, wut di fuq? how can I register?  Girl chasing simulator 2007-2015 - 10/10 IGN  Can I have your number? - 5/5 Volvo",
            "review_score": "-1"
        },
        {
            "review_text": "Not a very fun game people on here are toxic and act like they are awesome cause they can press buttons on a computer game and also theres a ♥♥♥♥ named Mokee on here her account is",
            "review_score": "-1"
        },
        {
            "review_text": "easy to play",
            "review_score": "1"
        },
        {
            "review_text": "why did they ask for my pin... identity thief?",
            "review_score": "-1"
        },
        {
            "review_text": "Im addicted to audition i have been played it since nexon, i never get bored of this game, no matter if i quit i still came back, i gotta said this game is fun i love it :D  IGN Endless",
            "review_score": "1"
        },
        {
            "review_text": "Good game play. I have been playing with my dear friends and have fun with them a lot! Thumb up! Gg  IGN: Luffyy",
            "review_score": "1"
        },
        {
            "review_text": "Most first impressions of Audition seem to be that it's extremely difficult, but once you start to get the hang of it, it's actually quite enjoyable. It provides a variety of different modes, so if you're not good at one mode, maybe you're good at another!  IGN: Crepes",
            "review_score": "1"
        },
        {
            "review_text": "One of the most wonderful games I've ever played! I wish they had it at McDonalds so I could play it while eating chicken nuggets. Everyone should try this game out.   -IGN: Yam",
            "review_score": "1"
        },
        {
            "review_text": "My childhood game! Audition is very nostalgic, especially the OSTs. Ther aren't any special thing about the graphics but the game itself is superb! The community is nice, mostly friendly people. The game is a break from all other competitive genre. If you want enjoy listening to music, you'll surely enjoy more by playing with it. Kudos to the devs for making this wonderful game in Steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun and not that much like DDR.  IGN: Tarte",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much. I love the way the characters look, its just so cute ! And you get to know a lot of people.  Totally recommend this game.  IGN : Ophion~",
            "review_score": "1"
        },
        {
            "review_text": "Over the past year or so I've been playing Audition I've made tons of new friends. It has been a great sort of stress reliever and very welcoming. There are many different types of modes you can play; even if you're bad at one mode maybe you'll do better at the other, who knows? I'd say to give this game a shot, especially if you're into rhythm-type games !  IGN: Zei",
            "review_score": "1"
        },
        {
            "review_text": "i love this game and it's the longest game that I been playing in my life. IGN: Granita",
            "review_score": "1"
        },
        {
            "review_text": "Somehow I just always come back to audition. I've played this game on/off for years now ever since Nexon owned it. I think it's the great community that draws me back towards this game everytime. Over the years of playing I've made some really great friends through this game. It's probably because it's really easy to talk to people on here since, they're all just so nice and inviting. I would highly reccomend this game for it's social aspects. Also if you're someone who's not into the social aspects of the game then there are modes in Audition that are great and there are a lot of competitive people to play against so you'll never really get bored.     Ign : Stop",
            "review_score": "1"
        },
        {
            "review_text": "I've only started playing this game recently, and overall, the game is good. The people and the community are pretty friendly, and its hard not to make any friends. The clothes and faces, although not really updated very often, are nice and if Redbana started putting more in the mall, that would be even nicer. If you like music, which Audition has a ton of, and especially with a variety too, then you should give this game a try.   IGN: Curriculum",
            "review_score": "1"
        },
        {
            "review_text": "This game has excellent quality, players, songs, mode diversity, just about everything!  IGN : Jackal",
            "review_score": "1"
        },
        {
            "review_text": "i've made some of the best friends i've ever had on this game =) ign: Posh",
            "review_score": "1"
        },
        {
            "review_text": "I've been a member of the community for 4 years and though the game doesn't change much, the community does, and that's why I return.  They need more GMs for regulating, but overall the game isn't that high maintenance.  It's a decent stress-reliever and/or a way to pass the time.  Ign: Versus",
            "review_score": "1"
        },
        {
            "review_text": "This game has an excellent community, the staff are terrific, the game has endless possibilities. Who knows what lies ahead in the further updates, only time has to tell for the bright future of this game.  IGN : WatashiNoKoi",
            "review_score": "1"
        },
        {
            "review_text": "Take a break from Dota 2 and Counter Strike, this game will let you be laid back without all the toxic players and cursing throughout your gameplay.   Pros:  - friendly community, always there to help you  - GMs are quick to repond to your needs  - competitive  Cons:  - Easy to get hacked  - Many hackers at tournment now  IGN: Creampie",
            "review_score": "1"
        },
        {
            "review_text": "Alright, time for an actual review of this game as of 2015.  This game is pretty fun, once you get the hang of it. It has one of the sharpest learning curves that I've come across, and easily the most difficult multiplayer rhythm game out there to pick up and play.  The community is pretty small, and overall pretty nice.   As of now, songs are plentiful, but they're mostly underground/mainstream EDM and Korean music.  There is only one p2w aspect to the game and even then nobody uses it because it helps very little. It's also disabled in any competitive modes, which is great.   This game as one fatal flaw - it's a game from 2006 that hasn't aged well at all. No graphics options in-game (uses all settings from your drivers, and even then it only picks up drivers from nvidia cards because this game uses OpenGL). 1024x768 locked resolution. Windows 8.1 compatibility issues out of the box (issue with a certain KB update). Anti-cheat issues with certain programs. The list goes on and on. I can't see a typical new user with no experience with these types of games genuinely enjoying Audition when theres a lot of options that PC gamers expect to see with any game blatantly missing.  If you can deal with those flaws, give Audition a try. Otherwise, Audition's sequel should be coming over to the West in a year or so (World In Audition). It is a MUCH better game, albeit having some minor differences that regular Audition players come to expect. If World In Audition came to Steam, I would wholeheartedly recommend it.  IGN - Voltex",
            "review_score": "-1"
        },
        {
            "review_text": "Audition, Audition. A lot of reviewers are saying they have played for years and that really stands as testament to the community surrounding this game. The game itself is just barely passable. What makes it great are the people you will meet. It's definitely worth a look. IGN: Mithos",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, friendly community, many are willing to welcome the new comers :D  IGN : Jy",
            "review_score": "1"
        },
        {
            "review_text": "Been a long time fan. Glad to see Audition expanding. Definitely not the best game of its kind and could use a ton of improvement. Still a great game to come back to and play.  IGN: Templar",
            "review_score": "1"
        },
        {
            "review_text": "Never seen such rubbish game like this.... sign-up ,..and NEVER WORK!!!!!! GO ! ♥♥♥♥! YOU! SELF!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "It's a decent game I will give it that much but there are a few things that bother me.  1. There is no time to redo all the steps. There is only enough time for you to do it once. 2. You have to press SPACE BAR to enter they steps you did. Otherwise it doesn't take it.  3. To activate the bonus, you have to press DELETE on top of pressing the SPACE BAR and keys for the steps.   This game since your hands in odd locations on the keyboard.  Do I recommend this game? No. Do I think this game could improve itself? Yes, I do. If they fixed the keys for everything in this game, I can see more people jumping on it.",
            "review_score": "-1"
        },
        {
            "review_text": "In my honest opinion, I have been playing Audition since when Nexon owned it. Other than rockband, its the only rhythm game I play consistently because it is very challenging and extrememly sociable. Most rhythm games (from my experience) are single player or local co-op. As someone who doesn't have many rhythm gamer IRL friends, I really enjoy Audition Online because not only do I find it fun, but I can meet and become friends with a ton of great people playing Audition Online. Its a fairly small game / community and nearly everyone is very nice and sociable.   I frown at redbana for paying people to write good reviews because than the reviews don't give honest opinions and recommendations to new players seriously looking for a new game to play. This review will most likely get buried under all the other positive reviews, but if you are reading this and are thinking about playing audition, look me up in game 'Mokraton' and I'd love to play with you ^_^ &lt;3.  Gl hf. GG.",
            "review_score": "1"
        },
        {
            "review_text": "This game isnt something I would actually play because it wont even let you get pass the login page.",
            "review_score": "-1"
        },
        {
            "review_text": "1997 Graphic ... awful music, locked at 30fps, also only about hundreds ppl playing this game.",
            "review_score": "-1"
        },
        {
            "review_text": "pls make mac version so i can play too!",
            "review_score": "1"
        },
        {
            "review_text": "awful bgm somewhat anger me,low on songs  I've played better version of this game before,this one is a bad host for the game,play private server friends,this thing is just a pile of disapointment",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks it looks bad not to mention that it will take a bunch of ur money just to look good i do not recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I played for about half an hour, the game is very challenging, so I highly recommend you are used to these types of games.",
            "review_score": "1"
        },
        {
            "review_text": "i hope this game always update and always be good",
            "review_score": "1"
        },
        {
            "review_text": "This game need more anime soundtrack or Jpop and Kpop more",
            "review_score": "1"
        },
        {
            "review_text": "i like this game i want to play",
            "review_score": "1"
        },
        {
            "review_text": "I played this game non-stop when I was 12, and now I'm 19. I completely stopped playing this game probably about 6 years ago and just downloaded this game when I suddenly found it here on steam.  Audition is fun, but I don't think this game would be very appealing to newcommers solely because of the way outdated graphics. I logged in, made my character, did the tutorial, and when I finally played a real game against other players, they were also old players. None of them were new ones despite having a low level character. The playerbase is pretty low as it can't even fill up 2 channels compared to the 5-6 channels full back in the day.  Do I recommend this game? Not really, but I will rate this as yes because I don't think this game deserves a downvote. The game is not bad, it's just old. There's probably a more updated rythm game out there.",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks. I started the game but it told me I had to put in a pin after I sighned in but on my gmail I didn't have any emails to start the game.&gt;:(",
            "review_score": "-1"
        },
        {
            "review_text": "I've sold my double beats coupon for cash and it was never given to me. And i should have made over 10k cash already.!! pelase fix",
            "review_score": "1"
        },
        {
            "review_text": "Its gud",
            "review_score": "1"
        },
        {
            "review_text": "it's just horrible i will still play it thou but still its horrible ",
            "review_score": "-1"
        },
        {
            "review_text": "hud wouldnt show up i didnt know what to push also u cant do much without payin for things in game fix your stuff",
            "review_score": "-1"
        },
        {
            "review_text": "Im not sure if i Reccomend this or Not Reccomend",
            "review_score": "1"
        }
    ]
}