{
    "app_id": 349980,
    "name": "Gremlin Invasion: Survivor",
    "release_date": "2015-05-01",
    "developer": [
        "CS Squared Games",
        "Among Giants"
    ],
    "publisher": [
        "CS Squared Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 1,
    "negative_ratings": 1,
    "price": 3.99,
    "description": "Gremlin Invasion: Survivor is a co-op overhead action shooter. With 8 different levels to choose from and up to 8 players, you'll play together in a survival-style mission to blast away hordes of gremlins that have come to take you out.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/349980/header.jpg?t=1478709731",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: Intel 2.26 GHz Core 2 Duo or equivalent AMD processor Memory: 2 GB RAM Graphics: nVidia OpenGL 3.3 compatible / AMD HD7700 series (OpenGL 3.3 required) or higher DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX compatible Sound Card Additional Notes: Local CO-OP is supported out of the box. For online CO-OP, you need to enable port forwarding for port 28327, UDP service type, on your router. A fast internet connection is highly recommended.",
    "recommended_requirements": "OS: Windows 7 / 8 Processor: Intel i5 Quad Core 3.4 GHz or equivalent AMD processor Memory: 4 MB RAM Graphics: nVidia GeForce GTX 560 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Sound Card: DirectX compatible Sound Card Additional Notes: Local CO-OP is supported out of the box. For online CO-OP, you need to enable port forwarding for port 28327, UDP service type, on your router. A fast internet connection is highly recommended.",
    "reviews": []
}