{
    "app_id": 35000,
    "name": "Mini Ninjas",
    "release_date": "2009-09-14",
    "developer": [
        "IO Interactive"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Ninja"
    ],
    "achievements": 0,
    "positive_ratings": 1612,
    "negative_ratings": 270,
    "price": 7.99,
    "description": "Mini Ninjas is a game that combines furious action with stealth and exploration for an experience that appeals to a wide audience across age groups and preferences. It’s an action-adventure with a strong focus on allowing the player freedom to explore the world and has the depth to allow for very varied gameplay and approaches to getting...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/35000/header.jpg?t=1478904152",
    "minimum_requirements": "OS: Windows XP and Vista                     Processor: PIV/Athlon 3.2ghz or higher processor                     Memory: 512MB system RAM (1GB Vista)                     Graphics: ATI Radeon X1300 or higher / Nvidia Geforce 6600 or higher (shader model 3 required) graphics card                     Hard Drive: 5.85GB free space                     Sound: DirectX 9 compatible sound card",
    "recommended_requirements": "OS: Windows XP and Vista                     Processor: Intel/Athlon Dual Core Processor                     Memory: 1024MB system RAM (2GB Vista)                     Graphics: ATI Radeon X1300 or higher / Nvidia Geforce 6600 or higher with 512MB video RAM (shader model 3 required)                     Hard Drive: 5.85GB free space                     Sound: DirectX 9 compatible sound card",
    "reviews": [
        {
            "review_text": "Ridiculously cute and funny, this is a game that is screaming for proper achievements. The characters are fun to play with. The level designs are sometimes a little heavy on the wide open spaces which can be a pain if you're hunting for, say, an elusive plant. The bosses are... very silly. If you fell for the trailers you will probably get a lot of fun out of being a ninja... or a chicken.... or a frog...",
            "review_score": "1"
        },
        {
            "review_text": "Steam is home to a lot of crap, and I do mean a lot.. But it also is home to a number of hidden gems that no one really talks about much.  Mini Ninjas is one of those gems. A bit of an imperfect one, sure, but a gem nontheless. And like many hidden gems, it doesn't get a whole lot of attention.   The game is kinda an action adventure game, with small elements of RPG and stealth. You play the role of a ninja named Hiro, who is tasked with finding all his lost friends and saving the world while he is at it. A lot of pressure, I know, but then you are a ninja with the power to control the elements, so it shouldn't be too hard (Which kinda is a problem for the game, I'll explain later)  Being that you play the role of a ninja, stealth is a tool you'll be making a lot of use out of. As some might indicate, however, the stealth aspect of the game isn't really all that advanced, and oftentimes isn't used to avoid fights so much as it is to get the first strike in any given fight (or outright kill everyone in a patrol before they even have time to react). While it is possible to avoid fights, you won't want to in the early game, because you need to fight to gain XP and level up. Otherwise, the road ahead will be awfully harsh to those who don't kick enough butt. While quietly avoiding fights isn't encouraged (At least in the early game), the stealth system does indeed work very well, and in the late game, where by then you are already maxed out, it becomes much more viable.  When the time comes to fight, however, it is a mixed bag. Combat is simple, with a few basic attacks, a block breaker, and even a super move that can cause all sorts of pain for those unlucky to be the target of it. You also have a selection of items that can make fights go more smoothly, such as pepper bombs and potions that make arrows bounce off your face. However, the problem is that it IS simple, even to the point of simply mashing the two buttons until everyone is dead before moving on to the next fight. I myself don't mind it, but those seeking a deeper combat system might not enjoy the game as much.  Sure, as you progress through the game you'll unlock more ninjas to fight with, each having their own style (Such as the fat ninja's brute force hammer skills that can make fighting larger enemies blindingly easy, or the archer ninja's ranged combat skills). However, I never really did bother to use any of them besides the ninja you start with. In DK 64, the devs made it so that you had to use all the Kongs in order to beat the game, so you couldn't just march through the whole game with Donkey Kong the whole time. Not so much here, where you can get through the entire game without changing ninjas ONCE. Maybe on hard mode, you would have to swap out ninjas more often, but on normal mode it is rather pointless for the most part, and in some cases even more fun, since fighting larger enemies feels more satisfying when you have to put up a real fight to take them down, rather than swapping over to fat ninja and just wailing on them, stun locking them to death. And even moreso, the starter ninja is the only one who can use magic, and as you progress through the game, you'll learn how important magic is.  So, the combat is ok at best, the whole 6 ninja team gimmic is iffy when you can go through the whole game with the main star of the game just fine (and possibly makes the adventure so much more interesting and challenging), and stealth early on, while it does play a considerable role in the game, is mostly used for ambushing more than avoiding conflict altogether. And yet... I love this game.  Maybe it is because it reminds me of the glory days, back when we had games like Banjo &amp; Kazooie 1 &amp; 2, Conker's Bad Fur Day, Jak and Daxter... You know those kind of games? The ones where you feel like you are on a real adventure throughout an interesting, if sometimes even strange, world waiting to be explored. You start out in your humble village, venturing out chapter after chapter on your way to the big bad guy himself, taking out his generals and anyone else who dares to get in your way, while at the same time taking a moment to explore the area for goodies and new spells to unlock. It helps that the world and the music that fills it is quite appealing, making the journey all the more enjoyable. That, and it is around 9-10 hours on my first playthrough, so you get your money's worth for sure. Gotta love a game that keeps you busy for a nice long while.  As much as I'd like to yammer on and on, I'd like to wrap it up as a game that, while the gem is a bit cloudy, it is a gem nontheless, and a shame that it isn't more popular, let alone given a respected sequel (instead getting spinoffs on the Kinect and a Ipad runner.. Yeah, kinda a sad fate for the ninjas if you ask me).",
            "review_score": "1"
        },
        {
            "review_text": "Cute is what defines this title most. The graphics are cartoony and simple, the heroes are very cute and so are most enemies. There is no gore in this game, no dark twists, controls are simple and there is no character management. This makes this game very suitable for kids but also less appealing for someone seeking more depth. There is a lot of running around which I found a bit frustrating since the characters move slow. Fighting is mostly fun and diversified by the different ninjas but at times the camera and control can be a bit messy. I played with xbox360 controller and it worked great, no other technical issues noted.  A nice light action adventure. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is perfect. , -It has very funny dialogs.  -Great story.  -Cute enemies and animals are everywhere.  -Combat system is pretty good. -You can control different characters and each has own skills and weapons.  -Atmosphere is amazing.  There is only one problem. The game is very easy even in hard mode. There isnt many challenging bosses. You dont need to use other characters(hiro and and kuro is more than enough) and items(such as bombs and shuriken). Beside that everything is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "A great, cheerful, uplifting story from a time when games weren't to be taken too seriously. A kids' game, but a great game nonetheless. Recommended if you enjoy older 3D action platformers, back when they were a thing.",
            "review_score": "1"
        },
        {
            "review_text": "I only started playing this today and I love it!   1. It's a cartoon but it is actually really pleasant to look at.   2. You can play as multiple characters (as you rescue them from the evil samurai guys...who are transformed forest animals.)   3. You can possess small woodland creatures (and some large..but mostly small.)   4. The world is really nice. I think I spent half an hour just looking around.   5.There are lots of things to collect, which is great for people like me who obsess over collecting everything possible.   6. The storyline is nice, so far.   Con: The ninjas walk way too slowly. They can sprint, but you use up stamina.      BONUS: It is currently on sale at  humblebundle.com  (where I got it.) So, paying as little as $1.00 can get you this game plus 4-5 others. ($1 minimum to get Steam Keys.)",
            "review_score": "1"
        },
        {
            "review_text": "Really simple, nice atmosphere not s/thing serious",
            "review_score": "1"
        },
        {
            "review_text": "I love it but so much but some times it is way way way way way way to hard",
            "review_score": "1"
        },
        {
            "review_text": "Ths game is very good! Many opportunities and missions. Very cute characters. Good story.",
            "review_score": "1"
        },
        {
            "review_text": "Very good, yes yes",
            "review_score": "1"
        },
        {
            "review_text": "It has light platforming, combat is real time and fluid, you get special moves, you can sneak up on enemies, you get skills when you level up, and there is a crafting system. You get 6 characters you can switch out (once you find them)  the one small negative point is there is a bit of a learning curve on the conrols, but thats what the tutorial is for. You can also remap buttons.  all in all a bit of everything. The cartoonish graphis put me off for a bit though.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this thing ages ago, fun stuff.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it's so cute and well designed game!",
            "review_score": "1"
        },
        {
            "review_text": "A really nice game.",
            "review_score": "1"
        },
        {
            "review_text": "nice and good game",
            "review_score": "1"
        },
        {
            "review_text": "In this game you can approach a situation in any way you want. Charge in with various ninja weapons, or hang back and pick off samurai one at a time. Hide in tall grass, or climb across the rooftops. Running low on health? Gather some herbs to make a healing potion, or jump in your straw hat boat and fish for some sushi. The game has a linear story, but each area of the game is rather open and free to explore. I completed the story is around 7 or 8 hours, but the game does have some replayablitiy if you want to try different strategies throughout the game, or if you want to collect all the hidden stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Kids friendly games , great universe .  But the game is unplayable with MAJOR frame drops on a gtx 970  ;/",
            "review_score": "-1"
        },
        {
            "review_text": "Game is unplayable, locks up and freezes a lot. Can't find any fix that works online.",
            "review_score": "-1"
        },
        {
            "review_text": "Cutesy game that is surprisingly system intensive. I feel like I'd enjoy it a lot more 14 years ago. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "- Too easy for me - Boring  - Some mechanics and boss are copy pasted from Prince Of Persia. - This game tries to be platformer but it can't because of poor level design. - don't be fooled by the beautiful box art  It's for 5 years old childs If you want this game for your child , it's ok  Also has some technical issues including: sound problem To solve this problem ,you must install OpenAl manually (Why they didn't include this software in first time setup? probably they forgot!) :|",
            "review_score": "-1"
        },
        {
            "review_text": "Well as long as you don't mind messing around for 45 mins on the first boss trying to get the prompts that seem to be glitchy then yeah not a bad game 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "The game has known bugs with numerous systems where some people have found disabling every HID device in your Device Manager as a Workaround (10+ on my rig) . The bugs have existed for years and apparenlty the developers are not doing anything to fix. I've spotted users with GeForce 970 FTW w/ i7 gaming rigs having the same issues. Sadly, they have a main.ini file with a 'UseGameController' option but even if you remark that the game stutters like no other. I really wish STEAM could make the publisher/developers pull their weight and fix the bugs so I could play this with my son. I was kind of excited to find a game that he might enjoy. Eidos definitly is on my list of 'don't waste your money' until they fix this.  AMD Phenom 9950BE / EVGA GeForce GTX 670 FTW 4GB",
            "review_score": "-1"
        },
        {
            "review_text": "This game should be pulled for misadvertising, because if you think a game solely about Ninja would contain stealth, then you'd be wrong. Sure, there are stealth mechanics, sure, some areas give you paths to sneak past enemies, but if you want to rescue animals and gain XP, the only way you'll do that is by charging in and killing everything you see. You in fact lose out if you stealth.  This game is about as barebones as it gets. Despite being a linier game split into levels, the end of each level tell you how many collectables you managed to snag on your way there. This includes: freed animals, flowers, Jinzo statues, spell scrolls, and money. 'Great', you might think, 'Lots of replayability!' Well, you'd be wrong. Freeing animals gives you XP, collecting plants gives you ingredients with which to craft potions (which I have yet to need), scrolls give you new spells, and the statues? Well, they're purely collectables - all of which, as far as I can tell, have absolutely no reward for collecting them all. There are no achevements, either on Steam or in-game, and aside from your base stats which are improved automatically when you level-up, there isn't anything they could offer in the way of a reward anyway. And yes, you read that correctly: money is a commodity. It's that useless.  Mini Ninjas is an empty, soulless (albeit cute) journey down a long woodland-themed corridoor, with no real incentive to stray off the beaten path besides completionism. Fighting is just mashing 'attack', with special attacks or spells that one-hit-kill. The only reason you'd need to switch characters is to kill the heavy enemy (which is only easily killed by your heavy ninja) or cast spells, which only the default character can. The English voice-acting also seems to be have been assigned exclusively to one guy.  So what's good? Well, the art-style is lovely. The mixture of ambient Japanese dialogue and English cutscene dialogue is nice. You can control animals, which is oddly rare in games... And that's about it.  CONCLUSION: It pains me to say this about anything in the Ninja genre, but I recommend giving this title a miss, unless you're buying it for a child - the cartoon violence, quirky designs and easy controls make this a good entry-level romp through ancient Japanese culture.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems okay but it won't recognize my Logitech F710 so I'm not recommending it.",
            "review_score": "-1"
        },
        {
            "review_text": "It took me 14 hours to complete the game, and I really enjoyed each and every second of it. Stealth, Humour, Jutsus, all of them combined nicelly along the gameplay, I really loved it.",
            "review_score": "1"
        },
        {
            "review_text": "awsome ",
            "review_score": "1"
        },
        {
            "review_text": "Mini Ninjas is my absolute favorite game ever! It has beautiul graphics and an incredible soundtrack which blends perfectly with the gameplay. Hack and slash games are pretty fun when they're made right and Mini ninjas was made better than right! The gameplay is simple and easy to use but effective and fun. The combat has a satisfying feel to it except the slightly repetative boss battles. This is a kids game so the stroy is quite simple in a 'good vs evil' sorta way. I give mini ninjas a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "No reason not to play this game. Love the extensive open world and its ongoing theme (accurate Japanese ftw!), and the vast range of attacks (including MAGIC! :O), the ability to unlock and switch playable characters, even the range of enemies. Difficulty can be toggled for those who think it seems too easy, I've been playing on Normal and it offers just the right amount of challenge, though once you fully level up the advantages on your side (particularly to keep your health full) can make it easy. I'd love if it had more voice acting/less captioning b/c the voices that are included are so great and even hilarious. But, seriously, you can possess cute little animals to sneak up on enemy samurai and beat the **** out of them, so, no contest. 10/10 Get it while it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Some weird camera angles. Supports controller",
            "review_score": "1"
        },
        {
            "review_text": "It's a really cute third person ninja game. It has an interesting story, cute graphics, and good mechanics. Give it a chance for sure!!",
            "review_score": "1"
        },
        {
            "review_text": "Cute, funny and a hell of a good time",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't have any volume except in the first two cinematics, but overall, it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. The story isn't amazing but the mechanics and art style are interesting enough to stand on their own. Usage of legit Japanese phrases here and there is a plus. It's like that game you play on a day you just want to loaf around even though it's perfectly nice and sunny outside.",
            "review_score": "1"
        },
        {
            "review_text": "5 stars uncle shaggun award winner! This game is a must have, fun gameplay, a lot of characters, different powers and skills, loveable art, a game for all ages!!",
            "review_score": "1"
        },
        {
            "review_text": "My niece really loves this game! She can control (transform into) a chicken, fox, bear, etc! The story is also great! Did not expect it to be so good, got it in a bundle.   Great for kids.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Extra fun, full of adventure, and action. Would recommend to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, casual, 3d Action game. Clean controls, colorful graphics.   If that is what you are looking for, then I'd recommend Mini Ninjas.  ",
            "review_score": "1"
        },
        {
            "review_text": "I like The Game But There is no sound when im in combat and cut scenes acept the begining and extras!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game but it seems to crash an awful lot. As soon as I get in my jam, the game stops working.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely relaxing adventure game about ninjas. The gameplay is simple and very easy to pick up, and the environment is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Cute game but even tho the little dude is cute he is still badazz- he is a 'NinJa!!' :D",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I've ever played. So fun, even for adults. Exciting, but at the same time, relaxing...a great escape from the daily grind. I'm in my 40s, and I'm a child of the 80s. The ninja were to the 80s, what zombies are to the current generation. Awesome movies like 'Enter the Ninja,' 'American Ninja,' and 'Revenge of the Ninja;' the 80s were ripe with movies and stories about Japan's elusive 'Shadow Warriors.' This game, though somewhat whimisical, captures this genre with brilliance. I've played a lot of games, but few give me as much sheer enjoyment as this game. Buy it, play it, and have a blast!",
            "review_score": "1"
        },
        {
            "review_text": "The one and only realistic ninja gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a really nice art style, and quite fun combat. Its storyline is quite uninteresting, but the gameplay more than makes up for it. Definitely worth playing, and I've seen it on sale for less than $10 on multiple occasions.",
            "review_score": "1"
        }
    ]
}