{
    "app_id": 350020,
    "name": "The Gate",
    "release_date": "2015-04-27",
    "developer": [
        "Spicy Horse Games"
    ],
    "publisher": [
        "Spicy Horse Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "RPG"
    ],
    "achievements": 54,
    "positive_ratings": 135,
    "negative_ratings": 80,
    "price": 0.0,
    "description": "The Gate is a 3D Card Collecting Game with elements of RTS and RPG. Originally available on mobile and via the web, The Gate was brought to Steam with the help of Steam users via Project Greenlight. Now heading into its 2nd year online, The Gate features PvP tournaments, where you can put your Card Collection into battle against other...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/350020/header.jpg?t=1447369051",
    "minimum_requirements": "OS: Windows XP or newer Memory: 1 GB RAM Network: Broadband Internet connection Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Boring. Also didnt play long enough to be sure but it feels like the browser games that start with no challenge at all and let you quickly progress to get you hooked only to hit a wall that only your wallet can break.  Edit: To the developer going out of their way to educate people with negative reviews that have less playtime then they deem necessary i can only say: If it tastes like garbage i stop eating. I may be missing out on a gourmet meal here, but i rather take my chances winning the lottery instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Please for the love of the almighty Gaben do not download this game. It is boring and not worth a minute of your time.",
            "review_score": "-1"
        },
        {
            "review_text": "tryed to play the game but i been waiting on the verifying credentails for two days still havent played the game dont even bother with this.",
            "review_score": "-1"
        },
        {
            "review_text": "  this is one of the games I use to play for the enjoyment of playing and experiences but when a corporate employee all of a sudden disbands from the team the whole thing came crashing down this is what happens when you let things go down due to a single aspect of a team this team needed help but could not accept help in the short run that's what cost this game to die off I wish this game would come back but as things are sometimes we don't always get what we want. ande until the end  I am suggesting those that have experience this game to stay with it and hopefully some day we will make our own version of the game and plow through the barriers of what went wrong here in other words aka learning from our mistakes and getting on with our lives. tis a pitty to see a great game fall though. and as a memory this game I recommend to all gamers to learn this lesson that some people just take things a bit too harsh when a team member leaves us for good.",
            "review_score": "1"
        },
        {
            "review_text": "The Energy System killed this game. Play for 10 min and wait for 4 hours after that,.. or pay $ for another 10 min. This is not even Pay to Win garbage, this is a drug dealer schema: first shot for free, but next one will cost you a fortune.  Developer of this game didn't invent this schema, we all know where it came from: something that people call 'Free to Play Mobile Games'. I personally hate this approach. It pushes our weak points and doesn't let us enjoy the game.  Suggestion to the Developer: please add 'Unlimited Hope for a month/week' for $X dollars in your game shop ('Hope' is their energy name) and at least we will be able to play it when we can, but not when the game allows us. ",
            "review_score": "-1"
        },
        {
            "review_text": "use this code and u will reward 600 crytals and 1 ultra rare card A3CDJJ2M",
            "review_score": "1"
        },
        {
            "review_text": "Good Game! My Redeem Code - C3C6IMAF (all caps!)",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad.  you should try it out",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit, I have played some games that use person/monster card related things. But I haven't exactly played a game where you literally and directly can change the outcome of a battle by direct control. I am aware there are a couple games that do allow that, but I have only seem them on a phone, and that it isn't as in direct control as this is. Would very much like this game to keep going and I know for a fact that the moment I have at least 10$ added in, gonna spend it on this ^_^, partially for the benifiets of the royalty system, and also to actually want to support them.",
            "review_score": "1"
        },
        {
            "review_text": "Gonna downgrade this one until someone decides to change the store page description",
            "review_score": "1"
        }
    ]
}