{
    "app_id": 350110,
    "name": "TransOcean 2: Rivals",
    "release_date": "2016-05-10",
    "developer": [
        "Deck13 Hamburg"
    ],
    "publisher": [
        "astragon Entertainment "
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Economy",
        "Strategy"
    ],
    "achievements": 25,
    "positive_ratings": 200,
    "negative_ratings": 230,
    "price": 22.49,
    "description": "In TransOcean 2: Rivals you face a new challenge as the boss of your own shipping line in both single-player and - for the first time - multiplayer mode: The international competition has gotten a lot tougher and the battle for the most lucrative contracts has only just begun.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/350110/header.jpg?t=1540301416",
    "minimum_requirements": "OS: Windows 7 or newer (64 Bit) Processor: Intel Core i3-2120, 3,3 GHz or higher Memory: 4 GB RAM Graphics: Geforce GTX 260, Radeon HD 4850 (1 GB VRAM) or comparable DirectX: Version 10 Storage: 8 GB available space",
    "recommended_requirements": "OS: Windows 7 or newer (64 Bit) Processor: Intel Core i5-3570K, 3.4 GHz or higher Memory: 8 GB RAM Graphics: Geforce GTX 760 or comparable DirectX: Version 10 Storage: 8 GB available space",
    "reviews": [
        {
            "review_text": "I preorder this game, offering my trust in this developer and I'm disappointed.  I loved the first game, a management game that was very relaxing and quiet, and very entertaining. Here I found my haven of peace among so many explosives games.  I expected this game more than any AAA this year.  Now with this second part I find a competitive and exhausting game.  The disappearance of the pause, the limitation of time in multiplayer, the short campaign and removal of dockage, have ruined my experience.  It is true that I did not play too much, because I'm thinking of applying for the return if developers do not listen to its fanbase and announce changes.  I do not understand why these decisions against his own followers.   Astragon I'm sorry, but I must give my negative vote.",
            "review_score": "-1"
        },
        {
            "review_text": "I Don't recommend this Sh*t Atm, If the devs announce changes in Singleplayer/Mp (Pause when docking, Pause in Docks, choose between Dock or Auto dock. If you want a better Game buy To1; Way better than this Sh*t. Im disappointed, Very disappointed, Thougt this was goin to be a gr8 Sequel from To1.  Fix your Sh*t Devs!",
            "review_score": "-1"
        },
        {
            "review_text": "With the addition of the pause system from TO 1, this game is enjoyable now. I'm still looking for some tweaks to the tug boat system",
            "review_score": "1"
        },
        {
            "review_text": "At the moment, this game is horrendous You are rushed off your feet, unable to take a breath as ships continue to slide into port Deck 13 and Astragon said this game was built to provide everything players wanted in the original At this time, the original (Transocean 1) is better  Pros: Different ships for carrying different cargoes (Containers / Bulk / Tankers) Rival AI's More ports  Cons: No pause (BIG PROBLEM) Contracts are offered that expire before you can get there, even at full speed Different types of port is confusing  If they can address the problem of pausing, this game might be good, but at this time, it is a mess",
            "review_score": "-1"
        },
        {
            "review_text": "this game is pretty cool. but need new updates. Anyway i like this kind of strategy games...",
            "review_score": "1"
        },
        {
            "review_text": "I'm one of the TO1 fans who enjoyed and still enjoy playing it, so i was really looking forward of playing the sequel (TO2). I pre-ordered a week before release, but in the beginning i couldn't make myself to play without a working &amp; bug free pause function. It was frustrating for me to play without a pause.  So, now after the devs brought the pause function back, i'm enjoying playing the game now as i did with the TO1.  There's still bugs, but the devs are (hopefully) very busy fixing them. There should be another patch coming out soon. I also hope they continue  improving  the game.",
            "review_score": "1"
        },
        {
            "review_text": "I waited before a few updates had been released before I started playing this properly, and it is quite enjoyable. Very different to the first Transocean game and clearly designed with multiplayer in mind. Running through the challenges playing through them opens up more new game features, so it gets more complex slowly. I almost gave up on the first challenge as it seemed too simple and boring, but as you go through them things get more complex so give it time. The most ships I have owned is 8 and its quite a lot of micromanaging with even just 8 large ships. It's not perfect, but it is playable and enjoyable and despite poor reviews (most created before updates were made) the Devs have continued to push out updates for it.",
            "review_score": "1"
        },
        {
            "review_text": "This review is not on the game as I have not been able to get it to work yet, other people are having the same issues as I am so it\\'s not an isolated problem.   My game does not work it get stuck on the loading screen and will not come off it, I have had the game 4 weeks now and so far all the Devs want to do is tell me it\\'s my drivers which it is not as all drivers are up to date. Then they tell me they are trying to fix the problem in snotty emails. If nothing is heard back off them in the next week I will post there emails here to show what sort of people you will be dealing with.  So far they are very poor as a company and do not seem to care that people have issues by telling them its there drivers. Untill this and the many other bugs that have been reported are fixed I would keep your money in your pocket as at the moment I feel some of you, like I did will be wasting your money.",
            "review_score": "-1"
        },
        {
            "review_text": "-Update: After the latest patch I have changed my review. Check ***Update*** markers for changes.  Problems: -I understand no pause in multi-play, but why in single play? I always feel rushed and can never take time to plan things. What is the point to all the ship stats, you don't have time to read them, your ships are arriving in port now. What is the point to the ships finiancial stats, you don't have time to read it, your ships are arriving in port now. What is the point to the contract list, you don't have time to read it your ships are arriving in port now. = Not fun.  ***Update***: This has now been fixed with a patch. :)  -There is a feature that lets you plan a ships route 4 stops in advance, but it costs an insane amount of money so don't use it if you are not a tanker.  -Bulk ships are not a viable starting ship.  ***Update***: Now that you can take your time to plan, the starter bulk ship can work. The trick is to upgrade the ship right away or it will never make money. (Still a tough one to start with.)  The orignal game with bulk ships and tankers would have been much better than this. A little tweak to company contracts, a tweak to to the jobs list, a tweak to how you can drive into port, and poof a great improvement.  Bottom Line: I liked the original game much better. Don't be in a hurry to buy this unless they patch it.  I am not asking for a refund, I am hoping they patch it.  ***Update***: They patched it. Simply adding the auto pause makes all the difference in the world and it is possible to get into this game. I have chnage my review to recomend. :)",
            "review_score": "1"
        },
        {
            "review_text": "Ditto! All of the above. What a disaster!",
            "review_score": "-1"
        },
        {
            "review_text": "This game keeps crashing. I have hundreds of games and no others have this problem except for TransOcean 1 &amp; 2. The gameplay seems better than TransOcean 1 so its really dissapointing that it's so unstable.",
            "review_score": "-1"
        },
        {
            "review_text": "I played a lot the previous version of the game and spent counless hours in ports of call when i was young  (this was on amiga console. Basically the same game but a lot less shiny.)  Some of the reason i dont really like this game is likely because im tired of the game.  To me, preferring to play single player the game doesn`t really seem to bring too much new in the sense of gameplay.  I do like the way information is presented in the game but the mechanics in general to me feels annoying more than anything else and I`d rather get my money back to play something else then trying harder to enjoy it.  That being said its not a bad game, I just think the previous game was better. At least from a single player view.",
            "review_score": "-1"
        },
        {
            "review_text": "After being told I can double tap space for pause, this game got a million times more enjoyable!  Enjoying every second of it now!",
            "review_score": "1"
        },
        {
            "review_text": "I was a big fan of Transocean I, and had been looking forward to Transocean II for a long while.  The developers have invested their time and effort in making this a multi-player game. Unfortunately for myself and for a lot of die hard TO1 fans, this is not something I was waiting for. In the meanwhile the multi-player room seems dead.   My preference was for a proper business simulation game, which I prefer to play in endless sandbox mode, and this is where TO2 is lagging behind compared to TO1. Over and over we have asked for more economic realism and complexity, but child of 10 would be able to start TO2 and turn 20 million in 1 billion in less than a year.   The developers have been made aware of this point and of many, many other frustrations (e.g. still no full / unlimited automation). We are now 6 months after the release and have only seen patches to fix things that were clearly broken, but nothing that properly addresses the issues at hand.  Initially I had given the developers the benefit of the doubt, but the lack of communication / roadmap is simply not acceptable anymore. Don't ask for feedback if you are not willing to engage in the dialogue!  The game has the potential to be fun, but it's time for more patches, and for proactive communication about them.  Bernard",
            "review_score": "-1"
        }
    ]
}