{
    "app_id": 350490,
    "name": "Love And Order",
    "release_date": "2015-04-10",
    "developer": [
        "Winter Wolves"
    ],
    "publisher": [
        "Winter Wolves"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Anime"
    ],
    "achievements": 6,
    "positive_ratings": 11,
    "negative_ratings": 22,
    "price": 0.0,
    "description": "In the smallest district of Montreal, the Crown Attorney relies on the legal expertise of its lawyers; backed up by the support of a single hard-working secretary. Love And Order is a dating sim with 4 love interests.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/350490/header.jpg?t=1551712125",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Memory: 512 MB RAM Graphics: DirectX or OpenGL compatible card Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Summary of the story: In Love And Order, you play as Dana Larose whoses starting her career as a secretary at the Crown Attorney's office. In the game you basically just run errands and whatnot for the lawyers (and potential love interests) there. The better job you do, the more money you get in your paycheck, and if you neglect your tasks for too long you could get fired. Pretty straight forward.   I really liked the game. Compared to other games made by Winter Wolves however, it's definitely not one of their best. The story is really interesting, the artwork is great, the gameplay is decent, the little extras you get after you finish a route are pretty cool. But they definitely could have done better. It took such little effort to complete it, and you could literally go on one date with them then the ending would be you getting married?? It just wasn't put together very well... The game took me about 3-4 hours to complete, and that was REALLY milking it. Most of the games I get from them take me around 20+ hours to complete it. It kills me that it could've been a really amazing game, if they but just a little more effort into it...  Overall, I'd give it a 6/10 maybe... It's a fun play, and a GREAT story, but it's just not as good as it could have been.  Hope this helps! ~Lailachu",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is too much like actual work without enough incentive to keep going. Carefully managing your time in the game earns you $10 a week - which runs out very quickly if you need to pay for transport or food. 2 hours of play got me a few quick dates before money started running dangerously low.  Great theme and quest text but a missed opportunity as far as visual novels go.  I highly recommend Dandelion instead.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all I'm glad to say I got this while it was on sale, buying it for the full price just wouldn't be value for money. I was quite excited to get started with Love and Order but the 3 hours I spent playing it left me feeling very disappointed, even finishing all the routes doesn't give you any satisfaction. All routes are essentially the same, badly written, fast paced and not very interesting or realistic...I hate to spoil it for anyone else who was excited to play this but all endings are basically the same, once you've played one you might as well not bother with the rest of them, In addition to this the ending felt very rushed as if they ran out of things to say or show. I don't think I could honestly recommend this to anyone, which makes me very sad to say.",
            "review_score": "-1"
        }
    ]
}