{
    "app_id": 350810,
    "name": "Pixel Puzzles 2: Anime",
    "release_date": "2015-03-27",
    "developer": [
        "DL Softworks"
    ],
    "publisher": [
        "DL Softworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Anime",
        "Casual",
        "Indie"
    ],
    "achievements": 27,
    "positive_ratings": 601,
    "negative_ratings": 194,
    "price": 6.99,
    "description": "Pixel Puzzles 2: Anime is a traditional style jigsaw puzzle game, in a kawaii style.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/350810/header.jpg?t=1544285514",
    "minimum_requirements": "OS: Windows 10, 8.1, 8, 7, Vista, XP Processor: Intel® Core 2 Duo Memory: 2 GB RAM Graphics: DirectX 9.0 Compatible Storage: 250 MB available space Sound Card: Generic Sound Device",
    "recommended_requirements": "OS: Windows 10, 8.1, 8, 7, Vista, XP Processor: Intel® Quad Core Memory: 4 GB RAM Graphics: DirectX 9.0 Compatible Storage: 250 MB available space Sound Card: Generic Sound Device",
    "reviews": [
        {
            "review_text": "What is Pixel Puzzles 2: Anime?  Pixel Puzzles 2: Anime is a strong contestant for the 'doesn't know the difference between anime and manga' award. Other than that, it is a puzzle game. You are presented with 25 puzzles that range from 60 to 350 pieces each, with only one having 350 pieces. There is one assistant flying around giving you bubbles you can use for optional help.  The graphics are fitting for a puzzle game, but the puzzle pictures sometimes, as you will know from the puzzles by a big German company 'Ravensburger', if you ever laid them, make it difficult to see where you would want to fit tiles. This however is remedied by the gameplay (see below).  The music is not disturbing and fitting for the theme, but the spoken words are annoying. In fact I shut the sound off completely after a while and heard podcasts while playing this, as I prefer to do with relaxing games. Your (fairy?) helper always tells things that are funny the first time but get annoying later. For example while she gives you energy bubbles (see below) she says 'This is because I love you' and such nonsense. I'm not certain if this is aimed at cliché nerds with anime bedsheets or a parody of their hikikomori lifestyle, in either case it is an annoyance to me the third or fourth time, losing its fun to become a Navi-esque bother.  The gameplay is where a puzzle game rises or falls. There are several aspects to be considered by a developer, and I think in this case they are well covered. At first there is progression: The levels can be progressed through on a grid. Progress within levels is - surprisingly, I must say after playing the previous game - saved even after exiting a puzzle. Great plus! I did not test if you can have multiple puzzles saved at the same time, but I assume so since I started others up in-between, although not laying any pieces there, and the developer says on the forum that every piece laid is saved. The second aspect is on the puzzle itself, the motifs. These are okay but repetitive. You usually see some kawaii guy or girl, rarely a couple, in front of some background. The third aspect is how you grab pieces. This is well executed in the entire series. Around the puzzle there is a basin filled with water (see the store page screenshots). You can take any piece at any time. If you want to save it for later, just lay it somewhere on the board. A propos 'laying on the board' - if you lay a piece correctly rotated close to where it should be, it snaps in automatically and can't be accidentally removed. This is the same in the entire series, but worth mentioning. The fourth and final consideration is what to do if you get stuck. There are some optional hints which you can use. I never used any of them, so I can't say how they work, but from what I gathered you can see the board motif (which could be done outside the game in a gallery as well, but here you see it directly on the board) or show where a piece you hold belongs to. There are several other buttons but I didn't press any, as I said. Probably you can also change the background color of the cardboard you lay the puzzle on.  The controls are easy: You only need a mouse, and once the space key to enter the main menu. This is actually annoying, as each time you want to play, all puzzles except one are accessed on the second screen only for which you need an additional click and spacebar press.  So what is the length of the game? Assuming you take your time without resorting to any of the help features, you can realistically expect 15-25 hours of gameplay, depending on how good a puzzler you are. If you use the ingame help, this might be shorter, I can't say it since I did not test it.  Would I recommend this game? Only to puzzle fans or such looking for a relaxing gameplay. If you need fast action, you're wrong here. If you want puzzles, you can grab this. While this is far from perfect, it is a game puzzle fans will enjoy - even if most likely with at least the speech turned off.",
            "review_score": "1"
        },
        {
            "review_text": "great game for those loving jigsaw puzzles . Also easy enough the get all achievements and make your perfect game rate higher on your profile LOL",
            "review_score": "1"
        },
        {
            "review_text": "While I liked Pixel Puzzles: UndeadZ, I didn't care for the absurd minigame or playing zombie defense while I tried to solve a puzzle (to be fair, the zombie attacks are optional). PP2: Anime keeps it simple, and focuses entirely on the puzzles. That alone is enough for me to give it a strong recommendation.   Yeah there's an annoying fairy and the music isn't particularly good, but that's easily dealt with. I got several hours of play, and cut into my prog rock backlog at the same time.   ..... Wait ...really? I can't think of anything else to add to this review. I spent over 10 hours on this game! Usually I'd have some overlong diatribe lined up to pad things out, but I guess that ain't the case.  Dammit!",
            "review_score": "1"
        },
        {
            "review_text": "You can't snap pieces together until you figure out where they go. The fairy is annoying. There aren't separate sliders for music and regular SFX, and the music's annoying. The pieces float around in the background which is REALLY annoying. You can't hide the hud. If you 'pause' it by hitting escape, any pieces you've moved to the middle but not snapped in place get put back.  Still fun if you mute the volume, hide the fairy, and don't accidentally hit esc before you figure out where the pieces go.  I can't stop playing it send help",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of anime (and let's be honest, if you're looking at this game, there's a good chance you are) and are looking for a nice, simple way to challenge yourself and keep yourself occupied - you could do a lot worse than this game.  There are a wide range of different puzzles/images, of varying sizes, which allows you to choose the difficulty level and challenge ahead of you. Controls are simple - click and drag - and it allows you to 'snap' in the pieces that are in the right place. The system requirements are low enough that it ran without complaint on my aging laptop, too.  If I had any negative comment, it would be that when you're doing one of the much larger puzzles (with many, many pieces) then it can be a little hard to select the piece you want, but it's a minor gripe.  If you enjoy this, then there are other games in the series - they're all just as enjoyable, especially the Japan one.",
            "review_score": "1"
        },
        {
            "review_text": "A good challenging and fun puzzler. 25 different puzzles to put together ranging 60 pieces up to 330 for the biggest one and all in based around anime. Pieces will also click into place when you found where they are suppose to do. If you enjoy puzzles and like to relax with one sometimes then this is a game worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "Every Pixel puzzle has been uniquely different and Anime is no different. this time you have to rotate the pieces to make them fit. Unlike Pixel Puzzle Japan, and Zombie games. Your progress is saved so you don't have to restart a puzzle you were working on when you quit the game. (Thank you Devs). The only thing I hate is the little fairy who never shuts up. Mute Please. I highly recommend Anime just turn the volume down so you won't have to hear the fairy. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "nice addition to the pixel puzzles family",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I really enjoy playing it.  One thing I really don't like about it is that you can't play it without a keyboard. You don't need it for this game, but you can't play without one. This is just stupid.",
            "review_score": "1"
        },
        {
            "review_text": "That feeling, when wallpaper costs as much as the game :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is somewhat special in it's own way",
            "review_score": "1"
        },
        {
            "review_text": "Game is really good, puzzle are entertaining and the art is great. Except for one thing and everyone say it so of course I going to say it. THE FAIRY....she annoying but that is bad is that you can push delete to get rid of her however it take away your special and you can't use them for the whole puzzle.  Pretty much it annoying nagging voice with use of special to help you on the puzzle or peaceful slient with no specials........reminds me of movie saw with the jigsaw killer......do you want to ears to bleed from listening to an annoying voice or get a headache from no help with the puzzle as you stare blankly at the screen think what to do  Music is pretty basic could be better but easy fix is just turn the music down in the game and open up your music player on your computer and now your able to relax as you puzzle out",
            "review_score": "1"
        },
        {
            "review_text": "This is actually a tough recommend for me... $10 is a bit much for 25 relatively small 'anime-themed' puzzles. (I used to do 1000 piece puzzles irl) I'm not overly fond of the system they use. Rather than 'Piece A fits in location A', I prefer the 'Piece A connects to Piece B' style of digital puzzles, though as long as you don't accidently fit a piece close to it's location when it's properly rotated, you can still somewhat play it like that, just without the connection.  Long story short: All in all, I'd say get it at maybe 50-75%, and remember to shut off the fairy.",
            "review_score": "1"
        },
        {
            "review_text": "Took me 2 &amp; a half hours to notice that I can rotate the pieces freely, instead of just using the 'Dust' to rotate. 7/10 just for me experiencing that waste of time I just did. I could've finished like 4/5 puzzles in that time.  Anyways, the 'Fairy' is really awesome and annoying at the same time. Plus Anime Puzzles...  I had more fun doing the puzzles, once I figured out that I can rotate freely.",
            "review_score": "1"
        },
        {
            "review_text": "My first Pixel Puzzles game was Pixel Puzzles: Japan which I really played the heck out of. Perfect for someone who likes jigsaws but doesn't want half finished puzzles lying around the house. But Pixel Puzzles 2: Anime....ugh! I really regret buying this game.   Firstly, unless I'm missing something, they have still not installed a save function. So unless you are certain you have enough time to finish a puzzle of several hundred pieces, don't start. Mostly though, I haven't met a 'helper' I've hated more since the Microsoft Office paperclip. With constant jibberish like 'I know where that piece goes but I'm not gonna tell ya!' the only answer is to turn all the sound off since there is no option to get rid of her or turn her annoying voice off. Not that losing the sound really matters as the soundtrack seems to want to turn doing a jigsaw into some sort of aciton platformer with it's stress inducing rushed melody.   Anyhow, if you want a jigsaw puzzle game, for for the very zen Pixel Puzzles: Japan. Much MUCH less stressful. Because hey, if I wanted a game to stress me out, I'd play Dota2!",
            "review_score": "-1"
        },
        {
            "review_text": "The addition of the need to rotate the puzzle pieces is good, and having more hint options than just showing hte full puzzle briefly is also nice. I wish they'd added those to Pixel Puzzles Japan instead of putting them in this game with its highly annoying shouting fairy and spastic music.",
            "review_score": "-1"
        },
        {
            "review_text": "Pixel Puzzles 2 Anime was a mistake, it's nothing but trash:  * Annoying fairie character that won't shut up (but CAN be turned off, thankfully) * You now have a power meter that slowly fills up as you play or place pieces * Puzzle pieces can now show up rotated and you can't place them until you do so * Rotating a puzzle uses up your super meter * You run out of super meter really quickly.  I WANT MY 25 CENTS BACK, GROUPEES!  Edit: On the plus side, the devs finally added puzzle saving. Now if only they'd add it to the earlier titles.",
            "review_score": "-1"
        },
        {
            "review_text": "  I've played one game of it. It was the most iritating puzzle, I've ever solved in my life. Solving such puzzles is suppose to be relaxing - here you have an annoying character just shouting random nonsense every 5 seconds. Just... no.",
            "review_score": "-1"
        },
        {
            "review_text": "  I couldn't complete the first puzzle because the last piece got lost. I opened the bottom tray and shuffled so many times but that piece was gone.",
            "review_score": "-1"
        }
    ]
}