{
    "app_id": 350990,
    "name": "Bloodwood Reload",
    "release_date": "2015-11-02",
    "developer": [
        "Luminy Studios"
    ],
    "publisher": [
        "Luminy Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Horror",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 117,
    "negative_ratings": 202,
    "price": 0.0,
    "description": "In a small village in central Europe something is happening, the forest growing around has something different. Its wood is red color, unique in the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/350990/header.jpg?t=1546343247",
    "minimum_requirements": "OS: Windows 7 SP1 32-bits Processor: Intel Core 2 Duo or AMD equivalent Memory: 2 GB RAM Graphics: DirectX 9c compliant card with at least 1024MB of VRAM DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 8.1 Processor: Intel Core i3 or AMD equivalent Memory: 4 GB RAM Graphics: DirectX 9c compliant card with at least 2048MB of VRAM DirectX: Version 10 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Redwoad Woodlod was in production for over 73 years. It was originally conceived as a 12 part novel series by famous author Bram Stoker. However, when he died, all of his assets were dispersed. The amazing story of Loadwoods Bloodrere was given down to generations of writers until the miracle makers at Luminy Studios spent 45,000,000 dollars to buy the writes of the epic and unfinished story.  Masterfully paced, with unforgettable characters like Esther and Priest, it's no wonder that Woodred Bloodload made it so far in the Game of the Year competition in 2006. The game held the title Game of the Year (generally being considered the greatest game ever made) until finally being topped by the masterpiece of Skyrim in 2011. Skyrim and Bloodkin Skyred would then battle it out each year for the spot until the battle was finally ended by Fallout 4 in 2015, which is now the uncontested greatest game ever made.  For free, it's a steal. You should deff try it. I know for a fact it changed my life, and has increased my confidence in my self so much. For instance, I used to be unsure of what I should do with my life, but now I know for sure that I should end it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice short story. Its still a bit buggy but the game IS playable and you can finish it, you only need to get the things right for each character, items and the order to talk to them. Took me aprox 1 hour playing.",
            "review_score": "1"
        },
        {
            "review_text": "Trying to figure out next on what to do but its really mysterious",
            "review_score": "1"
        },
        {
            "review_text": "This game... Is in itself an art form. 10/10 baby",
            "review_score": "1"
        },
        {
            "review_text": "best game ive ever played in a while i beat it as soon as i joined in the spanish was easy to read because i speak english and ive played this game for years never found a single glitch",
            "review_score": "1"
        },
        {
            "review_text": "Now on my first attempt to play Bloodwood Reload i nearly through my controller out of the window in frustration and vowed never to play this game again! I relented however and after reading the first point of the walkthrough posted elsewhere on this page a couple of days later (and a couple of Gins less) i gave it another go and i am glad i did you see my problem with Bloodwood Reload was not the frankly awful English Translation or the many bugs and glitches it was for the simple fact that i had no idea what in Hades i was supposed to be doing!, The lack of direction is my only major groan against this game as i really enjoyed the story (even as cliched as it is) and atmosphere and would recommend it to any fan of creepy occult horror  As i touched on above there is a few issues bug wise but nothing (for me) gamebreaking. One question i do have for the Developer is why does Esther at the Inn have the posture of and swing her arms like a bored Chimp? this made me giggle like a demented Hyena the first time i spotted it!  Overall i enjoyed Bloodwood Reload and think that with a bit of spit and polish (and a new Translator) it could be a fine game, sadly this appears not to be on the cards as the promised patch has been cancelled, But hey-ho it doesn't cost a bean so give it a whirl.  So in the end i leave Bloodwood Reload with a Simian arm swinging 7\\10",
            "review_score": "1"
        },
        {
            "review_text": "I had naively high hopes for this game, but I'm sorry to say that I was extremely disappointed. Mechanics are janky, no clear objective, NCPs are pointless, even after your character is specifically told to go and speak to one. No choices to further the story, nor anything to explore, including the woods, which is odd because that's the premise of the game--we're there for what's happening with the trees. Only clickable things are a streetlight, and a  cart...why??  Can't light the lantern, can't climb the ladders, can't leave the town. Re-work and try again.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried this title since the price seemed right.. Free. Had to set the game to English since it was Spanish out of the box which wasn't a issue. played it and seen it was a slapped together Unity game with some really bad english and the graphics feel a tad outdated. There are some Unity based games out there that are really really well done but this game isn't one of them. The mechanics are messed up, graphical issues. The NPC's seem to always be busy yet they are just standing around..  I don't recommend this title at its current condition.  Will update review once I see any good changes",
            "review_score": "-1"
        },
        {
            "review_text": "This game is plauged with pathetic translations, lazy map design, and a weak story. the camara mechanics were so twitchy i got motion sickness and was nausious for 4 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "I guess the developer is gonna learn not to release an unpolished game on steam the hard way.",
            "review_score": "-1"
        },
        {
            "review_text": "Got out of the map EASILY and found a random ♥♥♥ lake that he never used nor put water in. This game was half ♥♥♥♥♥. Even has the same intro tamplet as YouAlwaysWin. This game is boring and glitchy. It tried to be Resident Evil 4.",
            "review_score": "-1"
        },
        {
            "review_text": "It feels like you're walking on ice, sliding around way more than you should be. All the interactions with objects are wonky. The game creators don't speak English and that is reflected in all conversations, as both spelling and grammar are incorrect. Personally, I couldn't get anyone to talk to me in the town, nor figure out how to pick up objects. There's no instructions, no hint of direction, nothing. It's garbage. Cheap garbage. (also, it says I haven't played it because I already uninstalled)",
            "review_score": "-1"
        },
        {
            "review_text": "Well it looks like it has potential... Right now, it's broken. See for yourself         YouTube™ Video:  Esther...Mrs. Esther - Let's Play Bloodwood reload... Or at least try to play it...&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "I can see what this game wanted to be and I appreciate that, but the atmosphere just wasn't there and I had a very hard time becoming involved with the story. I also managed to glitch into a house near the river bank. The Priest tells me he's busy while he's doing nothing and I got bored of the game really really fast. If they do manage to fix up the bugs and the graphics a bit, Perhaps i'll revisit it and give it another go.",
            "review_score": "-1"
        },
        {
            "review_text": "What can I say? Words can not describe this horrific piece of 'art'. However, I will do my best. The graphics are terrible. The english is terrible. The controls are terrible. It feels like I'm walking on ice!  Did I mention that you can only climb halfway up a ladder?  The premise of this game is also extremely dull.   This game just feels so empty. Basically, it feels unfinished.   This is not a thorough review. I just don't see any reason in trying to explain why this game is terrible. Literally, everything is terrible about this game. Don't download this. Even though it is a free-to-play game.          YouTube™ Video:  Let's Play: Bloodwood Reload&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are a bit bad, and there is no clear objective. Im just running around not told who I am or what to do. NPC's dont help either.",
            "review_score": "-1"
        },
        {
            "review_text": "Well... First when I saw graphics and heard music I was excited about this game. After 30 mins in it I must say that I've wasted my time. You cannot really interact with anyone, you cannot leave the town and explore forest, you cannot open stupid door because priest is standing few meters away, even though you just found the key. The only thing you can do in this game is walk aroung, get lost and click on random things such a street lights and carts or barrels with beer.",
            "review_score": "-1"
        }
    ]
}