{
    "app_id": 350970,
    "name": "Planet of the Eyes",
    "release_date": "2015-08-24",
    "developer": [
        "Cococucumber"
    ],
    "publisher": [
        "Cococucumber"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 14,
    "positive_ratings": 267,
    "negative_ratings": 61,
    "price": 4.99,
    "description": "An atmospheric narrative-platformer about a service robot stranded on a mysterious planet, Planet of the Eyes features a stunning visual mix of puzzle and platforming challenges, an original musical score, and fully voiced audio logs left by another survivor. Explore the mystery of an unknown world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/350970/header.jpg?t=1503938718",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 8.1, 10 Processor: 2 GHz Memory: 1 GB RAM Graphics: Videocard bought after 2009 DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I played the game through in a little under 2 hours but I had a bit of a break in between where I had the pause menu open. I would say you could play it through in 1h 30m or maybe less, depending how long it takes you to figure out some of the puzzles.  The game is a very beautiful platformer with a few puzzles here and there. The game is not very hard and when you die you do spawn close by, not having to repeat to much each time.  In this game you control a little Robot who starts it's adventure near a crash site. Without giving to much away, as you progress through the alien world you find audio tapes which have recordings for you from someone who knows you, giving away pieces of a background story about you and your existence with each audio tape.  The story is light but has a bit of a 'surprise' revelation to it at the end, adding a nice touch.  The game is just beautiful and colorful with an amazing looking alien world and creatures. The different environments you play through are stunning and the atmosphere and music are perfectly balanced.  The game is very short and given you can complete it in under 1.5 hours it is up to you to decide if that is worth a price tag of €9.99.  The game makes up for it in its stunning looks and the amazing experience I had playing it and I know I will play through it again.  For me it was worth it and I would definitely recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "A really touching story of a robot sent to another planet. You come across all types of neat things. The world is very beautiful with its vibrant colors and clear skies. Its short for 10 dollars. But i bought it while it was on sale. Platformer with a few 'puzzles' here and there, Its a very good play.",
            "review_score": "1"
        },
        {
            "review_text": "It's a solid platformer that has a great narrative to keep the story going.  +tight platforming all around. I could immediately tell the polished the hell out of the controls. ( I really like how my robot grabs onto ledges instead of just falling into a pit.) +the audio logs you pick up really kept the story going nicely. Plus it was an interesting story too!  +voice actor for said audio logs is fantastic.  +nice ambient, calming music.  +doesn't take too long to beat (90-120 min)   (very minor nitpicks below)  -I'm not too crazy about the graphics. They're simplistic but somewhat detailed (if that makes sense). I could only imagine how awesome this game would look if it used detailed sprites with lots of vibrant color all over the place.  -I think the title of the game will put a lot of people off from even trying it.  -$10 is a bit high with low incentive to play multiple playthough. $5 is buy price for me.   8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Everyone needs a platformer here and there.   The art style is gorgeous and simplistic yet it catches the eye. The gameplay is as simple as it gets: WASD to move, SPACE to jump. The puzzles wont crack your skull but some pose a small challenge.  I recommend this game if you want to spend an hour (two at most) relaxing while being a small robot in an unknown planet.",
            "review_score": "1"
        },
        {
            "review_text": "The first video game I've played in years and it's exactly what I wanted. A totally immersive platforming experience from start to finish. The art is simple yet elegant in its design, with a wonderful soundtrack that pulls you into the mysterious cosmic world of our little hero. Was planning on taking my time with it but the gameplay was so enthralling I ended up finishing it in a few hours. There are a few challenging puzzles, but likely won't leave you banging your head against the wall trying to solve. For those who are fans of Cave Story (incidentally the last game I played many moons back), you're in for a treat!",
            "review_score": "1"
        },
        {
            "review_text": "First things first this game is BEAUTIFUL! The artistic direciton is breathtaking, inspiring, and creates a powerful sense of atmosphere and depth. Second the game is incredibly fun to play. Short and sweet, creating a sense of eerie curiosity and wonderment. Would definitely recomend. I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Planet of the Eyes attempts to replicate Limbo's success, but lacks the kind of atmosphere and challenge that made Limbo good. It has the simplicity and core puzzles, but beyond that, it is a very bland title.  Playing it I never felt challenged by the platforming or puzzle design, only frustrated with its limitations. Towards the end, you'll encounter rotating arrangements of boxes to traverse. You have to carefully balance your little robot to not slide down on either side of a block, and figure out the right angle to jump off from. It is a matter of timing and precision, yet the controls feel noticeably unprecise in these sections. This is mostly down to when your robot will find it in himself to latch onto a ledge. The angle of a box has to be just right for it to happen, and even when you feel you should have been able to grab onto it, the automatic system might think otherwise. In reverse, you might end up sticking to ledges when you didn't mean to, and die as a result as well.  That kind of design quirk makes me wonder why the devs couldn't have implemented, I don't know, a button press for hanging on to things? Its not like the game offers more than jump and interact buttons, plus a joke/achievement related dance button. Well, there is the pause menu too, but that, while it has a 'Resume' button, doesn't actually pause the game. Oh joy.  A lot of the puzzle-platforming could have been improved simply by requiring my user input, which a ledge-grab action would have helped with. There are a lot of spots where you have to jump from ledge to ledge, and the button-press timing necessary for that would have made them a lot more engaging. The way the game plays now, however, just had me  bored . Beyond the clean and quirky art style, and the occassional audio log detailing the plot passively, I didn't feel like this was something enjoyable to play. The minimalist sound design adds to that as well.   Compared to Limbo, which it is closest to, everything felt too basic, too simplistic and without real tension. There were a bunch of cool sections with alien wildlife making things difficult for you, but those mostly happened in the earlier parts of the game, and the closer you get to the end, the more it turns into pulling switches to avoid repetitive traps and waiting for platforms to move on their pre-described rotations or ferry you over lava lakes, while you're standing in place until reaching the jump-off point.   It is an utterly inoffensive game, but sadly, that also means it has nothing really going for it to keep me playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashed-landed in your escape pod, u will discover the planet's dangers and help the lone robot trough its journey in this adventures.   A platforming-puzzle game that will keep you hooked with its amezing design and smart build stages, a game that will keep you hooked untill the end.   Test your platforming skills and solve puzzles in this impressive 2d game.  - Planet of the Eyes",
            "review_score": "1"
        },
        {
            "review_text": "Such a sweet, short game.   Folks who enjoyed Out of This World or Limbo will probably find this worth a look. Even though it's not as involved on either the storytelling or gameplay fronts given the brevity, it does manage to tell an engaging tale within that span. The platforming mechanics are effectively used, and the puzzles, though easy, are varied and paced well such the game flows well in a single sitting playthrough.  I hope this game does well for Cococucumber so that they can pursue more ambitious projects in the future!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story, made a lot more sense compared to other games in this price range. Beautiful art style and level design.",
            "review_score": "1"
        },
        {
            "review_text": "Takes about 2-2.5 hours to complete. Very enjoyable, if short. Not usually a fan of platformer type games, but it still held my interest.",
            "review_score": "1"
        },
        {
            "review_text": "Short, atmospheric and with very good art style.",
            "review_score": "1"
        },
        {
            "review_text": "Got this game in the humble monthly bundle, completed it 100% in 2 hours, it's a fun game but for $99.99 mxn is too costly, get it on discount. Also update your xbox one controller drivers, I thought this game had really original controls but it was my computer instead.",
            "review_score": "1"
        },
        {
            "review_text": "Disclosure: I paid for this game. The game overall is interesting. They have the tag short which in my case was around 1.3ish hours. Nothing was really that hard. I got stuck only in one spot because it seemed weird (will not spoil it). Overall, I would recommend at a discounted price because at the time of this review it is $10. This has a nice little story and to get all the achievements if you are a completionist is around 2-3 hours.",
            "review_score": "1"
        },
        {
            "review_text": "LIMBO but shorter, more colourful, easier and less enaging due to the puzzles being super simple. Also its $10 when it only takes about an hour and a half to complete don't get me wrong its an ok game, but its asking price is ludicrous for what it is",
            "review_score": "-1"
        },
        {
            "review_text": "Short, atmospheric and with very good art style.",
            "review_score": "1"
        },
        {
            "review_text": "Short game. Took me about two and a half hours at a relaxed pace.  A good game though. Interesting puzzles and nice smooth artwork.  Not sure about the story. Didn't seem to match the game style; too serious, morose.  A bug stopped me using my Xbox One controller that's really something that should be fixed.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful art style with a limbo type game play.",
            "review_score": "1"
        },
        {
            "review_text": "It's Robo-Limbo... in Space!  This is a fun little game. It took me about 1.5 hours to complete, so not worth $10. It is really fun and not as dark as Limbo. It's also a lot easier than Limbo.  It's good :-)",
            "review_score": "1"
        },
        {
            "review_text": "A cute little adventure in the style of LIMBO and similar platformers, you can jump, push and swim, and that's about the extent of your abilities.  The 'puzzles' are easy and you will mostly just find yourself stuck if you can't get the timing right, which happens every now and again, it's really just a game about timing except for that one water and that other lava 'puzzle'.  It has good art with a nice clean aesthetic and vibrant colours, it doesn't quite hit the spot for me, but it's consistent and well executed.  The story is conveyed through the surroundings and tape recordings left behind by your creator, how he got to those places alive, and how your path to that place isn't destroyed from him reaching it, is left up to game logic. It's the ramblings of a man who's been rejected by his fellow men and has only one friend, us, the robot. Which basically takes the role as his child.  If you enjoy short games like LIMBO, give it a spin, it only lasts for 1-1/2 hour. Is the price right? I got my copy with the humble monthly bundle so it's hard to assess properly, but, neh, I wouldn't say so, maybe at 33~50% off.",
            "review_score": "1"
        },
        {
            "review_text": "While not as challenging or long as its cousin, Limbo, POTE is a fun experience to play through once. Experienced puzzle platformers shouldn't expect to take much more than an hour per playthrough, and there doesn't seem to be much more to discover after playing through once.",
            "review_score": "1"
        },
        {
            "review_text": "This game... completely caught me off guard! I don't even remember how this game got into my library but I decided to give it a quick try and WOW I was pleasantly surprised. It's a short little game (took me about 3.5 hrs) with an interesting little story. I liked the art style of the game and enjoyed the VERY easy and small puzzles. I'd say it's definitely worth a go if you're interested in little games with a small amount of gameplay that revovles around jumping platform to platform while figuring out what exactly is going on in the story. I did not expect the ending nor do I fully understand it but it was fun nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game and I would recommend it if it was on sale or if you get it in a bundle with other games. It just is not worth the $10 for it as it is too short.",
            "review_score": "1"
        }
    ]
}