{
    "app_id": 351090,
    "name": "Regency Solitaire",
    "release_date": "2015-05-18",
    "developer": [
        "Grey Alien Games"
    ],
    "publisher": [
        "Grey Alien Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Card Game",
        "Family Friendly"
    ],
    "achievements": 17,
    "positive_ratings": 377,
    "negative_ratings": 23,
    "price": 6.99,
    "description": "Experience romantic Regency England in this sumptuous solitaire game. Play your cards right as you tour historic London, Brighton and Bath, and help Bella create a dazzling ballroom. Unlock gameplay features with your makeover project and improve Bella’s chances of finding true love!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/351090/header.jpg?t=1553682281",
    "minimum_requirements": "OS: Windows XP Processor: 1GHz Memory: 1024 MB RAM Graphics: 64MB VRAM DirectX: Version 7.0 Storage: 70 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Regency Solitaire is a totally charming take on the single-player card game by Grey Alien Games. A variation on the golf solitaire play style, this fast-paced version of the classic game will have you addicted before you can say 'tea and biscuits!'  Golf solitaire involves playing cards in ascending or descending order until all have been removed from the board. There's a bit more to it than that, but it's a very easy to learn version of the game that will appeal to those looking for a more relaxing experience. While there is indeed some thought needed in play, once you get the hang of things you'll be a solitaire pro in no time.         Regency Solitaire&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "An excellent solitaire game with a well thought out storyline placed strategically between 'places' giving the gamer a mental break. Set in the beginning of the Regency Period of England (1812) follow Belle through a matrimonial based societal season as she is pursued by one man but pursues her own dream of finding love and happiness with another man. These short story breaks in the gameplay offer tidbits of what life was like during this period of history and the common places those of society went. Bright and colorful artwork of each place added during gameplay as wallpapers.  Gameplay: Starts at three hands and increases to ten hands per place invited. Every hand can be repeated, using retry, if the gamer wishes to achieve or needs to achieve a better score to reach the 'local' goals. (Note: once the player moves on previous hands can not be repeated unless the player restarts that level.) This particular retry feature comes in very handy when trying to achieve the 35 card combo, which as far as I can tell can only by achieved in two places (last chapter Belle's Ball, hand 7 or 10). My best combo before Belle's Ball was 34 and I ran out of cards. So sad.  The player can have up to 11 'wild cards' and jokers can be used as any card which makes getting that elusive 35 card combo possible. There are three 'power-ups'. 1) Cupid who shoots an arrow (2 when upgraded) to eliminate a single card on the playing field. 2) A fan used to shuffle the cards, and shuffle includes both the cards of the playing field and those remaining in stack. Can be useful. 3) A fire phoenix that burns 2 (3 when upgraded) random playable cards of the playing field. (Note: I do not recommend using any power-up when trying for the 35 combo since at most there are only 37 cards on the playing field.)  Just a few words on the card hands, some are very, very challenging. One of the hardest hands I had only had about 16 cards on the playing field and about 28 cards in the stack. The way the playing field cards were laid out overlapping one another and having multiple cards with ribbons (ribbons mean the player had to use that card twice) was quite the challenge to clear, and power-ups were certainly handy to have.  Overall, an addicting card game, that moves along rapidly though the levels, and becomes more challenging as the player moves through the story.",
            "review_score": "1"
        },
        {
            "review_text": "I adore this game! Steam, you outdid yourself on this recommendation. I haven't been able to stop playing since I bought it - the art is gorgeous, the story is, while simple, engaging and rather enjoyable (particularly as a fan of Jane Austen's works) and the gameplay is addictive.  The only problem is I'm playing this instead of writing an essay for university on the same subject matter. Whoops.",
            "review_score": "1"
        },
        {
            "review_text": "With my only experience really being windows solitaire I really didn't think that ballrooms and card playing would hold my attention for long, but figured I'd try it out as I'd heard good things from friends.  Five hours later I finally wrestled myself from the keyboard. One more round....   Excellent game, far more strategic and engaging than I ever thought card games could be, the varied card placements, locks, keys and other sneaky elements make it so much more than the luck of the draw I was expecting.  Backed up by gorgeous artwork and a story that probably appeals more if you're a fan of Jane Austen, but managed to keep the philistine I am intrigued nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and relaxing, with enough light-strategic options to keep the gameplay interesting.",
            "review_score": "1"
        },
        {
            "review_text": "regency solitaire is a master piece nothing can compare to this game it is that good",
            "review_score": "1"
        },
        {
            "review_text": "This game was recently added to a humble bundle and it was the deciding factor in purchasing that bundle. I'm a huge fan of solitaire games and this game does everything correctly. Gameplay is smooth and isn't overwhemlmingly difficult. The theme and music are great too. Buy this if you are looking for a new solitaire game!",
            "review_score": "1"
        },
        {
            "review_text": "Regency Solitaire is a nice, but challenging solitaire game with a Georgian era storyline. Bella dreams of hosting a ball of her own and meeting her true love. However, her brother, Edward, has squandered the family's fortune by gambling. Now it looks like her father is going to give her hand to their odious neighbor, Mr. Bleakly, since she has no money for a dowry.   Play is quick and the game is addicting. As you finish chapters, you can buy items that serve as power-ups. There are ten hands per chapter.   Pros:  * Graphics and music are very nice. Storyline is ok, but you can skip it. You can also make the chapter's scenes your desktop's wallpaper.  * Fairly challenging game play, including playing in either normal or hard mode. * Power-ups and wild cards make game play more interesting. Also Steam achievements.  Cons:  * While you can replay the current hand in a chapter, you can't go back to a previous hand in the same chapter. * If you get through a chapter and don't complete one of the tasks, it will ask you if you want to replay. If you do that, however, it wipes out the entire chapter. You have to start from the beginning of that chapter and play all ten hands again, which is annoying.",
            "review_score": "1"
        },
        {
            "review_text": "Give it a shot, it's a lot of fun. The attention to detail in the game is super obvious, it's very well made.  To be honest, I don't normally play these sort of games but somehow I find myself utterly addicted!",
            "review_score": "1"
        },
        {
            "review_text": "This game was great! I wish they would do another one. Lots of great items to buy to help make the game easier along the way and I experience absolutely no bugs. Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "If you love regency period stories, and you love cards games, then this is a game you will love more than Colin Firth after a dunk in the lake. The artwork is wonderful (and gives you the option of using the backgrounds as your desktop art, bonus!). My biggest beef with card games is that I generally get bored with the same layout every round, but that is not an issue here. Lots of interesting card lays outs that you' wont get bored of. I don't generally get sucked into this type of game, but I found myself saying 'Just one more round.. just one more round'. The story line is great and pretty typical of women in regency type story lines (think pride and prejudice).   Greatly exceeded my expectations! Great work guys.  ",
            "review_score": "1"
        },
        {
            "review_text": "As a Jane Austen fan, I found this game utterly charming. Yes, the story is rather cliché and Bella isn't the strong, witty Austen-esque heroine I might have wanted, but it is nonetheless entertaining and well done. The solitaire levels fit perfectly into the style of the game and are well designed. There is plenty of content to keep you playing for a good while.",
            "review_score": "1"
        },
        {
            "review_text": "Regency Solitaire is a very good game. I'm not going to bother describing the game, since its gameplay is obvious from the trailer and from other reviews. I'll just list some positives and negatives.  Its core gameplay is similar to Fairway Solitaire's (originally made by Big Fish Games, but the PC version was made by Grey Alien Games, who also developed Regency Solitaire). The addition of on-demand powers like the bow and arrow provide some strategic options lacking in Fairway Solitaire. On the other hand, some mini-games like Fairway Solitaire's would have been nice. However, I think it was a good decision by the developer to add powers instead of mini-games. Mini-games did not add to the core gameplay of Fairway Solitaire.  There's something very addictive about finding long runs and continuing them with powers and saved cards.   It has a good amount of replayability because it has multiple difficulty levels and the items you acquire can change the way you play.  I liked the wide variety of scenic backgrounds, but I do prefer shorter scenes: having to play up to 10 rounds just to see a few lines of dialogue sometimes did not feel very rewarding.   I would have liked to see a way to compare scores with other Steam members, but I understand that this game is not just for Steam users.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game really is better than it looks. I recommend it if you like relaxing puzzle games with a luck factor (a bit like PopCap Games) The story and look is quite... unmanly. But I still enjoyed it a lot. as a man.",
            "review_score": "1"
        },
        {
            "review_text": "So I was going to say I wouldn't reccomend this game but I completed it 100%. If you want something to play mindlessly while listening to music (like I wanted) then get it. Otherwise there are more interesting games to play.",
            "review_score": "1"
        },
        {
            "review_text": "Card game with a love story, that is really a good idea.  Level up system make the game more easy but also more interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, well, I wouldn't have chosen this kind of setting if it were up to me. But there are not so many solitaire games without ingame purchasing. And yes, it is a well executed solitaire game which I will probably play through again in a harder mode in the near future.  So in the end this is avery smooth, well made solitaire game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't fully understand why I enjoyed the game as much as I did. If I had to guess its probably the way the game plays. The game isn't slow, doesn't have overly complicated objectives, and just ads a few quality tweaks to a common formula for this genre.  I'd recommend this just because its a simple fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Oh god this is addicting...",
            "review_score": "1"
        },
        {
            "review_text": "While everyone else is playing Fallout 4, I be like 'Papa, throw me a ball.'",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a version of 'classic' solitair with stacking, then don't buy this game. Apparently this is based on another version. Otherwise I would recommend as it has high production values and is very well made.",
            "review_score": "1"
        },
        {
            "review_text": " A charming little title with flaws too big to overlook    Regency Solitaire is not without it's merits. It is a relaxing little card-game which actually bothered to tell a story, looks good enough and has a great soundtrack. Sadly, it relies way too much on RNG and the gameplay itself is far too simplicistic too enjoy.   When you load up Regency Soiltaire for the first time, you will be almost overwhelmed by all the kitsch that literally slaps you in the face. It's not bad, however; it grows on you in a weird way and after the first few levels you won't mind the shamelessly ridiculous baroque atmosphere anymore. It's similar with the story - god, it's so simple, conciously archetypical and still you can't help to feel a weird sympathy for what's unfolding on your screen. You probably need to like the trashy kitsch-atmosphere or really love baroque, or you won't feel the same. Maybe it's just Stockholm Syndrome. All in all, it's not too bad and everyone purchasing this should already know what to expect after taking a short glance at the storefront.  Don't get fooled by the name - Regency Solitaire is not really Solitaire how you know it from your Windows-installations or Linux-repositories. There is no stacking of cards. Instead, you take cards from into your hand by clicking on it, but only if the card is exactly one value higheror lower than the current card on top of your hand. If there is no such card on the field, you draw one from a stack of cards. The game ends once the field or the stack is empty, the former is preferred. There a three abilities with a recharge and some special types of cards which bring a little bit of variety. Between sessions you spend the money you have earned while playing cards for powerups.   All of this is really relaxing, because you just click, and click and click without having much to worry about. Most of the time the next step to take is absolutely clear, it is very rare that you have actually a hard time deciding between two options. That is my main gripe with the game: You have almost no influence over what outcome the round will have. As I have said, you almost never have a real choice. If you win or not, is mostly a question of what cards are in your stack and on the field. There are games in which it is almost impossible to win, then you hit the retry-button and make it in two minutes. Three powerups bring a little bit of spice in the game, but they reload so slow that you can use them only once per round anyway, so they don't matter too much. In the end, it's just a game against your own time, when you hit the retry-button for so long until you got a good result.  If I am missing some tactical depth here, let me know! I'd love to give it another try.    tl;dr: Music is good, art is okay, plot and atmosphere are charming in a trashy way, but the gameplay is simple and relies so hard on sheer luck that I can not recommend it, especially for 10 bucks.    ",
            "review_score": "-1"
        }
    ]
}