{
    "app_id": 3510,
    "name": "Amazing Adventures The Lost Tomb™",
    "release_date": "2007-12-13",
    "developer": [
        "SpinTop Games"
    ],
    "publisher": [
        "PopCap Games, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 21,
    "negative_ratings": 8,
    "price": 4.25,
    "description": "You are an adventure seeker who travels the world in search of forgotten & lost treasures. Search for hidden objects and circumvent unique puzzle traps to recover the most sought after treasures the world has ever known. A newly-discovered fragment of an ancient map is believed to reveal the location of the Lost Tomb of Egypt.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3510/header.jpg?t=1447351196",
    "minimum_requirements": "OS: Microsoft&reg; Windows&reg; XP, Vista&trade; or 2000Processor: 350 Mhz Pentium or greater CPUMemory: 128 MB RAM or greaterGraphics: 16-bit Graphics and Sound cardDirectX Version: DirectX7 or laterHard Drive: 75 MB free hard drive space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "yes it's more of the same. yes it's a time waster. yes i loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Remember those 'I SPY' books you used to look at as a kid? How about those 'Spot the Difference' games in the comics section of a Sunday paper? How about a 'Jigsaw Puzzle', one of the oldest toys created? This game is pretty much all of those things put together. I personally only played this game while listening to podcasts, which worked out really well, but I couldn't tell you how it stands on it's own. All of those things I mentioned aren't exactly well known for being the pinnacle of entertainment, but they are good time wasters. Buy it in a pack or on sale.",
            "review_score": "1"
        }
    ]
}