{
    "app_id": 351230,
    "name": "Counter Spell",
    "release_date": "2015-10-05",
    "developer": [
        "Abnormal Software"
    ],
    "publisher": [
        "Abnormal Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Indie"
    ],
    "achievements": 30,
    "positive_ratings": 116,
    "negative_ratings": 14,
    "price": 6.99,
    "description": "&quot;Counter Spell&quot; combines elements of classic role playing games with modern stealth-based shooters. Single player, multiplayer coop, and competitive multiplayer are all supported with different game modes for each. An open, streaming world makes for an exciting sandbox to adventure in!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/351230/header.jpg?t=1537808649",
    "minimum_requirements": "OS: Windows XP Processor: 2.0 GHz Single Core Memory: 2 GB RAM Graphics: Shader Model 3.0 or better (DX10 GPU) DirectX: Version 10 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 or Later Processor: 2.0 GHz Dual Core Memory: 4 GB RAM Graphics: 512MB Dedicated Graphics Memory DirectX: Version 10 Network: Broadband Internet connection Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Very fun game, have played it solo and with friends. With 6 classes and various game modes, has good replayability, not to mention the farming aspect to get gear sets youd want. Reminds me of a diablo but as a first person. Dev is very receptive to the community and has good communications. Would recommend higher if I could.",
            "review_score": "1"
        },
        {
            "review_text": "It's a laugh, can't lie! Good with friends",
            "review_score": "1"
        },
        {
            "review_text": "Its a quaint game.   Update [10/17/2016]   Graphics had a massive improvement Minor Gameplay changes Devs very involved with community. Would recommend using the reforged beta over vanilla.  [Original review]  There graphics are not really something I would judge this game on as the pictures and trailer show that quite plainly. Its like Barony but a bit more open world. It has an adventure but Its fairly short. I want it to be like daggerfall, I really do but it dosent do that for me. There are definitely things that could be added and adjusted to make it have better flow like defined towns and npcs with time to breathe in between the swarms of monsters.  I think its worth the 7$ I paid for it. Its appropriately priced; it is at least a better deal than a lot of 15$ EA games.",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced, fun and addictive. I've only played que first Quest map so far, but it's pretty large and there's lots to find. I keep getting challenged, and that's good. Might as well buy a 4-pack and get some friends to play with me to try the multiplayer features.  I notice the map builder, and I am curious. Some tutorials would be nice. Gameplay doesn't really require a tutorial, but at least it should be mentioned somewhere in the beginning that you can switch classes, and what the advantages to each are (unless it's there and I didn't see it).  Anyway, thanks for a great game, and congratulations for the launch! I'll get back to playing sometime soon. I notice that there have been many updates recently.",
            "review_score": "1"
        },
        {
            "review_text": "8\\10 (10/10 for price) Ok so first things first I dont have hours of playing time on this but from what i did play it kept me entertained. It was actully a lot more than i expected when it comes to wepons (a lot of throwables.) and the gameplay even though at first i was roming around without a clue what was going on. I honestly got the game because I was bored and wanted a game to play and thought i'd give this a go thinking i'd be returning it. Hopefully they will add a little bit more to the game from what I seen. For the price you pay its great.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and entertaining FPS/RPG hybrid that came out of no where. I bought the game based on 3 factors: the store page videos, positive reviews and it was only a little over $5 at launch. When you factor in the low asking price, this game's creator is offering you a whole lot compared to some of the indie RPGs being sold for higher prices. You get a bunch of multplayer PVP maps, a single player or coop campaign with a decent sized open world to run around in. The main complaint you will read in reviews is the graphics, which are nothing fancy, but not as bad as some would indicate. This game appears to be the work of a lone developer, one who has been patching the game almost daily and routinely comments in the forums. For the low asking price, I highly recommend Counter Spell. Especially if you are into the indie RPG scene here on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Really terrible. I had no expectations and I'm still blown away- This is like if someone couldn't afford world of warcraft so they used the money to make their own. There is nothing positive I have to say about this game its not bad in the funny way to go into detail about how bad it is would take ages, let me highlight a few things for you.   the quest tracking is terrible and confusing the ui is terrible and confusing  the sound effects are terrible and confusing, I jumped off a light house and it made the sound of poking your finger into jello, I encountered a spider and thought someone was kissing me the graphics are like roblox gone even more wrong than it normally is the game is far too easy in some areas and far too hard in others, never an in between  overall is you are looking for a bad game to play for laughs, look somewhere else- I cant stomach this for more than 34 minutes. I highly doubt I'll play it again.  My rating for this game is I'd Rather Die out of 10",
            "review_score": "-1"
        },
        {
            "review_text": "This is an incredibly fun game that is easy to just jump in on and goof around for a while with friends. Its reminiscant of classics like Hexen, but I feel like everything about it is just a bit better.",
            "review_score": "1"
        },
        {
            "review_text": "I normally don't write reviews because even the indie games I play have 500+ reviews. A friend convinced me to pick it up and its awesome. Very addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Counter Spell should be far more popular in my opionion :) It's the perfect example, how Indie Games should be developed! Constant updates, ideas for the future, absolut playable base-game, editor + workshop support for new stuff and so on!  The Game it self is a quite good retro RPG which should catch the heart of oldschoold RPG Fans as well as of other people ;) I can absolutly recommend to give Counter Spell a try!",
            "review_score": "1"
        }
    ]
}