{
    "app_id": 351490,
    "name": "Intergalactic Bubbles",
    "release_date": "2015-05-29",
    "developer": [
        "Hellscape Games"
    ],
    "publisher": [
        "Hellscape Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 10,
    "positive_ratings": 909,
    "negative_ratings": 213,
    "price": 0.79,
    "description": "Blast your way through space in this innovative 3D bubble puzzler! Bounce, bobble, swing, and explode bubbles across the universe. Intergalactic Bubbles advances the classic match-3 genre into the 21st century with stellar graphics, 3D action, and upgrades.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/351490/header.jpg?t=1510874050",
    "minimum_requirements": "OS: Windows XP, Vista, 7 Processor: 1 Ghz Memory: 1 GB RAM DirectX: Version 9.0c Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game is fun and is quite cheap but it is EXTREMELY MONOTONOUS. If you like the same level each and every round with absolutely no change other than a slight speedup, then go for this game but if you need a variety, I would go elsewhere.  I am glad I tried it and it isn't horrible though and it does offer powerups if I knew how to use one and all. Oh, and the controls suck and they cannot be edited.",
            "review_score": "1"
        },
        {
            "review_text": "Intergalactic Bubbles is a Match-3-Esque Bubble Shooter. An incredibly simple game, at its core, but, with a twist. It has about 250 Levels and will last quite a while (It took me 3 Hours to get past the first 50 Levels). This game has power ups which allow for a unique twist to the Bubble Shooter Genre. One allows you to place it anywhere in the area, one is a Universal Ball, and the other, which I forget. There is also a layer of physics here as well. You can bounce the Ball off a wall and ricochet it to hit where you want, if you're good enough to do that. Furthermore, you can upgrade the Abilities when you have points, which will give you better uses for the Ability. You can even combine the Abilities later in the game when you get far enough. I would definently recommend this game if you like the Bubble Shooter Genre. It is Cheap, fun, unique, and definently worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what is supposed to be 'intergalactic' about these bubbles. It's basically a 'Puzzle bobble'/'bust a move' clone without all the charm of that game.  The developer has also added some power-ups that are annoying to try to use and not all that worthwhile. I feel like this game would have been better on controller with a better control scheme for using the power-ups. Instead you aim with the mouse, and if you want to use a powerup, you have to right click to bring up the mouse pointer, then move the mouse down to the bottom corner to click on the power-up, and then right click again to go back to aiming.  Things I liked:     It's a bit more active/real time based than the original puzzle bobble      After making a shot a 'dangly bit' can swing around and maybe make contact with more pieces to do a chain reaction.     Things I didn't like so much:     The music wasn't very good and got repetitive by the 5th level.     Using power-ups is clunky and awkward     The power-ups themselves don't exactly seem all that inspired (but then again I only unlocked a few)     The whole game feels like it was done as a class project. It doesn't exactly feel very polished.   I don't really hate this game, but I don't want to thumb it up and say 'You should buy it' because really, you'd be better off looking for a flash game version of the old Puzzle Bobble for free instead. I would have questioned how this game made it through steam greenlight, but I think pretty much everything makes it through steam greenlight these days.  Buy it cheap if you're super bored. I will probably not even get a full hour of game play out of this. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a classic match-the-colors game but with physics and skill tree. Well the graphics are horrible and its made in Unity (Notorious game engine repsoncible for the release of limitless shovelware) well its clearly that the developer is new to game developement, but its on a rare occasion that you dont have to Alt-Tab and wait for the steam cards. This game is surpizingly fun, I had fun playing.",
            "review_score": "1"
        },
        {
            "review_text": "This the best game I have played in my life !!! Go and buy this game now !!!",
            "review_score": "1"
        },
        {
            "review_text": "BUBBLES! My bubbles!",
            "review_score": "1"
        },
        {
            "review_text": "Linux users especially know Frozen Bubble, one of the more fun free games in the repos. This is a greatly improved version of the same idea, with a good soundtrack, great graphics and challenging gameplay. Well worth your free time, and each level takes only a couple of minutes to complete. HIghly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "If you are red-green color blind, I do not recommend this.   I enjoyed the first 50 levels. On the 51st level of the game a new colored ball is unlocked; since I am red-green colorblind I cannot distinguish the new color from the green ball.   The nostalgic ball shooter game was good while it lasted....",
            "review_score": "-1"
        },
        {
            "review_text": "I played better games on my cell phone. Literally, I have Bubble Shoot on my Tablet and it's way better than this game.  This game could been better, but it's lazy, the design is poor, graphics are outdated and the sound is horrible. But what can you expect from Unity?   I'm sick of Unity games flooding Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "(I've played hours of this on my phone. This version is virtually identical.)  Intergalactic Bubbles will feel both familiar and innovative to puzzle game fans. The sticky physics are what make it awesome -- big tendrils and gobs of bubbles swing and pop and fall spinning off the map. They enhance the feel of the game and, once you're used to them, they can be leveraged for tactical combos.   The sorta pinball table view is a nice touch too.   Very good instincts shown by this dev. I'm gonna keep my eye on 'em.",
            "review_score": "1"
        },
        {
            "review_text": "It's kinda cool, but the music is awful. And it's boring after so long...  2/10 Do not recommend",
            "review_score": "-1"
        },
        {
            "review_text": "A match maker game Done right",
            "review_score": "1"
        },
        {
            "review_text": "The main difference between this game and Bubble Bobble is that the balls are dangly.  I only played this game to farm cards.  No one should buy this crap, but I find the positivity of its reviews hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "m1Z3LL: yeah i see in activity feed m1Z3LL: i got this game called spectre ball you can see videos on my profile thogh |NotD| Bob The 3RD: Cool/ |NotD| Bob The 3RD is now Online. m1Z3LL: yeah i played that game its kinda good with this new swing mechanic twist on a classic retro game with new leveling bonus specials, and time, and 3D animations |NotD| Bob The 3RD: Ok. |NotD| Bob The 3RD is now Offline. ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best game for diving in ur ♥♥♥♥ when ur hav short ♥♥♥♥♥ and ur foreskin is phimosis.",
            "review_score": "1"
        },
        {
            "review_text": "Its not a game, its a pile of garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "It's one of those 'shoot the bubble to pop other bubbles' games that you see a lot of on Facebook and on Mobile. You shoot 'Planets' instead of bubbles, and you also have 3 Abilities. There's an upgrade menu, where you spend 'Stars', which is a currency you earn by completing levels, to upgrade various passive and active skills. You know how on mobile puzzle games, when you complete a level it gives you a rating of 1 to 3 stars depending on how well you did? It's like that here, and also has the standard square grid level select too. Each level you can earn up to 3 stars, which are used to upgrade your shield, energy regeneration and other energy stuff(energy is used to use abilities), actually purchasing the 3 abilities(they're cheap), and passive upgrades where you can use the various abilities together.  The 3 abilities are: 'The Rocket', which basically throws the Planet above the others to land it somewhere further up, useful for when you want to drop a stack but can't reach it normally. The next ability is 'The Wild', which is basically a multi-color Planet that can be matched with any other Planet. Then there's 'The Bomb', which is like it sounds, you shoot it like a regular Planet and it destroys all Planets in a radius(that can be upgraded).  I friggin' love this game. It's really fun and really cheap too. I definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Intergalactic Bubbles is hardly an original game design; it's one of those simple games that get cloned ad nauseam, like Arcanoid or Tetris. Nevertheless, such clones are invariably entertaining because their core idea is so good, and if they manage to give it some nice twist, they can expect some real popularity. This is exactly what Intergalactic Bubbles does: by taking the concept of 'put balls of the same colour together to make them disappear' and adding real physics, as well as some special moves and buyable upgrades, it provides a surprisingly good gaming experience. Yes, each level is virtually the same, but it's just this kind of game - it's pointless to expect anything else from it. It is what it is, and the repetitiveness is a feature like any other, not a shortcoming. What matter is that it's fun to shoot the balls, look for combinations, buy new skills and watch the balls swing quasi-realistically (hopefully with unexpected combos). The game has no major weak points, but the graphics aren't exactly pretty, which is a shame for this kind of game (especially visible on Steam cards, which I've melted to crystals as soon as possible before my eyes could bleed). I also have some reservations regarding balance of power-ups (for example, bomb costs more energy despite being less useful than multi-coloured ball), but it has very little impact on the actual gameplay. To sum up: Intergalactic Bubbles is a game for many, many evenings, but only if you don't mind doing the same thing over and over. But it never hurts to try, especially since the game is addictive as hell.",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable bubble shooting game. It is very repetitive (which would normally be boring), but I still thoroughly enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a test for new levels of boredom. I could spend hours on the normal browser bubble game but i get specially bored when i check that there are 750 levels of pure random, scoreless boredom to finish this If you want this because you used to like playing the broswer bubble, don't. Find the browser one",
            "review_score": "-1"
        },
        {
            "review_text": "Hey that´s pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "This game is sooo fantastic! The time flies by and its such simple and old fashin with a new touch! Defenetly worth the euro!",
            "review_score": "1"
        },
        {
            "review_text": "It's so simple and addictive.",
            "review_score": "1"
        },
        {
            "review_text": "bubbles in space. what more could you ask for?!",
            "review_score": "1"
        },
        {
            "review_text": "Really good for the price. It doesn't get repetitive, and you can play for hours without getting too bored. Each level pack adds one more colour to the set of bubbles increasing the difficulty a good bit. You can upgrade your abilities, like having a shield for when bubbles pass your turret, and being able to fire a bubble pretty much anywhere. You can also combine abilities like having a rocket bomb.",
            "review_score": "1"
        },
        {
            "review_text": "simple yet fun game to waste away a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, the big combos are so easy to get and it feels great when it happens. Easy, even the later levels are only a bit challenging, I don't think I restarted a level more than three times in order to get three stars.  100% achievements is possible if you put the time in. There are a loooot of puzzles here.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING game is unplayable after stage 1 if you are colour blind.",
            "review_score": "1"
        }
    ]
}