{
    "app_id": 351820,
    "name": "Z.A.R.",
    "release_date": "2015-05-01",
    "developer": [
        "Maddox Games"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 34,
    "negative_ratings": 14,
    "price": 4.79,
    "description": "In 2097, the mining of minerals and other natural resources is completely automated and controlled by supercomputers. The planets that are mined for 'Iberium', an essential mineral to control pollution on Earth, are called Z.A.R.; Zones for Artificial Resources.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/351820/header.jpg?t=1466791325",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 800 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 800 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "In 1997, I received a demo disc with an issue of PC Gamer, and on that demo disc was the one-level demo of Z.A.R. The game, even then, struck an impression on me due to its advanced voxel engine and open-concept gameplay. But, every month thereafter I'd look at the various PC game sales sheets in the back of PC Gamer, and I never saw Z.A.R appear there, or ever on store shelves. To my knowledge, it was never released here, and for 18 years I wondered what happened to this game. At least now that curiosity can be put to rest; so after 18 years, how does it stack up?  It's very much a game of its time. It's something akin to Terminal Velocity meets Terra Nova: Strike Force Centauri. You play a soldier airdropped into each level. Each level consists of a terrain type, one or more objectives, and ammunition scattered about sparsely over the play area. Missions range in type from search &amp; destroy, defending a point, or escorting a convoy of transports.   How you go about accomplishing your objectives is completely up to your own approach, but the fact that weapons and ammunition are scarce, means that there has to be a bit of planning in terms of your rationing of supplies. Do you waste those rockets trying to down aircraft bombers that have you targeted? Or do you use your machine gun and save the rockets for an enemy spawn-point? Herein lies half the difficulty of the game, and you're never shortchanged, you're always given just enough to approach and succeed however you desire, but it's not a cakewalk. You'll likely be limping along at the end of each mission...   Which brings us to the other half of the difficulty; there are no health pickups save for very minute energy packs dropped by the enemies you fell. This means that you need to be fast, accurate, and keep moving if you want to survive without taking massive amounts of damage with little way to replenish your health-- because the enemies in this game don't whittle you down; a single rocket can easily knock off 75% of your HP. Sometimes, it's almost punishingly unfair when you spawn into a mission with multiple enemies locking you down, meaning you need to be alert and moving before you're even able to get your bearings. Luckily, you don't lose anything by dying and retrying the mission, as your loadout resets to nothing with every new map anyway.  The maps are a mixed bag. Some maps do inventive, awesome things: One map, for example, has the player assaulting a stronghold situated on an island, and the only way to storm it is over thin ice. However, the island's defenses include grenade launching pods, and as you start to assault across the ice, the grenades begin blasting the ice apart (showing off the game's terrain deformation), making it all the more likely you'll fall through into damaging ice-water. Another map has tides that roll in and out, exposing more land and more enemies that were concealed in the water. Yet another has a trench with supplies inside that slowly pumps full of, then empties of toxic sludge, giving you limited windows to restock your ammunition before it fills up again.  But for every exciting angle, I eventually ended up feeling like too many map scenarios were repeated, with only slight variations on a theme. They all end up boiling down to 'spawn, walk across mostly empty terrain, scour for ammo, shoot the bad things and keep the good things alive.' Which, you know, taken in context of a game from 1997 isn't all that awful. The game ultimately tries to be something more than just another corridor shooter as was so popular for the time. It joined games like Rebel Moon, Terra Nova, and Terminator: Future Shock in being more about objectives and missions than just about indiscriminately shooting-- and it's not like the variety of mission types was anything close to standard at the time.   But, that criticism is based on judging it from a 1997 standpoint. It's no longer 1997. In terms of games today, it's going to feel sparse and empty. It's not easy to aim when all the objects are sprites despite a fully 3D voxel engine. The physics are slippery and muddy (especially so on the ice levels, but that's intended). The maps wear too thin and end up repeating themselves for the sake of making the game longer; they feel like filler. But beyond all those criticisms, there is fun to be had in Z.A.R. The challenge is engaging and rewarding, skirting by with 10 HP and a single round of ammunition left me with my adrenaline pumping in a way that felt like I was able to pull it off due to my own skill and rationing-- not game mechanics designed to keep me from losing. Playing Z.A.R gave me a sense of overcoming challenges, just on Normal, that I haven't felt from a game like this in a long time.  18 years was worth the wait, despite its flaws, and I'm glad to have played it.  Recommended, especially for those who are fans of old-school shooters.",
            "review_score": "1"
        },
        {
            "review_text": "In 1997 I got a disk in the mail labeled 250 Arcade Games, with this being one of the games. It's a fun retro shooter that still holds up well in my opinion. My only complaint is that you jump really high and take fall damage from your own jumps.",
            "review_score": "1"
        },
        {
            "review_text": " It's crap, and that has nothing to do with its age.",
            "review_score": "-1"
        }
    ]
}