{
    "app_id": 352160,
    "name": "Curse of Mermos",
    "release_date": "2015-06-23",
    "developer": [
        "TEAM101"
    ],
    "publisher": [
        "TEAM101"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 152,
    "negative_ratings": 119,
    "price": 0.0,
    "description": "Curse of Mermos is a free, lighthearted hack and slash game with fast paced action and challenging combat. Players wield the Hammer of Horus or shoot the Crossbow of Neith to defeat hordes of monsters in the tomb of Ebo. The game features unlock-able abilities and skill upgrades for personalized combat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/352160/header.jpg?t=1447369631",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: Intel Dual Core or equivalent Memory: 2 GB RAM Graphics: NVIDIA Storage: 250 MB available space Additional Notes: Gamepad highly recommended",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game is fun, free, but most importantly, very difficult.  As you progress through the game, you will encounter more and more difficult enemies. For example, an enemy you can't hit, until it slams it's shield onto the ground. However, once those same shield enemies clump together, it becomes very difficult to kill them. There are also enemies that heal their allies, two different ranged attackers, an enemy that rolls near you, in droves, and blows up, an enemy that throws flame AoE at you, and small critters.  The game became very fustrating towards the end, which was at wave 29-30. You are expected to retrieve 3,000 souls, which is a lot. You will be engulfed in flames, shield slammers, enemy healers, and lots of explosive enemies.   I was terribly, terribly destroyed and I ended up quitting on my 5th try on completing the wave, where I must retrieve the 3,000 souls. I have yet to complete the game.  I do not recommend this game to casuals, but those who are willing to experience a game that will challenge their gamer minds.",
            "review_score": "1"
        },
        {
            "review_text": "Really simple hack and slash game. Still managed to die 10/10 gg. (Don't forget to buy pots) The real rating I would give this game considering its free and a ok game I would give it 6.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "stop at lvl 23 because too much and too less HP for an archer ! Good animation anyway ! Boring music with a lame game play ! anyway, good with educational use only: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Kinda slow at first but then REALLY picks up later in the waves. It gets pretty hard around wave 20. Graphics are a bit cartoony but thats what makes the game cool. Controls are a bit funky and hard to get used to in the first 5-10 minutes of playing but then you get used to it. Aiming has some issues and should be fixed .. even while holding strafe and locked on i still end up shooting behind me or to the side instead of what im locked onto .. but other than that its a pretty cool game.",
            "review_score": "1"
        },
        {
            "review_text": "It's free...and fun!",
            "review_score": "1"
        },
        {
            "review_text": "For a free to play game, solely designed for educational purposes, it's a simple cute little game. You are a gravedigger (or robber or some ♥♥♥♥) and you find a mummy of some sorts. He tells you to defend him (or actually slaughter the little creatures inside the tomb) so he can be free. He tells you that he will reward you if you ever manage to release him. By killing the small things.  Unfortunately I didn't play that long because the controls were a little clunky and I found the game a little too hard and not worthy of the effort I would put in the game in order to master it.  Pros:  + skill tree (kind of) + cute graphics + simple goal (slay monsters and level up towards an aim) + you can upgrade your ♥♥♥♥  Cons:  - gets repetetive easily - there is not much to it other than clicking left and right mouse buttons - the movement and aim is really weird (clunky controls overall)  Graphics: 7/10 quite good for such a game actually Sound: 7/10 (menu music is nice duh) Controls: clunky 4/10",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE this game! So fun and challenging! I definitely recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Good game don't know why people give it hate very fun and replayable. The graphics are nice for a Free2Play. No buy system for real money so it's free comeplety. Wave system and buy system for upgrades. And it's cartoony.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, free, and difficult. Controls are good if you have a controller, if you dont then I wouldnt bother.",
            "review_score": "1"
        },
        {
            "review_text": "It was a fun game. :)",
            "review_score": "1"
        },
        {
            "review_text": "this game was OK the aiming sucked so you pretty much died everytime 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Overview:  Curse of Mermos is a fun little hack/slash/shooting game. You basically play as a mummies ♥♥♥♥♥ collecting items and killing relentless wave after wave. The objective is simple - collect the souls, make yourself stronger, and continue to collect more souls.  Pros: 1. It's completely free, not even an in game option to buy anything with real currency. 2. The controls are simple. 3. Graphics are clean and cute. 4. Low Requirements. 5. Combat is fair, nothing too ridiculously unfair/annoying.  Cons:  1. Buggy/Glitchy; you can roll through/out of walls and sometimes shots go through an enemy, like the exploding enemies and scarabs. 2. Upgrade system/Glyph system while nice, are very limited and few options. 3. Soul collection radius is low, even with the glyph that increases radius. (You basically have to walk over each tiny soul)  4. There's no saved progression... (Main reason I'm giving a negative review) 5. Gets repetitive as there's only one map you're ever on.  End Note: I'm not sure why people complain so much about the controls... I got to wave 28 in about an hour and a half using keyboard/mouse. While it would be easier to aim with a joystick - strafe has a 'lock on target' type of effect which means you don't really have to aim yourself. After I reached wave 28 I exited to try and re-open with a lower resolution, because there were a lot of monsters in the wave and I wanted to make sure it was as smooth as possible... when I got back on I was level 1 again. Maybe you're into restarting/starting over, however I enjoy progression and with 0 save option it really left a poor taste in my mouth. If you're looking to kill time once or twice this would be the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Great for a free game but no save feature :(",
            "review_score": "-1"
        },
        {
            "review_text": "Curse of Mermos is a game where advertised to be multiplayer, but has to face waves of neverending spiders, with no way to win, especially, with a keyboard. ------------------------------------------------------------ Controls are horrible on the keyboard. Moves like you are in a coma. Horrible speech dialogues. ---------------------------------- 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game to me is absurd although it may be because im playing with a mouse and keyboard its still ridiculous the auto aim is extremely bad and its hard to do levels later when the game decides to spam over 8 healers that either keep healing themselves or other things and its almost impossible to hit the healers later as there over 3-5 big tanks that come after you that block every shot you throw at them to be honest its a good game but the over dose of healers and tanks are just a ridiculous combo that makes the game almost impossible to play in later stages",
            "review_score": "-1"
        },
        {
            "review_text": "Recommended : Not, You shall not pass  Reasons : - by hack'n'slash, i expected Torchlight-like game. But it's only arena where you have to fight waves of mobs (Hero Siege-like). - no multiplayer for fun - gameplay not good - rare items in-game - boring as hell  Except if you like Hero Siege, waves mobs to kill in arena, or you depend on free games, save your time because there are lots of better FTP on Steam.   This game is educational : it's first game from Team101 (Thx to Berserk in comments to gave me that info). Let's see if in future they will do better job.",
            "review_score": "-1"
        },
        {
            "review_text": "game can't be saved, but the gameplay itself was okay when i played it on controller for a bit.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this was an awesome game, but when i couldent find a place to save and had to start over from the beginning from scratch... I deleted this game without hesitation.... ugh not amused at all... why!",
            "review_score": "-1"
        }
    ]
}