{
    "app_id": 352620,
    "name": "Porcunipine",
    "release_date": "2015-05-21",
    "developer": [
        "Big Green Pillow"
    ],
    "publisher": [
        "Curve Digital"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "4 Player Local"
    ],
    "achievements": 30,
    "positive_ratings": 81,
    "negative_ratings": 16,
    "price": 6.99,
    "description": "A party game / arena fighter where balding porcupines with only a single quill left fight to the death for honour, glory, and their enemies' skulls!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/352620/header.jpg?t=1447369781",
    "minimum_requirements": "OS: Windows Vista or later Processor: 1Ghz Dual Core or higher Memory: 1 GB RAM Graphics: Integrated or higher Storage: 320 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Excellent couch game and also a good single player game! Easy to pick up and play but hard to master.   Gameplay is a big hilarious anarchy on the screen but skill is required to predict the trajectories as spikes fly everywhere.  Many game modes and interesting achievements to grab. Package is small and comes with a decent price tag.   Just for single player the 9.99e price is tad high but even a bit discounted it is easily worth even as single player.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, cute looking party game that has the gimmick that you will get killed by your own shots a lot. It does not have a lot of depth, but it's okay to play every once in a while, especially with kids or people that aren't gamers.",
            "review_score": "1"
        },
        {
            "review_text": "When you have no other way to dodge than moving at normal speed, have 8-way directional aiming and can only throw your horn once (having to wait for it if it misses), you are in for a boring game session.",
            "review_score": "-1"
        },
        {
            "review_text": "The more people, the better the game. It pretty funny to be drunk and playing this game with friends. I just wish and hope they undate the maps. This game feels like it's missing something, but overall it's a great game to play with you buddys.",
            "review_score": "1"
        }
    ]
}