{
    "app_id": 352700,
    "name": "Subspace Continuum",
    "release_date": "2015-07-03",
    "developer": [
        "Virgin Interactive Entertainment",
        "PriitK"
    ],
    "publisher": [
        "Subspace Continuum"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Online Multi-Player",
        "MMO",
        "Cross-Platform Multiplayer",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Action",
        "Casual",
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "Action"
    ],
    "achievements": 1,
    "positive_ratings": 389,
    "negative_ratings": 54,
    "price": 0.0,
    "description": "THE legendary free online multiplayer space shooter! Addictive, fast-paced, easy to learn, and impossible to master.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/352700/header.jpg?t=1543784055",
    "minimum_requirements": "OS: Windows XP Processor: Intel 2 Duo Memory: 64 MB RAM Graphics: Any DirectX: Version 5.2 Storage: 101 MB available space Sound Card: Any Additional Notes: For Windows 8+, under Advanced Options, check the following to fix performance issues: Software Emulation, Avoid Page Flipping, No Framerate Limit, Disable Clipping.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game has taken up 12 years of my life and given me dozens of lasting friends in the process. Incredibly fun game with the best community on the internet.  Edit: Reasons  Pros:  Entirely community driven servers, content, and events. Several different Zones (servers) with very different playstyles, events, graphics. Amazing community. A specific lack of 12 year old CoD kids.  Cons: Very old. Some may not like the graphic style. For the same reason as above, the community is dwindling in recent years. Large barrier to entry, could be overwhelming. There's a lot to learn from text commands to chat commands. Also a huge learning curve on the game's controls. There's a lot of buttons.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and easy to pick up. Great community that has been keeping it going forever. Definitely worth picking up and trying.",
            "review_score": "1"
        },
        {
            "review_text": "I have put more than 900 hours in this game in the past, definately one of the best games I've played in my early teens :)  The game is easy to pick up but very hard to master, that's what I like about it. Every zone is different also, differrent ships with different stats/weapons/abilities.  The only zone I ever really got into was SSCU Death Star Battle though; it's fast paced and I like the way the different ships work, very balanced imo (and no 1shot kills like in Trench Wars for example) - But unfortunately there's not a lot of players these days :(",
            "review_score": "1"
        },
        {
            "review_text": "This is a completely free game with no microtransactions. It's a 2d massively multiplayer spaceship game with lots a different servers with variable gameplay and graphics. It also has squads (which are like clans) that you can join and participate in competive leagues. It's a very small download so if you're remotely interested give it a try and see what you think.",
            "review_score": "1"
        },
        {
            "review_text": "This game means so much to me that I cannot really describe it in just words to do it justice. All I can say is I am glad we finally did it guys congrats. Now it is up to the newbies. For me this has been oh so much more than just a long 16 years, oh so much more.  Long live Subspace Continuum and all the bests for its future.  iyui/AlienC signing out.  peace",
            "review_score": "1"
        },
        {
            "review_text": "Have been playing this game for about 14-odd years. The game is wonderful but it's the community that really makes this game special. There's a reason why this game for been around for about 20 or so years. Give it a go guys! -NaiLed",
            "review_score": "1"
        },
        {
            "review_text": "This game is somewhat easy to pick up, but hard to master. People have been playing this game for a while and spent crazy amounts of time in it, why? we don't have p2p, or some other BS. it's all skill.   There are different kinds of zones, some are T v T, FFA, Flagging (static flags (point domination) and movable ones) and events. Hell, I've even seen someone modify a server so much with bots they built an RPG (Mystic kingdom).  You have 8 ships to choose from, each with it's own playing style.  You can have squads (clans), chats, banners(small images next to your ship), and the best thing of all LEAGUES!   This game is international, you can meet people from Europe, Asia, South America, etc, since game is somewhat simple, you don't really need to segment a zone (server), it works great!  I would say this is the Quake 3 arena of shooters,  Extreme games in particular has superior settings to any other zone.  Zones are player run, there's no corporate entity pulling strings for some profit or appeasing a board of stake holders, there's no profit here, it's all for the game.  Development tools are free, forever. If you don't like a zone, shut up and make your own. Make your own maps, and make your own bots. Shape a zone just the way you like it. Bots are availble in a number of programming languages, I've seen frameworks built on C++ (Mervbot), Java (TwCore), Python (Pythoncore) and modules for an alternative server written in C and Python (I think) (ASSS).  As a personal note, I no longer play as much as I used to, family, friends etc come in the way, I like the community, it feels like you can speak your mind without fear of censorship, I've made some friends and I still chat with them from time to time. I was also able to do some software development, helped build and maintain a zone (honing online community skills), designed websites and banners and was part of very fun leagues for a while.  If you like, communities, arcade style, 0 BS, games, you might want to give this game a try.  If you're all for the graphics, or storylines, context or hand holding, this is probably not for you.  YMMV  First alias:  Total Usage: 1386 hours 0 minutes First played: 2-11-2005 4:23:28  Second Alias: Total Usage: 2183 hours 34 minutes First played: 2-5-2007 22:46:37",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! I've played this game for 11+ years now and it never gets old! Other games have come and gone but I've always kept coming back to Continuum for more!! Extreme-Games is the best zone!",
            "review_score": "1"
        },
        {
            "review_text": "I spawned with a warbird. Some idiot flew up to me, and got killed once i accidentally pressed the fire button. Then I did a trenchrun on the deathstar, zapping past a few opponents. Then got killed by a bomb which someone randomly fired.  11/10 would get bombed again!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made, which is really saying something, given it's age. Let the hundreds of dedicated players, still playing it 20 years after release, stand testiment to it's greatness. If you're still pondering downloading this game, go ahead and give it a click. It takes all of about 10 seconds to download (80 seconds @256kb/sec) plus some other, short download times in game. It's taken me longer to write this review than it takes to jump in and start playing.  Now if you're looking for more helpful information, here's a brief summary of the most populous zone (and my personal favorite, SSCU Trench Wars. Trench Wars gameplay consists of all 8 ships in a coordinated basing match, with the goal to capture and hold a flag located at the top of the base (North of where you spawn) for 3 minute blocks. This public arena alone can capture your fascination for hundreds of hours.  The ships are also based on different units one might find in trench warfare. After entering the game, press one of the following key combos to play: Esc + 1 : enter as Warbird, the sniper ship. Warbirds strong bullet kills every other ship with a single shot. It's fluid movement also makes it the most popular ship in the game. Esc + 2 : enter as Javelin, the grenade ship. Javelins (javs) have a bouncing bomb, making them one of the most fun and dangerous ships in a basing match. Esc + 3 : enter as Spider, the Machine gunner. With the ability to spray many bullets very quickly, spiders are most effective in pairs, where they can quickly take apart an entire team. Esc + 4 : enter as Leviathan, the tank. Leviathans (levis) have a single ultra powerful bomb, which decimates everything in the explosion radius. But they're so slow, you have to be exceptionally talented to make it to base! Esc + 5 : enter as Terrier, the supply truck. Terriers are the fastest ship in the game, responsible for supplying fresh troops to the battle. Players can attach by having the terrier's name ticked in the F2 menu, and pressing F7. Esc + 6 : enter as Weasel, the spy. Weasels can fully cloak, sneak into the enemy's base, and surprise attack! Esc + 7 : enter as Lancaster, the shotgun infantry. Lancasters can multifire, making their shots almost impossible to dodge! Esc + 8 : enter as Shark, the minesweeper. Sharps can repel enemy bullets and bombs away, as well as leave mines for careless enemies to slip into. But be careful, they have no bullets! Beyond pub, there are literally hundreds of additional events, and several unique, thriving competition leagues. But you've done enough reading for now, get in and play!  Also, my in game name is WillBy, if you see me, be sure to say hello! ",
            "review_score": "1"
        },
        {
            "review_text": "Got super excited when I seen this was back. Haven't played it in many, many years.  Everything looks the same, and plays the same, from what I can tell. Awesome, right? Weeeellll, after only a couple short hours, I remembered why I stopped playing. The only players that seem to play the game, are the elite. A lot of the same ones that I remembered(had the same player names, anyway), who use to dominate the game before, and made it no fun for everyone else. Even after I told them I was new, they laughed and continued to camp, and I was never alive for more than 5 seconds. Most times, never even getting a shot off. And you can forget about killing anyone yourself.  A couple hours of that, not even enough time alive to grasp the controls completely, and I had enough of getting farmed. The game use to be really fun, when the servers had dozens of players on them, and more, at a time. Granted, I may have been playing during a slow time this time, or something. And with more people, the pros wont stand out as much. But if they keep completely, and utterly destroying new players as they slowly trickle in, the population isn't going to get any better. Thats why I stopped playing years ago. The pop started declining, and the top players made it unplayable for everyone else.  The game is great, and -can- be a lot of fun. But you better have a lot of paitence, and get real good, real fast. I'm simply a casual gamer, I'm never the best in any game I play, and losing can still be fun. But not like that. I'll try it out a couple more times, but I don't expect it to get better.",
            "review_score": "-1"
        },
        {
            "review_text": "Ive played this game for 12 years, and have made many friends along the way. Infinite playability with an absolutely fantastic community of players. Once you get the swing of things, there are not many games more addicting then this one.",
            "review_score": "1"
        },
        {
            "review_text": "Its like someone took the game asteroids, made it multiplayer and vicious :D   Best game I've ever played by number of hours I've put into it...over 4000!",
            "review_score": "1"
        },
        {
            "review_text": "Started playing this in 97. It was like Atari Asteroids on steroids. Clock me in for over 4000 hours.   Everyone playing this game in the 90s was an early net adopter. Learned how to code HTML in notepad to support the community with websites. They taught me how to use photoshop, manage volunteer communities, and blow up little spaceships.   Was the first kid in my town that could build well on the web, Started my own company from that self-taught skillset. I blame this game for the start of my career.   10/10 would channge my life forever again.",
            "review_score": "1"
        },
        {
            "review_text": "Since IRC is gone, I needed something to fill the void. Subspace Continuum chat client not only successfully fills it, but it even keeps you entertained on the side with a minigame of spaceship warfare attached!",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game way, way way way back in the day. But now that's it's on steam, I'm hoping for new life to be breathed into this game. Way to much damn fun and I'm pretty sure it's what gave me a raging case of PC gaming.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game. Installed it because of nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game on a dial-up modem .... thats one of those things that connected to the Internet over your phone line .... no, no, no, no, not your cell phone! Those antique phones you see at the flea market that connect to your wall, those phones. Yes, you could connect to the Internet with them! And no, old timer, thats not DSL. At 56Kbps (that's Kilobits, not Megabits kiddos) you can still enjoy a fine multiplayer experience here. Trench Wars Forever!",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever, still going strong after a million years.",
            "review_score": "1"
        },
        {
            "review_text": "This game on trench zone when using WarBird:   10% Skill to actually move  90% Luck when shooting randomly at foes   ",
            "review_score": "1"
        },
        {
            "review_text": "I started playing this game in 1997 on a Pentium 166 MHz computer with a 33.6k modem. I played regularly until about 2003. I am happy to see it on Steam and even happier that it is truly free to play.  Pros: 1. It has no DLC and no microtransactions. There is no way to spend your money on this game even if you tried. 2. The player community is friendly and made up of older adults. 3. Low system requirements; can run in the background while another game is running.  Cons: 1. You have to play multiplayer against master players who have been playing this game for 20 years. Good luck! 2. The arrow keys on your keyboard will get worn out.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, played since 2004. Don't expect much for graphics, but there's a friendly community, and it's a complete test of skill. No scripting at all!",
            "review_score": "1"
        },
        {
            "review_text": "This game defined my gaming life for a VERY long time. This is one of the best games I have ever played.   Total usage: 5000 fricking hours of play time! this is simply insane...  I have spent more time playing this game than any other game.  Really fun and easy to pick up. Great community that has been keeping it going forever.  Definitely worth picking up and trying!  Zones Recommended: Extreme Games and Trench wars.",
            "review_score": "1"
        },
        {
            "review_text": "A recurring space adventure since 1999.",
            "review_score": "1"
        },
        {
            "review_text": "Invalid user name, password?! or allready in use?!.... That means some1 usins my acc. right now???!!!!.......",
            "review_score": "1"
        },
        {
            "review_text": "My friends... who are very good friends but bless them... they didn't have much. This was their goto game going through high school and our early 20's when they managed to even has access to a computer at all. And to this day, it remains a game very close to them. And through all of these years they have tried to get me into this on many occasions.  Besides other reviews that talk about the complexity of an outdated command structure, the inability to rebind keys and old school vets who dominate the game and destroy new players (which are all viable complaints) I feel I have a unique perspective on this game having been exposed to it for most of its life without having played much of it at all.  This is a game that is only marginally good if a few conditions are met and can be easily figured out by asking yourself a few questions. 1. Are you in your teenage years? Meaning you are not set in your ways, have plenty of time and the ambition to learn a game with fustrating controls and a high learning curve? 2. Do you lack in finances? Are you in a spot where you can only afford one game or less a year?  If you answered yes to all those then go ahead, give this game a shot. People in their mid 20's or older, unless having a lot of experience with the game already, should steer clear. It's a waste of time. If you work for a living and have access to any sort of entertainment budget your better of using the ol' 'You get what you pay for.' theory of thinking when it comes to this game.  It's only selling point is that it is 100% free. It will only cost you time. It does have an addictive nature, as I have seen in my close friends over the years, but I imagine it only gets to that point if you do have a lot of time to invest into learning such a game - which is why I think this is best suited for teenagers that have a lot of free time.",
            "review_score": "-1"
        },
        {
            "review_text": "Asteroids with PVP",
            "review_score": "-1"
        },
        {
            "review_text": "The worst game I have ever played every time I try to fire it sends me to chat. The community ignore, Worst game I have played 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "10/10, would forgo life responsibilities to play this again.  The short of it? You missed the bus, but still give it a weekend of playtime. Play Chaos Zone, Trench Wars, and Death Star Battle to get a decent taste of what this game can offer. I never got bored with the variety of game modes created by players. From late 1996 to around 2010, I have somewhere around 15,000 hours logged across the various billing servers -- half of which aren't even up anymore.  This is, as it's widely stated here, the original MMO. It was playable on a sketchy 9600 baud modem, and was the natural progression from games like Tyrian and Raptor. It's not a terribly difficult game, however the human element can make it frustrating to learn. It's best to get into the game using SVS -- Standard VIE Settings. Chaos Zone is the only viable option at this point. Trench Wars, DSB, and Extreme Games are excellent zones but ♥♥♥♥♥♥♥ize the gameplay quite a bit if you want to learn the ins and outs of the game.  This is a top-down shooter for 30 or 35 people in one arena at a time. Teams are divided into 'frequency', ranging from freq 0 to freq 9999. All freqs above a certain number are not publicly visible, so the larger freqs are generally the groups of friends or squads terrorizing the arena.  The gameplay is simple, yet surprisingly deep for a 2-D shooter. Each zone has full access to every game parameter, and can modify all settings per-ship. Acceleration, turn speed, bullet velocity, energy usage and recharge rate, starting item counts and maximums, EVERYTHING.  The graphics - functional. Largely unchanged since the late 90s, unless you find yourself in a zone where they use custom tilesets and sprites. The game does not feel aged, so there's a plus.  The audio - clear. Again, largely unchanged since the late 90s. Since most audio clips are very short and there aren't a lot of varying effects in the game, they are high quality. Everything is clear and unique enough where you can almost play the game by sound alone.  The community - not sure anymore! It was the last welcoming multiplayer game I've ever played. I only find myself dueling whenever I fire it up these days, so my exposure is minimal at best. The fact that the game still exists shows that the community is still excellent. All zones are player-run at this point. Continuum as we know it is actually player created from the old game, SubSpace.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games from my childhood... now on steam!",
            "review_score": "1"
        },
        {
            "review_text": "For the 'Older' player. Few people younger than 30 will be satisfied with the dated graphics - but that is a Bonus! Let the children go for the newest flashy game - and let the Adults have some serious FuN! Subspace is where you will find serious players who have been having fun with the friends for Decades. Many different zones accomidate to various play-styles making the game uniquly satisfying to a wide range of players. Go to the many sub-zones and chat with the core players and you will soon be directed to the perfect zone for you.  So when you are done with fooling around with other games - Welcome Back To Subspace!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this game for like 10 years on and off. Community is still top notch.",
            "review_score": "1"
        },
        {
            "review_text": "This is, and always will be my favorite game of all time. I grew up on this game in the 90's. I will always end up coming back after months of being inactive. I love this game. I suggest continuum for all people of all ages!",
            "review_score": "1"
        },
        {
            "review_text": "So simple yet so addicting. I've been playing for over a decade and I still enjoy it.   You control a variety of space ships with different abilities and you have fun killing each other.  There are several different zones and each of them changing how you play.  They also have events where you can do stuff like Trivia, Pictionary and Scrabble.  Have fun, meet some people, come back in 10 years and they'll still be here.   See you in Trench Wars!",
            "review_score": "1"
        },
        {
            "review_text": "i played this game back when it was new and got the ♥♥♥♥ kicked outa me by the pros.  i just played it again and got the ♥♥♥♥ kicked outa me by the pros. but after about 50 pitched bettles i started to get more kills than i got. this is a game of skill. you will die alot as a noob but its worth it.  10/10 will waste another 3 years on this game",
            "review_score": "1"
        },
        {
            "review_text": "Played this game 16 years ago when it was super popular. Glad to see it on Steam now. Very easy to just jump into and play. Every 'zone' is different as in the ships are calibrated differently, every map is different, and there's multiple ways to play. Favorite zone is T3 the Gauntlet. Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "I first installed SubSpace in 1995 and still play from time to time. One of the best gaming experiences I've ever had. Very steep learning curve, but learning is a very enjoyable experience once you get the hang of things.  Give it some time; it will take a while to get used to the way the game works, but once you master the basics, it becomes a wonderful experience.",
            "review_score": "1"
        }
    ]
}