{
    "app_id": 352850,
    "name": "DGU: Death God University",
    "release_date": "2015-07-15",
    "developer": [
        "DSK Studios Pvt. Ltd"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 16,
    "negative_ratings": 18,
    "price": 6.99,
    "description": "DGU is a 3rd person 3D adventure/puzzle game where the player plays as a student of the Death God University studying to become a death god assistant.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/352850/header.jpg?t=1470925536",
    "minimum_requirements": "OS: windows 7/8 64 bit Processor: Quad-core Intel or AMD, 2.5 GHz or faster Memory: 8 GB RAM Graphics: NVIDIA GeForce 470 GTX or AMD Radeon 6870 HD series or higher DirectX: Version 10",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Do not buy, crashes to desktop when trying to start first mission after tutorial. Several people posted on forums about it zero dev response. Will update when/if dev ever decides to change it so that they are selling a working game and not just a tutorial.  Update, issue has been fixed and not finding anymore issues yet. Devs going above and beyond to contact and attempt to fix issues. It's safe to say that if you buy this game and have a problem that I have yet to notice, devs do check forums and work their butts off to resolve any issues.  Will update further with actual game review once I've had a bit more time to play it further.",
            "review_score": "1"
        },
        {
            "review_text": "  I'm Sorry But I cannot get the game to run I either get a not responding on the splash screen or when I'm doing a new game. From what I saw the game looks great but I cannot get mine to run on my PC its upsetting because I was looking Forward to this game!",
            "review_score": "-1"
        }
    ]
}