{
    "app_id": 352950,
    "name": "Better Late Than DEAD",
    "release_date": "2016-03-03",
    "developer": [
        "Odin Game Studio"
    ],
    "publisher": [
        "Excalibur Publishing"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Survival",
        "Open World",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 252,
    "negative_ratings": 595,
    "price": 3.99,
    "description": "Awaking on an island with no memory, you have just one memento of the life you led before… A child's photograph. Who is this? You must search the island for useful tools that will aid in your escape. As time passes and hopes of survival hang by a thread, you realise that this island is not as it seems.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/352950/header.jpg?t=1528357133",
    "minimum_requirements": "OS: Windows 7/8 (All OS must be 64 bit) Processor: Intel Dual Core 2.0Ghz Memory: 4 GB RAM Graphics: Dedicated graphics with 1GB VRAM (DX9 compatible - Nvidia Geforce GTX 470/ATI Radeon 6900 series or greater) DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7/8 (All OS must be 64 bit) Processor: Intel Quad Core 2.4Ghz or above Memory: 8 GB RAM Graphics: Dedicated graphics with 1GB VRAM (DX9 compatible - Nvidia Geforce GTX 470/ATI Radeon 6900 series or greater) DirectX: Version 9.0 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "The usual Survivor feeling with a lot of gathering. Survive against wild animals. The story line looks kinda promising.   Death means death, which is per se nice, but should not have been implemented before death-bugs were removed. UI feels clunky. Crafting is more annoying than it would need to be. There's hardly any context-information telling you what stuff is or what it does.   All in all, it has potential to be a fun game for a while, but at the current state, it is not worth the full retail price. Maybe at a later state, but not now. You can get better survival games for the same price. ",
            "review_score": "-1"
        },
        {
            "review_text": "Stay away. This is an Early Access-title that the developer decided to release as it was because they either ran out of patience, money or motivation (or all), and not a polished game. It has a story you can complete, but come on; this is not a title you should sell as a full release, nor should anyone be fooled into buying it.   This is just money-grabbing at its worst and an example of what causes players to distrust EA-developers these days.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pretty terrible survival game. First off, the game is super ugly, yet I only was getting 25-30 fps regularly on my high end computer, even with decreased graphics and turning advanced options off, showing terrible game optimization. Theres no map, and nothing of the game is explained. I died because I didnt know I had to go around shaking trees 7x in a row to get items, because why would I since that makes no sense. the crafting menu is terrible, showing pictures of what something takes, but no labeling items needed NOR what you're making (for some inexplicable reason) so its pretty pointless. I went the entire time unable to cook meat because I couldnt find sticks, and unable to find water, because even though I had a water bottle, I wasnt able to fill it with the water all around me. The interaction menu is terrible, as you have to hold right mouse to then click left mouse to interact. Half the time you need to be standing right next to something and looking at it in the perfect way, so you usually have no idea what you can interact with, and of course the game doesn't explain any of its mechanics. The tab buttons shows sometimes what you can pick up, but its hard to see and is inconsistent. The vitals UI is terrible. Running filled up my stamina bar, walking around outside on a tropical island when its not raining filled up my coldness bar, yet swimming in water made it go down (huh?). I had a sickness bar almost immediately going up, for no reason, then sleeping for 4 hours suddenly made it go away. The combat is terrible and you will suddenly be forced into it when you couldn't even see the enemy to begin with, and running away is impossible. Your thirst and hunger bars raise quickly and start killing you pretty soon into the game, in an unrealistic way and amount of time.   All in all, theres nothing positive about this game. Lack of direction, terrible UI and vitals system, bad crafting, lack of mechanics explained, terrible interaction system, ugly graphics, bad optimization, and everything else terrible. If you die you lose everything. I found dying liberating because it meant I could quit this game and never play it again. Sweet freedom!  2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Dear god, I just threw $11 away.",
            "review_score": "-1"
        },
        {
            "review_text": "This isn't a game, it's an unfinished walking simulator. I spent my whole play time searching for something interesting, but all I found were mangos and empty houses.  The game looks all right when you max out the settings, but nowhere near as good as the screenshots look like.",
            "review_score": "-1"
        },
        {
            "review_text": "tHIS IS A WASTE OFF TIME Don't buy this s h i t ,i've play 2h.Many bugs and control are to complicated. Two bears and one wolf,no shark or possibility off fishing.You shake three for looking stuff fall from it and you craft stuff with it but only in a short list.(not realy realistic like you can do with stick+cord+stone to build a hatchet)",
            "review_score": "-1"
        },
        {
            "review_text": "Character controls like a pile of used bricks.",
            "review_score": "-1"
        },
        {
            "review_text": "10.99, no, way too much IMO, in bundle, okay...   All i hope for is more dev support and stuff, looks promising-ish",
            "review_score": "1"
        },
        {
            "review_text": "CANCER DO NOT BUY, ♥♥♥♥ CONTROLS, GRAPHICS, GAMEPLAY AND 'STORY' (Btw played more Offline so sorry for low online hours)",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the time or money.",
            "review_score": "-1"
        },
        {
            "review_text": "8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Runs like donkey poop. Contolss donkey ♥♥♥♥♥. i took a chance on the game its bad  ",
            "review_score": "-1"
        }
    ]
}