{
    "app_id": 353070,
    "name": "Ghost Encounters: Deadwood - Collector's Edition",
    "release_date": "2015-03-13",
    "developer": [
        "Anarchy Enterprises"
    ],
    "publisher": [
        "Anarchy Enterprises"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Hidden Object"
    ],
    "achievements": 0,
    "positive_ratings": 60,
    "negative_ratings": 64,
    "price": 3.99,
    "description": "The town of Deadwood is being terrorized by the ghost of a murderous outlaw in Ghost Encounters: Deadwood - The Collector's Edition!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353070/header.jpg?t=1483583628",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.0 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It took me 2.6 hours to finish this game in +hints mode. It's a traditional point and click adventure with a horror setting.  In this game to make progress in story mode you will have to go through some mini puzzle games like, find the objects, match the objects, match the broken pieces etc and sometimes this puzzle games can be very tiring and repetitive. Like all other point and click adventure game you will have to collect the right item and use it for the right situation. There is nothing new. Story is not that good and voice acting is so-so. But, background music is good. This game's music will give you the horror feeling and it matches with the game perfectly.  In the end I kinda enjoyed this game in my own way. I think its a good puzzle/educational game for kids and they will definitely enjoy this game. To be honest the current price for this game is kinda high. But, buy this game if its for your kid or in sale or in bundle.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game. only 2 hours playtime. some minor translation failures to german and a few bugs on the clickboxes, but over all worth buying",
            "review_score": "1"
        },
        {
            "review_text": "All in all, it's a decent HOG. The puzzles are not hard, and you can figure out most things by yourself. I did experience some of the hit box issues others have mentioned. First, it was mostly objects in my upper right screen (no idea why). Second, I found you can (and in some cases HAVE to) hit the 'empty' area in the center of the object like a necklace or belt rather than trying to click on the object itself. I also experienced a glitch in the last part of the game where I could not go anywhere, but closing out the game completely and opening it back up fixed that, and I was able to complete the game.",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, I think some more time and effort should have been put into this game. As I also work in the industry of games, I was expecting more to it... First, my game was set on French, I would have preferred english, and the translations in French are REALLY BAD. Sometimes I wasn't sure if I was looking for the correct object in the hidden objects.  Also, the hidden objects where you have to find the objects helped by a shape of the object isn't great... Example: When you get a shadowed-item that is just round. You basically have to click on every round object to find the one you were looking for. Sometimes, the item was hard to click on. And also, when the object was revealed, it wasn't drawn completely, which made it look a bit weird, all cropped by the shape of the item in front of it.  Sometimes, it wasn't very intuitive, and the hints are not always really helpful, as they tend to be really vague...   I've seen a few bugs also, text disapearing, weird letters at some places, and wrong text sometimes for some events. Example: Find the playcards! (But the image is a knife, a spoon and a fork, wth?). Or words that didn't translate from english to french. Trouvez les Hammers!   Also, maybe this is personal, but the text in french at the bottom + The character speaking in english was very confusing for me, all at the same time, it was hard to follow.  But, Art is really beautiful! Gratz to the artist!  I recommend this game if it's really cheap, other case no...",
            "review_score": "-1"
        },
        {
            "review_text": "Decent story, but too short. Also, some of the hidden object scenes were quite frustrating because often the objects wouldn't register, even if you clicked on them several times. Took a lot of patience.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a fun HOG. It did bore as things just got repetitive. Plain and simple this game just bored me. When I got to the end I was like thankfully i finished this game. Also u would think the ending would of lead to something big but it just didn't.  The voice acting was not very good, the music was ok does the job for setting a creepy mood, the bg was nice. and the animation was not to good.  But the worst and I mean the worst was that there is no map in this game:( Also the hint button doesn't even point to where u need to go. An example would be like the hint will tell u to find a srewdriver but will not direct u to where the screwdriver is. U have to find that item somewhere. This might be the first HOG I've played that had no map. Since I;ve played so many HOG I can't rememeber if I have played a HOG with no map. Also I have no idea why this is called a collectors edition. There are no extras in this HOG. There is not even map to be worthy to be called a collectors edition.  All in all if u are really bored and just want to play a HOG with easy puzzles then this HOG is for u to play. Also get this on a sale as I did too.",
            "review_score": "-1"
        }
    ]
}