{
    "app_id": 353190,
    "name": "Bombshell",
    "release_date": "2016-01-29",
    "developer": [
        "Slipgate Ironworks™"
    ],
    "publisher": [
        "3D Realms"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Female Protagonist"
    ],
    "achievements": 39,
    "positive_ratings": 182,
    "negative_ratings": 113,
    "price": 29.99,
    "description": "Bombshell is an Action Shooter game in which bomb disposal technician turned mercenary for hire, Shelly &quot;Bombshell&quot; Harrison must strong-arm her way across 4 planets in an Unreal Engine-powered galactic adventure to rescue the president (and humanity) from an apocalyptic alien threat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353190/header.jpg?t=1553947600",
    "minimum_requirements": "OS: Win 7 SP1, Win 8.1, Win 10 (64-bit Operating System Required) Processor: Intel Core i5-750, 2.67 GHz | AMD Phenom II X4 965, 3.4 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 550 (2 GB Memory Minimum) | AMD Radeon HD 7870 (2 GB Memory Minimum) DirectX: Version 9.0c Storage: 10 GB available space",
    "recommended_requirements": "OS: Win 7 SP1, Win 8.1, Win 10 (64-bit Operating System Required) Processor: Intel Core i7-3770, 3.4 GHz | AMD FX-8350, 4.0 GHz Memory: 6 GB RAM Graphics: NVIDIA GeForce GTX 760 - 3 GB Memory Recommended | AMD Radeon HD 7950 - 3 GB Memory Recommended DirectX: Version 11 Storage: 20 GB available space",
    "reviews": [
        {
            "review_text": "This game has like many other games the problem that you as the player are much more prone to notice the flaws than all the things that aren't flaws. Some of the things that every player is going to notice first ingame, is that the enemies in the first part of the game lack a good AI system. The further you play the more they gang up on you though, and the same amount of enemies get a lot harder.   The games upgrade system is very slow paced. This also makes the hostile development slower.  The background and textures are great.  Collision detection seems to be pretty much flawless, aside from the ocassional invisible wall.  The ingame music i great.  The top - down view and open maps promotes dodging instead of urtilizing cover.  Lightning is pretty detailed.  The voice acting is either supposed to fit the slow pace of the game, or it's supposed to give a surreal feel.  I would recommend this game, but only if you can deal with the top - down view.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a very classic feel to it. It's nice to see 3D realms making games again. Is it a perfect game?... No, is it fun? YES! Overall i'm very pleased with the results. Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "Could be a really cool top down shooter, but... This game is riddled with bugs. The cutscenes all stutter with low FPS on my pretty beefy system. The gameplay is sick though. Really smooth and fast paced with cool little things like execution moves. Get this game. Just get it in like 3 months when they have actually fixed it.",
            "review_score": "1"
        },
        {
            "review_text": "Its really quite fun, interesting control scheme that takes a little getting used to and maybe not worth the full asking price, but overall, its not a game you'll be asking for a refund for. It's cheesy, sarcastic and somewhat repetitive with the occasional bug here and there and the UI really needs some polish, but if you like shooting stuff with a mechanical arm, the its certainly worth investigating.",
            "review_score": "1"
        },
        {
            "review_text": "NICE!! Fun....still needs a little work on the shooting mechanic and movement.....next patch should take care of it....lower price and bang on with this 3rd person topdown shooter....with a HOT CHIX!!",
            "review_score": "1"
        },
        {
            "review_text": "Haven't finished it yet, but i can already tell, that this will be an underrated gem of a game, with a great potential for expansion and/or sequel. To simply put it, this is Diablo on steroids, with guns, guts and giggly physics (not so sure about last one, but it sure sounded good). The shift in this Action/RPG is definetely in the Action category. RPG elements feel sorta gimmicky and don't add a lot to the overall game design (which is, for the most part, solid). Speaking of negative aspects of this game, the fatalities. While the idea of brutal finisher moves is fine by itself, it is certainly implemented wrong here. Instead of doing those fatalities fast, intuitive and varied they went with long, flow breaking and boring. To put it simply - they are long and there is not a lot of them, so they get old pretty quick. Interceptor, make them play faster, otherwise they are seriously messing with the flow of the game, to the point that i was ignoring fatalities on purpose. Other notable suggestions to the developers would be adding some kind of sound indication for your ammo dipleeding and a back key on the upgrade menu. Oh and also Russian text would be nice. I, personally, don't have problems with English, but i cannot suggest this game to a lot of my russian friends simply because there is no russian language in the game. And i know a lot of Russian gamers really want to play this game and witness it in its full glory. So yeah those are my humble suggestions so far, hopefully someone at interceptor will hear them.",
            "review_score": "1"
        },
        {
            "review_text": "These review people who are talking ♥♥♥♥ about the game are ♥♥♥♥♥♥♥♥. This has to be one of the funnest single-player isometric action games out so far this year. A lot of people are ♥♥♥♥♥ing because they are mistaking this game for an RPG, which is annoying as ♥♥♥♥. The only small RPG element this game has is gaining xp to upgrade your health, armor, and special abilities, but that's it!  This game has non-stop action, great music, and badass main character. The controls are solid, the weapons are well balanced, and the graphics are top notch. Kind of reminds me of Unreal Tournament in which the atmosphere brings.  Knowing this game coming from 3D Realms, you'd expect the main character to blurt out cheesy one-liners while killing ♥♥♥♥; well you're in luck, Shelly is the female reincarnation of Duke himself! I definitely recommend this game. My only complaint is the soldiers who you help in the game, voice-acting is terrible.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing wrong with this game. I'm having a blast playing it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brought to us by 3D Realms; the studio that brought us Duke Nukem and Wolfenstein. Needless to say; the hype for this game was huge for me because I grew up on those titles. The game is no Duke Nukem, that's true, and it shouldnt be looked at it as though it should be. This is a new title, and Shelly is a bad-♥♥♥ capable of carrying a franchise all on her own. Visually, the graphics are amazing as long as you remember to turn them all the way up (They default to a lower than native res etc). The movement is very smooth, and the transition from Keyboard/Mouse to Gamepad is literally as simple as the click of the button. The fights get to be a bit repetitive after a while, but as soon as you start to get bored of them *BOOM* a giant tentacle monster pops up and ruins your day (More than a few times).  Overall the game is fun. My biggest complaint is a lack of PVP/Multiplayer, but I'm sure a CTF or Deathmatch mode etc could easily be implemented.",
            "review_score": "1"
        },
        {
            "review_text": "Fantabulous! Bombshell isn't some jaw-dropping ground breaking AAA blockbuster GOTY, but it's damn good at what it does, which is to be a fine-tuned engine of carnage and destruction. This is the type of game that used to get me excited in the past, but upgraded for the modern breed of gamer. Furthermore, we have a smoking hot leading lady who proves you don't have to have excessive assets on display to be awesome. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty boring and generic feeling isometric shooter. I'd rather play Hatred than this game.  Execute animations are horrible, repetitive, and slow the game down more than anything. Achievements were also broken after the first one.  I only bought this game because of the announced Build Engine prequel. I have more hope for a deluxe edition bonus item than the core game itself.",
            "review_score": "-1"
        },
        {
            "review_text": "At first I couldn't believe that this game is so bad, then I realized it's the same developers that made Rise of the Triad.",
            "review_score": "-1"
        },
        {
            "review_text": "This review is of the pre-release review copy of the game provided by 3D Realms.  Going into bombshell, you’d be forgiven in thinking, due to its heritage, that you’ll be in for a relentless onslaught of mass destruction and cheesy fun, with characters and tropes ripped straight out of the action hero handbook. Expecting explosions and alien body parts littering the floor as you mercilessly remove every single one of them from the world will sadly leave you feeling disappointed, as it did me.  This isn’t to say that Bombshell doesn’t feature a decent amount of explosive action, featuring a variety of weapons that Shelly’s detachable metal arm turns into. From an average machine gun or minigun to a shotgun, rocket launcher or even to simply detach your arm into controllable vehicle that is otherwise controlled by an AI called Amiga, you’ll have more than a few opportunities to make the aliens go boom.  You can read my full review at   WCCFTech  [wccftech.com] ",
            "review_score": "-1"
        },
        {
            "review_text": "I almost didn't review this because I hate being so negative. But.....  Bought this on a whim, it looked like a nice change of pace.   In the game I immediately wanted to grab my game pad.  Found the Y axis reversed. Apparently this is common in the unreal engine, found a fix online quickly.   Went back into the game. Played a few minutes and it locked up solid with a snow white screen.   Problems noted up to this point were audio issues, like when the level loads, Bombshell is saying something but it's half cut off or garbled. Something about her arm. Since it locked up, I went to bed.   Next day, I ran the game again. Only half my game pad works. I can point with my mouse and move with my gamepad. Quit, and reload the game.   Gamepad works now, just by restarting.   The camera is starting to annoy me. The executions take place off screen. I get to watch feet while Bombshell does some clever kill move I can't see. I'd restart to try and fix, but hey, maybe my gamepad won't work again? I plow onward.  I'm trying to grenade a rafter across a hallway that I blew up yesterday. I can't do it today. Finally I take another route.   Yesterday I noted that the enemies, simply got in line and waited to die. Today they are more aggressive and shoot and surround me which is more challenging.   I get to the first cut scene, and OH MY GOD it's horrible. It stutters so bad the audio desyncs and becomes a garbled mess. Seriously I have a 4.3 ghz quad core with 8gb of super fast ram, a Radeon 285 and my only drive is an SSD. How can a fricken MOVIE, stutter itself to pieces?  I press on.  Hints, or tutorial things are stuck on the screen. As I do each of the tasks, they go away, but one of them I can't get off the screen. Maybe it's gonna stay the whole game.   Using the map I progressed to a column of light. It seemed like a destination or goal. But I could not access it or shoot it. I dunno. I pressed on for while longer, listened to another couple dialogs. They were not to bad, and moved the story along. By this time I was over my tolerance threshold and really just pressing forward waiting for the next bug to rear its head.   Speaking of bugs, shooting is awkward, often you alternate left right about 45 degrees, one bullet going left, one right, missing the monsters each time. It's a weird effect, that I'm probably not describing well. Lets just say shooting is a chore.   I quit for awhile, and when I came back, instead of launching the game, I deleted it.   Sorry, it's just not ready yet. It looks lovely, but it's at best a beta. There's problems and issues at every turn.",
            "review_score": "-1"
        }
    ]
}