{
    "app_id": 353110,
    "name": "Dreamscapes: Nightmare's Heir - Premium Edition",
    "release_date": "2015-03-11",
    "developer": [
        "Shaman Games Studio"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Hidden Object"
    ],
    "achievements": 0,
    "positive_ratings": 64,
    "negative_ratings": 34,
    "price": 4.99,
    "description": "The Sandman came back to take revenge. This time his victim is Tim, Laura’s husband. Will you succeed in pulling him out of nightmare?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353110/header.jpg?t=1553188797",
    "minimum_requirements": "OS: Windows XP/7/8 Processor: 2 GHz Memory: 1024 MB RAM Graphics: DirectX 9 Compatible DirectX: Version 9.0 Storage: 2 GB available space Sound Card: Any DirectX Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Very easy, quick casual adventure and Hidden Object game.  This game focuses more on collecting objects to reach new areas and has very few Hidden Object scenes and puzzles. The HO scenes require little effort as there are few items in scene besides the one your looking for. The story element is also easy as you have a limited inventory and so only few logical choices. Only a few logic puzzles which aren't taxing. The graphics and sound are okay. The story is again okay. The best part for me was finding the cute beholders in the areas, though that was also easy. There is an achievement menu inside the game, most of which you will pick up as you go along without trying.  I played in windowed mode and encountered no bugs. I had no issue with clicking on items. Overall I would give this an okay. Good for crayon eaters.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game! Completed in 2 hours, was quite surprised it was so short. I liked the inventory opening and closing. It looked really smooth. The storyline is quite intriguing as well as the gameplay. I would recommend this game to others!",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to be generous. I know that the HOG industry relies on shovelware and hasty localizations. I tried to be forgiving. But just too many things are wrong with Dreamscapes: Nightmare's Heir.  First, the game is very short. I completed the whole thing, including the Bonus Chapter, in under two hours.   The voice acting is subpar, and some of the translations are rather shaky. The typical supernatural antagonist is particularly sketchy -- his goals and motivations (other than general maliciousness) change every time he monologues.  The ending, and the second ending, after the Bonus Chapter, are both abrupt and unsatisfying.  The HO scenes and puzzles are all very easy, with one possible exception, if you've never encountered the Eight Queens problem before. At least one HO scene in the Bonus Chapter, however, commits the cardinal sin of including multiple objects that satisfy the target description, and demanding that you find the right one.  The video sequences, in fairness, were up to the standard for the genre, and the music was mostly good, with the exception of one ear-grating synth chorus effect.  A few flaws are always forgiveable in this genre, but here, there are just too many. I cannot recommend.",
            "review_score": "-1"
        }
    ]
}