{
    "app_id": 353300,
    "name": "Rooftop Cop",
    "release_date": "2015-03-02",
    "developer": [
        "Stephen Lawrence Clark"
    ],
    "publisher": [
        "Independent"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 7,
    "negative_ratings": 8,
    "price": 2.09,
    "description": "A world of Police that have forgotten what, and why, they are policing. Rooftop Cop is a collection of five endless vignette games and a 7-track album. The games are set on a loose metaphysical timeline in which the Cops slowly lose their way.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353300/header.jpg?t=1447369959",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 / 8 Processor: 1.2GHz processor Graphics: - Storage: 210 MB available space Sound Card: -",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An unsettling buzz, a breaking of sunset through the fuzzy scanlines pulsating through the glow of the screen. Right away the title screen for Rooftop Cops is of a metaphysical order and not a concept we can grasp with our own hands. It's a world and a mental state that exists in already crowded and chaotic headspaces, but it is also oddly calming.  Yes, Rooftop Cop is as strange as it sounds, a collection of 5 seemingly unrelated scenarios with different metaphorical consequences accompanied by some incredible soundscapes and ambient shiftings echoing through your ears and exiting through your soul. The games are confusing, they are slow-burning in progression but that only lends itself to the incredibly strange and disjointed narrative presented. It's not something you play for 'fun', but as a meditative space for thought.  If you don't like games that cause you to think or contemplate, avoid this. If you prefer having your hand held and all of your thoughts served to you on a silver platter then by all means go play one of the thousands of generic action games already on Steam, but if you're willing to dedicate your headspace to a different train of thought, to a form of art with a bit more meaning than just 'video games' then this is one surreal trip worth taking. Close-minded people need not apply.",
            "review_score": "1"
        }
    ]
}