{
    "app_id": 353360,
    "name": "how do you Do It?",
    "release_date": "2015-02-27",
    "developer": [
        "Nina Freeman",
        "Emmett Butler",
        "Decky Coss",
        "Joni Kittaka"
    ],
    "publisher": [
        "none"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Nudity"
    ],
    "achievements": 0,
    "positive_ratings": 2248,
    "negative_ratings": 404,
    "price": 0.0,
    "description": "&quot;how do you Do It?&quot; puts players in the role of an 11-year-old girl whose mother has just stepped out for an errand. The girl immediately grabs her dolls and furtively attempts to figure out how sex works using these plastic surrogates.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353360/header.jpg?t=1447369974",
    "minimum_requirements": "Минимальные: ОС: Microsoft® Windows® XP (32 bit), Windows Server 2008 (32 bit), Windows Vista® (32 bit), Windows 7 (32 bit and 64 bit), Windows 8.x (32 bit and 64 bit), or Windows Server 2012 (64 bit) Процессор: 2.33GHz or faster x86-compatible processor, or Intel® Atom™ 1.6GHz or faster processor for netbooks Оперативная память: 100 MB ОЗУ Видеокарта: 512MB of RAM (1GB of RAM recommended for netbooks); 128MB of graphics memory Место на диске: 10 MB Звуковая карта: Built-in",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Waiting for Oculus Rift support. ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Still better than COD Ghosts",
            "review_score": "1"
        },
        {
            "review_text": "Still Has More Gameplay than The Order 1886! -10/10",
            "review_score": "1"
        },
        {
            "review_text": "had more sex in a minute than i have my whole life 10/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "A kid who just saw Titanic uses her dolls to try to recreate the sex scene with hot scissoring action. That's the whole game. It's two minutes.  Pros:  *Make the sex with hot scissoring action. *You can turn them around and crash them into each other head first. This also counts as doing a sex. *At the end of the game, a screen tells you how many times you've been known to have been involved in sex-doing-activities. * The plasticman sexmaking game is free.  Cons: *Steam overlay doesn't work so I don't have any screenshots of the doll sex. *Steam overlay doesn't work so I don't have screenshottable video game proof that I have probably done a sex.  Summary: Rename this game Do a Sex: Human Procreation.",
            "review_score": "1"
        },
        {
            "review_text": "The premise here is that this kid just saw Titanic and is trying to figure out what the hell happened in the car.  She directly references the sex scene in Titanic in her little speech bubbles as you're flailing the dolls around.  If you weren't a kid when Titanic came out, you miss out on half the joke, but it's still pretty hilarious to flail the dolls around wildly and get a message after about 30 seconds to a minute saying how many times you might have made the dolls have sex. Possibly. Perhaps.",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me more than real life. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You learn allot from this free to play indie game, my teacher couldn't describe this better.   4.20/10 would free to play again - IGN",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Waited till mom left to work so i could bang my two dolls together.  finally learned how to 'do' it.  Did it 41 times in 20 secs.   hands still sore.  10/10 would bang them again.",
            "review_score": "1"
        },
        {
            "review_text": "Now I know how to Do it! Thanks, game! ",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game about the challenges that a young girl faces when the topic 'Sex' comes to mind. I cried, laughed and was somewhat scared when playing this game - the plot is both difficult, intriguing and beautiful when the 3 main characters face the challenges of life. I'd rate it higher but the ending was a massive disapointment - it lacked reason and didn't explain WHY she wanted to know about this.   Overall a 9.3/10 -It needs A BETTER ENDING. I would gladly purchase a sequel though explaining this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant, no longer will I have to pay for cheap hookers. Top Game 9/11",
            "review_score": "1"
        },
        {
            "review_text": "taught me how to do it tbh fam smh not much to say tbh lmao 👌  No but really it's a fun little thing to play around with and just enjoy yourself exploring the world of   doing it ",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 3 couldn't even dream of comparing to something as masterful as this.",
            "review_score": "1"
        },
        {
            "review_text": "Did sex 193 times and didn't get caught.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I think I'm ready for the real world now.",
            "review_score": "1"
        },
        {
            "review_text": "it's alright",
            "review_score": "1"
        },
        {
            "review_text": "I was on the edge of suicide, I had my will planned out and I was going to end my life tonight.  But this game showed me the way, this game is a God-Send.  This game changed my life forever, I can't recommend this game more. It is a lifesaver and a masterpiece.  I had sex 194 times without my mother catching me.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 now i ken hab all the sexes",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how to Do It but I did it 205 times.",
            "review_score": "1"
        },
        {
            "review_text": "One of the wierdest and most fun fps games ever! Some people call it skin simulator and I can see why there are tons of skins from souvenir skins to stattrak skins this game is all about skins!",
            "review_score": "1"
        },
        {
            "review_text": "I made them headbutt each other in the groin until my mom saw. I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "69/10 i had sex 249. better than the real thing",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "made a man shove his head up a woman's ♥♥♥♥♥♥ 10/10 10/10 100/100 BEST GAME BEST GAME",
            "review_score": "1"
        },
        {
            "review_text": "I have to stop playing this game. Even with only two minutes played, I've climaxed 304 times. My desk is floating in a pool of man-cannon fuel. I can't escape my room. My door is jammed shut with man juice and I'm low on food. Someone please send help.  This is the future of porn, ladies and gentlemen.  Spoiler: After playing 20 times, you get a happy meal toy to jump in and make it a three-way!",
            "review_score": "1"
        },
        {
            "review_text": "I possibly, might have, just almost had 179 sex. Give or take 179.   Pros:   Sex Sex Sex Outstanding Detail Unmatched gameplay Deep story Great Mom AI  Cons:  This game has no damn cons, you are crazy and/or do not know how to sex (In that case, this game is for you!)  ________________________ Cant wait for multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "Intense gameplay. Had me on the edge of my seat my whole time playing it. I would recommend this over CS:GO, much more competitive, with a better community.",
            "review_score": "1"
        },
        {
            "review_text": "Fk her right in da pussay.",
            "review_score": "1"
        },
        {
            "review_text": "my mom caught me playing this",
            "review_score": "1"
        },
        {
            "review_text": "Did the sex 107 times Mom didn't see ♥♥♥♥.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is after trying this game, I can officially say I know 'how to Do It,' especially on the Titanic.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece of modern game technology and storytelling. The game opens on a heartbreaking scene of a mother abandoning her only child. You, the child, must find a way to cope with the soul-eating emptiness left in your heart by the sudden disappearance of your mother. Throughout hours of play, I have found myself really getting pulled into the plot of this game, exploring my childhood memories, and expanding my worldview. The graphics are stunning, and it is almost unbelievable that this game was created by a team as small as four people. I'm looking forward to the next piece of innovative gaming from these folks. Overall, I give this game a 6/9. Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Instructions unclear: ended up watching titanic...",
            "review_score": "1"
        },
        {
            "review_text": "goty taught me how to sex",
            "review_score": "1"
        },
        {
            "review_text": "You learn how to 'hug'. I think thats all I need to say here.",
            "review_score": "1"
        },
        {
            "review_text": "Taught me how to do it, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I think that I'm ready now.",
            "review_score": "1"
        },
        {
            "review_text": "  Note: This game contains nudity and sexual themes that is not suitable for ages 0 and younger.   If you want to teach your kids how sex works than this is a game that you might be interested in. This is the only XXX game on steam that is intended for ages one and up. The objective of the game is simple you move your hands around and try to glitch the doll around to get the highest number of attempted sexual intercourse. What the game needs the most is a steam leaderboard so you can compete with your friends on love making. This game features : Immersive one minute sex simulator, educational material to get ready for the real deal, and hot content intended for those who have a fetish with barbie, monster high, or any other doll they masturbate to. I highly recommend it to the 8 year old call of duty players and single lonely gamers who claim on having sex with hot babes, and for regular kids like yourself who want to understand how sex works without searching up any porn. Cost: Free Rating: 100/100 THE BEST EDUCATIONAL VIDEO GAME EVER ON THE MARKET",
            "review_score": "1"
        },
        {
            "review_text": "Though it is completable within a minute, never before has there been a game available on Steam with such a heavy focus on sex. Indeed, this game is a 'sex simulator' featuring two nude dolls you can interact with to create risqué scenarios. Though the controls can be a bit dodgy at times, the music and sound is decent, and the visuals are a treat, making this a fairly entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "Got me in the mood",
            "review_score": "1"
        },
        {
            "review_text": "Though it is completable within a minute, never before has there been a game available on Steam with such a heavy focus on sex. Indeed, this game is a 'sex simulator' featuring two nude dolls you can interact with to create risqué scenarios. Though the controls can be a bit dodgy at times, the music and sound is decent, and the visuals are a treat, making this a fairly entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "I didnt do it:) it was really hard",
            "review_score": "1"
        },
        {
            "review_text": "My mum walked in while I was playing this..    11/10",
            "review_score": "1"
        },
        {
            "review_text": "Forget sex-ed give this game to children to learn 'how do you Do it', it will be very educational.... This game deserves a rating of 69/100.",
            "review_score": "1"
        },
        {
            "review_text": "A+ game. Got a score of 338. Needs more skins.",
            "review_score": "1"
        },
        {
            "review_text": "I get caught by mom. So, What should I do now?  10/10",
            "review_score": "1"
        },
        {
            "review_text": "hottest game on steam. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to this game, gamers now can learn the long forgotten art in their community called sex. It was wise to release it on the most popular gaming platform so more of them will learn",
            "review_score": "1"
        },
        {
            "review_text": "182 highscore, if you beat that I will give you my soul",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know but great game to waste time on 10/10",
            "review_score": "1"
        },
        {
            "review_text": "'A game that seems to shimmer with a profound and galvanising lucidity, a colossus that bestrides all other genres and archetypes to forge its own mark upon the industry forever.'   7/10",
            "review_score": "1"
        },
        {
            "review_text": "The hours spent playing this masterpiece were the perfect encapsulation of why videogaming is such a favourite waste of time for so many of us. Thrilling, terrifying, moving, confusing, amusing, compelling, and very very dark. HOW DO YOU DO IT? isn't simply the sign of gaming realising its true cinematic potential, but one where a game straddles so many entertainment art forms so expertly that it's the best demonstration yet how flexible this medium can be. It's no longer just another shooter wrapped up in a pretty game engine, but a story that exists and unfolds inside the most convincing and elaborate and artistic game world ever conceived.",
            "review_score": "1"
        },
        {
            "review_text": "i aced my sex ed test because of this game and i showed my class how to do it because i was the best in it i am very thankfull for the skills this simulator gave me and i hope my skills will be passed thru the family",
            "review_score": "1"
        },
        {
            "review_text": "Me through the whole game          YouTube™ Video:  Shia LaBeouf 'Just Do It' Motivational Speech (Original Video)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "what am i doing with my life",
            "review_score": "1"
        },
        {
            "review_text": "If you go by the name of Jonathan Ross, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Jokes aside, it is a free game made as a project. Why put it on Steam? Eh, why not. It's literally a girl playing with her dolls, nothing more. If you want to see something sort of funny for a few minutes, it costs nothing and downloads instantly.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the single strangest experience of my video gaming career.",
            "review_score": "1"
        },
        {
            "review_text": "awesome sexes ",
            "review_score": "1"
        },
        {
            "review_text": "Never have I played such a beautiful game with such elegant graphics and a heart-felt storyline. While i was playing this i thought over my decisions in life and how i can learn from mistakes. The morals that this game preaches really stood out to me as i have faced those problems myself. Never have I thought doll sex could mean so much to an 11 year-old. Voice acting was FABULOUS! Starring Famous actors such as: Mindy Kaling as girl Steve buscemi as Mother Jeff bridges as Mental patient 1 Aaron Petestuck as Mental Patient 2 AND MANY MORE!  This game is a must-get for story hungry people. I will rate it a strong 8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Never have I played such a beautiful game with such elegant graphics and a heart-felt storyline. While i was playing this i thought over my decisions in life and how i can learn from mistakes. The morals that this game preaches really stood out to me as i have faced those problems myself. Never have I thought doll sex could mean so much to an 11 year-old. Voice acting was FABULOUS! Starring Famous actors such as: Mindy Kaling as girl Steve buscemi as Mother Jeff bridges as Mental patient 1 Aaron Petestuck as Mental Patient 2 AND MANY MORE!  This game is a must-get for story hungry people. I will rate it a strong 8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to this game, I now know how you do sex. Game of the year 2015.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you so much for this game! Now i know how you do it! I will try it in real like this today. ;)",
            "review_score": "1"
        },
        {
            "review_text": "I think the one thing that really bothered me about this game was the grammar in the title.",
            "review_score": "1"
        },
        {
            "review_text": "a bunch o' weaboos made this game......10 OUTA 10!!!!!11!!",
            "review_score": "1"
        },
        {
            "review_text": "I which a girl makes to barbie dolls act out one of my fan-fics. This can not go well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a breathe of fresh air,  games are too serious sometimes,  I am glad it was free though lol",
            "review_score": "1"
        },
        {
            "review_text": "A tale of a young girl attempting to understand how adults hug. Riveting stuff. Three stars",
            "review_score": "1"
        },
        {
            "review_text": "I dont know wtf this is, no real instructions just wsad and jk to move/roatate the dolls, apparently i done sex 161 times and didnt get caught! Very strange game..",
            "review_score": "1"
        },
        {
            "review_text": "some parents teach kids with online porn others with books and some demonstrate for them this is how i will teach mine 10/10 would make life poor parenting choices again",
            "review_score": "1"
        },
        {
            "review_text": "What have I done?!",
            "review_score": "1"
        },
        {
            "review_text": "Still a better love story than 50 Shades of Grey.",
            "review_score": "1"
        },
        {
            "review_text": "those who do it, learn it!, but i was too young :( message from girl*, the game really depends on your liking of 'taste' , and this one was a little TOO bitter for me, but i'd kinda recomened it.",
            "review_score": "1"
        },
        {
            "review_text": "in this beautiful game, you take on the role of a small girl (11 Y.O. approx.) very enthusiastic to learn what and how to do 'sex' (sexual intercourse) between a male and a female. she's a very intelligent girl, for she knows when to learn, and how to hide it. her mother leaves for any reason, and she begins to think 'how do you do 'it'?' (sexual intercourse)  she goes down to play with her flexible ken and barbie dolls, undresses them, and starts to push them together frantically in any way that you choose. (using the 'wasd' and 'j''k' keys) your goal is thought to be to control them into sexual intercourse as many times as possible without getting caught, and your score is displayed at the very end. it is a very touching story about a young girl learning how to do it, in the classic manner (with dolls) i hope you enjoy this game, for i know i learned a lot from it and found it very beautiful :')",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "w t f did I just see..... how did this make it to steam!?",
            "review_score": "1"
        },
        {
            "review_text": "Someone please stop me.",
            "review_score": "1"
        },
        {
            "review_text": "Steam should put more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game, its really 'educational'... Oh I came... In buckets... And so much sweating... This, is where you can find new positions, unlimited ones, kamasutra? You're ♥♥♥♥. (This one has more, and fun ways...)",
            "review_score": "1"
        },
        {
            "review_text": "This game is good for a laugh or two  But i wouldn't pay for this game it is good that it is free Plus Play it while your alone and if your mom asks say you're watching porn",
            "review_score": "1"
        },
        {
            "review_text": "I am ready. I am ready... TO BREED!!!",
            "review_score": "1"
        },
        {
            "review_text": "I Still don't know how to do it!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing 10/10. still better than the Hitman:Absolution",
            "review_score": "1"
        },
        {
            "review_text": "Health Ed lied to me, now I know how sex is truely performed.",
            "review_score": "1"
        },
        {
            "review_text": "Waiting for multiplayer...",
            "review_score": "1"
        },
        {
            "review_text": "Oh! so THAT'S how you do it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has, by far, one of the greatest stories you will ever experience. And I would sex 227 more times.  The creators place you in a mediocre home. one large window in the front of the home, an average couch, family portrait, lamp. And it begins with your mother, gazing at you in discontent. She sports a rather dull purple blouse and a navy blue skirt. The real story hits you hard at this point. She seems to dissipate into thin air, appearing to drive away in a what looks to be an Audi or Mini Cooper. The young girl watches, waits, stares, looks, observes, sees, and any synonym thereof. She then shyfully, makes her way to her dolls. One male, one female. This is where you, the player, take control of this delectable, ripe little girl. The choice is yours, you smash and rotate dolls in an increasingly curious rush to discover how you 'do it.' The blonde thinks of the sex scene in the Titanic and things her Mimi has told her.  So very fascinating.  Then, her mother returns, which makes you question where she went in the first place. You immediately throw down the dolls and turn around blushing. The game promptly ends and tells you how many times you have had sex.  This game has truly opened my eyes in terms of story writing. I implore you to play this game for a minimum of 24 hours to truly experience how great this game is. It baffles you how much you can learn.",
            "review_score": "1"
        },
        {
            "review_text": "needs to be ported to ps4",
            "review_score": "1"
        },
        {
            "review_text": "Discovered a new fetish",
            "review_score": "1"
        },
        {
            "review_text": "Anyone with over 0.3 hrs you da real MVP",
            "review_score": "1"
        },
        {
            "review_text": "how to have sex as a kid use toys 19 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "This is a true work of art.  This game supplies countless hours of entertainment, multiple endings, realistic physics*, and cutting-edge graphics*. all with a unique story that will drive you to tears**. I highly suggest this game to anyone, as it only takes up a small ammount of space on the computer. VERY small. If you like games like this gem* then play the hell out of it.  *opinions may vary **reasons may vary",
            "review_score": "1"
        },
        {
            "review_text": "I'm a sex machine now because of this game",
            "review_score": "1"
        },
        {
            "review_text": "Its essentially one of those games where you have to do something as many times as possible in 1 minute and try to beat your best score. MINE:189 MARIOBROSROCKS:20.",
            "review_score": "1"
        },
        {
            "review_text": "What am I doing with my life...",
            "review_score": "1"
        },
        {
            "review_text": "Its essentially one of those games where you have to do something as many times as possible in 1 minute and try to beat your best score. MINE:189 MARIOBROSROCKS:20.",
            "review_score": "1"
        },
        {
            "review_text": "Way better than Fifty Shades of Grey",
            "review_score": "1"
        },
        {
            "review_text": "I did sex 140 times and didn't get caught... like when i had a girlfriend and i cheated on her. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "what is sex         YouTube™ Video:  Doctor to Doctor with Dr. Davis | Check It Out! With Dr. Steve Brule | Adult Swim&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Its free",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Learnt many things",
            "review_score": "1"
        },
        {
            "review_text": "10/10 ing would have bang",
            "review_score": "1"
        },
        {
            "review_text": "just wait until she find the old man that give candy she wont need the dolls anymore",
            "review_score": "1"
        },
        {
            "review_text": "Well, I think I'm ready now.",
            "review_score": "1"
        },
        {
            "review_text": "I had done sex 132 times and didn't get caught...  what am I doing with my life",
            "review_score": "1"
        },
        {
            "review_text": "cured my cancer and learned more about sex ed then i did in school    10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is best game ever, i cri everytim i play, it make me so heppy i wan die.... Record is 311 times, Beat that you scrubs",
            "review_score": "1"
        },
        {
            "review_text": "lol best porn simulator 2016 i recommend to play with family and grandmother :) :) :) :) ;p;p;p;p",
            "review_score": "1"
        },
        {
            "review_text": "After playing the game for myself, I ate my sandwch while watching my friends have maybe sex 223 times.  FeelsGoodMan, WutFace.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good. I request balance patch to fix body lag time after 5 consecutive doll humps. Patch needed immediately. I must beat 292 without my mom knowing. GG bro. Use protection always. Good night and safe sex.",
            "review_score": "1"
        },
        {
            "review_text": "Remember when you were little and stole your sister's Barbie doll so you could gawk at her breasts? This game goes a step further by demonstrating, with dolls, various 'special hugging' positions to an 11-year-old girl.  69/10",
            "review_score": "1"
        },
        {
            "review_text": "I found out how you would do it.  10/10 would do it again.",
            "review_score": "1"
        },
        {
            "review_text": "I have the weirdest boner.",
            "review_score": "1"
        },
        {
            "review_text": "There was this moment. We all had it. Maybe age 9. Maybe age 11... maybe even 13 or 7 but golly, it was a rush. We had dolls, figurines, books, pictures.... sometimes just our minds and we wondered, how do you Do It? Do it... that thing that makes you... tingle... not itch but.... below and all over... what is it...  JUST DON'T GET CAUGHT!!!!! Or is Mom just acting like she didn't see you... Maybe you shuld try again...  This is the game... this is real life. This is a simulation of sexual curiosity. Do it to remind youself of how wonderous we all were at young ages.  Not to mention the Sim-like, 90's, video-game music... It'll bring back many memories for 90's kids.  If you have dificulty sleeping, especially with another this is the Kama Sutra Sim you've been needing. Maybe.",
            "review_score": "1"
        },
        {
            "review_text": "Most realistic example of innocence portrayed in gaming...",
            "review_score": "1"
        },
        {
            "review_text": "10/10 WOULD RAM A TACO WITH A HOTDOG AND DO THE SEX AGAIN PRAISE ALMIGHTY GABEN!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I   might have   done the sex 122 times, and   didn't even get caught.  ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would never play again   You should get it",
            "review_score": "1"
        },
        {
            "review_text": "I recommend a GTX 990 intel core i7 3901337 to play this game. A very good game indeed. Would recommend it people who like hardcore survival games.",
            "review_score": "1"
        },
        {
            "review_text": "I'm writing a huge and full detailed guide for this game. Just wait a bit more.",
            "review_score": "1"
        },
        {
            "review_text": "I might have done the sex 146 times  11/10 I learned so much",
            "review_score": "1"
        },
        {
            "review_text": "if you get it over 500 times you get a secret ending ;) but shhh its a secret to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man the plot is great, 10 outa 10 game.",
            "review_score": "1"
        },
        {
            "review_text": "I can say I learned a lot, thanks Obama.",
            "review_score": "1"
        },
        {
            "review_text": "First two times I didn't get caught, but the third time? Eep! Mom saw!",
            "review_score": "1"
        },
        {
            "review_text": "Well after mom left I decided to find out how you Do It. And after a long minute and three seconds that mom left the house in the car and came back within a minute and three seconds in I learned over that I can sex over 200 times in a minute! I hope she is proud of me since I am the best at this now.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, absolutely hillarious please make more of this game, unlike Zoe Quinn, you got popularity from your own steam, pun not intended.  I r8 8/8 m8",
            "review_score": "1"
        },
        {
            "review_text": "Before the game: sad lonely nerd with broken ♥♥♥♥♥  after the game: still a sad lonely nerd",
            "review_score": "1"
        },
        {
            "review_text": "My ♥♥♥♥ is a diamond right now.",
            "review_score": "1"
        },
        {
            "review_text": "I have learned a lot from this education game, it was a heart-warming experience, and it has really spiced thing up in the bedroom. 10/10 will use again!",
            "review_score": "1"
        },
        {
            "review_text": "I might have done sex 210 times. Mom saw, though.",
            "review_score": "1"
        },
        {
            "review_text": "Still Better than Call of Duty",
            "review_score": "1"
        },
        {
            "review_text": "Best... simulator... ever... My eyes have opened to the truth of life!  69/10",
            "review_score": "1"
        },
        {
            "review_text": "This was very informative and helpful, Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Finally, a game that allows me to live out my sexual fantasy of having a blond mannequin woman violently headbutt me in the crotch several dozen times.",
            "review_score": "1"
        },
        {
            "review_text": "Had sex 137 times and tried every conceiveable position. Even did one without holding the dolls and they just floated in mid air vibrating violently together. Besides that, the game is free.",
            "review_score": "1"
        },
        {
            "review_text": "I grabed ther crotches and a smahed them together -blushes- horny game ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "I think I Did It",
            "review_score": "1"
        },
        {
            "review_text": "In an age where games are too long (5 hours? Who has the time??) it's good to see a game that addresses this and can be completed in 1 minute. The graphics have a Dr Katz feel to them and I managed to make the little girl's arms fly off, the lounge piano music is catchy, and I might have done sex 208 times and didn't get caught.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Had sex 137 times and tried every conceiveable position. Even did one without holding the dolls and they just floated in mid air vibrating violently together. Besides that, the game is free.",
            "review_score": "1"
        },
        {
            "review_text": "What goes where",
            "review_score": "1"
        },
        {
            "review_text": "Da scariest game i have ever played ''how do you Do IT'' :) It's a game that teches you how to ***** ********* ***** **** And it worked! :DDDDDDDDDDDDDDDDDD",
            "review_score": "1"
        },
        {
            "review_text": "BEST BOOBZ ON A DOLL I EVA SEEN",
            "review_score": "1"
        },
        {
            "review_text": "i think this games inspires hard sex and love in the ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I got caught by mom she gave ,e the birds and the bees this is 100% accurate 10/10 would bang the dolls again",
            "review_score": "1"
        },
        {
            "review_text": "12/10 best sex. best nudity and best Female Protagonsit. Brings a tear to my eye to see those lovely dolls being forced into sex like slaves.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful tale about self discovery and exploration. It took me back to times when I was 11, I too had dolls and used them to learn about sexual intercourse. Shortly after I began to think about things more sexually. I noticed girls in my class being pretty, rather than being icky and having 'cooties.' One girl took a certain liking to me. We began to hang out outside of school and one day she told me to take off my pants. I wasn't sure why but I did it anyways. It was my first time getting a handjob. I told my friend, and he told my mom like a snitch. Police showed up at my school the next day and arrested my teacher. I miss Mrs. Lidner.  10/10 can't wait for the sequel",
            "review_score": "1"
        },
        {
            "review_text": "changed my life, i learned to sex 420/10",
            "review_score": "1"
        },
        {
            "review_text": "I splurged early.",
            "review_score": "1"
        },
        {
            "review_text": "How do you do it? Well how do you do it, How do you do the do that you do to do it? and how is doing something the do for how you do.. it? or how is it that how you do it, is really how you do it?",
            "review_score": "1"
        },
        {
            "review_text": "How you do it also known as 69 simulator 2015. ",
            "review_score": "1"
        },
        {
            "review_text": "im glad i know how to do the sex now",
            "review_score": "1"
        },
        {
            "review_text": "Undeveloped story line Lack of connection with characters Multiplayer was disappointing Life changing and resourceful   8/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "I think I Did It",
            "review_score": "1"
        },
        {
            "review_text": "The concept is simple; graphics and music are nice; and now there's no more need for 'the talk' with your child!          YouTube™ Video:  011. how do you Do It?&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I got to re-live some old emotions connected to sexual curiosity and embarassment. Try this one if you want to step outside of your head. ",
            "review_score": "1"
        },
        {
            "review_text": "This game helped me to understand my sexuality. Also, try rotating the dolls against each other and pull away your hands. The dolls will sit there and levitate as if you are some sort of sexual demon sorcerer. 10/10 would Do It again.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man the plot is great, 10 outa 10 game.",
            "review_score": "1"
        },
        {
            "review_text": "It has 2 dolls having the sexes.   20/10 would have sexes with doll again",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥ did you just say about me you little meme? I'll have you know I've had sex over 300 times in this game, and my mother never caught me do it.",
            "review_score": "1"
        },
        {
            "review_text": "When I have kids, this is how I'm going to teach them about the birds and the bees.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, GOTY. Taught me how to have sex properly, tho my gf always asks me what exactly I'm doing in bed.",
            "review_score": "1"
        },
        {
            "review_text": "Very informative and emotional game taking the player on a journey of a young girl exploring her sexuality while avoiding her disapproving parents.",
            "review_score": "1"
        },
        {
            "review_text": "I purpously got caught for the sexual thrill.",
            "review_score": "1"
        },
        {
            "review_text": "  Better than sex ed. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Better combat system than H1Z1",
            "review_score": "1"
        },
        {
            "review_text": "best game in the world i espeszsually like it when im high and my friends come over so i can show dem my sex skills",
            "review_score": "1"
        },
        {
            "review_text": "Discovering sex with a little girl  GOTY  10/10",
            "review_score": "1"
        },
        {
            "review_text": "FUNDAMENTAL   very cute!  although you might think you already know how to play this, you can't actually win.  it's more about enjoying a memory, the silliness of some of your unfortunate experiments, but mostly experimentation and role playing as a youngster defining for herself what sex is.  For a free game, it's an adorable but thought provoking little experience with a very nostalgic feel.  Note:  I'm not sure if this was intentional, but the rotation seems to happen randomly.   Suggestions:  to add more playability, there should be a click and drag poseability option &amp; screen shot capability. And to add more depth to the concept, they should include all different types of dolls to choose from and use. therefore its true experimentation.",
            "review_score": "1"
        },
        {
            "review_text": "So good I went back to play the full five minutes to write this recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "perty gud",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me everything I need to know about how you do it. Thank you!!!!",
            "review_score": "1"
        },
        {
            "review_text": "best game in the world i espeszsually like it when im high and my friends come over so i can show dem my sex skills",
            "review_score": "1"
        },
        {
            "review_text": "I got 0 times.  Forever alone. ;_;  10/10 Best lonely loser simulator of all time",
            "review_score": "1"
        },
        {
            "review_text": "Bathe me in holy water i've sined dear god save my soul",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is hilarious and good for a quick play.",
            "review_score": "1"
        },
        {
            "review_text": "My girlfriend and I had been having... issues in the bedroom. But with the help of this game, I have honed my skills and now I can please her like never before. how do you Do it? gives such an immersive aspect of what is expected from one while you do the do. 10/10 would fix relationship issues with again",
            "review_score": "1"
        },
        {
            "review_text": "Funny, interesting art project. Can give you a fun 5 minutes, but nothing more.  I was tempted to not recommend this game, but I guess its free, its interesting art, and a few minutes (probably only seconds) of fun. So why not.",
            "review_score": "1"
        },
        {
            "review_text": "got my head stuck in a ♥♥♥♥♥♥. instructions not clear enough. 11/10 Would have sex again",
            "review_score": "1"
        },
        {
            "review_text": "I did it 69 times, didin't get caught.  made my day/10",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥ did you just say about me you little meme? I'll have you know I've had sex over 300 times in this game, and my mother never caught me do it.",
            "review_score": "1"
        },
        {
            "review_text": "Such a weird game #toosexyforme",
            "review_score": "1"
        },
        {
            "review_text": "I mean I learned",
            "review_score": "1"
        },
        {
            "review_text": "it's a trap.",
            "review_score": "1"
        },
        {
            "review_text": "Waiting for sequel  10/10 would smash head on table again",
            "review_score": "1"
        },
        {
            "review_text": "Remember kids, sideways for attention. Longways for results. I also loved how it got harder as the game progressed, oh yeah and the game got more difficult too.       Somebody please HELP ME.",
            "review_score": "1"
        },
        {
            "review_text": "It is educational and very entertaining, highly recommend111111111111111",
            "review_score": "1"
        },
        {
            "review_text": "...and that my child is how you were made! 10/10  -p.s what the hell am I doing with my life",
            "review_score": "1"
        },
        {
            "review_text": "Ummmmm dont want little kids to get their hands on this since its free r... right",
            "review_score": "1"
        },
        {
            "review_text": "This was a very insightful tutorial. And the little girl wasn't half bad, either! 10/10 would do questionable things to this game again!",
            "review_score": "1"
        },
        {
            "review_text": "It took multiple people to make this?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolute proof  that steam no longer looks or pays any attention  to its greenlight games..........  They just churn out garbage like this. All it needs is a early release buy in .",
            "review_score": "-1"
        },
        {
            "review_text": "I can guarrantee you that this isn't how 'it is done'.",
            "review_score": "-1"
        },
        {
            "review_text": "Someone please burn my eyes.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is bad just saying that dont get it all i have to say",
            "review_score": "-1"
        },
        {
            "review_text": "This is what happens when you let women in the video game industry. The fact that it took 4 people to make this is baffling. That's one person responsible for each minute of gameplay. Also theres bugs, BUGS, in this interactive picture book with less assets than than I can count on my fingers and toesie woesies. If I had clicked this on Newgrounds 10 years ago I would have said the same thing.",
            "review_score": "-1"
        },
        {
            "review_text": "First greenlight got spammed with trash 'games' and now we will have flash games in free to play section. Just great. It's just waste of time and waste of space on hdd. Try it only if you want to see how worthless this 'game' is or if you want to put another tryhard wannabe funny review.",
            "review_score": "-1"
        },
        {
            "review_text": "MY MOTHER WENT TO GO TO THE STORE TO BUY STUFF.  GOOD, NOW IT IS TIME TO CONTINUE MY RENDITION OF THE MOVIE TITANTIC. I TOOK BOTH THE MANS AND WOMANS CLOTHES OFF, SO THEY BEGIN THE PROCESS OF SEXUAL INTERCOURSE. I THRUSTED MY MAN DOLL INTO THE WOMANS VAJAYJAY, SLAMMING THE TOYS TOGETHER HARDER AND HARDER AS THE PLASTIC MADE BIG CLACKING NOISES WHILE I GET AROUSED AND PINK THINGS GET ON MY CHEEKS.  RIGHT AS THE SCENE WAS ALMOST OVER, MY MOTHER COMES IN WITH A SHOCK IN HER EYES BECAUSE I AM DOING THINGS MOMMY DOES NOT WANT. I AM SO EMBARRASED BUT I MUST CONTINUE THE ACT, AS IT IS NOT FINISHED YET. I FINISHED THE LAST 5 MINUTES OF THE INTERCOURSE WHILE MY MOM WAS CRYING.  IT WAS WORTH IT.",
            "review_score": "-1"
        },
        {
            "review_text": "What have I just played?????????? xD Taught me nothing [ though I already knew], the discovery channel taught me more. x'D",
            "review_score": "-1"
        },
        {
            "review_text": "I am not going to joke about the subject or art. My problem with this is where it comes from. These are the group of people that want to remove anything 'game' related in games.. and instead put in public awareness messages. I support the need for Sexual Education, and I like when someone does something that supports it. If that was all there was, I would be fine with this 'game'. What bothers me is the winning a Indecade GAMES competition with something that flash video users embedded into websites 10 years ago. This is not the future of games, this is a huge throwback to the gaming scene. You want games as Art? Go play ICO or Flower, or see what real game art is and play a game that makes you thing and debate like Bioshock. There games industry is very diverse if you are willing to experience mutliple genres.   The content here is nothing more then a flash game. I am glad it was free, and I am in support of people that want to develop this... but it should never have been allowed to be called a game. There is no direction, no writing, no pacing, no leaderboards, no real score, no reply value. This is a joke to everyone expect a small group of people that believe games like this... should be allowed, and games like COD, Street Fighter, Bioshock, Assassin's Creed, you name it... should not be allowed.  I tested to see if the game has ANY 'gameplay' elements. How did it tally up the score at the end? Put the 2 dolls heads together and leave them there moving the s and w keys so it goes up and down... BAM 400 maybe sex? Its only about how long they touch, not how well they are setup, position or learning anything. This would never be rated as a game. This is a interactive Flash animation.  I played the game... all the way through... and it said I did not use the product long enough to write a review. (5 minutes) This is a 3 minute long 'game' that I had to play through 2 more times to get to 5 minuets played, and the time is not even based on my own ability or lack of, that is simply the TIME of the game. Seriously ashamed of the Indiecade.",
            "review_score": "-1"
        },
        {
            "review_text": "How come is it not two guys",
            "review_score": "-1"
        },
        {
            "review_text": "this game owes me a new pair of sides.",
            "review_score": "-1"
        },
        {
            "review_text": "This non-game wasn't worth the time I spent playing it, and anyone who says it's 'entertaining' has lived in a box their entire life. 'How do you do it?' should not be on Steam.  My thoughts as I played this game:  The mom must've stepped out to drive to the corner and back because she gets back from her 'errand' in 20 seconds flat.  The art is mediocre. (A poor representation of a 90's maxis style)  The soundtrack is bland elevator music that shall haunt my dreams until the day I die  Whoever green-lit this garbage should be forced to play 'how do you do it?' for all eternity.  The only saving grace of this entire... whatever this thing is... was the thought bubble, who's wit ran out after the short list of thoughts pourred from that air-headed twerp in a manner that could only be described as 'repetitive and annoying.'  If you do play this game, play it ONCE and then never play it again. Enjoy the 30 seconds of your life you'll never get back.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd rather sext than play this. Good bye.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible plot.  What 11-year-old hasn't learned sex ed?",
            "review_score": "-1"
        },
        {
            "review_text": "SpaceZeal0t said it best, and I'm writing this to reinforce what (s)he said.  What a waste of time, money and emotional investment (in the form of trust) this was. Just watch a video of it on Youtube; that's all there is to do or see here.  I'm just glad it was released for free; otherwise I may have had my free time taken up by writing to the devs to get a refund.  1/10 because I had a brief laugh at how bad it was.   TL;DR: It could have been a F2P sex-ed game. A wasted opportunity.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: promotes women in video games  cons: follows a CIS heteronormative narrative. (one 'female' and one 'male')  We need more games that promote strong independent women in video games,' how do you DO it?' is a step in the right direction, but we also need to promote LGBTQrsvp 90210 3.14159 equality.",
            "review_score": "-1"
        },
        {
            "review_text": "Pro: The game has a mini in the background Con: Barbies don't clack like that. The game is as long as the trailer.   Final Rating: 2deep4me   P.s. I made them ♥♥♥♥ 113 times. Get on my level scrub.",
            "review_score": "-1"
        },
        {
            "review_text": "Welcome to 2015 where any NIMROD or group of NIMRODS with access to a computer and a stupid idea can make a 'game' and post it on Steam for free. I'm going to film my cat using the litter box, turn it into a video game and name it 'Miley takes a ♥♥♥♥'. That would be more entertaining than this rotten garbage.  Pros: None.  Cons: Borderline kiddie porn. Horrible graphics &amp; design. Game lasts 30 seconds. Waste of time.  Free is not an excuse for failure.",
            "review_score": "-1"
        },
        {
            "review_text": "Worse than 9/11  This is why Hitler should rise   ♥♥♥♥♥♥♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "why",
            "review_score": "-1"
        },
        {
            "review_text": "Not even Pewdiepie wanted to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "'You might have done sex 374 times...? And you didn't get caught!  Press any key to play again'.  That's it? I don't get it...",
            "review_score": "-1"
        },
        {
            "review_text": "WTF I just played?! :DD",
            "review_score": "-1"
        },
        {
            "review_text": "STEAM PLS DELETE THIS GAME FROM My LIBRARY ! PLS ANDREW TOLD TO INSTALL THIS GAME, HE SAID THAT THIS IS A STEAM HACK WALLET 2k20 ! OMG IT DIDNT WORK PLS DELETE IT !",
            "review_score": "-1"
        },
        {
            "review_text": "After years of burying my childhood memories deep, deep inside, they come flooding back. Thanks devs. Now I have to remember the disturbed look on my grandma's face.",
            "review_score": "-1"
        },
        {
            "review_text": "there is no way to beat game.... still waiting for male doll ♥♥♥♥♥ expansion pack",
            "review_score": "-1"
        },
        {
            "review_text": "I feel like this game is a joke that I wasn't in on. Like, one person proposed the idea that they use the afternoon to create a game with no point but had an unusual theme. Then, sit back and watch people discuss how 'powerful', 'artistic', 'daring', or 'important' it was, a la Andy Kaufman. But really, they could have done just that by creating a game where you were a 11 year old girl catching fire flies in a jar. Boom! Nastalgia! Plus, you could overlay some generic 'innocense of youth' nonsense and you'd still have a game with some sort of challenge and reward system. Dang...did I just fall into the trap by writing this review?  Don't play this game or they win.",
            "review_score": "-1"
        },
        {
            "review_text": "After years of burying my childhood memories deep, deep inside, they come flooding back. Thanks devs. Now I have to remember the disturbed look on my grandma's face.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a copy of Infinite Warfare.",
            "review_score": "-1"
        }
    ]
}