{
    "app_id": 353560,
    "name": "Plug & Play",
    "release_date": "2015-03-05",
    "developer": [
        "Mario von Rickenbach",
        "Michael Frei"
    ],
    "publisher": [
        "Etter Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Short",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 3065,
    "negative_ratings": 588,
    "price": 1.99,
    "description": "Run, hit, switch, fall, love, plug, pull. And push.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353560/header.jpg?t=1496684685",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8 Memory: 1 GB RAM Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "So much replay value.",
            "review_score": "1"
        },
        {
            "review_text": "this turns me on EDIT: look i know im hilarious but please stop adding me",
            "review_score": "1"
        },
        {
            "review_text": "Played it through twice. Not sure what to think. At times it's heartfelt, at others it's confusing. It's supposed to be a game about love. I guess I can see that, but I think many of the morals and themes that they were trying to expose and comment on are so briefly touched on that the whole game can be interpreted to mean too many different things. Utlimately a mediocre indie game, and for $3 the game is reasonably priced (for PC, if this was a $3 app there would riots). I love lndie games, and games that are able to tell a story or teach you, but this really didn't do that for me. Many people claim that the art style is 'beautiful' and although I can apreciate a minimalistic styles, this seems too nondescript to provide any weight to the story. I want to like it, I want to feel changed and enlightened, but I just dont. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "I am literally terrified of extension cords now.",
            "review_score": "1"
        },
        {
            "review_text": "A bizarre waste of time...",
            "review_score": "-1"
        },
        {
            "review_text": "This game taught me that relationships are just like connections... A new friend is a new connection that is plugged into your life but when you break with someone you are unplug them from your life  10/10",
            "review_score": "1"
        },
        {
            "review_text": "What the hell did I just play?",
            "review_score": "1"
        },
        {
            "review_text": "I think the game is good however it is extremely short, probably not worth three dollars, but it send a deep message. Everyone gets a different message, i think this game is trying to tell us everything in this world is twined together.",
            "review_score": "1"
        },
        {
            "review_text": "An artistic styled puzzler with crass sexual humor. Obviously this style of game isn't for everyone. But even though it's only 5-10 minutes of gameplay I consider this worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Art. A masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "This game probably shouldn't cost money. Maybe I'm just behind the times and don't understand the 'deep, progressive tones' this indie game provides. Sure, it's fun to look at, but holy ♥♥♥♥ don't pay for this unless it's in a bundle lol.",
            "review_score": "-1"
        },
        {
            "review_text": "Were Not Ready For This Game As A Species.",
            "review_score": "1"
        },
        {
            "review_text": "i spent money on this game",
            "review_score": "-1"
        },
        {
            "review_text": "Its not worth 3 dollars",
            "review_score": "-1"
        },
        {
            "review_text": "Even if you are mentally deranged, you are not prepared for this. You WILL have an aneurysm. Holy cowabunga doggie dookie.",
            "review_score": "-1"
        },
        {
            "review_text": "The true meaning of life. Is here.",
            "review_score": "1"
        },
        {
            "review_text": "How did this game even get into my library?   I'm all for meaningless art, but this was a combination of creepy and confusing that even I'm not comfortable with.",
            "review_score": "-1"
        },
        {
            "review_text": "I passed out while played this...",
            "review_score": "-1"
        },
        {
            "review_text": "How did this game even get into my library?   I'm all for meaningless art, but this was a combination of creepy and confusing that even I'm not comfortable with.",
            "review_score": "-1"
        },
        {
            "review_text": "Decided to play something before going to sleep because I was feeling unfulfilled.  Clicked on plug&amp;play  Now I am pretty sure I will have nightmares.",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' (if you even call it a game) is only 10 minutes long and is essentially an interactive video with some dialogue choice. The hand drawn story makes little sense and is somewhat bizarre/disturbing. I'm not even sure how something like this can even sell on Steam; don't waste your time on this title.",
            "review_score": "-1"
        },
        {
            "review_text": "Just.. I can't explain it.. But if u got 3 euros and u don't have anything else to buy.. Then buy this.. This is one of those games you will remember forever.. x.x",
            "review_score": "1"
        },
        {
            "review_text": "such intense, much wow",
            "review_score": "1"
        },
        {
            "review_text": "don't read the negative reviews, explore the game and discover yourself in the hidden meaning of the bigger picture in this game",
            "review_score": "1"
        },
        {
            "review_text": "What have I done with my life? (AND WHY IN HIS A** GOD DAMN IT) Well I liked the Music  This game explains arguments between women and men:  - Yes. No. - Yes. No. - Yes.  No. - Yes. No. - Yes. No. - Yes. Yes. - No. *goes away* WOMEN LOGIC!  And explains Love:  I love you. - I don't love you. It hurts. - I'm leaving.   11/10 would pug again. (BUT IN THE A** MAN?!)",
            "review_score": "1"
        },
        {
            "review_text": "10/10!  Best plugs ever...  Totally worth 2£.  Took me 11 mins to complete........  GG!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know whether to call this artistic or ♥♥♥♥ed up, but great game either way! :)",
            "review_score": "1"
        },
        {
            "review_text": "I dont think this is a game, it should be a piece of interactive art or something. Annoyingly funny and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything. It is honostly the best thing I have ever bought on this sight. It contains everything yet it is so simple. This is not a game, it is art. Play it, you probably will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Though this game is insanely hilarious, it is not with three dollars. It takes a seasoned gamer fifteen minutes to complete. The puzzles are quite simple, and it doesn't interest just anyone. With it's simple puzzles, short gameplay, and lack of anything that would interest an individual. Overall, I do not recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "HAHA LOL YES This is literally the best game I have played in forever. Of course I have a different sense of humour than most ;D",
            "review_score": "1"
        },
        {
            "review_text": "Made a threesome with cables and put my head in some asses.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I just dont know",
            "review_score": "1"
        },
        {
            "review_text": "Authism is strong in this one.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would plug again",
            "review_score": "1"
        },
        {
            "review_text": "Alright, this was the strangest game I've ever played in my entire life.",
            "review_score": "1"
        },
        {
            "review_text": "Really unique 20min adventure game! Surreal exploration on sex and love. Sometimes, we resort to obsession when love isn't there (hence, the centipede) but ultimately we want to make a connection. At least that's what I got out of it. Try it out if that interests you.",
            "review_score": "1"
        },
        {
            "review_text": "You got your Bill Plympton on my Human Centipede! Two, two, two great tastes in one!",
            "review_score": "1"
        },
        {
            "review_text": "I really should have spent this 1 dollar on the This War of Mine War Child DLC. I really should have spent the 12 minutes doing something less meaningless and pretentious. I really should have. I hate myself for playing this game.",
            "review_score": "-1"
        },
        {
            "review_text": "In short ♥♥♥♥ outlet in the ♥♥♥, head, fingers extremism. Many of racism, standing ♥♥♥♥♥ and church singing instead of metal. 10 outlets in the ♥♥♥ 10. (Кароче ебутся,розетки в ♥♥♥♥♥♥♥♥, головы,пальцы экстремизм. Много рассизма,стоячие хуи и церковные пения вместо металла. 10 розеток в ♥♥♥♥♥♥♥♥ из 10.)",
            "review_score": "1"
        },
        {
            "review_text": "Weird ♥♥♥ game. The art style is pretty cool but the game itself, lacked meaning. After Thoughts: Tf did I just play? ",
            "review_score": "-1"
        },
        {
            "review_text": "Relationships 101",
            "review_score": "1"
        },
        {
            "review_text": "was interesting to say the least..",
            "review_score": "-1"
        },
        {
            "review_text": "I mean if you want a game that takes 15mins to play through and makes no sense then go for it",
            "review_score": "-1"
        },
        {
            "review_text": "Are you bored, and want to waste 10 minutes of your time? If so, then GOOD! You have found the perfect way to waste 10 minutes of your life. This game is super simple, weird, and reminds me of a certain movie that had terrible yet major acclaim a few years ago. (I won't spoil it for you) If you get Humble Bundles often, then you'll probably end up with this game, this week. The shock factor of this game, erm I mean animation short, goes away quickly. You'll probably only play it once. End Review.",
            "review_score": "1"
        },
        {
            "review_text": "Not amazing, kind of pretentious.",
            "review_score": "-1"
        },
        {
            "review_text": "What I paid: $2.99  Pros: +Introspective Message +Minor Novelty  Cons: -Needlessly weird -Paid interactive version of a short film  Verdict: If you want to buy it, I won't stop you. Plug/Play",
            "review_score": "-1"
        },
        {
            "review_text": "Strangest erection I've ever had  10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "This game is truly a master piece. Please add more.  ~k e y n o",
            "review_score": "1"
        },
        {
            "review_text": "If you want to have mindless fun for 15 minutes then buy this game. (I Don't Mean This In A Bad Way) It has some replay value. Has some funny/weird stuff in it. I thougt it was fun while it lasted. I recommend it, but don't expect a whole lot when you buy this tittle.",
            "review_score": "1"
        },
        {
            "review_text": "The end literally turned me on.",
            "review_score": "1"
        },
        {
            "review_text": "it was a weird and stupid game was not worth it i want my money back!",
            "review_score": "-1"
        },
        {
            "review_text": "worth the money",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful game that you can only play once for the best effects. Once you have played it once have you friends play it and spread the experience. Just know that it is 10-15 minutes long. So wait for summer sale or something.",
            "review_score": "1"
        },
        {
            "review_text": "Sexual themes, maybe? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I honestly can't decide whether I really recommend this game/experience/whatever you want to call it, or really don't. It's certainly bizarre, and it feels like there's some sort of deeper meaning hidden in there, although I can't quite seem to decipher it. I can't even figure out how to describe it really. I suppose I'd say give it a go, if only to see it for yourself. I guarantee it'll be the most unusual thing you do all day.",
            "review_score": "1"
        },
        {
            "review_text": "I spent 3 bucks on a game knowing that it would be weird, was not disappointed though. The Question is, if 3€ are acceptable for Maximum 10 minutes Gameplay. So if you dont have financial Problems and need to get weirded the Sh** out, then go for it. Loved the Centipede 10/Fap",
            "review_score": "1"
        },
        {
            "review_text": "Melancholy and thought provoking. This is a game that could very well bring inspiration. Could be metaphors or sex jokes. I'm not really sure. I'll probably play again to think it over. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "I was not expecting this game to touch me on such a deeply emotional level as it did, but here I am telling you about it. Plug &amp; Play is a thought-provoking masterpiece that manages to tell a story without saying anything, and also allows you to plug one man's head into another one's buttocks. If there was ever something worth the $3, it's this game.   11/10 would recommend to everyone. Game of the year, every year, forever.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the human centipede you will like thise game. its very ♥♥♥♥ed up.",
            "review_score": "1"
        }
    ]
}