{
    "app_id": 353700,
    "name": "The Deadly Tower of Monsters",
    "release_date": "2016-01-19",
    "developer": [
        "ACE Team"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 25,
    "positive_ratings": 912,
    "negative_ratings": 122,
    "price": 10.99,
    "description": "Fire up your ray guns, crystal swords, and laser whips, and get ready for thrills and chills! With three incredible movie stars playing out decidedly B-level sci-fi exploits, Dick Starspeed, Scarlet Nova, and Robot will have you ready to jump off the side of the tower—right into adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353700/header.jpg?t=1554202867",
    "minimum_requirements": "最低配置: 操作系统: Windows XP, Vista, 7, 8, 10 处理器: Intel Core 2 Duo 2.4 GHz or AMD Athlon X2 4800+ 内存: 2 GB RAM 图形: NVIDIA GeForce 9800M GTS 1024MB or ATI Radeon HD 5750/6670 1024MB DirectX 版本: 9.0c 存储空间: 需要 4 GB 可用空间",
    "recommended_requirements": "推荐配置: 操作系统: Windows XP, Vista, 7, 8, 10 处理器: Intel Core i5 内存: 4 GB RAM 图形: NVIDIA GeForce GTX 280 DirectX 版本: 9.0c 存储空间: 需要 4 GB 可用空间",
    "reviews": [
        {
            "review_text": "This game is simply amazing. I am a massive fan of ACE Team. Their imaginative creations never cease to amaze. Yet again they have produced another winner, with a game that takes on a surrealistic approach to movies with amazing visuals and audio.   Firstly may I say, that this game could be enjoyed simply for the voice acting and audio. The game basically revolves around you watching a director's cut of an old film, except you are obviously playing as the main character of the film, an astronaut who has crash landed on an alien planet. The Director will commentate on your surroundings, the story and pretty much everything else. For instance I started spinning around and he just started going on about how the main actor loved to spin in circles, it was even the reason they chose him during the role casting sessions! Even if you go afk he will start to say things like 'At this point he forgot his lines and didn't know what to do'. So yeah, if you like a laugh, buy this game right now!  The music and visuals are both equally great. The game should run fine on nearly all systems as it isn't too demanding, and is capped to 60fps. The visuals and audio can have one of two filters, either VHS or DVD. These obviously change the quality of both and add a different feel to the game. I highly suggest using VHS as this is how the devs intended the game to be played. The characters and enemies are all amazingly detailed, kingkong and dinosaurs are stop motion animated, giving them that nostalgic and authentic look and feel. Kingkong's hand when he grabs you is even on a stick! This game stays true to so many movie tropes it's unbelievable and equates to the funniest game I've had the pleasure of playing in a long time.  Gameplay itself is very solid, as I'm not a massive fan of top down games, torchlight etc... But this game gets it right. Behind the great visuals, audio, and 'story' is a solid set of combat mechanics. You find new weapons, can upgrade them, and do powerful special abilities. Throw in the massive variety of enemies and you've got yourself a really fulfilling and satisfying game.  My only gripe with the game so far is the options menu. I think that some of the labels should be changed when using a keyboard, for instance to apply changes it just says press the 'app' key. Turns out this is enter, which is pretty much common sense. But I think it should just say 'enter'. As I said, this is just a tiny flaw that if fixed up will make the game a classic.  Do I suggest buying this? Yes! Go buy it now, you won't regret it. If you are a fan of ACE Team there's even more reason to buy it, help support these guys. They make really individual games that I wish other people took inspiration from. If you love movies, then yeah. You may wanna buy this simply for the near infinite references and elbow nudges to famous movies.",
            "review_score": "1"
        },
        {
            "review_text": "Wow looks Amazing, plays amazing,sounds amazing and yes it's god darn amazing for an amazing price.  Couldnt stop smiling right from thes start   10/10 Voice acting  10/10 controller + keyboard at the same time.  10/10 story and characters.  10/10 optimised and visually stunning + great game mechanics.  Highly recommend loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that fans of crappy 50's sci-fi and b-movies have always wanted. This game is a must for anyone who likes that kind of crud, like myself. If you don't like this kind of stuff, just leave now.   Pros -Fun gameplay -Funny dialouge -Plenty of references -Great platforming -Great concept -4p local coop  Cons -Ends WAY to soon, only about 6 hours, took me 7-8 for 100% -Ending is pretty lame, could've been much better -Camera can be awkward at times, makes 4p local coop unbearable at times   Overall, good game thats waaaaay too short. If it was longer it would be worth the full price, but unfortunatley its too short to. Perfect game to get on sale!",
            "review_score": "1"
        },
        {
            "review_text": "If you like B movies, especially sci-fi, and action platformers, like Pandemonium, you'll love this game. The presentation and director commentary almost make it feel like you are playing and watching a movie at the same time. Its laugh out loud funny too! Stop reading and buy it! Another winner from ACE Team!  Update: I've beaten the game, and what a HUGE disapointment the final boss is...way too easy, in fact one of the easiest boss fights out of any game I've ever played. I still recommend and glad there is now hard mode, but be beware, game is extremely short (little over 4 hours in length) and the main boss is super weak. Bummer...Here's hoping they add DLC/More levels, more story.",
            "review_score": "1"
        },
        {
            "review_text": "First second I saw the 'quality stop motion' I thought something was going on with my frame rate, soon realised otherwise and how much of a genius idea it was. Very vibrant, very fun, highly recommend this, especially for classic movie lovers",
            "review_score": "1"
        },
        {
            "review_text": "The Deadly Tower of Monsters is a wonderful subversion of pulp sci fi movies of yore.   The game is narrated by the (fictional) director of the (fictional) movie, The Deadly Tower of Monsters. Without a doubt, the strwength of this game, and the main reason to play it, is the tremendous ambiance and tone. The devs clearly have a strong affinity for cheesy, B-movie sci fi and boy does it show. From the VCR film grain to the not so subtle strings attached over pterodactyls, this game nails it’s aesthetic and hits it out of the park. It has cheesy one liners, an evil doctor, and a main hero named ♥♥♥♥ Starspeed. What more could you want?!   As far as the game itself plays, it’s perfectly serviceable, if nothing special. It’s your standard fare third person action game where you get two melee weapons and two guns. Your arsenal is varied enough that it keeps the game fresh but there are clearly ones that you should use (the flamethrower). In addition, there is a sizeable amount of enemies that you encounter each with increasing difficulty as you ascend the deadly tower. My main gripe would have to be the checkpoint system, it’s not great. Many times I was set back two or three confrontations earlier that led to somewhat tedious moments. Thankfully, this didn’t happen enough that it severely hampered my experience but it was definitely annoying.    The Deadly Tower of Monsters is a blast to play if you have any affinity towards The Twighlight Zone or old sci fi movies. This alone carries the game through its 5 hour runtime. If you have no connection to that setting, then the game may be a bit dull for you, however. That said, I am excited to see what this studio does next and would love a follow up to see what shenanigans old Dan Smith is up to. ",
            "review_score": "1"
        },
        {
            "review_text": "Fans of cheesy scifi B movies, Godzilla, Mystery Science Theater 3000 etc will find this game to be a good value, particularly when on sale. I got a solid 10 hours of gameplay and quite a few chuckles along the way.",
            "review_score": "1"
        },
        {
            "review_text": "adds new aspect ( diving off the tower no matter where and shoot during free fall) to gaming.",
            "review_score": "1"
        },
        {
            "review_text": "I beat the game on months ago, and forget to write a review lol.  Yeah, I'm really enjoy the game until the end of the game. I like the sci-fi, and characteristic style on this game. And even the monsters! I always like sci-fi adventure games. The point of interest is 'Stop Motion' animations on enemies is feels like again. I mean, 70' sci-fi moives does that. Which is kinda different from any other games from I have seen. (Just genius) The director is hilarious. Seriously, the people are talking during in the movie! And sometimes mature jokes.  However, I'm not born in 70' but this game is just about a movie and watching it during in the game. Simply awesome.  I'd recommend a game, if you like the old movies, but with the colors graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this one. I think I got it on sale (as I do with everything on Steam) and I feel it was definitely worth it. The commentary was an enjoyable experience. It kept the game fun and lighthearted the whole way through. The gameplay was fun and challenging at times. It felt very well-polished and refined. I would definitely consider purchasing something similar to this again.",
            "review_score": "1"
        },
        {
            "review_text": "(Edit) Changing status to 'Recommended', as I have technical issues not relating to the quality of the game.  In short: After trying to launch this game, it looks like I have to do a complete OS (Windows 10) reinstall. This will obviously put a bias on my review..  When first trying to launch, Steam tried to install .Net frameworks 4.0. The game never launched, and now I have corrupted system files. I've reinstalled .Net frameworks 4.0 and 4.6, reinstalled Microsoft Visual C++ 2013 (removed all other versions), and yet I still get errors related to these apps. (missing MSVCR100.DLL &amp; MSVCP100.dll) It looks like they're missing from the x64 dll directory. I tried copying them from the x86 directory (system32), but that doesn't work - not unsurprisingly.  Not only can I not play the game, but my best bet at this point is a complete Windows reinstall. Also, I probably don't have any Steam friends anymore, since I have to spam the 'Play' button about 500 times, to trick Steam into thinking I've been playing 5 minutes, so I can be allowed to write this review.  Now I don't only have a hangover, I'm also sad.  Thanks a lot, Steam...",
            "review_score": "1"
        },
        {
            "review_text": "The best Sci-Fi B-Movie in 2016. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like goofy Sy-Fy from the 60's and would like to play a fun 3rd person game. This is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know about the cat, but I sure am enjoying it.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely fantastic experience. Good clean simple fun action adventure game, made better with the sci-fi B film of ages past, and then made truly wonderful by the conceit of it not being a game, but rather re release of a cult classic sci-fi jammed full of excellently narrated director's commentary.",
            "review_score": "1"
        },
        {
            "review_text": "The controls are really smooth, the aesthetic is amazing (it's like I'm really in a B-movie), and the narrator and the cheesy dialogue reallys makes this whole game come together. This is a game where I would recommend that you go in blind, because any piece of dialogue spoiled really hinders the experience (slighty). As a fan of Sci-Fi B-movies, this did not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "Although it's a bit easy, it's very fun, unique and just stunningly beutiful.",
            "review_score": "1"
        },
        {
            "review_text": "A light hearted game with lots of charm. Bland gameplay that thankfully wasn't enough to tarnish the experience too much.",
            "review_score": "1"
        },
        {
            "review_text": "Ha, this game is funny, different, and just fun to play. Bought this with a coupon so it was 50% off, was a deal for me. Looking for something different, than get this game",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, as far as I can get. After the giant ape I get stuck on the teleport graphics. 'Demolecularizing, please wait...' and then nothing happens. The radar screen keeps spinning forever.",
            "review_score": "1"
        },
        {
            "review_text": "A fun homage to the 'classicly' bad science fiction games of my youth it is presentation, though as a game, it seems to have more to do as an homage to the under-appreciated arcade classic Escape from the Planet of the Robot Monsters. The controls are good enough, the humor of the commentary is pretty consistently good, and the game itself is a fun $10 pickup. I'd recommend getting it on sale, but it's a very fun game if you remember these films fondly.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game, it's clean and colorful. Im 46 and I remember all the b movies I watched as a child. This is one of the most inventive games I have ever played. It's a great game and I cool retro way to kill time and get entertained.",
            "review_score": "1"
        },
        {
            "review_text": "Just a very good funy game",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game, it's clean and colorful. Im 46 and I remember all the b movies I watched as a child. This is one of the most inventive games I have ever played. It's a great game and I cool retro way to kill time and get entertained.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent comedy and fun creature design.",
            "review_score": "1"
        },
        {
            "review_text": "The slightly wonky shooting and melee mechanics aren't bad enough to undermine the mental storyline and presentation of this very funny and somewhat novel game. A bit underdeveloped, as seems to happen a lot with this developer, but they're back in my good books after the initial promise of Zeno Clash was ruined by the sloppy, underfinished sequel. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE this game! If you're into classic science fiction, you'll particularly fall in love with this gem. The developers have done a fantastic job. Everything works so well. The concept is brilliant and extremely well executed. I can only hope that DLC is in the works. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with outstanding design. Very bold concept.. Ace Team and Atlus did it once again! Delivers the best game they have ever done (in my opinion)  My complaints would be that the characters do not vary that much apart.. making it feel pretty much the same playing any of them. The checkpoint is sometimes frustrating as it is pretty far apart, and sometimes the game does not tell you which direction to go, so you are stuck with not knowing how to progres.  Other than that, stellar design, its weird and very, very entertaining! I give the very best recommendation for this game!",
            "review_score": "1"
        },
        {
            "review_text": "I really liked Ace Team's Zeno Clash I &amp; II, since they brought something new, fresh and somewhat strage to the genre of first person beat em up games. So I knew they could make great games. When I heard though, that they were about to make an homage to motion pictures of the early ages of film, I wasn't exaclty thrilled... But this game is so much fun! It's story is silly, the characters are silly, the setting is silly. Everything makes you giggle and it's simply a feel-good-game. It's not particularly hard, nor very long. It's jumping, shooting, laughing and skydiving. Yes. That's it. And the thing this game does, it does really well. Even the use of achievements (I despise so very much) is done extremely well. Most of the achievements, you will have by the end of the game - each achievement gives you a 'skill point' which you can spend, to obtain more health, power and so on.  Give this game a chance and you won't regret it. Big thumbs up for 'The Deadly Tower of Monsters'.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really cool game! But, you have to give it about an hour before you begin to appreciate its gameplay and the vastness of its environment. I usually like to play FPS, so he control is not what i'm used to, but it is good once you get used to it. I had some difficulty dodging and jumping away from enemies, but it might be my inexperience. There are lots of goodies to find, achievements for reards and secrets to discover. It is cool looking down off the tower and skydiving off it to reach secret treasures. It is funny and campy fun and reminds fondly of the old 50's and 60's B-movie scifi features and TV series--lots of trivia from Star Trek to Lost in Space, as well as movies. Its eye candy to look at and a great fantasy adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Good game which plays to its cheesy strengths well. Fun gameplay with a rewarding sense of progress. Game should take somewhere in the area of about 4 hours to finish which may annoy gamers looking for more playtime. A very cool third act twist which I wont spoil, but unfotunalty the game ends with a fizzle rather than a boom. Still very fun for what it is - 3.9/5.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. The DVD commentary shtick was really enjoyable. The 6+ hour play-through was fun but I just wish the tower was taller. The goofy monsters and 4th wall stuff has made it a unique experience considering the common mechanics. I could keep skydiving of the tower for hours if I get bored. Still need to skydive out to the ghost pirate ship to see what that is all about.  Two Laser Tentacles up. Would fight dinosaurs again.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game from the first time. It is hilarious, fun and enteratining. The charme is packed into it from the best dinosaur animation to the greatest half-an-hour-monster. You must play this game if you like retro movies ;)",
            "review_score": "1"
        },
        {
            "review_text": "So, as you can probably tell, this is a tongue-in-cheek action platformer sci-fi game. You play as three different heroes, all with mildly varying powers, and you can use and upgrade a variety of melee and ranged weapons, most of which are bad.   So, the presentation is rather nice, with the audio commentary from the 'director' of the game talking about how he 'filmed' the 'movie,' and some random audio engineer that makes comments for whatever reason. The commentary, which extends throughout the game, is entertaining enough, and it makes plenty of references to old and new filmmaking. The visual style of the game adds to the presentation as well with 'stop-motion' enemies that move at lower frame rates and wacky enemy designs.   So why don't I recommend this game?  Well, for one, I beat this game first try in 2 hours and 45 minutes approximately. Now, even for a 15 dollar game, that is fairly short. But length isn't all that matters, right? Well, that isn't the only problem I had with it.  The soundtrack for the game is alright, but I can only remember two main songs that got repetitive after some time. There is the main combat and adventure music, and the jarring music change that plays every single time you enter freefall. And you will hear those songs for the entirety of this short game, except when the music seemingly breaks or perhaps just randomly stops playing for whatever reason, which makes the game really uncomfortably silent.   The game also randomly crashed near the end for some reason.  Graphically, this game is not bad. It is colorful, varied, and presents itself well even though the texture quality isn't particularly impressive. The animations can leave a bit to be desired at times, but it is alright.  Now, onto the gameplay. One of the primary things this game sells itself on is the freefall mechanic. In short, it is really bad. You can jump off ledges and move around slightly and then instantly teleport back to where you just jumped off like it never even happened. It just feels so disconnected from the rest of the game. The only real advantage to it is to fall through rings for skill points and achievements. Otherwise, it serves little purpose whatsoever. Even in the boss fights, at the very end of some of the bossfights, the boss falls down and you get to shoot the boss a whole bunch, but it doesn't even seem to really do anything at all. I wouldn't be surprised if not shooting the boss had the same outcome as shooting them. I honestly can't say anything more about it because there really isn't anything else to it. Freefalling feels like a slapped on mechanic, and I would have much preferred if the game didn't pretend like it actually matters at all.  Another 'mechanic' of the game, if you can even call it that, is that you can shoot down the tower. I don't mean shoot the tower down, but rather you can look over the edge and shoot at enemies that are coming up the tower. The game will alert you when enemies are climbing/flying up the sides, and you can look over the edge and click them a whole bunch. Also, you can shoot targets and if you shoot enough you get a skill point. That is literally all there is to the 'mechanic.' It feels so disconnected from the rest of the game that I honestly can't see why it is even in the game.  So now that the whole 'looking down and clicking things a whole bunch' mechanics have turned out to be boring, repetitive, and disconnected from the rest of the game, you are left with a more basic action adventure platformer game. So, how does that fair? In short, not much better.  To start off, you have two weapon types, ranged and melee. You can carry four weapons, two of each type, and you can collect and upgrade the different weapons throughout the game.   The different weapons have different advantages and disadvantages that you must learn to utilize in order to fight the varied enemy types.    Actually, scratch that last sentence because it is a big fat lie.   So, you can use different cogs you find throughout the game to upgrade your weapons. But some of the weapons are so ridiculously strong that I cannot possibly imagine why you would use any of the other weapons. The mace/hammer weapon allows you to annihilate everything in your path with jump attacks. It can hit enemies twice, and when you land, its shockwave hits multiple enemies at once. Pair that with the fact that it does a ridiculous amount of damage even to single enemies that I am pretty sure it is more versatile than any pair of weapons in the game. The game quickly devolved into jump attack, jump attack, jump attack, win. It even works well against bosses, so every time I picked up a weapon I would switch to my other junk weapon so I wouldn't lose my hammer when the game forcefully changes my weapons. Then I would continue jump attacking to victory for most of the game.  The ranged weapons are in a similar boat. There is one lightning gun that does so much single target damage that it instantly kills even many medium strength enemies in one shot at range, and at the very least two shots them. There is also an energy mechanic where if you shoot too fast, your energy runs out and you have to wait to use your gun again, but the lightning gun doesn't even use too much energy for the insane amount of damage it does and it upgrades to max very quickly. The worst part is that the weapon can hit multiple densely packed enemies at once so I never felt hard pressed to switch to a faster weapon to kill weaker mobs because I could kill two to three at once anyway. The ranged weapons are less terrible than the melee weapons, with the machinegun, rocket launcher, and a couple others being okay but the lightning gun is just so good I had no reason to ever use my secondaries.   Each character has powers that I can barely even comment on because I never felt the need to use them except when the game forces you to use them to open up a gate or move past an obstacle. The only one of note is at the last chapter of the game and lets you instantly kill any enemy that is being held up by strings, and it recharges very quickly.  Surely,  we needed more enemy types to become completely trivialized.  'What about the enemy designs?' What about them? Thematically they are varied with apes that throw feces and robot samurai and dinosaurs and so on, but most can be summed up as: Small mob creature that dies instantly, medium strength melee guy, medium strength ranged guy, big slow guy. Oh, and the 'enemy that flies up the tower and you click a whole bunch as it dies helplessly' enemy type. Again, the 'shooting down the tower' mechanic is so disconnected that those enemies are hardly worth mentioning. The hammer and lightning gun make short work of all of the main enemy types anyway.  The platforming is extremely basic. You can jump, and you have a jetpack that allows you to hover for a short period of time while also preventing fall damage. Basically, its not a selling point either.  And the bosses, along with the rest of the game, are laughably easy. The last 'boss,' if you can even call it that, is basically one last middle finger to the player as it is the easiest of them all.  All in all, unless the presentation just seems  that  appealing to you and the game is on sale, I wouldn't recommend it. I even got it for 10 bucks and I  still  wouldn't recommend it.  EDIT: I completely forgot there even was a dodge roll mechanic until I looked at the achievements because it was so insignificant.",
            "review_score": "-1"
        },
        {
            "review_text": "'Uninspired' is the word that best describes this game, at least as far as gameplay is concerned. I loved the art style (and *even* the animations), the setting (brains in flying saucers!), the characters... but playing the game is just one meh after another. You shoot, you hit, you jump, you fly in a jetpack, you collect stuff around... nothing new, and above all nothing well done. It's one of those games where after a while you stop worrying about how you play, because you feel that it won't really make a difference. I bought it with a huge discount, and asked for a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Too blasted glitchy! I play for 10 minutes only to be stuck in a tree for some unknown reason. While I am trying to get out of the tree using all the tricks I know I am being ridiculed by the voice over director! The devs had time to get actors to make voice overs for when players aren't moving, but not enough time to make sure they don't get stuck in the scenery. Long story short (I know 'too late!'). I ended up having to restart the game and lost all my experience to the point I got stuck. Sorry dev guys I refuse to play a game where I may lose all my hard earned experience (and especially time) for your lame brained mistakes. I get no pleasure in banging my head against a wall either.",
            "review_score": "-1"
        }
    ]
}