{
    "app_id": 353980,
    "name": "Ankh - Anniversary Edition",
    "release_date": "2015-05-21",
    "developer": [
        "Deck13"
    ],
    "publisher": [
        "Deck13"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 47,
    "negative_ratings": 9,
    "price": 5.59,
    "description": "Sneak into the pharaoh's pyramid and meet up with Assil and his crew of crazy friends. Just as the party starts to get hot, a silly accident turns life upside down! Help Assil reverse the curse!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353980/header.jpg?t=1478072768",
    "minimum_requirements": "OS: Windows 2000/XP Processor: 1,5 Ghz Memory: 256 MB RAM Graphics: GeForce 3 with  64 MB RAM DirectX: Version 9.0c Storage: 1200 MB available space",
    "recommended_requirements": "OS: Windows 2000/XP Processor: 2 GHz Memory: 512 MB RAM Graphics: Radeon 9800 Pro / Geforce FX 5900 XT with 128 MB RAM DirectX: Version 9.0c Storage: 1200 MB available space",
    "reviews": [
        {
            "review_text": "This game started out well but by chapter 3 it became painful. Chapter 4 was just torturous.   The story is only ok, and the puzzles are convoluted and irritating at best. There is no fast travel, and even if you can get the character to run, he ambles about slowly making odd turns and generally being a slow pain in the butt.   I was using a walkthrough by chapter 3, and still the time it took to get from one place to another was torturous. Sometimes it was literally 20 screens between actions and then you would just do one thing and have to march all the way back the way you came for the next part. I can't imagine how horrible this game would have been without a walkthrough to keep me from wandering aimlessly. As it was, I almost quit part way through chapter 4 when they had you backtrack across the entire map for the 8th time in a row. It's like the designers WANT you to be irritated and start to hate the scenery that was interesting at first. I'm glad I used a walkthrough though because the tasks were completely unpredictable and about half the time you had no help whatsoever. I could have been wandering for hours just to find out that this item I just found needs to be used 20 screens away in a way that I never could have predicted.   In short, this game is bad. There wasn't a single part that really made me think, and the flat, predictable story wasn't worth the pain of the back and forth with the poor game mechanics.  3/10",
            "review_score": "-1"
        }
    ]
}