{
    "app_id": 353940,
    "name": "Aces of the Luftwaffe",
    "release_date": "2015-05-08",
    "developer": [
        "HandyGames"
    ],
    "publisher": [
        "HandyGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Bullet Hell"
    ],
    "achievements": 45,
    "positive_ratings": 45,
    "negative_ratings": 24,
    "price": 3.99,
    "description": "YOU have to show what you’re made of as the war over Europe is in full swing. Fight waves of Axis planes and panzers until you hit the boss enemies – the ACES OF THE LUFTWAFFE.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/353940/header.jpg?t=1544016056",
    "minimum_requirements": "OS: Win7 Processor: ~2.0GHz Memory: 1 GB RAM Graphics: 512MB DirectX: Version 10 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pretty average arcade shooter. Entertaining for a short time until you have to grind. 4.5/10  Pros: - Looks nice - Interesting boss fights - Decent music and voices - Not particularly hard except bosses - Some achievements working as side objectives - Short levels for quick sessions  Cons: - Grindy for upgrades and achievements - Poor shmup mechanics except for bosses - Not much bullet pattern except a few attacks, so you can't avoid everything even if you learn. - Doesn't really matter if you're hit (except on bosses since they hit hard): it heals over time (or with power ups) and since there's not combo it doesn't interrupt anything. - No health indicator except bullet impact and cracked screen. - 3 pilots but you probably won't bother using the 3. - One pilot (Freshman) almost unplayable once upgraded: you can increase his movement speed, and once maxed it's way too fast with a controller. - Broken leaderboards (poor scoring method anyway, 'total kills' is just grinding)",
            "review_score": "-1"
        },
        {
            "review_text": "*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~* Run, live to fly, fly to live, do or die ! Run, live to fly, fly to live ! Aces high ! *~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*",
            "review_score": "1"
        }
    ]
}