{
    "app_id": 3540,
    "name": "Peggle™ Nights",
    "release_date": "2008-10-15",
    "developer": [
        "PopCap Games, Inc."
    ],
    "publisher": [
        "PopCap Games, Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 368,
    "negative_ratings": 24,
    "price": 4.25,
    "description": "The sun has set at the Peggle Institute, but the bouncy delight has just begun! Join the Peggle Masters on a dreamtime adventure of alter egos and peg-tastic action. Stay up late to aim, shoot and clear orange pegs, and bask in Extreme Fever glory under the silver moon. Then, put your Peggle skills to the ultimate test in Challenge mode.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3540/header.jpg?t=1447351487",
    "minimum_requirements": "Supported OS: Windows® 2000/XP/Vista                    Processor: 700MHz                    Memory: 256MB RAM                    Video: DirectX-compatible; 16MB                    DirectX® Version: 8                    Sound: DirectX-compatible                    Hard Drive: 50+MB",
    "recommended_requirements": "Processor: 1+GHz                    Memory: 512+MB RAM                    Video: DirectX-compatible; 32+MB                    DirectX® Version: 9.0c+",
    "reviews": [
        {
            "review_text": "I'm a big fan of the Peggle games. Nights is great. It has a few tweaks that I really enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "This is my all time favorite game. The puzzles are very well made and the comedy is flawless to me. Truely a wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "It's like the normal Peggle, but with one more character to play as. Buy it if you want more Peggle. 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Whimsical arcade game, will make you feel like such a bad ♥♥♥ when you get peggle fever.",
            "review_score": "1"
        },
        {
            "review_text": "More or less the same as the first one, but if you tried it once it can became a true addiction.",
            "review_score": "1"
        },
        {
            "review_text": "It's Peggle with Half-Life. You can't beat it with a stick.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game and worthy purchase ",
            "review_score": "1"
        },
        {
            "review_text": "Peggle what more can I say other than if you don't like this game than there is something wrong with you.",
            "review_score": "1"
        },
        {
            "review_text": "No No NO waste of everything",
            "review_score": "-1"
        },
        {
            "review_text": "It's Peggle in the dark. Just imagine playing Peggle, but being unable to see a single God Damn thing! ♥♥♥♥ YEAH!",
            "review_score": "1"
        },
        {
            "review_text": "It's been a lot of fun so far, I just wish it was a longer game.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting. A great grandma game ;)",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its an okey casual game. But wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, addicting, lighthearted pick-up and put-down sort of game. Great for those pesky times you need to half-pay-attention to something but need a game to occupy your thoughts.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little time waster!",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is quick and sharp, the visuals are bright and fun, and there's just enough challenge to make this game hella addicting. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little game if you have a few minutes to kill, lots of different special abilities and some cool levels. I'm not usually into the casual games, but this one is entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "For those who have never played Peggle, you use a launcher at the top of the screen to launch balls into the field and knock out all the orange pegs within 10 shots (though you have chances for free balls).   It would be more accurate to call this Peggle Dreams (Nights Into Dreams?), as you look into the dreams of various creatures, like how Shining Armor wants to be a superhero, a Totally Radical hamster wants to be a scientist, and a dragon wants to fight fires instead of starting them. It's on the short side, but it's not without its challenges or fun.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Peggle is by far the most challenging challenge you will ever face. Merely hitting the pegs isn't enough in this thrill-a-minute roller coaster.  Oh wait actually I misunderstood the rules. Hitting the pegs is exactly what you have to do.",
            "review_score": "1"
        },
        {
            "review_text": "Jesus what the Christ oh my what? Yes yes yes yes yes. Who? How? ♥♥♥♥♥♥♥it Pop Cap, you crazy.  If you want more Peggle, but for it to make even less sense some how? SOMEHOW!!!!! You enter the dreams of the animal/mythic beats that are the teachers of the Peggle acadamy. YOU LEARN NOTHING. Amaze game doe. Oh qhat? 5 YESes no moer zeroes zomg.   10/10  would  WHAT?!?!  again",
            "review_score": "1"
        },
        {
            "review_text": "It's Peggle. If you like puzzle games, pinball, or similar, it's a fun time. There are a bunch of good challenges, and it's a lot of fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Distressingly addictive, a real time killer. If you have some time to kill, this is the right game for you.",
            "review_score": "1"
        }
    ]
}