{
    "app_id": 354030,
    "name": "VolChaos",
    "release_date": "2015-12-08",
    "developer": [
        "Fun Infused Games"
    ],
    "publisher": [
        "Fun Infused Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 15,
    "positive_ratings": 30,
    "negative_ratings": 14,
    "price": 1.99,
    "description": "Volchaos is an ultra-challenging old school platformer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354030/header.jpg?t=1479401132",
    "minimum_requirements": "OS: Windows Vista/7/8/10 Processor: Intel/AMD Memory: 128 MB RAM Storage: 400 MB available space",
    "recommended_requirements": "OS: Windows Vista/7/8/10 Processor: Intel/AMD Memory: 4 GB RAM Storage: 400 MB available space",
    "reviews": [
        {
            "review_text": "VolChaos is an old-school platformer that reminds me of an Amiga 500 game.  I almost want to recommend the game just to give a big thumbs-up for the great level names, which reminded me fondly of the old mutant camels games (though VolChaos is nothing like them), but after having played for just under five hours, and having rage-quit many times during that (almost all on level 27), I just don't find VolChaos fun to play, and other than fun I can't see that it offers anything else.  The game is mostly well done, with good pixel graphics and a vast array of levels. However, the levels vary wildly in difficulty with no discernible curve leading from easier levels to harder ones, and relying on replay after replay of the same level in order to gain longevity does not lead to a fun game. Some levels are obviously designed to foil early attempts, requiring blind leaps of faith, which is not great level design in my opinion.  To be fair, the game's description does say it is 'ultra-challenging', but ti seemed to me that most of the challenge was had from trying to master the player's inertia and remember the tricky bits from the previous attempts at each level, rather than through any devious or clever level design. I had some fun, but unfortunately not enough. I suspect a reordering of the levels would help immensely. As it is, I couldn't bring myself to keep bashing my head against level 27. I knew what I had to do, but the controls just wouldn't let me do it.  Grab VolChaos if it's on deep discount or in a bundle and you enjoy a bit of reminiscing over platform game rage. But if you play games to enjoy yourself, it's probably best to give this one a miss.",
            "review_score": "-1"
        },
        {
            "review_text": "Love the game, its somewhat retro yet new and awesome.",
            "review_score": "1"
        }
    ]
}