{
    "app_id": 354140,
    "name": "Five Nights at Freddy's 3",
    "release_date": "2015-03-02",
    "developer": [
        "Scott Cawthon"
    ],
    "publisher": [
        "Scott Cawthon"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Horror",
        "Singleplayer",
        "Survival Horror"
    ],
    "achievements": 0,
    "positive_ratings": 4917,
    "negative_ratings": 678,
    "price": 5.79,
    "description": "Thirty years after Freddy Fazbear's Pizza closed it's doors, the events that took place there have become nothing more than a rumor and a childhood memory, but the owners of &quot;Fazbear's Fright: The Horror Attraction&quot; are determined to revive the legend and make the experience as authentic as possible for patrons, going to great l",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354140/header.jpg?t=1447370190",
    "minimum_requirements": "OS: XP,Vista,Windows 7, Windows 8 Processor: 2 GHz Intel Pentium 4 or AMD Athlon or equivalent Memory: 1 GB RAM Graphics: 1 GB DirectX: Version 9.0 Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Five Nights at Freddy's 3...oh boy. This series has been notorious for its fast sequels (or prequels) and recently the rumoured last installment of the series has finally come out.    So, this review will answer one question:  Is Five Nights at Freddy's 3 actually scary or just a jumpscare fest? ",
            "review_score": "1"
        },
        {
            "review_text": "Okay, this is one of the most-hyped indie game I've seen in a long time. I believe that Scott took his time, and made it quite well. Some people believe that it's 'milked', but I believe it was pretty good.  The pros! - You probably expected this, but it's pretty scary. - Still the usual 2D engine, but with a more improved 3D 'illusion'. - Which adds a new mechanic: Hallucinations! In the other games, hallucinations were flashing pictures, but these are 'phantom' animatronics that appear on camera when your vent system goes out, making you breathe heavy, and leads to those... - MULTIPLE ENDINGS! I won't spoil anything, but there are 3. - MANY new minigames. - Lots of new stuff I can't name!  The neutral: - The clock goes much faster, making the nights go faster, but the difficulty is risen, so it's kinda balanced.  The cons: - Springtrap's jumpscare is pretty pathetic... - This is personal, but the sense of panic you get from seeing things in the hall and turning to see them while in your camera... Gets my heart pumping.  In my opinion, out all 3 Five Nights at Freddy's games, this might be the best, close with the first one.  FINAL RATING: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Damn it to muffins, I recommend it by a bunch. Here's my first and only play on it:      Night 1: Damn this place is scary, but that was the darn fastest night. Night 2: Oh hey new guy.... OH HEY NEW GUY. I SEE YOU OUTSIDE MY WINDOW. Hmm... there doesn't seem to be any limit to you starring at him.... &gt;VENTILATION ERROR Oh god, I'm suffocating &gt;REBOOT I SEE YOU RUNNING. OH GOSH FOR THE FIRST TIME THERE'S ANIMATION AND NOT OUTOFCAMERA MOTION! Where'd he go?! HE WAS JUST THERE. I PUT IT UP FOR A SECOND AND YOU'RE GONE.  &gt;Camera Error Oh great. &gt;REBOOT OH MY FREAKING GOS-  Night 2, attempt 2: Okay, this time, Mr. New Fuzzy I hateYourAssHat guy, I'm not going to let you get near my damn office even if you stare at me. Oh hey Balloon bo-- WAIT, WHAT?!?!?!?!?! Night 2, 4am: He's playing tricks on me.... he's freaking smart. That damn ♥♥♥♥♥♥♥ is smart..... Night 2, 5am: YOU'RE AT MY DOORWAY, IF I FREAKING TURN AWAY I'M DEAD, I AM STARRING AT YOU EVEN IF I SUFFOCATE!!!!!!!!  Night 3: Oh gosh.... oh gosh, that was terrible. Alright, what we got here? Oh hey, finally I see Mr. Fuzzy elsewhere on th e cameras other than outside my door.  Gosh he doesn't seem to be trying at all. Night 3, 1am: ... Is.... Is....... Is that, Freddy?!?!  &gt;CAMERA ERROR. &gt;VENT ERROR &gt;AUDIO ERROR Holy crap... it.... it-    *static*  ",
            "review_score": "1"
        },
        {
            "review_text": "When I look at this game I see the words fear, amazement, astonishing, terrifying, and most of all outstanding! This game is when in doubt the most hyped horror game to exist in any town, city, county, district, state, country, continent, planet, galaxy, universe, dimension, and even beyong infinity it is the most hyped and the best horror game to ever exist. If I were to take Scott Cawthon away from his game then Five Nights at Freddy's would not be the game it is today and anyone who can take a laptop, computer, console, handheld, phone, etc and make a game like this is obviousley going to be on the top 10 if not the top of my favorite game creators list and Five Nights at Freddy's 3 delivers answers yet leaves us with even more question then before and the one thing I would tell Scott Cawthon is job well done X Infinity X Infinity. Thank you Scott Cawthon for this amazing series and this amazing game and I hope that you continue this series and make it much bigger than ever before! -TGM360",
            "review_score": "1"
        },
        {
            "review_text": " Why do I keep buying these?  I mean I literally cannot stop. I have to buy FNaF 4 on release day, I have no choice.   YES THESE ARE SCARY.  ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty different from the pervious ones and still keeps me on the edge of my seat! Scary and awesome!",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Easily gets tedious,but the minigames were just....good! The ending felt satisfying,the phantoms were creative diversions(RIP Bonnie),and Springtrap,just Springtrap.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike the first two games it is based on about 80 maybe 85 percent of skill the more you play the better you will learn the cues and react faster in order to survive the nights great game though for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not very scary but it's really fun to play!   I like the feel to the game.  I think it's the best FNAF yet.... It's kinda has the feel of FNAF1 but not as scary but I thoght it was much better than FNAF2!  It's more harder but it has the addicting feel! Their were a few things wrong with the game! It was much shorter, not as scary , No 7 night!  But other than that the game is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I love all the games but this one especially   + all the jumpscares + Keeps you thinking + SpringTrap is adorable + Can scare the hell out of friends using images - BB became more of a little ♥♥♥♥ ",
            "review_score": "1"
        },
        {
            "review_text": "In this new game, you will have a lots of jumpscares, easter eggs and a new story.I like that i can see the animatronic's moves. Really nice, GREAT! 10/10...HEART ATTACK SIMULATOR 2015",
            "review_score": "1"
        },
        {
            "review_text": "I love Five Nights at Freddy's a little too much, but this last iteration of the series felt... lacking somehow.  (not to mention a little glitchy) Fnaf 3 is pretty freaking spooky to be honest. Springtrap is foreboding, BB is horrifying, and watching Freddy stumble across your window, almost taunting you- It all looks very good. Watching the animatronics move is quite refreshing, and it makes you feel just that much more helpless than before.  The Pros? - Moving animatronics  -The disgusting run down building and animatronics are very atmospheric  -A plethora of hidden minigames  -The minigames themselves are challanging to figure out, but not impossible. The new style is great, and the pixel art is very creepy, definately an upgrade from fnaf2.  -provides some much needed plot information  -Truly frightening jumpscares  -Phone guy audio is very interesting  -Leading Springtrap around with sound is a cool new concept  -The ability to lock down vents is very helpful  -Leaving you alone the first night is an amazing way to let you start to figure out the controls and new mechanics -its fnaf 3  HOWEVER, for everything this game does right, it seems to fall short on several other accounts. Cons:  -The minigames might be a little TOO hard to find sometimes  -Once the puppet gets you its pretty much game over since he lingers far too long, and avoiding him is near impossible.  -There seems to be a glitch where you can see springtrap in two different locations at the same time  (very disorienting- seriously needs to be fixed)  -Once springtrap gets up to your window or door, theres nothing you can really do to get rid of him, usually leading to a very punishing and unfair defeat ( unfortunately this seems to be the trend with most of these cons :\\)  -Springtrap likes to teleport to your office from cam 2 or 3 without using vents (really upsetting since once he gets to you he cant be led away)  -Sometimes Springtrap likes to ignore your audio cues. Not sure if its a glitch, intentional, or if im doing something wrong, but its seriously upsetting.  -no tutorial or instructions to help you actually figure out the mechanics (not everyone enjoys trial and error)  -Springtrap's jumpscare is nonexistant (he looks more like he wants to hug you)  -The jumpscares dont seem to have any pattern or method of avoidance (namely foxy, freddy, and by the time you SEE puppet its too late to switch cams. also, I can only ever get away from chica SOMETIMES)  -Springtrap travels through the vents WAAAY too quickly. Once one of your systems goes offline, he usually decides to get in a vent and travel into or up to your office before you can even finish rebooting.  -This one may be a nitpick, but I prefer that failure not be left up to random chance.  It would be nice if ALL of the jumpscares had a warning of some sort, or weren't so crippling at least. While I think its absolutely fine to make the odds stacked against me, Springtrap shouldnt be able to teleport from cam 2 to my window in 3 seconds.  Overall, I enjoyed the experience, and this game is SO close to being amazing that its painful to give this game a negative review. But I just love this series too much to just let it be mediocre. The entire time, I felt like a beta tester, and im sure that that isn't what Scott was aiming for. To be perfectly honest, if this game gets a good patch or two, and most of these cons get fixed, I will certainly change my review.  This game has the potential to be a strong title in the series so long as these glaring issues are dealt with. Overall, I would rate this game at 6.5/10 until its fixed. (No matter how badly I want to give it 9/10)  Until then, Cheers, and keep up the great work, Scott. Can't wait to see what you come up with next.",
            "review_score": "-1"
        },
        {
            "review_text": "Made my lif a living hell!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely an improvment on the series. The first game was just scary, and that was at the end of the night, whether you died or not. The second game was not scary at all, but it was stressful and had a genius backstory, which I love.  THIS ♥♥♥♥♥♥♥ of a game here is a mixture of both, and the slow cursor movement doesn't help my short anxiety whenever i move to see if Springtrap is coming to kill me.  (not being critical, I'm just trying to explain what this game does to you)  So yeah, take the spooks of the first game and add in the stress of the second game and triple the effects, you get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 3 is amazing! Its scary and has stired up the community of FNaF players waiting for it. It uses some interesting features like the whole malfunctions and the vent sealing thing. The game has atmosphere, darkness, horror and interesting features. I dont really know what to say apart from its brilliant lol.  Overall rating is a 9/10, probably in my opinion the scariest FNaF out there!",
            "review_score": "1"
        },
        {
            "review_text": "hi scott this is amazing game and dont stop making five nights at freddys.Your so awesome making this i love your work but everyone wanted fnaf 4 i want that game to be on next year i wanted to be more horror as walking around. laters sincerly,christian",
            "review_score": "1"
        },
        {
            "review_text": "Wanna learn more of the story? well you've come to the rigth place as fnaf 3 explains how springtrap becasme springtrap and who springtrap wasbefore he becasme springtrap ! (lots of springtraps)",
            "review_score": "1"
        },
        {
            "review_text": "  This is the easiest out of the whole series. That doesn't make it bad, heck, I had fun playing this a little. Then I reached Night 6. Oh god, I can barely get to 3AM.",
            "review_score": "1"
        },
        {
            "review_text": "Saw the animatronic in my window...... No...... NO..... Time to quit. Whatever I'm making in this job, it's not enough.",
            "review_score": "1"
        },
        {
            "review_text": "This is not my favourite FNAF game. Though, I love it. No FNAF game will be as good as the first one. But I so have a nice story of me playing.  -Starts game -Sees Title -Starts Night -Explores Cams -Plays to Night 3 -Freddy slowly walks through the window -Presses Esc -Chucks laptop out of the window",
            "review_score": "1"
        },
        {
            "review_text": "The best horror game I've played in the series. For this one, it deserves some achievements. Just to be a tad more rewarding :p Either way, great game and I love it :D",
            "review_score": "1"
        },
        {
            "review_text": "i like the fnaf games and i dont wont it to stop at 4 games i would like it to carry on. for example we have had a restarant x2 and a horror attraction but where is still more scott can do cuz he is a genius on making five nights at freddys. i know he is capable on doing more games and keeping them original and good.  scott cawthon keep up the good work",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games that I have ever played!  The concept and game play is so simple but yet terrifying!  And a LOT OF LORE!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing horror experience for anyone who likes being scared...for the first few jumps. True, this game is still scary, as I still jump every now and again at the jumpscares, especially Foxy's (that son of a ♥♥♥♥♥). Anyway, the mechanics are a LOT different from the last two and the camera is the main focus of the game rather than the office for once, and that's a welcome change. This game is also easier than the last two by far, though that isn't a bad thing. If you're looking for a scary experience that lasts, this isn't it. I would recommend this to people that are just starting to get into the FNaF series. Great game overall, it just doesn't have the same impact on me as the other two did.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing! The best one of fnaf games.",
            "review_score": "1"
        },
        {
            "review_text": "Spooks Included",
            "review_score": "1"
        },
        {
            "review_text": "good game with some well made scares but its how repetitive it is that ruins it and turns it to a rage game so if u want it to have good scares put volume near full and use head phones 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "By far the best FNAF game yet. Furthers the story, improved gameplay elements, well done scott! My only complaint is that there is literally no threat of losing on the first night. It was helpful to learn the mechanics at first, but when replaying the game night 1 is very tedious.",
            "review_score": "1"
        },
        {
            "review_text": "I allready hated teleporting rabits, this game didnt help.",
            "review_score": "1"
        },
        {
            "review_text": "Scared my socks off 12/10 :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It is very realistic and I play it almost every day :3. There NEEDS to be a five nights at freddy's 4 because I love seeing what Scott can do with his game making experties",
            "review_score": "1"
        },
        {
            "review_text": "SPOILERS AHEAD!!  AMAZING. This game was a very big improvment from the 2nd game. You get to seal vents, play Balloon Boy (STILL SO ANNOYING!!!!!!!!!!) noises, mini-games, and an extra menu, where you can see all of the animatronics (Well, 2 of Springtrap, and none of Phantom Mangle, so that sux), their jumpscares (S. Trap has 2, P. Puppet and P. Mangle don't have any), all of the minigames (not Happiest day or after-night games), and lastly, cheats! There is Agressive, No Errors, Radar, and finally, Fast Nights. There are 6 very well done phantoms and one animatronic. Very well made, Scott Cawthon! Can't wait for the 4th!",
            "review_score": "1"
        },
        {
            "review_text": "I love the five nights at freddys series but this game was way better then i expected the jumpscares truth be told scare the absolute fudge out of me can't wait to but the forth game     10/10 would play again    [and the desktop fan is still here yay]",
            "review_score": "1"
        },
        {
            "review_text": "very good game, jumpscares are rubbish, wheres bonnie gone???????????????",
            "review_score": "1"
        },
        {
            "review_text": "if you have played the other 2 i dont really need to explain why you should get it if you have never played the other 2 i would reccomend go and check out number 2 ",
            "review_score": "1"
        },
        {
            "review_text": "I got this game through a humble bundle. So I haven't actually played the first two FNAF. But from what I can tell you it's a jump scare game, if you're not about that life and get scared easily, then you should pass and off to the next game for you.  I've heard a lot about this game through social media outlets, the book actually came out, if you go to your local book store it should be in the Teen section. I had to find out what the hype was about.   I've only played a few minutes of it so far, the game only takes up 111MB I think, fairly small game it's point-and-click. There's no tutorials on teaching you how to play, they pretty much just throw you into the water and you'll have to figure out what to do. From the few minutes I spent playing here's what I can tell you about some of the game's mechanics and plot.  Story line is you're a night-shift worker that has to deal with making sure the ventilations/audio/camera's are well and working throughout the night.   Objectives are: You have from Midnight until 6:00AM to survive the night. And you must survive for 5 nights I believe (which is the name of the game). It gets progressively more difficult each night obviously and there's a mechanical teddy that's out to try and kill you.   You can slow down this bear by closing off any ventilations and checking security camera's and using the audio noise of a kid laughing to draw the bear away from you.  So yeah, that pretty much sums it up.",
            "review_score": "1"
        },
        {
            "review_text": "It the best game",
            "review_score": "1"
        },
        {
            "review_text": "we just need a cheat like if you hold freddys nose then clike cs+ it will go to 5 am to 6 am plz add that in ",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of many easter eggs and closes the story line if your looking for a good game get this one",
            "review_score": "1"
        },
        {
            "review_text": "I really recomend this game. It is really fun and spooky at the same time!",
            "review_score": "1"
        },
        {
            "review_text": "yes it 's it a fine game but to hard for me i ony got to night 3",
            "review_score": "1"
        },
        {
            "review_text": "AWSOME THANK YOU SCOTT. Oh please Acept my friend recast",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 3  Thirty years since all this happened Thirty years it took to rise Blood on the floor and in their eyes They took the bite and left them to die Thirty years and now I'm here The only one left to scream in fear Your job means nothing when I've got you running Away with blood in your tears Take a look at me Can you see the death in my eyes? All the time you're waiting, I get stronger with power and force It's not as if they're paying you much   In Five Nights at Freddy's 3 I'll hunt you down and you will see You burn alive When you hit Night Five That's life In Five Nights at Freddy's 3 A horror ride built just for me Your doom is near Your time comes now You're just too late I'm coming for you now!  All these toys, yet not much time Before I take your soul tonight Piece by piece I build your fears What can we use to end this right? All these vents and all these rooms The camera keeps you from your doom Cause nothing stops me from the past that's rotting I'M STILL HERE, ♥♥♥♥♥! Your fight ends soon! Now I'm free to take your soul and place it in mine All the time you're waiting, time grows longer and longer inside Before you know it, your soul is mine   Thirty years ago, they used to be just toys Just. Playmates But then it happened The fire in their eyes became unstoppable, indestructible They were machines ready for their final act But thirty years have passed And patrons renewed the franchise, rebuilt the nightmare Poor fools What the ♥♥♥♥ have they done? WE'RE COMING FOR YOU!  12AM, you sit and stare 1AM, I start the fair 2AM, I zip and zoom 3AM, I come for you! 4AM, ♥♥♥♥ just got real 5AM, you know the deal! Let's hope you make the last hour count! It's time to die   What can we use? The power divine Your fight ends now Burn alive in Night Five! What can we use? The power divine Your fight ends now Burn alive, in Night Five!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Best furry yiff simulator",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It may not be exciting for some, but in that case they shouldent have got the game. Its not the story of the game I adore, its the story that goes on in the background that I love, like what happened in the last two games. Also the minigames in this one are optional and dont happen when you die which is a plus in my book!  Well done Scott, I hope your games in the future are as sucessful as this series was.",
            "review_score": "1"
        },
        {
            "review_text": "Five Nights at Freddy's 3  Thirty years since all this happened Thirty years it took to rise Blood on the floor and in their eyes They took the bite and left them to die Thirty years and now I'm here The only one left to scream in fear Your job means nothing when I've got you running Away with blood in your tears Take a look at me Can you see the death in my eyes? All the time you're waiting, I get stronger with power and force It's not as if they're paying you much   In Five Nights at Freddy's 3 I'll hunt you down and you will see You burn alive When you hit Night Five That's life In Five Nights at Freddy's 3 A horror ride built just for me Your doom is near Your time comes now You're just too late I'm coming for you now!  All these toys, yet not much time Before I take your soul tonight Piece by piece I build your fears What can we use to end this right? All these vents and all these rooms The camera keeps you from your doom Cause nothing stops me from the past that's rotting I'M STILL HERE, ♥♥♥♥♥! Your fight ends soon! Now I'm free to take your soul and place it in mine All the time you're waiting, time grows longer and longer inside Before you know it, your soul is mine   Thirty years ago, they used to be just toys Just. Playmates But then it happened The fire in their eyes became unstoppable, indestructible They were machines ready for their final act But thirty years have passed And patrons renewed the franchise, rebuilt the nightmare Poor fools What the ♥♥♥♥ have they done? WE'RE COMING FOR YOU!  12AM, you sit and stare 1AM, I start the fair 2AM, I zip and zoom 3AM, I come for you! 4AM, ♥♥♥♥ just got real 5AM, you know the deal! Let's hope you make the last hour count! It's time to die   What can we use? The power divine Your fight ends now Burn alive in Night Five! What can we use? The power divine Your fight ends now Burn alive, in Night Five!",
            "review_score": "1"
        },
        {
            "review_text": "Only 21 minutes on record but im on Night 3. This game is harder than the others and I plan on trying to win but I either dont have time, dont want to play or am scared. I recommend this game highly and I'm happy i voted for it on Greenlight.",
            "review_score": "1"
        },
        {
            "review_text": "scott cawthon am will you plesea put toys in five night at freddy 3 scott cowthon i love five night at freddy but will you chenangle the cheats on the plesea",
            "review_score": "1"
        },
        {
            "review_text": "Get screamed at, Repair crap, Get a hug from springtrap.   -10/10 Would play again",
            "review_score": "1"
        },
        {
            "review_text": "I almost sh#t my pants. 10/10 DAHT JUMP DOE",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game. I reccomend this game to people who like to play horror games, because it is really scary. I rate it 5 stars 10/10. And its really hard too.",
            "review_score": "1"
        }
    ]
}