{
    "app_id": 354240,
    "name": "Please, Don’t Touch Anything",
    "release_date": "2015-03-26",
    "developer": [
        "Four Quarters"
    ],
    "publisher": [
        "ForwardXP"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Commentary available"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 15,
    "positive_ratings": 2493,
    "negative_ratings": 393,
    "price": 3.99,
    "description": "A brain-racking game about bathroom breaks, screwdrivers and nuclear explosions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354240/header.jpg?t=1498065674",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 / 8 Processor: Any processor with at least 1.0GHz Memory: 512 MB RAM Graphics: Any card with at least 128MB Storage: 50 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "TLDR: I got this game at 50%, and still feel like it wasn't worth it.   The Good",
            "review_score": "-1"
        },
        {
            "review_text": "Things have changed since the review: on release, everything had a single puzzle (except the green buttons). The larger update did change that, which is good. I still don't like the game, but I absolutely concede that the developer made the game more expansive.   HOWEVER, from my original review, I still have issue with the fact the game has no world building. There is no narrative consistency to the endings. They reveal nothing about anything about the world and almost all result in the city being destroyed in a variety of comepletely unrelated ways.  The puzzles themselves are fine, but not exactly that difficult. Since the release of the update there are now quite a few puzzles. I know it's only $5, but I can't really recommend the game to a general audience, nor would I recommend it to people who are making the connection to Papers Please. I made that connection, but it's wrong. If you like puzzles with easyish answers, then yeah this could be your thing.  Caveat: Do you like logic puzzles and clue hunting? Yeah it's probably okay. But still, let me stress the lack of any kind of world-building. It's like sudoku.",
            "review_score": "-1"
        },
        {
            "review_text": "They told me not to touch anything.  I touched everything.   11/10",
            "review_score": "1"
        },
        {
            "review_text": "The title is already explained whole idea about this game. Just 'Please, Don’t Touch Anything.'  There are a total of 25 endings in this point &amp; click game. All endings can be obtained by solving puzzles that had been packed in carefully by the developer. Epicly fun adventure to fiddle with.  PS: Don't tell my friend that I did touch something in this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little puzzle game. If you're bored and need something for your brain to do for a bit, this is what you're looking for. Anybody who says that the puzzles are random is either lying or not taking the time to think through the hints staring you in the face the whole game. Really not a bad game for the price.",
            "review_score": "1"
        },
        {
            "review_text": "I was heavily and pleasantly surprised with this game. I can't say for sure what I was expecting, but, well, it wasn't that.  Which is a good thing! The element of surprise works wonderfully with the game, that always creates new and interesting things to do in the room you're in. I really liked how all the elements of the interface in the game are utilized - you have to pay attention to the smallest clues and details, and this investigation was very rewarding.  The puzzles are very interesting and challenging, and I loved the meta-like style - using paper, taking notes, making calculations and logic deductions, the game has kept me engaged throughout with a diverse set of actions. It was challenging and ultimately, a excellent experience.  I think the only problem I have is that there could've been... more. Not in content or in lenght, but some semblance of narrative or a bigger theme, which some similar games have. As it is, the game is more like a puzzle box, a way to explore a single environment. It's great at that, mind you, but there could be more to make the experience more fullfiling and memorable.  Still, extremely recommended, even more so if you can grab it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't last an evening, but that doesn't take away from the fact that it was a fun little puzzler with good music. Should really be a 99c game though.",
            "review_score": "1"
        },
        {
            "review_text": "Please Don't Touch Anything is a puzzle game, where the goal is to literally  touch everything . There are many cryptic hints that help you get to the various endings, but it's only a matter of time before you pull up a guide to get the endings :) It's a very short and refreshing game that makes your brain work, games that we need more of. Each ending is interesting, and make you smile(like the illuminati one). Definitely worth a play!",
            "review_score": "1"
        },
        {
            "review_text": "I touched things. They touched me. I could not touch myself. Although, I think afterwards, I am touched in the head. I am still figuring out what I should and should not touch.",
            "review_score": "1"
        },
        {
            "review_text": "The equivalent of a flash toy on Newgrounds. Some of the puzzles are clever, but most of them require some form of moon logic to penetrate. Nice art, nice music, but no replayability and the use of a guide (required for some puzzles) will take any feeling of accomplishment out of the puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "DON'T MAKE A PENTAGRAM IN THE GRID SATAN WILL KILL YOU DON'T DO IT",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the Stanley Parable or like old fashioned logical puzzles, then this is the game for you. Easy to obsure clues, touch in cheek references, and a couple of outright tedious tasks that will make perfectionists and achievement hunters groan.",
            "review_score": "1"
        },
        {
            "review_text": "They told me not to touch anything.   In the end, I learned to touch...  ... everything .  [ single tear streams down face ]",
            "review_score": "1"
        },
        {
            "review_text": "Crazy, annoying but FUN :beatmeat: bloody puzzles XD",
            "review_score": "1"
        },
        {
            "review_text": "YEAH I DIDN'T TOUCH ANYTHING AND I WON THE GAME!!  Well,just a joke though I think nobody would laugh…  It has more than20 endings… About aliens, evils,and maybe you have just destroyed a world when you are playingXD  You need to look for all things on the screen, however,you still cannot get all the endings because that is so hard… SO HARD!!!!!!!!  IF YOU WANT TO GET ALL THE ENDINGS,YOU SHOHLD HAVE THOSE： * TIME 00：00 or12：00  *A QUICK SPEED TO HIT THE MONSTER * LUCKY ENOUGH TO CATCH THE HIDDEN ENDING * THE BRAIN THAT IS THE SAME AS THE PRODUCER, or JUST CLEVERER.  And I suppose you to play the DEMO in LD31 first…to make sure you can find at least 5 endings…Then you can buy it.",
            "review_score": "1"
        },
        {
            "review_text": "This awesome game has everything. Controls are simple, yet complex. Familiar, yet intriguing. Full of references, yet unique.  Please, Don't Touch Anything is a one of a kind puzzle game, that forces you to think inside the box, outside the box and not think about the box at all. You are literally insane if you don't get this game while it's in the sale. After you finish you'll look for ways to give the publishers the full price.  ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun little game. the German Subtitles are a pain in the ♥♥♥, but also funny, it feels like someone translated it with the google translator..., would like another version. ",
            "review_score": "1"
        },
        {
            "review_text": "I went into this game not expecting much, and I didn't get much. It's a single screen puzzle game that is too difficult and not fun enough.  The game requires a walkthrough - it would take hours to figure out each puzzle, code, and encryption for the game. Each 'playthrough' lasts at maximum, 5 minutes, and then you click reset to try again. Watch some gameplay and you've seen the whole game. It is at maximum a 3 hour experience, however, the game doesn't pretend it is triple-A which I respect.  Unlike similar games, there is no challenge, no story, no progression, nothing. It really, truly, is a short toy. And it accomplishly that decently, at best.  You may be told 'Oh, it's cheap', but I'm not looking at price. It just wasn't all that fun. Kongregate honestly is a better use of time, for free.  Read a walkthrough of the game and you'll see what I mean. Clicking a button 275 times exactly isn't very fun. Clicking a button, then 33221323 or whatever isn't much fun either. The puzzles aren't rewarding and are not intuitive.",
            "review_score": "-1"
        },
        {
            "review_text": "Just my sort of thing. You can pick it up and play it for a short few minutes or you can dig into it for a couple of hours straight. The difficulty curve seems just right though I'll admit to having cheated on one of the puzzles.  There are not a lot of hours in this through to completion but, if you like puzzles, it's pretty much pure joy every minute as you uncover a new piece of the puzzle.  This kind of reminded me of the early (good) bits of Lost (the TV show) mashed up with Papers, Please (to which there's a gratuitous reference in this game) and one of those 'escape the room' games.  Addictive, witty, and fun,",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game but a bit hard at some point. You should definitly play it, it's a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "I did not expect a whole lot from this, at most a pleasant way to waste some time.  I was wrong.  I spent about an hour playing without even noticing. It is addicting. Definitely good for those into puzzles and hidden messages.",
            "review_score": "1"
        },
        {
            "review_text": "You know for a game that is politely asking me to not touch anything, it sure does make it fun to TOUCH EVERYTHING! This turned out to be an amazing sale buy for me. I love puzzles, and this was one heck of one. I don't wish to spoil anything but the multiple ways to solve this particular one is amazing. There are a bit that are far too subtle that I admit, I had to look up, but overall it's worth every penny.   My only gripe is, I want more. I want more ways to solve it, I want more clues to catch onto. And as you may guess there is very little replay value once you've figured out how not to touch everything. I find it amusing the developers know this as one of the last achievements is basically saying 'Well you can uninstall it now.'   Still, got this on sale for 2.50 and it's worth every penny, and if you like this, go buy Papers, please because it's just as oddly engaging.   A game you will enjoy thoroughly (assuming you like a good puzzle) but then wonder where the time went. And pro tip, don't cook when first playing this. You will forget it's on the stove and it will be very burnt and you will eat it anyway because food is expensive and you are poor. /cry",
            "review_score": "1"
        },
        {
            "review_text": "Got this on steam sale for $2.50 and was worth that price for the entertainment for this evening, but I'd struggle justifying a ton more than that.   All in all if you like trial and error setups / brain teasers then you'll like this. Dont get me wrong its not all just pushing random buttons until you find a combination that works because at the end of the day all the hints and clues are there, Some more obvious than others and some are more prone to accidentally entering the correct sequence without actually knowing where the sequence or hint actually came from.   After tinkering with it for about an hour and a half I was able to navagate and locate most of the pieces you would use and was able to achieve most endings (all but about 6-7) of which I opted to look up the solutions online and was plesently surprised that atleast half of those I was on the right track to and probably would've gotten it had I stuck with it, but my frustration levels peaked. To be honest some of the most annoying parts of the game wasn't just solving the clues or finding how to unlock the controls but rather figuring out which control should be used to enter what clue. Sometimes I would spend a great deal of time trying to figure out how to force a code I solved in the clues into a control only to later find that it was supposed to be entered in a differ control.   Ultimately the only hints I will give you to help ease your frustration is to try and pay attention to when you start inputing a sequence into a set of buttons. They almost always show a number of blanks/used key strokes on the monitor. If you have a 4 key number/sequence and you see 6 spots for entry when you start entering, then just skip that sequence as it goes somewhere else. And take note of everything, hints are nicely crafted into just about everything, so if it seems like something it trying to tell you something then it probably is.  8/10 its a good time killer but ultimately once you solve the problems then its essentially unplayable for you, and while I suppose you could take days/months to solve the couple more difficult puzzles if you wanted to do them without help/walkthroughs, Well I just can't see that being continued fun beyond the first few hours since you'd litterally spend days just repeating the same old cycles trying to figure out what you're missing. For me, spending 2 hours or so solving most the puzzles on my own and then going over the harder solutions with a walkthrough was satisfying enough for my needs. I'll probably just let my friends tinker with this game now to see how well they do, other than that its probably going to be uninstalled =P",
            "review_score": "1"
        },
        {
            "review_text": "Please Don’t Touch Anything is a small indie game where you’re filling in for a friend that has to go to the bathroom. It’s not clear what your friend’s tasks are, but his workspace contains a giant metal panel with a single red button and a monitor displaying a view of an anonymous city. His only instruction for you is to not touch anything until he returns. But that big red button is really hard to resist!  There are 25 different endings to Please Don’t Touch Anything, most of which do not do the city any good. It takes only a few steps to reach any of them. The first endings are quite easy to reach. You basically try stuff and see what happens (for examples, new buttons appear on the metal panel). But other endings are much more complex, requiring you to analyse small clues hidden within the scene.   I found half the endings before feeling helpless. Reading a walkthrough, there were maybe 3 additional endings that I could have figured out eventually, with more dedication. Although I understand the remaining ones, most are fairly gratuitous and it’s hard to imagine how players could stumble upon them on their own.  Graphics are entirely made of pixel art. A quick glance at the screenshots will confirm they’re functional but unspectacular. The soundtrack, on the other hand, is a perfect match for the game. It’s chiptune from start to finish, responds to your actions and instils a certain tension, giving the stakes an importance the gameplay alone wouldn’t allow.   Overall, Please Don’t Touch Anything is a decent curiosity that can entertain for a couple of hours, but it’s not an especially clever or polished design. I wouldn’t recommend it especially warmly but there are worse ways to spend 5 bucks and the best part of an evening.  Rating: decent ",
            "review_score": "1"
        },
        {
            "review_text": "It's a decent time-waster of a puzzle. Get it while it's cheap.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that you will kinda already know if you are going to like it based on the premise/title alone. Do you like pushing buttons? Do you like avoiding explicit instructions? That's this game. I don't mean it as a criticism. I bought a game to push buttons randomly and push randomly I DID. And I had fun while I did it!  Do you find randomly clicking buttons with little to no feedback an appealing concept? Because that is literally the entire game. I will say that I had a really hard time solving some of the puzzles (and some I stumbled upon by accident), but those that I genuinely solved without help gave me that good feeling you get from a challenging video game puzzle. Unfortunately, those that I needed some outside help to solve just made me feel bad. I don't want to call it a failure of the game that the puzzles were too hard for me (that's MY failure), but it would have been nice to have a hint or feedback system of some sort just to give a better idea of how to get to the various endings BESIDES the cryptic clues spread around the room. That said, all the clues ARE there, I saw them all at one point or another, I just didn't know how to read them.  The game is funny, and a good diversion for an hour or so. It's not long, but it's fairly priced for that, and really, you know what you're getting into when you buy it. Get ready to click.",
            "review_score": "1"
        },
        {
            "review_text": "I touched things.  And I liked it.  Yolo, or whatever you kids say.",
            "review_score": "1"
        },
        {
            "review_text": "Please, Do not touch that button!  Crossing several apocalypse genres into one small room with one intimidating machine, Please, Dont touch anything is a breath of fresh air for puzzle enthusisats. With a fantatic art direction and a hypnotic soundtrack, this game may be reminscent of games you may have played, but above else is cahllenging, inventive and deep.  With 16 endings and sharp wit this game draws you in and makes you challenge authority to find out 'what can I do with this single red button?'",
            "review_score": "1"
        },
        {
            "review_text": "Don't touch Anything... at all!!!  And... you just can't hold yourself and hit that button huh?  Then you gotta try so many combos and see different outcomes?  Well you're at the right place! :P  Please, Don't Touch Anything is a little sweet puzzle game that is refreshing to say the least. About 25 different outcomes that portrays different endings. Some you may discover yourself but I highly suggest you read a game guide from the Community game hub!  For it's cheap price and some fun puzzle-like challenges, I recommend this sweet indie game! The only CON I can talk about are some achievements are locked into some endings and some perfect sequences. If you ain't an achievement 'wh*re', then ignore that CON and play ahead!  Please, Touch Everything!",
            "review_score": "1"
        },
        {
            "review_text": "i dont know why no one has posted a review about touching themself.o-o  as a serious review,this game is pretty good,you have to be Christopher Michael Langan on steroids in order to unlock most endings,which if you're not,its a good time killing to think on the endings. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "what the actual ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "A short game, but the puzzles are somewhat tricky, and some of the achievements are challenging.   But is it fun? Oh yes! Yes it is. The art is really nice and well done, the sound is amazing (and how it distorts when you go into the menu is brilliant). The puzzles are well thought out, and it's a great experience right through.   Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "  I blew up the city.    That was the first of many endings I got that I will not spoil for you. My time spent waiting for my friend to get back from the bathroom in-game was one that challenged me to think, be very (and I mean very) observant, as well as experimental with how I approached the game. It left a very pleasant experience both in execution of the game itself, and the music they paired with it.   It is a short game as I do not see it taking people more than 5 hours to beat, and your mileage may vary. I have all but 3 endings as well as some achievemnts to get myself. With the price being at $5, this is an easy recommendation for me to make as it is cheap, and quite a fun and challenging experience.",
            "review_score": "1"
        },
        {
            "review_text": "Better than 999",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best $1.49 of my life",
            "review_score": "1"
        },
        {
            "review_text": "The entire game is one big easter egg, except that there are a lot of easter eggs. So it's more like a kinder egg would only good toys, and a sweet soundtrack to boot",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game. Has simple, complex, and decievingly 'complex' quzles. Multiple pop-culture references and nods to other games throuout. Be sure to look closely to everything that you see in the game, answers to puzles are hidden throuout. Highly recomend playing this game. Oh, and just try to get that 100%; perfection isn't always easy. One final thing— yes, it IS supposed to crash at least once— don't freak out.",
            "review_score": "1"
        },
        {
            "review_text": "great sense of humour, great music, great art, great puzzles, great fun. it rewards you with cute posters for being curious enough to Touch All The Things, Especially When You Really Shouldn't Have. definitely worth the full price; I can definitely see myself playing through it more than twice because it's so interesting to play with.  I'm going to use my second playthrough to horrify my friends with the Satanic &amp; Blood endings.",
            "review_score": "1"
        },
        {
            "review_text": "very good game i beat it it can get tedious but its all worth the endings as they are badass to watch i give credit to those creators they worked hard on it and did a fantasic job also if you ever get confused use a guide :D",
            "review_score": "1"
        },
        {
            "review_text": "A fun little puzzle game. Not too long or too hard but still very fun. The achievements were intresting and none of them were really hard at all. Very well worth the $5.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great short game, with a lot of secret achivements and plenty of endings, plus some tryhard achievements as well.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzle is good, but the only thing that makes me fascinated is the 'skinner box'. An inspiring game design.",
            "review_score": "1"
        },
        {
            "review_text": "Just touch everything!",
            "review_score": "1"
        },
        {
            "review_text": "Lol great game, hard to figure out some of the endings but still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "A surreal point&amp;click puzzle in graphical style of 'Papers, please'.  Could last you an eternity, unless you use a guide. That's because some solutions are really obfuscated and hard to figure out by yourself.  Unlocking half the endings by myself and using a guide for the rest took me 2 hours. I could say the game is a bit expensive for such little play time even with the 50% discount, but that would be unfair since I used the guide to finish quickly.  Has very nice music.",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle game where the goal is to look at various hints around the room to determine what stuff you need to mess with to get a given ending. The difficulty is nice in that if you do end up needing to look something up, you'll have one of those 'man, how did I not figure that out on my own?' moments, and some of the puzzle hints/solutions get pretty creative.",
            "review_score": "1"
        },
        {
            "review_text": "I had a blast trying to solve the puzzels, but to be honest, only solved 4 of the 22 without help. :P It's rather unique in it's way of using the environment to have you solve the puzzels. The soundtrack is wonderful to listen to and may be worth the buy. It took me 6.8 hrs to 100% the achievements, so if you think a couple bucks is worth that amount of time, go for it!",
            "review_score": "1"
        },
        {
            "review_text": "I just picked up this game today, but I am extremely impressed by it. It has that Papers, Please vibe to it which made me buy it instantly. An extremely simple game with some story and quite a bit of mystery behind it, but I don't understand how you are supposed to find all the endings by yourself. Still a great, yet short game.",
            "review_score": "1"
        },
        {
            "review_text": "A bunch of fun to mess around with, but once you've unlocked the last ending there's not really much else to do. Definitely worth picking up on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Touch everything.",
            "review_score": "1"
        },
        {
            "review_text": "5€ for an interessting game? Deal! Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "I didn't mean to do that... Or that... Or that...  I'm so sorry.",
            "review_score": "1"
        },
        {
            "review_text": "jokes on you i touched everything",
            "review_score": "1"
        },
        {
            "review_text": "I only touch myself.",
            "review_score": "1"
        },
        {
            "review_text": "Gave me coffee :D",
            "review_score": "1"
        },
        {
            "review_text": "Pros; - Short - Interesting - Charming graphics  Cons; - Short - Sometimes annoyingly intricate and confusing - 2spoopy4me",
            "review_score": "1"
        },
        {
            "review_text": "Just go and touch things already. It's actually better than it sounds.",
            "review_score": "1"
        },
        {
            "review_text": "4/10  Not my cup of tea. I couldn't get very far pressing buttons and trying to make sense of the obfuscated instructions, so I continued with a guide (EddieBowie's). As expected, this made things very mechanical and unsatisfying.",
            "review_score": "-1"
        },
        {
            "review_text": "Very enjoyable sort of puzzle box, kind of complicated. Best tackled with a few friends, it's best approached with multiple perspectives.",
            "review_score": "1"
        },
        {
            "review_text": "Started the game  Was told not to touch anything  1 minute later, was given thanks  Got bored not doing anything  Picked up hammer and smashed button  Spawned an unborn fetus  Smash the fetus to death  10/10 would smash fetuses again",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever vote for this game on the Steam awards please the devs are awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I had fun solving puzzles and finding a bunch of endings for about an hour. Some of the puzzles are very logical and you're clued into the solutions in clever ways, and you find different endings by solving some of the puzzles in specific ways. You spend the entire game in front of a single desk that changes depending on which puzzles you solve in what order, and it uses music and sound effects really well. It just feels cool, right when you start playing.  But getting all the endings and solving some of the puzzles get in the way of each other in some pretty frustrating ways. Plenty of the puzzles have less logical solutions, and require that you repeat the same series of actions before you attempt to solve them. Restarting the game to make another attempt is quick, but actually figuring out how to get a lot of the endings stops being fun and starts being tedious. It's something like pixel hunting, but it isn't an issue of graphical limitations, as the game looks very nice. The issue is that you're hunting for clues that you only get from following a specific sequence of events, and to actually use them to solve a puzzle, you need to reset the game and solve a series of puzzles that gets progressively longer as you try to unlock later endings.  One ending, for instance, requires that you find one way to beat the game, make note of some symbols before the game closes itself, reboot the game, complete a specific series of tasks that you can easily lock yourself out of if you haven't trial-and-errored your way into finding the specific puzzle that this clue solves, and then input the symbols. This is not the only puzzle you solve like this, but it is one of the simpler ones in this vein. Two of the endings are unlocked through the exact same series of puzzles, but since you can only get one at a time, you need to do it twice. PDTA is an incredibly repetitive experience and, after a pretty short time, stops hiding clues that make logical sense in clever places and starts being totally impenetrable.  It's just disappointing for a game to leave a really great first impression and then to just totally fall flat.",
            "review_score": "-1"
        },
        {
            "review_text": "0.5-1h wasted on this game and half of the time I already felt like this game had nothing more to offer. It's supposed to be a clever puzzle game, but clever seems to refer to being as incomprehensible as possible. I achieved 6 obvious endings in no time by just clicking (and not clicking) around and after that the joke had dried out and nothing made sense anymore. There are a few 'clues' but they really don't match with the tools and buttons I had managed to open. I tried all sorts of combinations without any results or feedback. I really don't see what else to do with this. In short, the game is very unappealing and hard to approach.   Of course I could search for hints or follow some walkthrough to 'play' the game through and to 'achieve' what ever there is to achieve but why to bother. The game gives very little reward for the effort. Got it almost for free, but I feel like it should have been free...",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get this game",
            "review_score": "1"
        },
        {
            "review_text": "Probably not worth the money, but it was a fun 45 munites.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "(Papers) Please, (Don't) Touch Anything.",
            "review_score": "1"
        },
        {
            "review_text": "The trailer says it all.  I'm boring and I know it .",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game for the lower teens: 1 - Push buttons and random things happen. 2 - Get all the random endings to beat the game.  The game is completely pointless, made for morons, and it was thus a waste of my time and money, even though it was on sale when I bought it.  The only positive thing that can be said about this game, is that I liked the pixel graphics and the chip tunes doesn't hurt my ears. ...so technically this didn't cross the line into torture. ...but pressing the same button over 1 000 times sure came close to it. ...because there's an ACHIEVEMENT, you see. ...that you 'have' to get. ...just to feel accomplished. ...because you're a moron. ...raised by a single mom.",
            "review_score": "-1"
        },
        {
            "review_text": "It was a waste of my money. the only reason i got it was because i thought it would be more than just pressing stuff. it wasn't it was a boring ♥♥♥ game",
            "review_score": "-1"
        },
        {
            "review_text": "It's like Skyrim with buttons. 9/11 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Not funny. Not entertaining. Borderline pointless.  You could call it clever if you had to call it something.",
            "review_score": "-1"
        },
        {
            "review_text": "I heavily suggest it if you like puzzles, and a bit of weirdness",
            "review_score": "1"
        },
        {
            "review_text": "I didn't particularly like this game. You'll have to use a walkthrough. Not much of a story. Kinda funny I guess, but it just wasn't my thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Just don't touch anything.",
            "review_score": "1"
        },
        {
            "review_text": "Great sound track, I especially love games where you have to pay attension to play ° ͜ʖ ° If you have an attension span be sure to pick up this game, nerd ° ͜ʖ °",
            "review_score": "1"
        },
        {
            "review_text": "Waste of money. You just stare at the screen and listen to boring, repetitive music. Why are they charging money for this?",
            "review_score": "-1"
        },
        {
            "review_text": "1/1 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing work, would absolutely buy a second one.",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game. But it ain't my cup of tea. Good:  Fun. Has Illumernarti. Bad:  Kind of overpriced. Gets boring after 15 minutes. Kind of repetitive.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Fun for 20 minutes.. which is fine for a game that's priced the same as a cup of starbucks coffee.",
            "review_score": "-1"
        },
        {
            "review_text": "I expected this to be an amusing disobedience game where you discover different funny endings through exploration. It's exploration, but there is no ryhme or reason and no logical consequences to what you do. It may be hilarious to some, but I thought it felt disjointed and uninspiring. OK, it was a little funny when the All-Seeing Eye flashed onto the screen, and then shut off the game. But I didn't bother starting it up again.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh.  I touched EVERYTHING.",
            "review_score": "1"
        },
        {
            "review_text": "its cute",
            "review_score": "1"
        },
        {
            "review_text": "It is cool. that big red button and everything.",
            "review_score": "1"
        },
        {
            "review_text": "4/5",
            "review_score": "1"
        },
        {
            "review_text": "I got this 'game' because I like the 'Papers Please' pixel art aesthetic, and I like logic puzzles. This 'game' is just one of those two things. Everyone that says they completed this game with ZERO help from guides, well I would go out on a limb and say they are lying. Alot of the solutions in this 'game' are REALLY obscure, to the point of almost being random. If you like paying money, to literally press the same button THOUSANDS OF TIMES, then by all means, please buy this 'game'. I feel ripped off for paying three bucks for this non-sense garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "boring and pointless",
            "review_score": "-1"
        },
        {
            "review_text": "ILLUMINATI CONFIRMED!",
            "review_score": "1"
        },
        {
            "review_text": "This game gave my computer a virus, do NOT download this game. It gave my computer over 10 viruses. DO NOT DOWNLOAD!!! You have been warned.",
            "review_score": "-1"
        },
        {
            "review_text": "The puzzles would be simple if not for the fact that they're so opaque you're left guessing most of the time. Even then, the game is much too short to be worth the price. Perhaps if there were humour to keep the game amusing while you're trying to figure out what to do next or how to unlock the next ending, but there's no humour to be found here. Ultimately, it's just not much fun - there are much better games on Steam to spend your five bux on.",
            "review_score": "-1"
        },
        {
            "review_text": "its amazingly difficult, so difficult I dare you to finish it. But is fun, really fun.",
            "review_score": "1"
        },
        {
            "review_text": "I feel smart, I feel stupid, who would create such a game...this was horrible! I love it! ",
            "review_score": "1"
        },
        {
            "review_text": "More than a sideways thumb - I appreciated that the game tried to do something outside the box (no instructions, try different things) but I don't think the majority of the gamers including me would want to invest the time cracking the codes in order to unlock the endings.  For the money, it wasn't a bad buy to experiment with something different, but other than I'm not wanting more.",
            "review_score": "-1"
        },
        {
            "review_text": "Every single number, every single scratch means something. Its horrible. I bet i could add some more scratches on the wall and + 10 endings. Few endings have some logic, other are just 'happened'. No interesting puzzles or thinking, everything is 'written' somewhere and u have with tens different pannels decide where to enter it. Just one by one. Passed only the begining myself, others with walkthrough later.  Waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun yet difficult game to figure out, really good for when your bored and looking for a small game to play",
            "review_score": "1"
        },
        {
            "review_text": "0/10 i didnt touch anything and nothing happened",
            "review_score": "1"
        },
        {
            "review_text": "This game is not for everyone and is mainly for those of you who are REALLY smart and clever. This game is fun, has an awesome soundtrack, Has a kinda creepy tone, and will probably stump you... ALOT.",
            "review_score": "1"
        },
        {
            "review_text": "Really weird puzzle game. But it's fun if you like a challenge. Don't think it's easy to push a red button and accept the consequences. You have to own your choice. If you come from 'Papers, Please' you are going to love it. Just keep pressing that button you never know what can happen.",
            "review_score": "1"
        },
        {
            "review_text": "5/10 If you skip this game, you are not missing anything.  I will say the main benefit of this game is that you can play it with just the mouse, and when you're half asleep. It's a little bit interesting to find the different combinations and endings, but you will need to enjoy solving mostly trial-and-error puzzles by going through lots of different combinations of actions.  The payoff of finding a new ending to this game just isn't very satisfying for the time invested. If you want a great exploration/puzzle game where you can do things you're told not to, try The Stanley Parable.  Please, Don’t Touch Anything might be a decent time-killer game for a weak-powered laptop when you're on the go.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a bit boring... puzzles are nice and all, but this game has no interesting mechanics nor does anything interesting happen after solving them. And if all you want are some good puzzles, then I'd think there's better alternatives.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun little puzzle game although can't help to feel like there could be more in it. Alot of the puzzles seemed unneccesarily complex for such a small game and I felt like the game demands too much of me while not really giving me enough in terms of enjoyment, but if that's something for you then go right ahead and try it out.",
            "review_score": "-1"
        },
        {
            "review_text": "Baby fetus boss battle music very awesome, much aksyon, worth mah moni. :D  Really worth it for near a dollar, bought it on winter sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like fapping yourself out hardcore by pressing a single button. i rate it fapping/10 IGN.",
            "review_score": "1"
        },
        {
            "review_text": "It's short, but really fun, and rather difficult to figure out. I couldn't figure anything out without looking at a walkthrough x.x",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game - but listed as Mac Compatible, which is a bold faced lie...I have a PC to play it on...by my laptop is a 2015 rMBP and this program won't open on it...   I take it back...I reinstalled the game...twice...and it's working in El Capitan now...",
            "review_score": "1"
        },
        {
            "review_text": "Deceptively simple but with a lot of replayability. Good thing, since each game is over in about 5 minutes...",
            "review_score": "1"
        },
        {
            "review_text": "Very mysterious game if only into it certainly clutter up it is necessary well to play games of this type although this game has also much hint this game for me is a game against the step lower than my favourite Replica games",
            "review_score": "1"
        },
        {
            "review_text": "Very nice little game with a ton of endings, secrets, minigames and puzzles. The music is calming and mysterious and the animations and art look nice, even if there isn't too much of it. ",
            "review_score": "1"
        },
        {
            "review_text": "Please, don't touch anything.  BOOM  I PUNCHED THE LOVE BUTTON! (if there is one :P) This game blew my mind. I watched youtubers play Papers Please (Jacksepticeye) and that game was amazing!   and difficult....   When this game came out it was full of fun and hard activitys.   That Paper Please reference was funny :D   Thanks for that. I would recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "  ... please why is this game so attractive.. it's destroying my brain  Halp plz, HAAAAAAAAAAAAAAAAAAAAAAAAAA Halp  P.S : Buy it, Right naw. B U Y I T.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun and intuitive, if you're into this kind of game. Lots of trying and retrying things, hunting for clues and whatnot.",
            "review_score": "1"
        },
        {
            "review_text": "Synthwave ominously caresses your synapses as you inadvertently or intentionally bring about the end of days with your curiosity, impatience &amp; or malice. All in the name of achievements. Somewhere, Perturbator sheds a happy tear.",
            "review_score": "1"
        },
        {
            "review_text": "I touched things. City sploded. 10/10 would touch again.",
            "review_score": "1"
        },
        {
            "review_text": "An intresting puzzle game. Simple concept, simple interface, but with plenty of supprises and hidden paths (gameplay wise) you can explore and experiment on. Would definitely recommend to anyone who's interested in solve puzzles and decoding hidden passcodes.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;click&gt;...........&lt;click&gt;&lt;click&gt;&lt;switch&gt;............&lt;click&gt;&lt;click&gt;&lt;switch&gt;&lt;turn&gt;&lt;dial&gt;&lt;click&gt;&lt;BBEEEEEPPPPP&gt;&lt;VROOOM&gt;&lt;switch&gt;&lt;DINGDINGDINGDINGDING&gt;&lt;click&gt;Mclickclickclickclickclick&gt;&lt;BOOOM!!!!!!&gt; *restart*",
            "review_score": "1"
        },
        {
            "review_text": "If you go through life not touching things, then you sure are missing out. If you've been missing out, then buy this game and touch everything, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game and confusing some of the puzzles are very hard",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best games I've ever played -esp. for the price I payed which didn't really do it justice.  Got it in a humble bundle sale for a few pennies a few months back. - Purchased the amazing soundtrack today.",
            "review_score": "1"
        },
        {
            "review_text": "Instructions unclear, accidently triggered facist uprising across 95% of europe and started WW3.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun at first, but after a while, it gets really creepy and gritty. and does not say anything about that beforehand. I am fine with those things, but this is supposed to be a fun puzzle game.",
            "review_score": "-1"
        }
    ]
}