{
    "app_id": 354380,
    "name": "Assassin’s Creed® Chronicles: China",
    "release_date": "2015-04-21",
    "developer": [
        "Climax Studios"
    ],
    "publisher": [
        "Ubisoft Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Assassin",
        "Female Protagonist",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 1547,
    "negative_ratings": 570,
    "price": 8.59,
    "description": "The first entry in the Assassin’s Creed Chronicles saga takes place in China, 1526, as the Ming dynasty starts to crumble. You embody Shao Jun, the last remaining Assassin of the Chinese Brotherhood, returning to her homeland with a vendetta.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354380/header.jpg?t=1532007231",
    "minimum_requirements": "OS: Windows 7 SP1 or Windows 8 or Windows 8.1 (32/64bit versions) Processor: Intel Core 2 Duo E8200 @ 2.6 GHz or AMD Athlon II X2 240 @ 2.8 GHz Memory: 2 GB RAM Graphics: nVidia GeForce GTS450 or AMD Radeon HD5770 (1024MB VRAM with Shader Model 5.0) DirectX: Version 10 Storage: 4 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Video Drivers: nVidia GeForce 347.52 and AMD Catalyst Omega 14.12",
    "recommended_requirements": "OS: Windows 7 SP1 or Windows 8 or Windows 8.1 (32/64bit versions) Processor: Intel Core i3 2105 @ 3.1 GHz or AMD Phenom II X4 955 @ 3.2 GHz Memory: 4 GB RAM Graphics: nVidia GeForce GTX 470 or AMD Radeon HD5870 or better (1024MB VRAM with Shader Model 5.0) DirectX: Version 10 Storage: 4 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Video Drivers: nVidia GeForce 347.52 and AMD Catalyst Omega 14.12.    Supported video cards at the time of release: nVidia GeForce GTS 450 or better, GTX 500, GTX 600, GTX 700 series; AMD Radeon HD5770 or better, Radeon HD6000, HD7000, R7 200, R9 200 series    Note: Laptop versions of these cards may work but are NOT officially supported.",
    "reviews": [
        {
            "review_text": "I couldn't believe it when I heard Shao Jun would be returning. Ever since Assassin's Creed Embers I've wanted to see her back but didn't expect much from Ubisoft. While I was slightly disappointed that they didn't make a typical AC game out of her story, I'm happy to see how this turned out. I really dig the art style which adds perfectly to the overall ambience of the game and it actually creates more of the original AC feeling than especially Unity failed to.  One point for this is that AC China rewards you for being sneaky. You get a much higher rating if you stealth your way through a level and kill no one. Also, the combat is challenging, or has been at least for me. One enemy, mabye two, totally fine to take on, but anything above three seems more like suicide.  The soundtrack isn't overdoing it, especially in the action sequences, and there are subtle notes woven in that must be from Jesper Kyd's ACII OST, and now, guess what, I wanna replay that game.  It took me about 11 hours to finish because I wanted nothing as bad as not being seen and I applaud myself for managing that (in most levels).   Do yourself a favor and buy this game, buy it once, buy it five times so you can give it to your friends which is a much better investment than buying Unity.",
            "review_score": "1"
        },
        {
            "review_text": "There is an echo of Enter the Ninja, but this game is way more than just a knock off. There is a learning curve to sword combat, guards will use throwing stars, some guards have a crossbow you have to dodge. I've only played the first two levels and they are huge and beautifully drawn. Don't be put off by the 2.5, it's very well done. And it is nice to finally play in an Asian setting, especially with a female protagonist. ",
            "review_score": "1"
        },
        {
            "review_text": "Starting out from the main franchaise and branching into these 'mini' games, Ubi is taking the term 'assassin' to serious lengths. The Chronicles really reward you for stealth and speed as well as patience and is a true mark of the stealth brand.   It took some time to get used to it and it took me months to get back to it because, admittedly it is not for everyone of this generation which is used to the high res games that have the option of murdering your way through levels. But after a while, i got the hang of the 2D dimensions and the controls are now able to be readjusted (thank god). It is extremely satisfying to get Shadow Gold on a checkpoint - which is when you are not seen and don't kill anyone except targets  But wait? Don't kill anyone? Aren't we supposed to slish slash through blood in an AC game? But wait! Aren't we supposed to be Assassins? Working in the dark? It makes logical sense, and yes it adds a layer of difficulty to it, but overall i really enjoyed this game and am playing through it again at the harder difficulties to get teh achievements and collectibles.  The controls are clunky but now that you can adjust it, its actually makes you have really good coordination of control. I liked this game.",
            "review_score": "1"
        },
        {
            "review_text": "great value for ten dollars, a satisfying 2.5d stealth game. Maintains some of the flow of the 3d installments in the series.",
            "review_score": "1"
        },
        {
            "review_text": "Just an average side scroller game with the assains creed name, not really a good addition to the series.",
            "review_score": "-1"
        },
        {
            "review_text": "  This is more of a mobile game ported to the PC kinda game. Really short and not too much to do in it really. For once, this game has nothing about the assassins VS templars in modern times like in the previous games and you could say it is just another Assassins story. This time the main character is a girl from China who was trained by Master Assassin himself, Ezio Auditore (the main character of Assassin's Creed 2). The game can be finished in less than 5 hours or even less as I was doing some of the challenges you can get in each section like not being detected or find some item, which can extend some time into the sections of the game.   Usually the Stealth option will be better as the combat it is not really good, you will good if you manage to avoid the combat in this game, of course there are some parts where you don't have a choice but there are not too many in the game.  Graphic and sound wise the game is very average and themed to the main character; nothing really innovative, just average or what you will expect from it.  If you want to try a different Assassin's Creed, this game could be good for you, but be aware it is really short.",
            "review_score": "1"
        },
        {
            "review_text": "Only recommened for those who absolutley love the AC series, side scrollers and story lines that take awhile to be determined. My biggest complaint is navigating the map took too long for the aprant mutiple pathways that lead to optional objectives that I had no motivation to collect. The maps are built play without being detected and without killing. I am a tradition AC player and if I can kill without being dectected I will but the game seems to discourage this even though there is no penalty which confuses me.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game to play inbetween AAA releases.",
            "review_score": "1"
        },
        {
            "review_text": "First off, don't come in expecting nearly the kind of experience a main AC game would give you. This is a 2.5d platformer. That said, it's not a bad one, but it's also not the best one ever. This is honestly a rather average game as far as the genre comes. You've got a few interesting moves, but nothing you might not expect. It introduces the shoe blade, but honestly, it's just a different animation.   Ubisoft, if you're reading this, stop teasing us. Being an assassin is a lot like what you'd expect out of being a ninja. Stop mulling about and let us be ninjas. Do a main game in an Asian environment. Be it China, Japan, Korea, what-have-you. I'm pretty sure I'm not the only one that would pay for that.  Bottom line, this is not a bad game. The main reason I'm not reccommending it is because A) I expected the type of gameplay I got in other AC games, and was denied, and B) I'm not sure how many people would pay full price for it if it weren't AC.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game assassin's creed chronicles china and how it show the storyline is fast not long to get though with it the game and not so hard to learned how to play it on and how it can be more action and little hard and then not just looking for item and it a awesome game to play",
            "review_score": "1"
        },
        {
            "review_text": "Mark of the Ninja + Assassin's Creed. In other words, it's great",
            "review_score": "1"
        },
        {
            "review_text": "It's a great side-scrolling game, and it is also quite fun and fast paced, if the rush is something that you enjoy, then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "  Yet another spin-off of the old Prince of Persia formula",
            "review_score": "1"
        },
        {
            "review_text": "personally i wanted this game because im chinese and it has already been a blast just by playing a little bit of it. Although the english voice actress for shao jun sounds japanese.",
            "review_score": "1"
        },
        {
            "review_text": "Controls system is ♥♥♥♥ed up",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty boring gameplay. Boring story/plot. Bad controls.",
            "review_score": "-1"
        },
        {
            "review_text": "Really cool game. The art work is beautiful, and the plot is good. It's a 2.5D game, but it's still great.  Even on normal mode it's tricky to get past some of the guards without getting caught. Takes practice. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "I tried playing this game, I really did. When I open this game all I could think about was that WRETCHED game Unity! Grr, it haunts me to this day! All that hype, ALL FOR NOTHING! I cri everytiem.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game",
            "review_score": "1"
        },
        {
            "review_text": "I'm a sucker for AC, and I often find myself playing the games and aiming for 100% completion despite their flaws.   I was interested when I first heard about this smaller digital games. As a child I remember the magic of playing Prince of Persia with it's precision timing, jumps, and sword fighting. I figured if the game could simply live up to the standard sset by that 30 year old game, then what could go wrong.  And that is the problem with the game. It technically doesn't do anything wrong.... but it doesn't really do anything right either. So I'm having a difficult time deciding whether or not I can reommned the game.   I'll start with comparisons to Prince of Persia (I'm talking the old DOS game here, not the PS2/Xbox era game). While AC Chronicles China is not as unforgiving as PoP, it is also not as accurate. Similar to it's 3D big brothers, your assasin has a bad habit of going in directions you didn't intend. This can lead to countless 'restart checkpoints' if you are aiming for higher scores. The running, jumping, sliding, and other movment mechanics are pretty good. My favorite levels often invovled skill runs through a collapsing environment. On the othe rhand, the combat sections are simply not fun, and I think the developers knew that, which is why you are punished very heavily score-wise for getting invovled in sword combat. Considering charatcer upgrades are tied to your level scores, this means you are heavily pushed towards silently moving through levels unseen. And if you have to kill, don't be seen while doing it.   Which leads me to wonder why the bothered with so many combat mechanics. Blocking, countering, rolling over enemines, light attacks, heavy attacks, are all mechanics that, if you play as the game encourgaes you to, will never actually be used. It reminded me of the older splinter cell games that gave you 20 gadgets to kill a man, and then penalized you for killing.  The story itself is fairly shallow. Precursor artifact? check. Crumbling assasin brotherhood? check. Gang of evil templars in a convient order of importance? check. Assassin that doesn't listen to their master and causes trouble? check. This is all familar territory. and it really only serves to set up the flimsiest of reasons as to why we are killing all these guys.   As this is the first game in a 3 part series, it is hard to tell at this point how much lore the series will ultimately add to the AC universe. At this point it very well could be a throwaway story, or the precursor artiofact mentioned might end up being something rather important.  That is honestly where the developers should be focused at this point. The AC universe is dense and can be somewhat convoluted. There are fans who understand everything about the lore and many more who know there are artifacts and ancioents, but aren't really clear on what their deal is. Smaller games like this are the perfect opportunity to flesh these things out. Define the artifacts. Define the background stories of people who have met or heard about.   So far, these games don't feel like they are going that route. Rather they had a list of lcoations from a brain storm meeting on where the next big AC game should be, and someone took the scraps that got lef ton the table and decided to make this series based on them.  Ultimately, the gameplay is serviceable and I had moments where I felt pretty badass. Sliding from hiding spot to hiding spot with only split seconds to spare is pretty awesome. That is until you go to jump into the next spot and your assassin instead decides to jump on a guards head and then just stare at him while every enemy in the area lights you up. If the game had a better story, then based on the gameplay as it stands, I would have gone ahead and given a thumbs up. Unfortunately the game could literally have been called anything, because other than name dropping Ezio and mentions of the artifact, there is nothing else Assassin's Creed about the game. And for that reason, I can't recommend it. There are better action platformers out there. And there are enough other AC games that have more variety, better gameplay, and more substance that are worth your time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Good platformer, unique AC style with really good music and stealth gameplay",
            "review_score": "1"
        },
        {
            "review_text": "I was not sure what to expect. After AC revelations the games felt 'commercial' and 'unsatisfying. I bought this game because I was curious and I really like this game. I haven't finished it yet after playing it for 3 hours, which was surprising to me. The game gives me the feeling of playing an old AC part like AC 1 or AC2. It reminds me very much about an AC game I played on Nintendo DS. I believe it was called : AC Altair memories. Not sure though. I really love the artwork and style of the game too. Combat can be a bit challenging, but you should not fight in this game.  I definitefly recommend this game and I am looking forward to play India and Russia aswell.",
            "review_score": "1"
        },
        {
            "review_text": "i bought the game and i pressed play.. came in to ubisoft and it started for like 2 sec and then it syoped working i did that for like a million times and i got more and more angry...",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesn't work properly, can't even play the game",
            "review_score": "-1"
        },
        {
            "review_text": "OK THIS GAME IS F*CKING OK! BUT, HERE ARE MY PROBLEMS AND SORRY FOR CAPS I'M ♥♥♥♥♥♥ AT THIS GAME!  +Story follows new character from the end of ezio episodes  ---controls are ♥♥♥♥ing horrible and there is NO WAY TO REMAP CONTROLS, THIS IS A GAME THAT NEEDS CROUCHING TO BE C NOT ♥♥♥♥ING CRTL ESPECIALLY WHEN THE ♥♥♥♥♥♥♥ SLIDE ATTACK IS NEEDED TO WIN THE GAME! SO HALF THE ♥♥♥♥ING TIME YOU'LL BE SPRINTING AND HAVE TO MOVE YOUR PINKY FINGER TO THE CRTL BUTTON WITHIN 0.25 SECONDS OR ELSE YOUR CHARACTER IS GOING TO JUST CROUCH AND DIE FROM THE FIRE!  -story is predictable obvious how it ends  +Nice art style  --so many particles it decides to lag me out greatly  --There are a variety of enemies that actually use cheating ways to ♥♥♥♥ you over somehow,  there are the normal enemies that you encounter on the 1st mission that are the only enemy defeatable without taking damage  Archers can shoot you from a distance and are kinda annoying sometimes if there are only atleast 2 but if there is 5 onscreen then your ♥♥♥♥ed *cough* last mission.  Handcannon guys can usually kill you in 1 hit because your health is so low in the beginning, and some ♥♥♥♥ing how they're able to see you through bamboo sticks even though no one is able to do that if they go into alert mode. So if you kill somebody and hide behind bamboo sticks then a handcannon see's him your better off reloading a checkpoint.  Masters...♥♥♥♥ing...impossible  metal shield guys the only way to hit them is to counter and hop over them, but one problem with that remember when I siad that you have to hit the crtl button within 0.25 seconds or else your dead. Yea you have to hit the space bar within 0.000001 seconds or else it won't register and you can't move your fiinger back to the C button in time...yes to counter a incoming attack you have to press C, how'm I suppose to do that when i'm suppose to be holding the d button at the same time. YES YOU READ ME, TO COUNTER A ATTACK YOU HAVE TO HOLD D+C FOR A ENEMY ON YOUR RIGHT AND A+C FOR A ENEMY ON YOUR LEFT!!!  Wooden shield guys are ok not difficult you have to use a heavy attack 3 times or 2 on their shield to break it and once you finish the game you can get a upgrade to only need to hit it once.  vanguards are stupid too but not brokenly hard like masters.  and...the ♥♥♥♥ing HEAVY CROSSBOWMEN...If you get hit ♥♥♥♥ing once actually you can dodge the first bolt, and then you will get hit 5 times by the ♥♥♥♥er and you will be dead. Again like the handcannon guys if your seen then your COMPLETLY ♥♥♥♥ED!!!  I DO NOT RECOMMEND THE GAME WITH THE STATE THAT IT'S IN! THEY BETTER MAKE THE NEXT ♥♥♥♥ING CHRONICLES GAME HAVE REMAPING AND NOT THE BROKEN ENEMIES!!!  *Sigh* *inhale exhale* Now...that doesn't mean I hate it, I do enjoy some of the missions, they're ok but it's the last mission and a couple others where they ♥♥♥♥ you over. This makes speed running nearly impossible you have to be picture perfect and now the patrols and map and everything. And it adds some need to be sneaky which is ok. If you want to buy it I'm ok with that, just know that the controls will make things impossible and some 'memories' will be cheatingly difficult. But if you think this is a game where you have to fight straight head on combat then your going to die a lot. You actually have to be sneaky and stealthy to WIN.  I commend this game a 4/10.",
            "review_score": "-1"
        },
        {
            "review_text": "its sucks ♥♥♥ ",
            "review_score": "-1"
        },
        {
            "review_text": "Let's start with: I have played this for longer than Steam seems to think I have.  I really like playing this game. There's something about the AC series that translated really well to 2.5D. I'd long since abandoned the franchise (way back when they released 5001 add-ons to Ezio's story) and this was a welcome re-entry for me.  Running through the beautifully-designed and vibrant levels honestly makes me smile. The bright red blood spatters when Shao drives her 'Toe-blade' into a Templar's skull is a really satisfying feeling. It's quite the treasure of a game, and for the price of £7.99 (or your regional equivalent) it is well worth your time and money.  To view my full review, visit  my site.  [tundragaming.wordpress.com] ",
            "review_score": "1"
        },
        {
            "review_text": "The Chinese in the game is so funny. Keeps cracking me up loool",
            "review_score": "1"
        },
        {
            "review_text": "A game for Right Handers only if your preferred control method is Mouse and Keyboard.There is no option to remap keys.I can't tell you how frustrating it is that in 2015 Dev teams still are unable to include such a basic requirement for PC gamers.  The key Mapping is for QWERTY players only.  Otherwise a Game controller is a must.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is only seemingly able to run at 30 FPS, and the response to my keypresses is delayed. It's also exeptionally poorly made. Am I the onlyone having theese problems? Even if I am and it's my own computer, I still wouldn't recomend it fyi.",
            "review_score": "-1"
        },
        {
            "review_text": "It is one of those games you don't quite understand but like it.  i did not understand it but liked it not much but still.  9 dart ropes outta 10",
            "review_score": "1"
        },
        {
            "review_text": "absolute ♥♥♥♥ compared to the rest of the assassins creed series... seriously? why would you go to a 2d side scroller?",
            "review_score": "-1"
        },
        {
            "review_text": "I should be able to pick any damn button on my keyboard to control the character. Forcing players to use WASD is stupid. This needs to stop.",
            "review_score": "-1"
        },
        {
            "review_text": "Why would someone buy this???!?!?!?! I am really disapointed I killed my first born child.",
            "review_score": "-1"
        },
        {
            "review_text": "I actually liked this game, even though it commits the unforgiveable sin of not allowing players to assign their own keys (bind) to actions. Because the game looked worth playing, what I did was treat using the hardwired WASD keys for movement, C for action, etc. as something of a puzzle-within-the-puzzle game -- and it worked. Once I got the keys down, the game was actually a lot of fun. Stealthy, a generous checkpoint system, responsive, great-looking. While I still consider not allowing players to rebind their own keys a deal-killer in most cases, I'm glad I set it aside this time.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying it so far. I use a controller and it feels okay. Shao Jun dies really easily but that's understandable since she is more stealth-based. It's pretty good for a side scroller (If you jump in with the expectations of a full 3d game then of course you won't enjoy it). That said, being chinese I would love to see a full game based in China.",
            "review_score": "1"
        },
        {
            "review_text": "Its very fun and different from the games I've previously played with the Assassins Creed title. I do recommend it highly if you're into mildly complex controls and a short, fun story. 10/10 For me, I've had no issues with it thus far.",
            "review_score": "1"
        },
        {
            "review_text": "A very cool game in my opinion and 2.5D",
            "review_score": "1"
        },
        {
            "review_text": "I actually quite liked this game, because I like how Assassin's Creed Used to be with only being on the ground and not sailing any ships, but it's in a 2 Dimensional Form, which in my opinion also added more to the gameplay. The soundtrack is actually really good too, probably not as many memorable songs like in 2, Brotherhood, or 3, but still has some good music that matches the environment of the game with it taking place in China.",
            "review_score": "1"
        },
        {
            "review_text": "A 2.5D copy of Mark of the Ninja by Klei Entertainment, But still like it since Mark of the Ninja does not sucks, I also like the Traditional Chinese brush strokes since I'm a Chinese, and it is really beautiful, it's a nice Artwork.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad AC installment, especially for only $10, I do think it's a waste that they chose to use this setting for a 2D scroller instead of a full game, would love to explore 16th century China as an assassin.",
            "review_score": "1"
        },
        {
            "review_text": "Why the fork does my Chinese assassin have an English accent?",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely amazing stealth/ninja/strategy game! Most of the bad review aren't even 30 minutes into the game and say how bad the combat is. The combat has a very strage layput but is not bad at all once u get used to it. I've already beaten the original gamemode but there are still two more which makes it definitely worth the money! :D",
            "review_score": "1"
        },
        {
            "review_text": "Interesting gameplay and road in the Assassin's Creed Series",
            "review_score": "1"
        },
        {
            "review_text": "The art style is absolutely stunning, even for such a 2.5D game. Also, credit to the artwork being much less Japanese and a lot more Chinese. Shao Jun's voice actor has changed, much more colder than her voice in Assassin's Creed Amber. But about the accent... Can the Chinese voiceover be a little bit more mainland? Cuz I only smell Hong Kong and Taiwan.  Also, thumb down to the keyboard control settings, frequent shifting among Ctrl, Shift and Space triggers the change of input method and this is definitely a pain in the ♥♥♥. Can't moving in the middle of the battle? didn't see this coming.  Thanks Ubisoft, overall 7.5/10, 10/10 for the artwork.  美术风格好评是绝对的，还有配音（虽然口音不忍吐槽），完全和余烬是两种配音嘛= = 差评的是键位，针对键鼠操控来说，ctrl+shift+space搞这么混的键位还真是不常见，不小心就切换输入法然后被花式吊打。这个尤其是sequence3船上那一段，潜行翻越障碍物简直就是微操的碉堡之处。  所以还是忍不住给育碧爸爸交钱了。冲着键位扣分，7.5/10。",
            "review_score": "1"
        },
        {
            "review_text": "worth trying",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you don't play with a keyboard. It has a creative artstyle and has alot of fun levels. The story was a little lacking, but aside from that I don't think this game should be rated this low. Also NOT THE FIREEEEEEEEEEEEEEEENEADFKLFNSADKFNASFASASLDKFN",
            "review_score": "1"
        },
        {
            "review_text": "can someone help me, i bought this assinassins creed chronicles china and the cd key i was given didn't work? how do i go about this? cos i would really like to play this and i bought it wouldn not liek to waste my money, can someone help me and tell me what to do, or who to complain to about getting a working product key?",
            "review_score": "1"
        },
        {
            "review_text": "Graphics: Good Controls: Bad Gameplay: Meh",
            "review_score": "-1"
        },
        {
            "review_text": "This is better than most games of the main series.",
            "review_score": "1"
        },
        {
            "review_text": "2.5D &lt; Brain Games &lt; low disk 3GB only  but u can got lot of strtgy and make your brain works as ♥♥♥♥ :)  score 8/10 just need online co-op 100/10",
            "review_score": "1"
        },
        {
            "review_text": "It's not bad for Assassin Creed Franchise.",
            "review_score": "1"
        },
        {
            "review_text": "This was good, i really really enjoyed it. Although their voices had an english accent which made no sense to me. Like they're asian, why tf give them an english accent?!?! but overall, the game was a lot of fun to play. The artstlye was simplistic yet detailed, the scenery was nice too. What i liked most about the game was that the main character was a female assasin, so the perspective of the game was more relatable(?) and different. I hope they do more games like this, or other companies should do games outside the typical white male main player. which theres nothing wrong with that, it was just nice to play in a more relatable character thats a different gender and a different race/ethnicity. Good Game.",
            "review_score": "1"
        }
    ]
}