{
    "app_id": 354430,
    "name": "STAR WARS™ - X-Wing Special Edition",
    "release_date": "2015-04-28",
    "developer": [
        "Lucasfim"
    ],
    "publisher": [
        "LucasArts",
        "Lucasfim",
        "Disney Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Star Wars",
        "Space Sim"
    ],
    "achievements": 0,
    "positive_ratings": 131,
    "negative_ratings": 48,
    "price": 7.19,
    "description": "Against the overwhelming might of the Empire stands a small but growing Rebel Alliance. Scattered resistance groups are uniting and what is needed most now are Starfighter pilots. Will you join their struggle to end this tyranny and become a hero of the Rebellion?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354430/header.jpg?t=1542763510",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: 1.8 GHz Memory: 1 GB RAM Graphics: 3D graphics card compatible with DirectX 7 (DirectX 9 recommended) DirectX: Version 7.0 Storage: 216 MB available space Additional Notes: The Windows version of STAR WARS: X-Wing (1998) requires a controller or joystick. STAR WARS: X-Wing (1993) can be played with a mouse and keyboard.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have purchased every version of this game since it's original release in the 90's. This is one of my all time favorite games. This version includes the classic Floppy disk version and the remastered windows 95 edition. The Collectors edition CD-Rom is missing from this version. also missing is the Strategy guide, but half the fun of this game is how brutally hard it can be. I reccomend this game, but not the Steam implementation of it because of the bugs.  The remasterd version included has better graphics than the 'classic' version, but is limited to only working with a joystick or gamepad (I'm using a logitech F310 USB). this version has problems making it mostly unplayable because of the ghost cursor. Forum posts about this issue don't help to resolve it, version purchased elsewhere doesn't have these problems.  The classic version works just fine including workign with my gamepad. There is not a way to customize the joystick layout in this version. you can get some pretty good scaling if you aren't afraid of editing the dosbox configuration file in the classic folder. just remember this version was designed for 300x200 resolution and won't look great stretched to 16:9 at 1920x1080. This version can be played using the keyboard and mouse and even with the gamepad you have to use the keyboard for so many of the functions anyway that it might play better with a keyboard and mouse.",
            "review_score": "-1"
        },
        {
            "review_text": "I know its old but this game is one of my all time favourites!! I had the original on pc back when you had to keep putting in a security code every time you played to help prevent pirating...glad you dont have to do that anymore!ha. it looks great for an old game and plays brill and the sound is just like the original..lots of nostalgia but that doesnt take away that this is a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Ignore my current Hours I have put in literally hundreds of hours on this game.  YAY Steam has released the X-Wing collection. I still have my cd's but prefer playing through Steam. Hopefully Lucas arts/Disney will release a new version of these games someday. Could you imagine XWA in modern graphics? I cannot relate to the people who are whining about not being able to add the XWAU or comparing it to the GOG release My entire time on this game has been unmodified on the standard vanilla game. I think the game was fantastic as a release and it does not need playing with.  Thank you Steam!  X-Wing the one that started this fantastic series. This is by far the hardest and most unforgiving installment in the series. I always found the aiming to be a bit weird compared to TF and XWA but its still great even today.  Lucas arts / Disney really need to make a new version of this series!",
            "review_score": "1"
        },
        {
            "review_text": "I destroyed a joystick 15 years ago playing this and picked it up to relive the good times. I was a bit worried it wouldn't really be playable without a joystick and not sure I would be able to get one working with it considering the game's age. I was pleasantly surprised that it works out of the box with an xbox controller and while this isn't perfect it was good enough to have a ton of fun. Seriously considering picking up a serious joystick to get the most out of this.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. Highly recommend checking it out.",
            "review_score": "1"
        },
        {
            "review_text": "This game has still much work to do. I installed on two machines, but gets the same issues with the newer version: cutscene and independence menu lags like you would play it on a Pentium 1. Takes about 1-2 minutes to navigate around the Independence to a newer mission. I also have the double cursor. Once you are in-game it goes better, but it can still crash if I hit the ESC button. Vintage version plays very good, thanks to DosBox :).  I recommend to test it before you buy...  I guess it was just thrown before us, motto: 'there I fixed it'.",
            "review_score": "-1"
        },
        {
            "review_text": "Heard it was nice game.....back in 1995  Today? Takes far too much patience and elbow grease to get working when you have a huge back log of triple A titles you've only played the tutorials for.",
            "review_score": "1"
        },
        {
            "review_text": "Ah it runs on win10 but not very playable,",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes on first mission.",
            "review_score": "-1"
        },
        {
            "review_text": "I remember this game when my dad made a copy of a DOS version at a company he used to work for some 20-25 years ago. I think it required something like 7 to 10 floppy disks to work. Unfortunately, I think a file became corrupt. After installing the game, the graphics would get distored to the point where the game was glitching all the time. It wasn't until the collectors edition that came in the X-Wing Trilogy that was released back in 2000 that I got a chance to get it back. It's nice to have these games working in Windows 10.  There is one urk I found. These are the joysticks/gamepads I own: Logitech Attack 3 XBOX 360 Wireless Logitech Gamepad F310 I tried all of these controllers as my X-Wing was running into the proving ground platforms. It's not until I went into the Game Controller settings (in Windows) where I could configure my controller that I figured out what I could do. I selected 'Advanced' and got the option of selecting a particular game controller to work with older games. I tried it with both the Attack and the F310. The option allowed both game controllers to work in X-Wing. So, if you have problems getting it to work, try this (at least for WIndows 10).  Edit: The XBOX controller might work with the game after all. I turned it on and it became a third option under 'Advanced'. As such, seeing as how it disappears from the settings whenever it goes to sleep, I would not advise using that particular controller (or any controller that can sleep) with X-Wing.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: This now includes the 1994 edition, I have changed my review to recommended.   This does NOT include the 1994 (DOS CD) edition (better graphics). GoG has this correct version, I don't know why GoG just got it and Steam can't?? Same goes for the 1995 (DOS Collector's CD-ROM) of the Tie Fighter Special Edition on Steam and GoG...   Great game and I've been waiting a long time for Steam to add this, but I don't recommend it until Valve adds the better version of the game.  Thumbs down will remain until Steam includes the 1994 version, otherwise this is great.",
            "review_score": "1"
        }
    ]
}