{
    "app_id": 354620,
    "name": "Miner Warfare",
    "release_date": "2015-06-11",
    "developer": [
        "Heartbit Interactive"
    ],
    "publisher": [
        "Heartbit Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Shared/Split Screen",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "4 Player Local",
        "Local Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 103,
    "negative_ratings": 22,
    "price": 1.99,
    "description": "8 players local multiplayer bonanza with only 4 controllers!In Miner Warfare you dig for gold. But you'll spend most of the match shooting in your friends's face, mining holes with laser cannon, throwing buggers and detonating atomic bombs. WARNING: excessive use can destroy friendship.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354620/header.jpg?t=1542905012",
    "minimum_requirements": "OS: Windows 7 Processor: 2.3 GHz Intel Core 2 Duo or better Memory: 1000 MB RAM Graphics: DirectX10 compatible GPU with at least 256MB of VRAM DirectX: Version 10 Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows 8.1 Processor: 2.8 GHz Intel Core 2 Duo or better Memory: 1000 MB RAM Graphics: DirectX10 compatible GPU with at least 256MB of VRAM DirectX: Version 10 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "This game is ridiculously great! I've been playing this piece of art for 4 years, laughing histarically every time I play it! (Along with my friends, of course!) I'm glad to see it be put on steam, and I love the simplicity of it. The 2D Shoot-Em-Up gameplay mechanic is nostalgic like JOUST, and unique in it's own way! Every person that I have introduced to this game NOT ONLY likes it, but gets HOOKED on it every time they come to my house! XD  My personal rating: 8̶/̶1̶0̶ 9/10  Why 9 you ask? It's nothing large- or maybe thats just it... There is no way to change the resolution. This is the only thing that I think that this game needs, and it is crucial for people with different resolutions than 1280x[720p]. It would be great, and I would up my rating if there were a settings tab for resolutions, like 1080p, o̶r̶ ̶m̶a̶y̶b̶e̶ ̶j̶u̶s̶t̶ ̶a̶ ̶f̶u̶l̶l̶s̶c̶r̶e̶e̶n̶ ̶o̶p̶t̶i̶o̶n̶ ̶f̶o̶r̶ ̶t̶h̶e̶ ̶t̶i̶m̶e̶ ̶b̶e̶i̶n̶g̶.̶  Update: There is a fullscreen option! :D Just press Alt+Enter! It doesn't change the resolution of the Render, but you can Use your whole screen! +1 to my Personal Rating.",
            "review_score": "1"
        },
        {
            "review_text": "Played a lot with friends before came on steam and now I will play it again! I definitely consumed this game! Lof of fun shooting at each other and throwing bombs without rules while stealing gold.   A perfect local multiplayer!   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Do not be fooled, and think this is an online multiplayer game to play with friends via Steam. This game is actually local multiplayer and well... Who has friends IRL... but other than that the game is actually fun, you just have to play local.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game to fight if your friends... but i don't have friends...    9/10 Would be forever alone again",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! until I lost.... lets just say my brother doesent speak with me anymore",
            "review_score": "1"
        },
        {
            "review_text": "this game is a fun pass time if you feel like playing a good game the only suggestion i have is that you add online multiplayer for people that dont want to play it with people over",
            "review_score": "1"
        }
    ]
}