{
    "app_id": 354970,
    "name": "Shin Samurai Jazz",
    "release_date": "2015-03-16",
    "developer": [
        "Blaze Epic"
    ],
    "publisher": [
        "Blaze Epic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 50,
    "negative_ratings": 31,
    "price": 0.79,
    "description": "Shin Samurai Jazz is a platform-adventure game. It combines the likes of film noir and samurai cinema, presenting them with 8-bit graphics, an electro-jazz soundtrack, and a comic/manga-like style creating a unique atmosphere.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354970/header.jpg?t=1509632610",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Memory: 512 MB RAM Graphics: 512 MB VRAM Storage: 12 MB available space Additional Notes: Recommended for use with Xbox 360 Controller",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "good game but hard to play :)",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed it, plain and simple. As another reviewer said, if you like the way the movement/combat looks in the trailer, you will probably enjoy the game. It certainly has shortcomings, but for $1 it was a weird, retro-style blast.  A few helpful tips: -push 'up' to talk to people (there are lots of vague 'hints' and 'plot details' given this way). This game has more ellipses at the end of half-finished sentences than...you know...  -there are a few important combat variations: (1) up/attack will send some enemies up in the air; (2) if you dash and attack, you will immediately knock over some enemies; (3) due to simplistic AI, you can walk enemies off of cliffs or onto spikes for instant death!  -there is one important movement trick beyond the double-jump and air dash: if you hold the dash key and jump WHILE STILL HOLDING DASH, you will jump even higher in the air (and you will also often still be able to do your second jump of the double-jump). This is vital for the later levels.",
            "review_score": "1"
        },
        {
            "review_text": "Makes me want to kill babies  11/10 would play again  Best twist ending in the world",
            "review_score": "1"
        },
        {
            "review_text": "Game has a cool concept but gets way to difficult to fast interms of jump machanics and spikes.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than Samurai Jazz, for sure, but still not worth the time. It's easier, in some ways, and certainly less frustrating (with the exception of the end, which had no saves, so I decided I didn't want to play this anymore...).  The level design is 90% filler, and there is one obstacle that, while cool, the game uses over and over and over again (which is to use dash to pass under and obstacle, followed by a double jump into a higher wall). Aside from this, which is a good use of the game's mechanics (though overused to death), the rest is just a way of prolonging the game long enough to be worth money (?)... I mean, the whole game consists of going into several buildings to key a key to the next, to get a key to the next, to get a key to the next, to finally get into the building you wanted to in the first place.  There a part in a mall where there are like 10 different door that you need to try out whenever you get a new key. It's absolutely pointless. Especially, as I mentioned, when the game has one good trick that it simply uses everywhere.  The enemies are varied enough, but quickly get redundant when you find the strategy. The combat isn't bad, but it's too outdated to keep up. It's mostly about keeping your distance, and timing attacks to keep enemies stunned.  I also don't really understand why the music gets so much praise. It certainly has a very definity style, but it's mostly elevator music. And it doesn't really play along with the game. It's just background elevator music...   Not much else to say. The platforming isn't bad, in places, but it could use far more variety. And you start with every ability from the start, so the game can't really build different sections for when you have only x or y ability, and them build up from there.   I realize that my impressions are very negative, but I just don't see the point in playing this game. The story is simply an excuse to get you from place to place, doing the same things over and over again.  But at least it's an improvement over the last one. Maybe his later games are good.",
            "review_score": "-1"
        }
    ]
}