{
    "app_id": 354960,
    "name": "An Imp? A Fiend!",
    "release_date": "2015-03-16",
    "developer": [
        "Blaze Epic"
    ],
    "publisher": [
        "Blaze Epic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 37,
    "negative_ratings": 25,
    "price": 0.79,
    "description": "Stuck in the Underworld without the slightest clue why, a young fiend has a bit of a mystery to solve in this action/adventure platformer. With a world to explore, a past to uncover, and quite the task to complete, players must embark on a quest filled with monsters, towns, dungeons, bosses, and various platforming challenges.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/354960/header.jpg?t=1478033698",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 Memory: 512 MB RAM Graphics: 512 MB VRAM Storage: 15 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "4/10.  Well true to Blaze Epic form, he releases another dud. This feels the exact same as ninjahtic games and is basically a copy with different visuals. Let me start by saying the controls are EXCELLENT. The platforming and everything are perfect. Unfortunately its lost to a game where there are 3 paths in 1 area, and then 4 paths off of the path you took, meaning its this huge confusing map with a poor layout. Theres no map or direction at all. You just wander one way and pick random paths that all look the same. That usually leads to a locked door so you backtrack entire way and choose next path, rinse and repeat. There are no powers or anything. Super boring. If there would have been directions and not just door key fetching (copy off all his games) and been better level layout this game would have been enjoyable. It stands as just an example of great platforming mechanics with terrible game design behind it.  ",
            "review_score": "-1"
        },
        {
            "review_text": "An Imp? A Fiend! Is a typical Sidescroll-Adventure, where you first have to make your way thru some kick ♥♥♥ caves! It brings back old feelings! In my opinion, its getting a little bit boring after a decent time, but if you play it from time to time, it maybe it's a really good game! The music isn't that fantastic, but also not necessary!  9/10 (For that Type of Game) Would jump again!",
            "review_score": "1"
        },
        {
            "review_text": "It's alright. I only have 0.3 hours on record because I stopped playing after a bit because I thought this game wasn't finished. If it felt more complete then I would definitely recommend it but as of right now I can't.",
            "review_score": "-1"
        }
    ]
}