{
    "app_id": 355080,
    "name": "Crazy Steam Bros 2",
    "release_date": "2015-04-02",
    "developer": [
        "Ars Creativa"
    ],
    "publisher": [
        "Ars Creativa"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 9,
    "positive_ratings": 7,
    "negative_ratings": 11,
    "price": 0.79,
    "description": "Crazy Steam Bros is a classical horizontal shoot'em up inspired by the gameplay of old arcades. Anton and Dupont are brothers, inventors, and a little mad also! With the help of their landlady, Miss Lily, they must defeat the evil Baron and their hordes of moustached soldiers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355080/header.jpg?t=1447370477",
    "minimum_requirements": "OS: Windows Vista, 7 or 8 Memory: 2048 MB RAM Graphics: DirectX®:9.0 Storage: 30 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game isn't really that bad. Don't get the two angry reviewers down there. it's actually pretty nice, for the price. (3 bucks)  Yes controls lack of precision in 'little' moves. Other than that , graphics are pretty cool.  Animations are polished. Bosses looks great. And the gameplay have some interesting features (limited Pup usage, downgrading score when hit etc) Difficulty is hight but not impossible.  bomb usage is nice. (needs good placement and practice)  If you like arcade Side Scrolling shooter with nice visuals, go for it ! I mean, it's not if this game was expensive. 3 bucks worth it      Aside from that, yes developers should really improve visual and handling of the GUI / menus. (make all the menus less huge on screen ?)  And maybe tweak the controls and the 'steam bubblign effect'  on some things (like the ship iddle move, the HP cursor).  Difficulty starts to be maybe a little too hight on the end of second level.  - online highscores ? would be cool. - keeping powerups when dying and restarting levels , because other than that its hard to 'retry' on second one and later.   The bad thing is this game should have been early access or beta for now...  Don't rush it out guys ! Rework it a bit. Try to improve major things and maybe it'll get the love it deserves.",
            "review_score": "1"
        }
    ]
}