{
    "app_id": 355120,
    "name": "Pirates Deck",
    "release_date": "2015-08-10",
    "developer": [
        "Smit Parmar"
    ],
    "publisher": [
        "Smit Parmar"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 6,
    "negative_ratings": 28,
    "price": 1.99,
    "description": "Pirates Deck is Tower Defense Game, Save your Island Base from enemy Pirates.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355120/header.jpg?t=1498543282",
    "minimum_requirements": "OS: WINDOWS XP Processor: Cor 2 Duo Memory: 512 MB RAM Graphics: Any Network: Broadband Internet connection Storage: 200 MB available space Sound Card: Any Additional Notes: THIS GAME WILL ONLY RUN ON 32bit ARCHITECTURE, DOES NOT SUPPORT 64bit ARCHITECTURE",
    "recommended_requirements": "Graphics: Any Sound Card: Any",
    "reviews": [
        {
            "review_text": "I actually installed this JUST to review it because people deserve to be warned!  Another wonderful scam brought to you by another wannabe dev. The game was greenlight as a Tower Defence game but apparently the dev didn't care so he released this broken pos space shooter instead , completely abusing and exploiting Greenlight.  The game is an abomination. Almost unplayable and broken in its controls. There is nothing to do in it. Its nothing but 1 stage in a dome about 100 yds across. Total scam. Avoid at all costs. And report it to Valve so it is rightfully removed.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, i played this game for 6 minutes. You cant enjoy this. I mean, BOATS OVER LAND? Like wtf.  Pros: -Can't think of any pros Cons: -Boats over land? -No abillity to upgrade/replace/remove turrets. -It's a bunch of waiting. Not actually doing anything  I don't enjoy this game...",
            "review_score": "-1"
        }
    ]
}