{
    "app_id": 355130,
    "name": "MotoGP™15",
    "release_date": "2015-06-23",
    "developer": [
        "Milestone S.r.l."
    ],
    "publisher": [
        "Milestone S.r.l."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "achievements": 46,
    "positive_ratings": 323,
    "negative_ratings": 115,
    "price": 14.99,
    "description": "Are you ready for the new challenges of MotoGP™15? Compete against MotoGP™, Moto2™, and Moto3™ riders on the 18 circuits of the 2015 championship in a bid to win the world champion title!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355130/header.jpg?t=1501762378",
    "minimum_requirements": "OS: Windows Vista SP2 / Windows 7 SP1 / Windows 8 / Windows 8.1 Processor: Intel Core i3-530 @ 2.93 GHz / AMD Phenom II X4 850 @ 3.30 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 460 @ 1GB / ATI Radeon HD 6790 @ 1GB* DirectX: Version 10 Storage: 30 GB available space Sound Card: DirectX compatible Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "recommended_requirements": "OS: Windows 7 SP1 64-Bit / Windows 8 64-Bit / Windows 8.1 64-Bit Processor: Intel Core i7-3770 @ 3.4 GHz / AMD FX-8350 @ 4.0 GHz Graphics: NVIDIA GeForce GTX 780 / AMD Radeon R9 290X* DirectX: Version 11 Additional Notes: *Laptop versions of graphics cards may work but are not officially supported.",
    "reviews": [
        {
            "review_text": "MotoGP 15 is an exceptional bike racing game, after a few hours practice with a decent controller (recommend xbox one controller for PC) you can master the art of racing these wonderful machines. I know that I will be playing this game for a long time to come. There's nothing bad I can say about this game, it more than met my expectations. Fantastic job!",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy this game. If you had previous versions, it's the same game with rider updates.  Want to go through a full week end of racing and have fun? Ofcourse you do. Does Milestone think the same way? Ofcourse not, because F*ck you, they got your money. You want an example.  Set up your bike during practice and qualifying which happens to be dry weather. Warm ups and race in the rain.  Different year, same problem. During the warm up, they reset your settings. Good luck finding these or trying to load these, cause they've been saved under dry. Now you don't have a template.  12 mins to set up or find the template again, no thank you.  It's like watching Rossi raging because it's raining on race day and he has no set up, because his mechanic brought in a new bike. That always happens.",
            "review_score": "-1"
        },
        {
            "review_text": "Game looks and feels like it was made in the early 00's, wouldnt reccomend it, got a refund straight away!",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this last year and have tried it on various occasions, but now binned it and re-installed Moto13. Too many glitches, bad running (sometimes can't even get out of the game, and I've got newish running gear) and where on earth did Milestone get the bike sounds from? have they not actually gone to a motogp or superbike race. Started playing Motogp way back in the 2000s and I am sorry to say that since Milestone took over from THQ, the game has gone downhill, and is now floundering and is sometimes unplayable. Sad really because I am a big fan on Motogp.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a MotoGP fan, the MotoGP series by Milestone is a nice way to spend a few hours riding around your favourites MotoGP tracks. The motorbikes are fun to drive, but the AI and the phisic of contacts/accidents are totally random. The flashback feature mitigate this, but not so much. It's funnier to play time attack than racing...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Career mode is great. The only bad thing about the game well its not really a bad thing about the game but I just wished more people would play multiplayer becasue I really like playing these types of games with actual people sometimes. But eh I guess more alone time for meh :p",
            "review_score": "1"
        },
        {
            "review_text": "its really fun",
            "review_score": "1"
        },
        {
            "review_text": "The game is probably entertaining for some people into this genre but I find it being some sort of a 'follow a blue line' simulator with bike physics. Not that fun. I suggest you look at the grid game series since they are pretty much the same (although with cars) and runs much better. 290x and I could barely run medium settings. I suggest you have crossfire/sli and a high end processor for maxed out settings at 1080p.",
            "review_score": "-1"
        },
        {
            "review_text": "My first and only MotoGP game was : MotoGP 11, and it was my only motorcycling game ever for that matter.  I loved it. The driving experience, the way to surf in the turns, MotoGP really provides a unique sensation of driving.  That sensation is still here in MotoGP 15. Great !   But, I remember in MotoGP 11 (on PS3) the very nice skies..., that is gone. No matter the sky condition you set (except for sunny) you end up with that boring exact same grey on cloudy, raining, lightly raining... no difference. No more of those beautiful sunbeams shining through the very nice big and scary clouds.  The Bike and some aspects of the tracks may look better, but might be only due to higher resolution.  Multiple bugs... from sound bugs, making you stuck with the ugly startup line's engines for the whole race, to the ones making it impossible to properly go back in time : if you fell, and want to rewind, you can, except that sometimes, you'll automaticaly fell back as soon as you reset it... and you are not able to rewind again after that of course.   At the end of the day ,  I really enjoy MotoGP for the great driving and racing sensations, but it is in no way a game worth it's full price, it looks quite unfinished in some aspects. And I can't shake the idea that the 11 on PS3 gived a better visual experience than this one.  Bying it at half price is a good compromise .",
            "review_score": "-1"
        },
        {
            "review_text": "Update: I recently got Valentino Rossi (MotoGp 16) and It's a bit better than this I think.  MotoGP 15 review: Just what I wanted from a MotoGP game. I've played a few in the past on PS3, and SBK09 on PC.  I don't know about realism and hardcore sims when it comes to MOTOGP style games. Steering wheels work well with car games, but for a motorbike game, I'm not sure what would be 'required for realism'. So, my expectations for 'realism' in a motorbike game aren't very high - as long as the physics seem good and it runs smooth, with decent AI, I'm happy.  That said, my Xbox controller works a treat for what it is. I can enjoy this game with full traction control on for an 'arcadey' experience, or ramp it up a bit for a more hardcore challenge.  My first review of this game was negative (see below) because I had terrible jerking and stuttering graphics. I'm not sure how, but I redownloaded the game and it runs smoothly now. So now I can have fun like I used to on SBK09, but with a more up to date game. So it's all good.    previous review: This game judders and jerks so badly it ruins what fun I might have had. Couple that with the pathetic sounds and you have yet another dissapointing Moto game. I'm glad it was on sale and I only wasted a few quid. I've tried various settings and tweaks to the config file, but to no avail. It stutters like a game from 1980. It's not my rig - I have a 970m SLI set up.  Why was a game this poor over 18GB in size to download? The mind boggles.  There is a fun game here somwhere, but I just can't enjoy with the crappy visuals and poor sound.  I used to like Milestone, but if they keep bringing out garbage like this and can't even bother to optimise it for modern machines, they can kiss my behind.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game if played on pro physics..gr8 fun..best motogp game i,ve played to date!",
            "review_score": "1"
        },
        {
            "review_text": "I'm use to racing with a car, this game is a fantastic transition to the world of motorcycle racing. It's awesome!",
            "review_score": "1"
        }
    ]
}