{
    "app_id": 355240,
    "name": "NEO AQUARIUM - The King of Crustaceans -",
    "release_date": "2015-06-08",
    "developer": [
        "Nussoft"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Underwater"
    ],
    "achievements": 21,
    "positive_ratings": 174,
    "negative_ratings": 45,
    "price": 5.99,
    "description": "YOU GET TO CONTROL UNIQUE CREATURES LIKE LOBSTERS, CRABS AND BARNACLES, IN A WILD WATER WORLD THAT EXCEEDS ALL HUMAN SENSE.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355240/header.jpg?t=1555559731",
    "minimum_requirements": "最低配置: 操作系统: Windows® XP, Vista, 7, 8, 8.1, 10 处理器: Intel® 3 GHz Processor 内存: 1 GB RAM 图形: DirectX® 9 level Graphics Card DirectX 版本: 9.0c 存储空间: 需要 200 MB 可用空间 声卡: DirectSound-compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Absolute peice of garbage but fulfills my dreams of being a lobster",
            "review_score": "1"
        },
        {
            "review_text": "I was a shrimp, all the other crustaceans bullied me. I'll show them... I'll show them all with my laser eyes!",
            "review_score": "1"
        },
        {
            "review_text": "I don't really play games like these, but I took a gamble on this and I was very suprised on how fun it is once you get the hang of it. Each creature is unique and has its natural predators and weaknesses. You can unlock a variety of creatures and it really drives you to play more and more. The gameplay is pretty slow due to it being under what and some fights can seem exceedingly one-sided, but with practice you and rush through enemies that gave you a hard time in minutes instead of half an hour. The story is mostly in the beginning and in EX mode, and it is not much but this is not really focused on story anyway. For me this game has provided hours on entertainment and it is worth the cost. Anytime you are bored or have no internet and want to play offline, use this game.",
            "review_score": "1"
        },
        {
            "review_text": "I just... what.. oh to hell with it. It's a poorly made (animated, programmed, etc.) underwater fighting game.  I only bought this because I like diving and wanted to play as the actors. There, I said it.  I may play more and edit this review in the future after unlocking all combatants, but I doubt it. It's just fun for how bizarre it is and you can show your friends. Can't say the same of some other Japanese games.",
            "review_score": "1"
        },
        {
            "review_text": "NEO AQUARIUM RECIPE!  Japanese Bug Fights, Devide the Crab vs Lobster from the rest  A weird Japanese Sega Dreamcast game that is unknown to anybody outside of japan  ???  Profit!  I really enjoy this game, Its addicting, And a little bit tactic aswell. ",
            "review_score": "1"
        },
        {
            "review_text": "I've had this game off-Steam for a while. It may look weird at first, but it's actually a top-notch mecha game. With crabs.  The game is usually played by 'C'ommanding a bunch of sea critters that aid you in battle, while destroying or counter-commanding their critters. Destroying them gives you a power pickup which fills your POW meter and increases your maximum POW the next time you 'S'hed. Then you hold down 'X' to charge up a POW-drainign special.  Corn barnacles drop the pickup all over the place, so if you have trouble fighting them... Just press 'Ctrl' to toggle out of the camera lock-on, hold 'Z' to lock onto those POW-dispensers, and either hold or mash 'Z' (depending on your character) while side-stepping their shots. Shed into POW-3 and rip them apart.  A possible con is that this game might have too much depth. Err, of mechanics, not the ocean.",
            "review_score": "1"
        },
        {
            "review_text": "what the hell did i just play? (that was awesome!)",
            "review_score": "1"
        },
        {
            "review_text": "Offended there are no pubic crabs in this game. 10/10 game though.",
            "review_score": "1"
        },
        {
            "review_text": "This is game is very unique. The controls were difficult to use at first, but it didn't take long for me to get used to them. It is a very exciting game and I would reccomend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game hurts. The graphics are really bad, the sounds will make your ears bleed, the gameplay is the worst thing in this and the camera doesn't know what it's supposed to do. If you get it as a gift, you might not want to thank the person who gave you this game. Just don't buy it. You can buy way better games for the same price.",
            "review_score": "-1"
        },
        {
            "review_text": "11/10 Best Crusteacean sim on steam.",
            "review_score": "1"
        },
        {
            "review_text": "I AM THE KING OF CRUSTACEANS",
            "review_score": "1"
        },
        {
            "review_text": "I AM THE CRAB KING!",
            "review_score": "1"
        }
    ]
}