{
    "app_id": 355560,
    "name": "Trigger Runners",
    "release_date": "2016-03-03",
    "developer": [
        "EfrenStudios"
    ],
    "publisher": [
        "Karaokulta Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 47,
    "negative_ratings": 15,
    "price": 1.59,
    "description": "Stop a tyrant consuming the world's resources.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355560/header.jpg?t=1457481149",
    "minimum_requirements": "OS: Windows 7+ Processor: Intel Ivybridge Memory: 512 MB RAM Graphics: Minimun Storage: 40 MB available space Sound Card: Any Additional Notes: It could work better if you have flash installed",
    "recommended_requirements": "OS: Windows 8+ Processor: Intel Ivybridge Memory: 1 GB RAM Graphics: Minimun Storage: 50 MB available space Sound Card: Any Additional Notes: It could work better if you have flash installed",
    "reviews": [
        {
            "review_text": "Not a bad game, but neither is good. An experience so simple (because it's meant to be played in movile devises) that really doesn't make an efford to stand out. Bland narrative, mediocre graphics, tedious bullet-sponge bosses. There isn't even a scoreboard implemented and the game dificulty levels feel the same, it really doesn't have replay value. In the other hand, the price tag is fair.",
            "review_score": "-1"
        },
        {
            "review_text": "In Trigger Runners you are some sort of cowboy who feels like constantly running (or magically flying) to the right. You can shoot incoming enemies and mines that are in the way and you call also jump over obstacles and holes. You will almost always be on the left side of the screen (no moving on x-axis) except for one chapter of the games. Most bosses are interesting and fun that requires different strategies to defeat. The only complaint i can make for the game is the second to last level which has some ♥♥♥♥♥♥♥t platforms in the end. It's beatable but really hard.",
            "review_score": "1"
        }
    ]
}