{
    "app_id": 355630,
    "name": "Leo’s Fortune - HD Edition",
    "release_date": "2015-09-08",
    "developer": [
        "1337 & Senri AB"
    ],
    "publisher": [
        "Tilting Point"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Platformer"
    ],
    "achievements": 37,
    "positive_ratings": 196,
    "negative_ratings": 18,
    "price": 4.99,
    "description": "Leo’s Fortune is an award-winning platform adventure game where you hunt down the cunning and mysterious thief that stole your gold. Beautifully hand-crafted levels bring the story of Leo to life in this epic adventure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355630/header.jpg?t=1447370612",
    "minimum_requirements": "OS: Windows 7 or later Processor: 3.0 GHz or higher (single core or higher) Memory: 2 GB RAM Graphics: Non-integrated graphics card that is 5 years or newer or integrated graphics card that is 3 years or newer, with 256MB VRAM with Shader Model 3.0 or higher. DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectX Compatible Sound Card with latest drivers Additional Notes: Windows-compatible keyboard and mouse required, optional Microsoft XBOX360 controller or compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "+ Beautiful art + Well designed levels + Good amount of checkpoints  +/- Collision detection is sometimes hit and miss  - Too short - Easy  [Rating: 71/100]",
            "review_score": "1"
        },
        {
            "review_text": "Wow! I have been playing video games for almost 40 years (since PONG). I love 'left to right' 'platformers' with 'leaderboards' the most. This is one of the best I have ever played. The level design is absolutely incredible. There are shortcuts to be found on every level. And I love that there are different objectives. And the graphics are really something else. If you just stop and look, you'll be amazed. To round it off, with leaderboard support, this game has plenty of replay value. Well done!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really neat physics-based puzzle platformer with a charming but not overly done amount of voice acting and cutscenes that made me smile throughout the game. You aren't punished for dying, there are a generous amount of (unmarked) checkpoints and each level has 3 optional objectives: beat it without dying, collect all gold, and beat under a certain time. Each can be individually earned, which gives a small amount of replayability to the game if you are into that sort of challenge.  Your character, Leo, can inflate himself or make himself heavy. This lends itself well to the various platforming segments and physics puzzles you will encounter. There was a lot of variety in the puzzles and the levels so your 20 main story levels won't get repetitive or predictable.  Though it is relatively short, it is worth the asking price in my opinion. I beat the whole game in a little over 3 hours but enjoyed all of it. I didn't do most optional objectives, but I did collect all gold on each level restarting each level or checkpoint enough times to do that.  (warning: reports of steam controller incompatibility, but I used an xbox 360 controller and had no issues)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing puzzle/time killer game, very relaxing, awesome graphics and funny storytelling with good characters.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics is beautiful and eyecatching and sound design is good too; and the minimalistic and easy platformer gameplay works wonderful on smartphones but on pc it is another story. levels are straight forward and too easy to be fun as a platformer game and there is no puzzle in the game that needs some brain. unfortunately you will never have the motivation to gain all 3 stars of levels because it's a waste of time. Obviously game is designed for casual gamers on smartphones and I'm sure it's wonderful on that platform but not on pc and not for hardcore gamers like me. Buy on full price at your own risk, because you can complete Leo's Fortune under 2 hours and it has no replay value.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm not terribly impressed with this one. It certainly has its pluses: the graphics are gorgeous, some of the level design is fairly interesting if pretty simplistic (though I didn't play very far so perhaps I simply didn't get to the more complex puzzles), and the music and narration are pretty good.  But the controls ruin it for me. I find them too 'floaty' (and no, I'm not talking about the times when you actually float intentionally), in particular making it very hard to predict the trajectory of jumps. In one early level the player has to jump straight up and fall straight back down to move a platform he is standing on. This should be simplest thing in the world but I could barely do it because my character would drift all over the place.  Nice cosmetics, fairly underdeveloped mechanics. That may be all the smartphone crowd expects, but it's not doing it for me. Porting this to PC and consoles probably called for more than higher resolution backgrounds.  Some will say I'm expecting too much of a $7 game. Perhaps. You may find it worth the price as a simple, accessible diversion. I guess that's just not my thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't bring anything new to the table, we've all seen this type of game before. But it's still great. It's a basic platformer with great, smooth controls and AWESOME music. The only thing bad I really have to say is it's too easy. It really holds your hand, checkpoints are every section of a level, and it pretty much shows you how to solve a puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "This game just has that great atmosphere that makes you smile. Awesome art, soundtrack, it even has a good story and the game is challenging enough. It even has a hardocore mode (which is pretty hardcore). Also, it's cheap. What's not to love? Go find your fortune! ",
            "review_score": "1"
        },
        {
            "review_text": "This game has astonishing visual art. There is good balance between action and puzzle-solving. It is very fun and pleasing to play.",
            "review_score": "1"
        },
        {
            "review_text": "Look at this little ball of mustache! He's so... hairy, and fluffy, and super cute. The gameplay is pretty simplistic and very fun. Fall in love with sidescrollers all over again with this awesome game that has a few simple controls that you can easily master: left and right, space to inflate/jump, and down to dive. Make your way through the different acts, each with their own theme, and solve the little puzzles along the way. And if you want to master the levels, you can go for no deaths and beat the clock to unlock an extra star for each 'challenge.' These stars add up to unlock little bonus levels which are also fun to play. I purchased this game during a sale and I don't regret picking it up. Help Leo find his fortune!",
            "review_score": "1"
        }
    ]
}