{
    "app_id": 355810,
    "name": "Centauri Sector",
    "release_date": "2015-06-23",
    "developer": [
        "LW Games"
    ],
    "publisher": [
        "LW Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Action"
    ],
    "achievements": 22,
    "positive_ratings": 29,
    "negative_ratings": 16,
    "price": 3.99,
    "description": "Centauri Sector is a top down tactical space combat game powered by a dynamic turn based campaign, rpg elements, fleet management and ground base combat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355810/header.jpg?t=1541418909",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core 2 CPU Memory: 2 GB RAM Graphics: NVIDIA GT/s 2xx or Equivalent DirectX: Version 9.0c Storage: 300 MB available space Additional Notes: Works on XP too, but this might change on future updates.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Quite an enjoyable game, but I think one which most veterans will find relatively easy and with little replay value. I spent a couple of hours beating this game, and while I may return for a couple of forays I don't anticipate significant replay value. There are no difficulty levels and I didn't find the game difficult on the default setting. The space portions are well thought out and fun, the tower defense portions are like a poorly thought out TD flash game. I encountered and reported a few bugs during my run through, but both were fairly critical: graphics representing enemies and allies not appearing on the map for the duration of a mission. I would recommend this game when it's on sale. The experience is definitely worth some dollars, but probably not ten.",
            "review_score": "1"
        },
        {
            "review_text": "Why the hell is this game not tagged casual? Way too easy. For it to be a Tactical RPG it lacks tactics and also the RPG, It's basically a wannabe RPG that's actually an extremely boring Asteroids clone. Except you don't need to dodge enemy ships.  Game content: 4 Different ships and basically 2 different guns with varying stats. The TD labeled 'Ground Combat' is very much like those minigames in Assassins Creed. Too easy, annoyingly drawn out and taking too much from the programming budget from the core game. Well, the hollow, rotten core game.  Oh and there's bugs. Wouldn't expect gameplay breaking bugs in a game without gameplay? Think again.",
            "review_score": "-1"
        },
        {
            "review_text": "A very simple game with nothing new or interesting. You can find games like this online in flash for free.",
            "review_score": "-1"
        }
    ]
}