{
    "app_id": 355800,
    "name": "Space Run Galaxy",
    "release_date": "2016-06-17",
    "developer": [
        "Passtech Games"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Tower Defense"
    ],
    "achievements": 30,
    "positive_ratings": 478,
    "negative_ratings": 269,
    "price": 14.99,
    "description": "Space Run Galaxy is the sequel to Space Run, the game from one-man studio Passtech, which seduced hundreds of thousands of players with its dynamic and original gameplay. By twisting the tower-defense game style, Space Run offered an addictive real-time spaceship construction strategy experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355800/header.jpg?t=1473694863",
    "minimum_requirements": "OS: Windows Vista, 7, 8.1, 10 Processor: AMD/Intel Dual core 2.4 GHz Memory: 3 GB RAM Graphics: 1 GB, OpenGL 3.3 Compatible NVIDIA Geforce 9800 GT/AMD Radeon HD 3870/Intel Iris 5100 Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Just wanted to say thank you for everyone that's been doing shipping runs for me.  Wish there was an in game button to acknowledge people for doing so.  Gameplay wise this game is a treat, it builds on the first one. It took me a while to get used to how the map and all the other functions work, but once you get the hang of it you'll love it.  Like most people that reviewed the game so far (19/06/16) there are server issues ranging from being painfully slow to just randomly going offline hindering any progress you made during the time non existent.  Server issues aside when it's working all good you'll lose many hours.  Just one more run.  Just need to move this cargo then I'm done.  Bought a new weapon want to try it out.  That multiplayer run looks easy. Only got two stars.  Aiming for three stars.  Crap gotta go to work.  This run will only take 5 minutes...",
            "review_score": "1"
        },
        {
            "review_text": "Great game that expands nicely on the mechanics of the previous game. Unfortunatley it requires an internet connection to take advantage of all the features, and support insn't ideal. Still worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game. I can see why some people wouldn't, but they have a pretty good balance for the different systems, new creatures for me to shoot in the face and a new system to do it with. There was a bit of lag today, hopefully it'll clear up soon, but this game is going very well. I thoroughly enjoy it. I've crashed a few times, but over nearly 30 hours, it hasn't been a significant amount. 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "The fun of the first game packed in a bigger universe, together with some new equipment and the choice between multiplayer and offline mode.  If you don't know the first game: This is a tower defense game, just that your plattform for towers is a spaceship, flying straight from point A to B without you beeing able to change the course. On the straight flight numerous dangers will apear, from asteroids over pirates to space-monsters.  You start each flight with your cargo (which can be placed to your liking) and one tiny engine. You have to build guns and support according to the arising dangers and you will have to build more and stronger engines to make a timely arriving. The less time you needed and the more cargo arrives intact, the more ressources and XP you will get to enlarge your ship and buy new guns and support.  Pro: - each stage is repeatable, you will never get stucked with too less resources/xp - each stage is randomized to a certain point. No flight is like the other, but the randomizing is pretty well balanced - you won't get obverpowered by pure chance. - choice between pure offline or pure online gaming - pretty well grafics and sound - transporting cargo of other players is always bound to a random reward, even if the other players pays nothing for it (payment of other players is always a bonus to you) - a damn good feeling hauling the cargo of other players :)  Con: - some server issues since more player bought the game as anticipated (but the new servers went online only one day after the crash and it is working stable now) - offline play misses a bit the random reward for hauling other players cargo, since you get reward for each piece of cargo and the NPCs from the first galaxy only offer three or four pieces (while player can offer more, like the NPCs from the next galaxies also offer more)  Neutral: - offline play is a seperate profil (so no cheating online, which is good, but you would have to start from anew)  All in all, a game I will invest much more hours into it. :)",
            "review_score": "1"
        },
        {
            "review_text": "Good bit of fun as you begin your space run throughout the galaxy.  If you have played the original it is more of the same except for some much needed few changes.  The spawns are now randomized. In the original game you had to almost memorize the spawns and place your defenses appropriately to defeat the game. Now you can't do this as the spawns can come from any direction. This also gives this game good replayability.   Multiplayer market and contracts. Now you can take on contracts and buy/sell goods to the multiplayer community. This gives a good experience of how the shipping business really is and you can really make some nice space credits doing so.   New and Upgradeable ships. In the original, you were stuck with a certain type of ship and had to make it work. Now you can purchase any ship you like and there are a myriad of base ships available.   The only bad thing that I can report is that sometimes server lag causes wait times when loading up to be slightly longer than normal. However, I have not experienced much interruption in gameplay.           YouTube™ Video:  Space Run Galaxy - Gameplay Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Frankly the game is simply remarkable. Joyful and engrossing gameplay and progression, brilliant level design keeping the game challenging and interesting as you constantly progress and become better. A truly intelligent game that encourages creativity. On the one hand there is constant satisfaction of becoming better and upgrading your ship, on the other hand it never becomes cheesy or too easy. Joyful and addictive gameplay that will keep you doing ' just one more run'... Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the server issues, the game has been great fun so far. A solid example of a good tower defense game, even if it is slightly overly simplified and too easy.",
            "review_score": "1"
        },
        {
            "review_text": "Have played for 30+ hrs now and yet to see any other issues than the server beeing down  The game is a nice upgrade from Space Run and if you liked that game this will most likely be hrs of enjoyment for a fair price.  The pros: Nice upgrade from the first Tons of fun runs Pretty descent gfx Music is fitting Stable client Offlinemode for when the server is down NO pause button :)  The con: Server is often down  I bet most negative reviews are due to the server issues (that no doubt will be resolved) and the fact that few seem to found that offline option :)  Hope this review helped.",
            "review_score": "1"
        },
        {
            "review_text": "Finished the game  This game is for you if: - You like space ships - You like tower defense games  Good - Better than the Space Run Number #1, cause the location where monsters spawn r randomized (except for bosses) - Ability to do more than just tower defense: trading, transporting, collecting, upgrading, buying new ship, etc - Multiplayer request &amp; items for sale is a nice addition  Bad - No `speed up` button. Most tower defense game have a `speed up function` this game doesnt have it - Lack of people playing to make the multiplayer request &amp; sale work ",
            "review_score": "1"
        },
        {
            "review_text": "Hops Into Space Run Galaxy:  Fights the kraken without proof of it's existence. Here's how it went.  THE GAME: He's finding this to easy. RELEASE THE KRAKEN!  Me: SPAM THE SPACE LAUNCHERS THE NUCLEAR MISSILES AND THE MISSILE LAUNCHERS! KILL IT!  After the mission: That was easy, got any more krakens? :bbamsmily:  10/10 For suprise. 10/10 For being realistic. Solid game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "★★★★☆  Space Run is back with a way bigger and awesomesauce game. There is a lot of contents, ships, missions, for a ton of hours of fun. A decent price for a super strategicness game.",
            "review_score": "1"
        },
        {
            "review_text": "I like it more then space pirets zombies 2. Feels better but less control over everything. keeps you on your toes.",
            "review_score": "1"
        },
        {
            "review_text": "I quite like this version of the game. It keeps the same base with additional upgrades, for instance, you pick the shape of your ship (depending on your blueprint and the number of tiles you have, though you can buy one massinve blueprint and design whatever you want), the number of units you can build in battle is limited to how much you have created, not like the previous game where you could build 100 of 'em, assuming you have the space and money. You do have to grind more than in the previous one, if that doesn't float ya boat, I doubt you'll have fun with it. The addition of 'Focus' meter can seem cheap, since it limits the usage of units abilities but it makes for more strategic run. The use of 'connector' tile can save ya ♥♥♥ though it take a bit of getting used to. Pirate boss battles are still around, though, you can travel around them if they are too tough for you. Eve's classic comments are awesome, but that's personal taste so yea. All in all I'm at start in Titan system and it's a blast. Getting a new ship, change of tactic, adding new units and firepower, just awesome. Multiplayer part is well, kinda there. All you can do with it is buying other people stuff they don't need for range of prices, deliver their cargo for a small gifts and such, and well you can do the same. Sometime you'll run into nice deal which will save you money from Roma or few trips to get 'em at certian location so I guess it's ok. Few things that are off. Your units aiming is sometime dumb.... Instead of focusing on one or two enemy units to quickly take em out, they will just randomly target anything, even if all they need is one shot to the enemy, some manual or smart targeting would be great. Next thing is, you can have odd number of units before you need to get to higher level mechanic, which is rather wierd, having only one unit of decoy or Aegis shield, but oh well. I had only 2 crashes, one where I wasn't doing anything and one where I just finished a run, resulting in me have to do it again, but since I played like 80-90 runs so far, it's not that bad. Aside from couple off things devs did I quite like the game, and believe anybody who played Space Run will enjoy Galaxy, oh there are also some in game achievements for all those uber-core bastads :)  TLDR The game is step froward from the prevoius one with some upgrades and changes, so if you like what they added you'll love the game, which I do :) Cheers  **A simple edit after finishing the game: I still stand with what I said, but what's regretable is that max number of hex units you can have is 122, Liberty and Sovereign being exceptions, but rather minor one. What would be nice is that after endgame you could unlock extra 30 or 50 more units to build even more stuff, considering you have to 'truck' 70 units of space from A to B for the last side mission..... Also, most of the runs must be done in 5-7 mins for 3 star reward, few rare ones are 9 mins. Imagine special run of 20 or so.  And maybe the biggest letdown is that you can not have the ship that is on second screenshoot here, as it is has more than 122 units to build, but I guess that's just personal taste :) Cheers",
            "review_score": "1"
        },
        {
            "review_text": "Played the first game, this one has developed and am loving it.  Focus and special abilities are your friend, engines generate focus so don't neglect them for another shiny new cannon. A game can turn on the use of a well timed/placed special.  Servers are flaky as they underestimated demand and game seems to want to connect to servers every microsecond, you can play offline.  ",
            "review_score": "1"
        },
        {
            "review_text": "A great follow up to the previous Space Run game, they changed a couple of things that are taking a while to get used to. But none the less a solid sequel.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Space Run you will like this one too. It´s more grindy. the building of components and getting new ships is very motivating.  So far there are lots of problems with the Game Server, which means most if the time since the release you are not able to play or the server reacts slowly on inputs. So you might better wait a while with purchasing,  Probably going to update this later. The ongoing ♥♥♥♥♥torm of bad reviews because of connection issues is not fair in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "it's like a tower defence game... but in space... and challenge... i recommend it",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Tower Defence + Space Trucking in a dynamic galaxy.  Its a brilliant mix that no one else thought of.",
            "review_score": "1"
        },
        {
            "review_text": "Did you like the first one and think to yourself you want more of this?  Well, that's what you get. More. Way more.  Just be aware that the game does get harder than the first one. Mainly because you have to design your own ships and some of the runs have random enemy directions (though bosses tend to be predictable).  If you don't learn how to adapt your ships you will struggle.  If you expect to finish 100% it's going to take you 100+ hours and a lot of that will be repeating missions to grind out more money and figure out better ship designs to get max stars on every run.  If you don't want to burn out, play the game a couple hours at a time. Each run is roughly 10 minutes and while there is variety, it can get repetitive if you are planning to spend an entire day on it.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the original Space Run you will most certainly like this game. I for one love it.  Most of these negative reviews have to do with the server issues that occured on the games opening weekend. Those over at Passtech games didn't expect as many players as arrived and had to do emergency server surgery. Guess some people don't have patience.",
            "review_score": "1"
        },
        {
            "review_text": "  If you enjoyed the first game you will enjoy this, with the addition of multiplayer aspects and ship customisation it really is a great game.  This is part of my series, it's the biggest haul i've done (so far).          YouTube™ Video:  Space Run Galaxy - Gameplay - 18K Credit Haul - Part 10&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "fun game.....if anyone could play it. long story short is the dev's greed drove him to release this game before the servers were anywhere near ready. the game was taken offline for hours last night and is now down for another 24 hours, for those of us unlucky enough to have played this at release we can no longer refund. this is a single player game with an online market system, even though 100% of the gameplay is solo you MUST be connected to their servers to play at all. unless you enjoy paying your hard earned money for a game you cant play dont buy this. i loved the first space run and this one is even better and i spent my last $16 and was planning on playing this on my sunday off from work....instead im just reading a patronizing post from the dev thanking me for my patience and playing with my ♥♥♥♥, does that sound like $16 well spent to you? not only did this dev release knowing the servers were no where near good enough im pretty posative he didnt fully take them down and do this yesterday because he wanted to allow most who bought it to play past the 2 hour refund limit.   ok as of now the game has been back up for a few hours and it appears to be stable so now i can fully reccomend this game. if you like the first space run or just a fan of TD's you will love this game. im not a huge fan of multiplayer games in general but i like what they did with it in this game, all the gameplay is still solo but you can pay other players to ship goods for you and vice versa, its very basic multiplayer. i honestly dont really hate anything about this game, aside from the sloppy release i love this game and for 16 bucks you really cant go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Upgrade this horrible server or I won't recommend it  update 6/25  After the server expanded, I can finally recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Yep - more fun than the original! - takes an hour or two to get into but then it's really fun!",
            "review_score": "1"
        },
        {
            "review_text": "As of this review, I have 7.2 hours of gametime. Perhaps 2 hours (being generous) of that is actual playing, and neither of those two hours are contiguous. The rest of the time is troubleshooting nearly non-stop crashing.  Offline mode doesn't work and requires a connection to Steam- so you can't play it offline anyways...Not that I was ever able to get Offline Mode to work. Closest I ever got was making a profile, then it crashed again.  Love the expanded concept, appears that the dev actually cares about the gameplay- but I suggest not purchasing it yet. It's nowhere near stable. Supremely disappointing and has worn my patience razor-thin with all the troubleshooting I've tried on 3 different machines to try and get some actual playtime in.  When it works, it's pretty fun. But it's not worth the aggravation, and definitely not worth the pricetag. I've got 49 cent games that are more stable.",
            "review_score": "-1"
        },
        {
            "review_text": "The mechanics are ok, but it's way too grindy, the added 'open-world' to the original Space Run is too much and is the cause of the grind.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoyed the first Space Run game. It gave me many hours of hybrid tower defence fun. This game however has added unneeded complexity to what should have been a very simple formula to get right. More missions and more areas to travel to while keeping the core fundamentals of the game intact.  Instead the weapons have changed. Dramatically. You need to buy and sell materials to be able to build weapons. And you need to transfer these around to stations that have the right technology level before you can do anything. Very time consuming and ends up turning into nothing but a grind.  If you want to play a good hybrid tower defence game, purchase Space Run the original. This is trash. Don’t waste your money. ",
            "review_score": "-1"
        },
        {
            "review_text": "Same as the 1st game its fun at the start but no pause function pretty much makes late game a nightmare and not fun.  i guess if your a professional starcraft player u might find the micro fun this game cudda been amazing with 10/10 review with 1 function PAUSE.  dunno how many people complained but dev doesnt listen i guess.   why people think a 99% single player game cant have 2 options i dont know. hardcore mode with no pause? make both sets of players happy?   game was better in beta b4 i reached later systems and realised what a cluster**** it was",
            "review_score": "-1"
        },
        {
            "review_text": "let me be straight here: I like this game, but I am very disapointed. And the disapointment is so big that I can not really recommend this game to anyone who is not a huge fan of the first spacerun or the original board game.  I bought the game in preorder, and I have to say, I realy liked it so much more in the bata stage. When it reached its final state, there were introduced several limitation which I really hate. Such as limits to amount of structures you can own. This is hidden behind mechanic level, and it only means that the game gets hardrer and more anoying than it was before.  Dont get me wrong. I like the game wery much, but the missions (especialy those with some ramdomness in the enemies apearing in the mission) can be pretty hard at times. I strongly believe that it is design decision, as I was not able to find a way how to finish some missions (with 3 stars and without loosing cargo) without almost completely rebuilding the ship in mid mission and in great hurry. And to tell the truth, I hate that. Usually it is possible to play it in less frenetic way, but that in general meand finishing second or third, or to loose some cargo. Which I do not like, but I do not like that constatnt stress from the frenetic gameplay even more.  I did not have had such bad feel from the game while it was in beta stage and certailny I did not have had such feeling from the first space run either. And for some reason, I enjoyed the original game much MUCH more, even though that there were less equipment and less levels and who know what more.  When I think of it, the amount of things one can build is not really helping at all. to nema one thing I do not like there - for some reason, in every one group (from the three basics) there is some kind od offensive device, and somehow I do not feel like the 'red' are actually the best offensive devices at all :(.   But to be fair - the variability of the items is great but yet again, liked the equipment (and especially its leveling up) much more in the first game. Here it feels like in every mission I am starting from beginning without actually learning anything. Well appart from that I can buy few more items. But then again - if I have to buy each device, why is it it not already placed on the ship? Or should it be a 'blueprint'? Then why cant one be used several times? And yes, I _know_ it is a game mechanic, but it is one I do not like at all and well, I see no real reason for it. Apart from making the game harder and players more anoyed.  So no, I clearly can not recommend the game and I am really sad about.  Oh, and another issue I have noticed during the last game servers problem (server inavalability): when I tried to run offline game, then I did not have had access to the game progress I have already made while playing online. Of course, when starting a new game there is a warning that offline saves can not be converted to online ones, but why is it not possible to play offline with online saves? Or at least convert/copy the saves as offline saves so the game progress is not lost? What the hell are the devs thinking? This really is a horrible decission and another reason for me NOT recomending this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Click 'Play' 'Connecting to server' 'Error while connecting to server' Click 'OK' Click 'Play' 'Connecting to server' 'Error while connecting to server' Click 'OK'  Repeat a couple times and click 'Quit'  You cannot play this game their servers are down. ",
            "review_score": "-1"
        },
        {
            "review_text": "The game ... if you are one of the lucky 500 to get a place on the server is good,   if not, well that just sucks",
            "review_score": "-1"
        },
        {
            "review_text": "'Error connecting to server' Who in god's name thought adding multiplayer features that require you to always be online to a tower defense game were a good idea? Terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "The heavy grind and a sudden increase in difficulty really turned me off the game after passing the easy first sector. I hope they lessen this grind by making prices cheaper. Would recommend for a person wanting to tackle challenging missions and love grinding for materials.",
            "review_score": "-1"
        }
    ]
}