{
    "app_id": 355860,
    "name": "Albino Lullaby: Episode 1",
    "release_date": "2015-09-14",
    "developer": [
        "Ape Law"
    ],
    "publisher": [
        "Ape Law"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "VR Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 28,
    "positive_ratings": 243,
    "negative_ratings": 79,
    "price": 7.19,
    "description": "Albino Lullaby is a horror adventure game that doesn't rely on jump scares or gore. Escape from a surreal psychological nightmare as the world dynamically twists and contorts around you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/355860/header.jpg?t=1478193061",
    "minimum_requirements": "OS: Windows 7 or Later Processor: 2.0+ GHz processor Memory: 2 GB RAM Graphics: SM3-compatible video card DirectX: Version 10 Storage: 6 GB available space",
    "recommended_requirements": "OS: Windows 7 or Later Processor: quad-core Intel or AMD processor Memory: 4 GB RAM Graphics: DX11 compatible video card DirectX: Version 11 Storage: 6 GB available space",
    "reviews": [
        {
            "review_text": "This game is more creepy than straight horror. You'll find moments of anxiousness and tension rather than something jumping up and scaring your socks off. I find it to be a lot more enjoyable than the alternative.  The visuals do an excellent job of setting the mood and are pleasing to look at too. They also do a good job of directing the player at times.  There is some humor to be had too, and it isn't a punishment so don't be afraid to experiment and just have fun with it.  My only grievance would be the episodic release method but with this being Ape Law's debut title I can see how it would be a necessity. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm slightly sensitive to particular motions in VR. There is 1 other game that makes me motion sick (ADR1FT). The rotation of the character in this game is instant, fast, and unadjustable. Makes me sweaty and sick each time I rotate. There are also plenty of rooms that move around on their own with you inside them or not.  I do not get motion sick in Windlands, however, which is odd as there's far more motion going on in Windlands. Not sure what to chalk it up to.   Aesthetically it looks really awesome. It feels weird being inside this space which is awesome. A shame my weak weak equilibrium cannot handle this game (and ADR1FT).   I'm going to assume others don't get as motion sick as me, so if that's the case I'd still recommend this for its 'Tim Burton' feel in VR even though I have no idea what's presented beyond the initial area..",
            "review_score": "1"
        },
        {
            "review_text": "A game with no blood, no gore, no jumpscares. Only the atmosphere to scare the player.  The result? It works, but not to its fullest extent.  See, the game has a 30 fps cap, which gets rid of the flow of the game very easily. Not only that, it's not so much as scary, more or less creepy and disturbing. Which, is not a bad thing. There were times where I felt intimidated by the large crowd of grandchildren, to the point where I got scared. Even the changing enviornment keeps you on your toes.  *SPOILERS*  Since you released Buck, you're given Buck's Clicker. It's a cool mechanic, one click, one charge. However, the charge ports aren't very scarce and you can just keep using the clicker over and over again.   However, the game has a pretty interesting story so far, great visuals, and I can't wait until the next episodes come out.  I give episode 1 an 8/10. Improve the 30 fps cap, and make the charge ports for the clicker more scarce, and I believe this may be a very cool game.",
            "review_score": "1"
        },
        {
            "review_text": "It's short, but I don't mind short if it's engaging. And this kept me engaged the whole way through. The writing was delightfully disturbing, the art design was childishly appropriate, and the music and sound were eerily perfect.  Favorite part: I particularly like the dynamic nature of the levels: moving rooms, clockwork level design, etc. That's a fresh approach to level design and one I hope they explore more in future projects.   Least favorite part: The finger-monster-grandchildren themselves--it's a very interesting and disturbing creature design,sure, but it's also SO rudimentary in terms of rigging and animation...It's hard to feel threatened by something that doesn't even seem to have it's lower jaw weighted to any bones and just slides around. There's a bit of a missed animation opportunity there.  Still, I certainly had fun with my time in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Look framerate is an issue, but this is a pretty coooool game! should you play this: yes.",
            "review_score": "1"
        },
        {
            "review_text": "We are extremely enjoying playing Albino Lullaby. It has just the right level of suspense and creepiness.",
            "review_score": "1"
        },
        {
            "review_text": "Albino Lullaby: This game is awsome and great if you are sick and tired of the cheap jumpscare tactic this game is for you it focuses mostly on you and the enviornment and how you corespond with it and very creepy and has a demented feeling and sick twisted cult enviorment and yes there are a couple of bugs but the devs ape law is working on it to fix some minor autherizations and make this game to its full potential but i enjoyed playing this and for a indie title this is excellent in graphics(u4)and story and a must have for any horror fan",
            "review_score": "1"
        },
        {
            "review_text": "Albino Lullaby is one of the best horror adventure games you will ever play. It blends high concept ideas with some really imaginative surreal imagery to great effect. The VR isn't great, so I suggest playing on a normal monitor or TV to get the full experience. Controller compatibility is excellent. Only really negative is that graphics settings are a little messed up - changing the resolution to anything other than 720p causes the game to get really blurry and low quality... It's really quite strange, and I don't really understand why it happens. It's not my PC, as I've had far more powerful games run 1080p without issue. But otherwise, on a technical level, it runs great.",
            "review_score": "1"
        },
        {
            "review_text": "What could be an interesting idea, quickly turns into a 'stealth' game where you avoid enemies walking in circles.",
            "review_score": "-1"
        },
        {
            "review_text": "Albino Lullaby is absolutely unique enticing game with intense creepy atmosphere that is perfectly made with VR in mind. Having said that there are some shortcomings that need to be addressed for people interested in buying.   Pros: Gameplay and Style of environment Simple Exploration even when there is no obvious objective it is very difficult to get lost Great Atmosphere can easily get lost exploring the environment and all of its gems full of detail  Cons (mostly performance) GTX980 and there was judder when outdoors on all quality settings even LOW which is unacceptable being that the recommended specs for the consumer rift is a GTX 970 Reset orientation gets screwed up in main menu First two cinematic sequences I was faced the wrong way even when reseting orientation Text can be a TINY bit clearer it is on the verge of squinting to read but still legible  Would still recommend but if the performance was fixed everything else could have been easily overlooked. Judder is an immersion breaker and nausea inducer which should be the priority when releasing a VR game. I'm sure the devs already know this and I hope they will release patches soon that will increase optimization.   ",
            "review_score": "1"
        },
        {
            "review_text": "If Tim Burton was a game developer this would be the kind of game he would make. Instead of gore and jump scares you get a game with a giant whimsical environment that is simply addicting to look at. I was expecting Beetlejuice to show up for the first 45 minutes I played this. Non to mention the thrilling edge that's been honed into this game plus a very intriguing story line that I have yet to further explore. Additionally, the voice acting is very well done! I will be buying episode two and three. I can all ready see somebody making a thumb creature suit for a convention. I would.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty okay Tim Burton style stealth horror game. It's a bit short for $10. The second episode is taking a bit too long to come out.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game, the art stlye is fantastic and different. I have never played another game like this one, it's just an awesome concept. Definitely worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "The game is wonderful! Only issue I had with this, is that even though I have a high res laptop it was VERY laggy. It was so hard to get into the game because it was like I was looking at a slide show at some parts. I hope they fix this soon:/",
            "review_score": "1"
        },
        {
            "review_text": "This is a very unique and we'll made game. Ape Law brought a creepy vibe to the table with no blood, gore, or jumpscares. I can't wait for episode 2! And then is a nice twist at the end ;)",
            "review_score": "1"
        },
        {
            "review_text": "After making several recordings of this, pondering over what they're thinking of at ApeLaw, and even speaking to some of the developers, I've come to one conclusion.  This game, like it's devs, is as odd as it is brilliant.  Think of a world that has no jumpscares, no gore, and yet has so much that your brain will either  make up  or make you really think that  you  begin to create the eerie nature of this game yourself. Here's the good, bad, and VERY ugly.  Pros: + The gameplay is nice, with very few bugs + The sound quality is awesome, as well as the art style of the landscapes and characters. Very well polished. + Although not being able to relate to the characters, trying to understand their mindset from a psychological perspective makes for a neat time. + It's under $20. HOLD UP. I know it's the first chapter and the whole thing  might  end up costing more than $20 but at least you can try this and see if you like where they're headed! + Narrative is to die for. Literally. Dying. Lots of it.  Cons: - With a few bugs as I played, sometimes my save game would spawn me back in with NO enemies around at all, stopping progress and forcing a reload. Not ideal, but nothing terrible. - 'No jumpscares' is very tricky wording, considering you might cause yourself to have some with stupid things like thAT STUPID CHAIR IN THE LIVING ROOM. - Another tricky word is 'photosensitve seizure'...Oh wait. That's two. Regardless, be wary.  All in all, this is literally, in the first chapter, not only caught my attention to the fact that horror games don't need screaming or jumpscares to be scary, but also that this is a diamond in the rough. +1 to you, ApeLaw.  SCORE: 9/10  -Renpix",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game. Great art style and I'm really looking forward to learning about more of the lore in Episode 2...whenever it comes out.",
            "review_score": "1"
        },
        {
            "review_text": "I did not enjoy this very much - there were some enjoyable moments. There were times I got stuck, I got really frustrated and wanted to rage quit, but pushed on.",
            "review_score": "-1"
        },
        {
            "review_text": "In it's current state I don't believe Albino Lullaby is fit for sale. What I experienced was a buggy mess with gameplay that barely functioned correctly and a horror element that wasn't scary.  Before I go into what made me hate the game so much I will briefly talk about the few thing I did like about the game. The first of them is the graphics style. I love the cartoony style that the characters and world are animated in. It's simple but very effective. The world is full of colour.  Added into this is just purely the setting of the world. The basics of the setting is a mechanical household world with rooms that can move about by the press of buttons. Parts of the world seem to be a kind of mad house setting. The outdoors sections of the world are beautiful colourful settings. The world is set upon a seemingly endless pit. The setting of the world really got my attention.  I was also rather fond of the story. Fitting into this uniquely designed world is also a very unique story. It seems to be that there is a cult following from grandchildren to what they call the grandmother. You find out some very creepy facts around the world. The majority of the story is told through notes found around the world. Unfortunately the story has a cliffhanger ending at the moment due to it being episodic though.  Unfortunately this is about as far as my good experiences went for the game. I guess I'll probably start with explaining what I didn't like about the horror, since thats probably why your looking at this game in the first place. The game seems to pride itself on not using jump scares. This means they have limited options on how to carry out horror. They needed to create a horrifying atmosphere instead. Unfortunately they didn't do this. There only attempt at horror was the enemies (called the grandchildren). They're creepy for about the first minute you see them and then they just get to be neusance. The way they focus on the horror in these enemies are through the voices. They have a kind of creepy tone to them. This creeped me out when I first saw them and then just got annoying.  Which brings me nicely into my next point. The voice acting. I mean it's kind of a mixed bag. I enjoyed the enemies voices at first. There voices were usually in a kinda high pitched old man kinda tone. But this gets old quickly and very annoying. And then you realize the voice acting isn't actually good at all. The other issue with this is that the enemies repeat the same quotes multiple times. There isn't enough variety in what they say to last through the game.   The biggest issue I had throughout play was a game breaking bug. Through fault of the game I had managed to go backwards an objective through a door opening when it shouldn't have. This made me had to complete this section again. However I couldn't. When I got to a door that I had went through before when completing the objective it was seemingly blocked by a rock. This meant there was no way for me to continue to progress. It meant I had to completely restart the entire game from the beginning again. I was about 1.5 hours into the game so I wasn't particularly happy about this. I attempted to speed run the game again to the point I was up to which took me about an extra half hour of gameplay still. I reached out to the developer about this issue and they are looking into it. Whats worse is it isn't the only game breaking bug out there. A friend of mine also experienced one that had an inmovable enemy blocking his way.   Another buggy part of the game is the way stealth mechanics work. To be honest they don't really work at all. Sometimes enemies seem to spot you when your nowhere near in sight to them and other times they don't spot you when your right in front of them. This means you have to be extra careful to try and make sure the game doesn't mess it up for you. But whats even worse is when you do get spotted. There is seemingly no way to escape them. Hiding out for a while doesn't make them loose attention for you. Every enemy in the world seems to locked to pathing towards you whether they have any kind of vision on you or not. Stealth missions really aren't fun to do because of this.   Then combat isn't much better either. Later in the game you get this device called the clicker. When you use it it creates a green orb in front of you. All enemies in this orb at the time get knocked out for a while. The problem with this is that the orb makes is so you can't see were your going. It is exceedingly bright and large so much so it covers basically all of your visiblity.  Talking about visibility you don't really have much of that throughout the world either. The game is way too dark in a lot of areas. It's so dark that at various points throughout the game I found myself having to guess where I could actually go. So therefore a lot of the time I also found myself walking off of the world accidently. The settings has no option for brightness so I couldn't fix this. The only option there is was for the detail of the shadows which seemed to make no difference.   Performance is also terrible on Albino Lullaby. I have a system that should easily be capable of playing through this game at a constant 60fps. However I barely managed to get 40fps throughout most of the game and had frequent framerate drops to unplayable levels. At one point in the game it dropped to an abismal 5fps and stayed like that. I had to change all my settings to the lowest and still only got about 20fps. It is unacceptable to have a game this poorly optimized!  Another small complaint is with the notes. When I am being chased by enemies I don't want to be having to read notes. If I do have to then I would like the game to pause for me to read it. I found myself having to rush my reading so I don't get killed by an enemy while doing it.   On top of all this issues I had other smaller bugs with clipping, getting stuck in the world, jumpiness in elevators and bad parkour mechanics. I also completed the game in probably about between 2-3 hours so it's not long of a length.   At the state this game is in at the moment I wouldn't recommend this game to anyone. The developers really need to try and fix a lot of these issues and make the game just overall more fun in general. I really think the game has a lot of potential with the setting and story drawing it forward but it's not living up to it. It may be worth picking up in a few months time after a load of patches but for now I don't think it is.    TheIronicGamers rating system       Don't ever buy this game.      Maybe consider it on a sale.    An average game.   A good game that should definitely be considered.   A must play!   Disclaimer: I was provided a free early review key by the developer to make this review.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a pretty neat idea for a horror game, sure, but the game suffers from framerate issues, buggy floors (I swear I've died at least 10 times within an hour of playing due to this) and it just overall not being scary at all while being advertised as a horror game. The game is really more focused on just trying to carefully avoid enemies, which can get kind of boring pretty quickly. I will say though that the voice acting is pretty great in this game, it fits the sort of silly vibe this game offers.   Meh/10 so far",
            "review_score": "-1"
        },
        {
            "review_text": "  Writen by me on  Fanboygaming.com   Albino Lullaby is an Adventure Horror game with an amazing art style similar to that of Alice in Wonderland. This isn’t the usual jump scare horror game you’d expect from an indie dev and there’s no gore either, The dark world inside Albino Lullaby goes for a more psychological and surreal style. I love the art style and how they tell the story. You explore a dark mysterious castle finding notes that slowly give you an idea on whats going on. If you like mystery then this is definitely your game.  If you’re looking for an intense horror game then this may get a little bland at times but if you’re looking for a adventure story telling game with eerie aspects to it then you’ll have an amazing time. It’s a lot of fun collecting notes and learn more about the strange and twisted world all while you feel as if something is following you. This is just Episode 1 so be ready to see more updates for this in the future. Oh and one more thing, it’s also VR compatible and I believe it would improve your experience 100%. Albino Lullaby: Episode 1 gets a 7/10 rating for its lovey art style and eerie world. You can get Albino Lullaby on Steam for $9.99! I hope you enjoy and have an amazing week! ",
            "review_score": "1"
        },
        {
            "review_text": "Interesting idea. But sadly I don't think it's pulled off very well.",
            "review_score": "-1"
        },
        {
            "review_text": "Horribly optimised, pretty much no gameplay to speak of (beyong pushing buttons), has a pretty cool visual style but other than that it's not scary and it runs like ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Where are all of the promised new episodes? It's been over a year now...",
            "review_score": "-1"
        },
        {
            "review_text": "Woah this game is really out there... i think i know a guy who made it. rooms transform in 1st person. im in.",
            "review_score": "1"
        }
    ]
}