{
    "app_id": 35600,
    "name": "Big Brain Wolf",
    "release_date": "2009-11-05",
    "developer": [
        "Frima"
    ],
    "publisher": [
        "Frima"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Strategy"
    ],
    "achievements": 10,
    "positive_ratings": 44,
    "negative_ratings": 37,
    "price": 3.99,
    "description": "Big Brain Wolf is a hilarious point and click adventure game for puzzle lovers. The player takes upon the role of an asthmatic vegetarian wolf studying to become a genie. In the course of his adventures the player will encounter a large cast of famous funny characters and solve sixty different puzzles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/35600/header.jpg?t=1478100887",
    "minimum_requirements": "OS: Windows XP/Vista Processor: 1.0 GHz Memory: 512 Mb Graphics: Any DirectX®: 8.0 or higher Hard Drive: 40 Mb Sound: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A point and click puzzler which tries hard but could do better. The game play is overly simplified by highlighting the clues in the conversation rather than allowing players to spot them, Many of the mini puzzles have more than one way to complete but the game will only accept one version so, unless you cheat, you may take several attempts trying to find the acceptable answer.  The 'Training Day' steam achievement is difficult to achieve whilst also going for the 'Genius' achievement as there is a limit on the number of keys you can create and if you are not using hints you cant clear your key chain. If this happens and you are a completist you can just start a new game.  Despite all the above and the poor score I would recommend this game to anyone who has had a stroke or brain injury as well as for young players as there are enough challenges to build/rebuild neural pathways.  54:100",
            "review_score": "1"
        },
        {
            "review_text": "Solid 10+ hours of entertainment! Don't miss it in a sale.",
            "review_score": "1"
        },
        {
            "review_text": "i would like to ♥♥♥♥ the main character 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A children's point and click game with bottom-barrel riddles ripped straight from professor layton. Too often I found myself unable to continue because I needed to click more than once on one specific object to progress. It tries so hard to be good but it's just   I expected relaxation and maybe fun. Instead I wound up fighting the riddle interface and simply using a guide to select the specific contrived group of pixels I needed to click on. Some riddles are straight up bull crap and don't get me started on the terribad brain training exercises.   I tried as hard as I could to enjoy it but overall I simply didn't. I did manage to laugh once or twice, but those moments weren't worth slogging through the rest of this title.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent character design and visuals but.. a strange UI, annoying voices, puzzles thrown at you for no reason, crappy story, very shallow.. likely a kids game as the target audience and might entertain them greatly, who knows! But if you're looking for point and click puzzle games with good story, pacing, characters, etc. there are better all-around titles out there.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was touted as a 'family' game, so I purchased it to play with my six year old. However, I found it not suitable for children.",
            "review_score": "-1"
        }
    ]
}