{
    "app_id": 356000,
    "name": "The Hero of Kendrickstone",
    "release_date": "2015-03-13",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Choose Your Own Adventure"
    ],
    "achievements": 30,
    "positive_ratings": 83,
    "negative_ratings": 22,
    "price": 4.79,
    "description": "As a wanna-be hero, you must rescue a city held hostage by an evil wizard, and somehow find money to pay your rent! A 240,000-word interactive novel.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356000/header.jpg?t=1538615774",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "TL;DR at the bottom of review.  I really enjoy the games produced over at Choice of Games. Choice of Robots was in fact one of my favourite games of last year. However, I can't recomend The Hero of Kendrickstone beacuse it lacks a fundamental feature of games like these:  Choice and Consenquence  It seems that no matter which path I go down I will always end up in the same spot. Do you chose to save the nobel knight or the innocent family from an onslaught of bandits? Really doesn't matter, as they will only show up again at the end of the game and nothing else will change (except you might get a bit more gold, depending on who your mentor is).   The only choice that affects your experience in any really big way is wether you're a Mage, Warrior, Rouge or Bard, and even then those only serve to lock you to a particular set of choices. In combat for example, a Warrior will never atempt to fight using magic, sneaky backstabs or talking the enemy to death. Instead, you'll have to opt for the melee option, as your character would get their ♥♥♥♥ kicked if you were to go with any other option.  For example, at the end of the game there is a choice that involves you going with a particular plan of action to stop a large threat. I was first excited for this and was curious to see the different effects it would have on the last portion of the game. But you know what the choices depended on? Whether you were Mage, Warrior, Rouge or Bard. They didn't even attempt to mask this, as the Royal Mage proposes the Mage plan, the Warrior the plan involving an all-out assault and ect. In fact, if you aren't a mage, one of the options is locked entirely away from you!   Now, the solution might seem obvious: Multiclass! Pick two main stats to focus on (each class has its own stat) and become a Battlemage, or an Assasin Bard! Sadly, however, if you try to raise two stats at the same time, you will find you are lacking in your skills and that you aren't specialised, making it harder to pull off some of the skill checks later in the game.   This same problem was experienced in Choice of The Deathless, another Choice of Game, but that game had witty writing and good humor, good characters and a world I was interested to explore. With The Hero of Kendrickstone, the character development is almost non-existent. All the characters seem to be one thing, and one thing only, with no flaws to creat deeper, more believable characters.   In the end, I canno't recomend The Hero of Kendrickstone for these very reasons. The game lacks consenquence and your choices are, ironically, seeverly limited by the one big choice in the game, not to mention that the world in which you will be making these desicions (and its inhabitants) are all flat and boring. I tried for a long time to turn my opinion around on The Hero of Kendrickstone since I really, REALLY want to see more Chose Your Own Adventure games on Steam. But alas, I can't.   The Hero of Kendrickstone is simply not worth your purchase. If you're looking for a good CYOA, have a go at Choice of Robots, Choice of The Deathless, The Hero Rise Trilogy (particulary the last two games in the trilogy) or even some of the Hosted (not directly sponsored) games on Choice of Games website. I'd strongly sugest you check out Life of a Mobster and Life of a Wizard if you want to look into the latter.   TL;DR : Restricting Choices, Lack of Consenquences, Poor World and Characters, Don't Buy  ",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't played a lot of these Choose-Your-Own-Adventure game so perhaps I just don't like the genre as a whole but I thought this game was rather punishing and inconsequent. At some point I made a seemingly wrong decision (not accept money) which seemingly damned the outcome of the rest of my choices because I could no longer keep up with the challenges the game had set out for me as it made me fail nearly every single one of them for the next half of the game.   I also found it very difficult to make choices at certain times, the game was not informative about what the possible outcome could be (or what the effect would be on my character) and later on in the story I got the feeling that it was more important to follow the underlying 'path' your type of character than it was to actually make choices based on how you'd react in such a situation.  I believe I have played some Choice Of games before and I liked them more than The Hero of Kendrickstone. I also thought it was rather short for a paid version, I spent about 2 hours on the game and I did not find the story well written. In fact, I thought it was full of plot-holes.   I might play the game again but I suspect it will be much the same, I'll just make 'better' choices based on the archtype I built at the start of the game ...",
            "review_score": "-1"
        },
        {
            "review_text": "This game had a great story! I indeed enjoyed this one, but at some points the choices were really wierd. Sometimes I couldn't really figure out what each choice does, but taht's a personal matter I guess. Another thing that I didn't really like is that if you missclick or do a choice you want to change, you have to entirely restart the game, you can't just scroll back. It makes the game more 'hard' or something i guess, but it's kinda annoying. Also I didn't find a romance/marriage option/ending in this game, maybe there is one, but I couldn't figure it out. Overally, its a really good story thou! I really enjoyed it! ^^",
            "review_score": "1"
        },
        {
            "review_text": "Summed up in the wise words of Immortan Joe: Mediocre!",
            "review_score": "-1"
        },
        {
            "review_text": "A fairly short game, it took me 2 hours to beat and I consider myself a fairly fast reader. A fun little game easily worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I thought this game is enjoyable and the concept is very clever, i like the fact taht there are different 'classes' you can choose from and the choose your own adventure genre is one that should get more praise (the walking dead has given it a it) however i found that during some parts it was a long duration of time before you actually got to make a descison. Overall though i thought it was fun and would recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "So much fun. It may not seem like it, but as good a roleplay as any - pure and without the other ♥♥♥♥ all the others come with. I'd reccomend it to anyone, and a good ambient background music playlist helps! ",
            "review_score": "1"
        },
        {
            "review_text": "I haven't read/played the whole way through yet but so far is is a great game/book! It is written very well and flows nicely. I like to read the dialogue in voices that I think fit the character which is talking. This may inspire me to try my hand at writing a choose-your-own-adventure book just for a fun little challenge. Overall, I am happy I paid the $4.99 for this book/game because it is so well written and I can picture a lot of it in my mind.",
            "review_score": "1"
        },
        {
            "review_text": "Its not as complex as I would like and quite short, but if you like CYOA games and can get this one cheap then its definitely worth a bob to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Having been a fan of Choice of Games for quite some time, it makes me happy to see them on more than just the mobile platform. Though I've only played 22 minutes into the game, if their previous works are of any proof, this game will be amazing!  I have only one qualm about this, as I'm playing on a 27' screen and the words seem a little small. If there were a button to toggle the size of it, it would be great!",
            "review_score": "1"
        },
        {
            "review_text": "This game was truly great. Even with the anxiety it caused when trying to handle money correctly. But it was fun, and I will play it over and over again!",
            "review_score": "1"
        }
    ]
}