{
    "app_id": 356270,
    "name": "Cuban Missile Crisis",
    "release_date": "2015-03-25",
    "developer": [
        "G5 Software"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Cold War"
    ],
    "achievements": 0,
    "positive_ratings": 76,
    "negative_ratings": 31,
    "price": 3.99,
    "description": "Cuban Missile Crisis is a real-time strategy game combined with a global turn-based tactical mode, thrusting gamers into a world ravaged by the military-political confrontation between the USA and USSR in 1962.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356270/header.jpg?t=1553189068",
    "minimum_requirements": "OS: Windows® XP (SP3) / Vista (SP1) / Windows® 7 Processor: 800 MHz and above Memory: 512 MB RAM Graphics: 64 Mb VRAM and more Storage: 2 GB available space Additional Notes: Game functioning on Windows® 8 and later is not guaranteed",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Cuban Missile Crisis has the makings of a great game; The Cold War goes hot during the aforementioned crisis, and suddenly the major powers are scrambling to abandon the North Hemisphere to invade the Southern Hemisphere. Built on the same engine that Blitzkrieg used, so it's got a solid pedigree there. There is both a stragetic and tactical level to the game, giving it more depth. You can order around units on the map, capture stragetic resources, etc.  The problem I have noticed is that everything dies. Slapping a wet piece of paper on your tanks might increase the survivability of your tanks. Infantry is pretty dumb, standing out in the open, and when told to entrench, they will rarely do so, yelling 'No!' or a variation. Artillery is completely useless in the hands of the player, but enemy artillery has pinpoint accurate fire, capable of counterbattery fire that makes me jealous. Missions on the tactical level are bland. These missions consist of take x, breakthrough x, or take and defend x. Scenario missions offer some variety to break up the dull missions, but it take a lot of patience in order to get any large unit capable of actually finishing the mission to the mission. While you can capture enemy equipment, this also holds true for the enemy. None of the captured equipment is intergrated into your command, and if you lose the crew to a vehicle, and are unable to recrew the vehicle before the end of a mission, it will count the vehicle as lost. The previously mentioned Blitzkrieg engine needs to be mentioned as well, because the AI for vehicles is on the one hand amusing and then completely and utterly frustrating. Tanks, APCs, trucks, and infantry will clog bridges, preventing other units from moving forward, while enemy guns will kill several of units without breaking a sweat.  Overall, Cuban Missile Crisis squanders its premise with a series of odd design choices, bland repetitive missions, and the frustration of watching carefully husbanded resources getting slaughtered as they try to cross a bridge.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me relise that I was bad at RTS'. THANKS!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.",
            "review_score": "1"
        }
    ]
}