{
    "app_id": 356370,
    "name": "Soccer Manager 2015",
    "release_date": "2015-07-16",
    "developer": [
        "Soccer Manager Ltd"
    ],
    "publisher": [
        "Soccer Manager Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Sports"
    ],
    "tags": [
        "Free to Play",
        "Sports",
        "Soccer"
    ],
    "achievements": 0,
    "positive_ratings": 367,
    "negative_ratings": 169,
    "price": 0.0,
    "description": "If you love football as much as we do, you live and breathe it. Start managing your favourite club in a matter of minutes. Play in 48 leagues from 36 countries around the world and choose from over 800 clubs. Lead living legends to victory in this fast-paced, action-packed single-player game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356370/header.jpg?t=1447370802",
    "minimum_requirements": "OS: Windows XP or Later Processor: 1 GHz or higher Memory: 1 GB RAM Network: Broadband Internet connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I was not epxecting much out of this game. But I was surprised in a good way. This game offered what I didn't think it would. But for now here is the basic pros and cons of this game:  *Positives* -free to play -licenses for all teams (unlike PES) -simple and clean UI -Very well written dialogue for the in-game commentaries -Player biography and faces add authenticity to the game  *Negatives* -there is no 2D map to watch your players play like in Football Manager -no soundtrack leaves you sort of audiably bored -a ton of microtransactions (expected from a free to play) -more customizations are necessary -no steam overlay -no achievements,mods,trading cards,etc. (will probably be added later)  Overall, the game is superb for being a free to play. But like all free to plays there are always the microtransactions which will hinder the game's experience.Updates in the future may fix the aforementioned negatives but the game offers so much and all you have to offer is nothing. If you dont pay the microtransactions its not the end of the world because you can still end up in your goal but it might take longer.Having all the licenses and player biographies/faces is quite impressive for a free to play whereas big corporations like Konami still struggle to get licenses.  So get this game and try it out. For me I will give this game a pretty solid 7.5/10. The game is great for a free to play but there are some hindering qualities that will hopefully update soon. But for now try it for yourselves!",
            "review_score": "1"
        },
        {
            "review_text": "For my full review check out it out on my video game blog   Game On!   [chrisspeerswrites.wordpress.com]     Soccer Manager vs Football Manger",
            "review_score": "1"
        },
        {
            "review_text": "**UPDATE - 24/07/2015** I want to confirm that the development team have handled my missing Save Game issue expertly and professionally and I am very grateful for their support. It was all dealt with inside a week any my lost funds/game have been restored. Good support = a really good and hard to find aspect of a game. Original review below.  In a nutshell - it's a free rip-off of Football Manager, drilled down to the essentials, and about a hundred times harder to do well which encourages you to pay for some in-game currency.  That said, the gameplay more than made up for the difficulty and considering a season of FM can take me anything up to a month to get through, to be able to get through a season in a couple of evenings in this 'FM-Lite' is a big plus. I happily laid down my £5 for in game currency to give me some breathing room to enjoy it even more.  Come on Braintree Town!",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually a bit fun and simple to learn how to play. Worth a shot.",
            "review_score": "1"
        },
        {
            "review_text": "played for an hour, pretty impressive game to be honest. Being a F2P I wasn't expecting much but I was surprised. Sure it's early days and some features are lacking but over time they will improve and right now for what it's offering the potential there is huge! Being able to buy in-game money with real money isn't a huge issue for me as it's something I won't be doing anyway but it's F2P for a reason.  ",
            "review_score": "1"
        },
        {
            "review_text": "That's game is funny :D:D:D:D I can doing a career with my fav teams Steaua Bucharest and Man Utd , + For it is like all teams and leagues from games is true isn't fake names :D:D:D",
            "review_score": "1"
        },
        {
            "review_text": "Good Idea, But when i saw that the rating were way too high, and there is no updated database, i couldnt help my OCD and uninstalled it.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "select from over 48 different leagues (bundesliga is my favorite) manage your favorite club (borussia dortmund cause ♥♥♥♥ bayern munchen) 2D match engine (better than 3D) Detailed match reports (to see how borussia dortmund destroyed TSG Hoffenheim 1899) Compete with friends (i don't have any ;( Extensive transfer system (so you can get lionel messi to your club) Manage your team to glory (in my terms, it means beating bayern munchen)  soccer manager company, please don't sue me for copying your video",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game!!! But only if they could make everyone not so overated! Just like put down the ratings down and it would be an amazing game!!  Ps: Ronaldo and Messi are 99 and some crap players are 92 93 94 lol :D!",
            "review_score": "1"
        },
        {
            "review_text": "1/10 This game is so bad that you don't need to hear the details or read a review. Just do NOT waste your time with this ****. Instead go and buy FM16'",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game  But you should not have to invite friends or get VIP to play 2D ",
            "review_score": "1"
        },
        {
            "review_text": "After a good few minutes I can give you this...  Pros- It's free. You always win. It's not an EA football game.  Cons- I can't get sound to work. It's free. You always win. It's not an EA footbal game.  Summary- Yea it's good, for a free game.",
            "review_score": "1"
        },
        {
            "review_text": "Very complicating",
            "review_score": "-1"
        },
        {
            "review_text": "really bad game almost same fm 2005 but fm 2005 was a way better  no real tactics no real movements if u looking for manager game its not for u  if u r looking for phone manager game here it is .",
            "review_score": "-1"
        },
        {
            "review_text": "Clunky and just not as good as FM. Its a micro tansaction device that tries to emulate football manager. Save your money. buy the original",
            "review_score": "-1"
        },
        {
            "review_text": "Game - nice.   Support - awful. I lost like 5 hours gaming as there was no saving on server.   Translation - same story - just awful.  Never will play their new games.",
            "review_score": "-1"
        },
        {
            "review_text": "You can have better football manager on your phone,like Top eleven.",
            "review_score": "-1"
        },
        {
            "review_text": "Hate it",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game but i think you should add an option to make your own tactic",
            "review_score": "1"
        },
        {
            "review_text": "This ia good game . but i cant ffinde the 2d Map ??",
            "review_score": "1"
        },
        {
            "review_text": "the game is nice, but has some issues and need improvement. also it has some player information wrong like on this game Danilo is on a loan from real madrid to porto, becauze if he is still in Porto it should be mine and i should be able to sell him getting good money :s  .the soccer manager worlds is really confusing tho.   pls add sound to the game ASAP and add the 2d game preview coz in no fun this way :/  i hope you improve this game coz it´s kinds awesome!",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, but it's freakin' tough!",
            "review_score": "1"
        },
        {
            "review_text": "Please stop calling it soccer an ill play more of this game",
            "review_score": "1"
        },
        {
            "review_text": "Very solid for a free soccer sim",
            "review_score": "1"
        },
        {
            "review_text": "For a free game, this is great and can be quite addicting. However, I feel that there are some issues in the gameplay that I hope will be addressed. Your team's performance seems to be very much based on momentum. I've had huge winning streaks, and then as soon as it ends, the team just goes through a long stretch where they can't seem to win against anyone. Also, the player morale system is very difficult to work around. Once a player's morale drops to 30% or below, it seems extremely difficult to get it back up, no matter what you do. It feels like a vicious cycle where the player is not happy, then the low morale impacts the player's performance, then the poor performance by the player makes his morale drop even lower. In the end the only way out seems to be to sell the low morale players and try to buy new players without impacting the morale of your other players.",
            "review_score": "1"
        },
        {
            "review_text": "Really good for a free game. I definitely recommend for those who like football manager but don't have enough money. Not as detailed as Football Manager but it's good enough",
            "review_score": "1"
        },
        {
            "review_text": "It isn't Football manager but it is very similar... Wonderful game",
            "review_score": "1"
        }
    ]
}