{
    "app_id": 356310,
    "name": "METAL SLUG DEFENSE",
    "release_date": "2015-05-01",
    "developer": [
        "SNK CORPORATION"
    ],
    "publisher": [
        "SNK CORPORATION"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "Tower Defense"
    ],
    "achievements": 64,
    "positive_ratings": 736,
    "negative_ratings": 735,
    "price": 0.0,
    "description": "“METAL SLUG”, the pinnacle of 2D action-shooting on NEOGEO returns in a brand new strategy game on Steam!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356310/header.jpg?t=1545199899",
    "minimum_requirements": "OS: Windows7 Processor: Intel Core i5 2300 and up Memory: 1 GB RAM Graphics: Intel HD Graphics Storage: 300 MB available space Additional Notes: OpenGL1.3/1.4/2.0/3.0",
    "recommended_requirements": "OS: Windows7 Processor: Intel Core i5 2300 and up Memory: 2 GB RAM Graphics: NVIDIA GeForce GT 640 Storage: 500 MB available space Additional Notes: OpenGL1.3/1.4/2.0/3.0",
    "reviews": [
        {
            "review_text": "SNK Playmore had 7 other halfway-decent Metal Slug games they could have released on Steam. Instead, they chose to release an awful PC port of a likewise-awful pay-2-win mobile phone tower defense game.  The gameplay is your standard 2D tower defense, nothing new whatsoever. Almost nothing in this game is original, for that matter; the backgrounds, the characters, even most of the music is ripped out of the previous (good) Metal Slug games. You know, the ones that didn't have $15 character DLC. The ones that actually had passionate developers who didn't care about maximizing profits by making their game into a microtransaction-friendly skinner box.  Are you a fan of mediocre tower defense games (on a platform which has no shortage of them), microtransactions, mobile-to-PC ports so lazy that the game prompts you to tap the screen, and seeing your favorite video game franchises wither to dust before your eyes? If so, then Metal Slug Defense is the perfect game for you.  If SNK Playmore is reading this, just... just release the other Metal Slug games on Steam. Who asked for this? Who WANTED this? Go look at all the Steam Forum threads filled with people saying they'd buy up 1, 2, 4, 5, etc. in an instant.  None of them mentioned this god-awful game that should have been left in the iOS peanut gallery. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a horrible mobile port and you should never touch it. Put some metal between you and it and never look at it.  The controls and the pacing are sluggish.  There's no defense of this game.  I'm glad we sortied that out.  &lt;Tap Screen to Reply&gt;",
            "review_score": "-1"
        },
        {
            "review_text": "From the looks of this, the development staff of SNK was ether drunk as hell or high as hell to create this poorly made Metal Slug themed tower defense game.  SNK should just trashed this garbage and make a new REAL Metal Slug game.",
            "review_score": "-1"
        },
        {
            "review_text": "It might be fun if they put a scrap of effort into the port and didn't have $193 of microtransactions.",
            "review_score": "-1"
        },
        {
            "review_text": "Canadian Satan is at it again.  This is a straight up rip of the 'Free' to Play mobile game. Yes, you should already hate this game because it's a mobile game. You can either pay money to play for a long time, or play on a time limit. They didn't do anything that I can tell that's different. Even on the start screen it asks you to 'Tap Screen' to start. So yeah, quit putting phone games on Steam! And Steam, quit allowing these games to ruin the store!",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is good, really nice to spend some free time, and while it can get grindy at times its not so bad for a free to play, the reason for the negative vote? They totally screwed up the steam port, Here goes the full explanation.  The steam version is totally Pay to Win! :In the android/iOS versions of the game you can purchase new units with Medals, a type of currency that you can earn through wifi matches and completing maps, but in the steam port you can only use medals to buy items (fairly useless) and MSP (the other not so valuable currency), the units are only available as DLC on steam which means no real money = no new units, not to mention that they rendered medals now useless.  The port screams LAZY: There is no real difference between playing this on an android emulator than on steam, the graphics didnt get any rework so they look pixelated even in the lowest resolution, they didn't bother changing most of the text so you can still find instructions telling you to 'tap the screen', and there are no new functions or shortcuts added to make use of your keyboard, click=tap and thats it, thats the port.  Inferior version than mobiles: The game was released in an earlier version of it compared to mobiles in every aspect except one, the units, the current steam version lacks some content and the event that is going on right now on mobiles for the game's first anniversary, while that is not much of a reason to complain as SNK will surely update it soon its clear what SNK's priority is, money. I didnt want to make an extra point for this but i must mention that you also cannot transfer the data from your mobile to steam so you have to start from scratch, without a chance to get shop units for free.  Thats it for my rant, as i said in the beggining the gameplay is really good, they gave the series a new aproach while keeping the whole Metal Slug feeling on it, and the process of gaining new units in mobiles gives the game a true feeling of progression, it just feels right, but as the game is right now on steam i cannot recommend it, if you really must give the game a try do yourself a favor and use an android emulator or play only the campaign and stay away from multiplayer in steam and hopefully SNK will soon realize their mistake and make the steam version as good and F2P as the others.  TL:DR: Lazy port, P2W, Mobile versions are much better. I swear i dont try to make text walls they just come up naturally.",
            "review_score": "-1"
        },
        {
            "review_text": "What a disapointed game... it's 100% pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is an offense to Metal Slug fans. Pretty boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Really fun game that is totally wasted by devs. Unless there is an option to buy other units with ingame currency I don't expect this game to be popular in any way. Perfect example how greedy developers are killing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "ok, this is my review.   GAMEPLAY STUFF:  - is a castle defend kind of game, stop ♥♥♥♥♥ing about it.  -the game took me 45 hours to finish in about 2 weeks. -there is not a single 'paywall' or 'paytowin' stage, you can beat every stage without a dime. -the DLC units are VERY EXPENSIVE, but aren't needed. you can S rank almost every stage anyways. - the medal system is almost worthless, you dont have enough things to spend points into.   - best option is to buy limit removals and re-try some annoying missions. - the 'mission mode' is ok... but there are no real rewards for doing it.  - you can check out the DLC units in this mode, and there is a couple of really challenging stages. - the POW system is annoying at times, but is the only reason to replay stages.  - plus unlocking stuff is the best part of this game. - the supply unit point thing is annoying...... even after you max it out,  - i want to keep playing dammit! - after you had unlocked everything, there is nothing else to do.  - archivements are underwhelming as well, all of them are from getting the pows.  MULTIPLAYER MODE:  - is very difficult to play against other players, maybe because the bad rep this game got, but the mode is worthless anyway, you will only earn a couple of medals after some stages and as i said before you wont spend them anyways.  GRAPHICS AND SOUND :  - all if not most of the assets are from the original metal slug games, and that could mean 2 things :  1- that was lazy, the 'alien stages' are the worst stages period.  2- that is awesome, because you know, metal slug has amazing sprites and sounds.   RESULT:  this game is average and had a lot of wasted potential, but is FUN and FREE anyways, even at the end i still want more, and i hope they will add more content on the future. but is not for everyone and maybe there are better castle defend games out there.  --- APPROVED --- - i dont regret losing 45hours of my life in this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game took 5 minutes of my life away, and I want them back! ..... I would have wasted them anyway, but seriously, the game is more of a celphone game, not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "MSD is a tower-defense like game where you send out units to destroy the enemys base and vice-versa. As you play the game you can upgrade stuff and grind for 'MSP' currency. In battle you generate 'AP' points which are used to summon/construct units to the field. Some units (not all) have a special attack that differs a bit from the regular attack but also is more powerfull and takes time to cool down. Rinse and repeat.  A direct port from the mobile version of the game,  So what sucks most about it? The store. Why? You cannot buy units with medals like in the mobile version.(HUGE DISSAPOINTMENT) Instead of using your Medals you need to use your real money instead to get other than vanilla units unlocked by playing the game, though you can purchase helpful items instead.  Since it's a port from the mobile you mostly need to use your mouse most of the time. Yes, you have have few button binds for like scrolling the field and speeding up time.  I HIGHLY recommend this for the mobile version. On the PC? Not worth your time. The controlls, Cheat engine and the store brakes the PC version so hard it cannot be played again ever again.",
            "review_score": "-1"
        },
        {
            "review_text": "Could have Been Cool with Aleast those Units in the Shop are Unlockable without Real Money... Whats the Fun with that? If Im suppose to wait another 60 Minutes to Play another Damn Stage...",
            "review_score": "-1"
        },
        {
            "review_text": "Miserably translated, overpriced character packs, short repetative campaign, unbalanced online play, and buggy. No way to restore lost progress if you delete the game and ever decide to redownload it, and no customer support.",
            "review_score": "-1"
        },
        {
            "review_text": "The game could be fun, but it has a lot of problems. It feels like a lazy mobile port that is locked to 4:3, the controls feel unfinished on both controller and keyboard/mouse and the game balance seems to be based around premium currency (which does not seem to be included on the Steam version, but is on mobile).   The DLC prices seem to be extremely high for a game ported to PC with such laziness as well. A poorly executed mobile port which can only be played in two 4:3 resolutions should not cost as much money as GTA V, Skyrim and Far Cry 4 combined.  If they'd re-balanced the game to be fun without microtransactions, included most of the DLC, optimised the controls/settings for PC and then charged £10 for the game, I would be rcomending it. Of course, they'd make less money if they had done that, so they didn't. Not recomended.",
            "review_score": "-1"
        },
        {
            "review_text": "Waiting to play okay??? How about I don't play.",
            "review_score": "-1"
        },
        {
            "review_text": "If this was not a pay to win game and was just a full game I would have bought it because it actually had some potential. But right around the time you get to the tombs where the mummies are it just gets insanely stupidly hard. Sad because it's fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I honestly dont know why everyone hates this game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! I love it! It's a poor imitation of the real 'Metal Slug', true, but it's still a very nice game and I loved it! The one reason that makes this game pay-to-win is the 'vs mode' because if you haven't bought any of the DLC or at least the most powerful one, there is no way you can win a battle in the 'vs mode'. But that doesn't ruin the game... at least not for me. Find a few friends and play with them on 'vs mode' if you REALLY want to play versus people that bad. But if you don't want to play this game with anyone, then just stick to everything except the 'vs mode' you'll get REKT in less than 10 seconds. :D Overall my personal rating for this game would be 8/10, because of the pay-to-win-unless-you-have-friends 'vs mode'. Enjoy the game! It's quite entertaining. :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun as hek! I realy recomend for people who like army building with awesome music,the bad thing is that the units die too quickly :/ i have nothing else to say butt please get the packs!They have flippin alien that are sucky as heck and awesome mummies that are slow and sucky :3 Have good day killing things,Rebels &gt;:D",
            "review_score": "1"
        },
        {
            "review_text": "Never buy any DLC from this game until they have updates.. I do love Metal Slug come on SNK they is a phone version for this game why did you release on steam? This version is worst than a phone version.. Come on SNK please give a update to make this game successful",
            "review_score": "-1"
        },
        {
            "review_text": "fun for about 30 minutes-then it gets tedious",
            "review_score": "-1"
        },
        {
            "review_text": "Worse than diarrhea donkey ♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I love the Metal Slug series, but when I play this game, 'WHAT HAVE YOU IDIOTS DONE?!?!?' These levels are really... really... dificult! Some people even need to use cheats just to beat the levels! NOT WORTH IT!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "the game is good but why only revive metal slug why not revive THE KING OF MONSTERS or WAKU WAKU 7",
            "review_score": "1"
        },
        {
            "review_text": "This is must be recommended for 2D game lovers.  2D NEVER DIE.",
            "review_score": "1"
        },
        {
            "review_text": "I'll give you the benefit of doubt on this one and suggest you to play at least for a moment.  If you're ok with what you see, i pity you and me for spending more than a second on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Show SNK that you'd rather have a new action-filled metal slug by ignoring this crappy tower defense spin-off and getting one of the main series games available here on steam.  edited to complete sentence and fix typo",
            "review_score": "-1"
        },
        {
            "review_text": "this game just suck",
            "review_score": "-1"
        },
        {
            "review_text": "I like the gameplay and art style of METAL SLUG DEFENSE.  Unlike most of the negative reviews: Most of the game is possible without spending money (or buy premium units). Look at my achievements (44 / 64).   You get many units for free. And most of the time the game is fair - and if not, you get free medals so often ... and with this you can buy special power to solve a mission.",
            "review_score": "1"
        },
        {
            "review_text": "not that graphic  average game",
            "review_score": "1"
        },
        {
            "review_text": "just play it. did not buy units pack.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, for mobile devices.  I love the Metal Slug franchise and i am willing to support this, simply because i have it on my mobile device and want to see what they can come up with for the PC version. Personally i think there should be keys that let you send out a unit instead of scrolling your bar. All the setting are for a mobile device i feel like it was a copy/paste situation. Example: when Resident Evil 6 came out the graphics where out of it and it was acting super buggy because they did something similar, it wasn't prepared for PC so it was off. The issue i had was this was not the idea but how much work was put into making it a PC version. But i would recommend people to try it for themselves and help further the comfortability factor.",
            "review_score": "1"
        },
        {
            "review_text": "I love it even though I can play it on my phone more easy...",
            "review_score": "1"
        },
        {
            "review_text": "This game is a tough sell, but barely makes my yes vote since it is free. I'm a sucker for casual facebook games that hook you in and then try to sucker you to buy energy later. With a game like this, you only need to pour in 5-10 minutes at a time and get some enjoyment out of it. Your energy replenishes pretty quickly, I think it's like 1 energy per minute. At later levels your energy goes quick, but as long as you have a good plan and can effectively use your free units, you should be fine to play this game without dumping your cash in.",
            "review_score": "1"
        },
        {
            "review_text": "this the best noob game ever",
            "review_score": "1"
        },
        {
            "review_text": "why i cant get anny pow from after mission 6? ",
            "review_score": "1"
        },
        {
            "review_text": "wow been playin Metal Slug since arcade days when art of fighting kof machines were empty, and i never ever thought i would play metal slug with kof characters, and chin gentsai now in the game made me buy the kof pack before entering the game on the steam version, what can i say, you diserve my comment and my wallet for this one, the new kof chess!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game~ If DLC can 75% OFF I think will be better~",
            "review_score": "1"
        },
        {
            "review_text": "Not bad at all! and It's free! in-game purchases arent really pushed on the player either.  Levels are designed for replayability and are structured to give a challenge based on which enemies you're going up against, and which characters you're limited to.  Upgrading your base and your infantry really gives you a feeling of how stronger your army grows.  And to top it all off, it's METAL SLUG! One of the greatest series of pixel art fireball-punches us with a free tower-defense-styled game. I'll take it!",
            "review_score": "1"
        },
        {
            "review_text": "In all honesty, I actually quite like the core game of Metal Slug Defense. It's an interesting take on tower defense that repurposes old sprites into a different genre. It's a nostalgia trip and a delightfully funny action romp that could eat your time away.  If only this PC version wasn't so fixated on destroying your wallet, I'd recommend it to everyone. As it stands, one cannot progress past a certain part of the campaign without either getting lucky, spending an exorbitant amount of time in the multiplayer or paying for better units.  While the campaign is a no thrills trek through every arena, what I truly enjoy is the Mission Mode. That allows you to play with all the units from the game in quick, challenge based objectives. It can be a bit unfair at times (which falls in line with the Pay-To-Win mentality of the game), but it is quite fun.  What isn't fun is making progress through the map and hitting a brick wall. The game cleverly masks this by claiming certain levels are 'Hard', but that is a bunch of malarkey. What SNK Playmore has done is just boosted the players ego until they eventually hit one of the 'Hell' levels.  In these scenarios, the enemy already has units out at the start and charges forth with units you cannot possibly obtain yet. It makes for frustrating, soul crushing defeats that leave you wondering what you're doing with your life. A game shouldn't make me question my own mortality.  I could maybe get on board if there were a buy all pack for $10, but SNK saw it fit to sell you 12 characters for $30. That isn't even every piece of DLC available, either. Couple that with the way you're trickle fed medals, which act as currency for power-ups, and you might as well not bother.  Nothing about the pricing structure in Metal Slug Defense is redeemable. To make matters worse, the multiplayer doesn't even work well. If you wanted to grind out medals online, you might be waiting upwards of 20 minutes to find a match. I've got much better things to do than stare at an alien twirling a ray gun.  2/10",
            "review_score": "-1"
        },
        {
            "review_text": "PAY TO WIN !!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible, didn't even ATTEMPT to hide their overpriced pay to win strategy.",
            "review_score": "-1"
        },
        {
            "review_text": "Cant play with friendz ?",
            "review_score": "-1"
        },
        {
            "review_text": "Brings back old memories of going to the arcade.",
            "review_score": "1"
        },
        {
            "review_text": "Now i just regret downloading the game I thought it was also like in the phone but you actually need to waste money yes or yes... i just say i dont recommended is P2W (pay to win for new users looking at this)",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I've seen Metal Slug before when I was little. How it grew as an arcade makes it hard to grow in today's industry of consoles. Nonetheless, all companies can find a way around this console curve to make it fit well in a PC game or console. This feels like a spin off or like somebody made a flash game. While it IS indeed playable, it's just a game of grinding MSP (The currency in the game) and using it on computers that give less than a decent challenge.  Good thing there's multiplayer, right? Wrong. The multiplayer is obviously 'Pay to win'. On my first search for a fight, I was fighting a guy with helicopters bought from the dlc pack probably. Not only that, but everything I threw at the helicopters proved useless as it FLEW over all of my units and killed them FROM ABOVE. These are not advanced players. These are players who are literally just so bored of this game that they are willing to pay to make it fun. This game is unbalanced in multiplayer unless you are willing to give real money. So forget that tag that says 'Free to play' because that's only for an easy fight on computers with a grinding system of MSP while getting overthrown by your fellow competitors who actually paid.  SNK, you made Metal Slug really hard to beat without dying, but it was never impossible. You just made it FEEL impossible, which is fine because you still proved that you can beat the game with just one quarter.  BUT, for this game here, it is simply just not okay. Even if it WASN'T about Metal Slug, I would still complain about the huge difference of powers between players. You should've thought more about the balancing of powerful units in the PVP. I'm quite ashamed of you, especially since I don't hear much of Metal Slug anymore. Leaving this as your mark for your games would be disgraceful. Leaving this as your last mark for Metal Slug means you are ready to let it die.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is for people who like side scrolling castle attacker. But personally I think that this game could have been you choice.",
            "review_score": "1"
        },
        {
            "review_text": "Honstly, this game is already pretty terrible on Android and the only reason why I'm still playing it is because I'm a SNK fanboy. I'd say for me, as someone who is a huge ♥♥♥♥ing Metal Slug fan, the original mobile version is an 'Okay' game, mostly because of all the fanservice. The Basic gameplay is somewhat comparable to a tower defense game I guess. You build decks with different units which all have their own stats, like the basic stuff( attack, defense, whatever) and things like their cost in AP Points. Those points are required for doing anything in the actual fights. They rise over time, and can be used to (like I already mentioned) 'buy' or 'activate' units. You can also use them to upgrade your Maximum AP for one battle. And thats all. You literally dont do ♥♥♥♥ other than tap/click on icons to buy/activate units and upgrade your AP. I guess there is a somewhat minimal amount of mico-management required, sadly, never enough to establish any kind of depth.  How they managed to ♥♥♥♥ up the Steam version even further is beyond me. In the Android or iOS versions, you could buy new units (the ones you use for building decks) with medals, which are a daily reward for turning the game on. To make it short: Pretty much most of the normal units (besides the special KoF characters, which cost actual money), are completely free.  In this version however, you can only buy them in packs. Units, that are normally free. For actual money.  And you cant even choose them individually. Meaning: If you just wanna have 1 unit of a special pack, you have to buy the whole ♥♥♥♥ing thing, meaning you wasted like 4 Euros/Dollars on Units you are likely never gonna use. I dont think I need to explain why this version is even ♥♥♥♥♥ier than it's mobile counterparts.  If you like amazing pixel art or if you just like Metal Slug, I'd say get the mobile versions. Besides that, it's the same game just for PC. Why you would want to play this on PC instead of an tablet or phone is also a good question. I dont see any benefit from playing this on PC. If you're just looking for some time waster or whatever, start looking for something else because this is not what your looking for. Get it for your phone. At least its mostly free on there. Also portable.",
            "review_score": "-1"
        },
        {
            "review_text": "Unlike the App this game is purely Pay to Win",
            "review_score": "-1"
        }
    ]
}