{
    "app_id": 356420,
    "name": "Interloper",
    "release_date": "2015-05-21",
    "developer": [
        "Monogon Games"
    ],
    "publisher": [
        "Monogon Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "RTS"
    ],
    "achievements": 20,
    "positive_ratings": 284,
    "negative_ratings": 44,
    "price": 0.0,
    "description": "Interloper is an online multiplayer real-time strategy game with matches that take only 5 minutes. Instead of destroying your opponent, you win by claiming domain. By predicting your opponent's movements, you corner them to claim the entire map.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356420/header.jpg?t=1527556815",
    "minimum_requirements": "Minimalne: System operacyjny: Windows XP Procesor: 1GHz Pamięć: 1 GB RAM Karta graficzna: Support Shader Model 3.0 DirectX: Wersja 10 Sieć: Szerokopasmowe połączenie internetowe Miejsce na dysku: 300 MB dostępnej przestrzeni Karta dźwiękowa: DirectX 10 compatible Dodatkowe uwagi: Uses XNA HiDef",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Really cool game but nobody playing multiplayer. If you can play local or are happy vs AI then this game is very entertaining. If you want to go toe to toe with strangers on the internet look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "I'll make it simple: if you like strategy games buy it. I was looking for an alternative to starcraft 2 and i finally found it. There are simple rules which are easy to understand and to learn but hard to master.  The only bad thing is maybe that there are just a few people online to play against. But i'm sure more people will come because the game is really good.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible. I'm blown away by the depth this game's simple mechanics provide. An absolutely beautiful RTS game that will appeal to anyone, absolutely anyone. A perfect blend of strategy and tactical gameplay which is fun and engaging from start to finish of every single match. Each and every unit and mechanic is precious and can create such value for you if used correctly. 10/10 would recommend to anyone. I haven't played anything like this before...Such an affordable game for the experience it provides. WOW.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, it's basically a mix of chess and an RTS.   I finished the campaign and played every map in skirmish in little over 2 hours, but beware.. NO AI can prepare you for the mindgames in multiplayer.  I've only played 3 multiplayer games so far and they're pretty brutal. (same goes for the expert AI) If you make a mistake you WILL pay for it.  #1 advice for this game: JUST DON'T MAKE A MISTAKE!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, Its a polished game, but I'd like to see a few new features. They are actively working on the game though, so I'm hopeful. Team play would be a huge bonus to the game and would add more complex strategies, but the overall feel is great.",
            "review_score": "1"
        },
        {
            "review_text": "The developers are awesome and even made an extra build for me so I can play it on my old PC.   As you would expect, my IBM 1984 wooden Personal Computer can't handle the game anyway, so unfortunately I can't do a proper review on this game.   But very dedicated and friendly developers, that's for sure:)",
            "review_score": "1"
        },
        {
            "review_text": "For its small price it's a good enough game. It's a pretty simple RTS with just 4 types of units. The graphics look good, the sound and the music are ok, too. You color tiles of the field by moving around your main unit, and capture buildings which produce new units, upgrade those units to 3 other types (sniper, guard and melee fighter). The game tends to get somewhat chaotic, as units may take unexpected paths (e.g. if a one-way gate is in their way, which may not be immediately visible) or travel to locations where they will die simply because you forget to update rally points for the building which creates new units. The game is pretty hectic, and actually reminded me Herzog Zwei (it was the first ever RTS game, released on Sega Megadrive a year or so before Dune 2). The campaign is pretty short, just 18 missions which I completed in a bit over half an hour. Only the last mission was difficult and required a retry because the enemy starts with a few control points already. Skirmishes are relatively easy, even with AI set on 'expert'. Other than that, there is multiplayer, and since it's an indie game and it surely doesn't have millions of active players, there is no one online to play against. You may try playing skirmish and give AI some advantages like faster movement speed or extra units and so on. Again, for a $1.5 or something I got it on sale, it's fair to play it for an hour and basically see everything it has to offer. Somehow it reminds me games on iOS or Android, e.g those where there are bases constantly growing small dots and you send half of those dots against enemy bases. It's a bit more complex though. If you're bored and want some interesting but short experience, grab this little RTS for sure. I'll surely keep on my PC for rainy evenings.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is tedious, I have yet to play a match under 8 minutes, and the linux support is non-existent. It just runs it in WINE. And no, it didn't work for me. I have no choice but to play in Windows.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would have children with this game. FYI: Beta tester here &lt;3&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "looks nice and clean, plays nice and clean.",
            "review_score": "1"
        },
        {
            "review_text": "So sad that this game is so unknown... It´s freaking great. I am glad i found it, it attracted me as something I haven´t seen anything like it before.  I really like this nearly violence-free-strategy game, as the concept is really interesting. Unlike many other games I played, this has a logical and well-made single-player campaign. At first this game is somewhat hard to understand, but thanks to the tutorial you can easily get started. The translations are nearly without mistakes, also a thing I miss in some other games. Interloper is pretty hard, I even have had some trouble winning against 'Practice-AI'. Annother positive aspect are the graphics, which are neater than I thought, yeah, this looks pretty good actually. Especially the 'Color-blindness settings' give that game it´s individual look. Regretting that I did not get the two-pack, (as I had originally planned,) I can only enjoy the singleplayer mode, which can quickly take you a few hours to complete.   If this game is on Sale and if you have a friend to play it with, get it. But before getting upset because of the inactive community, finish singleplayer mode. Super unique, very challenging, potentially hours of playtime: That´s what Interloper means to me.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game but multiplayer is pretty dead :/",
            "review_score": "-1"
        },
        {
            "review_text": "It's the hectic fast paced rts style of starcraft distilled into less than 5 minutes of gameplay.",
            "review_score": "1"
        }
    ]
}