{
    "app_id": 356430,
    "name": "Chris Sawyer's Locomotion™",
    "release_date": "2015-03-17",
    "developer": [
        "Chris Sawyer"
    ],
    "publisher": [
        "Atari"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Trains"
    ],
    "achievements": 0,
    "positive_ratings": 195,
    "negative_ratings": 56,
    "price": 4.79,
    "description": "Explore a vast and detailed world and build a Transportation Empire!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356430/header.jpg?t=1447370817",
    "minimum_requirements": "OS: Windows XP or Windows Vista Processor: 1.8 GHz Processor Memory: 512 MB RAM Graphics: 3D graphics card compatible with DirectX 7 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Uttermost Brilliance, Chris Sawyer's rules of property management collide with that of a transport tycoon. A much-awaited return of a wonderful 'Sequel' To Transport Tycoon; now delivered to the Steam Community. This, without a doubt, is a personal favorite of mine, the sense of real-world management is within the gameplay.  [Including] -Multiple Variations of Nationalities, including transportation styles according to Era. -Real-World Management, including establishment of revenue and area of operations. -A challenging business: Disasters [Crashes], rivals, industries, and your decisions play a huge impact on the liabilites and credibility your company possesses. -The Ability to Create a Transportation Industry, 'nuff said. -Train Horns, I adore trains.  All In All, I reccomend this game to those who are accquainted with Chris Sawyer's works, including Roller-Coaster Tycoon, or to those who simply wish to run a company and feel challenged by the world around them. 10/10-PSCTD",
            "review_score": "1"
        },
        {
            "review_text": "I played this game back when it was first released, but as a kid I couldn't really appreciate it in its entirety. A lot of work went into this game, and it shows, despite the obvious graphical inferiority of it. The attention to detail and creativity is borderline amazing. For anyone who likes business management/tycoon-like games, this is definitely worth looking at.   Pros: -Different types of transportation -Scenario Editor, so you can create your own maps and landscapes -Watching as the business you bring to a town/city causes its rapid growth -Music is very unique -Precursor to OpenTTD -Old/Retro feel -Great De-stresser  Cons: -Graphics are pretty bad -layout can be annoying at times -Not really sure if multiplayer works, but I had to activate DirectPlay in order to even set myself as a host. It may be restricted to LAN, but I haven't tried playing a game because my friends aren't exactly keen on the whole management thing. If you need help activating DirectPlay on windows 8/10, feel free to add me. -Music can get repetetive -AI are super duper annoyingly good  All in all, I'd give this game a thumbs up. I haven't had any issues with it crashing, except for when I Alt+tab, so make sure that you save before tabbing out.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game.. I grew up playing transport tycoon (back when ms-dos was mainstream and win 3.1) then transport tycoon deluxe on win95, so when I saw this one on steam I had to buy it.   Definitely highly recommended to players who know the original tt/ttd series and new players alike.   To me the full price was worth it but if your not sure wait until it's on sale and grab it!   20/10 for me. 😉",
            "review_score": "1"
        },
        {
            "review_text": "Used to spend so much time on this as a kid. Would suggest OpenTTD over this though, not because this is a bad game, but OpenTTD is better in everyway.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, and I have been playing for closer to 10 years, but I would warn anyone that hasn't played it before from buying it without doing some research into it.",
            "review_score": "1"
        },
        {
            "review_text": "A port of Transport Tycoon Deluxe for Steam/Windows. Faithful to the original, with a few items removed. If you don't want to bother with OpenTTD, or running a dosbox for the original, than this is for you. Sometimes the colors can go crazy depending when you enter the options menu, but that is easily fixed by restarting (which takes no time at all).",
            "review_score": "1"
        },
        {
            "review_text": "I remember many hours of just building an empire, then my PC got hardware updates to many times and the Atari store 'limmited pc license' ran up. Now I can play it again and be building another empire.  20/10 Another empire must be built.",
            "review_score": "1"
        },
        {
            "review_text": "cant play",
            "review_score": "-1"
        },
        {
            "review_text": "Not overly impressed. This isn't a bad game but maybe because Transport Tycoon was so good, all that follows and tries to further the genre fails.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played many hours on the disc version of this great game, only to be ended with my little brother, a baby at the time getting a hold of the disc and breaking it in half.  The steam version is actually less buggy then my original copy and is just as fun. For those who have never played it. Locomotion is in my opinion one of the best sandbox games out there,   10/10",
            "review_score": "1"
        },
        {
            "review_text": "My childhood is still as awesome as I remember it. This is a good game.       NOW IF ONLY THE CAR WOULD ACTUALLY TAKE IRON FROM THE PLANT THAT SON OF A TRUCK    This game does have noticeable ammounts of RCT in it. And surprise suprise, its made by the same guy. Maybe thats why I love it so much. But it is a bit more complex than RCT so you'd better learn how to play.   9/10 Too much awesomeness.",
            "review_score": "1"
        },
        {
            "review_text": "This is amazing game, ive played it before but now it wont work on my steam, i lost the disc. Steam has been no help in getting the game running for me! (steam support is ♥♥♥♥) if this game will work for you it is an amazing game i would reccomend to all people",
            "review_score": "1"
        }
    ]
}