{
    "app_id": 356400,
    "name": "Thumper",
    "release_date": "2016-10-10",
    "developer": [
        "Drool"
    ],
    "publisher": [
        "Drool"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Rhythm",
        "Indie",
        "Action"
    ],
    "achievements": 19,
    "positive_ratings": 1950,
    "negative_ratings": 166,
    "price": 15.99,
    "description": "Thumper is rhythm violence: classic rhythm-action, blistering speed, and brutal physicality. You are a space beetle. Brave the hellish void and confront a maniacal giant head from the future.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356400/header.jpg?t=1543412957",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7/8/10 (64-bit) Processor: Intel Core i3 Memory: 4 GB RAM Graphics: nVidia GTX 480 / AMD Radeon 7870 DirectX: Version 9.0c Storage: 1400 MB available space Sound Card: DirectX compatible",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 7/8/10 (64-bit) Processor: Intel i5-6400 (required for VR) Memory: 8 GB RAM Graphics: nVidia GTX 970 / AMD R9 290 (required for VR) DirectX: Version 11 Storage: 1400 MB available space Sound Card: DirectX compatible Additional Notes: 8 GB RAM and DirectX 11 required for VR mode.",
    "reviews": [
        {
            "review_text": "This is one of the most intense [non-osu] rhythm games I've played since Rhythm Heaven (EDIT: I haven't played any BEMANI games, so take that part with a grain of salt if you have played them. Regardless, this game does have its intensity). It's got simple controls, but it ramps up the difficulty very quickly. And holy crap, it is really fun.   The music is nice, but if it wasn't for the level design, it would sound a bit samey to some. I still like it.  Some may find the price point a little high (especially with 9 levels; though you'll be dying a lot), but if you're a nerd for polish and rhythm games (like me) or if you love competing for the best score, then it's worth the full price.   If you're not sure if you want to commit $20 to an intense rhythm action game, then I'd definitely say that you should wait for a sale.   Also hey, it has native DS4 support, but most of you shouldn't care.",
            "review_score": "1"
        },
        {
            "review_text": "The Dark Souls of space beetle abstract music games.",
            "review_score": "1"
        },
        {
            "review_text": "I have been excited about the potential of this game since I heard about it a long time ago, and for the most part, it doesn't dissapoint.  The game design is well done. Simple controls that are complex to master. Visuals that are...interesting in a good way. A different style of music. Overall, it's a solid game - and don't let the 9 levels distract you, there's a lot of game in each level.  My only gripe is so far (I am through level 4) all the song sound the same. They are slight variations, but mostly they sound the same. Which could start to wear thin towards the end of the game. I applaud the use of a darker, industrial soundtrack, but there is variety in that theme. Maybe it iscoming later and I will update if it does. The other gripe is the last boss in each world (again only halfway through 3) is the same face, maybe slightly different. Be nice if it changed for each level.",
            "review_score": "1"
        },
        {
            "review_text": "Lets start by saying the obvious. This game is BEAUTIFUL. Visuals are trippy and the gameplay compliments it.  The music is also awesome. Minor complaint is that the game stops being a rythm game and more a reaction/memorization game from around mid of level 3, and then becomes a rythm game again at level 8, so basically at the end of the game. Other than that this game is a great play and I've enjoyed it greatly. Worth it IMO",
            "review_score": "1"
        },
        {
            "review_text": "Thumper is a very demanding game. It's a test of timing and patience. Despite the steep difficulty curve in the latter half of the game, nothing about the challenges was truly 'unfair,' not even the laser rings which penalize (and damage) you for missing beats. Suddenly requiring perfection during a sequence may seem a bit extreme at first, but if anything, it's encouraging you to do your best. During tough sequences and boss fights, I saw and knew what it was that I had to do--I simply had to do it right, even if it meant dying multiple times. Trial-and-error became commonplace for me after a while, but it was never as though the game was throwing something impossible at me. Taking damage and dying can ruin the flow of the game, but again, that's just another reason to try harder.  One criticism--the closest thing to a negative--would be that, even though the game's visuals are slick, stylish, and great to look at, sometimes there CAN be too many visual effects happening on-screen to be able to focus on what's coming ahead. One or two bosses are practically exploding with color and bloom lighting, sometimes obscuring a fair amount of the oncoming track. It's tough to anticipate the red bars indicating turns when the boss is flashing red, as well.  The layout of obstacles in these levels will always be the same (meaning replay value will REALLY vary from person to person), so you won't see any sudden variation when revisiting them, but at least you'll have some familiarity when coming back to them to go for higher ranks and scores.  Most importantly, quality headphones or a home theater system are a must, not just for the sake of enjoying the music, but also for being able to clearly hear the backing instrumentation and sound cues indicating upcoming obstacles, so you'll be ready to take them on.",
            "review_score": "1"
        },
        {
            "review_text": "I've never been a fan of rhythm games like Rock Band or Guitar Hero. Although I like music focused games, I don't think just putting a rhythm spreadsheed over existing written music can make an extraordinarily well designed game. And now here's Thumper, a game that looks, on the surface, a lot like Audiosurf, but at its core, it's something much, much different.  You're a beetle, riding down a lane with an ever increasing speed, having to dodge obstacles and trying to get combos by performing rhythmically accurate actions. It's so simple and yet so difficult. The difference to Audiosurf lies in the design of and the interplay between music and the levels. Everything is produced with the gameplay experience in mind. Levels build up on each other. Simply the fact that the time signature increases one beat per level shows how the developers intended to get a pacing into the game that could never be there with generative levels.  While I do think, Thumper hasn't realized its full potential and some improvements could have been included, I must say that I had tons of fun and even more tons of frustration just barely making it through the 9 levels alive. To me, this game is probably the best music game I have played since 140.  Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "If you're not used to rhythm game, you can still play it but say goodbye to scoring. Actually, the game runs and plays great, there are so much tricks to surpass if you want the best possible score on a level.  There are checkpoints every 15/30 seconds, meaning you don't have to restart at the beginning of a level. And man... This is HARD. You'll have to keep the pace with rhythm, but there are so many stroboscopic effects (and BEAUTIFUL ones) which are trying to distract you. This is a game that asks you to play in a room, lonely, with a maximum focus. It will surely break your nerves as you progress through the game, but damn, it's satisfying as hell.   Edit : Also, the game's atmosphere is stressful, I mean, a lot. Exit happy music when you're tapping on rhythm, this is the kind of music that plays when you're playing for your life. Litterally. Everything is hostile in this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is another existance.  Something so simple with beutiful visuals and awesome music that the gameplay plays along with. You cannot go against it!",
            "review_score": "1"
        },
        {
            "review_text": "Thumper, while having absolutely no story, has simple, but extremely challenging gameplay. It's punishing when you don't follw its beat, but it is merciful if you can't get every point, and even then, you would have this really odd sensation to come back and perfect what you've missed. The psychedelic visuals of polygonal tunnels amidst a sky that resembles the Aurora Borealis, powerful time signatures with high-speed tempo, and bosses with complex rhythmic segments will make you question your sanity and sense of rhythm, but the satisfaction from defeating those bosses, getting every rhythm down, and overcoming obstacles you thought was otherwise impossible will assuredly keep you coming back for more. To those hungry for a challenge of reflex, rhythm and memory, you've come to the right place.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing rhythm game that at first seems remarkably simple. The graphics are hypnotic and it has a great soundtrack. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I can't feel my thumbs Help    It was totally worth the money though",
            "review_score": "1"
        },
        {
            "review_text": "*I'm currently halfway through the campaign, if I feel any elemet of my review no longer holds true by the end, I'll revise it.*  Thumper embodies viscerality. 'Rhythm Violence' is a term so appropriate, you'd think they concieved it first and then designed the game. Each beat leaves you wondering if you're being punched in the gut or dealing said blow. The soundtrack instills a sense of imminent doom, as if you're fleeing from a serial killer... until you realize   you're   the theat.   Gameplay operates much in the same manner as Rhythm Heaven, with each note type having a cue that precedes your input by a measure. The result is that by a few levels in, you're forced to be looking at and listening for the note's you'll be playing moments in the future as you input the controls for those you observed moments ago. This means you can't play the game simply by watching the highway like you might Rock Band, you must achieve a flow state much in the vein of Hotline Miami or Super Hexagon.   With visuals that look like Tool album art rendered in the world of Tron, and music that combines thundrous tribal drums and hints of industrial and dubstep, the presentation is top-notch, though don't mistake it for style over substance: every element of the appearance and sound of the game feeds back in to the exhilerating, rewarding gameplay. Literally the only complaints I can muster are that the menus are a tad sluggish, and the effect when you take damage is slightly too obtrusive. Anyonethat considers themself a rhythm game fan owes it to themself to play this.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, really fun and satisfying!",
            "review_score": "1"
        },
        {
            "review_text": "(More details on scoring and leaderboard at the end)  This is bloody brilliant.  It's one of the few games that I can see most people enjoying based on the gameplay alone, yet still manages to introduce something very alien and unique through its art (both in its audio and visuals).  The shortest description I can give is that it's something out of 2001: Space Odyssey? The weird part. The really, really crazy part.  And it's beautiful.   The game can get tough, but it never seemed unfair, to me. I really enjoyed the challenge and now I'm planning to go through it all over again several time to master it... why? Because the flow of the game is amazing. It's a rollercoaster, in many ways... But it's hard to judge it when you have to restart some levels repeatedly. I'm curious about how it would feel to go through it in one single run. ... It might take a while, though.   The music is very interesting, and probably not something for your mp3. Brian Gibson has a 'noise rock' band, which is... noisy? The game itself is what I would call 'noise classical', perhaps? Know the discordant violins in horror movies? That's a big of part of this. The other part is the industrial/metallic tribal percussion. It's strange, but it's perfect for the game.  The visuals are also very abstract and metallic, but very beautiful, in parts. Something harmonious, sometimes discordant as well. And always very alien.  The 'feel' of the game is some of the best I've seen in any game... ever? It's that good. If you string combos together, your hits become very powerful, complementing the strange rhythm of the music with the rhythm of the level, which are not always 'cooperative'.   I can't say much more about it, for now. But it's amazing! If you're looking for a rhythm game in the vein of Guitar Hero or Stepmania, this is not at all for you. It's not about playing your own music... This game is its own beast. If you're not into its aesthetic (which I can imagine many people are not?), you will probably not enjoy the game very much... some people consider it all to blend together. I disagree, but I can see that happening, depending on what you're expecting.   So yeah. If the videos seem cool, definitely get it. There's a lot more to the game than shown in the videos due to the visceral feeling and impact of the game.  So good!    P.S.: I've now beaten the game twice, to see how much it would change. On general terms, there's definitely replayability without wanting to climb the leaderboards. This is because you can still play the previous levels in a very different way by using the new mechanics that you didn't know when you first did the levels. This can make some levels far, far, harder. But also much more satisfying! It's really cool to see how levels were designed in different ways depending on how much of the game you've played before.  The scoring system is also more complex than it first seemed.  There's a basic C-B-A-S 'rank' for each sub-level, and then calculated for the full level. These mostly depend on your misses. S being for missing no 'Thump'. You can't replay specific levels, at the moment, but you can restart the sub-level that you're playing. This means that you have to play the whole level from start to finish to get these rankings, but you can restart each one as much as you'd like before moving on.  The scoring, which will get you on the leaderboards, is where the real game is. For these, restarting carries a penalty. So, to reach the top, you need to play every sub-level in a row, as well as you can, without restarting to get the optimal score for each one. It's a marathon, more so than a sprint.  I can see this being a somewhat controversial system, but I like it. It's the hardcore way to play the game, and I'm glad that there is one, rather than seeing how restarts the most.  For the score, you have to study the levels, somewhat, because of the 'stomp' mechanic. On 2 consecutives Thumps, you can use the first to fly, and stomp the second for extra points. This is even more important in boss fights, where you're awarded multipliers for stomping the final thump (sorry for this vocabulary haha).  Aside from that, there are the riskier plays of trying to make a perfect curve, etc. (to get a perfect, you have a much narrower window to turn -- otherwise, you're dead).  It makes it much more interesting, choosing when to play aggressively or not, trying to get a good score.    There's quite a bit of depth for those looking to climb leaderboards, so that's definitely another plus!   P.S.2: Consistency is way more important than I realized before. Each consecutive level you beat without a Miss gives up a 1+ multiplier. The same for No Damage levels. So your score really gets out of control if you can avoid missing/damage for many consecutive levels. It's good to keep the competition high!  One kinda big problem I have, though, has to do with the 'game feel'. I really like the whole impact the game conveys, but I think it takes a step too far by slowing down the game too much for give a very high impact in a long combo. This slow down actually throws me off completely, sometimes, because the rhythm breaks in these situations. So... you're expecting a certain obstacle at a certain time, but the tempo slows down a lot and then speeds up again.  It leads to a rather inconsistent rhythm when you're actually doing great! Which is a negative. Sure, it makes it harder to do perfect runs, but it essentially punishes good play? I would much rather have a lower impact in these long combos, but be able to keep the 'flow', so to speak.",
            "review_score": "1"
        },
        {
            "review_text": "Frustration. That's what I feel the most when I play the later levels of Thumper. Missing a turn I previously got on another attempt, reset. Miss a thump, reset. In ways, the game feels like something I would have given up on ages ago.  And yet, it keeps drawing me back.  Maybe it's the crazy soundtrack that assaults your ears, maybe it's the visuals, maybe it's the fact that this game manages to capture the feeling of satisfaction so well. Whatever it is, I'm glad Thumper has managed to work its magic.",
            "review_score": "1"
        },
        {
            "review_text": "games like this are incredibly rare. The presentation is amazing and unique, beautiful and terrifying. One of the most satisfying games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Thumper is a wonderful experience and an example of what a game with simple, tight controls and good visuals/soundtrack can do. Get ready to stop blinking.",
            "review_score": "1"
        },
        {
            "review_text": "After the very first stage I knew this was the most unique and enveloping rhythm game ive ever played. After beating the first level group I imeadiatly started over to get a perfect score, because getting S rank in this game is the most statifying thing ever. This game is killer.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for VR/Rhythm lovers.",
            "review_score": "1"
        },
        {
            "review_text": "this is a good video game, in my, opinion",
            "review_score": "1"
        },
        {
            "review_text": "this is the best thing released in 2016.",
            "review_score": "1"
        },
        {
            "review_text": "This game puts you in such an amazing zone!",
            "review_score": "1"
        },
        {
            "review_text": "I have only had the game for ~10min and it's already the first rhythm game I have ever really liked. Well done!",
            "review_score": "1"
        },
        {
            "review_text": "LSD Simulator. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The game really gives you this wardrums feeling. this awesome serious war feeling, it is kind of like geometry dash but the beats does always fit with your move, ALWAYS.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun. If you're looking for a fun game, buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ buy this ♥♥♥♥ing game",
            "review_score": "1"
        },
        {
            "review_text": "If you think this game looks cool buy it. They way it plays is just as impressive and hypnotic as the visuals. This is a very intense rhythm game that teaches you it's many mechanics and expects you to remember and practice them well. However, with just the use of the A button and left control stick the game remains very simple to learn. One of the many great indies to come out of 2016.",
            "review_score": "1"
        },
        {
            "review_text": "A hellish Audiosurf filled with the sinister tension of Devil Daggers.  You will go fast, but you will also be spooked.",
            "review_score": "1"
        },
        {
            "review_text": "The Dark Souls of rhythm games. Also a great way to test breathability of your contact lens.",
            "review_score": "1"
        },
        {
            "review_text": "This is a thumping great game.",
            "review_score": "1"
        },
        {
            "review_text": "Trippy graphics but play seems repetitive and frustrating. Not my cup of tea.",
            "review_score": "-1"
        },
        {
            "review_text": "Vive review: I'm not really into rhythm games, so it's no surprise that I don't like this. It's ok but not worth the 15.99 sale price to me. There simply isn't much to it, and the visuals are repetitive.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty heafty on the price for the content, albeit still fun.  Plays well with keyboard and controller.  So, lets begin with the pros - a very interesting aproach to a rythm game which fully utilizes its one dimentional environment. The visuals are pretty nice, the space theme seems to suit this very well and reminds me of the original TapTap :). Adds lots of new obstacles as the game progresses, kepts it fresh.  Now, unfortunately the cons - the music is a bit too quite compared to the sound effects that you produce, in the first levels it isn't as noticable as in later levels where there are more obstacles. The music seems very very similar through out levels, and what slight variation there is gets masked by th esound effects. A lot of obstacle 'combos' repeat, like 'long left', 'long right', 'long left', 'long right', these repeat on a lot of levels and get very predictable. Also the general route seems to be 'left', 'obstacles', 'right', 'obstacles', you rarely encounter more than 3 turns in the same direction in a row, so it is very predictable. Finally the thing I absolutely hate, why try to make a level harder by simply making it last ages? Also if you do intend in making harder levels longer, make them consisten, that is start with the shortest level and end with the longest (not counting 'bosses', which are a very nice touch in my opinion). Seriousely, I currently just finished 'world 6', and the fith last level (if I remember correctly) lasted a good minute, the next level over in 10-15 seconds.   Overall it is a nice challenging game, the challenge curve was a little to small for my taste as I havent died once untill towards world 3 but enjoy the challenge that the game is presenting to me right now. I rate this as 'recommended' as I enjoy the gameplay, the music is a HUGE let down, considering this is a music game but still. I would like the price to be somewhere around £8-9 at most £10.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic, heart-pounding game. Looks gorgeous and doesn't let up until you're utterly exhausted. Thoroughly recommend it.  Note: Slightly disappointed there is no cameo of Thumper from Bambi. Then again, I read that rabbits could have epilepsy too.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so vividly colorful and challenging. Those who got S rank on all the levels, I give you props cause it's insane. I've had to start over multilpe times, just to get a C rank lol. It's unique and different compared to any other rhythm game out there. My only complaint would be is that I wanted a different boss than just the skull guy at the end, but good work nontheless.",
            "review_score": "1"
        },
        {
            "review_text": "The world's loudest meditation experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game is phenomenal, and I'm saying that as someone who never, ever plays rhythm games and is utter garbage at them. It's brutal going, but totally worth it.  I've only finished up to Level 3, and I'm trying to focus on S ranks first (though I'm gonna change that moving forwards). However, with that mentality, there are two major flaws that get in the way of going for those achievements.  Firstly, a checkpoint pad counts as a hit, and if you miss it, you get an A rank for that segment and cannot go back unless you restart the whole level.  Secondly, why oh why is the restart checkpoint option in the menu so many button presses to reach? Devs, players ARE going to play the game just trying to S rank using resets, so just make it easier for us please?  Clearly the game is meant to be digested in one continuous run focused more on overall score, so I'm going to do that moving forwards and come back for S ranks, as resetting a dozen times for one segment certainly becomes a bit mind-numbing.  I can't even imagine how much more difficult things will get after Level 3...",
            "review_score": "1"
        },
        {
            "review_text": "its beautiful. its nightmarish. its just plain Mean, but dont let that scare you. thumper is a rhythm game experience like no other and i highly reccommend you try it for yourself. i cant put my feelings for this game into words other than i have not been so excited about a game in a very very long time. : )",
            "review_score": "1"
        },
        {
            "review_text": "Step by step guide for beating hard levels:  Step 1: Try, try, and try again. Step 2: Try using a different control scheme i.e using the thumb pad instead of the stick.  Step 3: Take a walk and cool down if you're getting frustrated with a sequence.  Step 4: drink alcohol when taking a walk doesn't work.  Step 5: Beat your head against a hard object to get those creative gaming juices flowing.  Step 6: Try talking to someone after you've stopped sobbing.  Step 7: Call the Suicide Prevention Hotline after that someone called you a loser for not being able to beat that level.  Step 8: Drink more Whiskey after the SPH calls you a loser as well.  Step 9: Pass out in a puddle of your tears and spilled whiskey.",
            "review_score": "1"
        },
        {
            "review_text": "The rhythym game you've been looking for.   Over the years, I've bought and played several rhythm games. Thumper is undoubtedly one of the best. The game looks and feels amazing. Each successful turn and thump feels incredibly satisfying, and each mistake feels devastatingly earned. The intersting soundtrack and abstract visual style contribute a lot to the game's unique tone. 'Rhythmic violence' sounded like a gimmick to me, at first, but it captures Thumper frenetic gameplay to a T. Its visceral, fast-paced, and a lot of fun.  Perhaps the only drawback is the price. $20 ain't exactly cheap for a rhythm game, no matter how good. In its defence, Thumper has a substantial amount of content and replay value (perfecting each level, reaching the top of the leaderboard). It's also incredibly polished, and the hardwork that went into development is apparent.   All in all, definitely give Thumper a try. Might wanna wait for a sale though if you don't have twenty bucks to burn.  ",
            "review_score": "1"
        },
        {
            "review_text": "The core mechanics in this are really solid, and it's a great example of easy to learn and hard to master. The controls are really simple (in fact, it could be played on an old Atari joystick if you were so inclined). The game will tutorialize things pretty well and then mashes things together and complicates them as you go.  Pros: Gorgeous Great music Love the audio cues before each thing (that fit with the music)  Cons (for some): Can be visually tiring Can be very demanding - will punish you if you're not there in the moment  Nitpicks:  Had crashes changing resolution, then the game wouldn't start. I deleted and redownloaded it and everything worked fine (including saved data). The mechanic where 2 fast up+jumps make you stay in the air longer is not obvious. If you are trying to get an S on 6-1 and can't get everything in the air, this is your problem. Last 2 levels don't have the same feel as the rest of the game. They aren't that hard though, so I can overlook it.  The blocks with the green trails don't seem to behave differently than normal. I'm still not sure what they're there for.  Overall I'm really happy with it. I've 100%'d it (which is tough, as of right now only 0.4% have) and I'm actually a little sad as I'll not end up playing it much more. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Thumper is a very entertaining and strangely relaxing game. It has just enough of a challenge to make the gameplay compelling without overdoing the difficulty. I highly recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Your thumbs will tell you no more, but your brain will say keeping going.",
            "review_score": "1"
        },
        {
            "review_text": "There's nothing quite like this one. Immediately jumped high up the list of my all time favorite games. It starts out easy, and ramps up in difficulty at about the halfway point. Don't go into this thinking you'll be tapping A on the beat - this game has you filling in the blanks (syncopation) to sort of compose the song as you play.  Very intense. Very fun. Highly recommended. GO FOR THE S RANKS!!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rhythm games I've played. Fast paced, great music, and tight/responsive controls. The only request I can think of righ tnow is an option to replay parts of the levels, instead of having to go through the whole level itself for a new score",
            "review_score": "1"
        },
        {
            "review_text": "Superb in every aspect. Plus a new way to make a puzzle rythm. ",
            "review_score": "1"
        },
        {
            "review_text": "It's really cool",
            "review_score": "1"
        },
        {
            "review_text": "The core mechanics in this are really solid, and it's a great example of easy to learn and hard to master. The controls are really simple (in fact, it could be played on an old Atari joystick if you were so inclined). The game will tutorialize things pretty well and then mashes things together and complicates them as you go.  Pros: Gorgeous Great music Love the audio cues before each thing (that fit with the music)  Cons (for some): Can be visually tiring Can be very demanding - will punish you if you're not there in the moment  Nitpicks:  Had crashes changing resolution, then the game wouldn't start. I deleted and redownloaded it and everything worked fine (including saved data). The mechanic where 2 fast up+jumps make you stay in the air longer is not obvious. If you are trying to get an S on 6-1 and can't get everything in the air, this is your problem. Last 2 levels don't have the same feel as the rest of the game. They aren't that hard though, so I can overlook it.  The blocks with the green trails don't seem to behave differently than normal. I'm still not sure what they're there for.  Overall I'm really happy with it. I've 100%'d it (which is tough, as of right now only 0.4% have) and I'm actually a little sad as I'll not end up playing it much more. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing rhythm game with a great difficulty curve. Might make your fingers hurt, though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly amazing. I was hesitant about buying it seeing that my funds for the month are low. I definitly made a wise choice in buying it. Unlike any game you've ever played; very unique. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game is like getting your eardrums bludgeoned while trying to concentrate and react in time. Not since something like Super Hexagon have I gotten this much into a rhythm game. Each stage is long enough and intense enough that you can feel your hands gripping and your heartbeat increasing. I think this game is fantastic, even if it stresses me out a little.",
            "review_score": "1"
        },
        {
            "review_text": "  What I think after playing the game ",
            "review_score": "1"
        },
        {
            "review_text": "I previously had heard nothing about this game until I heard that one-half of the band  Lightning Bolt[url] was going to be composing the soundtrack, and then I knew that this would be the most high-intensity rhythm game I'd ever played ",
            "review_score": "1"
        },
        {
            "review_text": "Brutal rhythm game. Very unconventional, very unforgiving.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful, terrifying, punishing, sublime rhythm game.  This game is all about atmosphere. Dark, trippy visuals are paired with a pounding, driving soundtrack as you hurtle through space as a metal beetle. The excellent sound design trains you to be able to subconsciously make split second moves you wouldn't think you could pull off on reflexes alone. I've only played it on a flat screen but I can only imagine that it's absolutely incredible in VR. Not really much to say about this one. If you like punishing rhythm games, you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing. 9/10. The rush this game gave me was pretty intense.",
            "review_score": "1"
        },
        {
            "review_text": "I have never tried drugs, but this is what I imagine it feels like.",
            "review_score": "1"
        },
        {
            "review_text": "This game beats me down but with every successful run through a level builds me back up to a point where I can play it even better than before. This is one of my absolute favorite but least played games. I feel excited to play but it requires a warm up. After that, though, I feel the music and hardly need to pay attention to the oncoming flurry of obstacles. This game is definitely for people who love a challenge but one where you can easily notice the progress of getting better through every playthrough. It's partially memory but I'm only 5 levels into the game and it's become instinct to react to each obstacle. This game is a spectacular battle with music that can be won with practice and good headphones.",
            "review_score": "1"
        },
        {
            "review_text": "This game is intense! The last time I've gotten numbing thumb cramps was when... well maybe it's best I keep that to myself.",
            "review_score": "1"
        },
        {
            "review_text": "Been playing with the Vive and Xbox Controller and can easily say this is the most intense VR game to date. Soundtrack is great and the visuals take it to a whole new level. Some prompts need to be better explained at first, but otherwise the gameplay is solid and challenging in a good way. Can't wait to see all that is in store!",
            "review_score": "1"
        },
        {
            "review_text": "I actually have no idea where to start with this review.  uhh...   Thumper is a game like no other, honestly I haven't seen anything like it. The way the Developer described it is the only real way to summarise/categorise this game; Rhythm Violence. It's Utterly Violent, without there being any real form of violence. It's anxious, it almost forms this fear within you that you aren't going to be quick enough to react to it's lightening quick obstacles. However after a few levels you will start to get the hang of the Rhythm, you really listen out for the audio cues that alert you to which action you need to perform next.   Aside from the overall gameplay and sound, the game also has really nice visuals. They're crazy, unrealistic, neon, glossy and Psychedelic. This game really sucks you in, its hyper immersive in that fashion, You intentively listen to every audio cue, you wait almost painstakingly for the next obstacle to appear.   All in all, Thumper is a Violent Rhythm based game with an amazing soundtrack and a wonderously horrific setting that will have you hooked until completion.",
            "review_score": "1"
        },
        {
            "review_text": "Not much I didn't like, to be honest. Its fun, its challenging, its beautiful, the music is phenominal (Level 4 has the best sound track in my opinion ^^). if you like long stretches into infinity, beautiful graphics and challenging gameplay, Thumper is for you :3",
            "review_score": "1"
        },
        {
            "review_text": "Game is amazing. Just buy it. Seriously. (Played on Vive)",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥♥♥ic in it's execution, like actually get's my ♥♥♥♥ to pulse when I hit that button right within that perfect period of time when it plays that tone signifying perfect execution on the users part. Similarities between levels are present and noted, which might be offputting to some (perhaps me in the future too, I'm only an hour into the game), but that basic ♥♥♥♥♥♥ic feeling derived from hitting the perfect score and the bright flashing lights right in my face just really capture the essence of why one plays a game. I played with the Vive and Steam Controller, so your experience may vary depending on your style of play and equipment at hand. I like the controller control scheme better than that of the keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "My thumbs are numb. My arms are tense. My jaw hurts. My heart's still racing.  I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most thrilling game I've played in the last year. Played in on the Vive in VR as well, it makes the experience even more engrossing and actually makes me play a little better.  The gameplay actually has surprising depth in later levels because you can actually play with extra flair and cool move to maximize your score and regain health.",
            "review_score": "1"
        },
        {
            "review_text": "'No mum I don't want to take my medicine tonight! I like the fever dreams, they are my friends now.'",
            "review_score": "1"
        }
    ]
}