{
    "app_id": 356560,
    "name": "East Tower - Kurenai (East Tower Series Vol. 4)",
    "release_date": "2015-07-30",
    "developer": [
        "roseVeRte"
    ],
    "publisher": [
        "roseVeRte"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 41,
    "positive_ratings": 20,
    "negative_ratings": 5,
    "price": 11.39,
    "description": "This is the Dream World, a place where your wishes will come true. But a dream is not real. Or, is there a way to make it real?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356560/header.jpg?t=1546839309",
    "minimum_requirements": "OS: XP Processor: 1 Ghz Memory: 512 MB RAM Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sincerely the worst visual novel experience on Steam. The characters and art are charmless. The story is bone-stupid prurient trash. The achievements are agonizing. I have sat through some ♥♥♥♥♥♥ visual novels, but never has one made me this physically angry before. One would be better off fapping to men's health (as I can only assume this game exists as masturbatory material for sexually confused 11 year old boys) 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "This review covers all 4 of the East Tower games in one. Simply put, the game isn't very good. The art has occasional good moments but most of it is pretty bad. The story is set up in such a way that it could lend itself to an interesting discussion of gender identity and digital sexuality but it instead chooses to do cliché 'oops, I tripped and grabbed your boob' moments. There are dialog options but the game is still very linear; you either die instantly, find a solution, or pick a solution that gives you a bit of extra dialog.   I would not recommend any of these games except for Kurenai (which was admittedly pretty good). However, there are parts of the Kurenai story that won't make any sense without playing at least a bit of the other ones.  The game is also way too expensive. I bought them all as a set with 40% off ($18 total) and I feel ripped-off. There are much better VNs available for much less. Takashi, Kuon, and Akio were each only about 1.5 hours of play time, which is not a great value.  Finally, every time you finish a section (and there are at least 7 sections per game) the game tries to get you to post to social media. That really pisses me off. It takes me out of the moment to try to get me to advertise for a game that I paid for. Dear game devs, please don't do that!",
            "review_score": "1"
        }
    ]
}