{
    "app_id": 356500,
    "name": "STAR WARS™ Galactic Battlegrounds Saga",
    "release_date": "2016-03-01",
    "developer": [
        "Ensemble Studios"
    ],
    "publisher": [
        "Disney Interactive",
        "Lucasfilm",
        "LucasArts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Star Wars"
    ],
    "achievements": 0,
    "positive_ratings": 1196,
    "negative_ratings": 196,
    "price": 4.79,
    "description": "Lead the great armies of the Star Wars™ Episode II: Attack of the Clones saga in intense real-time strategy clashes. Enter the fray as the Galactic Empire, Rebel Alliance, Wookies, Trade Federation, Gungans or Royal Naboo to determine the course of the Galactic Civil War.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356500/header.jpg?t=1542763677",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: 1.8 GHz Processor Memory: 1 GB RAM Graphics: 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended) DirectX: Version 7.0 Storage: 886 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "10/10 best Age of Empires reskin",
            "review_score": "1"
        },
        {
            "review_text": "FYI it works now  This game = Happiness",
            "review_score": "1"
        },
        {
            "review_text": "I remember paying full price for the base game and expancion when they came out, had so many hours of playtime back then, it is basically AoE with a star wars theme. Glad it released on steam and at the same time being on humblebundle, so for a buck, it's nice to have it around.  Due to the nature of how old the game is and how it was released unpatched for modern systems, it requires a lot of tinkering around to get it running, but once you do, it's great.",
            "review_score": "1"
        },
        {
            "review_text": "As a guy who used to play the old Empire Earth and AoE games. This is really fun, also because I'm a Star Wars fan. It's just AoE with Star Wars.  I think the reason for the mxied reviews is because that most of them are running Windows 10? I'm currently using Windows 8.1 and it's working fine.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Have to use community patch if you are running windows 10. If you want to play with friends get Game Ranger for mulitplayer.",
            "review_score": "1"
        },
        {
            "review_text": "This game, I honestly have no words for how much I love it. I grew up playing this as a kid.",
            "review_score": "1"
        },
        {
            "review_text": "The original Non Steam game was great!!!, on other hand this one has resolution issues, no new hd graphics like the remastered Age of Empires II and they did not make a new multiplayer platform, i totally recommend this game but the developers have many things to fix.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Age of Empires 2 but Star Wars-y, I would recommend this to anybody who enjoys the RTS genre.  Things that should be added: Multiplayer with no 3rd party applications Steam Workshop",
            "review_score": "1"
        },
        {
            "review_text": "Age of Empires meets Star wars ",
            "review_score": "1"
        },
        {
            "review_text": "Some people seem to give this game hate, saying it's just a mediocre nostalgia trip.  Yeah, the nostalgia is pretty strong with this one, but I think it really is a pretty good game. Yeah, it looks pretty dated but it plays pretty well. I'm not going to pretend like I know it inside and out but it seems fairly well balanced and the additional unit types over what age of empires offer really does make it interesting.  A fair few people complain about it not working. I'm not sure if this is fixed yet or not for them, but from my experience it hasn't had any trouble running whatsoever.  Basically, if you like Star Wars, it can be fun to play around with the factions and characters. If you're an age of empires fan, I'd strongly recommend checking it out- as it's an interesting take on the formula with a great variety of units, unit types and playstyles.",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't tell what this game was about because everybody was more happy it is works with Windows 10. I can sum this up in 7 words:  It is an Age of Empires Clone.  And a damn good one too. If you haven't played AoE try this out, it is very cheap. If you have played it and like Star Wars, get it now!",
            "review_score": "1"
        },
        {
            "review_text": "I grew up with this game. As a boy this game was the only way that I could make all of the Epic Star Wars battles that I've aways dreamed about. Seeing this come to steam is one of the best things that has happend to me!!!!! Also its very fun 10/10 would get eaten by a Rancor again!!",
            "review_score": "1"
        },
        {
            "review_text": "There is some major issues with this 'port' of the game I'll outline, but I'm still going to reccomend it because it's an awesome game, fully playable in and of itself, and is only $6  Pros  -It's essentally a fully liscensed and fleshed out Star Wars total converstion for Age of Empires II complete with story mode compagins and some voice acting (not from the real actors, but from decent VAs that do a good enough impression to be believable)  -Several unique factions all with their own special abilities (for example: the Federation doesn't need houses or shelters since they're robots, so you're unit limit is maxed out right from the start)  -Story modes for all of them, even the 'bad guys' to help flesh out the mythlogy and show us new stuff the movies didn't  -Fun gameplay that can result in sinking hours into just firing up a single player quick battle and building a huge base.  Cons (all due to the poor porting to Steam)  -The opening videos don't work, so you have to skip them.  -So poorly 'ported' that the Steam overlay doesn't even work with it  -No 1080p or even 720p support, so you'll be stuck playing on the fairly low reslutions the game had at launch back in 2001 (it wasn't exactly a AAA title and RTS games tended to be aimed at 'causal' players and made to run on a potato back then)    ",
            "review_score": "1"
        },
        {
            "review_text": "As someone who has played the game for the first time in 2016, I'd like to write an objective and detailed review that somewhat disregards nostalgia.  Can't say I'm a big fan of RTS games, but this one is really something. The only RTS I remember enjoying this much was Red Alert 2. Developed by the same guys that brought you Age of Empires, this game is going to be a blast to Star Wars fans who played AoE titles before. Because at the very core this is Age of Empires II in the Star Wars universe.  If you're unfamiliar with the RTS genre, don't worry, the game provides a great tutorial on how to do everything you need to know. If you're a hardcore RTS player, do keep in mind that this is a slow paced RTS, you won't be able to rush your opponent with beginner units expecting to win. You'll need to advance in technological levels and upgrade your units before you feel like they have that 'Oomph'.  With total of six (+2) different factions to choose from (Galactic Empire, Rebel Alliance, Wookies, Royal Naboo, Trade Federation and Gungans), it really spices up the variety of the battlefield. Not to mention that at every upgrade your units receive (0 - 3 upgrades depending on the unit), they gain a different visual appearance.  While units and structures vary from faction to faction, at the basic level, they're more or less the same 'type' in a different shell, with some exceptions of course. Yes it can be viewed as a negative aspect but it does give you a sense of balance, so you don't feel like the other faction has the upper hand.  Before jumping to a skirmish battle, take the time to play the campaign missions. Not only they are well made and enjoyable, they also put you in different situations where you learn to play the game better.  Overall, do I recommend this? Wholeheartedly. Is this a breathtaking masterpiece? Of course not, but it's a fun game and that's all that matters.",
            "review_score": "1"
        },
        {
            "review_text": "Age of Empires Star Wars pretty much. It's not the best looking game although it is really old so I'll give it that. It's a fun game to mess around with. If you're looking for a simple cheap game for a few hours of fun, would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Windows 7 x64 here. The game works fine. Don't expect something like Age of Empires II HD because this is the same old game with 1280 x 1024 as max resolution. I hope there's an upgrade with HD textures, 60fps and all that in the future.  I did not have problems with the game but i find somewhat strange the way it works. First the videos, then you return to your desktop and suddenly the screen goes black and then paf! the game runs fine. I'm playing with default options, no windows xp or 3.11 compatibility   I recommend this game if you are a fan of it already. Otherwise, wait for a proper fix.  ",
            "review_score": "1"
        },
        {
            "review_text": "Old favorite RTS. Picked it up for $1 on Humble Bundle.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, you just need to go into the files and use the game file to open it, other than that it is a great RTS.",
            "review_score": "1"
        },
        {
            "review_text": "get this",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "A must have for fans!  yes, it is old, they have fixed some stuff, but sometimes you have to do some jiggery diggery for it to run smoothly. But it's Star Wars! It's worth it. (Worth buying it on sale 4th of may ^^)   it's good to see these gems on steam.  sale purchase, 7/10 would command wookies again",
            "review_score": "1"
        },
        {
            "review_text": "Brings back old memories of when I was a child",
            "review_score": "1"
        },
        {
            "review_text": "It's 2016. I just played this game and installed the fan update patch.  WHERE HAVE YOU BEEN ALL MY LIFE?!",
            "review_score": "1"
        },
        {
            "review_text": "I used to love playing this game co-op back in early 2000s, this Age of Empires clone was considered one of the better strategy games for the time, but it hasn't really aged well and is barely compatible with modern systems, sure it'll work...but it'll crash alot and it'll even need some research done to get any of the components work such as video.  Sadly, the game suffers from the early phases of zerg fever, which you can obviously blame Starcraft on that - Galactic Battlegrounds is more or less a rush to level up your main base and then pump out air cruisers, even just 3 of them can lay waste to any unprotected base in a matter of seconds.   With better compatability and support for higher resolutions, then I would give a positive.",
            "review_score": "-1"
        },
        {
            "review_text": "I owned this game when it originally came out, so my hours on Steam don't reflect the hundreds of hours I put in as a kid.  tl;dr at the bottom, kind of like fruit in a delicious yogurt cup  SWGB is one of those games I keep reinstalling, no matter how much time goes by. It follows the classic format of Age of Empires II with some notable differences - from the cosmetic overhaul to the fact that basic infantry have blasters instead of swords - that make it stand out. These differences allow for a variety of viable strategies, from converting everything your enemy treasures with Jedi/Sith to creating an impregnable fortress and slowly expanding.  The AI is very retro in the sense that it's not metaphorically drooling on the floor. When I set campaign difficulty to hard, I forgot that it would actually pose a challenge and accidentally lost the man I needed to protect. When I set a standard game's difficulty to normal, I forgot that is normal for someone acquainted with the nature of the game and got mauled for being rusty.   There's a campaign for each faction. No, not just a campaign: a  fully-voiced  campaign. It can definitely get cheesy, but it's fun nonetheless.   The campaign isn't the main chunk of gameplay, though. It's mostly in the standard mode, which generates a map and offers an array of game modes that can even be played in singleplayer. If this isn't enough and you have a bit of a creative spark, there's an extensive map editor that allows for the placement of every prop, unit, and building in the game. It comes with the tools to make your creation feel less like a handmade map and more like a homemade campaign (such as modifying unit stats, changing possession of buildings, and even setting new win/loss conditions).  So far, all of this has been positive. It's hard to be unbiased when you grew up on it. However, here's some things I've noticed that were a little offputting:  • The multiplayer matchmaking is long dead.   There is a LAN function, but I haven't tested its functionality. I'd assume it still works.   • Graphics settings are limited, offering low, medium, and high settings and a selection of three 4:3 resolutions. There's no 4K, 2K, or even 1080p support (officially). • Steam overlay doesn't appear to work. • Yousa might not be liken hearen da proud talk of da goongan people!   it's my guilty pleasure    tl;dr If you haven't played it before and you like classic RTSes and Star Wars, you can't really go wrong with this entry. Just know that this isn't some fancy shmancy HD remaster; it's the same game that came out on November 9th, 2001.",
            "review_score": "1"
        },
        {
            "review_text": "Great to see this classic game available again. I wish they would refresh/do a modern version. Playing this brings back a lot of great multiplayer memories, Troopfests etc.  For anyone having issues launching, gointo your computers directory and open the exe file in compatability mode and it will work.",
            "review_score": "1"
        },
        {
            "review_text": "it is so good!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Grew up with this game and it's still just as good as it was back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "cant even play this game and looks good too. Can see cinematic intro but crashes later on.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a pretty good game if you don't already have age of empires. If you have aoe don't get this game thay are exactly the same . If you don't have aoe get this game right away it is incredible. I don't know why people are complaining about it not working on modern pcs I have a windows 8 and it works fine.",
            "review_score": "1"
        },
        {
            "review_text": "👌👀👌👀👌👀👌👀👌👀 good ♥♥♥♥ go౦ԁ ♥♥♥♥👌 thats ✔ some good👌👌♥♥♥♥ right👌👌there👌👌👌 right✔there ✔✔if i do ƽaү so my self 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯 👌👌 👌НO0ОଠOOOOOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌👌 👌 💯 👌 👀 👀 👀 👌👌Good ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "So I was able to play this game and loved it i mean its AoE in Star Wars, but now with the most recent update I can no longer play.....",
            "review_score": "-1"
        },
        {
            "review_text": "This just DOESN'T WORK on Windows 7!! The GRAPHICS if you have an AMD card are completely blotched!! The game should have been optimised and a HD version should have been produced such as were for the excellent Age Of Empire 2 games which I have NO PROBLEM playing depsite using exactly the same graphics engine! Just a WARNING folks and now I have to ask HumbleBumble for a bloody refund.",
            "review_score": "-1"
        },
        {
            "review_text": "played this for endless hours in summer of 2002. had great dramas pretending to have split personalities and toy with people's emotions completely separate from game while manipulating people to give me Zam Wessel units in 'Senate' with boosted stats. if anyone remembers me, sorry   for game itself, despite all the fun i had, it was a terrible game. basically looks exactly like Age of Empires 2 with almost no change in core gameplay mechanics. every faction is exactly the same, with units identical in function. the only differences lay in specific race bonuses (such as Trade Federation not needing to build supply depots for population) and one or two special Fortress units.    fundamental gameplay was utterly broken by the severely unbalanced super units and the Fortress --- every single game you play with someone who isn't a friend or a newbie ends with them building one or more fortresses just outside your base and building tons of cannons to bomb your base from afar, while hoarding large mechs (AT-ATs for empire, AT-TEs for republic) to defend it.  clone campaigns expansion only made this worse by significantly boosting the Fortress stats and adding the gamebreaking Shield Generator to the game, which effectively doubles the HP of all units underneath it, while also adding in huge air unit cannons (star destroyers for empire, etc) which do colossal splash damage. they then severely decreased anti air units damage so that these things are even more grotesquely overpowered.  add on to this, the game was so flawed in terms of multiplayer connections that when ever something went wrong with someone's connection, it would give a completely contextless message 'Out of sync detected', then end the game for everyone involved. might not happen on steam version.   the voice acting is beyond terrible, to the point where i'm not entirely sure many of the voice actors were aware of what characters they were supposed to be voicing. the taunt for the Obi-Wan line 'If you strike me down...' sounds almost exactly like Liam Neeson, as if the actor thought Qui-Gonn Jin said it to the point where i thought it was a Qui-Gon Jinn quote for the longest time (this being before i saw all the movies 90 times each), and the voice for prequel-era Obi Wan sounded like a man with a stuffed nose doing a racist caricature of a chinese man",
            "review_score": "-1"
        },
        {
            "review_text": "The best Star Wars RTS ever made!  Runs great with Windows 7, occasional color glitching as most games this old have.  I would spend hours making maps in this game and then spend twice as many hours playing on them.",
            "review_score": "1"
        },
        {
            "review_text": "Game wont work. It close itself after the Intro video, which I cant even see becouse of codec incompatibility",
            "review_score": "-1"
        },
        {
            "review_text": "Best starwars RTS game even though it was made like 15 years ago. It is basically age of empires II, but Starwars themed instead.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and always have. I still have the CDs but I have archived them since this is now on Steam in a downloadable version. The best option to play this game is to set up a LAN with a team of 4 and then go against Hard computers. it brings out the teamwork in friendships.",
            "review_score": "1"
        },
        {
            "review_text": "Very good old fashion, now if only this game had abilities with the Workshop like the Age of Empires series do, then maybe I'll be able to spread some good old fashion cheer.",
            "review_score": "1"
        },
        {
            "review_text": "I'm on Windows 7 and the game launched fine for me. However, while playing multiplayer my game errors out after 10-15 minuates of playing with a sync error. Right now I have no fix for this. Such a bummer becasue the game is a lot of fun to play. Wish they would come out with an updated HD version.",
            "review_score": "1"
        },
        {
            "review_text": "I would suck this game's ♥♥♥♥ if I could.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game ever since the Clone Campaign came out, I recently got it on STEAM so disregard the timer. This really was the first game I played, and I still love it to this day. Only got it on STEAM so I have access to a digital copy. It's always had issues crashing, unfortuantly. I was an hour into a Standard Game/Random map when it shut down. This is a dated game, and it still has limitations on what it can handle.  Save often. My game crashed 60 minutes into it. Just as I was about to make my final push. But, I still love this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a ton of fun even for being dated. It needs some tweaks. IE the sound level cannot be changed.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the first RTS I ever played aside from Age of Empires 2 after begging my mom to get it for me this one time she dragged me to Office Depot on an errand. This certainly brings back some good times.  There isn't much to say, except that it comes with the Clone Wars expansion, which was a nice touch to begin with, not to mention the obvious nostalgia for those who played it in their youth. However, an HD version would be very much appreciated, as well as a working multiplayer system.  The only main issue I seem to be facing with this game is that the in-game music will cut out eventually after going through it's playlist. The fix i've found is to Alt+Tab out, and then go back in, and the music will start again from the beginning of the playlist. Does anyone know how to make it so the playlist is random? That would be nice, too.  Anyway, buy this game. A lot of work and creativity went into it at it's time of creation. You know, when LucasArts was entering their prime. Haha!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, Spent child hood playing this game, now its on steam, I recommended to anybody who loves a hard strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game to death and I HATE RTS games. Seriously fun to play, and using gameranger you can even fine servers. Definitely check this game out.",
            "review_score": "1"
        },
        {
            "review_text": "The game that was the forerunner for Star Wars: Empire at War. Has very similar controls to EaW, but offers more content in terms of playable factions, campaigns, and unlike the steam version of EaW this game has a map editor &amp; campaign editor!   Pros:  +Similar controls to Empire at War +Great Tutorial to introduce game +Easy to approach  +Variety in Campaigns is delightful  +Soundtrack/Voice Acting/Sound Effects are good +More simplified micro-managing than Civ games but more to micro-manage than EaW  +Play as The Empire, Rebel Alliance, New Republic, Grand Army of the Republic (Clone Army), Confederacy (Droid Army), and Wookies! Each Faction has their own campaign!  +Map Editor +Campaign Editor +Custom Battle Mode (Basically 'Skirmish Mode' with complete custmization for the map)  +Standard Mode (Basically 'Instant Action' or 'Skirmish' Mode with default content)  +Very amusing easter eggs and cheat codes exist for this game  Variable:  +/-Graphics hold up to status quo for mobile games but not for today's PC games.   Cons: -Play as the Gungans--I would have prefered Mandolorians!  -Pacing can be slow when gathering enough resources to build armies -No multiplayer support on steam   Final Verdict:  Despite no multiplayer this game is awesome. After a while army building might seem tedious with resource gathering, but make use of those upgrades to remedy that. And I would have liked to see another Star Wars faction instead of Gungans. But I am very pleased with this game. For $2.99 with the Star Wars Day sale (May 4th) I cannot complain. It holds up well and the graphics are comparable to today's mobile game graphics. Money well spent!    10/10 Impressive, most impressive. I have a good feeling about this.",
            "review_score": "1"
        },
        {
            "review_text": "The amount of entertainment that will come from this $5 purchase is insane. Most users who purchase this game are already a fan of the Age of Empires series or have played this version in the past. This reskin is absolutely amazing and it really brings a new feel to the series (especially the air attack &amp; defense systems).  I highly recommend you purchase this game if you're looking for something new aside from Age of Empires. This is an old game and the graphics show that but it's a true classic!",
            "review_score": "1"
        },
        {
            "review_text": "This game runs well on low-spec machines like those with integrated graphics and also on Windows 10.   Unfortunately matchmaking doesn't exist, you either need the IP of the host or to use a third-party program like GameRanger (which actually works fairly well).  Really fun to play, it's my dream come true - Age of Empires but actually Star Wars. Games can take a long time though, so be prepared.",
            "review_score": "1"
        },
        {
            "review_text": "This game is still amazing even after 15 years. I've had hundreds of hours of fun playing it. If you like Star Wars and RTS games I would highly recommend buying this game.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia hit me pretty hard when I saw this game during a sale. ♥♥♥♥♥♥♥, son. Thx, Based Disney.",
            "review_score": "1"
        }
    ]
}