{
    "app_id": 356520,
    "name": "Port of Call",
    "release_date": "2015-08-28",
    "developer": [
        "Underdog Games"
    ],
    "publisher": [
        "Underdog Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Free to Play"
    ],
    "achievements": 7,
    "positive_ratings": 939,
    "negative_ratings": 104,
    "price": 0.0,
    "description": "Imagine waking up on a small dock with no recollection of who you are or how you got there. The first person you find is a grumpy, old man who enlists you to work on his ferry boat which seems to have materialized behind you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356520/header.jpg?t=1447370834",
    "minimum_requirements": "OS: Windows XP/Windows 7/Vista/8 Processor: Intel i3 Memory: 1024 MB RAM Graphics: Intel integrated DirectX: Version 9.0 Storage: 326 MB available space Additional Notes: Optimal with headphones",
    "recommended_requirements": "OS: Windows XP/Windows 7/Vista/8 Processor: Intel i5 Memory: 2048 MB RAM Graphics: Intel integrated DirectX: Version 9.0 Storage: 326 MB available space Additional Notes: Optimal with headphones",
    "reviews": [
        {
            "review_text": "This is a very short, but interesting little game. You wake up at a pier, not knowing who or where you are. The old man invites you to enter his boat, and then an original story unfolds. The dialogue is very well written, and the story drew me very easy into this game. Which proved necessary in order to get real enjoyment, since neither the graphics nor the audio is up to the level of the story. At the end the game left me in disarry for a moment, since it is rather grim and unsettling.  But since this is a free game, there's no reason not to recommend it. Furthermore, it comes with seven achievements which can be unlocked easily, so for anyone looking for 100% games this is a must. Do play it twice: the story made much more sense to me on my second playthrough, and the game is really short.   Recommend to everyone interested in something slightly different ",
            "review_score": "1"
        },
        {
            "review_text": "You wake up on a dock. You board a strange boat. You have to meet people to retrieve their tickets to satisfy the captain. But everything is strange: between the passengers with masks, items floating in the air and the shadows, you're asking yourself if you're in the realm of Death or it's just a dream...  Port of Call is a small adventure game, in a cartoonish style, where you're trying to find who you are and why you need to meet these passengers. Listening to their stories is also interesting because they hold the key to your identity.  The soundtrack is good, like the graphics that are so reassuring and freakening at the same time: while it's not a dark game, when you see floating stuffs, a huge toy sheet and shadows, you're asking yourself what's happening. You understand quickly that you're maybe dead but then, why are you collecting tickets? Shouldn't you be a simple passenger?  Anyway, there are no puzzles there: apart speaking, finding a teddy bear and mixing drinks, you're just confronted to a poor gameplay. Yet, the dialogues here are important if you want to understand the story and find answers. The quest for the pencils and the paintings is also a nice bonus, though that for the paintings, it's very easy.  The main problem of the game is the fact that you have an hard time to find a menu, you have to press Escape to make it appear and to quit properly the game. The screen title lacks options.  But there is another problem with the game that will bother AZERTY users. The game is set with WASD keys, without ZQSD alternative or arrows. While the fix for comfort is to move the mouse and to keep pressing on W, as it's not natural to press the W instead of the Z, once you're releasing the key, you have some seconds to remind yourself, that no, the key you're so used to press isn't the same.  Other than that, I enjoyed the experience. And it's free with achievements!",
            "review_score": "1"
        },
        {
            "review_text": "Short, eery, yet undoubtedly enjoyable free-to-play game.  You start on a dock, boarding a creepy boat and have to collect people's tickets. Different objects appear and dissapear, there's floating books, passengers wearing masks, and silhouettes of dead passengers. You make a final decision at the end to join the dead in the afterlife or regain your life and wake back up in what sounds like a hospital room.  Rate: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "  “The destination is but an incidental consequence of the journey.”    Port of Call is a narrative exploration game developed and published by the company Underdog Games.    Pro &amp; contra:    + Immersive short-form storytelling.   o Occasional use of musical background and sounds.   - Low quality graphics with some questionable elements.    Summary:    Port of Call represents straight-forward and interesting journey of self-discovery. The only drawback is the graphical presentation. It feels rushed and would have needed more attention, in order to give the game a unique look that supports the narrative.   Recommended for achievement hunters and curious explorers.     Achievements:    Estimated time for 100% completion: +30 minutes  Singleplayer achievements: 7 Multiplayer achievements: none",
            "review_score": "1"
        },
        {
            "review_text": "very short but worth the experience in my opinion. you are a dead person who wakes up remembering nothing on a dock and you get up onto a ship where you bit by bit find out who you are and what happened in your past. very interesting story",
            "review_score": "1"
        },
        {
            "review_text": "The game started well and was a cool experience, but it just got so much better! I love these free games because the creativity is sometimes so much better than you get in a AAA experience. The first playthrough was about 30-40 minutes because I talk to everyone about everything. There is more than one way to end the game but don't worry - you can quickly get back and see them all! Very recommended and such a cool game!",
            "review_score": "1"
        },
        {
            "review_text": "For a proper judgment I have to ignore it's a free game and just evaluate whether it's worth playing. That's why I gave it a thumbs down.  Playing a free low-skill tech demo still occupies your time, and unless you consider that worthless, you can skip Port of Call without having to worry that you miss anything.  This game proves nothing more that the dev has very basic technical game-making skills. The story writing and such is slightly below OK. The story is like a copy of a witty story with surprise twists and then making it fully predictable, removing anything special and appealing from it, so it's bascially totally unspectacular. Also, the dialogues, while occasionally providing choices, not only have no effect on the progress of events, but often don't even result in different responses. This was especially bad towards the end, when the resolution forces its course even if your dialogue choices go totally against it, and that was like the seal of truth on what I perceived before.  There are achievements for doing stuff of no consequence or even not making sense. You collect crayons that are lying around. Why? Why should you pick them up? You have no need for them, no incentive to pick them up.  Even so much as different text colors for you and others was too much to ask. Your text is placed slightly lower than NPC text, that's all.  I don't know, maybe some people actually find this entertaining (especially if you have never experienced remarkable writing), but generally a game published on Steam should be focused on the player, not the developer. This is like: 'Look, I can make a game with kind of a story. Please take half an hour to admire that. I offer it for free, so you cannot complain no matter what.'  I feel like I watched a commercial. Or participated in a beta-testing run.  I recently played 'the static speaks my name' and I found that a tiny bit better due to how it at least made me ponder a little on what message it might be trying to convey.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a cool short game. The dialoug in the game is great, along with the story to accompany it. Just an all around great small game. Definitely recommend playing!",
            "review_score": "1"
        },
        {
            "review_text": "PROS: - nice visual style - good atmosphere - nice little story - two endings? - achievements  CONS: - crashes every 30 minutes on Windows 10 64bit - really short  RESULT: It was a really nice gaming experience with a lot of choices. It's only about 30 minutes long and have about 30 choices, not bad. I also love the achievements, if you are a hunter like me, then it's a nice extra for getting the two endings. The story is nothing special, but still well told. The atmosphere was really great and let you feel sucked into the world. The graphics are bad so far, but the visual style I really like anyway. I can really recommend this game for anyone, it's short and has a really well told story. :D (\\s/)",
            "review_score": "1"
        },
        {
            "review_text": "I have to recommend this little gem. It's free to play and makes you think a bit. It certainly get's your attention as well.  Don't expect a lot for this is a very minimalist styled game, to it's benefit, however.  I finished the game in under and hour then quickly played through again for an alternate ending and now i'm at 1.1 hours played so you can see how short it is.   Definitley play this just for the expierience.",
            "review_score": "1"
        },
        {
            "review_text": "Pleasant game. Interesting art. Characters are likable, though a bit shallow. Unfortunately the two endings are exactly the same since there is no epilogue.",
            "review_score": "1"
        },
        {
            "review_text": "So sad and beauteous ... And quiet ...",
            "review_score": "1"
        },
        {
            "review_text": "Very short and a little wonky at times, but was entertaining and it's free.",
            "review_score": "1"
        },
        {
            "review_text": "I got terrible motion sickness from just 15 minutes of playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics are vaguely handdrawn, Audio is quite good, Gameplay is short and simple, follow the directions and interact.   The plot is straightforward and predictable from the start. A story of regrets, remorse and repent as in all life. Short and touching story, especially when first visiting the little girl,     Free, several achievements and a Perfect game in less than an hour.  Play it and enjoy the short story.      ",
            "review_score": "1"
        },
        {
            "review_text": "Very nice experience, even the game is about the [soiler]death[/spoiler], it's a really nice made one.   Shame it was so short :(",
            "review_score": "1"
        },
        {
            "review_text": "My experience playing Port of Call is unsatisfying despite the originality of the story. I think the developers can extend the story even further to give players more info on who Marcus, the main character, is and how he had ended up on the steamboat of Death to begin with.   The gameplay itself left me feeling dizzy and the art isn't as nice as I hoped it to be. Hopefully the game will undergo significant updates for the better.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played games with multiple gigs of gameplay, but this tiny game truly touched my heart and became one of my favorite games in a matter of minutes. I absolutly love the meloncolly and sad feel of slowly piecing together the characters life. I look forward to seeing more from you guys in the future.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;3 the story. It's free just install it. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game and has a well thought story with enough mistery about it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool and good story telling game",
            "review_score": "1"
        },
        {
            "review_text": "There's always something about these super short low spec simple indie games that stand out among the rest of the mudflow of other games getting poured into steam. 1. You can run this game. No argument. You can run it. 2. super quick download 3. super short, It's 5am in the morning and I decided to just try this game real quick before bed. 4. Tells a kewl little story, I liked it. 5. pretty casual gameplay. No challenge, just relax and enjoy.  This game doesn't really need a review. I just felt like writing one because it's a neat little gem compared to all the other garbage lately.",
            "review_score": "1"
        },
        {
            "review_text": "Damn. This game hit me right in the feels.   And yeah, don't hesitate to play the game. It's free.",
            "review_score": "1"
        },
        {
            "review_text": "Spoiler: Marcus commited suicide",
            "review_score": "1"
        },
        {
            "review_text": "A cool, free, short exploration game. It has a fairly interesting story, setting and characters. I wouldn't call it a 'horror' game, but that might just be me.   The ending was kind of disappointing IMO, but... the game is free, so I can't complain, really.",
            "review_score": "1"
        },
        {
            "review_text": "A surreal, creepy little game, can be played through (twice!) in an hour.  Recommended because: it's free and has achievements",
            "review_score": "1"
        },
        {
            "review_text": "CHECK LIST is the price right: yes was it a waste of time: yes Did I enjoy it : yes Did I play back to back: yes Will I play again: yes Would I recommend it: yes  ALL the makings of a good story game. A little buggy but not story breaking. good job and since it is free and fairly short everyone should play it once and not even need a full review.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad at all for a game that I completed two times in 29 minutes. The story is rather compelling, yet simple. Slightly thought provoking, but not tear inducing.  The only real gripe I have, is that the game has poor optimization. With my rig, this should run flawlessly at 60 FPS (the game is capped) yet I find myself dipping into the mid 30's and 40's frequently. It causes lag and choppiness throughout the experience.  Not a bad way to spend half an hour, though. And it's free!   Rating:  3.5/5.0 ",
            "review_score": "1"
        },
        {
            "review_text": "Just because a game is free does not mean it gets an automatic pass.  This game is clearly just a vehicle for an extremely brief story. Sadly the gameplay boils down to talking to some people, mixing a few drinks (seriously?) and making a final choice. There is hardly any story to speak of and the emotional and moral ideas the game seeks to convey are incredibly on the nose and shallow. Even at maximum settings the graphics are atrocious. Perhaps an artistic choice, but nevertheless still a sore sight.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor design and execution. I know it's free but why does Steam allow unfinished games such as this one?",
            "review_score": "-1"
        },
        {
            "review_text": "Free walking simulator. Think Gone Home on a boat without the polish.  This one is particularly annoying since the basic elements/atmosphere MIGHT have made a fun horror game given a LOT of work.",
            "review_score": "-1"
        },
        {
            "review_text": "Kind of boring dialogs and uninteresting story. Visuals are good.",
            "review_score": "-1"
        },
        {
            "review_text": "That subtile way to treat a topic as controversial as Death. I loved the game, the story is moving, the music fits incredibly, creates a melancholy yet warm atmosphere.  I just can't describe how much i liked it. It is amusing.",
            "review_score": "1"
        },
        {
            "review_text": "A short, interesting and thoughtful game.",
            "review_score": "1"
        },
        {
            "review_text": "It is short, it lasted me 20 minutes. But I enjoyed every one - it's free, small, tells a perplexing yet entertaining tale which climaxes at the end, making you choose how the story finishes. Although the endings did dissapoint me nothing can be taken away from the nice graphical style and interesting characters. It's worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "First game i have 100% on steam, and well earned too.",
            "review_score": "1"
        },
        {
            "review_text": "Its hard at the same time but it got easier at times.",
            "review_score": "1"
        },
        {
            "review_text": "Port of Call is an excellent atmospheric, chilling indie game. I would briefly like to say that unlike many other indie games it offers a different meaning to a sense of storyline and thrilling perspective. It is a small amount of MB to download which is a huge plus to those with minimal disk space. Realistically, you just HAVE TO play the game and experience yourself how good it is. One of these games doesn't come around too often.  Aside from the rest, the only con I have to this game is that it has a tendendancy to freeze and sometimes crash, at least for me and on my Mac. Don't know about how or what can fix it but overall, the rest aside, i strongly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This neat little game, which was announced at the 2014 E3 College Game Competition, is definitely worth checking out.  'Port of Call' begins with the protagonist, who is unnamed and suffers from amnesia, waking up on a dock and boarding a ship that seemed to materialize out of nothing. It is helmed by a mysterious hooded man who towers over you, and the story unfolds as you meet with the other passengers aboard the ship.  The game, in the same style as 'Gone Home' or 'Dear Esther', is a walking sim, with atmosphere and narrative being the focus. While the game itself doesn't bring anything groundbreaking to the genre, it is a neat little story that you can knock out as you're having your morning cup of coffee.  Plus it's free, and who doesn't like free things?  Underdog Games are still finding their feet (this being their first release), but this is a game worth checking out, and if you like walking sims, you won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "A heart-wrenchingly beautiful way to kill some spare time, 'Port of Call' will take you on a journey of revelations and will leave you with a weighty choice.   10/10 Would come close to crying again.",
            "review_score": "1"
        },
        {
            "review_text": "=WILL contain spoilers=   i beat the game in 38 minutes probably literally one of the most interesting games ive played to be 100% honest. It has to do with the afterlife so its kinda like your in h e l l and i had to space those out otherwise it would heart it i think one sec lets see hell ill look at that after anyway your in h e l l but its not the kind of h e l l that you think about; its a gigantic boat you have to collect a little girls ticket at the beggining your first encounter is an old man the ''hand o' the wheel'' so you go and collect this girls ticket and you talk with her she explains a creepy storie of how she well, spoiler allert as said, 'died' so you are basicly her older brother and she disapears i dont wanna spoil too much for the readers anyway she disapears and you collect her ticket so you talk with the captin and he tells you to talk with this old drunk guy and you go to the top floor mix this guy a few drinks and suddenly he dissapears too. collect his ticket and bring it to the captin this man is a very important person again i dont wanna spoil too much the captin takes the ticket an old woman stands in the way of the captins veiw you talk to her she dissapears as well. the captin orders you to talk to some guy in the boiler room this guy is the wise one that uncovers all the secerates and questions you had well playing the game; at the end you got yourself a hard dissicion go to heaven with everybody you met on the ship or go back to the real world. me, i went to heaven",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game, and it is short. You should try it. If you do YouTube, post a video of you playing it on YouTube. I have. Or will. Depends on when you see this",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game, well executed. Just click carefully. Once or twice the game counted two mouse clicks instead of one and skipped some dialogues.  People may say that it is short but I think it is exactly as long as it needs to be. Open your hearth and play it alone in silence. I cannot say more without spoiling the content.",
            "review_score": "1"
        },
        {
            "review_text": "Mysterious, Nostalgic, Clever. Still I wish they would show the ending what happened.",
            "review_score": "1"
        },
        {
            "review_text": "Dark and mysterious. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet.  A very unique game where you help passengers aboard a ship. Almost minimalistic in style, Port of Call only reveals to you what it wants and holds a sense of mystery over your head until the end.   If you have 30 minutes to kill I would highly recommend this game, definitely worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "The other side is calling!  + : good game, short, gameplay, amazing story, free, ghosts, fun to play, achievments  - : graphics, but its alright since its free  9/10 would call again",
            "review_score": "1"
        },
        {
            "review_text": "great story, nice gameplay, cool soundtrack   if you're looking for a short but deep game then you've come to the right place",
            "review_score": "1"
        },
        {
            "review_text": "the lighthouse was on the left the whole time but i got off and it was on the right 0/10 unrealistic",
            "review_score": "1"
        },
        {
            "review_text": "This is a really interesting game, the story is short and simple but nice. The game is free and its an enjoyable half hour or so of playing",
            "review_score": "1"
        },
        {
            "review_text": "It's short, atmospheric, and overall a fairly rewarding experience. A bit spooky in places, but nothing that will make you wet yourself. I say give it a try. Oh, and if you're a completionist it won't make you grind your teeth like some games I know...",
            "review_score": "1"
        },
        {
            "review_text": "A short story of regrets that must reach a conclusion in the afterlife.  The twist was fairly obvious, the story slightly very 'artsy' and pretentious as well, but it is free,and there are no real flaws with it, so give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Just didnt like that it was so short. 9/10  Makes you wonder about life.. quite the philisophical little game. And it was free!!",
            "review_score": "1"
        },
        {
            "review_text": "I played 30 Minutes, looked everyhere (and stilled missed two crayons and one painting, how can I live?).  Sometimes it was a bit spooky, because of the music, and even when you catched on fast what is happening on the ship it was intresting to interact with all the characters.  I would replay again just to see if other anwers affect the game.",
            "review_score": "1"
        },
        {
            "review_text": "Short game with nice plot twist. Achievements are very easy to get, and hey! It's free!! definitely worth spending few minutes to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent short game! Engaging, and not boring at all. The story is slightly predictable, but it's short enough that you don't mind. This one is worth a couple of play throughs to see the endings, and well worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "A Great free game that offers easily obtainable achievements and an interesting story that is worth following. It has simple graphics and the play time is quite short but is definitely worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "Great ... yes I enjoyed it!  the good: a playable story ... reallly worth to play it 2 times. the relating to old stories and faith the surreal and dream like scenario  the bad: you have to get as close as possible to the items to interact would be better if there was more content to play it 3-4 more times  the ugly: i am really not sure about the choices I've took and the cause of the game graphics is a bit tattered unclear ... which items you can interact with?",
            "review_score": "1"
        },
        {
            "review_text": "It's free.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting, short game. I think it was bugged when i played because i did everything on the achievements list and got nothing. Played twice to see what would happen with the choices at the end but wasn't anything spectacular. Overall i enjoyed playing. I would like to see what it would be like for 'other passengers'",
            "review_score": "1"
        },
        {
            "review_text": "Like a short Studio Ghibli title, its both artful and depressing!",
            "review_score": "1"
        },
        {
            "review_text": "Not gunna go hardcore on a review on a free game that already has good reviews.  My suggestion is that you dont read on the game at all, play it, and enjoy its story.  Overall, its a very great game and its free.",
            "review_score": "1"
        },
        {
            "review_text": "  A good short story, with an element of interaction with other characters.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty great game the story is a really good tale and it grips you to finish this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a short, yet emotional game. I won't spoil any of the game for you, but I would recommend this game if you don't have much time or want, as I said, a short, yet emotional game.",
            "review_score": "1"
        },
        {
            "review_text": "This Game was one i enjoyed! it's not hard at all its easy it is a life type game as i can put it..but i could be wrong but 8/10 . so enjoy the game. i beat it twice!",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of game that leaves you contemplating life by the end of the thirty minute play through, no matter which path you chose. It will make you wonder what reprocussions your actions in life have caused and whether they will come back to haunt you. Not a game to play in the dark, alone and at midnight because it will leave you contemplating your very existance until sunrise. Trust me.",
            "review_score": "1"
        },
        {
            "review_text": "Great game love the art, sad it wasn't that long of a game!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story, great atmosphere. Anything more would be a spoiler.  Give it a shot, won't take you more then half an hour or so.",
            "review_score": "1"
        },
        {
            "review_text": "nice plot, all in all pretty good for a freebie  takes 2 playthroughs to get 100% achievements, took me about an hour and I didn't rush",
            "review_score": "1"
        },
        {
            "review_text": "A free, short, and thought-provoking game. Not exactly great but definitely worth a try.",
            "review_score": "1"
        }
    ]
}