{
    "app_id": 356570,
    "name": "Party Hard",
    "release_date": "2015-08-25",
    "developer": [
        "Pinokl Games",
        "Kverta"
    ],
    "publisher": [
        "tinyBuild"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Pixel Graphics",
        "Stealth",
        "Strategy"
    ],
    "achievements": 27,
    "positive_ratings": 4700,
    "negative_ratings": 662,
    "price": 7.19,
    "description": "It's 3:00 a.m. Your neighbours are having a loud party. Stop them. Party Hard is tinyBuild's award-winning stealth strategy game about ruining parties by any means.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356570/header.jpg?t=1545402282",
    "minimum_requirements": "OS: Windows XP/7/8/10 Processor: 1.4 Ghz and up Memory: 1024 MB RAM Graphics: Integrated with 128mb of vram Storage: 1 GB available space Additional Notes: AlienFX enabled",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "No game has ever had me say, 'How?' and 'What the f**k?' more than Party Hard.   Don't get me wrong, the concept is great and the game can be fun to play. I can see why people love it, however I found the experience more annoying and frustrating than fun during my playthrough and here's why...  -The line of site is almost completely broken in this game:   Victims and cops can see you and bodies behind objects and walls that should be impossible to see. Not to mention, the game tries to balance this by making their line of sight moderately short range taking away from the fun. I think the game could be much improved with longer lines of sight and improved obstructions of said line of sight. As of now it's pretty much flipping a coin on each kill unless you're totally secluded from everything else.  -Traps and placements are randomized every time the mission starts:  Now this is actually a cool and interesting feature but I'm afraid its a double-edged sword. More than often you find yourself spawning with barely any ways to kill or distract crowds with a near to zip chance of succeeding. Of course, there's players who seek this challenge and like to pull it off. I just feel an average player with moderate skill like me is going to find themselves restarting the mission over and over until there's at least one worthy trap.  -Every other map has a totally broken trap/phone call that can clean house hands free with zero work:  This is very unfortunate because maps with traps like these tend to lack good design and are thrown in there like a cheat to skip the mission. It's mind blowing not a single victim/guard cares if your phone call brings people to the party and are obvious threats knocking people out and killing left and right.  -The police/guards make no sense at all in this game, especially considering their methods of public safety:  Upon arrival the police almost always run over people killing them instantly. I'm sure most people wouldn't write this off as a bad thing because who cares, free kills. Wrong, I think it's beyond stupid as you can't even use this feature to your advantage like luring crowds into the street and getting the cops to run them over. The swat beat everyone down if they're called but for some reason you get 'BUSTED' for being beat down like anyone else. (The people beat down aren't even arrested.) Finally, the guards... These guys beat you down just for showing up. I can understand if they're at the front door serving as a bouncer like in the second mission, but otherwise it's a dumb mechanic. How would they know if you're invited or not with all the people and partying going on.   -Horrible blame and accusation system:  I can't even state how many times I was busted for doing nothing wrong at all. If anyone at all dies near the player everyone assumes its the player and calls the cops over for an arrest. Countless times I've been walking on the brinks of the map to try ang get away from people dying and cops who are passing by will stop to arrest me for walking away like everyone else. Sometimes it's its not the cops and just random people who will call the cops for no reason. An interesting yet broken feature is the ability for victims to accuse and call cops on other victims. This leads to the most random arrests I've ever seen and it doesn't help the player's experience as it can't really be triggered on purpose similarly to police running over victims...  -Handful of small bugs that aren't 'game breaking' but result in the player's death all the time:  Typically, the cops are supposed to leave and ignore any more crimes the second they have someone over their shoulder or have bagged all the bodies but I've been arrested with people over their shoulder's twice in my time playing. Is it a feature? Possibly. It sure doesn't look like it. These police have pretty broken behavior and do random things they shouldn't more than often.  Conclusion:  Overall the game is fun yes, but success is a crap shoot and mostly RNG. When I say it's RNG I mean RNG... Going back to replay the game with end game knowledge and skill barely helps in this game. The game offers a mediocre story with TERRIBLE voice acting. The only real replay value in this game comes from the steam workshop allowing the player to download other player's missions and play them. Note, there ARE unlockable characters in this game with some really good pros but, they have horrible cons that render them useless. People say this game is a 'stealth' game but it really isn't at all.  I would recommend waiting for a sale to pick this game up. I think it's worth a playthrough but isn't an amazing game you'll be playing a lot. Heck, I'll probably forget about this game a week or so from now. I don't mean this in a bad or rude way, the game just didn't leave a memorable impact on me at all.   Side Note for Hotline Miami fans:  People compare this game to Hotline Miami all the time, but the two are nothing at all alike aside from being a masked killer who cleans house. If you're looking for a good alternative to Hotline Miami 1&amp;2, I would recommend Deadbolt and not this. Deadbolt features a 2D world with one hit kills. It provides better challenge that requires planning very much like Hotline Miami.  Final Rating: 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game. The art looks great, the concept is interesting, and when it goes right it can be a lot of fun. The problem is the enjoyment of the game is hampered by sheer randomness and the time it takes to play. Hotline Miami is fun because while it's difficult, death is cheap and it doesn't feel like a waste of time. Here your default character moves painfully slow, levels take a fair amount of time to play, and your ability to succeed hinges on what traps spawn in and how/when people walk by them.  Thus it leads to situations where you can feel like you played a level perfectly and fail due to bad luck or wind up boringly plucking people off one at a time while completing a level often isn't as satisfying as you think it would be because it came down to the happy bounce of a half dozen people walked in front of an exploding oven at the right time.  I won't fault anyone for enjoying it, but this game didn't do it for me. I typically enjoy slower paced, thinking games, but maybe I don't have the skillset for this one. It was just a bit too random to be fun and the levels take too much time to replay on failure, leading to it getting frustrating just a bit quickly for me. With one of any number of minor tweaks (bit faster movement speed, fewer people in a level, less random trap placement, etc) I think I could really recommend it, but as it is I'd have to say no thanks if I had to buy it again.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a bad game, and the earlier levels were quite enjoyable. But wasting 10mins at a time because I got spotted as I went to kill off the last few people... this isn't as enjoyable as I hoped it would be, and the 'Stealth' is mostly either standing in one corner of the map dumping corpses after people walk alone in your general area, or running away from your victims before someone spots them so you don't get blamed for the murder.  The game is well-made, and I've got 6 hours down so far. But I'm not having fun with it anymore, and in hindsight I should have read more reviews and Lets Play videos before making this purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried to enjoy this one. The art and presentation are incredible and the music is fitting although not nearly as memorable and creative as Hotline Miami. That's where all possible praise ends, as gameplay quickly devovles into a waiting game where you slowly cull a ridiculously excessive crowd while hoping the arbitrary AI coupled with the basically non-functional run button don't screw you over, forcing you to start over in a newly randomized level.   The entirety of gameplay offered here is waiting for people to separate, then walking up to tap X and back away. If you get lucky and don't get spotted - or don't get randomly designated as the killer by a cop on the other side of the map that may or may not end up being impossible to outrun - your reward is more waiting for your next faceless generic victim until you eventually wipe out the other several dozen party goers. Knife swings don't connect far too often and there are countless visual bugs and strange hitboxes. The bouncers can sometimes spot you across a room and kill you from outside of your own attack range, other times you can walk right past them or they'll miss an attack despite your sprites literally overlapping. Events and character behavior are so erratic that any possible strategy goes out the window in favour of capricious trial and error.   There are about 1-5 traps per level, often implied to be a core feature. Some are interesting but all require you to mindlessly sit on your ♥♥♥ until someone wanders close enough, netting you a grand total of one kill each and forcing you back to the idiotic knife mechanics to kill everyone else. Timed and explosive traps take so long to activate that the AI will have wandered off from the explosion.  -Good art -Decent music -Terrible story bordering on cringe worthy -Horribly amateur voices to the point where they'd be better off silent -Thoroughly unenjoyable level designs with excessive amounts of enemies -Levels that only get more repetitive and offer less room for creativity as it goes on -Idiotically designed traps -Arbitrary AI and often random, unavoidable failures -Glitches  -Even when functioning correctly, the AI of cops and guards feels very random and their methods nonsensical -The SWAT teams are even worse, as far as making any kind of sense in their actions -Very shallow mechanics with no experimentation -Even with enough patience for all the waiting you will not find a rewarding experience -Barely lines up with its own description and promised features -Boring, above all else. Don't buy it.  Rating 1/5",
            "review_score": "-1"
        },
        {
            "review_text": "A comical stealth/puzzle 2d game about a serial killer on a road trip across America, killing brodudes because reasons. Great music and lots of replayability thanks to achievements, extra characters to unlock and random elements of the levels changing each time you replay it.   It's games like this one that remind me why I fell in love with video games to begin with.",
            "review_score": "1"
        },
        {
            "review_text": "Party Hard is mix between stealth action and puzzle in which you play a serial killer going around killing off entire late night parties so he can get some sleep. I say stealth action and puzzle because while the game is real time which constitutes the stealth action part, your character is no super human and with screwups can easily be killed and arrested so you have to make use of traps, tools, isolation and your situation to either not be seen making your kills or to pin blame on others (which pinning blame on others is prolly the funnest part about the game for me)  The game has 11 stages (I do not count bus party a 'stage') all with their own backdrops and traps to use, many of the maps have variation to them so its not always 100% the same every time, even then however you'll likely proceed through a map very similarly each time. the music is atleast fitting for each stage you'll be doing your murder romp in.  Is the game worth the price? Even with its 11 stages the game will likely not last one too long, which is its only real negative to the game. Perhaps wait for a small sale. However if they added workshop support where we can make our own parties... the price would be worth it.  2/15/2016: and so workshop support is on its way, the games biggest flaw, its length is now no longer an issue, go ahead and get this game, its quite entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "This game really fun and addict. The gameplay was nice and a lot of features that also you can make a party place by yourself using editor party easily and start the kill chaos!. The story scene was great and the soundtrack really best 8 bit version. This game a lot of strategy to kill all people at the party but just dont make any see you killed someone just like be assassin. Make traps at already area, kill alone people, and use special item wisely. Btw, this game is suitable for who want to play about kill people but dont want see cruel and split body lol... xD",
            "review_score": "1"
        },
        {
            "review_text": "By no means is Party Hard a terrible game, but its balance and pacing sabotage an initially fun concept like its protagonist sabotages household appliances. The idea of playing a teen-slashing, B-movie serial killer that makes use of ridiculous traps and opportunistic kills is foundationally pretty great. The chief problem, for me, was that the number of traps and environmental kills you can employ are pretty steeply limited in each stage. By the time all those options are exhausted, you've made only a modest dent in the stock of hapless partygoers you're supposed to slaughter your way through, and the fun part is over. The inevitable next phase of the game isn't an exercise in strategy or cleverness - it's really all just about waiting after that. Waiting for someone to stumble into prime murdering position, waiting for the risk of being found with the body to elapse, waiting for police or other emergency services to leave the scene - all just so you can repetitively hack people up with the same knife in the same way. Each level has a strong start that peters out fast. Couple that with some significant bugs that can cost you an otherwise immaculately played round, and in the end, I really just can't recommend it for purchase. This was a game that started off great on the drawing board, but lacked a clear vision for how to turn that idea into game mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "Not unless it's on sale. Than it becomes a tentative yes.  For the first few hours I was having a blast and laughing one hell of a lot at the black humor. Than you discover that there's really not any more mechanics and it gets pretty boring and grindy.  -Each level you kill everyone. That is the only objective. -90% of traps in the stage can only be used once. And a lot have really short ranges that npcs never get near so you will only use them when a cop is chasing you. -Most levels boil down to picking people off one by one as they walk off by themselves. Fun for a bit, but after the 20th one it gets pretty old. And you will be doing this each mission. -Only real difference from mission to mission is the different layouts (usually with less places to murder people unseen) and a few specific traps. Feels very samey after awhile since the gameplay doesn't really get mixed up.  Honestly, I'd consider the game a really good base and just needs a lot more content to keep levels from becoming boring. Specific targets, more dynamic things you can do to try to end the party, carrying multiple items and choosing which you can bring with you (unlocking them), and so on. Really feels like a lot of missed opportunities. I really don't regret buying it since I got it pretty cheap, but I can see it not being for everyone.  And yes the miami mission was the last I played. I looked up how to beat it, just really have no interest to progress farther at this point.",
            "review_score": "-1"
        },
        {
            "review_text": "Ever wanted to murder an entry party who will not let you get some sleep? Well now you can in Party Hard from Tiny Build games. It's everything I wanted in a nice killing game. Who doesn't want to have a bear come in and help you kill people in a party?! Maybe you want to watch everyone die after drinking... Well that can happen as well! With so many events that may or may not happen you don't know what will happen next.  This doesn't include the feature to have your Twitch chat vote on what can happen in your game. This game gets two thumbs up from me! It'll be stupid to NOT buy the game.",
            "review_score": "1"
        },
        {
            "review_text": "  Be a Pixelized Serial Killer! ",
            "review_score": "1"
        },
        {
            "review_text": "If you are anything like me and are into strategy games and dark humor, then this game definitely delivers even harder than that pizza place that has a rule about getting the food to you in 30 minutes or giving you the pizza for free.  Serial Killer Simulator.. err, I mean, Party Hard is a game where you start out playing as a bloke trying to get some sleep, thus having to eliminate his partyloving neighbors. As the game progresses, you become quite the notorious killer, travelling the US to introduce avid partygoers to the blade of your knife. You also unlock additional characters to play as, each with a specific trait that defines their playstyle. In addition to using your trusty switchblade, you can also off people by setting up various traps at parties to make it look like an accident.  The different parties, traps and characters bring a nice variety to the table, although the core mechanic of the game remains the same - kill all the unsuspecting partygoers and don't get caught. The part of not being caught can be a dash tricky sometimes, which brings out the strategy part in this game. If you are looking to be knees deep in blood while flailing your matchete-equipped arms around like you're two windmills at all times, this is probably more of a Getting Arrested Simulator for you, meaning this game is probably not the best choice of entertainment for you in particular, unless you are into that sort of thing, of course. I don't judge.  If you, like me, are a sneaky dude getting a kick out of setting your party-enthusiast victims up to be trampled by a zebra or unleashing a zombie apocalypse at a beach party, step right in and grab a knife. A dark sense of humor is recommended, this game doesn't take itself seriously and doesn't encourage you to do so either. I mean, if it did, it would probably be not on Steam but in the ISIS training materials.  Party Hard does come with a handful of glitches, nothing major but be prepared for slight inconveniences or a few of 'Why did that just happen right there????????' moments. If you're anything like me though, the latter will probably be because you did dumb stuff and are too proud or blind to own up to it.  Anyway, if you're anything like me and are hopelessly procrastinating doing your school project, work or household chores, this game might be relevant to your interests.",
            "review_score": "1"
        },
        {
            "review_text": "Think Commandos meets Postal meets Hotline Miami meets Hitman. Kill off the entire party without getting spotted, and if you are, either quickly get away or change clothes (if you have 'em). Party Hard offers a gameplay that's mostly suited for those that are patient and aim for perfectionism. For the most part you cannot be impatient, as the game will surely strike your attempts down in one fell swoop. You need to survey the land, find choke points (quite literally) and exploit crowd behaviour if you want to be successful.  Party Hard is at its core a stealth game, where you have to go about various locations killing off everyone. You do this by stabbing them in the face when no one is watching, shoving people into barbeques, torture chambers or off the roof, or letting a bull go on a raging stampede through vast crowds. What tools you have at your disposal on each level is for the most part random, even though some are set pieces that will always be there. Some of the later levels -require- you to make most out of the extra equipment on the level, or otherwise you'll stand no chance.  On the negative side the game has the occasional bug, like cops getting stuck, people reappearing alive when you throw their corpses off the roof or someone spotting you through walls. If you get upset easily by cheap deaths, this will tear on your sanity. I had to reset levels as much as 10 or 15 times in a row because of random events that was out of my control. For the most part though, Party Hard delivers on the stealth aspect, and unlockable characters allows you to further expand on the premise. For instance, the ninja is hidden when standing still against a wall.  The soundtrack featured is well composed and suits the game well. The voice talent and story is complete garbage. However, you're not here for that.   You are here to Party Hard.",
            "review_score": "1"
        },
        {
            "review_text": "the game is entertaining and its creative-ish. but i have problems with it.. my main problem is that people are stupid. you can poisen some of the drink, go for a stroll and end up in another room.. BUT if a victem manage to die from the drink in the same room as you're in, people who also are in that room will blame you for it and call the cops on you...  another problem i have is that the guards, no matter if they go for alil stroll, if you try to passby them, EVEN if the placve you try to go is not restricted, they will attack you without warning.. the cops will also blame you for any murder if you're close to a body, despiteless if it is an old corpse.  i know i just mentioned my problems with the game, but thats mostly because what you see in the trailer is what you get. you walk around on parties, and kill the guests and everyone else too. it is entertaining, it is frustrating and it is fun. just mentioning the AI problems in hope for the devs to see it.  there is a story, and it is captivating, but if you've seen classic horror movies, then you're pretty much able to predict whats next. give it a try when it's on sale",
            "review_score": "1"
        },
        {
            "review_text": "A much different kind of stealth game. It's not really about remaining unseen and preventing calls to the cops, but instead more about making sure nobody knows you're the killer. You need to use traps intelligently, be patient, ambush people, hide bodies...and also flee the scene, dance, or change clothes so nobody suspects anything. What I didn't suspect was the well-voiced cutscenes in between each map detailing the story. They were a great addition to what would otherwise be a pretty fun semi-procedurally generated game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome. The variety of the levels, traps, music, graphic and story make a perfect combination. And possibility of playing levels made by players make it even better! I would love to play another episode of this.",
            "review_score": "1"
        },
        {
            "review_text": "If you a beta ♥♥♥ like me who never gets invited to the parties and hate those cool kids then this game is for you. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has an interesting concept and visual style, but it's ruined by its terrible execution of almost everything it tries for. You are required to kill every single person in every level. After you've used your paltry handful of single-use environmental kills, the game becomes a tedious exercise in slitting up one person at a time and waiting for the cops to decide that this corpse (much like the 30 previous corpses) was clearly killed by ghosts and leave.  It also has a very serious story told by conversations between a cop investigating the killings and some other guy (don't know who he is, but some not-so-subtle hints lead me to believe that it's the killer). Unfortunately, the dialogue is awash in awful cliche, and the voice acting sounds like a teenager trying to emulate Sin City's narrator.  If you want to play a pink and purple tinted pixel-art game about a murderous psychopath, play Hotline Miami instead, as it beats this game in every single respect.",
            "review_score": "-1"
        },
        {
            "review_text": "Go and literally kill a party because you can't sleep. Finally a psychopath I can relate to!  In all seriousness though, I'd queue this game for one of my GOTYs. It has fitting music and fun gameplay, though, I will have to give it a small minus because it reuses certain traps over and over again, even if they don't really fit into the scenario (Why are there bubble gum machines everywhere?), which, thankfully, the game makes up with a large variety of different levels and level-themes.  Even as someone that isn't a big fan of pixel graphics, I did enjoy them in this game since they were usually clean, spot-on and somewhat high-res.  The story has a nice twist, though, it's mostly just giving you a bit of back-story to what you're doing. Unfortunately, none of the events in said back-story have any affect on how the game plays out. (The police doesn't start re-inforcing parties in which 40 people have already been killed, the game tells you about vigilante-mobs roaming the streets and taking the problems into their own hands, though, you'll never meet one of them. Neither does the story ever crack down on the laziness the police officers seem to have.)  Party Hard also features several characters which you can unlock   , which, as the game says, you get through getting achievements, for example completing the game  . They're obviously supposed to get some replayability into the game, though, unfortunately, one of the characters I unlocked was only usable in a single mission and the other was somewhat useless, since it was broken to a certain point. (  By disabling the ability to interact with most objects, you're unable to go into areas such as the pool, therefore,   you couldn't access certain areas). But even if you don't have problems with that, there's still the issue of replaying the same levels you had already visited again, in the exact same state   By the way, without the ability to interact with most objects... Good ♥♥♥♥ing luck beating miami party lol)  ",
            "review_score": "1"
        },
        {
            "review_text": " Party Hard is an interesting, silly, and  cheap  game. It is a lot of fun if you enjoy murdering people, you psychopath.",
            "review_score": "1"
        },
        {
            "review_text": "The only reason i got this time in the first place is because of the description. 'it's 3am, your neighbors are having a party, kill them' i have neighbors like this in the real world so i thought i would give it a try. 5 hours later I am still killing people. However dont let the name of the game fool you. there is a stealth element to this game. if you get caught by the bouncers or by the cops you have to redo the entire level! i cant tell you how many times i have to redo a level with only 5 people left to kill. also there is no learning curve. it is 'here kill these 4 people, nice job! now kill 47 people, use traps, dont get caught, and party hard!'",
            "review_score": "1"
        },
        {
            "review_text": "got all achievements from the game before hidden achievement still has the get all achievements achievement 11/10",
            "review_score": "1"
        },
        {
            "review_text": "&gt;start dancing at a party &gt;impress a girl with my moves &gt;she falls in love with me &gt;i start killing a few people &gt;she sees me do it &gt;she doesn't tell the cop &gt;i go kill some more &gt;just me and her left at the party now &gt;one last dance before i stab her in romantic fashion &gt;i go home and play some Party Hard  10/10",
            "review_score": "1"
        },
        {
            "review_text": "You sneak around and find interesting ways to kill people. Its like that old game where you played as a ghost and used the objects around the house to scare people, but instead of scaring them you're making their children orphans.",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun game when you just really want to go and massacre an entire party but just too lazy to get off your ♥♥♥ and go to and actual party and massacre everyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Just brilliant :)  The dev also adds new levels it seems. Suberb!  Definitly worth its price!",
            "review_score": "1"
        },
        {
            "review_text": "Overall this game is good. Probably a 6 or 7 out of 10. I have not played it with twitch, but I suppose what it says it does is novel. I would not say it's worth buying at full price. If it's on sale, pick it up. It'll give you a dozen or so hours of fun.  Pros: Simple gameplay.  Can be addicting.  Awesome Music 80's Aesthetics and Pop Culture Characters  Cut scenes are pretty cool (minus the voice acting).   Cons: Biggest issue is that it's not polished enough. Difficult to know what blocks NPC's sight. Some windows they can see through, some they can't? There are a few different versions of each map, which makes things a bit random. Sometimes item graphic doesn't show up on screen, so the only way you know if something is there is by noticing the commands in the lower right screen. Somewhat short. Played through with the first character in 10 hours. Achievements aren't clear how they activate. Levels are small. Only fit on the screen. Voice acting is horrible.",
            "review_score": "1"
        },
        {
            "review_text": "hotline miami meets where's waldo",
            "review_score": "1"
        },
        {
            "review_text": "It is HARD",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Keeps getting features added, and lots of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome i love games like that good music and simple retro graphic :DD",
            "review_score": "1"
        },
        {
            "review_text": "Kill, dispose of body, rinse and repeat. Pretty darn fun",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious and amusing, something of the voice over reminds me of an old National Lampoon Brian Doyle Murray Gonzo journalist parody. Not sure why Miami has a Hungarian Flag on it, it isn't Cleavland. Very well done on the whole. Sort of retro-city rampage feel to it.",
            "review_score": "1"
        },
        {
            "review_text": "Very zen! It was oddly relaxing waiting to pounce on your next victim.   Gripes:  -Fustrating to start the entire level all over again especially when you spent 15 minutes and almost down to the last several people.  -I swear people from the other side of the map 'saw' me killing in most of the one 'room' maps (like beach party) thus ending a great run. -Story is flimsy, but love the motive. -I wish there was a better indicator of who saw you. -BOUNCERS. -Your character is not exactly fit aka the sprint meter fades pretty quickly. - and the biggest gripe, you have to learn the hard way of what traps and events do. Most of them accidently resulting in your death.  Overall, with the gripes, it was a relaxing experience. This is definately a game that tests your paitence and rewards a perfect opportunity and a quick knife. Would love to see a speed run of this.",
            "review_score": "1"
        },
        {
            "review_text": "A stealth game with clunky controls, broken line-of-sight, a useless main attack, ineffective and sparse traps, indistinct visuals, psychic guard AI, and make-or-break RNG.   A nice idea in theory but utterly dreadful execution. The only winning strategy is to hide in an empty room and wait for people to come by so you can pick them off one-by-one. You have no real influence over their decisions, so you can be standing there for whole minutes at a time with nothing to do. Even once a character enters, killing them isn't as easy as it sounds, since your main attack only extends horizontally, and has about a five-pixel range at best. It's like watching paint dry and eventually it's hard not to get bored and leave, even though leaving means certain death at the hands of the clunky controls, psychic cops, and one-use-only escape mechanisms.  Finally, to top it all off, the slow movement speed and slug-like pace makes restarting a level a tedious frustration.  Overhyped and utterly overpriced - it's a game that's more enjoyable when you're watching a streamer play it and get frustrated than when you're the one actually playing it.",
            "review_score": "-1"
        },
        {
            "review_text": " tl;dr -&gt; If you ever have some serial killer urges, please play this game instead to avoid jail time.   I received a review copy of this game and was very excited to play it because I had seen many gameplay videos showcasing an element I love – crazy, mindless mass murdering. I was extremely pleased with my gameplay experience.  If you enjoy mindless violence, creative executions, serial killing, and retro pixel graphics, then you will enjoy this game.  The aesthetics are good – the amount of detail in the character models and everything in the game world is very high. The sound effects are good, and the music for each level is great; however, in certain levels the part where the track loops is quite obvious. The music helps to project a very retro-like atmosphere and feel. The story is decent, however, I personally find the voice-acting to be a bit sub-par (although there definitely is a certain charm behind each voice).  Controls are simple and easy to familiarize yourself with, however, I strongly recommend using a controller to play. There isn’t really a tutorial, and in-game tips are provided via newspapers that you can read. This aspect could have been handled better, however, because the newspaper tips are randomized. An important thing to note is that “restarting” a level is a literal restart – everything in the level restarts from the beginning. The game has a very heavy RNG (random-number generator) element, however, restarting prevents the RNG from coming in. For example, if a stun bomb is located in a nearby item case, restarting will always cause a stun bomb to be located within (while dying/getting busted and restarting will randomize everything again). The learning curve is minimal to moderate depending on your patience (you will need a lot) and planning skill. Do not be surprised if you have to replay a level hundreds of times – I had quite the rage-fest when I had 50/51 people murdered and got arrested by police before I completed the level (this happened a handful of times to me already). The most challenging element of the game is probably accounting for the RNG that affects everything.  Gameplay consists of you killing everyone in a level so that you can go back to sleep. Your standard killing technique is a knife attack, however, the environment always offers a variety of other methods. For example, in some levels you can push people off the side of the rooftop, electrify a dance floor, or push someone into a ventilation fan. Disposing of dead bodies (via rooftops, garbage dumpsters, etc) is critical because people will panic from seeing corpses and will run around (breaking any route patterns) and/or call police.  If police are called in, an officer will arrive and body bag any corpses – an arrest attempt will occur if you have been spotted by a civilian. You can run away from police, but you have a very limited sprint bar – and police have faster walking speed than you. Preparing traps can kill police, however, they can still be set off by you or other civilians. Some levels have travel points (doors, slides, etc) that you can use to quickly dodge police, however, doing so when you are being chased will cause a Mario-like person to arrive and barricade certain points (use these as a last resort). Sometimes, police can arrest the wrong person, keeping things entertaining.  Maintaining stealth makes the game a lot easier, and a great starting tactic is to dispose of any sleeping people first – you can carry them and throw them off roofs, for example. Interestingly, carrying people does not alert anyone, nor does throwing them off roofs (or into other environmental hazards) in front of others. There is a button/key that shows you all the environmental objects you can interact with – and another useful thing it grants is an indicator on any people that can “see” you. This is great for gauging who will react if you kill someone.  You can make a single call per level, and this will summon a random NPC to the scene. Sometimes I’ve had a Jason-Chainsaw-like person arrive, who proceeded to kill a few people before being arrested. I’ve also had a pizza man arrive – dropping a pizza that attracts a lot of civilians. NPCs can also randomly arrive to the area, and I’ve had a party of civilians show up – much to my dismay because that meant more people to kill.  There are item cases in many of the levels, and sometimes a black market dealer will come and offer you a free item. Items include a stun grenade, dynamite, and (my favorite) a smoke grenade. When using the smoke grenade, you are granted invisibility in a small radius – my favorite tactic is to smoke a dense area and kill as many civilians as possible before the smoke dissipates.  To keep things interesting, there are unlockable characters. I have unlocked the Jason-like character, and selecting him starts me off with a powerful chainsaw.  After playing for a few hours, I realized a very, very efficient way to kill a lot of civilians is to camp near a telephone (or a chokepoint leading to one) and to just kill everyone that tries to pass by/call police. This is not as effective when you have not cleared certain areas of a level – like one that has a second phone. Doing this can allow you to chain massive score combos. Achievement hunters will have an exciting time trying to 100% this game.  Overall, the gameplay is lots of fun and very entertaining – especially with the variety of RNG events. Levels can be frustrating when you are so close to completion, but get busted for whatever reason, however, once you actually overcome these you will be happy for your achievement. The RNG elements and unlockable characters add great replayability. Anyone interested in mindless massacres should definitely give this game a try.  Highly recommend!  Cheers, DJSF  @DJSF's Rogue Reviews    My Website  [theroguereviews.com] ",
            "review_score": "1"
        },
        {
            "review_text": "This game happens if you try to make a slow and extremely boring version of Hotline Miami. Sure you do basically the same in Hotline Miami, but how they designed the games it so boring and slow. I have nothing against a slow game, but a game that requires to finish a map in one run, no, this isn't fun at all. And the maps take so much time, which makes it even more frustrating if you just need to kill 5 or less enemies and you have to repeat the whole level again because somenoe at the end of the room called the police. And the music, you can't even call it music, just a loop of a boring and unsexy beat.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't have much prior knowledge of the game on purchase, so I generally went with the notion it's a stealth arcade killer. Party Hard is basically a mixed twist of features, both good and bad. There is also a story, of sorts, which throws a few surprises your way which have no impact on the gameplay, other than to provide a shaky narrative to connect different mass murders with each other. Overall, it's a fun diversion for a few hours, but despite the replayability factors, it's not polished, memorable or a game I'd expect myself returning to at a later date.  THE POSITIVE:  + The game can be challenging despite it's simple appearance and gameplay. + The game will definitely keep you on your toes on your initial playthrough due to the amount of unexpected random events and occurences. + Easy to understand core mechanics and get into the game after the initial tutorial level. + Despite the seemingly simple premise of letting yourself loose upon an unsuspecting crowd, the game does take some tact and planning to complete most of the levels, barring the fortunate accident in which all the random resources scattered about the map provide enough coverage to wipe out all the party-goers. + Level Editor for player made content, providing more bang for the buck. + Apparently Twitch compatibility, but I am not an user so I can't really say much about that.  The Negative:  - Basically, the AI is a dunce. As some have already mentioned, corpse pickups don't respond to player mayhem in any way and you can literally toss people off roofs or chuck them into barbeques or rotating steel fans without anyone so much as batting an eye. The parties will keep on going despite the player leaving a trail of bodies in their wake, and sometime the only response the player's actions elicit from the locals is 'Can't someone clean this up, this is killing my party buzz?' - The techno soundtrack might not be everybody's cup of tea. I personally found myself toning down the music since it got to be a nuisance in prolonged maps. - The player characters all run like they had lead weights on. This is to counteract the law enforcement game of tag the player faces if they happen to be caught redhanded in their wanton carnage. Basically, fleeing from the police is impossible, other than abusing the pathfinding by putting as many turns between yourself and the boys in blue as possible or taking one of the shortcuts in the maps, which brings me to the next item... - The shortcuts, for some miraculous reason are always expended if you're being chased by law enforcement officers while you take them. A Mario expy will pop out and hammer them out of commission, depriving you their use for the rest of the mission. Granted, this is more a nuisance rather than a real shot in the leg- if you're already doing horribly, you're liable to restart anyway. - At the time of playing, I encountered several bugs ranging from broken features to cosmetic glithes to a random slow-down.",
            "review_score": "-1"
        },
        {
            "review_text": "Relentless Murdering. Perfect for young ones",
            "review_score": "1"
        },
        {
            "review_text": "Psycho Trainer is an AMAZING person killing simulator! No really. This is what Hatred should have been, only with more realistic/gory graphics.  Best $10 game on Steam if you hate The General Public.",
            "review_score": "1"
        },
        {
            "review_text": "Funny little game of chaos. Murder unsuspecting party goers and trash everything in your path! Part stealth, part action, I was impressed in many ways",
            "review_score": "1"
        },
        {
            "review_text": "Do you remember the good old times when you could murder your neighbor because of his loud party and no hookers to your house? This times are back. Now with traps, guns, a zoo and the classical knife on throat",
            "review_score": "1"
        },
        {
            "review_text": "Totally addictive, worth every cent. Simple mechanics, works well with controllers and great for a casual game.",
            "review_score": "1"
        },
        {
            "review_text": "If you wanted to compare this to another game, think of it like a fusion of Hotline Miami and Hitman.   It's enjoyable to play, with a satisfying graphical style that I really like. Games like this can easily resort to frustrating controls and repetitiveness to try and qualify for 'challenging gameplay' but Party Hard keeps things simple and lets you approach each level how you want, with map secrets and hidden weapons adding in variation. The randomisation in the world keeps things fresh when replaying.  I feel like a lot of work has been put into this title, and yet it has been priced very affordably.",
            "review_score": "1"
        },
        {
            "review_text": "Some games I buy and play a little bit. Some games I've bought and still haven't played.  I got this game during the winter sale and put about 17 hours into it over 2 days. Even when I would fail repeatedly it was still fun. Worth it even if it's not on sale.",
            "review_score": "1"
        },
        {
            "review_text": "First few levels are full of guilty pleasure and amusing interactions. Later levels increase the difficulty by removing options and sadly, that also removes some of the fun. Still, I couldn't resist staying up late to finish it. And it looks like finishing it unlocks a new character to play through with - one with new passive tradeoffs that may change the playstyle for another pass. And it would appear there are several such future character unlocks too. I may have to play through a few more times. So yes, it is worth the price of a movie. :)",
            "review_score": "1"
        },
        {
            "review_text": "I'm an introvert who doesn't fit well in loud parties and is frequently kept awake past midnight by the loud party happening in his extroverted little brother's room next door, this game is an immersive ecstacy that fulfills my fantasy.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive game!",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that speaks to me on an emotional level. No but seriously I've been playing this game as much as I can between work and am loving every minute of it. Definitely would recommend this game to anyone who likes that sort of strategy stealth approach in games!",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME! should win the prize! Easy control but hard mission AND random map in every mission!  some event r so amzaing i even can have a nice zombie party!(although i kill them all at the end of that 'party') cant be wait for new update , YOU really really need to play this game if u want some challenge and KILL some people with 80s electronic music as back music. Remember , you need sleep ,those party animal really really ♥♥♥♥ you off , SHOW NO MERCY ,KILL them by any ways !!!! 杀杀杀杀！为了良好的睡眠！上啊！失眠少年！",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever found yourself trying to sleep whilst your obnoxious housemate hosts, what seems like, the loudest party ever? Banged on the wall, screamed and smiled with satisfaction as the volume drops? Imagine taking this impulse even further and murdering each and every attendee. This is Party Hard. A pixel art, murderous puzzler where the party may last just a little too long.  Party Hard follows the story of a sadistic, serial killer attending gatherings across the country with the intent of being the last one standing. Whereas this is usually achieved with the consumption of energy drinks, Party Hard pursues a slightly more savage approach. You play as Darius who grows frustrated by a local party preventing his nightly routine. Armed with a small knife, Darius ignores the standard protocol of calling the police and systematically slaughters everyone from the bouncers to the DJ.  The narrative focuses on Darius’s increasing bloodlust, as he travels between parties, leaving a trail of bodies behind. Detective John West, who leads the investigation, has his own motivation for catching the perpetrator as his own daughter suffered at the hands of the maniac at the first party. The story gives context to the party locations and circumstances surrounding them. You are only treated to these small cinematic scenes during loading times though as participating in these massacres are why you will be playing Party Hard.  The first level is a standard, college party seen in teen films. Shady characters smoke around a bonfire, lightweights fall asleep in the bathroom and raunchy adolescents fondle around the side of the house. Approaching the party, you have a challenging task ahead of you as fifty or more people could be attending the rave. Killing these party-goers is as simple as pressing a button to quickly stab them. The obstacle is the witnesses. Armed with a small amount of stamina, chasing potential spectators can be impossible and soon, after a call to the law enforcement, a cop has a warrant for your arrest. Evading the pursuing policeman is an option, however, each time you allude them, they will return faster and more determined than before. Being spotted is not the most effective method to stop the party so you can either eliminate victims out of eyeshot or use other tools available to you.  Although the structure of the level remains the same, the activity within them will change each time. Aside from the numbers attending the affair, entire rooms can transform too. What was once a lounge room could become a meth lab. A group of dancers could be replaced by a drug deal which ultimately is raided by armed SWAT officers who assist you in reducing the number of victims. This diversity and unpredictability will have you adapting to your surroundings.  Regardless of the layout, the objective remains the same. Kill everyone. The ever-changing level will assist you with this perverse goal. A punch bowl can be poisoned, a gas canister ignited or you can even lure an advancing cop into a deadly bear trap. Utilizing these lethal weapons will drastically reduce the popularity of the party and as the numbers plummet, the level becomes increasingly tense.  As you reach the last dozen, opportunities are harder to come by. Thankfully, you are blessed with terrible dance moves so offensive, others will walk away from you shouting profanities behind them. Be careful though as annoying them too much may result in them beating you unconscious. As you stop the party with the exceptionally gruesome death of the DJ, you ironically dance alone like a maniac on the dance floor.  As you progress through the game, you visit a number of exotic locations and parties. Penthouse suites, executive yachts and even a party bus. Each has a brilliant soundtrack, which although on a loop, never outstayed its welcome. Each stage retains the random ethos with new haphazard such as wood-chippers, dancing bears and an infestation of zombies. Each level looks significantly different but I was shocked to see that, given the fact there are only a handful of stages available, one was a direct copy of a previous mission.  Sadly, the assortments of toys to play with can become dull and repetitive. Although at first, assassinating a large group with an explosion is fun, it soon becomes protocol. The majority of the killings are accomplished by the using the boring method of picking up a sleeping drunk, moving them to a secluded spot and murdering them discretely. The biggest frustration arises when the unfair AI can see you perform this act when seemingly behind cover. A particular level took me an hour to complete simply because of these frustrations which in turn found me becoming reckless to progress past the level. Party Hard is a game of patience yet instead of the meticulous nature feeling rewarding, it just became inattentive.  When the campaign is completed and depending on your performance, new characters can become available to you. Although they have similar skill-sets to Darius, they do differ slightly. A chainsaw wielding psycho can briefly decimate a number of people in a small radius whereas the crooked cop can accuse others of being the perpetrator. More bizarre levels unlock once the story has concluded too but the same formula remains.  Party Hard begins with an exciting concept. Being influenced by gory, pixel art games such as Hotline Miami; this mature, arcade slaughter fest has a lot of potential. Unfortunately, as in real life, returning to the same bar every weekend came become predictable and uneventful which parallels the issues within Party Hard. More diversity, modes and challenges could have reinvigorated this party but it should have called time a little earlier.  Pros:   Fun Premise   Random Levels   Fun Kills   Cons:   Repetitive   Lacks Variation   Unfair AI    My Score: 7.2/10   ",
            "review_score": "1"
        },
        {
            "review_text": "One of the most entertaining games I've ever played. Could use a bit more balancing but the difficulty level and sheer ridiculousness (is that a word) of this game make it one of the best of the year. If you ever wanted to star in your own slasher flick, then this is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice simple game, short 'story', simple yet frustrating gameplay   Gameplay :  Frustrating at first because there's no in-depth explanation to the game mechanics. What does the 'listen' button do? red bar on top of the guests? how to escape from the cop? why can't i stab someone when i stand next to him/her?  This will lead to failure to complete the levels. Which makes sense after a while because Party Hard is a game with simple mechanics and short story so if the players can clear the level easily then it will not worth it to buy this game at all. It's very frustrating but after some time, you'll get a good idea as to how to play the game 'effectively' and suddenly everything will become easier (not easy, easier..because there're still some confusing things unless you google / read the guide from other users)   Audio : The sound is good, but it will become repetitive (same song playing over &amp; over again). I simply play podcast / other audio when trying to complete the remaining level because it's painful to hear same opening song over &amp; over again  Overall, Party Hard  may not seems worth it at full price , but because there are custom maps &amp; level editor(workshop), you can play it endlessly. If you're the type that looks for story then wait for price reduction because it is very short (although it's slightly interesting, not great, but okay writing).   The game may failed to communicate the gameplay but if at the end it's still a fun simple game.",
            "review_score": "1"
        },
        {
            "review_text": "not the worst game on steam, but definitely not worth the price. very disappointing. expected stealthy, hotline miami style game with tongue in cheek slasher movie humour. instead, game does not take itself seriously at all and is not fun to play. has the hotline miami 2 problem of levels being way too long but even worse considering you control the slowest, most lethargic asthmatic serial killer in the world and you can only sprint for 2 seconds but even then you're slower than anyone else who's running. this game would have been much better if it didn't stick with the whole party theme because every level is similar: a big clump of people in one location with stragglers, the strategy being sit somewhere stragglers go for no reason at all and kill people when they walk by. Bad AI leaves more to random chance than to skill or prediction, and game is very difficult, requiring you to at one point kill over fifty people in a very small area.  Also, yeah. Getting run over by cars because you're standing next to them. Funny the first time. Not when i'm one kill away and i get nudged by a headlight and all my organs implode not a terrible game, but leaves a whole lot to be desired. I'd give it a 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are looking for something like Hotline Miami, Party Hard is the best thing you can find: good music, difficulty and a lot of action.",
            "review_score": "1"
        },
        {
            "review_text": "You get to kill people at parties... Thats a win in my books...",
            "review_score": "1"
        },
        {
            "review_text": "Liked the idea but actual gameplay was slow and boring. Refunded",
            "review_score": "-1"
        },
        {
            "review_text": "Its a challenging, addicting, and overall fun game. Pros: You will not lag in it (obviously...) Fun gameplay.  Cons:  There was a bug where if I was carrying a body and somebody spotted me while a police officer was there, the body would glitch and fly in the air. You cant tamper with bodies that someone has seen.",
            "review_score": "1"
        },
        {
            "review_text": "Too simplistic and repetitive. I got bored after the first level.",
            "review_score": "-1"
        },
        {
            "review_text": "Stealth game + random AI = irritating to play",
            "review_score": "-1"
        },
        {
            "review_text": "It's a murderfest. Also you can play it one handed.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for a couple levels, but it gets frustrating after you run out of traps to set and just have to wait for people to walk into a room alone so you can kill them. And then other party people randomly grow suspicious of you (I have no idea how this is calculated) and cops will arrest you despite nobody witnessing your crimes.",
            "review_score": "-1"
        },
        {
            "review_text": "Damn good game, gets the adreline pumping when trying to hide bodies quickly with cops running around",
            "review_score": "1"
        },
        {
            "review_text": "Fun theme, mediocre game. Gameplay is basically whack-a-mole. There's little variation in kills and no tools for luring people. There's also strange logic in some places- you can throw sleepers off a building or into a fan and no one bats an eye... but if you stab someone everyone can see you through the walls somehow... I don't get why this game has so many positive reviews.",
            "review_score": "-1"
        },
        {
            "review_text": "Went to a party Stabbed Chicken Threw Chicken onto fire Everyone flees in terror at the sight of me cooking dinner  10/10 Would cook chicken again",
            "review_score": "1"
        },
        {
            "review_text": "I Love this game, its starting to consume my life. I'll end up with 10 cats who will eat my corpes once i die, because I'll never find love or leave my computer.",
            "review_score": "1"
        },
        {
            "review_text": "Failed my 400 point English research paper because i was playing this game  10/10 would fail English again.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic game! Im having a lot of fun playing it!",
            "review_score": "1"
        },
        {
            "review_text": "I'm enjoying the game, but I highly recommend getting it on sale.   While I really enjoy the concept behind the game, I feel the game isn't mechanically varied or deep enough to really give the player a rich experience.   The game provides different parties(boat, house, etc.) as slaughtering grounders for the player, but they only really differ in maybe one or two random events. For example, aside from maybe a shark washing up on the boat and eating someone, it isn't meaninfully different from the house party. Most of the gameplay can be summed up as: poisoning the punch bowl, dragging bodies in front of some object rigged to explode, and stabbing lone partiers with a knife. There are exceptions of course, but the aforementioned methods of killing people will constitute your main arsenol.  This game could have been really great if there was just more variety. Adding maybe more weapons or mechanics for the player to use would make this game significantly more interest. Sadly, every level begins to blur into one.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, Would stab again.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games. It's a simple game, but something about it incites a challenge to master it. The pixil art is done so well, and is stuffed with personallity. I always say 'Defeating a bunch of minions is mutch more fun than beating an overpowered enemy.' and I feel that this game embodies this in a fantastic way.  10/10 , would Party Harder.",
            "review_score": "1"
        },
        {
            "review_text": "great game and conept",
            "review_score": "1"
        },
        {
            "review_text": "Ugly and repetitive",
            "review_score": "-1"
        },
        {
            "review_text": "Super fun and addicting! Can't wait for the new update!",
            "review_score": "1"
        },
        {
            "review_text": "So the game started out fine but once i got to the vegas level instead of randomizing the enemy i keeping getting a club full of bouncers and swat that agro from really far away and it wont change up no matter how many times i lose die or restart the game.",
            "review_score": "1"
        },
        {
            "review_text": "Party Hard is an understatement...Excellent game for hard core gamers and casual players. Great simple graphics. Easy to learn controls and game machanics. No two play throughs will be the same do to changing of traps and the number of people that one has to kill. If your looking for a game to kill time playing this is it.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best computer games I've ever played. I literally sat down all day and played this game! It is addicting and super fun! There are a lot of levels to this game and you use stragedy to beat the game. To keep it simple and short, you have to walk around the room slashing people's heads without getting caught by the po-po or the civilians around you. If you get caught the whole game starts all over. You can also hide the bodies and use items around you to kill people. I am so glad I discovered this game! Awaiting for Party Hard 2!!!! Game devolpers, please create Party Hard 2!!",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't sure at first about this game. You know, the videos focused more on detailing the story and not the gameplay. However, I decided that perhaps it was worth trying... AND IT TOTALLY WAS! Amazing game!! The controls are pretty easy to learn, and so are the dynamics. In theory, what you have to do is: pick a party, kill everyone, and avoid getting caught. Simple, right? But, did I mention that all the partygoers act randomly, and sometimes, may even turn into zombies?! Yeah! It's pretty random, and amazing! If you're lucky enough, you may even encounter a dancing bear, another serial killer, Hulk Hogan, aliens, and a powerful sharknado! Give it a try! You won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "This game...  This GAME....  I'm still trying to figure out if I'm a psychopath or just enjoy the game. I mean, I giggle at the kills... My wife is worried, my children are terrified and the dog hid the cookware. I masturbated to the thought of dirty socks and bloody tampons today, and still, this game gave me thrills beyond belief.  If you like a simple slasher where some creativity is needed, and a sick twisted mindset is what you have... then you'll love my Prairie Oysters. Those things with a little bit of ketchup will brighten up your day!  I recommend this game to anyone who has ever had trouble dealing with a bouncer in the past!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for  killing  time. Much more challenging than it appears on first inspection. Looking forward to seeing what the devs have up their sleeves down the road.",
            "review_score": "1"
        },
        {
            "review_text": "As Jona Lewi would say: You will always find him in the kitchen at parties.  While the cutscenes are just terrible the gameplay is pretty hilarious, you have to kill the party but never quite know what strange events will unfold once you start sabotaging.   Just take note that controls can occasionally lock up and prevent object interaction, restarting the level usually fixes this. Its not a big deal but every so often you notice it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, Would stab again.",
            "review_score": "1"
        },
        {
            "review_text": "MAH BOY THIS IS THE BEST GAME EVA",
            "review_score": "1"
        },
        {
            "review_text": "Just bat ♥♥♥♥ crazy and I like Party Hard for it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game but the only part it gets hard and it makes you want to rage quit and freak the ♥♥♥♥ out but the game still is fun and you should get it and give this comment a thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "what the ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Though it's not as ridiculous as the trailer says, but still get lots of fun to stab peolpe without any mercy. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "I walked onto the beach as a woman, got gang-beat on the dancefloor by other women for no discernable reason, then arrested.   Yeah, it has issues. It wants to be clever, making you think you are a sly killer in a crowd, but it still falls back on the old tropes of 'stay away from this type of enemy or you will die immediately.' Also, the RNG as far as spawns and items go make it incredibly frustrating at times. It makes it more of a rush to kill as many people as you can and hope you get lucky rather than strategically planning out every move, especially in the later levels. It tries so hard to be unique, yet the generic elements are still there to hold it back somewhat.  Regardless, the theme, soundtrack, visuals, and little nuances here and there make it an exceptional game.  Also, I hate people that interrupt my sleep, so this speaks to me on a spiritual level.",
            "review_score": "1"
        },
        {
            "review_text": "what the ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game. It's like hotline miami, only more stealth and a more arcade like feel.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so much.",
            "review_score": "1"
        },
        {
            "review_text": "Kept me entertained for this many hours, but I think thats about it.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, wouldn't buy unless discounted.",
            "review_score": "1"
        },
        {
            "review_text": "Tis a silly fun game.... I love it ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, I've had fun. But it's too expensive at the current price, repetitive, and frustratingly difficult.  I like the concept, and I don't regret having bought it on a sale, but I wouldn't pay more than $5 for this one.   If there's a sale on when you read this, BUY THE GAME! It's a great way to kill a couple hours, nice homage to slasher films, and I'm looking forward to seeing a sequel or remake that really uses the concept to full potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game! It really has an interesting gameplay and not a too bad story, however the gameplay gets a bit tidious at times however the good soundtrack really makes up for that! 9/11 would stab again",
            "review_score": "1"
        },
        {
            "review_text": "It's OK, but very short i have it done in nearly 1,5h. good fun for inbetween, but not for longtime fun and absolut not worth more then 2 bucks.  clunky controlls, low story and game is medium.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a slasher movie fan, I like stealth games, and I'm an introvert that has frequently wished death upon obnoxious people whose whole personality revolves around partying/drinking/smoking. Although I like the game's theme and morbid sense of humor, the gameplay is just too repetitive. In each level, you'll stealthily kill those that you can, use up your traps at opportune moments, and then spend the last 10-15 minutes listening to the background music's 60 second loop run over and over until the last 20 or so people decide to split up enough for you to be able to off them one by one. This formula felt stale by the third level.",
            "review_score": "-1"
        },
        {
            "review_text": "very little variation between levels!! very few different ways of completing a level!! every level starts with you setting off a few traps before slowly stabbing everyone else!! there are occassionally poisons / other equipments to be found on levels but they aren't even that interesting!! random ai pathing leads to lack of ability to pull off wacky stunts that were planned ahead of time!! the game is certainly long enough but it fails to entertain the likes of myself!!",
            "review_score": "-1"
        },
        {
            "review_text": "No wonder it's called Party HARD! This game is hard, quite enjoyable. :D",
            "review_score": "1"
        },
        {
            "review_text": "It's so simplistic and conduluted that it's not worth the time or money to play. It has a fun premise but with little delivery. Each level is supposed to be like a scene from Hitman, except your goal is to kill everyone off in order to beat the level. None of the mechanics are explained up front and while this sounds kinda fun for a puzzle game that doesn't work when I don't know the rules. What sets people off and why the cops chase who they do is super confusing. Plus most of the levels are designed to be a waste of time and take way too long to complete. Since each level is randomized, it's nigh impossible to even know how long the trudge is going to take. Don't waste your money, there's more fun to had elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "A fantastic game of patience!",
            "review_score": "1"
        },
        {
            "review_text": "MEH it could be an actual good game and not crap but well...not my fault. i would like to know why the bouncers know your a murderor and NOT ANYONE ELSE. i was on the 6th or 7th level and a poliece officer put a body in a body bag and he saw me walk out of a room and, so he was like hey f*ck it and arrested me for no reason except for all of the people i have KILLED IN COLD BLOOD.  how the f*ck do you expect me to complete the game when i cant get past the Miami Beach level. When ever i go to stab the zombie in front of me i somehow extend my arm like 10 feet and stab some random person and how does a random zombie target me from across the map.",
            "review_score": "-1"
        },
        {
            "review_text": "... 10/10 ...",
            "review_score": "1"
        },
        {
            "review_text": "Get it, its adictive....",
            "review_score": "1"
        },
        {
            "review_text": "Hotline Miami wanna be  You will restart the level over and over as it generates mass murdering traps randomly, otherwise you'll have to wait for every single victim (about 50-100 victims per level) to be alone and to stab them. Not really fun",
            "review_score": "-1"
        },
        {
            "review_text": "Party Hard is a pretty bad stealth murder game. The concept itself is solid if rather twisted. The neighbors are having a loud party and you simply have to murder everyone to have some peace and quite.  Overall the pixel art is decent and the levels often have a lot of cool details. The human sprites look pretty bad, however. The game also has an annoying soundtrack and some of the worst voiceacting I have ever heard.  The gameplay is rather tedious and repetitive. Using the few traps on each level is fun enough, but usually you can only finish off a few of your targets that way. After that you are stuck either waiting out for single targets to leave groups or going on short murder sprees and then hiding from the cops that arrive to the scene.  This is where the game really falls apart. The police act extremely randomly, sometimes they give up the chase just as they are about to catch you, other times they will keep chasing you even when they should have no idea where you are hiding. Everytime you get caught you need to start the level from the beginning and this gets tedious extremely fast. After a few levels I simply decided to give up, as I didn't find this kind of gameplay enjoyable at all.  Party Hard was a good idea but the execution leaves a lot to be desired. Not recommended.  The good: - Good concept - Levels have some cool details and traps  The bad: - Relies too much on luck and repetition - Tedious gameplay - Annoying soundtrack - Extremely bad voice acting",
            "review_score": "-1"
        },
        {
            "review_text": "I Like This Game  Cant Explain Much Cuz Im Bad At Talking in Eng  But The Game Crashes Alote Of Times When You Play Workshop Maps Is It Fixeable?",
            "review_score": "1"
        },
        {
            "review_text": "I want my money back. Gameplay is horrible. The game bugs out on EVERY level and winning is purely luck based. It doesnt matter how carefully you line up kills or how well you play, the rng on each level puts people in places that make it impossible to kill them, so you have to die and reload over and over again. Do not buy this game unless you like failing for no reason over and over again after you have played through 90% of the level because of how they coded NPC movement and positioning. Will never buy anything from these makers again.",
            "review_score": "-1"
        },
        {
            "review_text": "This is such a degenerate game. I thought, that there are several objects that could be utilized to disable the 'party' Not running around like a psychopathic murderer on a killing spree.",
            "review_score": "-1"
        },
        {
            "review_text": "Overpriced.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so much fun. You will never play the same party twice and the variety is just amazing. The music is killer too!",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. Murdering an entire party in various ways while remaining stealthy and undetected is morbidly entertaining. The integration with Twitch, allowing your viewers to vote on random happenings is hilarious and unique, and keeps things interesting. I also immensely enjoy the fact that the game utilizes the lighting of my Alienware keyboard, blinking colors to the music and flashing red when I stab someone to death.",
            "review_score": "1"
        },
        {
            "review_text": "It's a one trick pony but the trick is VERY entertaining. When you unlock the other characters it changes up the mechanics a little. The game is hard at first, but when you learn what you are doing it becomes a little more managable. You'll love it when a plan comes together. I recommend at full price. I've gotten more than 12 hours of entertainment from this at the time of review, that was money well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little strategy game. Party Hard is cashing off the Hotline Miami craze but it's unique. I don't have many gripes. My biggest complaint is the music becomes obnoxious and I muted it, other than that it's a bunch of fun and hours of replayablilty.",
            "review_score": "1"
        },
        {
            "review_text": "Great pixel art, great music. So damn frustrating in a good way sometimes... Great mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with a surprisingly nice story behind it. A bit short maybe, but the high difficulty will keep the player occupied for quite some time before reaching the credits.",
            "review_score": "1"
        },
        {
            "review_text": "not a bad game if u like a bit of party killing stealth game though theres moments where the scenery is a bit shakey on as in it looks like u can go through it but in actual fact its a blocked passage. another negative is i guess the lack of instructions on how certain things work unless u look at the controls options and remember them in your head. but despite that and its questionable bit of terrain i don't have too much of a qualm in playing more of this game as its slow pace and making plans on who and when to kill a party goer is pretty fun...a bit of a big stretch for the word slow pace as speed running does not feel intuitive to the game at all and everything you do is limited by how many traps you can use and how best to maximise that to the full effect. this is not a game i would say is an easy win win game for most as it is slow compared to other games which can be fun for some or forget it kind of game for others. i mean on average my completion times are at around 17 minutes. im sure that that is pretty slow compared to others but each time you spawn the map the traps are different or the items might not appear or be quite random just like the phone call you make....in one map i had pest control and on restarting the same map i had a chainsaw psycho running around killing people and on the third attempt i had a merchant who sold me bombs. jolly good fun and frustration but when you finally take out the dj it just feels satisfying to have made it all the way to the end even if there are no quick saves during the game aside from after you complete the objective on the current scenario. really would love to see more being added to the game even a track or two more to each tile as the music is nice but theres moments where ull end up ignoring it as its being repeating for the 5th time.",
            "review_score": "1"
        },
        {
            "review_text": "has to be one of my top 10 games of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Play this game is fun and challenging. Some may get frustrated with trying to complete the levels but they are slightly different each time so you would usually play till you get a break. LOADS OF FUN!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very Wonderful game! In the vein of Hotline Miami but totally different. Takes a few hours to beat but completely awesome.  Hope to see more levels in the near future, or a level editor!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game. Too bad it will constantly do something silly that force me into having to reboot my Mac. It will become slower and slower, until it stops at the next round's loading screen, spinning beach ball and reboot. It will kill my mouse on exit, i.e. can still click but can't move the pointer, so reboot. The list continues. Sucks.",
            "review_score": "1"
        },
        {
            "review_text": "Has it been one of those days where you just want to kill everything in site, but you'd get in trouble...  Hey, here is a game that is seriously about killing everybody, without getting caught. Some levels are surpringly hard some of the achievments are like 'why?'   but this game is really fun.  And when you're craving blood, this game is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the story of this game being horrifyingly terrorist like, it is extremely fun. I found myself playing it far longer than I planed. With unlockable characters and over 10 levels to play, there's plenty to do. The NPC's say funny things, the animations are great, and the music is very catchy (even though it will get repetitive when trying to clear a level for 20 minutes). The graphics are a breath of fresh air in the over used 8-bit style. My only (and very small) gripe is the voice acting of the story cutscenes. It's pure trash. Which is a shame, because the animations and pictures durring cutscenses are great! I would have much rathered them leave the spoken words as text only - it's already subtitled. Thankfully they only last about a minute or two.   I highly recomend this game, if for at least, a time killer.",
            "review_score": "1"
        },
        {
            "review_text": "sociopath trainer 2016",
            "review_score": "1"
        },
        {
            "review_text": "Fun strategy/stealth game. Around 20 levels (with some random variations) and 5 characters to play through each at the moment and workshop to come.",
            "review_score": "1"
        },
        {
            "review_text": "It's more frustrating than fun, but the worst part is that it fails to live up to its potential. The concept, music and aesthetic are all awesome, but the gameplay is incredibly tedious, and a lot of the time it relies on random chance more than skill.  This game is too punishing - if you slip up, you'll get busted/killed and have to restart the level, losing up to 10 minutes of progress. Sometimes you can evade or kill the cops/bouncers that chase you, but often there's nothing you can do about it.   The worst part is how slowly your character moves. At best you can sprint at the same speed as a drunk person, but you will quickly get tired and they will outrun you. Combine this with often getting stuck on bits of the level and you will find yourself wanting to throw your controller through your screen.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting game :)",
            "review_score": "1"
        },
        {
            "review_text": "My under-carriage lights strobe everytime i boot up the game 10/10 Immediately",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun. You will never play the same party twice and the variety is just amazing. The music is killer too!",
            "review_score": "1"
        },
        {
            "review_text": "Party Hard is an awesome strategy game, and is also great for people who want to slaughter a bunch of other people. The voices remind me of film noir (If that's good or bad, I'll leave that up to you), and the amount of gameplay is endless because of the Steam workshop! (So don't fret if you get through the main story quickly, the amount of gameplay is worth the cost.) It's tricky sometimes, but you get that rush of achievement everytime you beat a level that you got caught at a few times too many. And it's fun to see how much you can get away with before the other guests notice. Great game that I've gotten my friends into as well and we can't stop playing!",
            "review_score": "1"
        },
        {
            "review_text": "This game turned up at a hard time in my life, and just the premise was theraputic in nature. I thoroughly enjoyed the premise for how it partially related to me with roommates that partied far too often and far too hard. It was by far the best relaxant I could have ever came into. This game is fully and totally cunning all about thinking how your next move will affect your next kill while avoiding those pesky waiters and bouncers. Every level has its own fun and unique little quirks, except Miami. Miami can go bugger off.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, good mix of stealth and all out bloodshed. Humour is on point with some great artwork. Soundtrack starts off pumping but each track is a short loop so can get repetitve.  Now what about a Co-Op mode??",
            "review_score": "1"
        },
        {
            "review_text": "Throw a drunk off a building. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Also great.",
            "review_score": "1"
        },
        {
            "review_text": "Party Hard is a strange indie gem that is more of a methodical and evenly paced dark twisted relative of Hotline Miami, with stealth and it's dark sense of humour adding to the majority of it's charm. The storyline is based around it's slasher-film-esque main character, who simply wants to get some rest, but as his acts of violence escalate, so does his story. Taking alot of inspiration from previously mentioned slasher films from the 80s, with elements of The Guest (synth music and murderous vibes) and murder methods dreamt up from something you'd read in Tyler, The Creator's early lyrics, Party Hard is a great time killer, as well as a great party killer.  The game has some issues too, but these are minor. The bugs are mainly in the achievement section of the game, the final achievement will unlock itself at a random part of the game, and the Engineer achievement no longer works on the Party Bus level, so instead, I recommend completing the game first, and going back to the first level in the Cop uniform and completing that 3 times instead. But apart from that, nothing else really negative to say. Great artwork design, cool synth score, and voice acting. The workshop level design is a nice touch too.  Recommended.  PS - any grammatical errors you guys spot, feel free to mention - I didn't exactly read this review back.",
            "review_score": "1"
        },
        {
            "review_text": "this game is AWSOME, everyone I know who's played it (even casual gamers) love it too. sounds strange that murdering a load of teenagers at a party (like your usual stalk &amp; slash 80s flick) would be relaxing, funny &amp; enjoyable but it so, theres a lot of random stuff happening too, which makes replays fun. an easy to use level editor , thats as simple as mario maker is a great bonus too. so a lot of levels to download &amp; try. this should run on pretty much any pc too, so its recommended to most.",
            "review_score": "1"
        },
        {
            "review_text": "- Bear can call polices - Bear can be arrested - Bear can speak - Bear can dance  11/10 will make the bear call the police again",
            "review_score": "1"
        },
        {
            "review_text": "Stays fair most of the time. There are some moments you feel cheated by the game, but that is often a good thing because it forces you to actually make a Plan B as well. The Soundtrack is great and it is incredibly rewarding to kill the last visitor after a risky plan worked out. The difficulty is alright in my opinion - everything is doable, including achievements (haven't tried the Dark Castle stuff yet), but there are still things that actually feel like an accomplishment.  Some levels are a little bit too long and the bouncers are quite annoying as well, but that does not kill the enjoyment. And while there are already enough levels in the standard game, it has got a level editor and workshop support.",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun game!! A must-buy when under $10",
            "review_score": "1"
        },
        {
            "review_text": "JUST LET ME GET SOME SLEEP DANGIT! &gt;:(  Thus far, it makes me feel like it is very much redundant. But at least i killed something.  Meh",
            "review_score": "1"
        },
        {
            "review_text": "  I didn't know this was my autobiography",
            "review_score": "1"
        },
        {
            "review_text": "I'm so glad they released this for Mac. I remember seeing a let's play of this and thought it looked really fun. Well, it is!  Firstly, the music is incredible. It reminds me a lot of the music in hotline miami 1 &amp; 2. The visuals are pixel-y, but in a good way. The cut scenes and story are interesting and gives nothing away, which really drew me into this game even more.  The gameplay is straight forward and doesn't overload you with a bunch of controls. It's more about knowing what to do and when, seizing an opportunity, that kind of thing. You can play however you like as well. You could be the dude hiding in the bushes waiting for people to stray away from the crowd or you could go wild and start knifing people left and right before throwing on some new clothes to throw the cops off the trail. Tons of traps, body disposal, and random events to give this game a lot of replay value.   There's also something morbidly cathartic about murdering people for the sake of getting some peace and quiet. Also, the sweet music that plays when you beat the level is nice too. ",
            "review_score": "1"
        },
        {
            "review_text": "I usually steer clear of 'retro graffix' games since I grew up with Pong, Atari 2600, early Nintendo, und so weiter, and at my age, asking me to play an olde skool game for the coolness of it is like asking a 'Nam vet to try out the latest PC Rambo game to feel what it was like to, y'know, 'really be there, in the sh#t and all.'  That being said...I like this thing, a lot. I get to murder ♥♥♥-hole club goers, a lot. And sometimes aliens show up...for no decernible reason.   Try it, it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "A good game if you want to hate Miami with every part of your soul.",
            "review_score": "1"
        },
        {
            "review_text": "This game speaks to my soul",
            "review_score": "1"
        },
        {
            "review_text": "Just can not stop the music, just can not ki**ing people. This game is not just simple to find and kill, but need sneak, look around, interact with machines, find the best chance and get eliminate the Party Dogs. Also, if you ki**ing people before some one get there, maybe you can frame up others that be seen by who after arrived this place that you have ki**ling. Aslo this game have many intertesting and wired thing in it, like Miami zombies, like the very drunk people in party that they will not call for help even they saw you ki**ling just because of they are totally drunk enough, man, this is so wired and odd. Put your knife cut off party dogs' throat, and be aware dont get too much high on party, respect neighbors :p",
            "review_score": "1"
        },
        {
            "review_text": "Stupid app wont run after a while. Stupid Stupid Stupid. I really liked the game but can't play it now ",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. The idea is very simple. Kill everyone at the party without being caught or killed yourself.   It takes a lot more tactics than what most of the negative reviews say. 'The whole game is just wait for someone to wander off then kill them then rinse and repeat until you win.' That might be your tactice when you first begin the game, but as you learn it, you will have no problems getting more in depth.   Then when you are able to switch to different characters, the gameplay will be a lot different. For some levels, I do agree that they are daunting - with some characters- but you will have no problem with other characters.   I like almost all of the songs. There is only 1 or 2 that are kind of okay to me.   I do wish that there were more types of traps available and more items to lure people to certain locations - maybe an ability.   And if you are having trouble figuring out the sprint button.   Don't sprint all the time. It's useless. You can get away from most enemies and traps without having to use it so that it may be saved for escaping the police. That is the only time it should be used. Also, figure out where the officer's point of entries are. If someone spots you, begin moving to the point farthest away from any entry point, then just run away according to the path the officer decides to take, this should work really well for most maps.    There are a couple bugs that annoy me such as the secret agent that gives you items. He may start running at a wall indefinitely then die. Or people just randomly pointing you out of the crowd when there is no possibility of them knowing it was you. spoiler]The way I have found to beat that is just make sure you aren't around when a body is discovered especially if you have been found out once before.[/spoiler]  And I'm not sure if this game is 8 or 16 bit. But I love the pixelated art style. My favorite type of art.",
            "review_score": "1"
        },
        {
            "review_text": "I partied too hard last time I played this, got my ♥♥♥ whooped by the SWAT that I called. Plus, no one likes my dancing :(",
            "review_score": "1"
        },
        {
            "review_text": "i honestly really like this game, it reminds me of hotline miami, but a lot harder. this game isn't easy and even when you're still good at this game it's gonna be tough, but it's alot of fun. 10/10 would buy again. :partypills:",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best original titles I've played in 2015. It is challenging, engaging, dynamic, and very FUN. Definitely worth the asking price and highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Fun addictive gameplay, great dark slanted and irreverant humor. You know, when I can pull my girlfriend away from it... she likes it maybe even more than I do! Guaranteed hit.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and energetic! Once you start playing, you can't quit!",
            "review_score": "1"
        },
        {
            "review_text": "This will one day be me, a guy thats only trying to get some sleep and gets a Bender (futurama) dream saying 'Kill all humans'.  some of the levels you can complete in under 10 mins, others can take upto 2 hrs worth of attempts before finally killing them all, Nothing worst than having under 10 party people remaining and you get caught or killed and have to start all over again.  Highly would recommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "What a game, one of the best pixel based games I've ever came across, it's always unpredictable, and the fact that twitch integration works so well, it just takes it to the next level. Completely worth the purchase in my point of view and I recommend this game for pixel lovers. The levels are always filled with random AI everytime you load a round making it that much more interesting and challenging. 10/10 I say.",
            "review_score": "1"
        },
        {
            "review_text": "It amazes me that this game only has 'PEGI 16' in europe. This game is nothing but stabbing, poisoning, burning, running over and throwing people to sharks, yes it's pixalated but the story clearly states that you're a psychopath killing people because they party.  Getting over to the review part: This is a fun and challenging game with a simple premise, don't get caught killing the party people. The story starts of with a man that as far as you know, simply snapped when he couldn't get to sleep because of the party next door, after that he takes his killing spree on the road. Every level you start with a party, a set amout of people (which can change during the level, after all people arrive at parties at different times) and different traps to help you reduce the amout of people at the party. If someone sees you killing another they will of course run for the phone and call the cops, which leaves you with the task, run until the cop realizes he's 'to old for this'. It's easy to learn but requires thinking to understand each level and which traps to use at what time. The twitch support is really fun. The chat can add more party guests, or something to help the player with at times, which usually results in more and more people, making it much harder for streamers than casual gamers. The game have nice graphics and a great soundtrack. The loading times are short which is really appreciated when it's a game you tend to fail a bit in. In the end it still felt a bit short, with not too much variation. But I still had a great time with this and I highly recommend this! 8.0/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much. I play it off and on and check for updates really frequently. The idea is really unique and even though it's repetitive each level is different and adds more to the experience of the game play.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy fun, and not too hard to get all the achievements.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really one of my faves. I'd go as far as to call it a spiritual successor to Hotline Miami- even used the same font as it! The gameplay is fun, easy to learn, and frustrating. A simple miscalculation and you've lost the entire level. The generated levels can work for or out of your favor, but each one can be won with some careful planning. And the soundtrack? is really amazing. Short list of tracks but I've had it on repeat for quite a while. Last but not least, the cutscenes- while the voice acting isn't incredibly mind blowing - are a really good accompaniment to the gameplay. The game would have been great without them, but they went the extra mile and made it something interesting. The game is a solid 9/10, a point gone for that one time a bouncer was hiding behind a door and I had 9 people left. Still miffed about it.  At least, a 9/10 until the end. The very end- 'last cutscene and the game is done ' end. I won't get into the details, but it's a very cliche and overdone trope in horror and murder games and movies. There were many other ways it could have been done and still held the same excitement, but they still took the easy way out. The end seems like a copout (excuse the pun) of an ending and feels very, very out of place with the rest of the story. I don't usually let bad ends get to me, but this one just didin't feel right with the game.  I would still recommend it of course, but I'd also recommend ignoring the last cutscene- skipping it altogether even. It leaves you with a bad taste in your mouth.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging but alot of fun, plus you can stab. ",
            "review_score": "1"
        },
        {
            "review_text": "This game speaks to my soul",
            "review_score": "1"
        },
        {
            "review_text": "Stealth game. Kill them all. Can be modified by twitch. Fun.",
            "review_score": "1"
        },
        {
            "review_text": "My thumbs-up and playing time is about all I have to say about the game itself. Getting stabby on loud obnoxious drunk people is a time-honored tradition and will never get old.   But a few weird things about the main map --- I couldn't help but notice that the player character(s) don't crash any parties in the Northern US, some of the states seem to be missing borders (Illintucky, Arkanssippi, New Yorverhampshire, and New England is apparently one state now...) Also, it looks like Michigan turned into one of the Great Lakes. Which is probably for the best. (Just kidding -- go Lions!)",
            "review_score": "1"
        },
        {
            "review_text": "Great premise, but the execution is lacking. Repetetive traps, excessively slow movement speed of player character. Again - great premise, but it feels more like work than fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Neat aesthetics and an interesting premise, but bogged down by a lack of clear rules about how the world behaves -- who can see you, under what circumstances will you be targetted as a the perpetrator, etc. -- and the music gets really repetitive really fast (which I guess is kinda the point, since the killing spree is supposed to be triggered by it). Additionally, some levels require far, far too much patience to complete successfully.  There are occasional points where you feel really clever for pulling something off but they are very few and far between. Overall it feels a bit too much like a random number generator rather than a game you can actually get better at playing.",
            "review_score": "-1"
        },
        {
            "review_text": "I picked this up to kill time one afternoon and now I'm hopelessly addicted. It's got pretty decent replayability, as I've had to repeat some levels upwards of 20 times. Definitely worth it if you ever catch it on sale and enjoy some stealthy mindless violence with a tiny bit of strategy mixed in.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! I recommend buying this game it's really fun",
            "review_score": "1"
        },
        {
            "review_text": "Very good boyzz",
            "review_score": "1"
        },
        {
            "review_text": "Unique and fun game that I reccomend. There was a wacky glitch where the alien tried to take me but instead I'd blink constantly in two or more places at once in the casino area in the bank. I tried walking outside but in the end I had to restart the level. Also I can't unlock the last character even after getting a 20+ combo on two different maps. I read it's easy to get him and I'm dissapointed I can't use this character.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game. Part of the fun is actually getting caught before finishing the level. This usually annoys me to no end, but in Party Hard it makes me have just-one-more-go, instead of ragequitting. This game has a lot of rough edges and will get repetitive after playing through some levels, so buy it at a discount to prevent disappointment. All in all an entertaining experience.",
            "review_score": "1"
        },
        {
            "review_text": "Party Hard is a crazy blood rushing game. I love the game itself the story is okay but what really matters is the gameplay. The suspence and feeling that you could be caught at any time create an expirence that someone like me wouldnt get anywhere else outside of a video game.   To sum it up buy this game it dessrves to be played (And trust me you will play it)",
            "review_score": "1"
        },
        {
            "review_text": "A humorous idea that changes it up right as it starts to get boring. Nothing epic but definitely a good way to kill some time",
            "review_score": "1"
        },
        {
            "review_text": "- Bear can call polices - Bear can be arrested - Bear can speak - Bear can dance  11/10 will make the bear call the police again",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and fun best waste of time ever!",
            "review_score": "1"
        },
        {
            "review_text": "Hotline Miami 3: Wrong Party",
            "review_score": "1"
        },
        {
            "review_text": "Just challenging enough to be a good spy/hidden game while keeping the mechanics of a great 2-d game. I've had so much fun playing it!",
            "review_score": "1"
        },
        {
            "review_text": "After somehow putting seven hours into this game, I cannot reccommend it. The music is great, but the gameplay consists of hoping people are close enough to the traps for them to be useful, or otherwise just waiting until each person goes off on their own to kill them. And of course once you get down to just three more people, the police see you too close to a body and you have to start it over again. Buy it if it's on sale, maybe, but otherwise just stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "Stealth on pixels? So damn good! Party haters of the world unite!  + controls of the game you would like + new shiny level editor included in new build + good colors, acid art and well done balanced stealth mechanics  + music you think you never would listen to, but eventually like it + you can dance and kill cops with a horse! + bear in the open air level is adorable!  - game crashes and glitches (seldom, but newertheless..) - could not replay as girl char after the end of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is harder than i expected! and i love it! lots of unique ways to *delete* people. And after you start playing this game.. you will became cop hater.",
            "review_score": "1"
        },
        {
            "review_text": "Great pixel art stealth game. Very addictive decent price even better on sale. Lots of fun no problems so far.",
            "review_score": "1"
        },
        {
            "review_text": "Christian Bale did the voiceover for this game. That may or may not actually be true but it doesn't make this game any less awesome.",
            "review_score": "1"
        },
        {
            "review_text": "It's a game that takes a simple idea and turns it into something so complex and enriching.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game that almost reminds me of some kind of Where's Waldo? where you're just trying to systematically murder an entire group of people. It's one of those games I really enjoy hanging out with friends and playing, everyone gets their input in on what the strategy should be to most effectively pull off a mass murder. I picked it up in a bundle, which I would recommend waiting for, but either way it's a solid indie game. ♥♥♥♥♥in soundtrack too. Real fun game if you've got some time to kill and nothing to do, either alone or with friends.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. Its so simple but so unsimple. One thing I wouldnt recomend is to get ideas from this game. There is a very good story to this game. There is also a lot of violence and not kid friendly themes and language.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most innovative strategy game I've played this year.",
            "review_score": "1"
        },
        {
            "review_text": "this game i could play all day i would literally play only this game ... forever",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, but the menus are so bugged it's not even funny.",
            "review_score": "1"
        },
        {
            "review_text": "Wholly worth it when on sale. I'm not sure I would have felt so positively about it if I had paid £10 for it, but it is definitely worth 50% of that, at least. It features gameplay which adheres to the conventions of a black comedy, and a storyline which is so clichéd (and it exploits this knowingly) it's hilarious. It is incredibly difficult and I somehow spent two hours on the 'Miami Party' mission singularly. Sure, it's clunky and imperfect in many ways but these work in its favour. I advise picking it up if you like the look of it.  Note: I wouldn't suggest buying it if you've watched it be played through though, since most of the fun comes from interacting with the game's various 'traps' and seeing the result.",
            "review_score": "1"
        },
        {
            "review_text": "Got it as a gift from a friend, but I would have paid full price for the amount of fun I've had playing. Probably my favourite game on Steam right now!",
            "review_score": "1"
        },
        {
            "review_text": "Not gonna lie, the story is ♥♥♥♥, but the gameplay is fun and challenging and you have an endless amount of levels being made by a creative community so you can playfor a long time. can be a bit frustrating and on some levels it isnt clear what the people can see over or not which can be frustrating",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing love this game its fun and hard",
            "review_score": "1"
        },
        {
            "review_text": "JUST LET ME GET SOME SLEEP DANGIT! &gt;:(  Thus far, it makes me feel like it is very much redundant. But at least i killed something.  Meh",
            "review_score": "1"
        },
        {
            "review_text": "This guy knows how to ruin a party.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play if u want to have some fun in party",
            "review_score": "1"
        },
        {
            "review_text": "Who'd have thought? a literal 'Murder Simulator'. Heh.  Okay but seriously I want to recommend this but with something of a caveat. This review is based on the normal version of the game, not with the free DLC that's just released, as I haven't yet played that bit.  What we have here is effectively a face paced puzzle game where the puzzle shifts about dynamically and somewhat randomly. The puzzle is 'bunch of people are partying too loud'. The solution is 'kill everyone without being taken out'.  Your stock character has nice easy to understand mechanics. Stab people, drag their bodies around, or push people into environmental hazards, or heck just interact with parts of the environment to make things happen, like distract people with pizza, or summon zombies, or aliens, or a swat team or a chainsaw murderer, stuff like that. You know, normal things.  Guests react with horror at seeing dead bodies, so you will want to deal with that. or maybe not. depends on your strategy you're going for. Maybe the police and ambulance showing up could be a good thing. maybe you can pin the blame on someone else if you're quick and lucky enough. and that's a few less guests to deal with. Get spotted near a dead body and someone will try to call the police to get them to show up and arrest/kill you. Evade them long enough and they'll get bored and go back to their station or whatever (swat don't seem to though, nor do FBI), but each time the police are called it gets tougher to evade.  The game has multiple characters you can play, each with their own mechanics and each challenging the player in a different way. This helps things not get too stale, which is good. Though certain characters are just plainly awful to play as in certain situations unless you really want to challenge yourself.  As for the story (yes this game has one), I would say that it's actually rather interesting; perhaps a touch pedestrian and predictable, but enjoyable nonetheless and it kept me interested all the way through despite calling it right near the beginning as to what the twist was. You probably will as well, but even so it was an enjoyable, kind of silly game.  I'm not sure what the dlc changes or adds, but it is free so there's no worry there. Fan response to it seems divided however. Luckily, it's free. and it doesn't change the core game. only adds to it.  There's also a level editor as welll so you can design your own parties and such. I got several hours out of this game so I don't regret getting it really, and I'm going to recommend it wth the sidenote that the game really doesn't give any incentive for replaying it, kind of a 'One-and-done' sort of game, and the gameplay can get a touch repetitive, and frustrating, with luck due to random dynamic movement of guests around the parties causing some odd situations, sometimes favourable, sometimes crippling your run.  So basically, yes it's fun, but maybe not fun for everyone, and maybe its issues will turn you off the game before you can get far enough in it to complete it. Honestly in terms of 'the puzzle is dudes need to die, the solution is kill everyone' type gameplay, I feel the Hotline Miami games do it far better, and they have a better story too, but then they have a very different type of gameplay to Party Hard.",
            "review_score": "1"
        },
        {
            "review_text": "'Hitman meets Hotline Miami' is probably the best way I can describe Party Hard. Like any game featuring a certain bald-headed assassin, it's got open-ended levels with a wide variety of traps and accidents to trigger to throw a wrench into the game's social stealth-based AI, and like Dennaton's ultra-violent duology, the whole thing is presented with a kitschy 80's aesthetic featuring 8-bit graphics and synthwave music that is earworm-y as hell.   There are a ton of ways to go about your murdering sprees, but it's best to stay as subdued as possible, because your knife is slow and extremely short, and you can't sprint for very long if someone catches you carving into an innocent bystander. It seems like your movement and attacking are made intentionally crappy in order to prevent the game from being too easy, and this is compounded by certain assets and items in each level being randomized every time you play, so you'll always have to think of a new strategy when you replay levels because that one really useful trap isn't going to be there every time you replay it. It does make the game a little difficult, but I'm having so much fun just trying new stuff every time I replay a level that I don't really mind it so much. It's not perfect, but it's really fun, and for such a low price, you'd be crazy not to at least try it.",
            "review_score": "1"
        },
        {
            "review_text": "This has quickly become one of my favourite games, it has a lot of re-playability value wich to me makes it worth the money. Plus the user made maps add to it and make it even funnier. Personally I didn't care for the story, but that's just because I was too excited to play the next level rather than paying attention as it doesn't really affect how you play. All in all, a great game that I can see myself playing a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable but very short. Luckily there is ton of maps, but when you see it once you have seen all... ... ... ... JOKING! I LIKE TO MURDER PEOPLE!!",
            "review_score": "1"
        },
        {
            "review_text": "just a game to screw around in. I killed someone with a horse",
            "review_score": "1"
        },
        {
            "review_text": "this game is ♥♥♥♥ing ♥♥♥♥ing awesome",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for nearly 7 hours i gotta say i love it, its a stylish stab-em-up with a story thats actual quite interesting to play through",
            "review_score": "1"
        },
        {
            "review_text": "I got beat up by Danny Sexbang.",
            "review_score": "1"
        },
        {
            "review_text": "If Steam had the option, I'd rate this one as neutral. While initially I thought Party Hard was quite good, unfortunately, that didn't last and I just don't think the developers expanded on the core concept especially well. Basically this is the original Postal, but with a focus on sneak kills and traps. It's common to find yourself in a situation where you've spent a lot of time whittling things down, but fail with just one person or a handful of targets remaining. I'll give them credit for Twitch integration, where the audience can vote for things to happen, but the viewers just aren't there, at least that I've seen as both a viewer and streamer.  If it's on sale and you think it's something you might enjoy, I don't think there's anything wrong with giving Party Hard a shot at a fair price. Just don't expect much depth and be ready for a lot more frustration than fun, especially in the later levels.   As an alternative, consider Gunpoint. I found that one a lot more entertaining and challenging than Party Hard.",
            "review_score": "-1"
        },
        {
            "review_text": "Let the guy rest! xD",
            "review_score": "1"
        },
        {
            "review_text": "Party like there's no tomorrow...  (...for anyone else.)",
            "review_score": "1"
        },
        {
            "review_text": "I really really enjoyed this",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing when I first played it I couldn't stop jamming out to the menu music. Although this game is a bit challenging the first few levels but when you know what to do it get's pretty easy. Like I typed before the game has amazing music and it really goes well with the game it kind of has a Hotline miami Vibe to it. But yeah I recommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing when I first played it I couldn't stop jamming out to the menu music. Although this game is a bit challenging the first few levels but when you know what to do it get's pretty easy. Like I typed before the game has amazing music and it really goes well with the game it kind of has a Hotline miami Vibe to it. But yeah I recommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "So satisfying to finally stop these guys",
            "review_score": "1"
        },
        {
            "review_text": "i love this game, i can wait to see the tycoon version",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and challenging game",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of my favorite games on steam. pixel graphics- top notch  Good storyline",
            "review_score": "1"
        },
        {
            "review_text": "Poor dude was just trying to sleep when his neighbour started partying.",
            "review_score": "1"
        },
        {
            "review_text": "I beg you delete the achievement Clubber I do not want to turn on and off the game 100 times and I would like to complete the game at 100%. Except for this the game is great in particularly to play with the girlfriend, and the music is amazingly funny :D ",
            "review_score": "1"
        },
        {
            "review_text": "This has quickly become one of my favourite games, it has a lot of re-playability value wich to me makes it worth the money. Plus the user made maps add to it and make it even funnier. Personally I didn't care for the story, but that's just because I was too excited to play the next level rather than paying attention as it doesn't really affect how you play. All in all, a great game that I can see myself playing a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Very knife game. Requires patience and stabbing + trap sets. Provides multiple character for replayablilty.   Quite like the story/ murder specials.",
            "review_score": "1"
        }
    ]
}