{
    "app_id": 356800,
    "name": "Choice of the Petal Throne",
    "release_date": "2015-04-10",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Text-Based"
    ],
    "achievements": 43,
    "positive_ratings": 9,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "In the Empire of the Petal Throne™, will you find glory, or a knife in your back? A world where South American, Middle Eastern, and Indian cultures collide!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/356800/header.jpg?t=1538615738",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ok so this is getting very negative review which I think are not entirely justified. I'll adrress a couple of points.  1) Yes, it's perhaps a bit shorter than average - but not teribely short. On the other hand, there's at least some replay possibility as various choices you make result is a somehow different play (not always a given in this kind of interactive fiction). You'll not get all scenes/events in a one playthrough.  2) The setting is more exotic than usual but I think that's a plus. I prefer it much more than a typical cliche fantasy. You can easliy pick up the meaning of setting-specific words from the context.  3) Choices of gender or patron deity do influence gameplay in some way rather than being merely cosmetic. Cool.",
            "review_score": "1"
        },
        {
            "review_text": "At first, I was turned off by this game. I got it due to the topic. I LOVE the world of EPT. Playing a word based game was a suprise to me (although, I did do ZORK et al as a kid... yeah, I am older).  I am very impressed with the amount of love put into this game and the interpretation of MAR Barker's world.  This game is probably not as well recomended for non-EPT fans. However, for those of us who grew up with the RPG of the Petal Throne, this is golden entertainment.  Kudos.",
            "review_score": "1"
        }
    ]
}