{
    "app_id": 357070,
    "name": "UBERMOSH",
    "release_date": "2015-08-13",
    "developer": [
        "Walter Machado"
    ],
    "publisher": [
        "Walter Machado"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Great Soundtrack",
        "Pixel Graphics"
    ],
    "achievements": 7,
    "positive_ratings": 1761,
    "negative_ratings": 199,
    "price": 0.79,
    "description": "UBERMOSH is an arcade game about cutting bullets with a sword, in a gun-filled cyberpunk mosh pit.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/357070/header.jpg?t=1478460277",
    "minimum_requirements": "OS: Windows XP Processor: 1.6Ghz+ Memory: 2048 MB RAM Graphics: 512MB Storage: 390 MB available space",
    "recommended_requirements": "Processor: 2.2Ghz Graphics: 1024MB",
    "reviews": [
        {
            "review_text": "I can happily say that UBERMOSH is one of the most entertaining games I have played in a while. In this game, your objective is to survive in a mosh pit for 1 minute and 30 seconds, using your laser sword to reflect the enemies' bullets back into them, making up for a great defense mechanism, and to eventually pick up their guns and start your own carnage in the pit.  The retro art style is lovely and really matches the game's theme while the soundtrack is amazingly energizing, fueling your space killing-sprees. There are several arenas in which you can fight ( randomly chosen by the game when you start a new run), but the only difference between them is the colour of the environment. Your arsenal is not really big but it is varied and has lots of uses: besides your sword, you can equip up to 5 (aproximate number) guns that are dropped by the endless incoming waves of enemies, each having different fire modes ranging from a shotgun to a single charged shot or a flurry of bullets widespread in a cone of fire.  The game comes with 4 combat modes: the ordinary one, in which you have 3 lives and can use your sword and any gun you pick up; the 'kensai' mode, in which you cannot pick up any firearms, relying only on your sword and starting the run with 6 lives; the 'gunner' mode, in which you have no sword but any gun you pick up fires in a full-auto mode; or 'warlock', in which you start with the best gun in the game and can use your sword, but you get only 2 lives.  If you're looking forward to a greater challenge than what the base game has to offer, hardboiled mode is here to satisfy your needs, representing a much difficult twist on the base game that resets your overall score when you switch to it. You can also get trading cards and easy-to-obtain achievements when playing the game, which adds to the value and makes the price worth it. In my opinion, UBERMOSH will not let you down if you're looking for a good time-killer or just for some good old top down shooting action, and I would strongly suggest buying it.  TL;DR: With a difficulty level that reminisces good old arcade games, UBERMOSH brings some new elements to the retro top down shooter template, and it will get you a decent 2 or 3 hours of fun for a really good price.",
            "review_score": "1"
        },
        {
            "review_text": "   Fast    Gives you a rush    You cut bullets with a sword    Music rocks, big time    Cheap    Runs on a potato    Did I mention you cut f*kin' bullets in mid air with a f*kin' sword?    Cyberpunk     Don't think about it, just get it",
            "review_score": "1"
        },
        {
            "review_text": "Buy &gt; Don't Wait &gt; Play   Positives  + Hard, but fair + Intense gameplay + Sound effects are great + Music is fantastic (Core Guitars, Heavy Beat, Retro Vibe and Dark Hue) + Bullet 'cutting' feels truly solid   Mixed  ~ Game feels 'zoomed in', but it actually adds to the intensity of the gameplay once you get used to it after a few minutes   Negatives  - Low replayability besides beating your own highscore   Tips  💡 Play with mouse/keyboard 💡 Do you want more of this kind of music?  gearcrack  [soundcloud.com] ",
            "review_score": "1"
        },
        {
            "review_text": " My wristle hurts, my fingers hurts, my hand hurts. Everything hurts, even my ego.",
            "review_score": "1"
        },
        {
            "review_text": "Just discovered this gem. I fell in love instantly when I discovered there is no Pause feature. It was at that moment I said 'Sweet Raptor Jebus, there is no pause... yes this is a REAL bullet hell game!!', as a Bullet Hell adict, I spit in the face of easy modes, save features, and such a silly thing like a pause button, there is no pause in the chaos and death known as True Bullet Hell gaming, don't you dare blink or itch your nose muhahah,it becomes a test of your own will and power over your own body and is a realm meant only for the relentless and hardcore. Indstrial metal thumps harder than Quake 2 tunes and drives the NON STOP violence. Life and Death is a supreme black and white factor in game, you survive by franticly avoiding bullet chaos, perfecting timing by repeling bullets, getting a good gun and trying to hold corners while at the same time avoiding picking up a worse one till it becomes too much and you bail. The art style is great as well. Luck, pure punishment, and a test of skill while making your own split second tactics, Yus, this game will give you Bullet Hell Zen, let go of the false self and simply be within the torrents of Bullets and Chaos. 10/10 Art style is epic as goat teeeets, real sweet stuff. Just wish it had a two player mode, or online co-op function.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game which reminds me of the games i used to play on our old pc like Crimsonland, smash tv etc. needs alot of hand and eye coordination when the bullet storm occurs, worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Such a high! Minimalistic and distilled, UBERMOSH offers pure, unrelenting carnage laced with neon pixel viewscapes and ear-smashing electronic sound waves. It’s the kind of game that demands a bare metal interface directly with your brain, then proceeds to abuse the hell out of it without repentance.",
            "review_score": "1"
        },
        {
            "review_text": "UBERMOSH, an extremely simple, yet balls to the wall hard game with an amazing rocking soundtrack &amp; a top-down view of the action. Story is simple &amp; quick to the point, cyberpunk utopian future colony where violence, crime &amp; poverty is a non-issue but violence is a “basic need”, so what better way to blow off much needed stress than dropping you in a hostile environment. That is basically it, you are armed with a sword, which you can use to deflect enemy bullets back at them or slice them. Guns are dropped by enemies, simply running over them picks them up. The guns are nothing special, each have their own bullet spread and there is a total of 5 different guns. The game has a simple premise, basically your difficult to survive horde/score attack type of game. You are given 90 seconds &amp; 4 lives on the basic mode of play. There are 4 modes or class mods as the game call them: Kensai, limits you to only use your sword, Gunner only guns &amp; Warlock, which gives you the “best” gun as well as the being able to use your sword. Your amount of lives varies between each mod. Gunplay is average serving more to thin the numbers rather than being your main method of attack, the sword being your main weapon &amp; “shield”, with its ability to deflect bullets, against the onslaught. Despite the enemy bullets coming in hard &amp; fast, they are brightly neon colored so you have a decent chance of being able to evade/deflect them.  Ubermosh can be played with both a mouse/kb &amp; controller. It does not feature a graphical setting menus or any other menu for that matter. The game is extremely short considering it doesn’t really have story to tell &amp; consists of nothing more than fighting the horde of enemies for 90 seconds or your death. There was a minor flaw involving the walls, in which having you move next to them it just stops your movement &amp; gets you stuck to them which is an annoyance in such a fast paced game. No leaderboards as well, so you will have to resort to sharing score the old fashioned way. All in all, despite that minor flaw, it is a decent time waster with a pretty cool soundtrack that will have you head banging along to the beat as you slice &amp; dice your way through the horde. ",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced retro arcade bullet-hellesque bullet deflecting goodness.  I initially started out with the controller and eventually moved onto the keyboard+mouse. It's personal preference really as it is very easily playable with either control scheme.  As far as the action goes: it's blindingly fast and crushingly addictive. Different enemies handle different weapons which determine size, speed, and spread of the bullets. To fight them, our means of attack are your gun and sword; the latter can also be used for defense as it can deflect bullets.  With the ability to deflect bullets, there is also the added variation in how bullets are deflected; for example, the large single bullet is deflected into two slower bullets, while the bullets from the game's proclaimed 'best weapon' almost appears to move back at the same number and at the same speed. A nice feature is the ability to control the direction of the deflected projectiles depending on where you have hit them.  There's not too much difference between enemies. There seem to be three total but they really only come in two sizes: humanoid, and large alien size. Despite this all seem to move the same speed. While that may sound boring, I believe it simplifies things and helps add to the twitch-frantic action.  As hard as this game is, you don't ever really feel cheated and are forced to 'git gud'.  As far as visuals go, the masterpiece is the pictured soldier on the menu. The art style and symbols used remind me very much of Tsutomu Nihei - it's good stuff. I also liked the fact that as you survived and progressed and raised your ranking, the soldier's armour would change (both in game and on the menu) and reflect that change in rank; though I wish you could view and choose the different armour variants.  For $4USD, this is a great arcade-style game with an awesome soundtrack too.  PS: The 'Kensai Mastery' is impossible.  28/08/15: Kensai High Score = 114 -_-",
            "review_score": "1"
        },
        {
            "review_text": "A fast paced top down shooter and slasher, this game is, in a word, fun. Its addicting, easy to learn, hard to master, and just a great indie game.   The gameplay is you start with a sword and ricochet projectiles at your enemies by reflecting. The reflected projectile kills your foes instantly, and you cut also rush an enemy and cut them instantly too. A dead enemy always drops a gun you can borrow. Each class you play has a varying amount of lives, and can be orientated towards a shooter or a slasher role. The Warlock starts off with the strongest gun in the game, and can reflect bullets, but also only has 2 lives. The no mod class/GREEN(The default class) starts with no gun, 4 lives, and can reflect bullets. Kansai starts off with 6 lives, and a sword, but can't grab guns. Gunner has 2 lives and a fully automactic gun, and can make any weapon, even the strongest weapon automactic.   Only real problem with this game is a lack of content. Theres a Hardboiled mode, and 4 classes with alternate roles, some Steam achievements, and of course Trading Cards. However, the trading cards really have had their value dropped by a ridiuclous amount($0.24 to now $0.07). If this game had local multiplayer, that would be so amazing...*hint hint game developer*  To anyone who enjoys addicting fast paced gameplay, I highly recommend this game. Its speed, pumping electric soundtrack, fast paced action, low price, just mix together to make this one of the best games i've played in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "The sound of the sword being waved is the best thing I've ever heard",
            "review_score": "1"
        },
        {
            "review_text": "Incredible soundtrack? Check. Several modes to realise your full potential? Check. Swarms of generic but lasergun-wielding baddies? Check. Cool voice acting (however little there is)? Check. Gamepad support? Check. A cyber-punk beauty on the title screen? Check. Our beloved pixels? Check. Gamepad buttons burning under your fingers? Check. What else? Hmm...Oh, yes. 'Welcome to UBERMOSH'.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game you run around and shoot and cut bullets. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "fun game,fast paced ,good soundtrack...great price.",
            "review_score": "1"
        },
        {
            "review_text": "Got in the sale for 69p (around $1) and was pleasantly surprised. The game is extremely difficult, yet incredibly addictive. It's the same everytime you play, there are around 6 different types of guns each with different fire rates, projectile speeds and projectile types to accompany your sword, which you use to deflect enemy projectiles.I think it's a little annoying that on occaision, an enemy might literally spawn on the ground you are walking to, which will cost you a life every now and again if you aren't quick enough to right click in time. Basically, if you are looking to spend very little money, on an addictive pixelated clusterfest, this might be for you. I like that I can just play a few quick rounds.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fast paced game with an impressive soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "The colony provides us everything... except for violence.   Welcome... To UBERMOSH.",
            "review_score": "1"
        },
        {
            "review_text": "Can't. Stop. Playing.",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced, addictive arena shooter with a vibrant neon aesthetic and a killer soundtrack. An absolute must purchase for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Simplistic and fun, great for killing a few minutes here and there. Totally worth the price tag and the soudtrack is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "cool as ♥♥♥♥, fingers hurting",
            "review_score": "1"
        },
        {
            "review_text": "Great Indie game, great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "fast paced and fun as ♥♥♥♥  just buy it",
            "review_score": "1"
        },
        {
            "review_text": "As an audiofile, I value the soundtracks almost as much as the game itself. When dev companies offer such stellar deals on their  already A+-title game; it is hard to resist.  And at just 99 pence, you'd be foolish not to take home this glossy pebble.",
            "review_score": "1"
        },
        {
            "review_text": "[generic meme response to express nearly erotic joy]",
            "review_score": "1"
        },
        {
            "review_text": "There is absolute beauty in simplicity.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, it's simple and well designed. It's all about the classic score run, getting better and better at the game. I'll totally admit to sucking at it XD but it's a blast even if you suck.",
            "review_score": "1"
        },
        {
            "review_text": "ADHD be gone - or more corrrectly 'Shiny thing keep my attention!!!! Ooooo' Frentic fun with an awesome soundtrack and Morgan Freedman voice clone. I jzzed my pants. One problem: mouse not constrained to game window (for my installation). Solved by installing 'dual monitor tools' from sourceforge.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely crazy action and soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "EXCELLENT GAME! reminds me of hotline miami with a touch of holy hell cyberpunk, the only problem ive been having is dual monitors and this game dont mix since the screen isnt locked, i have to constantly keep an eye of where i am aiming.   Either way, great game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but a tad difficult. Would only recommend if you're a fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "JUST AN AWESOME TRY HARD GAME EVER with a good ost ",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game, but steam sees reccomendation as black and white, and looking at the current score (92%) I think this game doesn't deserve such a high note. But whatever I guess I am going to have to stick to this system...  Pro : -Music is really cool, I like how it evolves arround the same instrument -Gameplay overall is really cool and fun -really simple and easy to pick up -cheap -doesn't ACTUALLY need 512 mb of gpu, you can play it on anything pretty much .  Con : -Getting an ennemy spawn and shoot you instantly -melee and ranged weapon takes time to switch (so you will press fire ranged weapon, then melee weapon and it won't work, which sucks because this is a fast paced game, and there shouldn't be a delay between the two) -And as some other people said before the camera could be placed farther away, or better yet, ajustable. -lack of diversity -no way to return to main menu with a controller  Yes, the game is simple, lack game modes and such, plus it only has 4 class mods, but it only costs two dollars, when not 75% off on a steam sale, which makes it 0.50$. For that price, this is an excellent game I would give it a solid 85%.  Note : This game is a score attack obviously, you will die constantly, if you are the kind of person who doesn't enjoy this, don't consider this game, unless you have an extra 0.50% and that you don't know what to do with it, you should just keep it honestly.",
            "review_score": "1"
        },
        {
            "review_text": "It's the first of the series and it's uber intense! Not for the weak of heart.",
            "review_score": "1"
        },
        {
            "review_text": "Very fast paced top down shooter game. Super intense!",
            "review_score": "1"
        },
        {
            "review_text": "A short Highscore Game with:   - Nice Music  - fast gameplay with guns and a bullet-cutting sword  - lots of enemys which means a lot of blood (well it's not red)   It's fun! Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Yo this ♥♥♥♥ go hard af. It's the perfect level of difficulty and frustrating to make it enjoyable, unlike certain games. The soundtrack go hard, as it's an electronic/rock mix.",
            "review_score": "1"
        },
        {
            "review_text": "Will not lie, I had my doubts. Plain and simple a goood game for its price. Not too much to explain, it just has a good vibe compared to some others I have tried.  Recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "THIS ♥♥♥♥ IS FUN.  ♥♥♥♥.  BUY THIS ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Pros +Gameplay +Soundtrack +Graphics  Cons -It gets boring after awhile -Low enemy and weapon variety -Only 1 map?!?",
            "review_score": "1"
        },
        {
            "review_text": "Yo this game's a ♥♥♥♥truck of bull-♥♥♥♥...  I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of the combat of the original hotline miami. Great soundtrack, very satisfying fighting.  I do feel like the game is lacking at least partially in terms of map variety. I say that fully baring in mind that the game is only four dollars, but there are many games for even less than that that have more variety.",
            "review_score": "1"
        },
        {
            "review_text": "Can't recommend this one. Repetitive, with little replay value.  Multiple character classes kept me coming back to it, but the core game just isn't there. It's fast, bright, and flashy, sure, but it really boils down to running from one end of the map to the other, slicing up the same few randomly spawning enemies.  Some of the mechanics are pretty cool, slicing enemy bullets to launch them back at the enemy is pretty satisfying the first few times you do it, but it's not something to hold an entire game up.  The shooting's a headache. Firing shakes the screen so much that it more often than not disoriented me to the point of losing track of my character and running face-first into my death. I stuck mainly to the sword after that.  Enemies spawn around the map at random. There's no set pattern or waves. Any high-scoring round I played felt to me more like a stroke of luck than an accomplishment.  I paid fifty cents for this game, and I'm still considering a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "I wish there was a maybe button instead of just yes or no. This game has great potential to be fun. The game play is solid and the gun mechanics work well. I do wish the aiming of the gun and sword were tied to the right stick instead of the left and right triggers. What did it for me was the screen shaking. It was way to much and created a nauseating difficulty of its own. For that reason alone i call the game unplayable. A games difficulty should be in its gameplay. Not added effects to make it harder for you. The game is hard enough as is. This was an un needed effect. If you dont mind the shakey cam every 2 seconds then enjoy. But i just cant recommend this game with it.",
            "review_score": "-1"
        },
        {
            "review_text": "pew pew swing bling bling boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boom pew pew swing bling bling boom boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom boom swing swing bling boom pew pew pew pew pew swing bling swing bling pew swing boom boompew pew swing bling bling boom boom",
            "review_score": "1"
        },
        {
            "review_text": "Great game to get your triggerfinger reflexes on point. Needs more content to be a real meal deal though",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. I like it. Hardcore deathmatch. But game need some options: music, Vsync, screen resolution.",
            "review_score": "1"
        },
        {
            "review_text": "It's quick, cheap, and quite enjoyable to play in short bursts. If you enjoy flash games that involve quick and short gameplay, you'll enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is everything people say it is. Action, bullets, and swords. The game sounds nice and feels really smooth to play however due to that smoothness I felt like there wasn't any real feedback wich will bring me to my next point.  Although the game is good, and is a must have if you like old school arcade games or bullet hell shooters, the thing that really turns me off is the feedback.  I like to really get into the games I play but here with the slippery movement, and seemingly random deaths I just can't do that. I really hope that this game will see some patches to address the feedback issue about getting hit. Plus the way it just suddenly shows you a game over screen just feels hacky. (Although maybe the intent is to make you rage, so you can get going.)  However I am still going to recommend this game because at this price it's a steal. (CDN$0.49 at the time of purchase.)",
            "review_score": "1"
        },
        {
            "review_text": "My favorite thing to do is play this while listening to relaxing rain forests sounds. I find it soothing.   Also its rly good. Also its an adrenaline rush everytime you play. Also that counters my first statement. Also You should buy this game because its really good and really cheap.",
            "review_score": "1"
        }
    ]
}