{
    "app_id": 35700,
    "name": "Trine Enchanted Edition",
    "release_date": "2009-07-02",
    "developer": [
        "Frozenbyte"
    ],
    "publisher": [
        "Frozenbyte"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Fantasy",
        "Puzzle"
    ],
    "achievements": 33,
    "positive_ratings": 9448,
    "negative_ratings": 407,
    "price": 9.99,
    "description": "Three Heroes make their way through dangers untold in a fairytale world of great castles and strange machinery, featuring physics-based puzzles, beautiful sights and online co-op.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/35700/header.jpg?t=1550826466",
    "minimum_requirements": "SYSTEM REQUIREMENTS FOR TRINE ENCHANTED EDITION  OS: Windows 8 / 7 / Vista / XP Processor: 2.0 GHz CPU (Dual Core recommended)  Memory: 1 GB Hard Disk Space: 4.0 GB  Video Card: ATi Radeon HD 2400 or NVIDIA GeForce 7600 or better (Shader Model 3.0 needs to be supported) DirectX®: 9.0c Sound: DirectX 9.0c compatible  Additional: *Please note that Trine Enchanted Edition may not run on most Intel graphics solutions used in 2004-2009. The game does run on new (2010-) Intel HD Graphics 3000 or better.  SYSTEM REQUIREMENTS FOR TRINE  OS: Windows XP, Windows Vista or Windows 7 Processor: 2.0 GHz CPU (Dual-core recommended) Memory: 512 MB (XP), 1 GB (Vista) Hard Disk Space: 4.0 GB Video Card: Radeon X800 or GeForce 6800 or better* DirectX®: 9.0c Sound: DirectX compatible soundcard (not required) Additional: Gamepads required for co-op play.   *Please note that Trine does not run on most Intel integrated graphics chipsets.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My thoughts on Trine:  Trine is a beautifully designed 2D action-jumping-fighting-puzzle solving indie game. You get to play three differennt characters at once - a knight, a thief and a wizard. While obviously only controlling one of them at a time, you can switch between those three at any time, using their individual strenghts and abilities to make it to the other side of the map. As the knight, you're armed with shield and sword and are capable of lifting heavy objects and throw them at your enemies. The shield can be used to block any incoming attack, while the sword is the perfect weapon to deal with the growing numbers of skeletons, bats, and other enemies that you'll encounter. The thief is armed with a bow and thus able to fight enemies from afar (duh), and can shoot a rope on wooden objects to swing across pits, pull herself out of them in case you still manage to fall and perform cool looking jumps. As the wizard, you can summon cubes or planks to make yourself an easy way across pits, build stairs to get over high cliffs or drop them on your enemies.  Each ability and spell can be upgraded throughout the game, like letting you shoot several arrows at once, create more cubes to stack on each other or make your sword even deadlier. There are hundrets of casks granting you exp or mana hidden across the game and finding (and reaching!) them all is no easy task!  The graphics are among the best I've seen on a 2D game, only behind this games successor Trine 2. A special praise goes to the awesome person who created this beautiful soundtrack, the music fits this game just perfectly.   I personally didn't like all of the jumping parts that much, just because I'm usually not a big fan of jumping games (and suck at it too), and died several times over. I know I'm criticising a jumping game for its jumping parts, so someone who's into that kind of stuff will have a really good and challenging time with this game. For people like myself, it's still enjoyable, and swining around with the thief is fun, but after a while it can get boring. There could be more different enemies too, since in like the first three chapters or so all you fight are skeletons and bats.   Lots of good things to be said and a few bad too, still I'd recommend anyone to buy this game, especially if it's on sale for like € 1,- or so.",
            "review_score": "1"
        },
        {
            "review_text": "Its a really nice sidescroller, i like the graphics, story and mechanics of it. If you dont have it yet, its a no-brain buy right now as cheap as it is. Only 0,79 cents in steamsale.  But if its not on sale I recommand getting Trine2 over Trine. As trine2 is simply better in many ways. And the biggest improvement of all: It has COOP! And trine really gets a lot lot better in coop. Ive had a blast playing it through with 2 friends. We're planning to do a replay on a higher difficulty. ;)  But nevertheless Trine (1) is still is a great game and a must play if you've liked trine2.",
            "review_score": "1"
        },
        {
            "review_text": "This is one amazing game! Gorgeous art and models, beautiful music, exhilirating combat, and rich story make this game a must have. I love it so much and I recommend it to EVERYONE!",
            "review_score": "1"
        },
        {
            "review_text": "Good: - Visual - Music - Gameplay  So-so: - Voice acting  Bad:  - Enemy variety  Worst: - Losing my save file (I've lost my save file 3 times. Cloud save is useless)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. So much fun with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a 2d platform puzzle game.  This game let me think of the Lost Viking games from the '90 era. Is a puzzle game you only can complete stages so use all 3 the characters special ability's. Graphic part of this game is so amazing for a 2d platform puzzle game. It can be a big challange to complete this game alone or together with 2 other friends. And yes the game support full 3 player co-op that makes this game very special. It's has a good and extended sotry mode that keep you alone or with friends busy for hours.  I'm a big fan of the game and will give it a 8/10 score.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for playing with friends online or locally, it's puzzles are simple enough to not get frustrated yet hard enough to provide a challenge. The characters all have different way to approach each obsticle and each can do it alone. Although the game seems a tad bit overpriced as me and my friend completed the game in 5 hours. If it is on sale you should definitely buy this. 8/10 for 5 hours of gameplay",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AMAZING!!!!!!!!!!!trine is a 3d modeled platformer.In the game you play as 3 characters the theif the warrior and the mage.You as the hero has been trapped in this wierd place buy magical stone and you have to get out of that mysterious place through puzzle solving,action,and etc.I believe this is one of the most beautiful games i have ever played and im really enjoying it.I reccomend it to anyone",
            "review_score": "1"
        },
        {
            "review_text": "Trine proves that if you have an original mix of ideas, even old school gameplay can still work great, especially when paired with incredible visuals and extremely polished code. So, it is a bit short and lacks long-term replayability, but don't let that stop you - Trine is definitely something special.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a 2D action puzzle platformer. You take control of 3 different characters all with different abilities on your way to take down your enemies, avoid hazardous traps and collect treasures. The visuals are beautiful with vivid colours and the animations are satisfying. There is nothing special about it's story, but it is enough to keep you going with a nice sense of storytelling. The soundtrack on the other hand is gorgeous with various orchestral tracks arranged by Ari Pulkkinen and it really fits the game.   With it's visuals, soundtrack and gameplay combined, Trine offers around 9 hours of pure fun and even more for the completionists. It's a must buy for every action puzzle platformer lover over there!",
            "review_score": "1"
        },
        {
            "review_text": "Go on a journey, alone or with friends trough a wonderful fairytail world full of puzzles and dangers! That's right, since the Enchanted Edition for Trine, it is possible to experience this adventure with friends. ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic sidescroller - very tight physics-based puzzles, with gorgeous graphics",
            "review_score": "1"
        },
        {
            "review_text": "I have played Trine when it first came out, many years ago, and i was pleasantly surprised by this little gem. Now, after completing Trine 2 this summer, i have decided to play first one in Steam. And, boy, it looks old. Well, looks are still pretty, especially some places like the Iron Forge. But the physics are bad, comparing to the new one. I know it is not fair. But it was harder to control objects and control heroes in this one. Experience collecting achievements are easier in this one, but still there are some hidden in lava or acid or other invisible places bottles, which made me mad sometimes. And skeletons. I wish there were fewer of them. They usually do not pose any threat and you just have to stand and shoot them, one by one, one by one, hordes of skeletons on every level section. You can skip them, if you don't want to collect enemies experience and if you don't want to level up or get the achievements. Yes, so you have to stand and shoot (or smash with the knight). This just creates boredom in this unique game of physics puzzles. So it could be less dumb enemies and more puzzles, or maybe a few smarter enemies. But i'm still recommending this now a classic game of its genre.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent and beautiful side scrolling, puzzle, platformer that is best played with two close friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game really has beautiful graphics with classic soundtrack and fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "trine is a puzzle platform game with a sweet fantasy setting and very quality graphics. puzzles are always obstacle-removing type. you need to remove obstacles or make your own way in order to advance in the level, using your three characters (thief, warrior, mage) and their unique abilities. puzzles are generally based on phyics and not very hard to solve.   trine is an enjoyable game. if you like platform games, puzzle games or fantasy theme (without dark atmosphere for once), game is recomended.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a beautiful game with wonderful mechanics. Although its story is purposedly simple, you will find that each character - the mage, the thief and the kinght - has a charm of its own and you will delight at how many different forms you can tackle the same problem with each of them.  I have played both Trine and Trine: Enchanted Edition. I wholeheartedly recommend any of the versions, although Enchanted is way more prettier and has updated props (which makes easier to spot in some of the most confusing levels), besides a nifty hardcore mode.  A must have for any platform lover!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and pleasant platformer for PC. Nice physical puzzles, many secrets, excellent graphics and music. Fairy-tale atmosphere for several evenings.  ------------------------------  Качественный и приятный платформер на ПК. Ненавязчивые физические головоломки, множество секретов, очень красивая графика и музыка. Сказочная атмосфера на несколько вечеров.",
            "review_score": "1"
        },
        {
            "review_text": "the beauty of this game makes me happy.",
            "review_score": "1"
        },
        {
            "review_text": "This game might not be the first with the concept of you controlling three characters with different abilities at once, but it succeeds greatly by using this feature. Most of the game (if not all) could be done with either of those characters but that would be a real challenge (and could've worked well for an achievement).  It took me less than 11 hours to complete the game with all achievements on hardest difficulty (not hardcore mode, because that didn't sound like much fun), so it falls a bit short on actual playtime. Nonetheless, I had a lot of fun these hours! The visuals are amazingly beautiful and the dialogs between the characters are quite fun.   There are also some small annoyances. Some menus (including the start screen if you don't know how the game works) rely on using the mouse instead of a controller. Some menus only sometimes work with the controller, which was really confusing. The gameplay feels sometimes a bit clunky, especially when you try to not fight extremely save with the warrior.  Still, it's a great game and I really anticipate playing the sequels.",
            "review_score": "1"
        },
        {
            "review_text": "Family-friendly three way enjoyment. ;)",
            "review_score": "1"
        },
        {
            "review_text": "It's a very interesting game. But you need patience because some of the puzzles are quite hard for beginers",
            "review_score": "1"
        },
        {
            "review_text": "This review is for the game ''Trine'',a side-scrolling action platform and puzzle video game,developed by the video game company ''Frozenbyte'' and published by Nobilis(wordwide).It was released in July 3,2009 for Microsoft Windows and since then the game has been released for the PlayStation Network,Mac OS X and for Linux as well.Trine uses the Proprietary engine.  Plot Trine takes place in a magical but destroyed kingdom.After a brief period of peace,the king died without leaving any heir.So the kingdom descented to anarchy.During this political instability an undead army appears and attacks the kingdom destroying everything that's on its path.  After some time three heroes,unkown to each other,reach the Astral Academy,a magical institution,where they touch a magical object,later said to be the Trine,and their souls bind together.After that incident they search for a way to free themselves of that peculiar effect.The trio must eventually undergoe an adventure searching for three artifacts that once reunited they could be free.Apparently the Trine is the artifact of souls and without it the other two(the artifact of the body and the artifact of the mind) created the undead making them responsible for all the chaos that polutes the kingdom.  After finding them they face a last ultimate challenge where they combine the Trine with the two lost artifacts,unbinding their souls forever.The game ends with the storyteller informing us that the kingdom has been cleansed from the undead and the three proclaiming it as its heroes.  Characters You take control of Zoya,the thief,Amadeus,the wizard,and Pontius,the knight.Each of them has special abilities.Zoya is the stealthy one of the group and uses her bow and arrow,making her an exceptional marksman.Amadeus uses the power of magic,allowing him to conjur objects(planks,cubes,pyramids) helping the team to overcome obstacles and reach remote areas with great ease.Last but not least Pontius uses his sword,shield and sledgehammer with great force,making him the group's main damage dealer.The player is supposed to combine the group's power together in order to accomplish difficult stunts and unlock the group's true prowess.  Recap Incredible game,breathtaking graphics,with exceptional yet simple plot.Enjoyed every bit of it and i definetely recommend it.  Edit Friday 4 July 2014 Trines has been updated with extremely good looking visual customizations and now is called Trine the Enchanted edition.You should try it out,everybody can be a Beta participant thanks to Frozenbyte developers.  P.S Support the developers.Frozenbyte thank you for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a game I can't recommend enough. It's a physics platformer with a rather unique mechanic of 3 playable characters. They are tied together by magic so you can switch between them at any time and use their abilities to make your way through the levels. Puzzles are quite varied requiring a number of different strategies, especially if you want to collect all the experience orbs which can be quite difficult to reach. All of the characters are well-balanced and necessary to proceed through the game. The game is also very well-written and acted which is a welcome change from most platformers.  Where Trine really shines though is the graphics. The art in this game is absolutely stunning and it's amazing how well it runs even on older hardware. It also makes use of nVidia PhysX for high quality physics simulation (nVidia hardware not required.) The world and levels are very well designed and quite engrossing as well.  The only thing this game is missing is coop, but that was added for the sequel which is just as awesome. Play them both! You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "I lOVE this GAME Loooooong TaME!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty important game, its not only adventure, its visual and narrative example how to probably child fantasy works while they are listening to good night story or book. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing indie title with production values that trump some big-name games. Beautiful music and graphics, fun Lost Vikings style gameplay. Puzzle platforming at its finest.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platform I ever played. The game is very well made and despite is slightly different than the second iteration it is a must buy for all players!",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game, especially if it can be had for cheap.  The graphics are good, and (for what it is) the writing is okay-ish. It has a bit of humour, and has personality that many games which cost five times as much would kill for. You can tell a lot of love went into this game.  SADLY, it's really janky. The platforming mixed with physics can be really frustrating to play, not because it's difficult, but because it's not very accurate. This can lead to lots of 'miscalcuated' jumps, and whatnot.  Besides that, there's really not much variety to the game, and the core mechanics of switching between Wizard, Thief and Knight to battle and solve physics puzzles really don't cut it after a couple of hours.  I'd be hard pushed to recommend this game at £6.99 unless you have a real itch for a physics-based puzzle/action/platformer. But if it's more than 25% off in a sale, go for it!   3/5",
            "review_score": "1"
        },
        {
            "review_text": "First of all, buy this game!  I am not really a fan of platformers and puzzle games but I really loved this one. And there are dozens of reasons I did.  Gameplay: It feels like an old school platformer with all the running and jumping across the screen, but it gives you something more than that. Unique abilities of the heroes allows you to make your own choices of how you want to cross a gap or how you want to get to some extra experience points. Moreover, you can vary methods of getting rid off your enemies - making it shooting an arrow (thief), waving your sword (knight) or smashing them with a box (wizard). The puzzles player encounter through the game are not hard at all, still hard enough to feel satisfaction of getting through from time to time. Maybe that doesn't sound that fun or new, but believe me this is really entertaining.   The only down thing about the gameplay is Boss fights that feel repetitive and rather dumb - hit &amp; jump.  Gaphics: The game has unique atmosphere and the art of each level is just beautiful. I found myself feeling really enjoying the picture. Enchanted Edition stands for enhanced graphics edition for the original game and it feels pretty up-to-date.  Controls: Strange thing - I tried to play the game using Xbox controller and found mouse and keyboard far better way of playing the game. Still it is pretty much playable using gamepad. I was also happy to find out that there is a local co-op mode in the game which allows you to play the game with your friends using gamepads and mouse &amp; keyboard at one machine.  Verdict: This game has a really strong impression on me. I was surprised how I got into it easily and spent first two hours feeling like it was only 15 minutes. I really like spending some time after work playing it - feels relaxing. And after I finish this one there are still Trine 2 and 3 that await me.  I recommend it to all of you guys.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, its a platformer/puzzle/adventure. It has a mini skill tree. Not bad graphics.  Issues: -there are gliches that disrupt gameplay. -not much replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, especially for Co-op, totally worth to buy. I used it as night co-op complited in 4 hours. Pretty cool. :)",
            "review_score": "1"
        },
        {
            "review_text": "It's funny to play with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "Trine brings platforming games to the front page. I feel like I'm going to say a lot of the same as what you'll read in other magazines.  Its beautiful... its thoughtfully designed... though I won't say its challenging. Its easy just like a lot of games of our current day. When you have been gaming since the 1980s and things like ghosts and goblins I don't think anything is as challenging.  It will keep your attention for some time as there are many different ways to get through the levels. It gives you options which is nice for this day and age. Its like a platformers deus ex when it comes to choice. Though generally you will find that the warrior is less played and that you spent most of your time either as the rogue or the wizard as they are the most playable. I feel like the warrior was just added in there so they could call the game trine.  It may sound like I'm bashing the game a little but in the end I enjoyed it a lot. Probably the most through the achievement challenges and trying to beat the last level without taking any damage.  If you buy it and you like platforming games you'll love it.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game with good RPG system :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game",
            "review_score": "1"
        },
        {
            "review_text": "Played the demo then bought it during the Holiday Sale. Fun title. Beautiful graphics and a blast co-op. Will be getting the sequel once this one is beaten.",
            "review_score": "1"
        },
        {
            "review_text": "Side-scrolling rpg with puzzle aspects and beautiful artwork - what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "What an absolute joy to play and a really beautiful looking game. As far as platformers go this has actually been more fun for me, if of course less challenging, than Super Meat Boy which is one of the best platformers of all time. The colours, sound and voice acting are all so well created and put together that I struggle to find any flaws with the presentation and audio. The story is very simple as you would imagine so if you're looking for some sort of epic tale then this is probably not going to be first on your list. Controls are fluid although you cannot use a controller, something which I believe they fixed in the second edition to this series. I couldn't reccomend this game more to people who enjoy platformers or want to support good indie gaming or hell even people who just like looking at something pretty. Replay value is pretty high as there are tons of secrets and achievements to conquer as well as hard and very hard difficulty modes respectively. Overall a brilliant game and well worth the asking price on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice platformer, feels a bit oldschool but provides a lot of easy, relaxing fun. It brings some Lost Vikings memories, however Trine seems much easier. Fun! :)",
            "review_score": "1"
        },
        {
            "review_text": "I fell in love with the Rock-Paper-Scissors digital edition that is Trine back when it came out on 360 and it must have been the shader quality that is still there to this day, but something about it had me hooked. It has very well lit levels, and yet all the levels are dark, with fire everywhere, and enemies intertwined on different platforms, with swings, slides, and other sorts of mechanical objects to manipulate, but the way the light plays on the surfaces makes it into pure videogame artistry. With a difficulty at higher levels that makes even me cringe at the repressed memories of what it takes to beat the last level of this game without dying, it could take a normal gamer over 80 hours to even get close to perfect completion. I only stood a chance because I almost beat in on 360 when it came out, investiong about 80 hours, but by comparision the 360 version looks too ♥♥♥♥♥♥ to enjoy as purely as this. Before the Enchanted Edition I could run this game at max settings, not anymore. That's amazing. They really cranked the fidelity and extended the life of a game that didn't even need to be revived, I wish this would happen with more games.",
            "review_score": "1"
        },
        {
            "review_text": "A enjoyable platformer game. The graphics are wonderful! I couldn't of asked for anything better.",
            "review_score": "1"
        },
        {
            "review_text": "This was a mindblowing puzzle-platformer game. Graphics are among the best ive seen for it's genre. 2 player is very enjoyable(thats how I played it anyway) and I cant wait for Trine 2! Gameplay is fun, there is alot of hidden stuff in the game, achievements are easy to get, none of them are impossible or near to.  However, it might be a little bit easy, while the last stage and secret stage are ridiculously hard, especially on hardest difficulty.  i'd definitly recommand this game to anyone that likes Platformers.  Overall: 9/10.(a longer game with an online mode would give it a perfect score!)TRINE 2 HAS ONLINE CO-OP.  Note; trine 1 still has LOCAL-CO-OP.",
            "review_score": "1"
        },
        {
            "review_text": "The Trine serie is just...simply awesome, can't find any other words, especially for the first 2 games. I would recommend this game even if it's full priced!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, multiplayer (or singleplayer) puzzle platform game. And it looks magical! :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best coop games :p",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Great physics mechanics!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. Fun to play. Worth your money, especially when its a deal.",
            "review_score": "1"
        },
        {
            "review_text": "Trine was fun, I really enjoyed playing it. The graphics are so beautiful, and all the maps are well-designed. The soundtracks is also very unique. Quite interesting story and the game overall is nice. Nothing to complain about really!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best coop games :p",
            "review_score": "1"
        },
        {
            "review_text": "Best 2D game i ever played.Interesting gameplay,beautiful graphips.",
            "review_score": "1"
        },
        {
            "review_text": "Graphic design is for me by far the strongest advantage of Trine. This game is simply beautiful. Gameplay is satisfying - not very challenging but smooth and really fun to play. Trine has a co-op mode so it`s definitely worth trying if you are looking for a game that you can enjoy with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "Great platforming game with great visuals and a pleasant soundtrack. Also great for co-op hijinks.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, they're making an enhanced edition with coop like Trine 2 so worth checking it if you are into platform puzzle games. Very casual setting. Enemies aren't difficult, makes you feel smart getting past obstacles, relaxing scenery and music. Only took 5-6 hours to beat but unfortunately not much replayability. Still worth the buy if it's on a Steam Sale.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Casual and the soundtrack is so damn good. Great game, fun story and cool characters. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun sidescrolling/platformer fantasy game with some RPG elements in that your characters do earn skill points that you get to choose to allot to any of the up to 3 skills per character. There are 3 characters, including a wizard/conjurer, a thief/rogue, and a knight/warrior. Each is designed to be quite different in abilities and playstyle because you will be using all 3, which you can switch between at the push of a button as you play. You make use of the talents of each to progress through the levels, enemies, and puzzles. It is a pretty unique system and is well implemented. The game will probably not take you more than 10 hours to but the visuals/environments look really good and it does a good job of keeping you engaged and wanting to always play just a little longer to get to the next checkpoint. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "The game is great to play with friend(s) I shared many laughs whilst playing this game although its way to short for what you pay for",
            "review_score": "1"
        },
        {
            "review_text": "Quick Summary: Side scrolling platformer with great graphics and some tricky (but not too tricky) puzzle solving and light combat. Great game for casual co-op as well.  You play a trio of heroes trapped in a single body by a mysterious magical artifact called the Trine. While your souls are bound, you can be any one of the three characters at any time: Wizard, Thief, or Knight. Your quest is to find out why you’re bound together and how to undo the “curse.”   The game is played with keyboard and mouse though other players can drop in using a game controller on the same computer. You progress mostly from left to right in a two dimensional plane with a lot of jumping and scrambling from one level to another. With a press of a button you can instantly switch between the three characters, each with their unique skills useful for fighting (knight) grappling (thief) or conjuring objects to use (wizard). Each of the characters has their own life bar so if they die you need to either make do with the other 2 characters or backtrack until you get to a checkpoint (a glowing sphere). You can backtrack as much as you want in this game, which is useful since there are a lot of collectibles to be found. The collectibles mainly come in the form of experience potions, and when you level up you can upgrade skills unique to each character class (for example increasing the number of objects the wizard can have conjured at any one time).  Pros: +Amazing graphics for a little indie game. The environments look 3D despite being a simple side scroller. +Free upgrade to the Enchanted Edition. The upgraded version uses the Trine 2 engine and got a large number of new Steam achievements. +Nice story with good narration. The narrator appears as an announcer in Dota 2 so you may recognize his voice.  Cons: Not much really, the game is awesome.  This is a great, cheap game that anyone can get into. If you didn’t get it for free sometime in the past you can probably see it in Humble Bundles occasionally. Play with friends and family! ",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game. You are switching between 3 main characters, a wizard (who I have named Harry), a theif and a knight. Each of the characters have their own abilites (a bow, magic ect) which can advance as the game goes on. The setting and people looks realistic, but it is not a graphic game. Overall, I would recommend Trine to anybody with a sense of adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a unique blend of 3 classes, puzzles and physics-based adventures. The game itself plays out very nicely, the Enchanted Edition allows for more visually stunning graphics and you can easily lose track of time completing levels and killing skeletons. Can't wait to play the second one!   +  3 different characters/mechanics  +  3 unique abilities  +  Filled with puzzle elements packed with several solutions  +  Often requires rethinking your strategy  +  Best fun I've had in a game in local Co-Op mode!  +  Lots of Achievements  +  Trading Cards (Emotes/Backgrounds)  -  Some levels can be really frustrating  -  Different controllers are set up differently     Personal Ranking:   7.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "I only played half an hour of this game, but I am already Impressed. The graphics are amazing, the lore is too. The gameplay is so classic, reminds me of all the times I played prince of persia as a kid. I hope this game gets recognition because it looks like the developers put some of their souls and lives in this game  Must get, please this is in sale a lot already  If you have nothing to do, read a book , play some ball, or play this",
            "review_score": "1"
        },
        {
            "review_text": "Trine caught my attention cause I love platform games. This one took me by surprise. The attractive graphics, smooth animation, and the interesting differences between characters make this game a must play. Now with enhanced graphics using the Trine 2 engine, this game only got better. There are some downfalls to this game such as the fact that you fight only against skeletons and then a dismal amount of bosses makes it too repetitive. Other than that, it's a great game that you can't miss. Frozenbyte, the creators of the Shadowground series, has definitely put their name on the map with Trine.",
            "review_score": "1"
        },
        {
            "review_text": "Happy with the game, nice designs. I thought it was going to grow quicly into a frustrating difficulty level, it did but wasn't that bad given the different angles that could be taken.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for one or maybe two evenings with your friends.   I only recommend playing it with two friends locally because alone it is just a wild switching of characters. The fun comes if you can't switch on the most useful character at the time. So you get to think.  Even funny if you play with drunk people although I mostly feel annoyed by them.  Still waiting for my two mates to get another session, since we just got to the second to last stage.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a fun 2D platformer with puzzle elements. The only problem I have with it, is that it is way too easy. There is no penalty for dying besides going back to a checkpoint and even then, enemies don't respawn. I do like this better than the sequel though. There is more gameplay and less story than Trine 2, which I prefer. If you want to play a fun game that does not take itself seriously, I would recommend it. Not a amazing game, but still good.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "stunningly beautiful game. the models and atmosphere, steampunky feel and very interesting 3 in 1 chaharcter play. Not much into platformers, but have a found a few that are fun and unique...this series is certainly in the top, with Limbo and a few others. Certtainly worth a spot in your library.",
            "review_score": "1"
        },
        {
            "review_text": "A big yes! Do buy this game and you will not regret it! While you have to solve the puzzles truly   thinking   about it, you won't be hurried. You will have to be pretty precise, especially with the wizard, but not frustratingly so. Creativity is required, and there are many ways to solve a problem. Beautiful graphics and a fary tale like narration really make this game a little gem.  The only problem I found is that, if you are playing with a controller (mine is an Xbox one), the game doesn't tell you how to use the abilities of fire arrows (Y) button, titan force (left stick, tap right stick, tap again when fully charged // LT for the quick burst), and the hammer (Y again). It really worried me for a minute.  But then again, beside that it's truly, absolutely, completely worth it. Can't wait to play the second!",
            "review_score": "1"
        },
        {
            "review_text": "Just as amazing as the reviews said it would be. The absolute best of the best platformer as far as I'm concerned.",
            "review_score": "1"
        },
        {
            "review_text": "Verdict: Why haven't you bought this already?!  This game has just had a completely free, absolutely stunning graphics upgrade, and co-op multi-player added where it originally had none, 5 years after original release, FOR FREE. Let this sink in for a moment, in this day and age of nickle&amp;diming for worthless trinket pixel additions or triple A pricing for practically untouched re-releases. If you already own this, it is worth reinstalling and playing all over again; if you don't own it, it's worth every penny.  At the current sales price of 80-90% off for ALL Frozenbytes games (Trine 1&amp;2 and Shadowgrounds), you really should just stop reading this and go buy whatever parts your collection is missing, right now. In fact, buy copies for all your friends. This company needs encouragement, and their success needs to be a bright beacon of enlightenment for games developers and publishers out there.  There's free demos to all their games if you're still doubting. Its unique experience is best understood through direct gameplay anyway. Get it, play it, then tell me again this isn't worth paying for.  Btw, performance tip: if you use the enchanted version with an NVidia GPU, make sure to add the trine1_32bit.exe file to the NVidia control panel under Manage 3D Settings, otherwise even though it uses the same engine as Trine 2, you will get a lot worse performance. The enchanted executable is in a subdirectory of the main Trine game folder. Doing this with the free downloadable nvidiaInspector and adding to the predefined Trine 2 profile is probably the best way to take advantage of the optimizations for the updated engine.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a nice combo of co-op and platforming action, puzzle game. I like this game because it's hilarious to play with your friends. And ofc by yourshelf as well. Just like masturbating. Although that is much more fun with a good looking handsome guy!",
            "review_score": "1"
        },
        {
            "review_text": "Great colors and fun gameplay  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Very polished 'platformer'. Simple puzzler, good fun; well worth a fiver in the steam sale!",
            "review_score": "1"
        },
        {
            "review_text": "A great game series that has the most unlikely group of heroes",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite interesting. Fighting and strategies.",
            "review_score": "1"
        },
        {
            "review_text": "This here is my first review, and I can wholeheartedly say that I'm glad my first review is this game. This game is, frankly, amazing. Honestly, I don't even know what makes it so good. It  should  just be your everyday platformer game. Jump around, try not to fall, etc. But it's not. It's so much more. The story isn't too bad, actually it's pretty good. The characters are all funny and lovable. The puzzles are fun to solve, and there are multiple ways to solve them. You could just try to jump across the gap, for example, or you could have your wizard conjure a bridge to cross. Or, you could have your thief grapple hook over the gap. The art is beautiful, just beautiful.  BUY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and beautiful",
            "review_score": "1"
        },
        {
            "review_text": "Fun and beautiful",
            "review_score": "1"
        },
        {
            "review_text": "I usually hate platformers, so this is saying something. This game is ♥♥♥♥ing awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say, I was given these games as a gift. What a cool thing, to find a game with the appeal of a well crafted game. This game has so much lush beauty that my video card (GTX 580Ti) is Loving being opened up and showing all the bells and whistles. The upgrade made Trine 1 look better, but they Both are Beautiful, and are Really fun to play. I've been told it is a benefit to use the WASD and mouse but I have, not seen a problem with either. Could be a slower or pooer performing Video card. I haven't touched a thing. If anything, I turned it Up! Have a look at some of the Trine 2 Screenchots, they'd make a great set of rotating screen savers .",
            "review_score": "1"
        },
        {
            "review_text": "Great platform game I've ever played, I love the graphic and gameplay. Thanks to developer team",
            "review_score": "1"
        },
        {
            "review_text": "Don't care for the physic based puzzle ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "British Accent Simulator. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Bleh. It's not bad or good, it's just bleh. The story and characters are generic, the jumping is floaty, and you can easily beat the first levels in no time at all as the wizard (hence why I have such a low playtime), thus negating the other characters. The game looks beautiful and has a great soundtrack, but that's it. If as much time and heart were put in the actual game as the soundtrack, this game would be stellar.",
            "review_score": "-1"
        },
        {
            "review_text": "addicitive and great story",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite indie games ever!!",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia all the way, would buy this game again 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Im impressed by thise games concept, it holds an amazing story. Great for relaxing. Played on easy died on spikes in the first five minutes - nnoobbbbbbbbbbbbbbbbbbbb",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, lots of fun and still a good challenge.  and with the enchanted version it makes the game even better, certainly worth it",
            "review_score": "1"
        },
        {
            "review_text": "Trine combines puzzles, platforming, and fighting in the most awkward way possible.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice story, wonderful atmosphere, well balanced puzzles and characters. A must have, but 19.99 euros is definitely too much for a game that will last 6 hours. Got it on sale for 3 euros.",
            "review_score": "1"
        },
        {
            "review_text": "many graphics  such co-op so indie wow",
            "review_score": "1"
        },
        {
            "review_text": "I can't in good faith recommend paying for a game that has nagscreen advertisements in it. (just like old shareware)  Showing an ad once may pass as 'information'. Showing it everytime is a nagscreen.  Otherwise it's an ok game.",
            "review_score": "-1"
        },
        {
            "review_text": "i think this game cannot run on OSX 10.11",
            "review_score": "-1"
        },
        {
            "review_text": "Really relaxing puzzle-adventure game. Buy it at a cheap price.  SCORE: 77/100",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Trite, short, mechanically simplistic.   The key gimmick is playing with your friends, but it's not like the gameplay is engaging enough to make it any challenge for you. Doesn't have much visceral pleasure to or it logical complexity.  The only recommending point is its price.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought Trine and installed it on my PC. Trine came with addware that my anti virus software detected. The addware was quarantined and the game would not work with the addware in quarantine. The steam help refused to admit that there was adware in the game but they refunded me for the game. Don't purchase this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I did not play it so much, but I think it has chronic platform game problems. It is not bad game but it made me angry with ranger. I left playing it, I won't return. And it's story line seems mediocre.",
            "review_score": "-1"
        },
        {
            "review_text": "An okay co-op puzzle platformer with a slightly heavier emphasis on the platforming. While the graphics look fairly nice, the puzzles themselves are not really difficult or thought provoking. In fact, many of the 'puzzles' can be exploited when playing with a partner.  I can't really recommend playing this without another person.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is very dull,boring,and repetitive. Sure the music and graphics are nice. Everything else is boring. I seriously wish I could get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Rito trolled me and over charged me. Stupid game Riot go back to making world of warcraft",
            "review_score": "-1"
        },
        {
            "review_text": "The lack of online or even LAN co-op is a ♥♥♥♥ing kick in the ♥♥♥ for this game.  This is a good game. This is a good ♥♥♥♥ing co-op game, but seriously, a friend of mine gifted it to me and some other friends thinking Hamachi would help us, but not even that works.  I do NOT recommend this game simply because it would be a lot more enjoyable in online co op. And I mean, A LOT.  That being said I hope some programmer reads me and agrees with me, and creates a mod or even a hamachi server to play online with friends.  Thank you for your attention. Don't buy unless you want to play it singleplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "Having three characters in one was an original and worthy idea. However, in solo, that concept break down because of Zoya. Zoya has a grappling hook, that allows her to bypass most puzzles, and zoom accross levels. It's fun to stay in the air for a long time, but that doesn't provide for interesting challenges. Also, since she is also good in combat, she makes Pontius optional, and since Amadeus is so limited, he too is almost optional.  The game is obviously meant to be played in coop, so that each character's weaknesses must be compensated by the other's strenghts. You wouldn't be able to zoom accross the level with Zoya, because you would have to find way for Pontius and Amadeus to cross the obstacles. However, I haven't had an opportunity to try that, so i can't tell you if that actually works.  However, regardless of whether you liked this game, I do recommend Trine 2, which is awesome in all regards.",
            "review_score": "-1"
        },
        {
            "review_text": "If you play this with friends,be ready to break your friendship. if your friend is a noob at games,your going to regret the purchase. IT MAKES YOU ANGRYYYY ! puzzles,puzzles and more puzzles !! dont play in enhanced mode,play in original mode,SOLO !  4/10 never going to play this again !",
            "review_score": "-1"
        },
        {
            "review_text": "NOPE. NOPE. NOPE. If you think about buying this, don't get Trine 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Personally, I would wait for this game to go on sale after playing through the entire thing. I appreciate what they were trying to do, but with infinite enemies appearing out of thin air in difficult areas, to me it stressed me out way too much. If you take your time with this game, you will have fun. But there can be points where it gets to be too much and you just want to get to the next level. Once you feel this way, the game becomes a hassle. The sequel is much, much better because it addresses pretty much every issue with the game. Brief review for this, I know, but I can't bring myself to dedicate too much more time to anything related to this garbage game.",
            "review_score": "-1"
        },
        {
            "review_text": "I do not recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful game. Highly recommend. Didn't care much for the story but the gameplay was fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely side-scrolling action puzzle game with gorgeous level design as well as a fantastic soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Great",
            "review_score": "1"
        },
        {
            "review_text": "Great side scrolling 3D puzzle solving rpg'esque game, with some combat and item collection thrown in.  ",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of The Lost Vikings. Quite fun to play, and beautiful too.",
            "review_score": "1"
        },
        {
            "review_text": "Solid platformer with amazing atmosphere and art.",
            "review_score": "1"
        },
        {
            "review_text": "Warier &gt;&gt;&gt;&gt;&gt; Thief &gt;&gt;&gt;&gt; GOD, ya i know who i am playing as",
            "review_score": "1"
        },
        {
            "review_text": "If you're into puzzles, this is the game for you. Unique system of 3 characters with different abilities. You have to switch between the different skills to solve tasks from piling boxes, to swinging over a chasm or even building a bridge over it. Very fun to play with friends.    Pros: ",
            "review_score": "1"
        },
        {
            "review_text": "Borrows from the eternally playable 'The Lost Vikings' but so much prettier!",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a fairly short but beautiful game. It isn't really challenging and the story lacks any big luster. However, I think it's worth buying. You get to control 3 heroes, each with unique abilities. While linear, you have the option of getting to the end of each level with the help of each hero, in whatever way works for you.  The wizard can summon platforms, the thief has an awesome hookshot, and the warrior... well, he can take on multiple enemies. The game has a classical fantasy theme that works really well. However, I think there should've been more character narrative during each level, just to build a bit of a relation between each hero.  The gameplay really has a Lost Vikings theme to it, with each hero having key moments in order to advance further. The music is pretty good but not too memorable as opposed to other games I've played. This said, I still think this is a unique game based off the gameplay. Still buying the sequel!  3/5 Rating",
            "review_score": "1"
        },
        {
            "review_text": "Excellent side scroll plataformer, puzle and action game",
            "review_score": "1"
        },
        {
            "review_text": "3/10",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful, straight-up platformer with the classic fantasy archetypes: warrior, mage, thief. Put it on your wishlist and wait for a sale. This game will fix a rainy day for you.",
            "review_score": "1"
        },
        {
            "review_text": "Firstly, this game was something to marvel at through the entire playthrough of the game. The background and environment was colorful and vibrant while seeming to fit the design and ideas of the story. The story is not the greatest and is not to much different from the usual, save the world and live happily ever after but it was still enjoyable. I would definitely recommend this game to just about anyone but more so to people that love platformers or anyone that just wants to have fun with up to four friends. All in all, this game was fun and really crazy with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun, side scroller with puzzles, arcade style action, and 3 characters to instantly cycle through to complete challenges with. Get this game, and all other additions. Graphics are beautiful, landscapes are amazing, music is mystical, to fit the game perfectly. This game lets you envelope yourself into the story and game it's truly an enjoyable game to run through. Great narration throughout to tell the story. A MUST buy! A MUST play!!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, just like Trine 2 :) Great co-op, beautiful graphics-that makes the game fantastic!!!",
            "review_score": "1"
        },
        {
            "review_text": "cool plattformer, using Valve's (graphic and physic) Source Engine. Cool looking and imaginative graphics, good balancing with the 3 playing classes/characters. i prefer the mouse-keyboard controling, doesnt work that good for me with a gamepad. hope the following part will have a bit more variety in solving the puzzles/challenges and 'online' multiplayer !",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this game. love the full controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful platformer. I always like to get back to it every now and then. Sometimes challenging, but never disappointing.",
            "review_score": "1"
        },
        {
            "review_text": "Congrats to the develepoers, I rarely encounter such perfect game, both soundtrack/visual/story. Definitely worth the price :) Keep up the good work (y)",
            "review_score": "1"
        },
        {
            "review_text": "Definitively one of the best platforms I've ever played. Nice, fresh and fun game. The coop mode is awesome, full of possibilities.   - Pretty good and cheap!",
            "review_score": "1"
        },
        {
            "review_text": "An incredible, if a bit short, adventure. Definitely worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "3 Heroes 1 soul !!  Pros :  Vivid graphic , 3 Different playable characters and you can swap for anyone at anytime , some puzzle to solve , chilling gameplay.   Cons :  Can be boring if play for a long time ,being a 'Platform game' might not suit for FPS or RPG fans.  Verdict :  7.8 / 10",
            "review_score": "1"
        },
        {
            "review_text": "a good game to get the other half involved in :) takes all the pressure off you with all the zombie one player games we all seem to love haha",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a beautiful, interesting platformer with a decent difficulty curve, I'd recommend it to anybody who likes platformers or games with a midieval theme.",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the horrible HDR lighting, this is a good 2.5D platformer than any fan of lord of the rings, or medieval fantasy will absolutely love.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game. I highly recommend it. Great gameplay and puzzle-like environments. Almost impossible to find all the EXP bottles by yourself though. Doubt I will play it again just for that though. Will be starting Trine 2 real soon!!!",
            "review_score": "1"
        },
        {
            "review_text": "*Gnome Seal of Approval* Superb indie platformer where you control three characters. You can switch between the characters at all times. A melee fighter, a ranger and a wizard. You'll need them all to traverse the levels.  Highly polished game with a great atmosphere and a bit of humor as well.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best plaformers i've played on PC",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun games I have played that includes both action and physics that is also puzzle based.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an awesome fantasy-style side-scrolling puzzler!  And I must say, even for a side-scroller, this game as some amazingly beautiful graphics!!! You control 3 different characters each with their own unique abilities to complete puzzles+stages ranging in difficulty. I highly recommend this game! 9.75/10, 4.75/5 stars!",
            "review_score": "1"
        },
        {
            "review_text": "Score: 7/10  This is a fun little platformer with pretty descent graphics for an indie game. I strangely don't know if having enemies in the game was even needed other then for a sense of enforcing the main story. The constant spawning of enemies actually for me came off annoying and I was just always left wishing they would just stop so I could move on. Eventually I just started climbing over them when possible and rushing through. The puzzle mechanics and platforming were spot on for the most part. The world is beautiful. The narrator is awesome combined with the games musical score.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best co-op adventure games I've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome graphics and scenarios with lots of different ways to get to the next stage.  HOW you decide to get pass the stage gives a clue to who you are in real life! ;)  Graphics, sounds, music, gameplay, it's all there. Totally worth my time and money.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautifully made game. Lots of fun. The sequel is even more beautiful and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Visiually appealing 2D puzzle/platformer that rewards inovative use of the 3 classes skills.",
            "review_score": "1"
        },
        {
            "review_text": "this game is quite simply a fantastically fabulous exercise in frivolous fun!",
            "review_score": "1"
        },
        {
            "review_text": "Congrats to the develepoers, I rarely encounter such perfect game, both soundtrack/visual/story. Definitely worth the price :) Keep up the good work (y)",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and beautiful little game. ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Beautiful settings, great soundtrack and really fun gameplay. Diggin' it.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game, this is one of the best platformer games i've played,   +Gameplay (can use 3 characters and u can upgrade the characters become more powerful) +Nice visual graphics  +Background music +Dificult enough puzzle  ",
            "review_score": "1"
        },
        {
            "review_text": "'Nice little indie title with some great physics, a game that worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "One of the few rare titles where everything seems to fit together almost seamlessly. The graphical style is beautiful, the music is wonderfully enchanting, and the dialogue, while being light hearted, is performed to perfection. The puzzle mechanics are also intelligently designed, making clever use of the physics engine while keeping controls and combat relatively simple. Each character has a unique role to perform and you'll find yourself switiching characters often in order to fully utilise these roles.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to waste some time whilst waiting for your Fiance's 'I'll be ready in five minutes' rants to be over, this game is definitely for you. In the '5 Minutes', I managed to complete most the achievements, finish half a pack of smokes and have a laugh. Fantastic gameplay, Funny Scripting 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! 10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "though the story is a smig flat, i still enjoyed the game ten outa ten would physics again.",
            "review_score": "1"
        },
        {
            "review_text": "Shiniest game in extistance.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun games I have played in a while! I don't know if I have ever really liked a sidescroller aside from Trine. Great work : )",
            "review_score": "1"
        },
        {
            "review_text": "its good game. nice story nice adventure nice fantasy nice music nice puzzle  its like pancake with ice cream and chocolate.  my review its 8.75/10  ",
            "review_score": "1"
        },
        {
            "review_text": "really good game to waste your time with 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy gaming, but I'm really not very good (bad eye-hand coordination) and usually get can only get so far before finding something impossible for me to achieve. So far I am finding this game a lot of fun and have not yet come across anything that is impossible to do since between the three characters there is usually a way to overcome any obstacle.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "Finish'd at 100% in 10hours with 2 friends on Hardcore/Hard/Classic for 2€ it was worth it but we had the experience of Trine 2 (30H) with the same difficulties like Trine 2 the Areas/Music are freaking amazing the last level is intense as hell.  Must be played with Friends, must buy if the game is on promo the enchanted edition made it look like Trine 2 (Beautiful)",
            "review_score": "1"
        },
        {
            "review_text": "Very beautiful and fun platformer. It is easy and short, but it is worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely marvelous. This game has everything; the most beautiful graphic design, funny story, charming music and very clever and satisfactory gameplay. It is the equivalent to Willow in a videogame for me. 110% Recommended for everybody: hard gamers, casual gamers and no gamers also.",
            "review_score": "1"
        },
        {
            "review_text": "Once I started, I had to finish. The story wasn't too deep, but interesting enough. So were the characters. Even though you play as three people, it's really easy to switch from one to another. It flows so well, I feel like I'm playing as one. There are some puzzles, figuring your way through the level. Character builds aren't complicated and the overall gameplay was quite enjoyable. I admit... the very last level was a pain in the derriere, but I still give Trine an 8/10. The only downside, in my opinion, is the wizard's incapability of defending himself. Not good.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent platformer/puzzle. Great graphics and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game!  It's a bit on the easy side but it controls really well and it's fun to go through the levels. Unlocking the achievements is easy too (even if time consuming), so it gets a big thumbs up from me.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful music, graphics and easy interface! A good choice to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Jump n' run &amp; puzzle game with some combat. Well designed, nice art and perfect for local co-op. Exactly what I was looking for. Can't find any flaws in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Don't read reviews. Go see some screenshots and buy it. Your eyes and ears will be thankful. Use a mouse, unless you like pain.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed the game. We played it together with my friend - best way to play it - in my opinion :)  + beautiful graphics + nice gameplay + multiple ways to solve the problems  - little bit too high requirements - but you can always play on lower res.",
            "review_score": "1"
        },
        {
            "review_text": "Visualy one of the most beautiful games I've ever seen",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun game. Great and unique concept that is just challenging enough to be fun without making you rage. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "An absolutly gorgeous platformer. Its not very challenging and not very long in terms of length as it took me less than nine hours to complete including the achievements but depending on how skillful you are, your mileage may vary. It's definitely worth a playthrough if you're a fan of these types of games.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. Even at hard, the game is forgiving with a good balance in checkpoints. You really must play this carefully by finding the chests with skills and collecting XP to be able to upgrade your skills. Otherwise you will not be able to complete the game. The story is OK, but not necessary to follow. Gameplay is good and switching between characters is a must and gives the game a little extra.  Do mind that you're better of with this than Trine 2!!",
            "review_score": "1"
        },
        {
            "review_text": "A good side-scroller game with a good story, took me back to the days of playing on a nes and mega drive",
            "review_score": "1"
        },
        {
            "review_text": "Nice game to play! wonderful 2d plane game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "Kinda old and still one of the most beautiful side scroller games out there. I really recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "i love it looks GREAT has a good story and best game play ever",
            "review_score": "1"
        },
        {
            "review_text": "Excellent platform game.  Nice music and landscape.  A good moment to share with friends or family.",
            "review_score": "1"
        },
        {
            "review_text": "honestly, one of the best platform/puzzle game released in this decade. beautiful graphics and mood-setting sounds really polish up the game nicely. can be played with kb+mouse but equally as fun and efficient with a gamepad. trine1 and trine2 can often be found on sale either on steam or other sites, so you do yourself a favor and pick them both up for a pleasant experience.",
            "review_score": "1"
        },
        {
            "review_text": "Simply beautiful",
            "review_score": "1"
        },
        {
            "review_text": "Trine is amazing! I know you may have heard some stuff from people that say 'hey dont play a game called trine it really sucks' or 'only panzies like games like this' but this game sir/ma'am is a very good one despite all of the haters of trine. Basically you play as these three characters that start out in seperate bodies and by fate they all seem to meet at the same place at the same time. And they all touch a crystal and all three of the characters transform into one body which they can change from the wizard, knight or thief. This is a very good platformer and I love this game! Hoping to get trine 2 soon...",
            "review_score": "1"
        },
        {
            "review_text": "Well designed, fun, beautiful.  Note : although it is designed for co-op multiplayer, it is also playable (and enjoyable) as a singleplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game with good graphic.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzle are not to hard.But anyway I recommend for design. It's very beautiful. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "i love it becase its amsome",
            "review_score": "1"
        },
        {
            "review_text": "A friend of mine asked me to buy this. At first, I was slightly sceptical but I really took to Trine a few minutes into the gameplay. It's a tremendous puzzle platform game. Nice storytelling, smooth and engaging gameplay. I would more than recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The Trine is simplistically genius. Totally worth three times what they sell it for. Of course, I waited till it was that price, too.",
            "review_score": "1"
        },
        {
            "review_text": "I played Trine 2 first and was maybe spoiled by that game. Trine 2 is gorgeous, one of the best 2D with 3D elements games ever. This is a great game too, but not near Trine 2.",
            "review_score": "1"
        },
        {
            "review_text": "Wow magic, such boxes and planks... Liked it.",
            "review_score": "1"
        },
        {
            "review_text": "A great platformer bedtime story. Beautiful graphics and music, smooth gameplay, and loads of fun. Highly recommended. Also you might as well buy the Trine Complete bundle because Trine 2 is also amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Such an amazing indie game, the sequel just came out as well which is even better! This is a series that is an instant classic. It has it's own quirks and gameplay that developers today should take note of. Worth every penny, discount or not!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, I love getting lost in this world.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome but steam is ♥♥♥♥ing ♥♥♥♥ so annoying causing problems to this game",
            "review_score": "1"
        },
        {
            "review_text": "Fun,easy and a good story that goes along with it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "While playing I had a love and hate relationship with it, a lot of times it made me angry, but at the end I quite liked this 2D platformer/puzzle game.  The game has the most generic medieval fantasy setting you can imagine, but its really colorful and on high settings looks really great. Music also is generic, but fits well with the game. Story isn't anything really new and original.  But I guess the most important part of this game is game-play. Each character has its own unique skills and abilities, so it makes game more interesting. Puzzles are a bit challenging and can be solved in more than one way. Platforming is challenging too, but at least for mouse and keyboard, controls felt really sensitive, and in some parts, made game really hard, where you had to make really precise jumps or landings, maybe with controller it's different.   Game is definitely worth it's price, and if you are into this kind of thing, than be sure to try out!  I gave it 8,1.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty great game really.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is great fun in single-player and it's worth experimenting with the three-player co-op even if the game works best as a solo experience. Players are given a set of tools, and are presented with problems that can be solved in several ways, resulting in an adventure that feels wide open despite being relegated to a mere two dimensions.",
            "review_score": "1"
        },
        {
            "review_text": "very nice graphic ;) :3",
            "review_score": "1"
        },
        {
            "review_text": "I originally said this game was NOT recommended because Trine 2 was better and both could be had for great prices. But they've just recently enhanced this game with the Trine 2 engine, and my main irritatant - the controls - are now as good as Trine 2. The graphics are also even more beautiful now.  Thank you Frozenbyte! I have to love a company that acknowledges and 'fixes' the older product in this manner.  Trine 2 - The Goblin Menace is also a great game. Buy both! Both recommended!",
            "review_score": "1"
        },
        {
            "review_text": "You can sit down and beat this on normal in a few hours even taking your time, its nothing compared to shrine 2 but for a buck who cares.",
            "review_score": "1"
        },
        {
            "review_text": "Jump'n'Run Action at its finest. If you have at least one jumpy bone in your body, try it out. It's gonna be worth it :-)",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice platformer and puzzel solving game getting the charachters from A to B. Nothing spectacular or to be excited about but it's a fun, family friendly video game.  Recommed purchasing as well as the sequel 'Trine 2'",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really a platform gamer, but excellent narrative and strategic game-play. The graphics are epic and manifests a renaissance time period. The music alone is worth the purchase!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game, certainly something worth buying whilst on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Happily surprised by the quality of this game, which is every bit as enjoyable to play as it was attractive to look at. The narration is very well done, and the story and levels are interesting, striking a good balance between enough content to be satisfying without being long enough that you risk getting fatigued.  If it matters at all to you, it's very simple to get to 100% achievement on this game. Only the 'complete last level on very hard without any deaths' proved at all annoying, with it taking me perhaps 2 hours of repetitive attempts. I'm not very good though; I even had to look up some walkthroughs for experience I'd missed.  I picked this game up, as well as the sequel for 90% off, which certainly made the cost-to-hours ratio of this game very much in the black.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It shows off a rather new style to games, and has excellent graphics. The most amazing thing is that, as amazing the graphics are, even a (dare I say) low-range computer should be able to play this without lagging. There is also no 'dead-spots', so no matter how much you screw up, you'll be able to continue on with another character.  Having played on Medium (/Normal?), I didn't find this game too difficult. It provided a challenge, but throughout the entire game I only died once, or so.  The game provided me with about 7 hours of game time, split over a weekend.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a superb game to look at - quite possibly the most graphically lush side-scroller I've yet come across. With twin 4890's onboard in Crossfire, this game pretty much ramps up the cooling fans straight away - it's that demanding with the eye candy turned on.  Trine is effectively a thinking man's hack 'n slash, mixed in with a bit of puzzle solving. The three main characters in the game - a wizard, thief and knight become 'fused' together allowing you pick the relevant character for the task at hand. Along the way experience is picked up which you can apply to one of the three characters as you see fit. The only gripe I've yet comes across wih the game is the absurdly large gap between checkpoint saves - which can see you redoing literally several minutes of a stage if all three characters die.  Aside from that, I'd highly recommend Trine as an enjoyable, beautiful and quite cerebral game. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent puzzle platform game that makes you think rather than jump yourself to the next levels. The usage of three different characters reminds you of The Lost Vikings, but this game is so much more than that. I best enjoyed the solo play, but I hear it's bad ♥♥♥ on co-op too. Drawing squares has never been so fun!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best adventure-platformers I've ever played. Good story, great graphics and music, excellent control. The only thing I can say against it is that the grappling hook sometimes does not move as expected, but nothing to be worried too much about.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a fun 2D little puzzle platformer with gorgeous visuals. It is about 5-7 hours long depending on how you play it. And everyone reading this SHOULD play it because it is worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "With the Enchanted Edition there is not reason not goet get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning soundtrack, perfect gameplay thats Trine. If you still like fairlytales then buy it and enjoy :)",
            "review_score": "1"
        },
        {
            "review_text": "What a nostalgy... it is like Lost Vikings... Honestyl... this is a great puzzle-action game with awesome graphic and really good control system! And well also low price. Simple nice game which I really enjoy play. My opinion... sure at least 8,5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Played only as multiplayer and found it thoroughly enjoyable. Fairly simple puzzles but enough to keep me interested through to the end. Even the combat which some might find repetitive I found to keep me engaged and interested.",
            "review_score": "1"
        },
        {
            "review_text": "They found The Lost Vikings, but they probably shouldn't have.",
            "review_score": "1"
        },
        {
            "review_text": "[PRO] If you like  The Lost Vikings  probably you will like Trine, the system is very similar.  Characters: - The Thief is a versatile char, very agile, she use the grappling rope and bow and arrow, if you combine certain items and skills the Thief can turn the most powerful char, firing 4 deadly arrows  - The Warrior is pure “hack n’ slack”, he use the sword, shield and a hammer, with sword you can destroy many things and with hammer you can crush everything   - The Wizard is your life-saver, he create boxes, planks, floating triangles and move things with telekinesis, if you use smart the Wizard, you can save your life (cover the spikes with boxes) and get many items, if you get in troubles with the monsters you can drop the box in their heads  Difficulty: - Is very balanced!   [CON]  The enemies are repetitive and boring  Rate: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a pure gem . I was lucky to discover it as part of the frozenbyte bundle which i bought for a $2 donation. If you see it going for the £5-£7 get it.  For the price you wouldn't expect such appealing graphics and although the story is a bit so-so, the gameplay and puzzles are great with lots of secrets hidden away to find.",
            "review_score": "1"
        },
        {
            "review_text": "very fun, clever sidescrolling action platformer. hardly used the knight because he sucks",
            "review_score": "1"
        },
        {
            "review_text": "Great little platfromer with tonnes to do and the visuals are astounding. The characters have personality and the puzzle solving is genuinely challenging but not ridiculously difficult.  Only thing I'll mention is that in the requirements it says 'Trine does not work on intergrated graphics cards'. This in fact is not true, at least for me anyway. I'm using Intel HD Graphics 3000 on my ASUS laptop, which is an intergrated card and I have had no issues at all, so I would say try it, if it works then you're in for a great experience.",
            "review_score": "1"
        },
        {
            "review_text": "A great adventure / platformer, with great graphics, and enjoyable experience",
            "review_score": "1"
        },
        {
            "review_text": "Really good gameplay, a cool and hillarious story... The whole game is really funny to play... Really enjoyable game... commended...",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Trine 2.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, good setting and the story telling is really nice. Looking forward to playing Trine 2 after I finish this game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very pretty to look at and is very fun, especially with a friend or two in coop mode (you'll need some extra controllers for them since it is only local coop in T1).",
            "review_score": "1"
        },
        {
            "review_text": "Long Version: My first thought of this game was that it looked really beautiful. I found it very easy to start playing as the controls were simple enough yet something I knew it would take a little practice to master. Try to avoid swinging into spike traps for example. The story is interesting, magical object binds your souls together. I've definitely seen worse stories than that. The best thing about the game is that game play is fun. There is lots of little experience orbs around. Sometimes, it takes a little brain power to get one, or you can just skip it if you are just running through and having fun. Plus the price isn't too bad either especially if you get it on sale. I don't know if the replay value will be there for some of you guys, but for those secret hunters, you can redo a level without having to reload the game so you can play without a guide. haha  Short Version: It is a beautiful puzzle platformer with a fun three character switch out mechanic that will force you to use your brain! Its fun and at a good price. Replay may not be there for all.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun sidescrolling platformer. You can switch between an archer, warrior, or wizard on the fly and use their differing abilities to solve puzzles and kill bad guys. Works well on PC but would be even better with a controller setup.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to understand and to play. It is a great game, just bought it. Only downside the puzzles are to straight forward.. No thinking needed. Still great game to have for 1 or 2 euro.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game that takes you by surprise. For a side-scrolling-platforming-puzzler it is quite the game, giving you a new sense of adventure with its epic graphics for a 2009 game, and great point-and-click gameplay. 100% Would recommend to anyone who is hesitant about it. But if it is between Trine or Trine 2, go for Trine 2. The story is pretty interesting, but you can sorta live without it.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool game!  It's a bit on the easy side but it controls really well and it's fun to go through the levels. Unlocking the achievements is easy too (even if time consuming), so it gets a big thumbs up from me.",
            "review_score": "1"
        },
        {
            "review_text": "A fun mix of platforming, puzzling and action. You also collect experience and items for some very basic, but rewarding, leveling up and character customization. Check out the free demo for a taste, although the game gets a lot more fun when you get the flaming arrows.",
            "review_score": "1"
        },
        {
            "review_text": "*Gnome Seal of Approval* Superb indie platformer where you control three characters. You can switch between the characters at all times. A melee fighter, a ranger and a wizard. You'll need them all to traverse the levels.  Highly polished game with a great atmosphere and a bit of humor as well.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely gorgerous puzzle platformer that plays like a charm. You control three characters with seperate special abilities for unique occasions. You decide who to use for each puzzle.  The only small niggle I have is that the game is so pretty, occasionally a couple of buttons or levers are hidden in the background of the game, but that really is minor.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beautiful games I ever played... those graphics are really really awesome :)",
            "review_score": "1"
        },
        {
            "review_text": "2D platform adventuring RPG gold! This game is hands down a must purchase for 2D platformer fans. Excellent character progression, satisfying combat mechanics, and wonderfully quizzical puzzles. Oh, and did i mention it is beautiful. Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer game. It also has some very beautiful backgrounds. I'd recommend using a controller for this game as the jumps can get quite tedious with a keyboard and mouse.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun multiplayer puzzles. Enemies are repetitive though. There's only about 5 different types of enemies through the whole game. It's more fun for its puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is brimming with creative art style, gorgeous graphics and smooth controls.The only downside to the package is that the physics puzzle can be uneven at times leading to some unwanted frustration.",
            "review_score": "1"
        },
        {
            "review_text": "'Charming' is probably the single best word to describe this side-scrolling puzzle-platformer. Attractive graphics and a great soundtrack highlight a strong physics system that makes the way you solve its puzzles the focus, rather than the solutions themselves. Fans of super hard platformers a la Meat Boy and those hoping for extremely complex puzzle elements will likely be disappointed with the relatively low level of difficulty. The lack of combat depth and variety of enemies are the game's weakest points, but it knows its limits and doesn't spend too much time on either. If you're looking for a responsive game that allows you to utilize your own creativity in solving its puzzles, this is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game! I can't remember the last time I've had so much fun playing a game. Beautiful gameplay, beautiful graphics... it has good coop' mechanics and a great story... I whish there were more games like this. I know what Trine 2 game I will be playing next.",
            "review_score": "1"
        },
        {
            "review_text": "impressive story, and nice background music..",
            "review_score": "1"
        },
        {
            "review_text": "Great indie game, finished Trine 2 first but this one is nice too even if it's not multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Before you buy this visually and audially stunning platformer, make sure you have a way your friends can play it too. It's local only, so you all have to be on the same machine, and everyone needs either a mouse and keyboard, or a joystick with at least two axles and a sufficient number of buttons. It's a big hardware corner to cut, and if you can't manage it, you're better off getting it for the PS3. But if you only want to play it by yourself (or have no friends), there's nothing to worry about. Except that you have no friends.  Another caveat: Don't get too frustrated when playing with friends! It's a bit clunky at first, but if you slow down and take time to enjoy the scenery and music while you deliberate on a solution, you'll have a great time. Practice your moves, read how your abilities work, and understand your role. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, the puzzles are sort of simple in it and alot of what should be a more cerebral affair can be overcome by abusing the Wizard's magic and some quick reflexes.",
            "review_score": "1"
        },
        {
            "review_text": "this is a pretty decent indy game",
            "review_score": "1"
        },
        {
            "review_text": "Played this game about two years ago on another platform, totally worth it. It gives you a 'fantasy world' feel, enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "There is little to learn, just start and go. Very entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to find a better game that rhymes with brine.",
            "review_score": "1"
        },
        {
            "review_text": "Switch freely between thief (arrow/grapple), wizard (draw/move) or knight (smash/block). Beautiful, but too many bats and skeletons.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun puzzle game and lots of puzzles",
            "review_score": "1"
        },
        {
            "review_text": "Great to play alone or with friends. One of my favorite games!",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a 2-d platform game with some puzzle elements. The key mechanic is that you can switch between three characters which have different abilities. A lot of the puzzles require swinging, putting weights on seesaws, pushing objects, moving objects with telekenesis, cutting ropes with arrows, etc. Each puzzle can be solved in a variety of different ways. Some puzzles can be solved with all three characters, so there is some replayability to try to go back and retry a puzzle with a different character. In general the puzzles were not very hard, but some of them are very creative and fun. Combat was a little dull since there are only two kinds of regular enemies and two kinds of boss. I got this game for a very good price and it was well worth it. It is a nice diversion, fun enough to hold your attention, not so difficult that you get frustrated. I would not pay more than five bucks for it.",
            "review_score": "1"
        },
        {
            "review_text": "75/100",
            "review_score": "1"
        },
        {
            "review_text": "Great little puzzle side scrolling game with three different character types to figure out puzzles. I have never played the co-op but the single player game is good fun.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing 2D physics puzzle and action game with tons of secrets and other goodies to keep you playing.",
            "review_score": "1"
        },
        {
            "review_text": "The best thing about this game is the scenery. You have three characters with unique abilities who are trying to save the world or something. Reminds me of Mega Man X7 and X8 with its tag-team system.",
            "review_score": "1"
        },
        {
            "review_text": "good game, can be more longe",
            "review_score": "1"
        },
        {
            "review_text": "This game is so colourfull! It is overall really pleasent to play.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent side scroll plataformer, puzle and action game",
            "review_score": "1"
        },
        {
            "review_text": "It's ligitimately fun. Not to mention, its only 1.49$",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful looking platforner with a good mix of characters and abilities to help you solve puzzles. My only problem with this game is the lack of variety with the enemies.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely entertaining side-scroller, filled with puzzles and characters with great personalities.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like the game is a lot harder the more people you play with.  Alright platformer. Not amazing or anything. But okay.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really nice game and I had fun all through the entire game! The game is really well designed and the graphics look really good. The gameplay is pretty easy and fun but they could have made more kinds of enemies in the game. The game can also be a little bit tricky sometimes. I would rate this game maybe 8/10! :D",
            "review_score": "1"
        },
        {
            "review_text": "Love it, I would recommend the game purely from the storytelling narrator and the beautiful design of the game itself",
            "review_score": "1"
        },
        {
            "review_text": "Great game, love the series.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game   Pros: Everything Cons: Game is very short and story is a little cliched.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful little puzzle platformer. I mean, just look at the screens or a video, it's gorgeous. But the rest of the game is pretty damn solid, too. It introduces its mechanics at a perfect pace and slowly improves upon the basic principle of having three specialists (wizard, thief, knight) whose unique abilities you use to get through the levels. The puzzles are all reasonable with regard to their difficulty. In almost all of the fifteen or so levels (there are two exceptions) you can take your time looking for the proper path or the next wooden platform to grap with your thief's hook. Hidden collectibles and a very hard mode that unlocks after the first playthrough give the game decent replayability. It took me about 15 hours seeing everything the game has to offer. But even if you're doing a single fast playthrough, you'll probably still be engaged for a good eight hours. Now on to part two!",
            "review_score": "1"
        },
        {
            "review_text": "A fairly good platformer, the upgrades/leveling were nice and the changing mechanic was interesting.... although I did spend 70% of my time as the thief",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic action platformer in the style of the Lost Vikings, Trine is well worth the price of admission. The differing skills allow you to fully enjoy the beautifully rendered levels, no matter what your prefered playstyle or platformer experience.",
            "review_score": "1"
        },
        {
            "review_text": "Greet fun to play. You can solve each leavel in many differnent ways. It comes with greet graphics and just a greet game to play. Deffently worth buy Trine before you buy the second game.",
            "review_score": "1"
        },
        {
            "review_text": "It is a great and exciting game which could always keep you interested and entertain you until the very end.",
            "review_score": "1"
        },
        {
            "review_text": "А very beautifully done and interesting game. And yet I have to say it was irritating when in a very important jump and run moments the thief refused to do what I wanted her to do.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a side scrolling puzzle action game that allow you to play three characters on the go by switching at any time during the level; The Theif, Wizard, &amp; the warrior. Each has their own weapons and contrubitation to each puzzle that you will come across.  The Theif uses her bow and arrow for her attacks and can use her grappling hook to swing across the levels. She is great if you want to speed run across the level but you will miss several achivement if you do as there are hidden treasure to find and green potion that will add to your exp. that will effect all three classes  The Wizard can not attack, instead he can summon blocks (and later platforms) to get pass some spot in the level as well as levitate some objects around. you can however when it comes to attacking, is drop object on top of enemys. or block the enemys from reaching you and watch them fail after fail to reach you or to make them fall to their deaths.  The Warrior is your basic hack in shash guy. he can use his sheild to block or repell certain projectile and depending you are playing the Enchanted edition or not (as the game allow you to choice on the spash screen). he can bring objects toward him with his sheild (enchanted edition) or normally pick it up and toss it (normal edition). other than that hes not much use to you except for boss battles  the different between the enchanted edition and the normal edition of the game is just some minor changes. first of all is that the enchanted edition is just a graphical face lift and with just a minor changes to level design (though the only one i notice the differents is the warrior's introduction/turtoial level). Other than that the story is pretty much the same and untouch.   I would highly recommend playing the normal verision first then the enchanted edition just to see the differnce and you can do both if you wanted to as it is a pretty short game, but when you switch to enchanted midway through the game, you want to say yes to importing the save from the normal verision as once you choice, their is no redues. Found that out the hard way and lost 1.5 hrs of play (but then again it is a short game so i'm not complaining)",
            "review_score": "1"
        },
        {
            "review_text": " Is this a good game?  - Yes, definitely!  Should you buy this game? It really depends on you. I've managed to finish one playthrough in 5 hours. I didn't focus much on all secrets, chests and experience points, but I did 'master' at least 4-5 levels (master means collecting all secrets and experience points in one level.)  The game is pretty short, with expected playtime of only about 6 hours. 6 hours of awesomeness. The game has a unique and funny sense of humor, it features 3 characters and all 3 of them are unique and fun to play, with the mage having a very massive exploit that, when figured out, makes the game extremely easier.   I do, however, recommend you to, if you plan on buying this game, find a friend who will play it with you, since this game becomes A LOT more enjoyable with a friend or even better, 2 friends!  It's not a hard game in my opinion. That being said, I love playing the hardest possible games, so that might influence my opinion on that matter, but the game features no hard puzzles, no hard enemies, no hard bosses and a very forgiving respawn system.  As for the graphics, the game looks stunning, and all areas are beautiful in their own way. I found myself just gazing at the background more than once, simply enjoying the beauty of all the levels in this game.  Controls and commands are extremely easy to learn and use, they feel smooth, but playing with 2 or 3 players of course would require to play with a host who is close to you, to reduce your ping, since high pings can influence the gameplay, but not greatly.  TL;DR - Conclusion: This game is pretty short, but awesome while it lasts. It's not hard in any way, but is very amusing, funny, with a very beautiful art style and visuals. I would recommend getting it on a small discount, as it really doesn't give you many hours of gameplay. Playing with friends is fun, so I recommend finding one or two friends to share this awesome experience with!",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold! Buy it",
            "review_score": "1"
        },
        {
            "review_text": "Great co-op game to play with your girlfriend!   Visuals are great, and the platform puzzles have multiple solutions. Co-op definitely makes the difficulty easier, as you have more options for getting past obstacles. Plays up to 3 players, 1 for each hero. Controls are intuitive and easy to pick up quickly.  Using the keyboard vs. controller makes certain characters easier, for example using the thief's grappling hook is much easier with the controller because you can hit the right trigger button and automatically hook on any wooden structure near by, whereas with the mouse, it's a bit clunky to make a skill shot to a wooden ceiling while you are falling.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic take a gander upon it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beautiful games I've ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game, certainly something worth buying whilst on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely game. A very enjoyable co-op experience with lovely graphics and an excellent soundtrack by Ari Pulkkinen which really adds to the experience.  I liked how there were various ways to solve the problems depending on which character you had and loved the sometimes random things that happened when you get 2 players trying to figure things out in various ways.  It's nice to have a good local co-op game in the library too.",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing",
            "review_score": "1"
        },
        {
            "review_text": "I very much enjoyed my playthrough of this game. Short but sweet.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Definately worth buying both this and its sequal.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I love the atmosphere and the art work. The difficulty is just right for a casual play.",
            "review_score": "1"
        },
        {
            "review_text": "A great side scrolling action/puzzle/platformer. Wonderful grafix and a story that keeps you engrossed. The only thing I didn't like was the ending felt a little anti-clamatical, but it was still a fun ride.",
            "review_score": "1"
        },
        {
            "review_text": "At its heart, Trine is a really first rate puzzle game. There never feels as though there’s one ‘correct’ way to get past anything the game puts in your way. My one complaint is with the enemies. 90% of them seem to be skeletons with very slight variations of weapons or health. Their slow spawning rates just multiply the monotony. Small nitpicks aside, Trine is quite the spectacle to behold, with gorgeous graphics and a narrator second only to Bastion.   While most puzzle game offerings seem to settle for casual colour matches or rhythm exercises, Trine presents a masterclass in how to be puzzle-focused without loosing any kind of depth.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting platformer with amazing visuals, awesome physics, great music, and an interesting story.  Well worth a play :)",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy gaming, but I'm really not very good (bad eye-hand coordination) and usually get can only get so far before finding something impossible for me to achieve. So far I am finding this game a lot of fun and have not yet come across anything that is impossible to do since between the three characters there is usually a way to overcome any obstacle.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished Trine to 100% completion.   The game is really fun to play most of the time; and well worth the investment if you're looking to kill time in a beautifully themed puzzle platformer with a couple of friends.  It relishes in its simplicity. It's pretty. The music is great. You can play with two other friends, all with unique characters and playstyles. The puzzles can be solved with relative ease due to the varied toolkit the protagonists offer. Its got a lighthearted air of humor about it that makes it legitimately enjoyable.  That being said, it's not particularly revolutionary. The puzzles aren't challenging. The combat is a little redundant and, in most cases, feels unnecessary. 90% of the challenge seems to come from wrestling the physics system and getting knocked about in all sorts of ways.  If you're looking for anything more than a few hours of silliness, I would look elsewhere--and no matter what, I would recommend waiting until it goes on sale before buying. $15 feels a little steep given its age and the experience itself.  Personally, I loved the game.",
            "review_score": "1"
        },
        {
            "review_text": "short, but cost/effect ratio is extermly high. great graphics, great puzzle.  for me 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game because his graphics that are GREAT, and you need to do the puzzles that have in the game. The history is very good, and she happens around of three caracters that are a thief, a wizard and a knight. I think he is a game of platform because he have a vision 2D, how mario and sonic, but don't fool yourself because he are a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic adventure, the classic way. Good graphics, but a bit too bright, hurts the eye. Story is nice and solid, Lots of tricks and secrets to discover.",
            "review_score": "1"
        },
        {
            "review_text": "Game can be Art, Trine is a perfect example how, as it's breathtakingly beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game, besides that it's beautiful, wonderful, entertaining and feels like a truly masterpiece? Only that Trine looks and plays like a fairytale arcade, not to difficult, rather relaxing and with many mini-puzzles elements that I also love. I'm not big fan of arcade games, so it was good to me that Trine more like to test your brain with puzzles, than your reflexes. Sadly I cannot tell this about the second part.",
            "review_score": "1"
        },
        {
            "review_text": "Good puzzle-platformer. Trine reminds me of the old The Lost Vikings for its gameplay, you get three different characters and alternate in between them to get through the challenged on each stage.  Visually very pretty, Trine's narrative has a dose of humor and a very nice soundtrack that suits well each stage. It is fun to find every hidden item on the game, and at times some clever exploration is required.  The game itself is quite easy though, even on the hardest mode. Very little enemy variation (You basically kill a horde of skeletons), and it gets repetitive when you approach the end.  Anyway, it was a fun ride, and certainly more than I'd ask for the price of admission.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Had an awesome playthrough with this game. The Sequel improves on this but this one is classic.",
            "review_score": "1"
        },
        {
            "review_text": "Love a good story play this game i mean it play it it's great !",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a great Action Platformer to pass some time with.  While it is relatively short, and not very challenging, Trine is beautiful and fun - the controls are responsive enough, the characters have different abilities and the levels are all varied.  I've played through the game twice by now, and I'll probably return to it at some point. Definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the hard copy of this game a couple years back, and only now decided to buy the EE here on Steam. It makes a lot of improvements to the game, for example Zoya can now fire arrows while in mid-air. There are a multitude of bug fixes as well. The graphics and music are outstanding, I'd have to give it a 10/10 for both. If you are reading this review or have seen screenshots and are interested, give Trine a try. It has a very similar feel to the old Blizzard series - Lost Vikings.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. really great to spent some time. great story to cover the game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game. Especially with friends. :)",
            "review_score": "1"
        },
        {
            "review_text": "Usually, I'm not one for puzzle games, but this one really worked out for me. The game is challenging at times, requiring both timing and strategy to solve the puzzles/obstacles, but not too challenging, since even I managed to beat the game after a while. It has a lot of humourous dialogue, which is always a winner in my book, and the entire game simply has a cozy feeling too it.  I recommend the game, and its sequel, for some casual short-interval gaming sessions.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game. Buy it if you have never played.",
            "review_score": "1"
        },
        {
            "review_text": "Beat this game for the 3rd time on Hard. Don't want to play it again. Unless replay it with friends. That would be awesomely hillarious.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun side scroller with impressive graphics and unique gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Steam says I've played this game for only a few minutes, but I played it mostly online due to some internet troubles. I've completed the game with all experience and secrets, although I couldn't say for how long I've played it exactly. Somewhere between 8 and 15 hours I'd guess.  Trine is a side-scroller that requires you to switch between three different characters, each with their own abilities, in order to solve puzzles and fight creatures. There's a lot of exploration involved and a lot of secrets to uncover, made up of experience (used to upgrade your characters' abilities) and treasure chests (which hold items which also expand upon your characters' abilities).  The gameplay is fun. Each of the characters brings something unique and interesting to the gameplay. The thief can shoot arrows and uses a grappling hook to get around and up to higher places. The wizard can create boxes and planks to help move machinery and reach high places, as well as move objects around using telekinises type power. And the knight has a shield for blocking attacks and projectiles, as well as a sword for attacking enemies. These obviously expand and get upgraded as you find experience and secrets, but I won't spoil it by explaining how.  You will get the most fun out of the game by switching between the characters regularly and using their strengths based on the situation (either in a combined or singular way).  The game itself is absolutely beautiful. Even on the absolutely lowest graphic specs, it's beautiful to look at, and one of the main draws to the game. The story is surprisingly interesting. It's not amazingly detailed or deep, but it's told well through narration in between and during levels. The narration and character voices are sort of over the top on purpose, kind of like in a fairtytale way. The levels themselves are also varied and each has a unique look. And the music fits each level perfectly.  It's a not a super long game (I'd say reaching the end would take somewhere between 5 and 10 hours on average), but it seemed like a good length. There is some replayability in finding secrets that you missed in each level as well as a range of difficulties. I played it on medium which was fairly easy, although enjoyable nonetheless.  I'm looking forward to playing Trine 2 as well as 3 eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Trine is the best jumping 2d game I have ever played. In fact it's even better than you think ,because you can ejoy it with 2 more friends :). Be prepared for perfect surroundings which makes with perfect soundtracks very pleasant experience.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A SERIOUSLY GREAT game for ANY platformer fan. The visuals and musical themes makes this for an enchanting adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful visuals and music, fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game using Xbox 360 controller. It reminds me the days I'm playing platform games on Sega. Very creative and challenging puzzles. I suggest you grab it when there is promotion. Highly recommended. Worht your money.",
            "review_score": "1"
        },
        {
            "review_text": "Graphicly Stunning, amazing backgrounds, controls feel good and natural, the combination of the 3 Characters is extremely fun, and so is the was u can alternate between them. Story is simple but very interesting, the narator makes the world apear as a medieval post-apocaliptyc sort of place, each character is very unique and has its own diferent skill sets and 'jobs'. Overall an excellent game, absulutly worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "i love it becase its amsome",
            "review_score": "1"
        },
        {
            "review_text": "Trine is a pretty fun easy going game, the visuals are really nice and the music isn't half bad either. The story, while it's not the best, it sure can pull someone in if it's their sort of thing. Though if you're going to buy this game, buy the second and third with it.",
            "review_score": "1"
        },
        {
            "review_text": "I've just finished the game for the first time. I trule enjoyed it. It is a very fun mix of puzzle, action and adventure. The levels are intricate and beautiful. However, there is very little charater exposition, which is fine because it does not market itself as an RPG. I wish I was able to fight the final boss, it feels like it end rather anticlimactically.   Overall, a solid, fun game which I strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I'm very picky with the games I choose to play with what little free time I actually have and this game wow it totally blew me away. I fell in love!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun RPG puzzle solving game. Cute story but I skipped most of it. Each character is deffinately needed, although I think the mage abilities really make things easy once you have enough XP spent into him.  The best thing I can compare this game to are the jumping puzzle in Guild wars 2. First you have to spot them, then figure out where they start and then try to complete them without falling to your death. All while using the limited abilities at your disposal. FInished Trine 1, just working on acheives. Just started Trine 2 and enjoying it just as much!",
            "review_score": "1"
        },
        {
            "review_text": "me and my girlfriend had a lot of fun  10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platform games out there. There is no obnoxious timer, no endless hordes of enemies, no maddening huge gap requiring multiple perfectly timed jumps to avoid certain death - just obstacles waiting for your creative solutions to get past. Can't get a bottle up on a ledge? Levitate an object and use it to sweep the bottle down to you. Fireballs making things difficult? Park a block in front of them so they never hit you. Even spike traps can be avoided by covering them with a plank, giving you all the time in the world to navigate over a difficult section. I love when there's a creature that's waiting for you to come by so that it can shoot you. It's a perfect opportunity to drop something heavy on its head.  The graphics are beautiful, the sounds are great, and the controls are intuitive. Many of the obstacles can be beaten in multiple ways. I find myself overcomplicating puzzles just because I can.",
            "review_score": "1"
        },
        {
            "review_text": "Runs slow with graphics up but looks cool, good gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "The best in the series and one of my favourite puzzle-platformers. A superb game which has consistently good level design and pacing that really differentiates it from it's competitors. A must play for fans of platformers and puzzle games alike. Soundtrack is catchy and memorable. Visuals are decent, and have aged well since this game's release. Replay value is relatively high, with cleverly placed collectibles and solid achievements. Overall, I give this game 9/10 and I only hope that after Trine 3, Frozenbyte can produce something on par with Trine.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best inde game ever!! You must play these incredible game with all that colors and music !",
            "review_score": "1"
        },
        {
            "review_text": "Dude, Trine is pretty cool. I like trine.",
            "review_score": "1"
        },
        {
            "review_text": "2D platformer with combat, rpg progression, and really, really shiny graphics. Pleasant enough music, so it won't grate your ears. Grab the game on sale and was surprised it could go for so cheap. Sure it's an old IP, but the devil's in the details. Especially if you include the touched up code and textures in the enhanced edition.  Simplistic, but a platformer done absolutely right.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best if not one of the best games I have ever had the good fortune of exchanging digitial currency for at a reduced cost unto myself. I have played countless hours of games before I decided to purchase this one (at a reduced cost) and so I knew before I started playing the general idea behind games themselves. I was also aware as to the methods I should employ in order to be able to control the process in which one would execute the command to start the game after having already purchased it (at a reduced price), utilising of course the famed keyboard and mouse. From my experience with other games (for example FIFA, which I have played as I am a lad and that is simply what boys do honey) I understood to a certain extent, albeit intangible, that games are a sort of movie with the added dimension of interaction, and it is that interaction which the game bequethes unto you that really defines the particular experience the game is attempting to immerse one in. Truth be told I've yet to play this game and don't really plan on it. I wasn't inebriated when I purchased it (at a reduced price) or anything, but perhaps the allure of its reduced pricetag swayed my mouse in the direction of the 'Purchase for Myself' button. Another factor is perhaps Brand Recognition. I had heard of this game before online, and although I was never truly offered an opinion as to the game's quality, it was insinuated that the game would spark emotions of a pleasurable variety in the abdomen. So with all that knowledge I purchased this game (at a reduced price) and would highly recommend that you do the same because it is an incredible exercise in philosophy and self-examination to sacrifice earthly currency for something you know you will never exploit for entertainment, simply due to the grasp Mother Time has us all within. This game also indicated to me that I may indeed be entering into the realm some coin Insanity, and that has led me to question the very nature of Sanity and when really can one define their departure from it? Surely it's more complex than Sanity being a line in the sand and every time you commit a certain act (for example purchasing a game you know you will never play albeit at a reduced price), you step towards that line until at some point you commit a certain act of equal peculiarity (for example writing an elongated and unfunny review albeit while waiting for one's pizza to cook and for one's friends to come on Skype) and finally you have officially left the realm of sanity and ventured forth into the realm of the unknown in which one is capable of anything and one is unsure of what one will do next as one has ventured forth into the realm of insanity ie what I like to call the realm of the unknown.   give dis game a try",
            "review_score": "1"
        },
        {
            "review_text": "story is ResidentSleeper but the gameplay is great",
            "review_score": "1"
        },
        {
            "review_text": "The game is very fun. I found the puzzels interesting, although they arent overly hard to figure out. The story is not the best. The music, graphics and other sound effects is amazing. I finished the game in about 3 hours, but found myself coming back to it in order to get some of the achivments. I would suggest this game as something to get. I got it when it was on sale. Not sure if I would have gotten it at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and clever puzzle game utilising different character skills in combination to solve puzzles.  For the older gamers out there think Lost Vikings.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, easy to play",
            "review_score": "1"
        },
        {
            "review_text": "I usually never do reviews, but this game enchanted me and I just gotta give it a solid 10/10. I thought I could never be so charmed by a game and boy was I wrong. Would recommend to anyone, a hardcore or casual gamer, it has to be experienced. Thumbs up for this gem.",
            "review_score": "1"
        },
        {
            "review_text": "Since I paint alot, I like colors, colors are nice. Trine's got alot of colors, so I bought it :&gt;  But yeah, honestly, Trine is a challenging but visually pleasing game, much recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Beautifuly artistic game. Physics puzzled based, really challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Grabbed this on the advise of a friend and i'm certainly not disappointed, the game was a blast, played the first few levels solo then did the whole thing with said friend. Finished it in about 5 hours (though we missed a fair few collectables). The characters are very interesting and the gameplay with each one is fluid and unique, Playing older levels again with newer powers can be a lot of fun since it allows you to cheese the mechanics hehehe. I played the game with the max 100 at very high settings. Perfect game (and series) to grab if you need a co-op game to play with friends or just a fun game to play solo.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, good game mechanics combined with beautiful graphics and music with three playable characters. You must try this game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Simply beautiful",
            "review_score": "1"
        },
        {
            "review_text": "+ great graphics and music + many different environments + fine gameplay + great atmosphere + simply great game overall  - VERY boring story - RPG elements are there but IMHO they would require some tuning",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, easy and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet wonderful puzzle platformer where you swap between heroes while going through the level.",
            "review_score": "1"
        },
        {
            "review_text": "Casual game where you can just chill and think at the same time",
            "review_score": "1"
        },
        {
            "review_text": "Been wanting to play this for a long time and finally I am able to. It is a beautiful looking game! The gameplay is balanced and fun! Looking forward to playing Trine 2 now and then Trine 3! Great jub guys!!!! Instant favorite game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle/platform/adventure games I have ever played. The only thing that I disliked about Trine is the cliched fantasy story line where the adventurers battle through a magical land in search of a mystical thing that, once aqcuired, will bring order back to the land :D But overall I give it an 8.5 / 10.",
            "review_score": "1"
        },
        {
            "review_text": "I looooove it! The narration is really good &amp; the way it's building up the story is really great! I play the Co-op mode with my boyfriend! It's better than playing alone, so I recommend playing it with friends (maximoum players: 3)",
            "review_score": "1"
        },
        {
            "review_text": "Oh The Steam Awards made me review Trine, i've played this game with friends for a few times already, the narrative is great, the graphics are beautiful, and the OST is EPIC, the multiplayer provides tons of fun and a decent amount of laughs with all the fails happening, because no skills set. Be sure to play Trine with friends at some point in your gamer's lief. Also, runs great on Linux!",
            "review_score": "1"
        },
        {
            "review_text": "WOW! I did not expect to like this game as much as I do. Trine is a side-scrolling, action platform-puzzle video game originally released for PC in 2009. It plays like an old school arcade game with lots of running, jumping, and fighting skeletons. You play as one of three characters and can switch between them to solve tasks. It takes about 10 hours to complete, but there is lots of fun in going back to complete Steam achievements. I'm running it on Windows 7 (64-bit) with no issues. Get it on sale for a few bucks, and you won't be disappointed. I'm about to purchase the Trinelogy!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game to play whether you're playing alone or with your friends, but it's much better when you play with other friends. The puzzles aren't that difficult and fun to solve alone, but when you have someone else on your team they lose most of their challenge. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": " Trine - Enchanted Edition",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game with beautiful graphics and interesting mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "martha made some cake the other day, this game is about as good as the cake, pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Great little puzzle-platformer!  Good: *Level design. *Collectables. *Soundtrack. *Characters.  Meh: *Voice acting. *Enemy Variety. *Co-Op.  Bad: I have nothing bad to say about Trine.  ",
            "review_score": "1"
        },
        {
            "review_text": "Engaging puzzle solver with interesting cross character combos. A good choice for anyone who doesn't mind using their head or a grappling hook.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. The aestesic are amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Clearly a game intended to be more of a visual and audio based experience than actual gameplay. Very standard platformer that focuses on using 3 different characters. First is a wizard that creates boxes and bridges to help cross most gaps. Second is a thief with a bow and ability to swing between places if you can grapple onto wood. Lastly there is the knight who is your shield and sword.  Most of the game you will find yourself using the wizard as he can do 95% of stuff. Kill/defend with summoned items, or make accessing spots easier. There is no real challenge puzzle wise except the last 2-3 levels and possibly locating where the last experiance flask is in the level.  The levels themselves typically have a enchanted forest feeling, with a few castle levels. They don't feel too different from eachother which makes it a bit boring. The game is partially fun but missing immersion, nothing really draws you in gameplay wise. Not really any bosses, no variation on enemies past shield/arrow/pyro, just keep running while summoning some platforms and collect green flasks.  The graphics and music make for a nice single playthrough once and the main reason I hit recommend, but I would only get it when on sale. If you are specifically looking for platformer games, I would stick with the classics like Mario/Donkey Kong, they are more challenging, longer gameplay and more fun.  Personal experience score: 5.5/10  Story: 3/10 - Your really basic medieval story, not really a story based game in my view  Sound: 10/10 - Nice soundtrack  Graphics: 10/10 - Very nice art style  Controls: 9/10 - Easy to use and very basic, the hardest part is jumping to the right points  Game Length: 2/10 - 4 hours only with getting most experience flasks (a few short on each level only from achievements)",
            "review_score": "1"
        }
    ]
}