{
    "app_id": 357340,
    "name": "Cobalt",
    "release_date": "2016-02-02",
    "developer": [
        "Oxeye Game Studio"
    ],
    "publisher": [
        "Mojang"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 84,
    "positive_ratings": 551,
    "negative_ratings": 58,
    "price": 11.39,
    "description": "Forget everything you’ve learned about combat. Cobalt’s slo-mo mechanic lets you perform moves that other games can’t comprehend. Discover the secrets of a distant colony in a cosmic campaign, take on challenges and rule the leaderboards, or face off against others in local and online multiplayer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/357340/header.jpg?t=1478025550",
    "minimum_requirements": "OS: Windows 7, 8 or 10 Processor: 1,5 GHz or faster processor Memory: 2 GB RAM Graphics: 1GB VRAM Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I bought this game in alpha and it had no features. Devs actually delivered.",
            "review_score": "1"
        },
        {
            "review_text": "Very good metroidvania with interesting combat mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "this is a really good game, reccomend it for pepole who dont like overcomplicated games and to pepole who dont have the latest gaming rig as it will run on any 2005 windows xp machine but the graphics are good and the multiplayer is short and addictive. looking forward to more features (:",
            "review_score": "1"
        },
        {
            "review_text": "I have to mention that I was in the alpha, but i'm not a fanboy.  Cobalt has excellent combat that still gets better as we speak thanks to continues development. Sometimes auto-aim can be a drag but you'll get used to it and work with it. There is online multiplayer but not many people playing, so probably local is the way to go. Online is certainly possible and fun, only it's possible to have 0 people online. The story is alright. The level design is a bit open so sometimes you fall or die and then there will be some boring backtracking and finding your way. The story is fully 2 player coop so that's good. I don't know why everybody hates the keyboard controlls. I own four xbox360 gamepads, but I prefer to play this game with the keyboard. It works fine to me. There are challengen you can complete which are pretty fun. The game isn't too expensive, maybe wait for a sale but that could take a while. The game is pretty new in the time of this review. Maps are lots and can be made yourself with the level editor. It's a little hard to use but you'll find out how it works. Just remember to check the wiki if you don't know what to do.  I really like this game thanks to the combat, the keyboard controlls work fine to me and I'm pretty good (not to brag or anything). The story is ok and there are not many people playing online, but local multiplayer and challenges are the best way to experience this game",
            "review_score": "1"
        },
        {
            "review_text": "We're finally here and i can say without a doubt that it was well worth the wait! Cannot recommend this game enough.   Perfect for anyone who's looking for an intense action shooter where you can dodge and deflect bullets the way you've only ever seen in Bollywood movies.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. It is perfect for everyone who likes intense action.",
            "review_score": "1"
        },
        {
            "review_text": "Sitting on the fence with this so far, in some ways i like it but in other ways i really dont get it. The auto aim i can understand in multi-player but in single player NO. The control pad gameplay feels like it lags and some of the gameplay is pretty annoying.  Lack of information on certain missions is also annoying but with that being said i keep wanting to try it again......  I have not tried multi-player yet but have watched it so thats why i can understand the auto-aim.  Get or not i cannot be certain all i can say is for £16 there are better options out there. On the other hand i believe if you put the time into this and learned it then its going to be a quality game eventually, just not at this moment.  Single player review only !!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "First Impressions Video:          YouTube™ Video:  Let Me Show You Cobalt | First Impressions PC Preview&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Cobalt is weird, it's not like any other game really and learning the controls is pretty hard to start with but boy is it rewarding.  The game seems to flip between slow combat where you're blocking damage damage with your shield to fast paced flips where you're being flung half way across the map and back flailing bullets towards your enemies.  The game is good but I'd recomend you watch some videos first to see if it's your thing. This game is NOT a casual game.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I`ts not a simple shooter by any means. auto aim whilst scoffed at in many gaming realms and rightfully so, is absolutely required given you cant aim untill you perform any of its combinable game mechanics. run... roll... (whilst upside down), punch floor.. .. grab jump... hit slide, reverse facing.. duck (activates auto aim) boom. enemy despatched.    its a game mechanics puzzle shooter and its scope is incredible. 2d shooter game of the year as far as i am concerned. i bought this 5 years back in early development. solid as a rock. this game is a physics based game mechanics heaven.  built in editor. multiplayer. this game has it. this game gives it. endless fun which rarely gets repetative. tired of the map. make a new one. cant recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformer and 2D combat games ever made. Certainly THE BEST 2D shooting combat game ever made.  The mechanics are that deep and deserving of heralding!",
            "review_score": "1"
        },
        {
            "review_text": "This game is everything a 2D sci-fi action-adventure game should be.  So, if you like 2D sci-fi action adventure games, I highly recommend you give Cobalt a try.",
            "review_score": "1"
        },
        {
            "review_text": "Great single player and multiplayer experience. The story isn't super compelling but it is certainly plenty considering the smooth challenging gameplay. Local and online multiplayer (though only local campaign as an FYI) make this good for people who like to play in person and those who do not. In general it is one of the best games of its kind. Absolutely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "'It's like Smash Bros. with guns. 10/10'  In all seriousness, I have a lot of fun playing this game because it has a well designed combat &amp; upgrades system, an interesting story (not outstanding, but interesting enough), online multiplayer, and high-quality 2D graphics. I would definitely recommend it to anyone interested in an action-packed sci-fi adventure.",
            "review_score": "1"
        },
        {
            "review_text": "WHY ARE YOU LOOKING AT REVIEWS PUNK!. JUST BUY IT AND HAVE FUN!. note this review is not supposed to be offensive",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I've played this since it first came out. I helped with one tiny feature of the game. (Unit Classes)  Few problems with the latest release: Capture the Plug is no longer a gamemode. Seriously this breaks the sweet map I made, I really wanted to play it online. limit of 3 bots. This used to be like 9 or 10 or 12 or something. This needs to be higher (Also breaks the above map) GUI is worse then in previous versions. Keyboard doesn't work to input characters when you make a profile. (Not too big of a deal though)  Without capture the plug it's kinda a game breaker for me. Unless I just haven't figured out how to enable it or something.  Online Multiplayer is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Best slow motion in gaming ever, also, great game.",
            "review_score": "1"
        },
        {
            "review_text": "I grabbed the game the night it came out, and so far I have had nothing but fun. The campaign has been engaging and entertaining, and the online multiplayer has been a blast! I can’t wait to have so friends over, grab some gamepads, and plug my computer into our entertainment center; Now that will be some fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's really fun",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Its so cool, I think maybe 20 bucks might be a tad too much when the demo unlocks all gamemodes just not rule options but maybe 10$ 15$ would be better. Anyways its a awesome game, i havent noticed and bugs or anything yet and i play all the time!  ",
            "review_score": "1"
        },
        {
            "review_text": "About as intense as 2D combat goes. It's a lot of fun playing with friends and the game is just as challenging as you want it to be, whether you like to fight bots and play the surprisingly well-made story mode, or to play with and/or against other players. There is definitely a skill element to the game and even though I've only played the game for a couple dozens of hours, the difference between a good and a bad player shows pretty well.",
            "review_score": "1"
        },
        {
            "review_text": "Cobalt is a great piece of art as well as a really fun game. the mechanics feel splendid and it plays really well. and if you feel like messing around, you definitally can. if you find a radio, you can start dancing to the beat and just jam.  i definitally recommend this game, and its definitally worth 20 dollars, even though i'm waiting till it goes back on sale to buy it.  if you're thinking about buying Cobalt, go for it. you won't be wasting your money.",
            "review_score": "1"
        },
        {
            "review_text": "This isw a good 2D action shooter and if you dont like it your BADDDDD",
            "review_score": "1"
        },
        {
            "review_text": "An action packed slow mo combat platformer like no other.  The online is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "nice. played it for 13 minutes then got confused and bought hats for tf2.",
            "review_score": "1"
        },
        {
            "review_text": "  There is no Multiplayer games in Asia..................",
            "review_score": "1"
        },
        {
            "review_text": "THE TRASH MAN HATES THIS GAME, THE TRASH MAN WAS OUT LOOKING FOR TRASH TO EAT BUT THIS WAS NOT ♥♥♥♥ING TRASH, WHAT THE ACTUALL ♥♥♥♥, THE TRASH MAN WAS LOOKING FOR A TRASH GAME BUT THIS ONE DID NOT TASTE LIKE TRASH, IM ♥♥♥♥ING HUNGRY",
            "review_score": "1"
        },
        {
            "review_text": "i been playing since alpha! and back then it was great , and its still great today! i give it a 9/11",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing the alpha for years and if it wasn't for those gray out buttons in the main menu, I'd have said it was a finished game aleady... and boy, that release is good.  The gameplay is (and always was) super tight with a lot of depth. It's easy to learn but hard to master (you can punch grenades to send them back, well-timed rolls can deflect shots, there is a weird and awesome bulletime system in place...). Which makes this game super fun in local versus. It's a must have if you have friends coming over, like super smash bros on consoles. Each match can be customized like crazy (which robot you're playing, stage music, available weapons,...)  I didn't play much with the solo modes yet but so far I like what I see. The story seems fun and humorous and you can upgrade/customize your character, which is something I didn't expect at all (it kinda give an RPG feel to the game). There also seem to hav a lot of little interactivity thingy which I really like (you can mount certain creatures, get a bird and see it dies by a rocket 5 seconds after,...)  I tried some of the challenges and that seems to be fun, there is a leaderboard so you can compare your score to other players and try to be the best (carefull, it's addictive as hell since a challenge doesn't take more than 30 seconds) ;)  The sound design is amazing, musics are nice and you won't believe how much diversity the devs could offer you with 'blip', 'bloup' and 'biip' sounds.  Apparently you can unlock things, which I always appreciate.  So... well done devs. Your game was amazing 5 years ago, and you managed to make it even better now :)",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game since Alpha. I've watched it evolve from this little platformer to a titan of awesome.   This is a great little shooter, and one a heartily recommend. You'll be jumping around, blowing things up, bullet time is fantastic, loads of weapons, tonnes of variety. If you like sidescrolling shooters that pack plenty of power, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "THIS. GAME. IS. AWESOME! I play a lot of games, and this is probably one of the best. It has a pretty good story, but personally, I play multiplayer the most. It seems kind of wierd playing a platformer shooter, but this game takes this wierd aspect of shooters, and rocks it. This is why this unique game is one of my favorite games on any platform.",
            "review_score": "1"
        },
        {
            "review_text": "Finally! My Friend and I bought this game when it was in alpha almost two years ago. This game was way too fun, but our enjoyment was short lived. Limited to 4 lackluster game modes and an almost unfunctional level builder, there wasnt anything other than local deathmatch keeping us coming back. Though the experiance was short, it was still one of our favorite games we played that year! Almost two years later, patiently waiting, our dreams came true. Cobalt was finally out! Our expectations were met tenfold. Cobalt is so much better now, and to think its still in beta!",
            "review_score": "1"
        },
        {
            "review_text": "Very well made game. It's fun, pretty easy to get familiar with and is generally a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Very well done and competitive game!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games you wish were more played.  Cobalt is a fast paced action platformer. It has a storymode, and some awesome Pvp modes. One of those gamemodes plugslam could easily be a game on it's own.  Best way to play this game: gather some buddies, get some controllers, get a couch and go! It also has online multiplayer, but unfortunately not many active players.  If you want to play an awesome skillbased action game, this is definitely the place to be!",
            "review_score": "1"
        },
        {
            "review_text": "I did absolutely no research priot to buying this game. All the information I knew was that it's a platformer and that it's a shooter. I wasn't in the beta, and I'd never even really seen this game hyped up like others. But it was created by Mojang, so I planned to buy it no matter what just to support them.   That was an amazing decision. I'm not too far into the game yet, but I already love it. The mechanics are unique to all other plaform shooters. The slow-motion effects give a nice change of pace in the fast paced world of platform shooters, while still maintaining that fast paced aspect that all platform shooter fans love. It's an amazing take on the genre. I haven't' yet touched multiplayer, but I expect it will be just as good as the story mode.",
            "review_score": "1"
        },
        {
            "review_text": "You can deflect more than 20 bullets from ALL DIRECTIONS if you have fast fingers and react quick enough (Yes, I've tried it before).    Just buy the damn thing, it's amazing. Except for the online mode. I never find anyone to play with for some reason.",
            "review_score": "1"
        },
        {
            "review_text": "would be better if for mac to",
            "review_score": "1"
        },
        {
            "review_text": "Fun awsome game, but theres one thing, The games dead no one plays that much. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 just because of the Space Hamsters.",
            "review_score": "1"
        },
        {
            "review_text": "If I had payed money for this game (played during free weekend) I would have been ♥♥♥♥♥♥. I don't think I got through a single online game without having SEVERE LAG ISSUES. (No it wasn't my internet. I game all the time w/ no issues). My favorite gamemode was survival (coop vs bots in waves), and everything would usually go great, until suddenly the everyone and everything stops moving for 10 seconds...and when the lag stops I've died. Also, sometimes the lag never recovers and the game is 'frozen' eternally, forcing you to leave the lobby.  For a game designed to be a fast paced shooter, where the fidelity is high enough to dodge/deflect bullets or explosives... the netcode is simply too terrible to allow that to happen.   When it was working it was an alright game. Most of the guns can only fire 10 feet though which seems needlessly ridiculous. The challenges are pretty fun too.",
            "review_score": "-1"
        },
        {
            "review_text": "I've owned Cobalt for quite some time, since it was first released in Alpha. Back when Mojang could do no wrong and Notch was a god in the gaming world. It's a tight little action platformer, with fairly unique mechanics and deep gameplay. Had a lack of content, polish, and major bugs, but the core concept was solid. I played it on and off for a few months, then forgot about it for years until it got its full release on Steam. I redeemed my code from the alpha version, and tried it out. This game, at a 20$ price point, is unbuyable. It lacks content, and has so many game breaking bugs I would call it an Alpha rather than a full release. I've crashed no less than 16 times playing for a little over an hour, and encountered odd lag in multiplayer. The controls for keyboard are awful, and overcomplicated, so I played on controller, which was mediocre at best. The story seems fine, albeit not voice acted or interesting apart from the gameplay, and the multiplayer is night unplaybly buggy. The funnest part of Alpha Cobalt was removed (the survival mode, like Horde mode/COD Zombies), so I can't really rate that. This game has good core gameplay, but lacks in controls, stability, and content. If this were priced at 10$, you might actually find some people to play with in the multiplayer, which is dead (3-4 players online at peak hours.). I got a good game of multiplayer in with 6 others once, and that was fun. For now, I'm going to give this game a thumbs down.  People who like the idea of this game, try out Duck Game. It's great. Really great. ",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 - Nice visuals, decently responsive, but poor execution and a messy experience.  Perhaps this game just isn't for me, but it feel's a bit uninspiring, bland, and arbitrarily hard at times. It's overly complex in the sense that it gives you a tone of options when it comes to weapons, but it comes abundantly clear why when you realise how simple it is and that most weapons are pretty similar. I find my time playing this to be boring and unenjoyable. Again, perhaps that's because it just isn't my style of game, but those are my thoughts.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is okay I guese? The controls are imposible to use like seen in the trailor despite this the aiming system is boring as it offers no callenge and doesn't make you feel like your doing something cool and then add the fact that if it crashesit will NEVER work again nomatter what you do. ",
            "review_score": "-1"
        },
        {
            "review_text": "Everything made no sense couldnt even handle playing it without wanting to shut it off sorry to say but I would say this 'Game' is a FAILURE!",
            "review_score": "-1"
        }
    ]
}