{
    "app_id": 357670,
    "name": "Home Improvisation: Furniture Sandbox",
    "release_date": "2016-07-28",
    "developer": [
        "The Stork Burnt Down"
    ],
    "publisher": [
        "The Stork Burnt Down"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 136,
    "negative_ratings": 55,
    "price": 6.99,
    "description": "Build beautifully precise or wildly creative furniture! Decorate an entire house with your creations. 4 players can play locally, or invite an online player to help you build!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/357670/header.jpg?t=1469725368",
    "minimum_requirements": "OS: Windows XP Memory: 512 MB RAM Graphics: DirectX 9 Storage: 600 MB available space",
    "recommended_requirements": "OS: Windows 7/8.1/10 Memory: 2 GB RAM Graphics: DirectX 11 Storage: 600 MB available space",
    "reviews": [
        {
            "review_text": "I have one problem that instantly made me dislike the game, now if you want to stick with the game fair enough, but for me i'm not going to drop 10 bucks down on a game like this if it's going to restrict me at the get go and make me play the game for a few hours in order to unlock menues like graphic or sound menues.   I didn't like the controls i would of prefered something more along the lines of shift click to move on Z-axis and middle mouse scrolling to elivate is not a good option imho.  The game had potential to be a fun replacement for the home creator in the sims, a game which can consume HOURS of someones life just making a dream house. This is def something i'll come back to but till then i'm going to not invest at this time.",
            "review_score": "-1"
        },
        {
            "review_text": "Almost comical, but very serious business to do.",
            "review_score": "1"
        },
        {
            "review_text": "Home Improvisation: Furniture Sandbox is a wonderful experience for everybody. I played this onstream, and got 100% of the achievements within 6 hours.   The game is, essentially, IKEA Simulator. You are requested to build a series of furniture, different pieces for different rooms, and each room has about 4-7 items in each.  After decorating your home you are then provided 3 pretty fun challenges, which are orientated around building, speed of building, and smashing stuff.   Overall, a pretty cool and fun experience. Sadly, I did not get the opportunity to try this out in a VR environment, however, I am sure that if I had, it would have been pretty cool.  Nilesy",
            "review_score": "1"
        },
        {
            "review_text": "Home Improvisation is a fun little game with a few quirks here and there. The controls can be a bit wonky and the challenge room does'nt reset right but overall it's a fun little game that you can play a lot with friends and (Even though I don't have a virtual reality headset) I assume it is also very fun in VR and VR Co-op. Overall Home improvisation is a fun game with a few quirks, after all it was made in 48 hours. I reccomend the game to people with the HTC Vive or a lot of creativity/time on thier hands.",
            "review_score": "1"
        },
        {
            "review_text": "Created more realistic lifeforms than Spore thanks to the power of moving joints and physics glitches. That Globeman don't talk a lot but he plays a mean piano.",
            "review_score": "1"
        },
        {
            "review_text": "───────────────────████ ───────────────────█████ ───────────────────██████ ───────────────────███████ ──────────────────████████ ──────────────────████████ ─────────────────█████████ ────────────────█████████ ───────────────█████████ ──────────────█████████ ──────────────██████████████████ ────────────█████████████████████ ───────────███████████████████████ ████████─██████████████████████████ ████████─███████████████████████████ ████████─████████████████████████████ ████████─████████████████████████████ ████████─████████████████████████████ ████████─████████████████████████████ ████████─███████████████████████████ ████████─██████████████████████████ ████████─█████████████████████████ ████████─████████████████████████ ████████─███████████████████████  If you don't press that 'buy button', you will regret it!",
            "review_score": "1"
        },
        {
            "review_text": "Having played this for about 20 minutes with others, it has the potential to be a funny game however playing this with a mouse and keyboard is near on impossible to do. the items you construct expect you to put things together at the right angles for example, a lamp with 3 legs. using a mouse and keys to do this is near on impossible.  I have have also played this using VR and it is a bit better to control and you have more control over the turning and rotating of items, that said i can see this getting boring very quickly.  The music gets old pretty quickly and becomes an annoyance more that anything else.   For 7 quid its not that bad but i would suggest that if you play this, use the VR if you have one.",
            "review_score": "-1"
        },
        {
            "review_text": "Its quirky... maybe a little TOO quirky... I did dig the whole Desktop and Vive Multiplayer aspect but its just too simple of a game...",
            "review_score": "-1"
        },
        {
            "review_text": "not really my cup of tea since i can't build a mother♥♥♥♥ing lamp properly without a manual and it's giving me an existential crisis, but if you like would like to experience it yourself this is probably for you",
            "review_score": "-1"
        },
        {
            "review_text": "How do I refund this??? ",
            "review_score": "-1"
        }
    ]
}