{
    "app_id": 357900,
    "name": "Make it indie!",
    "release_date": "2015-04-01",
    "developer": [
        "Sometimes You"
    ],
    "publisher": [
        "Sometimes You"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Adventure"
    ],
    "achievements": 9,
    "positive_ratings": 544,
    "negative_ratings": 653,
    "price": 0.79,
    "description": "Claw your way through the abyss of the mind and survive the horrors that stalk you as you attempt to survive seven days as... an Indie Developer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/357900/header.jpg?t=1504451402",
    "minimum_requirements": "OS: XP Processor: 2.4 Ghz Dual Core CPU Memory: 1024 MB RAM Graphics: 512MB Dedicated Memory DirectX: Version 9.0 Storage: 1500 MB available space Sound Card: DirectX® Compatible",
    "recommended_requirements": "OS: 8.1 Processor: 3.0 Ghz Quad Core CPU or faster Memory: 2048 MB RAM Graphics: 1024MB Dedicated Memory DirectX: Version 9.0 Storage: 1500 MB available space Sound Card: DirectX® Compatible",
    "reviews": [
        {
            "review_text": "This is not much of a game and even if this is trying to be a funny April Fools joke on how Indie Devs work... it wasn't funny at all and doesn't really work like it should. Let me explain by telling you the Pro's and Con's.  Pros: ♦ Cheap  ♦ Graphics looks pretty good ♦ Has Steam Trading Cards  Cons: ♦ Game tries way too hard to be funny that it's lame ♦ Game content isn't even long enough to unlock 1 Steam Trading Card ♦ Game crashes if you click the 'Work on the Game' option on Day 1 ♦ Game crashes to Desktop if you finish the game with any option ♦ You can litterally skip everything and get 8 out of 9 achievements in under 1 minute ♦ You can skip every stage of the game and not watch any of it ♦ There is only one playable mode and it's boring as ♦ The main game is soo lame all you have to do is click the corner of a circle that shows in every row of circles (Like it's not even fun or funny, it's just lame) ♦ The ending for developing the indie game and playing through minutes of boringness is soo lame and unfunny ♦ No replay value ♦ Filesize seems like a joke (999.9mb). Feels like they set it to that even though it doesn't have 999.9mb worth of Content anywhere in this game... Only way it could be that big is if it's soo unoptomized it's not funny  In my opinion this game has an awesome concept with high potential with many aspects that could have been forfilled that weren't (Concept seems to be implemented poorly with limited content). Like, there is soo much more the Devs could have done with this to add to the content, the gameplay and even to make it funnier that they didn't even look at. Instead we got a miniscule length game with limited possibilities and unfunny jokes that all end before it even begins.   Therefore, on a whole, I finished this completely by getting all achievements in 11 minutes and the only reason anyone would play longer is if they wanted the Steam Trading Cards. I don't even know why this game has Steam Trading Cards as I don't see how it could even have good emoticons, badges and backgrounds! Also, I found this game extremely unfunny and boring not to mention broken (It shouldn't crash on day one if you try to make the indie game and it shouldn't crash once you finish it). It is one of the shortest, most unfun games I've played in a while and I'd recommend you only ever buy it if it's free or you really had 89 cents you had to get rid of.",
            "review_score": "-1"
        },
        {
            "review_text": "The only one reason to  play  watch this is another 100% for your statistics. I tried to enjoy but everything was too poor. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth the $0.99 it's asking for.",
            "review_score": "-1"
        },
        {
            "review_text": "There isn’t much of a game here. You watch videos based on your selection and the only interactive parts are choosing what to do and the simplistic game (click on the quadrant of a circle that is in every shape) that you play in order to ‘develop’ your indie game.  You can choose to develop your game or other activities like listening to music, play with your cat or go for a walk. The videos are on the whole fairly well done with good framing and lighting. The best videos are the Creative Commons licensed ones that play whilst you are developing the game. The music consists of many Russian bands/acts that you wouldn’t have heard of unless you are a native. The game has a quirky sense of humour which tends to fall flat. Fortunately, all the videos can be skipped, which is a good metaphor for the game.   You will unlock almost all of the achievements on your first time playing - all of them if you get the good ending. Within half-an-hour you will have seen everything the game has to offer, and there is really no point in playing it again, unless you want the trading cards. In the information about the game in the Steam store, the developer/publisher asks you to “Don't take this game too seriously!” I was sent a key for the game; if you want to pay for it, bear in mind that there is not much game here, seriously.  Review copy provided by Sometimes You.",
            "review_score": "-1"
        },
        {
            "review_text": "No... just no... I can see why this 'game' was released on 1st April, I get it, I get the joke and am laughing. Well, it was either that or to break down in tears.  But still... NO!",
            "review_score": "-1"
        },
        {
            "review_text": "There's no 'drink vodka' option",
            "review_score": "-1"
        },
        {
            "review_text": "Not a good gameplay, but you can easy reach 100% achievements!",
            "review_score": "1"
        },
        {
            "review_text": "100% Achievements in 8 minutes. If you're looking for an easy perfect game, well, look no futher. You get the first 8/9 in about 15 seconds if you just press 0.   The game itself? It's more of an 'art' thing than a game. You click, a video plays, that's it. Yeah, technically there are hundreds of ways to complete the game, but in the end it's really not a proper game. In any case, I don't recommend it unless you're going for an easy perfect game.",
            "review_score": "-1"
        },
        {
            "review_text": "I LOL'ed maybe twice, but that's it.  It's not fun, it's not a game. It's not a movie. It's not worth your time (although you can finish it in 5 minutes)",
            "review_score": "-1"
        },
        {
            "review_text": "Literally the worst game I have ever played on steam. It's not funny, it's not meaningful, it doesn't have a decent soundtrack or anything, it's just pure garbage.  Those were 20 minutes I'm never getting back.   Edit: Spent a few hours idling to collect cards and partially recover my money.",
            "review_score": "-1"
        },
        {
            "review_text": " Short Review",
            "review_score": "-1"
        },
        {
            "review_text": "Got 50% off for crafting a badge,  Bought the game for 4000 rupiah, Sold all cards for 5000 rupiah.   Thx gaben!",
            "review_score": "1"
        },
        {
            "review_text": "It's not really a game ...and that's a reason enough for a negative review.  It's supposed to be funny but it's not. Few videos (boring and useless if you ask me) and music tracks and a sort of game with not much sense (spam random clicks works better than follow the instructions ...and i'm not joking). You can do all the achievement in less than 5 minutes.  Don't worth the 0.99€ they ask for it ...probably don't worth your time even if you can have this 'game' for free.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, it is different :) Better than some thrash on tv.",
            "review_score": "1"
        },
        {
            "review_text": "You can't really call Make it indie! a game; no matter how it was still kinda fun to experience.  Pros:  - has trading cards - easy to get all the achievements (for those who like one more perfect game in their collection) - bought it for 9 cent  - the music - released on 1st of April  Cons:  - don't expect a real game - I need to wait for my trading cards to drop even so I got all the achievements.  I would recommend the game for everyone who's bored at the moment and can get it for cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Even if it isn't properly a Game, i liked Make it Indie. I purchased this game for 0,50€. Pros: -русский -Cat -Cheap -Has trading cards -Made me laugh -Tips are funny -Some videos are funny Cons -Not enough videos -Not a game  Definitely worth 50 cents.",
            "review_score": "1"
        },
        {
            "review_text": "15 minutes and you're done (not counting grinding for cards and the second ending)... but does that mean it's a bad game? I don't think so, I feel the game set out to tell you one simple thing and it succeeds in this very well.  In order to achieve something (in this case creating an indie game) you need to work hard on it every day. This is the only thing separating the succesful from the unsuccesful.  This isn't a deep thing, but it  is  an important thing. I see no reason not to recommend this game... just don't expect too much.",
            "review_score": "1"
        },
        {
            "review_text": "It looks like the idea of the self-published developers was to both troll and make money in the process. They succeeded with great success, this is like the main course at a seven course meal of trash.",
            "review_score": "-1"
        },
        {
            "review_text": "I've never pressed the button '0' so much in my entire life.",
            "review_score": "1"
        },
        {
            "review_text": "What a terrible, terrible game. I have to say they could have added any variety of positive options to make this even semi-interesting. But no. Understand that the higher gameplay I have was to get out Steam Cards. I was happily playing anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game ive ever played highly recommend to friends GOTY",
            "review_score": "1"
        },
        {
            "review_text": "50/50",
            "review_score": "1"
        },
        {
            "review_text": "This is the most why does this exist game I have ever played. This would have been better as a free to play game. Is this an artistic game?    Don't buy this please ",
            "review_score": "-1"
        },
        {
            "review_text": "This is not a game. It's more of a story.... and not a good one. All you do is click some shapes to develope your game or you do some other stuff.   It's a 5 minute Procrastination simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "easy cards and achievements",
            "review_score": "1"
        },
        {
            "review_text": "  If you want to waste your time - that game is for you ... but , who want to waste some time of life , every second is importent ! just no...",
            "review_score": "-1"
        },
        {
            "review_text": "You can get 100% on achievements by doing nothing.. and that's it, that's the only good thing on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Artful but...   ....what did I just play?",
            "review_score": "-1"
        },
        {
            "review_text": "Wouldn't even call it a game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game looked better than it was. The only gameplay was clicking a quater of a circle that has that corner in common with a bunch of other circles. The rest is just cutscenes. Watch the cutscenes online, if you absolutely NEED to, do not spend money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a game. Dull. Only for those after easy achievments or cards.",
            "review_score": "-1"
        },
        {
            "review_text": "I think this was a joke, seeing how it was released on april 1st. It's not even a game.",
            "review_score": "-1"
        },
        {
            "review_text": "It is literally just video clips that play after you click on some text. This is incredibly lazy and I've seen more time and effort put into a seventh grader's powerpoint presentation.",
            "review_score": "-1"
        },
        {
            "review_text": "  Got this in a random giveaway. Still consider it a loss, since I wasted 20 minutes of my life on this And yes, that's how long it took to finish it.  Compeletley boring 'game' which is basically the same 'minigame' of clicking on a pie chart over and over again. With a video of some Russian dude waking up before every game. Why was this even created?",
            "review_score": "-1"
        },
        {
            "review_text": "This game looked better than it was. The only gameplay was clicking a quater of a circle that has that corner in common with a bunch of other circles. The rest is just cutscenes. Watch the cutscenes online, if you absolutely NEED to, do not spend money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Its not a game - this is art!",
            "review_score": "1"
        },
        {
            "review_text": "Its fast, easy and fun. Beware of the later devolment lvl's tho xD can you keep your concentration and get a perfect ending ;) Have fun! ~Tchii",
            "review_score": "1"
        },
        {
            "review_text": "I have absolutely no idea how to rate this 'game'. First off, it's not a game as you'd expect it on Steam. BUT! If you're open for the visuals and the music that's played i guess there's enough value in there :) I think the 'Go to the exhibition' is as russian as you will find on Steam, so, ya.... you know what - it takes me less time to drink a beer and that costs like 4 times what they ask for this game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a waste of money... The only game play is you click occasionally and then it lags to determine what you just clicked. The funny part about that is that sometimes you only have the option to click one thing so what's up with the random lag? The rest of the game is random video clips and low quality music (that happens to not be English). The achievements are given to you for watching your real life waste away as the game 'plays' itself. Don't spend any of your money on this even though it is cheap because it is cheap in every way including but not limitted to: cost to purchase, cost to make, graphics, music, sound, gameplay, etc. I was looking forward to a game with substance and the developers tried, but if you want substance look elsewhere for a game.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;Thought It'd be at least decent...  &gt;I payed 71p for it and thought 'Hey, can't be that bad!' &gt;Waited 7 minutes for it's download  &gt;Started up game &gt;Saw intro &gt;Played first game &gt;Mashed buttons on keyboard &gt;Got all achievments  -Achievment Simulator 2015-  ",
            "review_score": "-1"
        },
        {
            "review_text": "Single Worst Game on Steam , not even worth 50 cent , one of the achievement is a picture of a cats ♥♥♥♥ , I'm Done",
            "review_score": "-1"
        },
        {
            "review_text": "Well, this game is a bit special. I did like it, the concept and all, but it's way too short, with very little replay values. Also, it's quite repetitive, if you actually decide to work on 'your' indie game. Just like in real life. Just to say, it took me 15 minutes to get everything, and I spent the rest of the total time waiting for Steam Trading Cards.  It's a really simple game. You have a week, a total of 7 actions, which consist pretty much as 'Work on your indie game' or 'Do not work on your indie game'. Obviously, it's not /that/ obvious, but with little to no thinking, it's almost as obvious.  If you decide to work, you get a little puzzle game that's quite simple at first, getting harder day after day. While, if you decide to have fun, you get treated to a short video. Basically, it's 'video or logic game'. You also get to see a video every night.  Thought, I do have to give the game some points, since it gives a great moral lesson: 'You can do everything you want, if you actually spend time towards your goals.' Even if it's repetitive, boring, uninspiring, if you work toward what you want to do, if you work to do what you want, you only need to invest time in it, and eventually, you'll do it. Maybe not in a weekend.  You can actually finish the game in 5 minutes, since the author thought about making a skip video button, which is sometimes a real time saver.  This game is quite original, there's some place for improvements, but it gets bland and repetitive way too soon.  If you're an achievement hunter or someone who wants a really cheap game on steam, this is the game for that.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a fast 9 achievements and another 100% game on your profile, pick this up.  If you're looking for ANYthing other than the above, look someplace else.",
            "review_score": "-1"
        },
        {
            "review_text": "All you need for this game is a bottle of vodka and a makarov with one bullet",
            "review_score": "1"
        },
        {
            "review_text": "Best game I ever played in my life. Where was this game when I was born? The graphics are so realistic you could place this over GTA, Far Cry, Assassin Creed AND BAD RATS! Buy this game now.",
            "review_score": "1"
        },
        {
            "review_text": "the game is a big pile of ♥♥♥♥!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "as crazy as it may sound... I kind of liked it. I got it for free (and you can too, there is a link for review/press copies in the steam forums for this game) and even if I were to pay a dollar for it, I wouldn't be too mad with what I got. It was a nice little experience. I wish it was a bit longer but still. I enjoyed it. I'm a sucker for artsy kinda stuff like this. The game you play when you're 'making your indie game' is kinda fun, I wish there was some kind of endless mode where it kept track of your score.  overall, Don't buy this if you think this is some cheap alternative to 'Indie Dev Tycoon' DO buy this if you enjoy artsy little experiences. It took me around 15 minutes to get both endings but still. I like it. I may come back to it just to see all the little movies again.",
            "review_score": "1"
        },
        {
            "review_text": "this game is not fun at all, it's just a bunch of videos.",
            "review_score": "-1"
        },
        {
            "review_text": "-- Weird &amp; unique gameplay... -- Use an old mouse for the 77 annoying clicks.. -- Easy achievements -- Don't play it again!  10/10",
            "review_score": "1"
        }
    ]
}