{
    "app_id": 358090,
    "name": "D4: Dark Dreams Don’t Die -Season One-",
    "release_date": "2015-06-05",
    "developer": [
        "Access Games"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Story Rich",
        "Great Soundtrack"
    ],
    "achievements": 78,
    "positive_ratings": 1312,
    "negative_ratings": 305,
    "price": 10.99,
    "description": "This is the story of a man with a very strange fate. His name is David Young. Two years ago, his wife was murdered by an unknown assailant, and Young suffered a blow to the head that cost him his memory. His wife's final words: “Look for D.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/358090/header.jpg?t=1553250672",
    "minimum_requirements": "OS: Windows 7 64-bit edition / Windows 8 64-bit edition / Windows 10 64-bit edition Processor: Intel Core 2 Quad Q9550 @ 2.83GHz or an equivalent AMD CPU Memory: 6 GB RAM Graphics: NVIDIA GeForce GTX 470 or AMD Radeon HD 6870 (VRAM 1GB) DirectX: Version 11 Storage: 10 GB available space Sound Card: A DirectX 11 compatible card Additional Notes: Keyboard and mouse necessary. Compatible with XInput controllers such as the Xbox 360 controller. Display: 1280x720.",
    "recommended_requirements": "OS: Windows 7 64-bit edition / Windows 8 64-bit edition / Windows 10 64-bit edition Processor: Intel Corei7 4770K @ 3.5GHz or an equivalent AMD CPU Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 670 or AMD Radeon HD 7850 (VRAM 2GB) DirectX: Version 11 Storage: 20 GB available space Sound Card: A DirectX 11 compatible card Additional Notes: Keyboard and mouse necessary. Compatible with XInput controllers such as the Xbox 360 controller. Display: 1920x1080.",
    "reviews": [
        {
            "review_text": "This games' only flaw is that it does not star FBI Special Agent Francis York Morgan.  That and David sticks his gum all over the place like an animal.",
            "review_score": "1"
        },
        {
            "review_text": "-Synopsis- D4 is a strange adventure game about a detective, David Young, who has lost some of his memories and is trying to uncover the mystery of his past using his new found power to travel through time and place using mementos. Through his journey he meets some of the most eccentric characters imaginable and must interact with them to uncover clues. The interface is point and click with various action sequences mixed in each of the 2 episodes. The game can be played entirely with the mouse which is great because you need a free arm to constantly wail in the air as things get more and more bizarre.  Pros: - Amazing and memorable characters. - Interesting story and setting that kept me immersed. - Action sequences have style and add well to the mix. - Interface is stylish and simple. - Music fits the mood and it's really good. - Vision system to help uncover clues.  Cons: - Only 2 episodes in Season 1, but they are both fantastic. - It is a linear story. - Ends with a cliffhanger and things don't look good for a second season.  Verdict: I was really surprised by this game, the story, setting, characters, mood, and style are all amazing its gets 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Made me ask stupid aircraft questions to my girlfried. Now I'm single.  10/10  Pros: - SWERY - positively weird - imaginative - surprising - 'mouse only' controls actually work - story and direction - fitting soundtrack - flexible black doctor that dramatically wields a knife and fork while talking ominous stuff in slow motion before folding into a vent  cons: - short - evil cliffhanger ending - no antialiasing - failing aircraft trivia at question no.10  If David Lynch was a Japanese game developer, this is what you'd get.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting ideas, funny, and good story .. I couldn't ask for more the game is great and I look forward to season two",
            "review_score": "1"
        },
        {
            "review_text": "Take my money and give me the second season NOW!",
            "review_score": "1"
        },
        {
            "review_text": "My body needs that 2nd season so much ;-;",
            "review_score": "1"
        },
        {
            "review_text": "A bizarre game from a bizarre mind, but my god is it great.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice story driven game. When you ask me to which games this is similar, I'll answer with the latest Telltale Games. Basicly this is an interactive movie. The intro of every episode is like the intro of a TV series where the characters are showing with names.  There are small cutscene like parts with a lot of quicktime events. I played with a controller and had to use both sticks, all 4 buttons and both triggers during the quicktime events. The rest of the game you are walking through the scenes and exploring everything. There is really a lot to interact.  But be aware, the story is not finished. I hope they release the next season soon. I am thrilled to see how the story develops.  Highly recommended, if you like those movie like games. Not recommended if you don't like the genre",
            "review_score": "1"
        },
        {
            "review_text": "  A Necessary Experience!",
            "review_score": "1"
        },
        {
            "review_text": "This game oh this game. When i heard that there was a game called d4 I thought it was another game in the D's Dinner  series but this is a totaly diffrent ball game. Minor spoioler alert   You play P.I. David Young. Due to unfortunet events your wife is killed and in her last moments she tells him to look for D. In order to find this D he must use his special power to travel into the past and find out who or what D is. The game runs very smoth and has a lot of japanese impulses. For instance there is a girl named Amanda who lives with David and well take the term cat girl and thats what you get only difrence is she acts exactly like a cat. Now i know that might turn people off but even so I beg you to give it a try anyway. The story so far is great. I won't spoil too much but let me just say there is a character that will probably give you nightmares. Overall the Characters are all very memorable and the story is interesting. I implor you to buy this game whial its on sale. Its only two episodes but even so its a steal",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the craziest, yet better-written point and click games I've played.  Great soundtrack, a rather intriguing private-eye style analysis mode for objects, lots of little details to pick at and files to find. Mesh that with easy to use point-and-click controls and QTE sequences - that are much easier to deal with than many others - and a cast who have accents suiting the game's setting and their character.  Overall, D4: Dark Dreams Don't Die is a very surreal game in places, with a weird sense of humour and a unique style, that I recomend to anyone who is a fan of previous SWERY works or jsut wants to experience a unique slice of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "The story is just too good. I like that it has events for everything you do. Makes every single simple everday thing special. Drinking a shot of tequila? HYPE OVERLOAD. Slam the empty glass on the table... 3 TIMES. DIFFERENT CAMERA ANGLES. Man I love that japanese taste. There's so many questions after finishing the first season. The only thing I hate about this game is... That it's over. MORE, MORE, MORE!",
            "review_score": "1"
        },
        {
            "review_text": "Ye gods, it's like   Deadly Premonition   and  Cognition  had a baby, and then the baby grew up to be a stoner with an assortment of mental disorders and a mystical obsession with the letter 'D'.  Comparisons to  Deadly Premonition  are inevitable, so I'm just going to roll with them. First, the good: Access and Swery65 have gained an incredible amount of technical and artistic competence since  DP . Far from being another (lovable) bug-infested eyesore,  D4  runs smoothly and looks beautiful and stylistically distinctive. It also retains the quirkiness that made  DP  endearing. The QTEs are much more forgiving than they were in  DP , and much more entertaining, as well, featuring ridiculously over-the-top cinematic action sequences, a little more variety in required actions, which is all the better since they feature more prominently. The point-and-clicking part is fun as well, and never leaves the player clueless as to what they should do next (that's not a jab at  DP , by the way; just a jab at many other point-and-clicks).  I'm afraid, though, that Access also seem to have lost something of their ability to tell a story well. There's a great, memorable story in  D4 , but the pacing is so very far off.  DP  built up suspense gradually, letting you enjoy the (ugly) scenery, sidequests, and character development, while trying to solve the big mystery yourself.  D4 , by contrast, rushes headlong to the conclusion. It's around 6 hours long, and ends abrubtly with the unmasking of the villain and a huge cliffhanger almost the instant the stage is finished being set (we'll have to wait for season two for a resolution). It does have sidequests, but they're easily missed and quickly finished when you do find them. Also, did I say that it retains  DP 's quirkiness? I'm sorry; I meant to say that it turns the dial up to 11 on  DP 's quirkiness. If you thought the cast of  DP  was eccentric, you're in for a shock. Access have gone to extremes this time in in creating characters with a variety of exaggerated personality quirks and neuroses. There's no denying it makes the game stand out more, but it does feel overdone at times. Which makes it all the more surprising and disappointing that the protagonist himself is just a vanilla detective stereotype: he's a private eye who's obsessed with solving his  wife's  [tvtropes.org]   murder  [tvtropes.org] . If that sounds familiar, that's because it's been done before. And there's not much else to him, apart from his time-traveling power. Also, his LP collection, hockey trophy, love of bubblegum and tequila, and exaggerated and slightly annoying Boston accent. I miss York.  Access have also gone off the deep end with the collectibles. The game may be little more than a tenth as long as  DP , but it's got at least 10 times the character outfits to acquire. C'mon, Swery, do we really need that many? There are also collectibles for restoring stamina, Vision (temporary object highlighting), and health, but apart from health, this feels like a thoroughly unnecessary holdover from  DP . Stamina doesn't make much sense here (is turning a door handle really that exhausting, David?), especially given the short time span the game covers, the amount of food you need to wolf down to make it to the end (how can you still walk, David?), and the mechanic's utter lack of any contribution to game balance. You'll never need to worry about running ot of Vision, either. New to  D4 , Access have even added achievements for shoving as many things as you can. No, really. There's no rhyme or reason to it, although I suppose it does add somewhat to the game's quirky charm. Incidentally, much of the DLC is just for unlocking items that can be found in-game, or adding yet more character outfits, and all of it can be safely ignored.  Don't get me wrong; I still recommend  D4  , despite its numerous flaws. It's just so freakishly bizarre, I can't help but like it. It's pants-on-head insane, in a good way, and must be experienced to be believed - but you ought to have some idea of what you're getting yourself into before you buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A surreal experience for sure. Beautiful cell shading, great voice acting, very funny dialogue, combined with an intriguing story. Put that together with all the side stories, quests, and collectables, and you have a bizarre journey though this SWERY masterpiece. After their disheartening port of Deadly Premonition (though it's a great game off the PC), I was wary about how good D4 would be. I was pleasantly surprised! Looking forward to the second series of this game.",
            "review_score": "1"
        },
        {
            "review_text": "nice story telling. i only played alittle bit with it and its a click mouse type of game and there are some keyboards controls but not alot to confuse the player with. this game works very well with keyboard and mouse. its messed up and funny. the first part had me saying wtf? lol. if you liked heavy rain on the ps3. then this will be a treat for you. you can also use controller as well for those who like controllers. since i havent beaten this yet. i highly recommend it. for now i enjoy the rest and wait for the rest fo the seasons to happen for this game. it looks like its off to a good start.",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly fun and kooky adventure game, unlike Swery's other well-known game Deadly Premonition this one actually looks really good and replaces the jank gunplay with really interesting QTEs and mini-games that really puts the recent Telltale games to shame. You can get so lost in this exceptionally well crafted game, walking around David's apartment either doing dumb stuff like cracking a mountain of fortune cookies or looking at things that give you an insight into his relationship with his late wife Little Peggy. This all syncs up with an amazing soundtrack that I myself cannot stop listening to. 9/10, perfect choice for people who are either into interesting stories and point n' click style games or those who love quirky characters and the over the top storytelling that Swery is most renowned for.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really 'special', not in the mentally ♥♥♥♥♥♥♥♥ way but in the weird outcast way. Its like a mix of Deadly Premonition and any of the Telltale games.  At the moment there are only 2 Episodes which can be completed in 2-4 hours and its not confirmed if an Episode 3 is going to be released or they just make S2.  If they directly make season 2 its not worth 15€, if episode 3 comes out its a great game and totally worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the fact that it will probably never be finished, you should still give this quirky world filled with great characters a look.",
            "review_score": "1"
        },
        {
            "review_text": "I was worried from the beginning that the Kinect controls, which were actually extremely good on the Xbone version, wouldn't transfer over very well, and to an extent that seems to be the case. A lot of the more humorous actions, like slamming your fist down to crack a fortune cookie or swinging a baseball bat (in the Xbox version you're actually instructed to get into a batter's pose and swing alongside the character), are replaced with simple actions like clicking on your fist and dragging it to the cookie or swiping across the screen to swing the bat. It still feels okay, and the game itself is still fantastic, but even though I'll still continue to buy the following seasons on both platforms I'll probably only actually play them on the Xbone, because ultimately I feel like this is a game that's made for the Kinect (and probably the only game made for the Kinect, for that matter).   In the end, if you're a fan of the parts of Deadly Premonition that didn't involve combat, and you appreciate quality over quantity (from what I remember from the Xbox One version, the game is only about 5-10 hours long depending on how much effort you put into the side content, so if you need to get your money's worth you might want to wait for a sale) you'll love this game. If you have an Xbox One (why?), I'd recommend buying it there instead unless you just really really like having your games on Steam (which I wouldn't blame you for), but if you don't have an Xbox One this version is a perfectly fine port.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not easy to put into words. If you are looking for somthing interesting and well off the beaten path, I recomend this game. I wish there was more than two episodes of it, which in someways is good because if it was bad, then I would not want more.",
            "review_score": "1"
        },
        {
            "review_text": "I poured myself a cup of coffee and made a sandwich. Black coffee, of course, and a turkey, strawberry jam and Captain Crunch sandwich, to be exact.   'I'm ready,' I said to myself.   Then I got attacked by a cat girl, an obese man deepthroated six hotdogs simultaneously and a flamboyant man with a mannequin made fun of the way I dressed.   I wasn't ready.",
            "review_score": "1"
        },
        {
            "review_text": "First off I want to say that this is indeed a great game. But every pro has its con. The game contained a very interesting story and setting that you don't find in many other games, on the flipside the story doesn't last to long. My record says 4.4 hours and that was with me taking my time (did I miss some things, sure, but did I even attempt to speed run it, no). The game controls and mechanics are very neat, it is a point and click-esqu style game, with better graphics and a 'stand right here' style movement system. This said, if you have a large screen or a slow mouse, you might want to consider hooking up a controller, otherwise this game can feel pretty clunky with your mouse at the start. I would recommend but would definitely beware, if you wanted a super long lasting, very smoothly controlled game with lots of action, this isn't the game you should buy.  If you are looking for a casual game to mess around with for a day or so 10/10 would recommend. If this game goes on sale, would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Batshit insane, hilarious and intriguing. Well worth a go.",
            "review_score": "1"
        },
        {
            "review_text": "David Young's voice (Main Character) Is the one thing that brought me to this game. ",
            "review_score": "1"
        },
        {
            "review_text": "Takes all the good things from Deadly Premonition while removing a lot of the awful things from that formula. TGive it a try.",
            "review_score": "1"
        },
        {
            "review_text": "You can dress like both Zach and Francis York Morgan.",
            "review_score": "1"
        },
        {
            "review_text": "As others have said before, it's quite short and may not be worth the full price. However, I still would suggest checking it out via a sale or recent surge in your wallet from your employment giving out that holiday bonus you so needlessly needed. I plan on at least buying another copy or two, to not only share in this wonderful tale of a gum loving detective, but to support the dev SWERY who brought us Deadly Premonition. Here’s hoping for a resolution this bizarre tale.",
            "review_score": "1"
        },
        {
            "review_text": "D4 is a surreal. How surreal? Your wife's dead, you survived a bullet to the head, your cat's a full grown woman, and your best friend can eat SIX hot dogs at once. Verdict: Welcome to the world of SWERY. We are all mad here.  ",
            "review_score": "1"
        },
        {
            "review_text": "An episodic, point-and-click adventure game in the same vein as the works of Telltale. However director Swery's special brand of weirdness that made 'Deadly Premonition' such a cult hit gives this game an identity all it's own. His unique style pervades through every part of it.   The story is instantly gripping. Unique themes are prevalent throughout and the tone is constantly shifting. Moments can range from serious and emotional, to goofy or downright odd. An interesting and compelling world has been crafted and I can't wait to see where the tale goes from here. The only thing I would like to see improved are the graphics. I get that they were going for a graphic novel style with the cell-shaded graphics, but other games have shown how to do it better.   Gameplay is also on the very solid side. As typical with the genre you'll be exploring the environments and solving some great puzzles, but Access Games has thrown in some great scenarios. Plenty of side-quests are made available by the characters you'll meet and they usually offer some goofy thrills. Quick-time events are fun, mostly because of the crazy stuff that's happening on-screen. It's just a shame that you have to put so much emphasis on watching the inputs, because you miss some of the entertaining stuff that's being caused by them.   'D4' is a real treat that takes the oddball charm that I loved so much in 'Deadly Premonition' and applies it to a compelling episodic adventure. With so much mystery in it's story and such a delightfully weird cast of characters the wait for season 2 is going to be grueling. Luckily there are plenty of reasons for me to dive back in to 100% percent this while I wait. These first two episodes can provide a unique experience for adventure game fans and I recommend you give it a look. My total score is an 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great story! A little short though so I recommend to buy when discounted. I'm looking forward to playing season two!",
            "review_score": "1"
        },
        {
            "review_text": "This is so damn trolly. So F***KED up. Over the top. Insane. Lots of WTF where they thinknig momemts. Tons of rapey scenes.   But so much fun because of it.",
            "review_score": "1"
        },
        {
            "review_text": "Charmingly weird and wonderful. More games like this should exist.",
            "review_score": "1"
        },
        {
            "review_text": "I have a short attention span with most games, but this one kept me interested all the way through. Definitely recommended, let's hope season two comes soon.",
            "review_score": "1"
        },
        {
            "review_text": "I hate that it's short...but SWERY did a great jerb.   10/10 avant garde.",
            "review_score": "1"
        },
        {
            "review_text": "It's set in Boston. The main character has a fake Boston accent. The gameplay's kinda boring and sometimes tedious, consisting entirely of hovering your mouse over objects and moving it in different directions in order to open every single door. Since it's not anime styled you would think it would be exempt from typical Japanese quirks but they're still there; they're just a little more subtle (there are white people everywhere yet they all act like Japanese cartoon characters). There's also a mysterious black man that's introduced who is like this game's G-man except he talks ridiculously slow in an effort to make him seem creepy, but all it really does is make the game drag unless you skip his dialogue. Also, the game consists of a prologue and 2 episodes making it about 6 hours long and ends on a cliffhanger with literally nothing resolved.  Regardless, it's unique, (despite the fact that the main character has amnesia and is looking for the killer of his dead wife and is being helped out by his friend Teddy and collects MOMENTOS *cough*) so I recommend you get the game when it's on sale just for the experience of a Japanese manufactured acid trip.",
            "review_score": "1"
        },
        {
            "review_text": "A short interesting game by Japanese David Lynch",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING GA,EPLAY AND GRAPHICS 10/10 BUT IF YOU HAVE A SLOW COMPUTER LIKE ME IT WONT WORK",
            "review_score": "1"
        },
        {
            "review_text": "Swery makes games that make me happy, this is no exception.  I hope he gets to do more of them.",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game.  I really recommend it for playing, well, taste is taste and everyone have their own, but i must say, one of the best games i ever played.  The characters, the story, the gameplay itself. Just everything on it is awesome.  Each chapter give a taste of ' Oh boy, what will happen next ? ' and if you want a game to spare time, this is a good bet.  Just check it on Youtube videos of the gameplay, and feel if you like.",
            "review_score": "1"
        },
        {
            "review_text": "There needs to be more episodes...",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece. Cannot wait for the second season. SWERY does it again. :)",
            "review_score": "1"
        },
        {
            "review_text": "It's ... it's weird. Amd i love it.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Truly story rich. Controls on pc is not standard gaming fare but not difficult to master.",
            "review_score": "1"
        },
        {
            "review_text": "Watch a fat man eat five slices of pizza simultaneously. Shove some plants and animals around. Decimate a few fortune cookies. Take a commercial flight to meet the most annoying passenger ever, and enjoy some batting practice with a mannequin leg. Drink lots of tequila. This is D4: Dark Dreams Don't Die.  A point-and-click adventure game, murder mystery, trivia challenge and fortune cookie simulator all rolled into one. A must for Deadly Premonition fans, or anyone who likes ridiculous, surreal games. Lucklily the PC port is worlds better than Deadly Premonition's, thank god. The price is a bit steep considering the brief length of the game and the abrupt cliffhanger ending, but it's definitely worth picking up on sale. Season 2 is also on the way, hopefully before too much longer. But even if it never sees the light of day, this brief descent into madness is perfectly enjoyable in its own right.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Truly story rich. Controls on pc is not standard gaming fare but not difficult to master.",
            "review_score": "1"
        },
        {
            "review_text": "Completed 07/09/2016.",
            "review_score": "1"
        },
        {
            "review_text": "Swery/10",
            "review_score": "1"
        },
        {
            "review_text": "Waiting for season 2 . . .",
            "review_score": "1"
        },
        {
            "review_text": "This is a story of a man with a very strange fate.",
            "review_score": "1"
        },
        {
            "review_text": "beautiful game! hope season 2 happens!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a wonderful balance of weird and fun. It's wildly original and really stands out from other games on the market today. Dark Dreams Don't Die is an underrated game for sure. Don't hesitate and just play it! :D",
            "review_score": "1"
        },
        {
            "review_text": "Most Awesome Detective game i've had ever played!",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest, this usually isn't my genre of game, but boy was this a pleasure to play.  A wierd mixture of goofiness and a serious plot that keep you wanting to know what happens next. I would definitely recommend this game if you need a good plot with some great laughs.  The only thing I should warn is the game is fairly short, there's two episodes and a prologue. I put in roughly 5 1/2 hours into the game going straight through, but if you like to check out every little thing in the game you'll probably get closer to 8-10 hours out of it.  I can't wait until Season 2!",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of Deadly Premonition with its weird characters and plot, and narrative driven adventure games in general: I highly recommend this game.   The story is fascinating and keeps you wondering what's going to happen next while you get attached to all these bizarre characters that you can't do anything but love because of how bizarre they are.   The interactions with the environment are goofy and they encourage the player to literally touch everything there is on the screen because they reward you with points if you do so, even the characters can be touched and they react accordingly: it's funny and I love it.  There are also a bunch of QTEs during the story, but don't worry because these are actually entertaining and fun to do unlike some other games where they are just annoying to get through. I actually think the quicktime events in this game are some of the best in all of videogames.  Unfortunately the real bummer is that the story ends on a cliffhanger, but they're already making a second season that I hope it'll get released soon enough. I want this game to sell well so we can get one step closer to getting that sequel!",
            "review_score": "1"
        },
        {
            "review_text": "This is how you do a Heavy Rain/The Walking Dead style game. Great music, art, story, and voice acting. Heck, even the quicktime events are fresh and fun. Here's to hoping season 2 actually comes out!",
            "review_score": "1"
        },
        {
            "review_text": "One terrific quirky adventure game. Really wish more people would buy this",
            "review_score": "1"
        },
        {
            "review_text": "Just play it, you won't regret it! Caution: unfinished game",
            "review_score": "1"
        },
        {
            "review_text": "I have so many questions left so now i wait for the answers",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome game",
            "review_score": "1"
        },
        {
            "review_text": "Short on length but not short on quality. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Controls took a bit to get used to, occasionally the game would'nt register my gamepad during QTE's, only two episodes and a prologue available for season 1 and still unknown if there will be more. Ultimately one of the best point and click episodic games I have played. The soundtrack is awesome, the QTE's are epic and fun to watch (sometimes to the point of distracting you from the prompts), an interesting obersavtion mechanic that ALL future point in click games need to implement (looking at you TellTale) and of course filled with fun, crazy characters. BUY THIS GAME SO SWERY WILL MAKE MORE! BEGIN YOUR SEARCH FOR D!",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game on sale and now I regret my actions, I should have bought it at full price just to support the genius that is SWERY. D4, much like Deadly Premonition, is a pretty weird game, but not as polarizing as DP was. It helps that D4 looks pretty nice with the cel-shaded graphics and doesn't run horribly. People looking for deep gameplay isn't going to get that here since the game is point-and-click with QTEs mixed in, and quite honestly the QTEs are fun in the right mindset, but that's all a player is going to get when it comes to interaction.   The greatest perk of the game is not its gameplay or looks, but its characters. The characters are memorable and are indeed quite quirky; every character has something odd with them and yet the game presents them so nonchalantly that I don't believe it wasn't done on purpose for the sake of humor. David Young himself with his contant bubblegum chewing and Boston accent is delightfully charming in an industry full of 'serious' protagonists that wouldn't be caught dead making stupid faces at Chinese fortune cookies or piling on a literal pound of crackers in clam chowder. In a nutshell, the game is refreshingly silly while keeping its gameplay simple enough to be able to be easily picked up and played.  The only major con is probably the con that everyone gives this game and that is that it is currently unfinished story-wise, and there is no real ETA on when the next episode is releasing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quirky as hell, and essentially a QTE point and click game. You should definitely check this out if you are a fan of Deadly Premonition, SWERY's (the game director) last title like this. The only issues that I have with the game are that it is quite short, and the awkward controls, but you get over the latter pretty quickly, as the atmosphere the game creates is really why you keep playing. I am not kidding, the mystery that D4 creates for you is really enthralling, and every single character is outrageous and interesting. I really can't think of any games that create an experience like it! I really want to see the series continue, and I cannot wait for season 2!",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a brilliant and intriguing story but with awkward controls (which are not hard to overcome). In desperate need for a second season!",
            "review_score": "1"
        },
        {
            "review_text": "this was amazing but soo sorta and with no ending :'( i could go for a few more seasons!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and interesting story, great characters &amp; music, i loved it!",
            "review_score": "1"
        },
        {
            "review_text": "Suda? Is that you?  I loved the game. Gameplay kinda winds back to when I was playing No More Heroes on the Wii. Character depth is built throughout the entire playthrough and the story will have you double guessing yourself on whats going on at all times. While only 3 episodes seems really short for an episodic type game I'd still say it is worth it at full price. I did buy this during summer sale but have been watching it closely, and my main deterent for not buying it earlier was due to the length. In the future when season 2 comes out I'll have no problems shelling out full price.",
            "review_score": "1"
        },
        {
            "review_text": "I have played about 2 hours into this game and I can safetly say that I'm love. The humor is witty and saracastic, and the people are strange, human, and downright outrageous sometimes, but that's what made me fall in love in the first place. I would reccomend this game to anyone who has ever played any Telltale game, since there are many similarities--but not enough to make D4 seem unoriginal. This game has been a wild ride and I'm still on the edge of my seat! I sincerely hope it does well enough and the developers can raise enough money to make a season 2. If this game ever gets a Kickstarter or IndieGogo I'll willingly put a large chunk of my paycheck towards it's development. As I said, this is an amazing game and you should definitely check it out!",
            "review_score": "1"
        },
        {
            "review_text": "Season Two PLEASE?!?!?!",
            "review_score": "1"
        },
        {
            "review_text": "Bizarre, Surreal, a rip roaring ride.. Just some of the things i thought about this game as I played it.   To Soon, Unsatisfactiory, like an earliy ejaculation. Things I thought at the end of the game.  Game is short and story is not finished, but hopefully a sequel will finish this amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Stylish point-and-click adventure with QTE, mini-games and collectibles. The 1st season includes 2 episodes and ends on a cliffhanger (~5 hours). Hard to recommend at the current point.",
            "review_score": "-1"
        },
        {
            "review_text": "The devs behind this game have disbanded, which means it'll never be finished. So don't bother buying unless you want maybe 3 hours of gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "There are plenty of great games that prioritize plot over gameplay, to great effect. That's clearly where this game was headed, but good storytelling needs more than quirkiness. This game looked promising, but the story was ultimately uninspired. Alternate recommendations: if you're looking for something quirky and thoughtful, go for Life is Strange. If you're looking for something quirky and funny, go for Tales from the Borderlands.  The gameplay in D4 isn't spectacular, but definitely could have held up a narrative if the story was worth telling. Most of the time, you're exploring the world in a point-and-click adventure game style. Every time you interact with something or talk to someone, your stamina drops, an mechanic reminiscent of Deadly Premonition's exhausting status management system. It's enough to discourage exploration, which seems backwards for a game about investigation. The 'revelations' you get for gathering a complete set of clues are pretty bland for a detective game as well.  The other major game mechanic is in action sequences, which is nothing new for narrative games. D4 does a beautiful job of making them feel unique, though, both in the character actions that play out and in the combinations of inputs that are needed. This is pretty much where the game shines, and it just feels awesome to dodge a knife by spitting your gum at it to knock it off course. The only real downside is that it's hard to understand why you get penalized at some points. Regardless, the action sequences combined with the attractive art style of the game make it a real disappointment that the story was so subpar.  The story is pretty straightforward: ex-cop David Young doesn't remember much about his past, but has the ability to dive into certain points in the past through artifacts known as mementos. So he's going to do that a bunch to solve the mystery of his wife's murder. Unfortunately, there's no rhyme or reason to any of the investigations, other than that some of the characters' names start with the letter D. No, seriously, that's the reason Young gives for his investigations. We're a full season into this game with NO connection from any of the characters to the murder of Young's wife. It makes it really difficult to take any of the drama seriously.  A subpar story indeed, but perhaps the weakest part of this game were the characters. Most of them are nothing more than the tired tropes that inspired them. David Young is an ex-cop with a single-minded determination to solve a case that's gotten too personal (even though his investigation basically involves turning to the 'D' page in the phonebook). Olivia, one of only 4 female characters in the game, is little more than a love interest for Young. And the effeminate character in the game is treated as repulsive and deviant (surprise surprise, coming from the people who made Deadly Premonition). Nearly everyone is antagonistic, and a few characters are just unpleasant to talk to, making the dialogue excruciating.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is sort of an episodic 'Heavy Rain,' with some of the most strange, stiled dialogue and bizarre humor I've ever seen in a game. It certainly has an audience, I'm sure. However, for me, the strange dialogue, situations, and humor made it difficult for me to feel invested in the story. I suppose I've come to expect a heartfelt story with meaningful decisions from episodic games (Walking Dead, Life is Strange), to compensate for lack of in-depth gameplay in many titles of this nature.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend playing it as it is now since the plot goes to nowhere and it's true that the art is distinctive but other than that the whole game is not intriguing enough and feels incomplete even though it's a first season, i'll have to wait and see if they finish the whole series",
            "review_score": "-1"
        },
        {
            "review_text": "This game is beautiful, the style is intriguing and unique and the charcters are fascinating- however thats all the game really has.   It only has three short chapters, one being the tutorial and two being the storyline- each equalling only an hour or two give or take if your computer doesn't lag out during the quick times, the one mission long opening cutscene and three minute long end screen each chapter or during the overly long loading screens. The storyline is quirky and unstable, not explaining anything logically but instead relying on the fact that your character can now 'time travel'. Its very short, at the very most 5 hours of total 'gameplay' that leaves you with an idiotic To Be Continued screen. If you want to experience the game, just go to youtube and search it. It isn't worth the $15 it demands, and I sincerely hope that the dev's aren't going to be money grabs and make you pay $15 more dollars for Season 2 that includes 1 chapter and three hour long intros/cutscenes. This series isn't worth the trouble, and at this rate it'll be at the very least another year before the next two chapters arrive for $29.99.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't even start (many people have this problem) and there's no fix yet",
            "review_score": "-1"
        },
        {
            "review_text": "Perfect scenario, adorable grafics, japanese humour. This game is good as a video novel. Gameplay? Not delivered. AS IS NOT THE REST OF THE GAME YET.   Originally posted by  David Scammell :",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried to love this game it has a lot to love it for, but lack of freedom of movement and counter-immersive UI totally ruins it for me. I never in my lfe saw such a restricted monorail cinematic adventure gameplay. You cant move freely in this game, you only move between hotspots (each 5-10 meters) and rotate in 4 directions, this feels almost like turn-based board game. After this game, corridor shooters with invisible walls everywhere feels like open world games. And its really a shame that after open world almost simulator kind of experience in Deadly Premonition this is such a dumbed down game...   Wow and i thought that recent Telltale games like Walking Dead 2 with lot of talking and cutscenes and minimum of exploration and puzzles was restrictive, and thought that Dreamfall Chapters had nothing but borring walking and talking and Quantic Dreams games had nothing but QTE... man, after D4 all of these games feels like relief with endless freedom.  Seriosly, i love Swery games, but this one has really bad game design, worse than 1 button games from smarphones, it really needs patch for pc version with game design overhaul, that will allow unrestricted movement in entire area and free rotation in every direction.  Oh, and a PC port is not as terrible as DP was, but has bad things such as limited predefined list of resolutions that barely goes beyond 1280x720, has unskipable launcher that does not have gamepad controls (which makes full controller support a false, since it means that everything in game can be done with gamepad only, which is not, you have to use mouse every time you start the game), it lacking any form of AA and other advanced graphics settings, it has glitchy mirrors, and controls on gamepad and mouse are total disaster.  Will get refund now, and maybe i will buy this game again if will patched to allow moving and rotating freely in area. but now i cant stand this hotspot movement, its really frustrating and dissapointing.  C'mon Swery, get back to open worlds amd realistic lfe simulation expirience with total freedom! Make this game open for exploration! Just look at LIFE IS STANGE to see how it needs to be done!  P.S. - Another thing that annoys me in every swery game, are immersion breaking floating medal everywhere in game world and score based griding, this feels so arcadish and so unrealistic when medals float in world near everything. And the UI cluttering is always i problem in his games, i once solved this problem with my Immersive Premonition game, but this Unreal Engine 3 title is not that mod friendly and its harder to solve UI issues here, nearly impossible without full unrealed.",
            "review_score": "-1"
        },
        {
            "review_text": "The game start as a new promissing deal, nice design, amazing graphics, wonderfull game control, amazing characters, but after the prologue, one hour later I got pretty bored and my pal viewers too! I'm not gonna spoil when I got out of the game, I just only can say I won't ever recommend it.",
            "review_score": "-1"
        }
    ]
}