{
    "app_id": 358260,
    "name": "Crystal Caves",
    "release_date": "2014-05-05",
    "developer": [
        "3D Realms (Apogee Software)"
    ],
    "publisher": [
        "Apogee Software"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Classic",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 45,
    "negative_ratings": 12,
    "price": 3.99,
    "description": "Enter an underground world of treasures and traps in Crystal Caves, a colorful EGA game that rivals any commercial game with its arcade quality, puzzles and graphics. As Mylo Steamwitz, enter cave after cave of adventure, gathering teasures and evading countless hazards.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/358260/header.jpg?t=1478001597",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 or Windows 8 Processor: Intel Core Duo 2 Memory: 2 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Honestly if you are looking for a review here for this game i am so sorry for you.... how come you do not know this game?  Back in 1990s there was a freeware version of this game (DEMO) which i had on my computer. and i did not even know it is a DEMO because my english was so bad when i was 5-6 yearold. you know why? because that 'DEMO' took almost 1 week for me to play and finish it because it had FULL access to the first episode which is at least something around 40 levels maybe even more.  But i bet if this game was released now in 2015 the DEMO would cost $60 and then they were gonna charge you for $50 season pass to give you access to episode 2 and 3 as well.  About negative reviews of this game in store page: this game is incredibly brutal and hard and i can say to the date i have not seen any game which is as difficult as this, one small mistake and you need to restart the entire level no matter how much progress you have made. the true meaning of a puzzle platformer game is here! you need to destory + create paths. sometimes you even need to sacrifice a healthbar so that does not mean you can look at your healthbar as how many chances you have to dodge enemy attacks. so if you are a new generation kid such as the people who have rated down this game cause of its difficulity just ignore this page and go to 'Children On Duty' (aka COD) and buy that game and avoid this because here you need your brain.",
            "review_score": "1"
        },
        {
            "review_text": "A very well done platformer",
            "review_score": "1"
        },
        {
            "review_text": "This one also from the Apogee pack isn't too dated, I actually prefer it over the first episodes of Commander Keen. Plays a lot smoother than that series.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome. early 90's DOS gaming at it's finest. Of course, it comes with all the limitations of DOS games, so be warned, but the core of the game is solid. It's simple, straight forward, and fun. Only annoying part can be collecting all the crystals, sometimes gets tedius.",
            "review_score": "1"
        }
    ]
}