{
    "app_id": 358360,
    "name": "Raptor: Call of the Shadows (1994 Classic Edition)",
    "release_date": "2014-05-05",
    "developer": [
        "Cygnus Studios"
    ],
    "publisher": [
        "Apogee Software"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 71,
    "negative_ratings": 9,
    "price": 3.99,
    "description": "Become a mercenary of the future and pilot the super-tech Raptor. Embark on interplanetary missions to knock off top competitors of MegaCorp, battle against hordes of relentless enemies and spend the bounty to expand your devastating arsenal, which can be upgraded with 14 hardcore weapons!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/358360/header.jpg?t=1478001653",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 or Windows 8 Processor: Intel Core Duo 2 Memory: 2 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Likely among the best of the DOS-era top-down shooters bef, second only to Tyrian in my opinion. Has a fast pace, a career type mode where have to purchase upgrades. Not a absurdly long game by todays standards, but quite a solid title and a must play if you purchased the Anthology. Solid 256-color VGA graphics, digitized sounds (!), and a host of little touches make this game a joy to play and add depth.  Only downside, is this has no interaction with Steam or modernization at all which is a shame because achievements would have been an awesome modern touch.  It kicks me square in my childhood, speaking of which... My brother and I were so excited when we got this game back then, that we fought it out over who played first. My front tooth lost, and the parents were not all too amused.  Ahh, the memories.",
            "review_score": "1"
        },
        {
            "review_text": "I still remember my dad getting me this game on a floppy disk for $0.99. Ah the good old days! Dated gameplay sure but still fun even to this day!",
            "review_score": "1"
        },
        {
            "review_text": "Not bad for $1.25 but it's not as good as the '2010 Edition' offered elsewhere for $6 in my opinion. If you like Apogee, get the bundle; if you are interested in this game, get the '2010 Edition.' Not that I wish to 'advertise' contrary to the Rules and Guidelines but I feel that such a comparison is essential for an honest review.",
            "review_score": "1"
        },
        {
            "review_text": "I liked death animation.",
            "review_score": "1"
        },
        {
            "review_text": "Though I favor the 2010 version, it's incredibly fun to play the original DOS version. I love this game.",
            "review_score": "1"
        }
    ]
}