{
    "app_id": 358350,
    "name": "Secret Agent",
    "release_date": "2014-05-05",
    "developer": [
        "3D Realms (Apogee Software)"
    ],
    "publisher": [
        "3D Realms (Apogee Software)"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Platformer",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 7,
    "price": 3.99,
    "description": "You are agent 006 - top agent of the government's secret organization committed to protecting the world against terrorists and power-mad criminals. Your mission: to parachute into a high -security island outpost and secure the plans to the ultimate satellite laser weapon, which was recently stolen from the government.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/358350/header.jpg?t=1447371255",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7 or Windows 8 Processor: Intel Core Duo 2 Memory: 2 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have no idea how i finished this game when i was a kid, i keep failing the very first mission over and over again.... damn this new generation games took all my skills with their modern graphics  i had the freeware version of this game (AKA DEMO) it had FULL access to Episode 1 that i never thought it was actually a demo because it took me days to play and finish it and i had alot of fun with the game. but now a days you pay for a $60 game and the file size is something around 50+ GB it gives you access to %10 of content and rest is DLC and Microtransactions, this game costs less than a dollar (if bought in 3D Realm Package) and it gives you full access to all 3 episodes without an extra charge.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and challenging game. I found it hard and fun almost 25years ago and it still is. Lots of levels and it can be hard even with the simple gameplay (green key open green door; don`t jump on spikes; pick up items).   Enemies are kind of dumb and it`s weird when you shot them they go from spy to various medieval armor guys tho. Minus the nostalgia, it`s still fun to play. I would love a mordern version of this game, but I doubt it will come out.",
            "review_score": "1"
        }
    ]
}