{
    "app_id": 358610,
    "name": "Exowar",
    "release_date": "2015-03-23",
    "developer": [
        "Aleksander Ciesielski"
    ],
    "publisher": [
        "Neomex-Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 15,
    "negative_ratings": 59,
    "price": 4.99,
    "description": "Exowar is a 2D, top-down shooter, set in close future. As a cybernetically enhanced soldier you will have to face guards and aliens on your way to finding the truth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/358610/header.jpg?t=1447371285",
    "minimum_requirements": "OS: Windows XP or later Processor: 2.4 GHz Intel Core 2 Duo or better Memory: 1 GB RAM Graphics: OpenGL 2.0 compatible Storage: 54 MB available space",
    "recommended_requirements": "OS: Windows XP or later Processor: 2.8 GHz Intel Core 2 Duo or better Memory: 2 GB RAM Graphics: OpenGL 2.0 compatible Storage: 54 MB available space",
    "reviews": [
        {
            "review_text": "Not for the price listed... If you get (heavily) discounted or in a bundle, you might want to go for it if you enjoy top down shooter and missing some arcade classics like alien syndrome.   So why I am not recommending this game. Well, it still looks and feels like an early access game with almost no configuration of the videos, audios and game controller (My Xbox controller not being well recognized either straight from the bat). The gameplay could have been enhanced greatly in particular by setting the top down view a little bit higher which would have allowed a better enemy visibility and make the graphics look better.   Additionaly, the story (if story there is) looks confusing and unfininshed as you are fighting at the start gigantic spider, then humans, then back to spiders... (That's my take after 6 min of play and not going beyond level 1).   Hopefully there will be reworked in the pipeline from the developper for making this game something in the same vein than Alien Breed.",
            "review_score": "-1"
        }
    ]
}