{
    "app_id": 3590,
    "name": "Plants vs. Zombies GOTY Edition",
    "release_date": "2009-05-05",
    "developer": [
        "PopCap Games, Inc."
    ],
    "publisher": [
        "PopCap Games, Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Zombies",
        "Strategy"
    ],
    "achievements": 21,
    "positive_ratings": 14630,
    "negative_ratings": 454,
    "price": 4.25,
    "description": "Zombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3590/header.jpg?t=1447351772",
    "minimum_requirements": "OS: Windows XP/Vista/7                     Processor: 1.2GHz+ processor                     Memory: 1GB of RAM                     Graphics: 128MB of video memory, 16-bit or 32-bit color quality                     DirectX: DirectX 8 or later                     Hard Drive: 65+MB of free hard drive space                     Sound: DirectX-compatible sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "out of all the games this is the one",
            "review_score": "1"
        },
        {
            "review_text": "Good tower defense. It can be a challenge but with some cute humor. Worth the price you can get alot of hours in. It comes with minigames and zombie creator aswell. This was my first copy of the game ever, Never tried the demo or phone version.. So i dont really know the difference between goty edition and the original, But I highly recommend buying.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game. Quite possibly the best tower defense game I have every played. It has an awesome soundtrack, addicting gameplay and an overall cute charm. Casual game my ♥♥♥, this is a game for everyone (mostly) even with the somewhat basic feel.",
            "review_score": "1"
        },
        {
            "review_text": "I have never met anyone who doesn't love this game.  You need to buy this game.  If you do not buy this game then when the zombies come you will be doomed because you didn't know how to plant a peashooter on your lawn.  You will also need to color your grass to make a grid... Just sayin'  10/10 ready for them",
            "review_score": "1"
        },
        {
            "review_text": "Glad this came to Steam. Cute fun. TD with humor.",
            "review_score": "1"
        },
        {
            "review_text": "If you like zombies, get this game because you can find different types of zombies there. If you do not like zombies, get this game because you get to kill so many of em and name yourself zombie killer after you beat this game. If you are a zombie, you must get this game because you get to kill your comrades and be the zombie master. If you arent a zombie, then what are you waiting for? Get this game or wait for zombies to destroy your lawn.  This game is crazily fun; has a funny-talking npc and a awesome ending song. This game is not one of the 'killing zombies' and thats it game. It has more contents than you think it has. You get to grow your plants, collect coins from em and buy the items that are useful to go against the zombies. Moreover, it has puzzle levels which require high intelligence in order to get all of em completed.   10/10 will play through it again in the future  Note: This game is great to be played on iPads.",
            "review_score": "1"
        },
        {
            "review_text": "Love This Game!! Totally One of my Top Favs",
            "review_score": "1"
        },
        {
            "review_text": "This was a fun game. Made me think of the zombie apocalypse to come.",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Apocolypse at your house? Start a garden. Need to kill things? Start a garden. Need to eat home grown food? Can't help you there.  Pros: Plants killing ♥♥♥♥ing zombies Zombie Tim Tebow (Football Zombie) Zombie Michael Phelps (Swimming one) Kill Things, Get Money  Cons: Error: Cons not found. Plant like damage dealt to mainframe.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't intend to cover this game originally, but then I figured it was certainly a big enough name to justify, and also a good enough game to talk about. Before Plants VS Zombies was following in the footsteps of Team Fortress 2 and interrupting an indie developer with mood-destroying music at every E3, it started here, as a simple tower defense. This is a kind that's a bit less common on Steam, where you're defending rows rather than winding path. As the title implies, you do this using militaristic plants to combat a bunch of eccentric zombies.  Compared to a lot of the games I've talked about, Plants VS Zombies is a pretty casual one. Experience in many of the above titles would make the campaign fairly easy to get through, and even when I played it years ago without any TD experience I don't remember having much trouble. Of course, not every game needs to be hard, far from it, and there's something relaxing about watching your garden take on all comers. Both your plants and the zombies are also both appealing enough to look at without trying too hard, and there's a good amount of enemy variety.  You start with a simple Peashooter for damage and a Sunflower for harvesting resources (you do need to manually click on them like Beware Earth, but that's the only thing like it in the game and it's not generally very hectic), and across the course of the campaign get access to forty-seven others that all have some different use, depending on what zombies you're up against or the level. The game mixes things up often enough to keep things from getting too repetitive, and aside from the normal sunny day you'll also have to defend at night, where you get less resources, or at the backyard pool, where you have to build terrain for most of your plants to stand on. You'll also get levels within those that operate on different rules, such as using the Wallnut to bowl down zombies or having to pick your defenses from a sort of conveyor belt.  Aside from the campaign there are a bunch of minigames and alternate modes you can unlock, including survival and a role reversal where you pick zombies to go after the plants' defenses. Quite a lot considering the game's only five dollars, the cheapest of any game mentioned so far. If you're looking for a more low-key entry into tower defenses, it would be a good one to pick up, as long as you remember most other ones aren't exactly like this. Even if you're not new to them though, if you somehow haven't played this I can't think of any reason to dissuade you.",
            "review_score": "1"
        },
        {
            "review_text": "still one of the most addictive games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really Addicting alright,no wonder many people in the World really loved spending time in it. Its really fun to kill zombies with some styled various of Plants.   Great game I highly Reccommend it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A classic, sasitfying Tower Defense game. Might be easy, but It makes up for it by it's charm.  8.4/10",
            "review_score": "1"
        },
        {
            "review_text": "THERES A ZOMBIE ON MY LAWN.",
            "review_score": "1"
        },
        {
            "review_text": "If you want a game for casual games or something like this. It's the right investition!",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyable tower defense game. First played this back on the PC back in like 2009, enjoyed it a lot, eventually got it on my old Iphone 3 as an app.  +The graphics are nice and not scary for kids,  +the zombies attacks are creative, some are long ranged, some tough, some invite 'friends'  +theres tons of extra modes like shopping, and puzzle modes, mini games.  I don't think theres anything wrong with it in my opinion, it's a fairly long game too.",
            "review_score": "1"
        },
        {
            "review_text": "I love killing Vegetarians.  Because these zombies never touched my house for once.  Even this or that, quality game, part of my childhood, worth buying again.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games on Steam. A huge value for such a cheap game. The progression is nice and learning curve makes this game very beginner friendly but it's and very challenging in some of its last levels and mini-games. Great sense of humor, the best Popcap ever achieved. it's my Tower Defense ever. Forget the sequel, the original is where it's at.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fairly addictive tower defense game. You place plants to keep zombies from reaching your house. There is plenty of variations of plants/zombies/maps/game modes to add to the replay value. This is a great game to play in short bursts.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely addictive, yet incredibly fun tower-defense game. I love that PvZ is casual, but also requires strategy to send those zombies back to the grave. It's also quite amusing to see what new tricks the zombies have up their sleeves as you progress through each level. And Laura Shigihara's music fits perfectly with each section and time of day. This is truly one of the best games that I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Too scary.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever!!!! A must have. I could play this game for hours. You can kill zombies with pea plants. How cool is that!?",
            "review_score": "1"
        },
        {
            "review_text": "Plants vs. Zombies GOTY Edition - A must have for PC Gamers!",
            "review_score": "1"
        },
        {
            "review_text": "Super cheap. Super fun. Super game.   Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Buy it.... Great fun..",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun timer waster. :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun arcade game. Don't pay more for it on steam than you could on a tablet.",
            "review_score": "1"
        },
        {
            "review_text": "its plants vs zombies. its a nice easy, but not to easy, tower defense game. and there is tons of plants and mushrooms to plant and mushroom. 11/11 well memed ( ° ᴥ°) ᵂʰᵃᵗ  (",
            "review_score": "1"
        },
        {
            "review_text": "plants can shoot vegetables at undead now am hungri 10.01/10 would plant again",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Fun challenges and hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so, I have managed to put a few hours into this simple game now but my god, is it addictive. From batting off football zombies and protecting your lawn with ferocious plants to growing trees with Crazy Dave, it is a very fun game indeed and is great for filling in time. For me personally, I play it a lot whilst waiting for something else download and you find you can pass time so easily with it. The story mode is fun and many challenges will be faced there but you've got mini games and survival which will last forever if you allow it meaning you'll accumalate countless hours like me. It's a game worth buying.  Only one draw back is it's max resolution but apart from that, it's worth the money. Now go save your back yard before the zombies eat your BRAINS!",
            "review_score": "1"
        },
        {
            "review_text": "Just a total classic. This is one of those games that has so much replay value. I always found myself replaying levels and trying different plant combinations to see if it was possible to survive. I can't believe anyone doesn't already own this game. 5 out of 5 Matt faces and seal of approval.",
            "review_score": "1"
        },
        {
            "review_text": "Classic tower defense, expertly crafted, with plenty of challenges, upgrades and a healthy dose of silly humour.  - Skinny from the Fat B*stard  (curator link) ",
            "review_score": "1"
        },
        {
            "review_text": "I beat it 5+ times already when i was a little kid. Now i have the chance to beat it alot more",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "Plants Vs. Zombies is what reinstated my belief in casual gaming.",
            "review_score": "1"
        },
        {
            "review_text": "The best tower defense game I've ever played. A perfect combination of challenge, variety, and addiction. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Completed it...maybe 3 or 4 times now? Still never gets old. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! It has tons of content and is really funny.",
            "review_score": "1"
        },
        {
            "review_text": "What a great way to kill time while Fallout4 was downloading. This version hasn't been horribly molested by EA, like the mobile versions have.",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my life  9/10 it's okay",
            "review_score": "1"
        },
        {
            "review_text": "It's plants, and zombie, no reason not to like found ",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet deep tower defense game with plenty of replayability. Plus it has plants...and zombies. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Rating: 8/10  Really fun game to just pick up and play. It's very much like a standard Tower Defense game for kids, but only with lots of charm and variety. Gameplay is addictive that will assure you some hours of good entertainment.",
            "review_score": "1"
        },
        {
            "review_text": "guys because sweg we will make the music trailer the ending for the game",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the most exciting games I would ever play with zombies",
            "review_score": "1"
        },
        {
            "review_text": "My only nitpick is that the version isn't very good for pc. It's fine if you don't mind it being in a tiny window, or if you enjoy how an 600x800 game looks when blown up on a desktop monitor in the 21st century. But I only paid a buck for it, so no biggie. It's still fun.",
            "review_score": "1"
        },
        {
            "review_text": "The way to crush the Zombies is to grind them between the millstones of taxation and inflation.",
            "review_score": "1"
        },
        {
            "review_text": "Plants Vs. Zombies is what reinstated my belief in casual gaming.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant and easy tower defense game where you will defend you’re self against a massive horde of zombies, and where your only defense is mutated killer plants!  It’s a game that can be enjoyed by everyone of all ages from the youngst to oldest and will never feel boring to play do to the 50 levels in adventure mode that varies from day, night, and fog, in a swimming pool and on the rooftop. And trueout the game you will unlock a lot of different mini games and puzzles that really spices up the game, you even get to play as the zombies.  I highly recommend this game to anyone who wants to have fun, I have passed the 300 hours played mark and I’m still playing the game because it’s just as fun as when I bought it! :D  how ever, be aware of the fact that the company that made the game was bought from its original owners and is now owned by EA (which means that the game will never get any updates, it was supose to have gotten alot more content but the moment the old company was bought the staff was fired and every single content that was planned was scrapped)  It's still a good game though, and I highly recommend it, especially if you can get it on a hand held devices (they got a ton of content added)",
            "review_score": "1"
        },
        {
            "review_text": "This is what introduced me to Steam :) An amazing game with relative high re-playability. LOTS of fun! I let my preschooler play the earlier rounds :) and she enjoys it.",
            "review_score": "1"
        },
        {
            "review_text": "Well, there's a reason why everyone's heard of this game! It's incredible... Incredibly addictive.  The highest recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "Plants Vs. Zombies is what reinstated my belief in casual gaming.",
            "review_score": "1"
        },
        {
            "review_text": "I have only one thing to say about PVZ, its a must have, it is addicting, witty fun. Sure it sounds outrageous, how in the heck could plants take down the onslaught of the mindless freaks? How.....you need to play this game to find out, watch out for the Crazy Dave character, I never trust someone wearing a pot on his head or is later seen dancing with the zombies! Popcap truely has a very unique perspective to games and I really like that, I hope they get away from the Free 2 Play stuff they are putting out again, I have always thought that concept was a complete crash. Who wants to keep paying for a game. I like to pay my money up front! - P.S. Don't eatch the magic taco, you will pay for it! ;)",
            "review_score": "1"
        },
        {
            "review_text": "Good Overall Game Recommended :D",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "I have only one thing to say about PVZ, its a must have, it is addicting, witty fun. Sure it sounds outrageous, how in the heck could plants take down the onslaught of the mindless freaks? How.....you need to play this game to find out, watch out for the Crazy Dave character, I never trust someone wearing a pot on his head or is later seen dancing with the zombies! Popcap truely has a very unique perspective to games and I really like that, I hope they get away from the Free 2 Play stuff they are putting out again, I have always thought that concept was a complete crash. Who wants to keep paying for a game. I like to pay my money up front! - P.S. Don't eatch the magic taco, you will pay for it! ;)",
            "review_score": "1"
        },
        {
            "review_text": "Baby's first tower defense game. But it is pretty charming and addicting only like a Pop Cap title can be.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played PvZ on a tablet or phone, that's really only about half the game. The PC version has many more levels, different challenges, and many more mini-games.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game that still has so much potential. I know Popcap has struck gold again after playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game, great to pass the time. Can be addicting and does get more challenging as you go up in levels.",
            "review_score": "1"
        },
        {
            "review_text": "i own the ios and android and now steam version of this im dieing i will soon have no money but its ok because ill own this game on every platform",
            "review_score": "1"
        },
        {
            "review_text": "C'mon it's the best game of the last year so why you don't buy it? plants shooting zombies, brains, dancing zombies? is there anything better? A must have!!",
            "review_score": "1"
        },
        {
            "review_text": "5 dollars is an amazing price for this amazing game! this game has many different types of plants that you place in rows to kill zombies, most people have thier own stratagy of play. this is one of my favorite games i have!",
            "review_score": "1"
        },
        {
            "review_text": "The tall-nut replaces the wall-nut too quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Yay :D, great game with lots of variety and the zen garden just makes you zen :P... :).",
            "review_score": "1"
        },
        {
            "review_text": "The original and still the best, before Popcap sold out to EA and produced a tonne of godawful P2W spin-offs on Facebook and mobile.   This can always be returned to.",
            "review_score": "1"
        },
        {
            "review_text": "zombies are ♥♥♥♥♥♥♥♥ and they want ur wife",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the must-play classics",
            "review_score": "1"
        },
        {
            "review_text": "Now i know what to do if zombie apocalyps happend! tnx game",
            "review_score": "1"
        },
        {
            "review_text": "lots of fun + great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Shoot peas at zombies and make them lose their limbs.",
            "review_score": "1"
        },
        {
            "review_text": "Now i know what to do if zombie apocalyps happend! tnx game",
            "review_score": "1"
        },
        {
            "review_text": "Do you like tower defence games? Well this one is excellent. Nice little achievement section, mini games as a distraction, good humor, excellent design. If you are going to pick a defend your base type game this one should be it.",
            "review_score": "1"
        },
        {
            "review_text": "i bbought this game and i was especting a realistic game but wat i got was silly childeish nosence  avoid it if u only like realistic games,.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man, Plants vs. Zombies GOTYE, it blew my dang mind! When I saw a photo of it, I was like, 'That game looks odd.' Well, nowadays, I think this game is just so cool. The plants you can plant (especialy the gatling pea and cattail), the variety of zombies, heck, even the ACHIVEMENTS are cool. One of the thing I also have to like about this is the frickin' final boss music. It is so freaking awesome! Anyway, other than the adventure mode, there also is stuff like puzzles and even endless survival to keep you playing. One of the things I think the developer did so well on was the Zen Garden mode. The music is calm, and it can be fun growing the plants and collecting the money they give. Pretty much, for anyone who wants a good tower defense game, they should get Plants vs Zombies GOTYE. This game deserves a 10-10, and/or a 4.9-5 star rating, only because of the fact that the second time playing adventure mode, Crazy Dave will pick three plants that possibly would be useless. Still, this game is awesome. Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "Epic i love it so much i will beat all the levls {: ",
            "review_score": "1"
        },
        {
            "review_text": "Yo this game is the ♥♥♥♥  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The only game I play of popcap's 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Tower defense at it's finest. Plants vs Zombies is tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite tower defense game. Simple but with solid depth. Amazing music.",
            "review_score": "1"
        },
        {
            "review_text": "i really love this game :D",
            "review_score": "1"
        },
        {
            "review_text": "I'm just wasting my time, and I don't want to stop it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and replayable.",
            "review_score": "1"
        },
        {
            "review_text": "10/10. I'm vegan and I approve this game 👍",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing game yet it grows in challenge as you continue. The only kind of Zombies that I don't lose sleep over! ;)",
            "review_score": "1"
        },
        {
            "review_text": "Who doesn't want to kill Zombies with Plants!",
            "review_score": "1"
        },
        {
            "review_text": "Fun waste of time!",
            "review_score": "1"
        },
        {
            "review_text": "ITS SO FREAKING FUN IM GONNA BLAST ALL THE ZOMBIES HEADS OFF YAYA OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "review_score": "1"
        },
        {
            "review_text": "BRAINZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ get this game it's awesome",
            "review_score": "1"
        },
        {
            "review_text": "Popcap always makes great games. 10/10 would recommend to anyone and everyone",
            "review_score": "1"
        },
        {
            "review_text": "whooo",
            "review_score": "1"
        },
        {
            "review_text": "Deceptively simple and yet very fun. Better on a tablet but certainly worth getting on Steam if you don't have one. Game play consists of picking your available arsenal of plants, lining up on the grid and fending off rows of zombies with different characteristics. Has a delightfully humorous story, great art style and easy to learn, difficult to master mechanics. Also includes challenge maps and achievements which are always fun to play around with afterward. Well worth the cost: 4.5/5",
            "review_score": "1"
        },
        {
            "review_text": "Buy it, play it and you have fun ... FOREVER!!!!!!!!! ...Brains...   ",
            "review_score": "1"
        },
        {
            "review_text": "This game deserves the title 'Game Of The Year'. It is a killer of a time watser. Sometimes I found myself going overtime while waiting for a multiplayer game to load! But for the price it has online and IOS it is definatley worth the money you pay for it. 100 out of 10 from me!",
            "review_score": "1"
        },
        {
            "review_text": "good fun time wasting zombies and plants what more do you need? besides your brain, that is",
            "review_score": "1"
        },
        {
            "review_text": "Very adictive",
            "review_score": "1"
        },
        {
            "review_text": "The zombies are cute and the game itself is absurdly fun.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Great casual game to own. Two thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "It's the Jerry Seinfeld of tower defense games. Still an actor, but changes up the formula to add a nice twist to it.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game!!! you make plants that kill zombies!!!  PLANTS THAT KILL ZOMBIES  PLANTS KILL ZOMBIES  PLANTS ZOMBIES  [GJNsw[efuoqhnfrw[ifhj",
            "review_score": "1"
        },
        {
            "review_text": "My favorite 'casual' game that is not an RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Plants versus zombies, a big memory from my childhood. This game is such a classic. It's fun, has catchy music, and it's addicting. This version on Steam is TOTALLY worth the price (5 bucks) and I would REALLY recommend this game. Go buy it, it's a real time killer. Also, if you're on a laptop, you can play it during car trips. xD",
            "review_score": "1"
        },
        {
            "review_text": "Silly Tower-Defense very original. Can't think of another game where you defend your house with plants.",
            "review_score": "1"
        },
        {
            "review_text": "This game is insanely addictive, you can finish it in about 1 - 2 days, but during that time it is a ton of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Great fun killing all zombies.",
            "review_score": "1"
        },
        {
            "review_text": "Plants vs. Zombies--the game title really says it all. This is tower defense made both simple and fun. Just another great way to satisfy your zombie killing fix.",
            "review_score": "1"
        },
        {
            "review_text": "Easily summed up by one word; fun. Also great for short games, you can easily do a game in under 10 minutes. But if you want to spend a full night, I did pass one or 2 while finishing the storyline. And while it's generally not too difficult, some annoying zombies (dolphins, diggers, jumping zombies stealing plants) really need to have you pay attention and adopt appropriate strategies.",
            "review_score": "1"
        },
        {
            "review_text": "My daughter bought me this on sale. She never saw me again......  10/10. Simply put, buy it and buy it now",
            "review_score": "1"
        },
        {
            "review_text": "So now I have tasted of zombie blood and brains. It's OK, but 87 on Metacritic?? Pah!",
            "review_score": "1"
        },
        {
            "review_text": "The classic! Get ready to plant plants and mow the lawn because its covered in zombies!  8/10, End game is kinda crap.",
            "review_score": "1"
        },
        {
            "review_text": "Outstandingly replayable and awesome game - get the Smart Phone version too - it's all brilliant...",
            "review_score": "1"
        },
        {
            "review_text": "Nothing special but it's sooooooooooooo freakin' addicting! xD",
            "review_score": "1"
        },
        {
            "review_text": "★★★★★★★★★☆ 9/10 this game is a gem of casual games on steam =] there is no any InAppPurchases or DLC - just plants and zombies in full GameOfTheYearEdition. I like come back to this title - with some nostalgia because i used to play on it on smartphone few years ago.",
            "review_score": "1"
        },
        {
            "review_text": "this game is good if you have spare time you need to fill.  but give it a few levels as the firsrt few are awful",
            "review_score": "1"
        },
        {
            "review_text": "Years ago, I broke my mom's laptop *before i even had steam* because I wanted to be a little hacker boy. I was young at the time so..",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun and a lovely art style. I think it is the only casual game that I'm addicted to.",
            "review_score": "1"
        },
        {
            "review_text": "its not a awsome game but it does not have any cons.",
            "review_score": "1"
        },
        {
            "review_text": "game of all time",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Never get tired of playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Plans vs Zombies is an extremely polished strategy game. Whereby you have to defend your garden from zombies, with an asortment of Plants.  The graphics are visually impressive, going for a cartoon style that matches the pace and casual attitude towards this game.  Overall a fanastic game that I highly recomend.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game for one reason                                                                            Why do you scroll down just get it already!                                                                                                          The reason is its plants vs zombies",
            "review_score": "1"
        },
        {
            "review_text": "This is the first tower defense game I actually enjoyed playing. Zombies are invading your yard so what do you do? Plant a garden and let the plants fight back! It's a great concept and well executed, with great graphics and sound. There are lots of game modes to play and will keep you busy while you destroy all the zombies.  There's also a New Game+ mode while is actually fleshed out unlike a lot of games. Higher difficulty, more enemies, everything it should be. Must kill more zombies! Play this game! Do it now!",
            "review_score": "1"
        },
        {
            "review_text": "If you don't own this game... get it. It is the single best tower defense game to date.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, replayable, nice levels, a lot of fun for only a few bucks. Must have!",
            "review_score": "1"
        },
        {
            "review_text": "A good time waster. Plus there are Zombies!",
            "review_score": "1"
        },
        {
            "review_text": "More fun than it looks, and strangely addictive.",
            "review_score": "1"
        },
        {
            "review_text": "This is really fun game! It is easy to understand and play. The plants are well balanced in their abilities I just hope there are some more stages and more freedom on the difficulties",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and funny tower defense game. Highly addictive!",
            "review_score": "1"
        },
        {
            "review_text": "A fun little strategy game about a bunch of plants fighting zombies... I think one used to play football. :P",
            "review_score": "1"
        },
        {
            "review_text": "WHAT SEPARATES THIS VERSION FROM THE REST YOU ASK?! well..., it's the game of the year edition of course! therefore granting you bragging rights over your inferior associates who've only experienced the mediocre edition",
            "review_score": "1"
        },
        {
            "review_text": "If you don't have this by now, then you are probably a Commie. :)",
            "review_score": "1"
        },
        {
            "review_text": "There's a zombie on your lawn. THERE'S A ZOMBIE ON YOUR LAWN. There's a ZOMBIE on your LAWN... we don't want zombies on the lawn. ¬_¬",
            "review_score": "1"
        },
        {
            "review_text": "Great waste of time :D",
            "review_score": "1"
        },
        {
            "review_text": "I RECCOMEND THIS GAME TO ALL YOU PEOPLE ON MY BUDDY LIST BECAUSE WELL.... U KILL FREAKIN ZOMBIES ON YOUR LAWN WITH DIFFERENT TYPES OF PLANTS?! AND CUZ I WANT TO BE ENTERED IN THE STEAM TREASURE HUNT :).",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and addictive game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is almost endlessly entertaining and slightly addicting. I'm on the second playthrough and it's entirely different from the first time. Extras like puzzles and mini-games are just as good as the main adventure mode.  Defend your lawn!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty damn awesome. I'd go as far as to say this is popcap's best game.",
            "review_score": "1"
        },
        {
            "review_text": "I like the original game much better than the pay to play PVZ 2.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. From the easy game play to the fun plant vs. zombies song. Me and my son have enjoyed playing this version and the one on the tablet. Keep the good games comin.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Stratagy Game,Definatly worth 2.49",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't gotten this game yet. GET IT NOW. It's super addictive and funny.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like everyone is doing reiterations and parodies of PvZ, but there's still no comparison to the genuine article. Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Love playing it. :)",
            "review_score": "1"
        },
        {
            "review_text": "Love PvsZ! Have played it repeatedly even. Great for kids and still amusing for adults.",
            "review_score": "1"
        },
        {
            "review_text": "You can never have enough Winter Melons and Cat Tails. Remeber that.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Super fun and will always have something to do",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game and i have compleated it on other consoles. It is just so addicting :D",
            "review_score": "1"
        },
        {
            "review_text": "Extremely addictive stuff... XD",
            "review_score": "1"
        },
        {
            "review_text": "A Classic. You MUST get this.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining. Call me a babby casual for liking this game if you like, but I am unafraid to say I enjoyed it. Worth it if you can get it for about tree-fity in a steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone likes PvZ, right? It's perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive and fun.",
            "review_score": "1"
        },
        {
            "review_text": "I've finished this game so many times I've lost count. I finally bought it for Steam because it has achievements - how pathetic is that? Still, the game itself really is tower defense perfection. Challenging, funny, and always interesting. Probably the best part of the game is unlocking all of the additional minigames and the Zen gardens, it gives lots of incentive to complete all the main game levels but then still keeps you entertained long afterward. Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and addictive: best $4.99 I ever spent on a game. I played the HELL out of this.",
            "review_score": "1"
        },
        {
            "review_text": "Great as the iOs version does!",
            "review_score": "1"
        },
        {
            "review_text": "After watch too much dark scenes of Left 4 Dead, this colorful game is relaxing",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun! :)",
            "review_score": "1"
        },
        {
            "review_text": "Plants with faces. You're high.",
            "review_score": "1"
        },
        {
            "review_text": "A simple concept that is mind-bogglingly fun and addictive. THE tower defense game to beat all others. Anytime I only have a few minutes to play, I get on my PC or tablet and work out a strategy to keep those hungry zombies from my plants and ultimately my brains. With the addition of entertainingly varied minigames in the GOTY edition, PvZ manages to keep me entertained despite having finished adventure mode many, many times. Adorably cartoony graphics and a soundtrack with a multitude of earworm-y tunes add to the joy of playing. One of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone likes PvZ, right? It's perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Despite its somewhat high price, Plants vs Zombies delivers many hours of fun strategy and miscellaneous minigames and shouldn't be ignored by anyone searching for an addictive experience.",
            "review_score": "1"
        },
        {
            "review_text": "I hate Towere Defense games, and there are people who say this is one of these. If this is true, then the other Tower Defense games are terrible, and this game is clearly the best.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense game around. Really fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Tower Defense games I've played. If you're a fan of TD games, you really need to play this one.  Though I probably liked Defense Grid: The Awakening better, this game is probably my 2nd favorite TD game. Really funny and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good i beat the game and it was fun but the boss in the finle level was easy that may need some work ",
            "review_score": "1"
        },
        {
            "review_text": "It's entertaining and can be a challenge, but it's mostly funny! =)",
            "review_score": "1"
        },
        {
            "review_text": "60%",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mix of tower defence and strategy. You plant plants (pardon the pun) in your yard to stop a horde of oncoming cartoon zombies. It's by PopCap and if you've never heard of them they make really good casual games. I recommend you check their other games.",
            "review_score": "1"
        },
        {
            "review_text": "Plants vs. Zombies was, is and always will be an instant classic. If you're searching around for a great tower defense game, look no further than Plants vs. Zombies. Not only is it immensely fun and addictive, but it's also funny at times! The main adventure is tons of fun, the mini-games are enjoyable, and the shop that provides unlockables is just an added bonus. Most definitely a great recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the game that got me addicted to tower defence games.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty damn awesome. I'd go as far as to say this is popcap's best game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. I'm not a huge fan of tower defense game but this one is simply amazing. Give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "all i have to say is, its an awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "Insanely addictive and fun. Beat it countless times and played it countless hours before getting it on Steam. Definitely one of my all time favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "Zombie on your lawn.",
            "review_score": "1"
        },
        {
            "review_text": "It is an addictive game but other then that after a while it doesn get kind of boring.",
            "review_score": "1"
        },
        {
            "review_text": "this is not a bad game, my son enjoys playing it and likes crazy Dave! got it in the summer sale for £2.49 so couldn't go wrong for that price",
            "review_score": "1"
        },
        {
            "review_text": "The closest feeling to being a farmer in Idaho",
            "review_score": "1"
        },
        {
            "review_text": "So simple, so awesome. Direly needs a sequel!!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, and hoping for a PC sequel.",
            "review_score": "1"
        },
        {
            "review_text": "A game that needs no introductions, it has pretty much single handedly created a cult following for itself. At only 25mbs, you will be amazed how much entertainment and replay value there is in this game. Honestly one of the best TDs I've played.",
            "review_score": "1"
        },
        {
            "review_text": "A thouroghly enjoyable game, easy to play casually, and visually pleasing.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Lots of clicking.",
            "review_score": "1"
        },
        {
            "review_text": "Funny, relaxing, entertaining. Definitely recoment it to any tower war fans.",
            "review_score": "1"
        },
        {
            "review_text": "a lot more fun than i thought it would be. i never played it on the ipad so this was completely new to me",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Great for the casual gamer too.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. From the easy game play to the fun plant vs. zombies song. Me and my son have enjoyed playing this version and the one on the tablet. Keep the good games comin.",
            "review_score": "1"
        },
        {
            "review_text": "It's a modern classic better on your PC than your smart phone. Although, it'd be nice I could control the resolution. Get it when it's cheap.",
            "review_score": "1"
        },
        {
            "review_text": "ｎｉｃｅ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when it had first came out upon the Nintendo DS and fell in love with it right away! I was very pleased that when I took up Steam again, that I could get it upon here as well! It's a great way to pass the time and it's a great little tower defense like game. There are also mini games, puzzle mode, and a survival mode! How long can you last?! *giggles* Being able to create your own little zen garden is great! Let's not forget that you can even design your own Zombie that will even appear INGAME as you are playing through the levels. I highly reccomend this.",
            "review_score": "1"
        },
        {
            "review_text": "I was first introduced to this game via a 'let's play'. I knew just from those videos that I would enjoy this game. I then got a hold of this game and I was not mistaken in my judgement. A puzzle game which, for the most part, is simple but allows for multiple combinations of plants. Do you go for quick plants or heavy bruisers, the choice was yours. Also, one of the few games that I delved a bit into the extra content. Need a time killer, a heavily recommended game.",
            "review_score": "1"
        },
        {
            "review_text": "great time killer when you have 5-10 mins to kill for each level!",
            "review_score": "1"
        },
        {
            "review_text": "You play as some sort of magical wizard gardener or something who uses sentient plants to defend your wizard brains against hordes of the undead who shuffle single-file through your front yard.   The plants and zombies take on many forms, from your standard ambling corpse to pole-vaulting zombies to zombies riding on zombie dolphins in your pool. The plants do everything from produce sunlight (the source of your magic powers) to shoot flaming peas at your decomposing foes.  It's a fun point and clicky game with a very nice difficulty curve. New plants and zombies are introduced on a regular basis to keep things fresh but never in an overwhelming fashion.  It's definitely the best plant-based zombie-defense wizard game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, cheap and addictive fun!  Some comedic value too! It also has a progressive challenge that towards the mid to later levels, the game gets quite challenging.  They also managed to add an amazing amount of variety in gameplay in what otherwise is normally a repetitive genre!  All in all a good buy, I am most pleased with it!  A definite recommended title from Neon Anderson! (lol)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever.  Cons: Earlier versions runned fine on windows 7. Bought steam GOTY Edition and I get 1 FPS lags during animations.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is the crack of the gameing world i just keep coming back to play it. It's a fun and charming game with its art style and game play making it fun for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun tower defense game that is amazing on any computer and is fun on trips.    ITS AMAZING!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun! I remember in about 2009 (when this game was released) I was in Florida and my older cousins were playing this on their computer. I think they said something like 'Hey Jaden! Look!'. I decided to buy this when I got a bit bored of playing another hit Pop cap title, Bejeweled, and boy was that a great decision. An absolute buy if you like to have addictive fun!  EDIT: If you want the best experience, don't play in fullscreen. It's very blurry as it is 4:3. Still enjoyable in windowed mode!",
            "review_score": "1"
        },
        {
            "review_text": "Alot of fun, but you will lose several hours :)",
            "review_score": "1"
        },
        {
            "review_text": "Their..comin'",
            "review_score": "1"
        },
        {
            "review_text": "A scarily addictive game. Don't get it if you need to get to sleep tonight.",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defense game. Working on the achievements to really complete the game.",
            "review_score": "1"
        },
        {
            "review_text": "great classic",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap, this game is brutally amazing, I wish I got it a long time ago!",
            "review_score": "1"
        },
        {
            "review_text": "Before you buy!  &gt; There is a new version of this game only in the phone or Ipad &gt; Still, this game is very fun and enjoyable &gt; I've played like 2000000 hours on my other computer &gt; Even my mom liked this game &gt; This game is for people who like zombie games but they do not like very graphical ones &gt; It is even for kids! 10/10 would smash zombie heads again",
            "review_score": "1"
        },
        {
            "review_text": "fun for hours",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game at all. The game starts simple but grows to be challenging once you try tackling those 'Endless' modes. I don't know if I'd call it GOTY, though...(when ever that was).",
            "review_score": "1"
        },
        {
            "review_text": "Love Plants? Hate Zombies? This game is for you!!!",
            "review_score": "1"
        },
        {
            "review_text": "Too much plant. zombies ded. RIP. 10/Sunflower always a go back to game. ",
            "review_score": "1"
        },
        {
            "review_text": "A masterclass in progression and addictive gameplay - just look at your friends hours of gameplay if you want proof! Buy this game... if you have the time!",
            "review_score": "1"
        },
        {
            "review_text": "Is there really any need to describe such epicness? Flowers destroying zombies? Implement that in real life and the zombie apocolypse should be easy as pie.",
            "review_score": "1"
        },
        {
            "review_text": "Bringing photosynthetic justice to the undead horde, what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "My childhood. Le memories ;-;",
            "review_score": "1"
        },
        {
            "review_text": "  TL;DR: Cute and funny, casual tower defense game which is pleasant for many ages.",
            "review_score": "1"
        },
        {
            "review_text": "'There's a zombie on our lawn...'  'There's a zombie on our lawn...'  'We don't want zombies on our lawn...'  Good time killer!   8/10",
            "review_score": "1"
        },
        {
            "review_text": "What type of game about plants doesnt have trees? You make playing games hard for dendrophiliacs. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tower defense games out there. Simple to learn, but with plenty of depth and replay value. Very fun and addicting.",
            "review_score": "1"
        },
        {
            "review_text": "A stupidly cute time killer with clever pawns and enemies. Pretty straightforward and easy to pick up and put down. Great for those 5 minutes in between doing things. Also great for procrastinating with.",
            "review_score": "1"
        },
        {
            "review_text": "I just love this game :D",
            "review_score": "1"
        },
        {
            "review_text": "(WHEN YOUR DONE WITH THIS GAME, USE CHEAT ENGINE FOR FREE SUNS, IT'S FUN)  this game is really good, it's sad because theres no 2nd version for PC. which sucks. but honestly. GREAT GAME, WORTH THE MONEY!!",
            "review_score": "1"
        },
        {
            "review_text": "If you like tower defense games then this game is a must buy its so addicting and fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "FunFunFun!! You have to play it with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "A must play. Cheap and worth every... well, whatever currency they're asking.",
            "review_score": "1"
        },
        {
            "review_text": "it's like i was a kid all over again",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much. This game is the best tower defends for me.",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "lots of fun..by far the best of strategy games, can't wait for part 2",
            "review_score": "1"
        },
        {
            "review_text": "excellent time filler that could do with a level editor",
            "review_score": "1"
        },
        {
            "review_text": "its awesome     and HECK YEAH I RECOMEND DIS",
            "review_score": "1"
        },
        {
            "review_text": "Whether you're a new fan to the zombie craze, a veteran undead-lover, or love gardening in general, you won't be disappointed with this great time-killer of a game. And once you do, you'll see why this is one of the indie greats!",
            "review_score": "1"
        },
        {
            "review_text": "I've loved Plants vs. Zombies for years now and although the game gets repetitive, it never fails to come up with new ways to change things up and entertain me! Completing PvZ is possible only a third of what the game has to offer. Once you've played the whole story mode through once, there is so much more you can do, for example; Minigames, Endless Survival, Upgrading, Tree Of Wisdom just to name a few and of course a garden would not be complete without the defined range of Crazy Dave's Twiddydinkies either.   After completing the story mode once, there is still opportunity to go back to complete those achievements you couldn't quite get or missed the first time round by playing it again. The replay value of this game is great as it offers new rewards for completing levels and waves to the play and as you can see, I've spent hours playing myself getting hooked to the occasional game every now and then.  Personally, I highly recommend this game if you're into fast paced strategy games although that is what this game is mostly limited to. With the cool editional features to the Game Of The Year Edition for example the Zombie Creator and new achievements to get stuck into, it really is worth some extra cash if you feel you would enjoy the game enough to play through at least once. Sadly it does lack some cool features that come with the Xbox 360 edition but overall, a solid game! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the most fun I've ever had playing a game on my iPod. Filled all those zombies with peas, butter, cabbage, and whatever else the designers came up with for me to throw at them. Found it was on Steam. Guess what? It's even better here. The definitive Plant/Zombie experience. Accept no substitutes.",
            "review_score": "1"
        },
        {
            "review_text": "I've beaten this game way too many times. Probably one of my favorite strategy games, and easily my favorite from Popcap. Deceptively simple, and way too addicting.",
            "review_score": "1"
        },
        {
            "review_text": "Love Plants? Hate Zombies? This game is for you!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!  Buy it before the zombies eat your brains!",
            "review_score": "1"
        },
        {
            "review_text": "Their..comin'",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely brilliant game, fun, replayable, and can get quite challenging! I would recommend it for pretty much any age.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to play, not so easy to master. You'll lose hours playing the mini-games and puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not entirely sure why this game is as good as it is, but everything just works.  The adorable plants, the hilarious zombies, the awesome music, all of the aesthetics come together to make for an incredibly bright and cheery game.  The gameplay of PvZ is a fairly basic tower defense game. There's definitely some depth to be had, but it's not anywhere near the level of other tower defense and strategy games.   And that's fine. The game's simplicity and low barrier to entry makes for a fast and still fun experience that even a veteran tower defense fan will enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "I may be late to the game for this review, but I've been a fan of 'Plants vs. Zombies' for years (having played it on my cellphone and tablet). I picked it up on Steam because, honestly, $4.99 for a GOTY edition is well worth it. The game is a tower defense game, in which you use plants to defend your home from zombies (hence the title of the game). As you play, you unlock new plants to use, as well as mini-games (which I highly recommend the bowling mini-game as soon as you unlock it to rack up some easy money). Speaking of money, you use it to buy various upgrades, such as more seed slots (you pick what plants you use before you start each stage), or upgraded plants themselves. The mix of defensive and offensive plants you get is great, and overall, the game is just fun to play. If you haven't gotten it on PC yet, or simply have yet to try it (which there is a demo on Steam available to try before you buy), I highly recommend picking it up.",
            "review_score": "1"
        },
        {
            "review_text": "The best $5 I ever spent. This game keeps you occupied with humor, great music, and waves and waves of zombies. It rewards you for playing well, Think about the choices you are given. Make the right choice and all will fall easily into place. If not the plants will fall to the chaos of the brain eating zombies and slowly creep into your house. You are rewarded over time with little game scenarios like Being the zombies and planing out your attack against the plants. Also little things like the Garden makes it nice to come back just to water your plants, see them grow and they reward you as well.",
            "review_score": "1"
        },
        {
            "review_text": "Everything must be...symetrical...",
            "review_score": "1"
        },
        {
            "review_text": "It's fun y0 :P hahaha start the flameing now I'm sure ",
            "review_score": "1"
        },
        {
            "review_text": "another normal day in your house, your neigbour seems a bit weird with that pot on his head.  whats that coming accross the road? zombies?! your only defence are plants?! this just gets more and more weird but who said weird isent fun.  this is tradional tower defence style, plant your defences each with strengths and weaknesses and defeat the zombies each with their own strengths and weaknesses.  use your brain lest you risk having it eaten by the zombies.  its simple, its easy on the eyes and its supprisingly fun for its simplicity, something to pick up and play on the side and easy to get into quickly.  theres something fun about taking down zombies with peashooters.  good luck and have fun, now if you dont mind i need to plant fresh shooters on my lawn, they are back again",
            "review_score": "1"
        },
        {
            "review_text": "Recommended for casual gaming when you want another option after playing all your games, also when you want to play something reltively quick and is kinda entretaining.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, absolutely brilliant. Playing the Xbox version for plenty of hours and grabbing my hands on the PC version I can definitely say that the PC version actually suffers with it's resolution not fully supporting 1920x1080 monitors, where this is literally the only down side of the game I can find.",
            "review_score": "1"
        },
        {
            "review_text": "My first impression of the game was 'another silly game for kids'. But the moment I started it I knew I was wrong. I had a blast playing this game. The main 'plot' is not that short itself but apart from that the game has to offer additional challenges, mini games and puzzles which can be a nice change.  I recomend this game for anybody who needs a break from multiplayer cooperation and simply wants to relax.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun all around. The funniest thing is that this game is what you can call 'zombie fun for the whole family.' The light-hearted spin on fighting off the zombie apocalypse, combined with the fun and practically never-ending gameplay makes this well worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, a must play! I recommend it to all of you that want to have lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed every second of the game!  The final battle was epic!!!  1.Amazing Soundtracks 2.gameplay. 3.beautiful graphics. 4.Mini Games to unlock. 5.lot of cards plants + You can buy more!! 6.grow plants. 7.simple game with lot of Stuff. And more ..  Really one of the best Indie Games. 10/10 Masterpiece  ",
            "review_score": "1"
        },
        {
            "review_text": "How come this game was missing from my endorsed list? Well I was too busy playing it? :P This simple crazy fun tower defense game has you put plants on your lawn, pool and roof to keep zombies from eating your brain. Have fun with a multitude of minigames after you finish the campaign and enjoy watering plants in your zen garden. Brainilicious!",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of my favorite games ever. Super cute and always entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "ERROR using reading file..says this before i can even start to play plants vrs. zombies on this computer and my laptop...on apple computer laptop, can play, but says this when trying to go to garden so can not visit garden .. not very happy..thank you",
            "review_score": "1"
        },
        {
            "review_text": "Heroin in form of video game",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun and addictive. My granddaughter showed me this one and I can't stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "A game very simple, but very much faun! I recommend for everybody! A fantastic game. It is so good that ends quickly!",
            "review_score": "1"
        },
        {
            "review_text": "I now understand why Valve decided to promote this game through Team Fortress 2. It's just so good! Especially the music.",
            "review_score": "1"
        },
        {
            "review_text": "Don t judge the game by it looks, this accessible RTS is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Previously owned this game on a disc, before i got a steam and probably put 30-50 hours on it then. Still, fun even after I already beat the entire thing. I RECOMMEND THIS GAME!!!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game. Just sayin. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Attack herp derp zombies with frozen peas and bad puns. So casual you'll think you're in your underwear! Enjoy it cus' you only need a mouse to play!",
            "review_score": "1"
        },
        {
            "review_text": "I kinda hate this game because I love it so much - and I hate loving these industry-killing casual games. Well, at least this one doesn't have any micro-transactions in it and it's not on Facebook. In the end, it's just another tower defense game, but with charming ideas and art-design and very motivating game mechanics that you'll always want to do 'just one more level'.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "[Solution] How to make the game look like fullscreen ? ( Without black parts on right and left side ) Hello There Just after you get inside the game click the Options ( The Vase near Quit ) Then De-Select ( Disable) 3D Acceleration. Thats all ! :)  PS: This WONT change the resolution , on the other hand it will fix the black parts of screen. PS2: If you still see those annoying parts and Just Leave the game and 1- Right Click on your desktop 2- Graphics Properities ( or if you didn't disable intel shortcuts Just press CTRL ALT F12 ) 3- Change resolution to 800x600 ( Click yes i want this resolution ) 4- In same screen select Scaling as Scale Full Screen , Save it 5- Close it 6- From Window's resolution dialog change the resolution back to your real resolution. 7-Thats all :) ( Don't forget to close 3d Acceleration inside game (in option vase ) )  I hope i could help your problem a bit Have a nice game",
            "review_score": "1"
        },
        {
            "review_text": "All I have to say is: Bobsled Zombies.",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually play turret defense games, but when I do, I play Plants vs Zombies.",
            "review_score": "1"
        },
        {
            "review_text": "Wasn't expecting this game to be what it is, it is amazingly addicting, perfectly paced, and has such a well made twist on Tower Defenses (TD)s.",
            "review_score": "1"
        },
        {
            "review_text": "I go through games left and right, but this is one title I always come back to. Best $5 ever spent on a pc game",
            "review_score": "1"
        },
        {
            "review_text": "^.^!",
            "review_score": "1"
        },
        {
            "review_text": "This is a timeless classic for all ages! With 50 Adventure levels, 20 Minigames, Survival, and Puzzle modes! And even Zen Gardens! If your on the fence of getting this, Let me say buy it now! It has my Pea of Approval! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was first introduced to this game via a 'let's play'. I knew just from those videos that I would enjoy this game. I then got a hold of this game and I was not mistaken in my judgement. A puzzle game which, for the most part, is simple but allows for multiple combinations of plants. Do you go for quick plants or heavy bruisers, the choice was yours. Also, one of the few games that I delved a bit into the extra content. Need a time killer, a heavily recommended game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game! There is something about platns owning zombies that is so addictive. Another great game from PopCap! I recommend this to pretty much everyone :D",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to the new model for Plants vs. Zombies 2, I have no problems in saying that this is the best PvZ game that there ever will be.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game Relaxing To Play Great Grafics Gotta Get this Game!!",
            "review_score": "1"
        },
        {
            "review_text": "A delightful little 'tower defense' style game with a cute nature/undead theme.   Use a wide variety of sentient plants to establish a, shall we say, 'guard-en' to defend your home from waves of brain-hungry zombies.   Boasting surprisingly deep gameplay and a great sense of humor, PvZ is surely worth your green.  ",
            "review_score": "1"
        },
        {
            "review_text": "Plants and Zombies have never been in a better game. SPUDOW! Them, or SQUASH them, the Zombies stand no chance when you build your garden right.",
            "review_score": "1"
        },
        {
            "review_text": "A very simple TD game, but everything just falls into place. Great concept and execution.",
            "review_score": "1"
        },
        {
            "review_text": "it is a good becaues it slow grt harder and harder but it does not get harder to fash and the zen it have is cool to me",
            "review_score": "1"
        },
        {
            "review_text": "Its has plants AND zombies! What more could you ask for!",
            "review_score": "1"
        },
        {
            "review_text": "Fun tower defense with lots of character. Worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a fan of tower-defense games, but this game is really fantastic. As the title say, you put plants to defend your house against zombies. Rounds are always different and you always have to have different tactics, otherwise zombies ''will eat your brains'' (quote from the game, hehe). Music during fights is also excellent and never gets annoying. I really recommend this game for anyone who wants to take a rest of blood because this game is NOT ''just another tower-defense game''.",
            "review_score": "1"
        },
        {
            "review_text": "This game was by far the funnest tower defense game I have ever played. I can't wait for PvZ 2 to come to PC!",
            "review_score": "1"
        },
        {
            "review_text": "Lawn of the Dead. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Got game. Best game. Only Game. Every Game. I ♥♥♥♥ dogs. 10/10 would ♥♥♥♥ again.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing and unbelievably addictive and enjoyable puzzle game that I have got over 80 hours out of! Outstanding for its price! :D Amazing game",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and addictive: best $4.99 I ever spent on a game. I played the HELL out of this.",
            "review_score": "1"
        },
        {
            "review_text": "Great way to kill zombies and waste time. You can even get your own zen garden! And a 100 feet tall tree! What are you waiting for, GET IT :D",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game but intended for your phone. Get it there for a nominal price if not free.",
            "review_score": "1"
        },
        {
            "review_text": "Plants vs Zombies is a game which I think needs no introductions. It’s best of the best tower defenses you could ever find. It’s a bit light on the story but it makes up with all kind of funny looking zombies. The game is very colorful in a cartoonish way. Some achievements are farm-fests but other than that this is as good as it gets when you talk about tower defense. This game is suited for lighting up your mood. The score I give this game is in comparison to other games I reviewed because in its own genre it’s a definite 10 out of 10 but objectively speaking it’s a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "What else can I say about this game that hasn't already been said? It's an innovative tower defense game that focuses more on time management than strategy. Slow players beware: if you can't keep up with the hordes of zombies invading your yard, roof or pool then you're finished. I thought that it would be too difficult for my taste but the learning curve is just right. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for everybody. I love it. My wife loves it. My kids love it. My kids will yell 'ZOMBIEEEEES!' whenever we play it. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "A game you can pick up and play in minutes, useful for the odd few moments when you're unsure of what to play or have 5 mins and don't want to get stuck into something bigger. Plants Vs Zombies is a gun twist on a tower defense game and features you literally growing plants on your lawn, swimming pool and rooftop to stop the zombies from eating your brains.  The game is quite replayable, the first run through has several stages and keeps the gameplay interesting by adding hazards such as fog, mini-games like bowling &amp; slots and even some puzzle modes to keep all audiences interested. 2x play throughs of the adventure mode are required to see everything and you can replay the mini games &amp; puzzles at will once they're unlocked.  For the score setters, the game features survival modes &amp; even an endless mode just to see how many waves you can last.  There's also a 'Zen Garden' where you grow plants without figting zombies and can have several gardens and a tree of wisdom, providing tips and codes to modify the games visuals.  The game looks a little dated due to the developers sticking with a 4:3 resolution and maximised on a 1920 x 1080 screen this can look a little pixelated - that doesn't impact the gameplay and even adds some charm to the game itself.  If you're looking for a casual game that will keep you interested over a long period of time and isn't overly difficult in the process, pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "This sets the graphic standard by running at 100 FRAMES PER ♥♥♥♥ING SECOND",
            "review_score": "1"
        },
        {
            "review_text": "maby the most addictive game ever made",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best 'small' quick game in the world. Really fun to play when you have limited time, and still want ot have some fun :)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best tower defense games ever!",
            "review_score": "1"
        },
        {
            "review_text": "Great game to burn some minutes up each day",
            "review_score": "1"
        },
        {
            "review_text": "Great game. My go-to game for when I have just a little time to kill.",
            "review_score": "1"
        },
        {
            "review_text": "A stupidly cute time killer with clever pawns and enemies. Pretty straightforward and easy to pick up and put down. Great for those 5 minutes in between doing things. Also great for procrastinating with.",
            "review_score": "1"
        },
        {
            "review_text": "Delightfully addictive! :)",
            "review_score": "1"
        },
        {
            "review_text": "A masterclass in progression and addictive gameplay - just look at your friends hours of gameplay if you want proof! Buy this game... if you have the time!",
            "review_score": "1"
        },
        {
            "review_text": "i accidentally bought this GAY game while i had ♥♥♥♥♥ clouding my vision because i'm a ♥♥♥♥♥♥ ♥♥♥♥♥ but like two years later i got tf2 hats because of it so it's ok",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly very fun and addicting. Huge amount of content for what seems to be a small inde mini-game. Try out the demo and you'll be hooked.",
            "review_score": "1"
        },
        {
            "review_text": "Play It It makez Brainz Mure Gud Play now - Sighed BucketHead Zombie(ps:Vasebreaker Iz Bak in PvZ 2 Make Brain moor Gud)",
            "review_score": "1"
        },
        {
            "review_text": "It was fun",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining. Call me a babby casual for liking this game if you like, but I am unafraid to say I enjoyed it. Worth it if you can get it for about tree-fity in a steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not proud of how many hours I've spent playing this game...",
            "review_score": "1"
        },
        {
            "review_text": "Better than the movie",
            "review_score": "1"
        },
        {
            "review_text": "There is no better or more joyful exhibit of the tower defense genre. The campaign does an excellent job of educating players whilst providing plenty of replay value for more seasoned players. The only downside to the PC version is the complete lack of ongoing developer support, whilst the mobile and console versions continue to get sizable updates and multiplayer. Nevertheless, it's still a classic that'll have your synapses friring on all cylinders and your endorphins popping like candy. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "So you're used with sitting in your house huh? Well how about a little gardening while sitting in your house  PvZ is the best game for people with too much free time that have flowers with faces. Did you see that Sunflower chick? I swear she wants to ♥♥♥♥.  Anyway, PvZ is one of the best Zombie Survival/Tower Shooters. Why? Because I say so, what are you, stupid?   So what do you do in PvZ you ask? You sit on your fat ♥♥♥ and do absolutely nothing while some plants outside decide to wreck the ♥♥♥♥ out of the oblvious zombies that totally don't afraid of peas, cabbages or watermelons. They could use some fried chicken though.  Zombies have plans for you so they even send you letters. I don't know how they manage to deliver the message but that's beside the point. In the letter you won't find any jokes at all and you will get a SERIOUS warning about the incoming Zombie ♥♥♥♥♥torm that's about to strike your house. Once you get far enough in the game it REALLY is a ♥♥♥♥♥torm.   SO GET THIS",
            "review_score": "1"
        },
        {
            "review_text": "Zombies and gardening, one of my fav hobbies and one of my least. Perfect combo",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played this game, you probably hate videogames and yourself. ",
            "review_score": "1"
        },
        {
            "review_text": "The game that started a trend. Great fun for short bursts.",
            "review_score": "1"
        },
        {
            "review_text": "This Tower Defense is so fun! Low system requirements. I mean, COM'ON! It's planets vs zombies, why don't you own this game yet?",
            "review_score": "1"
        },
        {
            "review_text": "Heroin in form of video game",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and addictive game :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a great tower defense game. There's nothing about zombie limbs falling off that should make you avoid this. Tons of different plants and zombies to choose from, if only this was a multiplayer game. It also has this great song at the end. Fun Fact: Brains are made of fat and makes for good cholesterol in your diet.",
            "review_score": "1"
        },
        {
            "review_text": "It's difficult to take seriously because it's Plants Vs. Zombies, but it's probably the best tower defense game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The game is purely addictive. Every level offers some new challenge. Between the mini games, the levels, and the Zen garden, you will be entertained for hours!",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent tower defence type game. No adds and no 'pay to win' style upgrades. You can legitimately earn everything in game which is the way to have it in my opinion. I have 94 hours in this game so far and will add more here and there as I revisit this game often. ",
            "review_score": "1"
        },
        {
            "review_text": "If you love plants and hate zombies (and also like an incredibly fun defense game), then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "ThaiGR APPROVED!",
            "review_score": "1"
        },
        {
            "review_text": "Funny, relaxing, entertaining. Definitely recoment it to any tower war fans.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle/action games in recent years!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun if you're bored and on a sub-par PC.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I've ever played. Very easy to pick up and surprisingly addicting. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "A defense strategy game like no other. Yes its cute but fun as heck.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "killing zombies with plants?! yes! , cool minigames, awesome stuff. love it 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "So I Never played this game even when it originally launched knew nothing about it. Then i took a gamble just today the day before Halloween and bought it for under $3. It was worth the Purchase!",
            "review_score": "1"
        },
        {
            "review_text": "Bright coloured, funny and gripping game with zombies. What else do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Like things that are fun? Or silly? Or undead? Like shooting at all of them? Good news! This addictive game has all this and a giant talking tree!  92% - Super dee duper",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, simple but somehow challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Really addicting and fun, also the concept is hilarious, well worth the mola.",
            "review_score": "1"
        },
        {
            "review_text": "Very realistic zombie apocalyse game. Learn how to plant, manage your golds and the use of right tools. Very wow!",
            "review_score": "1"
        },
        {
            "review_text": "love this game! Lots of fun. It has many achievments to work for . It has some never ending puzzles and challenges so you dont run out of things to do. It is a go at your own pace game. Animated zombies not gruesome but cute so it would be good for even younger kids . It has multiple assortment of day, night, rooftop levels that keep you interesed for as long as you want to keep playing . Even has a zen garden and plant collections when you want to chill out and just mess around with the plants- at almost 100 hours it is still fun to play when I just want to play a quick fun strategy game .",
            "review_score": "1"
        },
        {
            "review_text": "BUYER BEWARE:  This game is so soul suckingly fun that you will, more than likely, finds yourself losing all concept of time... and probably space!  Honestly, if you haven’t heard of this game, (and/or played it…), get yo’ shiiiiit together boy-eeeeeeeee! And prepare yourself for body atrophying fun! ",
            "review_score": "1"
        },
        {
            "review_text": "It's a shame they removed the 'Thriller' dancing zombies in the update to the GOTY edition (replacing it with 70's disco zombies), but it's still a pretty fun game.",
            "review_score": "1"
        },
        {
            "review_text": "The closest feeling to being a farmer in Idaho",
            "review_score": "1"
        },
        {
            "review_text": "Its coool",
            "review_score": "1"
        },
        {
            "review_text": "Tons of game here for 10 bucks, and a very original theme/art style to boot. If you've lived under a rock for the last 10 years, this is worth buying. Otherwise you already own it.",
            "review_score": "1"
        },
        {
            "review_text": "I gifted this game to my mother and she played 29 hours in 4 days",
            "review_score": "1"
        },
        {
            "review_text": "It's difficult to take seriously because it's Plants Vs. Zombies, but it's probably the best tower defense game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little tower game. Plants Vs. Zombies has some solid gameplay and comedic elements that makes it worth your while.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best stratedgy games of all time. It keeps yu on your heels to see what new zombies and plants you will find. Plus it has amazing minigames. I have played this game on every system and I love it every time I play it. Eveb if you beat in you still have a great garden to take care of plus extra plants to buy so you can make your zombie expecine even better. Also the end of the game is the best part, it will make you want to beat it again just so you can see it.",
            "review_score": "1"
        },
        {
            "review_text": "First review.  Plants vs. Zombies is a fun and addictive game aimed more towards the casual gamer. The graphics are quite cutsie and cartoony which I found enjoyable. The gameplay consists of clicking here and there to gather resources in way of sun to earn enough to plant more well... plants to fend off a zombie onslaught. There are many different types of plants to choose from to counter specific types of zombies. While at first I thought the game would get very repetitive, I soon learned that the different types of boards, plants and zombies kept each level feeling fairly fresh.  In conclusion, this was a simple game that provided hours of cheap entertainment. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "The zombies in this game knows how to write, drive vehicles, ride animals and they also can build a gigantic robot. Just to destroy your garden of Peashooters and Nuts that can be placed as walls.   10/10 Will have a zombie on my lawn again.",
            "review_score": "1"
        },
        {
            "review_text": "The importance of garden design has never been quite as life or death as this!  Dr Edgar George Zomboss is sending his hordes of loyal zombie followers at your house, with only one thing on their mind - yours! Your only line of defense is to put your planting skills to use and allow your flower friends to take out the undead trash! They attack day and night, and from all approaches (including on the roof and down the chimney!), so be prepared to mix and match your plants to make sure you don't lose your head!  A simple but effective tower defense game with a lot of thought and humour put into it. (Shame that PopCap got bought out by the overlord$ at EA...) Certainly a good addition to anyone's games library.",
            "review_score": "1"
        },
        {
            "review_text": "of course a super slow huge pea can decapitate a zombie why not  my calculations proved that a pea delivers 0,4 N force, and force needed to break a bone is about 12000 N... i wonder how do they break a zombie's neck  i still love it  10/10 zombies ate my brains",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like this game, I need you to get a life, real quick, for $4.99, got it?",
            "review_score": "1"
        },
        {
            "review_text": "Not on Origin   10/10",
            "review_score": "1"
        },
        {
            "review_text": "what a legend game XD",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! So addictive. I feel like I've finally gotten out of it's grasp and then it pulls me back in. It's a new staple.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good",
            "review_score": "1"
        },
        {
            "review_text": "A good old classic that doesn't require me to pay extra for content that should all ready be included! Definitely the best of the series!",
            "review_score": "1"
        },
        {
            "review_text": "Plants vs. Zombies purely tower defense. And it does it so well.  This is the kind of game that once you start, you won't let go of it till it's finished. For every few minutes of gameplay something new and excited is added, something you definelly want to try it out. And it keeps coming. Tons of fun. ",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the £1.74 price!",
            "review_score": "1"
        },
        {
            "review_text": "Get green thumb, question if police force has been destroyed by zombies, plant weed and mushrooms, no cops yet, good game.",
            "review_score": "1"
        },
        {
            "review_text": "It's like 'The Walking Dead' with plants!",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should play this game ^^",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best and very very addicting!!!",
            "review_score": "1"
        },
        {
            "review_text": "is fun",
            "review_score": "1"
        },
        {
            "review_text": "A tower defence game with a difference. Everythings better with Zombies! I recommend this one as its an engrossing game that keeps me coming back for more. Brainzzzzzzzzzzzzzzzz",
            "review_score": "1"
        },
        {
            "review_text": "It's like Skyrim but with gardening.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to kill time :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is still easily one of my favorites, love it.",
            "review_score": "1"
        },
        {
            "review_text": "Do yourself a favor and play this one insted of PvZ 2. It is so much better in all aspects.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I've played this game from beginning to end about 5 times already. Now that I have it on Steam, of course, I'm doing it again for the Steam Achievements.  This is one of my essential casual games and it probably will be for quite a while. Seriously 10/10. Seriously.  My only disappointment was that they changed the Michael Jackson Zombie to the Disco Zombie.  Another game I loved by Popcap was Insaniquarium. A little less to do than Plants Vs Zombies, but just as much fun with the silly humour.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to kill time :)",
            "review_score": "1"
        },
        {
            "review_text": "Plants vs zombies... Where to begin? At first i had gotten it for my mobile and it seems like my mobile processes the game better than it does on my laptop. at first it went well and it might be because i havnt played the game in a few months, I'm not sure exactly but one thing is certain. and that is that this game can use a serious update for my computer, im just asking for a little better optimization. It just seems glitchy sometimes. :( and makes my computer run billions of code in less than what it has time for, makes me loose battery, and cause my fan to run miles. Thank you, Cincerily - Tartntainte",
            "review_score": "1"
        },
        {
            "review_text": "**14 Hours as of this review**   Years ago, I used to play a Nintendo DS Lite. Plants vs. Zombies was the best game I have ever played. Years passed, and I moved on to Nintendo 3DS, Xbox 360, and now PC (plan to stay here, lol.) Here I am today, and I picked up Plants vs. Zombies Game of the Year Edition for $2.49 in a Steam sale. Many memories were retained and experienced again. Disregarding those memories, this game proved itself to be a very great game, not the best I have played anymore, due to my wide array of game knowledge, but it does hold a title of awesomeness. Its is very funny, and very fun as well.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, fun and addicting.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games from my childhood that I can finally play again since the ios one doesn't work well anymore. It's great to have it back",
            "review_score": "1"
        },
        {
            "review_text": "A tower defence game with a difference. Everythings better with Zombies! I recommend this one as its an engrossing game that keeps me coming back for more. Brainzzzzzzzzzzzzzzzz",
            "review_score": "1"
        },
        {
            "review_text": "It's PvZ man. It's a nice time killer with little thinking required to play. The only thing this game is missing is more content updates. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "is a funny game buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addictive game",
            "review_score": "1"
        },
        {
            "review_text": "Very simple, yet super fun game. I would recommend this to anyone of any age.",
            "review_score": "1"
        },
        {
            "review_text": "A must have game if you are into tower defense games, I play a lot more on the mobile version my score: 5/5 must have",
            "review_score": "1"
        },
        {
            "review_text": "i say Buy it iyts awesomely fun and addictive one worth buying if you like games like tower dence or such u'll love this game so BUY IT PLAY IT BEAT IT!!",
            "review_score": "1"
        },
        {
            "review_text": "I've owned this game for years. I go back to it from time to time and it remains enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play when you just need something simple to kill time.",
            "review_score": "1"
        },
        {
            "review_text": "yes but can not load game",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly addictive. Not terribly challenging, but it has a goofy sense of humour that makes it entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "This tower defense game is really great. It is not really hard, but it is very addictive. When it is on sale for like 5 euros, get it, it is wel worth it!",
            "review_score": "1"
        },
        {
            "review_text": "this is good game, recomended for buy this is game.",
            "review_score": "1"
        },
        {
            "review_text": "Addiction in vegetable form!",
            "review_score": "1"
        },
        {
            "review_text": "There are no snakes in this game, but it is good regardless.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun! Much better than your average castle defence. Its the cute characters and humour that make it.",
            "review_score": "1"
        },
        {
            "review_text": "I played it for a few levels and then went on to other games. I put it on for my girlfiend to entertain her while i did other things, and she sunk 24 hours into it.",
            "review_score": "1"
        },
        {
            "review_text": "A classic 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Who said the gardening is not fun? In real life maybe it's boring, not here.  The best tower defense game I've ever played. If you like fighting zombies and see them exploiting, being eaten, or falling in pieces, buy this game. Protect your lawn!",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and silly.",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop playing...SOMEBODY HELP ME!",
            "review_score": "1"
        },
        {
            "review_text": "Great fun! Much better than your average castle defence. Its the cute characters and humour that make it.",
            "review_score": "1"
        },
        {
            "review_text": "I used to have this game on disk for an older computer and now that I have found it on Steam I bought it right away. I love playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Its fun and challenging",
            "review_score": "1"
        },
        {
            "review_text": "If you are a casual player who finds casual tower defense games too hard to master and you enjoy zombies accompanied with quirky sense of humour, then this game is definitly suited for you.  It took ToD concept, where you defend your house against hordes of funny drawn zombies with 'special' abilites. Since it gets quite repetetive and it's not too challenging developers added few additional game-modes &amp; mini-games which extend the gameplay time for a few hours. Also the soundtrack is worth mentioning as it creates good zombie-apocalypse atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "played this game into the dirt. worth every penny. highly addicting. great for kids!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game for allo age players. My mother loves this game and cant stop playing it ^^ very addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Intense and fun lots of content for a point and click.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defense game. Working on the achievements to really complete the game.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the Year  That about sums it up right there",
            "review_score": "1"
        },
        {
            "review_text": "DONT BUY THIS GAME!!! IT DOES NOT WORK!!! I just bought this game. I click to play and it goes to a black screen then quits. NO GAME! I tried to contact steam, but it doesn't work either!!! WTF???",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth every penny. Good 'casual' tower defense. The caveat here is that once you're done you're going to crave more. Do not give in and try Plants vs. Zombies 2. It will disappoint you.",
            "review_score": "1"
        },
        {
            "review_text": "BUY THIS EXTRA SEED SLOT FOR $20,000,000  I'M  CRAAAAAZY   This is, yes, a 'casual' tower defense game. It's also quite fun, with charming graphics and humor, and actually somewhat challenging in the later stages. You'll certainly have a lot of options and playstyles to choose from by then, at least.  In PvZ, the dead have risen and they're coming for your brains. Luckily, you seem to have stolen several decades' worth of experimental plant seeds from the US government, which you must now use to defend your home from the undead menace. This is not actually the plot, but it's my headcanon.  You must collect sun that drops from the sky (when it's daytime, that is) and from sun-generating plants. Sun is used to place your plants in various areas around your rather upscale home. The plants range from Peashooters to LSoH-esque Chompers to Potato Mines; you have a lot of ways to destroy the zeds. And you're going to need them, because these are apparently Romero-type zombies that know how to do stuff like bounce on pogo sticks, ride dolphins and whatever they can do to crush your organic defenses. (They sport Left 4 Dead-like mutations as well, but I'm getting ahead of myself.)  The game is easy to pick up, but it'll throw some curveballs your way from time to time. Various additional modes and features are unlocked as you progress through the campaign for the first time, which is neat.  I suppose a description of this game in a nutshell would be 'simple and fun, but not  too  simple, and pretty well-designed to boot'. It's probably a minor classic by this point. At the very least, it doesn't have microtransactions like its sequel.",
            "review_score": "1"
        },
        {
            "review_text": "could kill a zombie with a plant 9.9/10 ign to many plants",
            "review_score": "1"
        },
        {
            "review_text": "2D nice game. there are much MUCH plants that you can choose to play and such good gameplay and/or features. survival - a nice feature, pretty easy maps. mini games - finish them. now it's a nice game with way too much plants and zombies. every plant has its own ability (also applied to zombies). i recommend this game. its funky and cool. (i dont know the definition of funky i just like the word) buy it.",
            "review_score": "1"
        },
        {
            "review_text": "With Steam package version: 1454621000, they fixed the problem in Steam that broke this game.  When they previously broke the fullscreen mode, it required you to go into RegEdit (registery editor) and modify a value, to make the game start in Windowed Mode (there is no config.ini you can edit instead).  Thanks Steam for correcting the bug that was created with the previous update.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome. Addictive for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how many times (or on how many devices) I finished this game in my life. But still every year at least once I download it again and complete it. It's not that good on 10th finish, but endless modes still keep you entertained.",
            "review_score": "1"
        },
        {
            "review_text": "hello is pvz 2 coming out here soon? im realy waiting i have it on phone but i see on here it must be better so please upload it",
            "review_score": "1"
        },
        {
            "review_text": "Love it very fun Plants vs Zombies 2 is good to its on mobile",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game and provides a damn good challenge. Very addictive even after you've finished it a couple of times! I would recommend to anyone. Buy it, play it, eat brains or sunshine! Or both! Mwahaha! :D",
            "review_score": "1"
        },
        {
            "review_text": "great game one of the best in the series. keeps it simple while gradually increasing its difficulty in a relaxing way. easy to play more than once.",
            "review_score": "1"
        },
        {
            "review_text": "There is a reason why this game was the game of the year.   (It may seem like I have not much playtime is because I've played it on my phone 100%)",
            "review_score": "1"
        },
        {
            "review_text": "(Not much time on record, but probably 30 hours outside of Steam)  THis is a good casual tower defense game. Realy cute, good music, and enjoyable game play: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Just funny. Everytime.",
            "review_score": "1"
        },
        {
            "review_text": "the final boss throw minivans!  now that's just hilarious.....shame you couldn't play as doctor edgar zomboss",
            "review_score": "1"
        },
        {
            "review_text": "Nice, calm and fun game. Great for relaxing after a stressful match of competitive or if some random ♥♥♥ fag ♥♥♥♥♥♥ you off. Music is great, game is short but sweet (6 hours of gameplay), and has a lot of extra minigames to keep you playing even after you beat it. Its worth getting for such a small price.",
            "review_score": "1"
        },
        {
            "review_text": "Often in gaming, it's more about the intuition of the right mechanics, rather than extemporay intricacies about storylines, cutscenes and exposition in general. PvZ GOTY is just that: a wonderfully crafted game combined with a great intuition that arrived just at the right time. Now let me play just for 5 more minutes...",
            "review_score": "1"
        },
        {
            "review_text": "I have purchased this game multiple times on multiple platforms. It's as addicting now as it was when it first came out. Definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Still awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, play it.",
            "review_score": "1"
        },
        {
            "review_text": "I just don't understand how this can still be so much fun.. But is is.",
            "review_score": "1"
        },
        {
            "review_text": "Good value for the price, Countless hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Always come back to this game - fun fast and repeatable!",
            "review_score": "1"
        },
        {
            "review_text": "Has MUCH more to do than the original, and it's only five bucks! I seriously recommend this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Recommended for startig games if you're new to steam. Ilove it",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little time waster. Not much to do after you beat it, but its fun enough that revisiting it is still a good time.",
            "review_score": "1"
        },
        {
            "review_text": "What can be more fun than trying to protect your own house from zombie invasion using only plants? Sunflovers, Cherries, Mushrooms, Cactuses, Garlics, Melons and more! You name it, they all there! Om nom nom nom!",
            "review_score": "1"
        },
        {
            "review_text": "  Great game to bypass time. Fun and really challenging on some parts.",
            "review_score": "1"
        },
        {
            "review_text": "Best game to play when you're bored and need to pass the time. Amusing as heck. Strategy challenging. Can't go wrong with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Completed",
            "review_score": "1"
        },
        {
            "review_text": "Addictive, but not that difficult.",
            "review_score": "1"
        },
        {
            "review_text": "Just pure addiction!",
            "review_score": "1"
        },
        {
            "review_text": "Defend your shins!",
            "review_score": "1"
        },
        {
            "review_text": "This game is nicc and fess wate",
            "review_score": "1"
        },
        {
            "review_text": "Old games, old memories; to my young years to pay tribute.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to kill time on.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, pretty replayable - a lot of levels, with plenty of neat mini- games for different modes of play. Also good for killing undead without the grime or gore normally associated.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game to have in your library. It's one of those games you can play while you're laying in your bed and chilling. 10/10 would plantvzombie again.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun tower defense game with a lot of content!",
            "review_score": "1"
        },
        {
            "review_text": "Still a great game to revisit and, so far, the only game I've gotten non-gamer friends hooked on playing.",
            "review_score": "1"
        },
        {
            "review_text": "That song is so ♥♥♥♥ing catchy.",
            "review_score": "1"
        },
        {
            "review_text": "Every time i try playing it doest turn back on ive tried everything to fix it but it doest work.worst game of the year rate 0/8 bad job m8",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy this game it does not work",
            "review_score": "-1"
        },
        {
            "review_text": "(Will change recommendation if problem is fixed.)  So, for starters, I'll begin with the fact that this game is ... frankly awesome. The atmosphere is very enjoyable. +The Music is catchy +The levels start you off easy to get you used to the simple mechanics. Progressively getting more and more difficult. +In the same context of the previous positive, the levels also change as the game progresses. (Less aisles to place defenses. Day / Night. Fog. Square blockers [Places you can't put defense plants] Front yard, back yard, roof, pool etc. +Plethora of various plants you can choose from, level to level. [Same context, plenty of various zombies as well. That also get more challenging in their abilities or 'tricks' you have to deal with] +Handful of mini-games to change the pace, when you're tired of this games equivelent of a story mode.  Honestly, aside from the main reason I'm not recommending this game, I can think of very few negative aspects of game. Which is namely the fact that I can't actually play the game for extended periods of time. Which I believe is more a personal aspect, as opposed to anything wrong with the game. As matches get harder, I find myself playing one or two levels and then giving it a break, and playing a different game.  However, the extremely sad, and utterly heart breaking fact is that all of the above positives don't matter in the slightest, because you can't play the game. At all. Period. A recent update and it simply broke. You see the logo for Pop Games, and then you get a black screen. Nothing can be done except alt-tabbing out and closing, or alt-cntrl-dlt and closing the program that way. Such a huge let down. And it still hasn't been fixed, almost a month out (at the time of this review.) Yes ... I waited almost a full month, giving them the benefit of the doubt that they were fixing this. As stated, this review might very well change, and quickly, assuming they fix this problem. What a huge waste of time, energy, and money as of this moment.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like I wasted my money, because the game doesn't work now. Great, I was looking forward to playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "How can i play this game on my Laptop with 1366x768 (16:9 or 16:10 ) ??? Somebody help me !",
            "review_score": "-1"
        },
        {
            "review_text": "If your screen is bigger than a Nintendo DS, don't bother. Resolution is hardcoded into the game at 640x480, revolting at larger screens.",
            "review_score": "-1"
        },
        {
            "review_text": "great game. this is a bad port. ♥♥♥♥ graphics. blurry.",
            "review_score": "-1"
        },
        {
            "review_text": "Plants vs. Zombies is amusing but ultimately suffers from two things:  &gt;It is essentially an online flash game a.k.a. you should not spend money on this  and more importantly,  &gt;It's boring.  It isn't a hard game at all. The real challenge is sitting down to play it and preventing your brain from turning to sludge.  Don't waste your time or money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Well I do really enjoy plants vs zombies a lot. Its one of my favorite games of all time. The main reason why I'm giving it a thumbs for me at least is because of the recent errors and unplayability of this game. For me and what I've searched though many people are having the same issue where they can't launch the game because of errors. While many people claim to have fixed the issue I on the otherhand have not been able to play this game. I don't warn people away from purchasing this game i advise you not to purchase this as it is unplayable and you would wind up buying a game thats unplayable. Again I'm not saying it's a bad game Im saying that because in it's current state it cannot be played so just be advise that when you get you will just be gettng an error.",
            "review_score": "-1"
        },
        {
            "review_text": "While Plants vs. Zombies is a really fun time-waster, I can't say I thoroughly enjoyed it to the end. The achievements rapidly become grindy, and gameplay is almost exactly the same from level to level. Though the developers attempt to offset this by introducing new mechanics, the forced second playthrough of the campaign and seemingly pointless records you must reach to complete the game really put a damper on the fun I got out of it. If it's exceedingly cheap (as it usually is), I might suggest you pick it up just for a casual break in between real games, but overall, I wouldn't buy this unless it's dirt cheap.  If that was all I had to say, I might consider recommending this game. However, the Mac version of it is exceedingly poor. I typically play on my PC, but when I tried it out on my girlfriend's MacBook Pro, the amount of glitches and crashes were simply astronomical. The game would crash roughly every ten or fifteen minutes, and gameplay would sometimes lag to hell and back. I did, however, sell a plant in my Zen Garden for $1,240,996 (they typically go for about $60-$300), so I got that goin' for me, which is nice. A glitch that works CRAZY much in my favor, however, is still a glitch. I would stay away from this if you plan to use it on a Mac.",
            "review_score": "-1"
        },
        {
            "review_text": "IF you've played this game already and wanted to play again,Dont play again, after a while playing the game i got bored so I would not recommend this game for ppl who already played.",
            "review_score": "-1"
        },
        {
            "review_text": "DONT BUY THIS!!   great,addictive,fun game but THE FULL VERSION IS FREE BY POP CAP ",
            "review_score": "-1"
        },
        {
            "review_text": "ITS CRASHEZ HO MADE THIS GAME PLEASE CONTACT ME!!!!!!!!!!!!NOWWWWWWWWWWWWWW",
            "review_score": "-1"
        },
        {
            "review_text": "Good on the phone, terrible on the pc",
            "review_score": "-1"
        },
        {
            "review_text": "If you love to play this game, you will never ever be able to find a girl friend. :)",
            "review_score": "-1"
        },
        {
            "review_text": "ALOT OF LAGS AND HAS THE SH*TTEIS QUALITY BUT BUY THIS GAME !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! XD",
            "review_score": "-1"
        },
        {
            "review_text": "I think it's already abandoned by the Dev",
            "review_score": "-1"
        }
    ]
}