{
    "app_id": 359220,
    "name": "MX vs. ATV Unleashed",
    "release_date": "2015-04-16",
    "developer": [
        "Rainbow Studios"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Includes level editor"
    ],
    "genres": [
        "Racing",
        "Simulation"
    ],
    "tags": [
        "Racing",
        "Motocross",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 181,
    "negative_ratings": 88,
    "price": 8.99,
    "description": "Take on the racing world in an attempt to knock off motocross and ATV riders in over 50 technical supercross and rugged outdoor tracks.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359220/header.jpg?t=1533041069",
    "minimum_requirements": "OS: Windows 2000 / XP / Vista / 7 / 8 32 or 64 bit Processor: 1.2Ghz Pentium III or equivalent AMD Athlon XP processor Memory: 512 MB RAM Graphics: GeForce 2 – ATI 7500 or better with at least 64 MB of Video RAM DirectX: Version 9.0c Storage: 1500 MB available space Sound Card: DirectX compatible card Additional Notes: The game does not feature Internet Multiplayer any more!",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 32 or 64 bit Processor: 2.4 GHz Intel Pentium 4 or equivalent Memory: 512 MB RAM Graphics: nVidia GeForce 3 or ATI Radeon 8500 or equivalent with 64 MB of Video RAM DirectX: Version 9.0c Storage: 1500 MB available space Sound Card: DirectX compatible card Additional Notes: The game does not feature Internet Multiplayer any more!",
    "reviews": [
        {
            "review_text": "ATTENTENTION EVERYONE WHOS INTERESTED IN BUYING THIS GAME! Do NOT listen to |Cherry|, there is nothing wrong with this game. I bought it a week ago on Win 8.1 64 Bit with Nvidia gpu and it works absolutely flawlessly. If it doesnt work, its your computer, not the game. But great nostalgic game, 11/10!",
            "review_score": "1"
        },
        {
            "review_text": "Its Finally made itself on Steam :) I used to play this when it first came out in 2006 on the the xbox and i loved it :). I had seen it on pc heaps of times and wanted to buy but i was never allowed to get until now its on Steam :) This games graphics are still fairly decent for a 2006 game but this game is great and runs really smooth on my computer which is great. There plenty mods to make the came better to Just type this website link in your browser and youll be able to find plenty of mods :).  www.mcmfactory.com ",
            "review_score": "1"
        },
        {
            "review_text": "Two words... STRUNG OUT!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun.  You can ride bikes and ATVs and Monster Trucks and Sandbuggys and aeroplanes and helicopters.",
            "review_score": "1"
        },
        {
            "review_text": "Game just crashes when launched. Don't buy",
            "review_score": "-1"
        },
        {
            "review_text": "Before you look at my hours, I would like you to know that I haven't played this game ever. Not on PS2, Xbox, whatever. However, I did play MX Unleashed when I was a kid, so therefore, I think I can review this game.  MX vs. ATV Unleashed is a great racing and freestyle game. Sure, you can play its races, but I barely knew anybody who did that. You know what I mean. All I do is goof off in Free Ride and freestyle. Now, let me talk about the main complaints, which I am going to defend.  1. This game doesn't work!  A: I know it doesn't always work. In fact, if you have Intel HD graphics, it won't work at all. However, here is how to fix it. Just launch the game and don't change any resolution, graphics, or texture settings. It's that simple. You can change the controls (Like I did because the default controls aren't good) and no crashes.   2. OMG! 30 FPS LOCK?!?!?  A: Yes, there is a 30 FPS lock. However, it doesn't affect how the game works. It's not like me where if it happened in an intense, precision game, where you need to instantly make decisions. Plus, this game is almost 10 years old. 60 FPS wasn't always the common things for games.   Those were complaints I saw most. I do complain that there is no open world like MX Unleashed. If there was, I would love this game to death. But even still, I still can't hate this game.  I would give this a 8/10. Just buy it now. And if you can't fix it, look on forums and then refund it.",
            "review_score": "1"
        },
        {
            "review_text": "I wish i could get my money back on this crap game. The default gas pedal is the dang SPACE BAR. the heck is that.",
            "review_score": "-1"
        },
        {
            "review_text": "The game crashes every time I try to start a race. I am running on windows 8.1  Use caution if you want to try this out. I had a lot of fun with it as a kid, but sadly it doesn't seem like I will have any fun with it now..  Good luck to anyone else trying it out.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME!!! Save your omey and do not buy the game! None of the stock tracks work, this means no campaign/career mode. Not having a career mode really takes away from the fun of the game :(. The devs refuse to listen to anyone to resolve the problem. The only way to play the game is to play downloaded tracks :(. To all the people saying it is a computer issue, screw you, it's not..... My computer should be able to run a game from 2005 completely fine...  ",
            "review_score": "-1"
        },
        {
            "review_text": "NEED HELP! it crashes right as it starts to load a track",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME DOES NOT WORK AND I WANT TO KNOW WHY THIS PEACE OF ♥♥♥♥ GAME CRASHES TOO MUCH I HAVE HAD ENOUGH OF IT AND WANT TO UNINSTALL IT DO NOT DOWNLOAD THIS GAME PEACE OF ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Although its locked at 30FPS its still a fun and nostalgic game if it goes on sale again i'd say to buy it. its some simple fun for 8 or so hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I can't start the game with out swiftshader Please HD remake the game it would be so much better",
            "review_score": "1"
        },
        {
            "review_text": "Really good to play an old game I grew up on! Back when games were just games and as a kid you didn't care about graphics all you wanted to do was have fun. The one downside of course is that I wish it had controller support other than that great game for being made in '06.",
            "review_score": "1"
        },
        {
            "review_text": "Good game for the nostalgia. It's obviously not a game you'll play for 100 hours but if you already played this game on ps2 it's worth buying it for few hours of nostalgia! Highly Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great game since 2006. Nostalgic, even. Stock controls are funky, but I ended up making my own. Great game to do some moto on PC. The soundtrack is also very early-mid 2000s, too!",
            "review_score": "1"
        },
        {
            "review_text": "I used to love this game on the ps2, however this version dose not work on modern machines (even win 7 and XP) every time I try to load a level the game crashes. I only paid $2.50 for it so I'm not to mad, but take my advice and don't buy it. Oh and devs (if you even read these) please up date the game even a small patch to try and fix the problem would be nice.",
            "review_score": "-1"
        }
    ]
}