{
    "app_id": 359250,
    "name": "City of Fools",
    "release_date": "2015-07-10",
    "developer": [
        "Absolutist Ltd."
    ],
    "publisher": [
        "Absolutist Ltd."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 6,
    "positive_ratings": 47,
    "negative_ratings": 20,
    "price": 5.59,
    "description": "Tundel has three evils – fools, roads and the mayor, who hides a UFO from the public. You are a successful journalist of a famous magazine. The Editor in Chief sends you to the town of Tundel on a mission to write about the mysterious incident. In order to complete the mission you'll need all your patience, wits and communication skills.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359250/header.jpg?t=1536664173",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.0 GHz Memory: 512 MB RAM DirectX: Version 8.0 Storage: 357 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Okay... That was an... experience, I guess. I'm usually more eloquent in my narrative but I can't even begin to describe this bottomless pit of fool's errands named  City of Fools . It is an adventure game with the illusion of an aim that sends you out into a blatantly foolish settlement with a Herculean list of item catching... Oh, darn! Let me take this from a somewhat proper beginning, okay?  We take the role of a journalist appointed to take an interview from the mayor of the city of Tundel, concerning the discovery of a UFO site. We take on a train journey and arrive the said town, but reaching the mayor will be a task that shall take the totality of our gameplay. Congratulations! Tundel is a settlement with the ordinary habitant with an average IQ of room temperature. You'll keep encountering eccentric individuals with ridiculous problems and absurd enough situations that you'd constantly feel the need to check if you're involuntarily attending the enactment of a Guillermo Mordillo cartoon. Nope, I wouldn't want that for my worst enemy.  Yup,  City of Fools  is an adventure game with HOG and puzzle elements, yet it's mostly a casual game. You'll be given the whole city of Tundel with more than 50 locations and even more so NPCs to get errands from. Your main goal is to eventually collect enough money through your tasks and buy a plane ticket (!) to reach mayor's island! Through my playthrough, I've been able to discover 114 tasks and complete them all, yet there were still some items in my inventory that I had no idea to their purpose. Obviously, I've been missing even more things to do. It is not only possible, but likely to complete the game without completing all errands and the function of the open world map interaction is a bit frustrating. So I highly recommend  not  trying to complete all errands! It is maddening! Eventually, they'll all serve to be futile anyhow... that ending... but no spoilers!  Graphics are annoying plastic animations and character models are intentionally appalling rather than funny. Considering that the game criticizes every aspect of modern society through some crude mockery, art choice is not surprising. The humor wasn't for my taste mostly, but I appreciated the undertone presented. There is no voice acting - only an annoying recorded series of mumbles to voice each character with different tones and nuances. Music, aside being repetitive wasn't very remarkable either. Oh, and get ready to stumble upon '♥♥♥♥' at every corner. Nope, it's not a remark. ♥♥♥♥ really happens in Tundel.  There are some actual HOG sequences and some puzzles with investigation properties - yet nothing rewarding enough to actually make you keep playing this game. You'll most definitely need pen and paper while playing if you are stubborn enough to do so, 'cause the game doesn't note down who is where, and the city is annoyingly big and complicated. I strongly suggest not saving the game in puzzle sequences, 'cause when you load the puzzle doesn't act properly and may become a game breaking bug.  This whole game is the nightmare for a categorized mind and an enemy of the rational thought. Still, someone put some thought and effort into this game; that, you can tell. It is a good game for its genre, yet with a very particular taste - I wouldn't recommend the game as a personal opinion to be honest. Up for the challenge? So get ready to walk the same streets and visit the same houses again, and again, and again... It is the most dreadful item hunt that I've ever seen.  Please also check out Lady Storyteller's Curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "-1"
        },
        {
            "review_text": "to be honest, it's bad. Even if it's old, even if it's fun for a few minutes. just don't",
            "review_score": "-1"
        },
        {
            "review_text": "Just amazing adventure! I love this style and story and this city)",
            "review_score": "1"
        },
        {
            "review_text": "  Great Game!",
            "review_score": "1"
        }
    ]
}