{
    "app_id": 359260,
    "name": "Green Moon",
    "release_date": "2015-05-15",
    "developer": [
        "Absolutist Ltd."
    ],
    "publisher": [
        "Absolutist Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 15,
    "negative_ratings": 9,
    "price": 4.99,
    "description": "Prepare to go on a fantastic journey which will take you from damp prehistoric forests, to the sultry deserts of ancient Egypt, to dirty Wild West saloons, and luxurious medieval castles! Green Moon is a Hidden Object game like no other, combining science with magic and reality with mysticism.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359260/header.jpg?t=1536664180",
    "minimum_requirements": "OS: Windows 98, XP, Vista, 7 Processor: 800 Mhz Memory: 256 MB RAM DirectX: Version 7.0",
    "recommended_requirements": "DirectX: Version 7.0",
    "reviews": [
        {
            "review_text": "I'm a huge fan of hidden object game, and I always try to keep my eyes open for new ones. That being said, hidden object games can sort of be a hit-and-miss thing for me. There are some really good ones out there, but there are some that don't do a good job at all.  Unfortunately, 'Green Moon' is one of the latter. I could not get into this story at all. There's no hint button, like in other HOGs, to help you out when you're stuck. None of the characters are relatable, it doesn't feel like there's any motivation for the actions you perform...how could such an interesting idea for a story end up being such a mess?  Like I said, there are a lot of good HOGs out there, and there are plenty of them on Steam. If you appreciate a good HOG, you'll probably want to skip over 'Green Moon,' unless you feel like pulling up the walkthrough to find out what the heck you're supposed to do.",
            "review_score": "-1"
        }
    ]
}