{
    "app_id": 359230,
    "name": "Lethis - Path of Progress",
    "release_date": "2015-06-25",
    "developer": [
        "Triskell Interactive"
    ],
    "publisher": [
        "Triskell Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "City Builder",
        "Strategy",
        "Simulation"
    ],
    "achievements": 50,
    "positive_ratings": 571,
    "negative_ratings": 250,
    "price": 14.99,
    "description": "Lethis - Path of Progress is a city-builder in a victorian steampunk setting.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359230/header.jpg?t=1479912290",
    "minimum_requirements": "Minimale : Système d'exploitation : Windows 7/8/8.1/10 Processeur : Intel core 2 duo Mémoire vive : 2 GB de mémoire Graphiques : GPU compatible with openGL 3.1 Espace disque : 2 GB d'espace disque disponible Carte son : Any",
    "recommended_requirements": "Recommandée : Système d'exploitation : Windows 7/8/8.1/10 Processeur : Intel core I3-500 or better Mémoire vive : 4 GB de mémoire Graphiques : GPU compatible with openGL 3.1 with 1Gb of memory Espace disque : 2 GB d'espace disque disponible Carte son : Any",
    "reviews": [
        {
            "review_text": "As much as I wanted to like this as I love city/building/sim type games, this game is just basically a watered down version of the original Caesar city builder.   It is pretty, but extremely limiting.  In and of itself that is not a huge deal, as that can be quite fun, however these things make it terrible to play:  1. Bad mouse interaction, often will delete buildings or build where one does not want too, without a back-out mechanism it ends up costing.  2. Because of the pathing, really all one will build is a rectangle, fill it with the needed infrastructure buildings and repeat.  3. Camera controls are abysmal. Clicks register though the turn buttons so make sure you don’t try and turn the map with a delete or build command active. And the turn doesn’t stay centered on your view.  4. Lack of info everywhere. No central reporting.  5. Mystic things seem an add-on, and not interesting (nor steampunk).  6. Dialog is really bad and terribly annoying.  Overall it plays like a mediocre flash game.",
            "review_score": "-1"
        },
        {
            "review_text": "I first had a bad opinion of this game because it's a bit tricky to deal with the AI system (they walk randomly in your streets) and it can quickly cause catastrophs.. After several hours of this game (10 hours straight to be precise) I had finished the first two campaigns and I had a LOT of fun doing them!  Sometimes you have to deal with hard situations because if your constructions aren't optimised anything can happen! I happenned to sudelenly loose a lot of workers because of that on my first tries.  The gameplay brings diversity and life to the game making it very pleasant to watch! You have many options to devellop your city so the replayability is great.  A pretty awesome city builder that every fan of the genre should look at!",
            "review_score": "1"
        },
        {
            "review_text": "Lethispop (Lethis - Path of Progress) plays like games of yesteryear, Caesar, Pharoah, Zues, Tropico... if it has city building elements, you'll find samples of it within Lethispop.  You plot areas for immigrants to place their tents, and evolve their homes into superior structures through offering city services - well water, foodstuffs, entertainment - just as you'd expect from a city builder.  Lethispop does not contain warfare of any kind, so it is great for those that don't want to have pressure applied to them while they build. At this time, it could use a tiny bit more balance - I find that buildings seem to crumble to dust far too often, even with twice as many Maintenance facilities compared to other services. Otherwise, no general complaints at all!  If you're a city building fan, this is right up your alley!",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing throwback to the old city bulding games. If you liked games like Caesar 3 or Pharaoh or Zeus then this steampunk version is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great !  Bringback your childhood, Everyone who played Pharaoh &amp; Cleopatra would love this.",
            "review_score": "1"
        },
        {
            "review_text": "How nostalgic, I just played this awesome game. I really miss the classic genre like this (since I played Sierra's game such a Pharaoh, Caesar,etc). I waited this genre an age ago. Glad I meet the simillar game so I bought Lethis - Path of Progress.   so here my opinion :  nice 2D visual art (I agree, better not use 3D), awesome steampunk theme and background music, but need more improvement i guess such an ambient sound (it would great such a habitat, crowd sound, steam factory,etc).. so far so good.  8/10 - recommended for city building gamer",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive game, more of a resource manager instead of a city builder. Some may find the campaign stages repetitive, but the fast gameplay and cute sprites make it an absolute joy.   + The attention to detail is really good!  - The text can be waaay too tiny to read...",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and at least for me fairly difficult. I might just suck at Caesar type games though!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, if you're a fan of the older city building games, you should get this, no qustions asked.",
            "review_score": "1"
        },
        {
            "review_text": "What an absolute gem! IF you ever played the old Impression Games you will love this.  Smashing fairies into Absinthe. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Modern victorian steampunk skin slapped on to the very familiar and beloved games of Pharaoh/Zeus. Has near nowhere the complexity of those games but it still offers a very solid experience.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. A perfect addition to any Impressions game lover but also a wonderful title for new comers to the genre.  Accessible, stunning to look at, fun to play, comprehensive tutorial and lots of great achievements to unlock. A must get for all simulation/strategy lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! What a fresh discovery! The gameplay is smooth, the style is sofisticated but fun, really an enjoyable title!",
            "review_score": "1"
        },
        {
            "review_text": "basically feels exactly like Ceaser III but with better graphics, no war or gods and in a steampunk setting... which is awesome",
            "review_score": "1"
        },
        {
            "review_text": "it's a gem of a game :) i have so hoped for games like those by Impressions Games, made then years ago or decades even. &amp; here it is &amp; what a lovely game it is ! it's a really worthy successor of the Ceasar series, the Zeus, Pharao &amp; Emperor, which i played all with their expansions &amp; loved pationately. Lethis has lovely graphics, mechanics are very similiar to the games mentioned. there are no gods in this game but there are ghosts to hunt &amp; absinth to drink. it's also overall a great capture of the steampunk atmosphere. an atmospheric city builder in isometric view &amp; with quirky steampunk twist. couldn't be more happy about a game than this one &lt;3  just wanted to add i played it on a nVidia GTX graphics card &amp; didn't experience any real problems.",
            "review_score": "1"
        },
        {
            "review_text": "Its enchanting cartoon drawings and cute animations belie a fairly complex and somewhat challenging city builder.   Does it still have bugs? Yes, but considering there are apparently 6 people behind this, I think this is well worth the investment, since it guarantees they will be quick to fix these bugs.   Besides, if I didn't buy a game just because it had launch day bugs, then I wouldn't have ANY games in my steam library.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay mechanics are great for people into this sort of game. However the game is currently too unstable to play and constantly crashes. The lack of loading screens in the game makes you also think that it's crashing even when it's not.",
            "review_score": "-1"
        },
        {
            "review_text": "I never thought i would find another game like Masters of Olympus but here it is. Honestly this game is gorgeous in it's simplicity, i am going to be spending many hours on this.",
            "review_score": "1"
        },
        {
            "review_text": "Can't really say anything about the game other than it doesn't work correctly. After 20 minutes there was no discernable way to advance the tutorial. So I would say, don't buy this one, at least not right now.",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who loved the old Sierra games like Pharaoh, Ceaser and Zeus, this game is a dream come true. And it's insanely adorable und cute too! Love it!  PS: It even has the thing where you can click on your citizens and they will comment (in text) on how your city is doing or just say something else. Brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the old Zeus and Pharoah then you will love this game!   Engaging, and fun mechanics!   Highly Recommended",
            "review_score": "1"
        },
        {
            "review_text": "You LOOSE ? How can you make a mistake like that. Please fix that. This killed me.  Otherwise the game is good.",
            "review_score": "1"
        },
        {
            "review_text": "At first I really liked it but then it started to kick me out to desktop, while loading new map. Sometimes game screen came back sometimes not, mouse movements and game has a different way, sometimes fast paced sometimes slow. (I'm notmeaning the rewind etc buttons,) even in tutorial something new comes out making you lose what you were doing (if tax collector just came out and you are about to build one, sth new comes out with big screen and asks you to make it as the absence of it already made some effects to your tutorial city.... I'd like to refund the game, ",
            "review_score": "-1"
        },
        {
            "review_text": "Crippling amount of crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "it wont load, help",
            "review_score": "-1"
        },
        {
            "review_text": "The tutorial needs to be more polished and better detailed and should be easier for the newbies who are new to the game. It should explain to you what each building is used for and overall it's an OK tutorial but needs work done. There should also be more different types of buildings available like residential, commercial. I know that this time period probably didn't have a lot of of those buildings but there needs to be a more variety of buildings to use. For example there should be like a forester hut who can plant trees.  There should be an editor to allow users to create their own maps to play on in the game and the map should come in different sizes maybe like 4 sizes like small, medium, large or huge. This game should also be made available to use the workshop. When comparing this to games like banished I think It lacks modding usage and also banished I think is a more better detailed then Lethis is only by a small margin. For the people who are still having crashes or issues with their graphics card. Try turning off the anti-aliasing option in the nvidia control panal. only do this If your getting like a white screen or black screen. Open GL issues try using an older driver version 331.93.",
            "review_score": "1"
        }
    ]
}