{
    "app_id": 359370,
    "name": "Pirate's Life",
    "release_date": "2015-04-17",
    "developer": [
        "Team Eyepatch"
    ],
    "publisher": [
        "None"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Pirates"
    ],
    "achievements": 0,
    "positive_ratings": 25,
    "negative_ratings": 41,
    "price": 3.99,
    "description": "Pirate's Life is a 2D strategy game / city builder with an isometric camera where you take on the role of the captain of a crew of pirates that got shipwrecked on a deserted island. You will need to take care of your crews' individual needs (like hunger and drunkeness) in order to prevent a mutiny.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359370/header.jpg?t=1447371459",
    "minimum_requirements": "OS: Windows 7 Graphics: DirectX / OpenGL compatible card DirectX: Version 10 Additional Notes: .NET Framework 4.0 and Microsoft XNA 4.0 required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I was wanting to play a game like this, but some Mother ♥♥♥♥ing ♥♥♥♥♥♥♥ did not make this game right. On the Main Building I was trying to upgrade to lvl 3 and the resources to upgrade is 96 wood, stone was around 50 or something and tools 32. Also on Main Building shows your limits and my limit was 80 resource to all items. I was stuck trying to find a way to somehow get 96 wood or pass 80 from my limit, I build double or triple of every building to see to pass the resource limit and also send my pirate ship out to raid and I had no luck. Now spending my money on these Idiot's Really ♥♥♥♥en Robbed me of my money and yes, I should of look at other peeps reviews. I don't know how steam works or lets these ♥♥♥♥ers sell there ♥♥♥♥ up ♥♥♥♥ that don't work. Steam you need to test there game before you sell there stuff because this is ripping people off. People who made Pirate's Life take those ♥♥♥♥♥♥♥s out and not let them sell there ♥♥♥♥ again.",
            "review_score": "-1"
        },
        {
            "review_text": "Game got a bug cant upgrade to level 3 because of max count of items is 80 and level 3 costs 96",
            "review_score": "-1"
        },
        {
            "review_text": "For five dollars you cant say much bad about this game and feel good about yourself. You get what you paid for and, to be fair, it is pretty fun. There are some pretty frustrating mechanics and flaws in the game however, but I still would say it's worth the money you spend.   Pros -  -Entertaining enough to be worth 5 dollars. -Has a semi-helpful tutorial that explains the basics. -Management feels relatively easy and clean. -Graphics arent bad for five bucks, music is bearable as well.   Cons : -Tutorial doesn't explain some key things you need to know, such as happiness management -There is nothing you can view that I found that actually tells you why happiness is at a certain level (Maybe each pirate seperately?) -Same Island over and over again. -No autosave -Remember button (To remember set ups for your fleet so you can send it back out immediately) Doesnt seem to work, or I couldn't figure it out. -Auto assigns pirates at random to buildings it seems. So if you have unemployed level 2 pirates for your brig, and just enough to run it, you might accidentally send one of them to work somewhere on accident -Very little information on VERY important things. -No control over specific pirates or where they go/what they do. -The raid menu shows a TON of items that have no explanation to what they are (I keep getting brown looking bananas. No idea what they do) -The 'Goods' section of a depot shows you everything you have. But that is the only way to see what you have over the 5 or so things at the top. Beer is important as well, as is different types of food for different levels. You get all your food crammed into one number, and only get shown rum.   Some insight into the above-  The good: The game is pretty fun, and you'll probably be able to get your 5 dollars out of it. Rocking 2 frigates and a brig I was able to attack the third level targets, and I don't think the navy was after me yet (The navy comes after you when you become a big threat). The tutorial tells you which buildings do what.. kind of. All of this I figured out without using the tutorial, but then found it after. The building management is easy, as is resource managment. The only problem I ever actually ran into was having too MUCH of anything and having to build depots to hold more stuff since your main building maxes out at level 3.  And the Bad: -Let's be clear. I like this game for its price. but there are a lot of things that actually made me quitefrustrated. Lets start with the pretty useless tutorial. I expect a tutorial to explain the base game mechanics. What the tutorial does is teach you how to place the basic level buildings and build roads. That's it. No explanation on how much food each pirate eats, no explanation on what makes them happy at what level, what they need at what level, how to level them up, how to get the stuff needed to build the upgrades that ALLOW you to level them up. nothing. This isn't a huge deal, some of this stuff is easily found out by digging around in the item. But some of it isn't and I didn't find a way to figure it out before my game crashed and lost ALL of my progress to that point.  -Happiness. Let's talk about happiness. As a pirate captain, you need to keep your crew happy, or they revolt against you and game over. How do you keep them happy? No idea. The game tells you that pirates at different levels have different needs, and I assume that works into the happiness level. So build tier 2 and 3 level buildings as your pirates work up that high. Spam buildings and hope it keeps it above 60. I never got mine higher than 66, and thatwas with most of my late game buildings.  -Let's talk about population though.. The only way in this game to get more people is to kidnap them. Not a bad mechanic. But when you are lucky to get 1 or 2 people on maybe 25% of your raids, it becomes a problem. Why? Because each building takes 1 or 2 people, and as soon as you grind out enough tools (Only way to get them early is by sea) you get specialty buildings like farms and breweries and the forge. THese each need a specific thing or make a specific thing, and only that one thing at a time. A forge needs coal and iron to work. You have one quarry and one lumberjack? Make two more to produce iron and coal. A farm can only ever make one type of crop at a time, and you need 2 sometimes 3 at the same time. Spam those buildings, baby. Which would be fine in its own right, if you didn't need unemployed pirates to run your ships. 2 to a sloop, your best option early (the brig is largely useless at this stage) and you need about 4 sloops or so to hit 100% success on a village I believe. Thats 8 people you can never have working if you want to (and you NEED to) raid.  This gets worse later game when the buildings poach seemingly random pirates to run buildings. Have a crew of level 2's to run your brig? Pray to rnjesus they don't get pulled into a building you give workers.  Acquiring new people does get easier once you get later into the buildings, and you can later spam levels so it doesn't much matter who gets pulled. But it seems like a broken mechanic to me.  - No autosave means you are at the mercy of crashes. I don't know why I didn't expect a game like this (no offense) to crash, but I didn't give it much thought. I was only 2 hours in and, boom. All gone.  -The menu showing you what you get after a raid is pretty useless. In 1920x1080, the icons were so small you could only recognize stuff you see all the time. Cannonballs are round. The other 60 or so items, I have no idea what they are, and you can't mouse over them to see an item name. Useless menu.  -The Goods menu on the top. You need different food and different drink for different level pirates, I'm assuming. That's how I *think* the mechanics work. All your food is lumped together into one big number, so maybe that doesn't matter? Rum is the only drink shown, so maybe once you can make that nothing else matters? You get shown clothes, but I am unsure what those do, since running at 0 doesnt seem to make anyone unhappy and having a ton doesnt make anyone MORE happy. Planks and rocks are shown, so that's good. Weapons are not, and you need those to level up.  -The remember button in the Raid section does nothing as far as I can tell.  Rant over. It's a good game if you don't expect much out of it.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is the game Tropico 2 wanted to be. Straight forward, easy to learn, and rewarding gameplay. A good price at $4.99 for a good game. I'll be playing this one a lot in the future!",
            "review_score": "1"
        }
    ]
}