{
    "app_id": 359560,
    "name": "Shutter",
    "release_date": "2015-04-02",
    "developer": [
        "Cosmic Logic"
    ],
    "publisher": [
        "Cosmic Logic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 4,
    "positive_ratings": 132,
    "negative_ratings": 39,
    "price": 1.59,
    "description": "Re-live a dark and haunting tale in this fixed camera puzzle-horror game RE-miniscent of the first generation of survival horror games.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359560/header.jpg?t=1478339472",
    "minimum_requirements": "OS: Windows XP+ Processor: SSE2 instruction set support Graphics: ATI Radeon 9500 and up, Radeon X series, Radeon HD series, NVIDIA GeForce 6xxx, 7xxx, 8xxx, 9xxx, GeForce GT, GTX series, Intel GMA X3000 (965) and up. DirectX: Version 9.0 Storage: 539 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Basic concept of the game is that you are exploring an abandoned cabin with a RC robot car thing. As the game description says, as you progress you upgrade your robot dude giving you a better camera to keep getting pictures of paranormal things like floating objects, shadows, and orbs. The more pictures of paranormal activities/shadows, the more you progress.  Controls are a little janky, but felt fairly appropriate considering you arent controlling a person. You can use your battery power to get into a first person view, but when the battery runs out, you need to let it recharge. Letting you switch between the RC camera and a 3rd person view was a very nice touch.  In my opinion, they absolutely nailed the atmosphere. I might spook pretty easily, but I know I sat there jumping, flinching, and squeaking like a little girl the entire time I played (and especially at the end).  Graphics are a little dated (as a nod to PS1 era I guess), but the audio is very well done. Would have loved for an audio setting though. Im also very happy the dev didnt 100% rely on cheap jump scares. Also absolutely loved the story. Make sure you actually read the papers you find, as well as the police report in the menu (after you finish the game of course).  Outside of the bug mentioned in the description, I didnt find any major bugs. My mouse didnt lock in the window on windowed mode, but Im not sure if it was intended to be locked in or not. It wasnt game breaking for me though.  The only downside to the game is the length. The game is pretty short. Theres actually an achievement to finish in under 10 minutes I believe. So, expect to spend 30 minutes up to an hour on your first (blind) playthrough. I do wish the dev's had added some more meat to the story and expanded the house. It would have been cool to have more rooms to explore for more story pages.   All of that said, I very highly recommend the game. The story was creepy and the RC robot thing was a pretty cool/interesting concept. I definitely look forward to their next release.",
            "review_score": "1"
        },
        {
            "review_text": "It cracks me up that I see reviews on games and there is 0.1 hours played and a negative review. SERIOUSLY? I would understand if the game did not work or something. The game was really enjoyable,and the price is right. Read the more complex detailed positive reviews and it would sum it up on what I would say. Since what I would say and explain about the game would mean I would be saying the same thing everyone else says.  10/10 excellent game",
            "review_score": "1"
        },
        {
            "review_text": "Well, what can I say? I've just finished this horror adventure game it one sitting and I was very pleasantly surprised! The idea of contolling a small remote control camera system is quite novel and adds to the eerie atmosphere of this spooky game. I thought the overall look was quite gaudy and then realised this was intentional as the camera gets upgrades to HD and other features as you progress. It's not the most original of storylines but not bum numbingly long to find out the overall plot anyway. If you are a fan of creepy games and fed up of the run of the mill 'jump scare' games that seem to be the trend, then give this a whirl. It also lives up to the nice price tag too.",
            "review_score": "1"
        },
        {
            "review_text": "First game to rate ummmmm.... I'm nervous ummm.... Lol but really the game is fantasitic in my opinion yea maybe it did have some bugs but I feel like the developers are trying there best and thats what I look forward to most this is a cheap game so I reccommend for you to get :)",
            "review_score": "1"
        },
        {
            "review_text": "Decent little game that will only last 30mins - 1 hour",
            "review_score": "1"
        },
        {
            "review_text": "I got this game a while ago but have been putting off playing it for the longest time; a decision I now regret. This game is almost everything that I myself have been wanting in a paranormal horror game. Sure, there's a lot more that could be done and added to it to make it even better but that's neither here nor there. I say that because the biggest thing I feel this game managed to do quite well was make you, the player, feel like you are actually uncovering a paranormal mystery. It feels like an actual paranormal investigation in quite a few ways.  I'll have to say that this is currently one of my top favourite games that I have had the joy of playing in recent months and I am highly anticipating its forthcoming sequel. I can't wait to see what more this team manages to come up with and what dastardly mysteries await at the Kent Prison (I'm pretty sure that's going to be the next location anyways).  I just want to add here for the team as well that I'm sincerely hoping to see this become a series with new locations everytime. Assuming that sort of project interests them anyways. It would be fascinating to see what mysteries they may be able to come up with for each entry. Just know that you've made a fan out of this paranormal and gaming afficianado, Cosmic Logic and please keep up the fantastic work.",
            "review_score": "1"
        },
        {
            "review_text": "Horror games are really all I play, and I have to say, the atmosphere in this one is lovely! The timing and experience are really well done, especially for how low of a price I bought it for, and it not being super fancy of a game. Cool execution, and I do reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty decent 3 dollar game with a neat concept of gameplay. Core haunted house gameplay of wandering a haunted house taking photos of any paranormal activity and solving puzzles, except you're controlling a drone for the most significant portion of the game. It's short, but it's fun. There aren't a whole lot of bugs but you might spend awhile wandering the house trying to figure out what you're supposed to do next. Otherwise, it's a neat game if you're bored and looking for a short horror experience.",
            "review_score": "1"
        },
        {
            "review_text": "anoying sound efects to show where you need to go  hard to controle  and very short",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game with, not entirely high hopes, but I expected what would be expected of any game. Maybe that's my bad, but it definitely fell short of those expectations. Pros: Decent story Decent Writing/Grammar  Cons: Wonky controls/Navigation. Bad atmosphere. Objectives switching between blatantly obvious, and ridilously obscure. Absurd house layout (Bad level design) Actually decent scares ruined by prior events. Teleporting shovel. Epileptic doors.  All in all, it had it's moments. But for the reasons above 2/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty much dosh. It build tension pretty well and scared me a couple times, but I got just as much entertainment out of 'Disillusions' for 99c. THIS GAME IS NOT WORTH FIVE DOLLARS",
            "review_score": "-1"
        }
    ]
}