{
    "app_id": 359580,
    "name": "Uncanny Valley",
    "release_date": "2015-04-23",
    "developer": [
        "Cowardly Creations"
    ],
    "publisher": [
        "Cowardly Creations"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Pixel Graphics",
        "Indie"
    ],
    "achievements": 18,
    "positive_ratings": 260,
    "negative_ratings": 167,
    "price": 6.99,
    "description": "Uncanny Valley is a survival horror game that includes a mix of exploration, puzzle solving and a bit of action with a lot of optional story content. We're trying to preserve the old survival horror kind of gameplay instead of following the modern trend of creating a third person shooter with horror elements.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359580/header.jpg?t=1447371558",
    "minimum_requirements": "OS: Windows 7 Processor: 2.5 Ghz Memory: 2 GB RAM Graphics: Direct X9.0c Compatible Card DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I very much enjoyed Uncanny Valley. It's an eerie game with an enthralling little story. The music is well done and successfully establishes a very unsettling atmospheric experience. Aside from some quirky controls and a bit of light reading, I was very pleased with all this game had to offer. It's the type of game that's fresh and original. And one I will recommend to all my friends.",
            "review_score": "1"
        },
        {
            "review_text": "Such an amazing little game; if you're looking for an atmospheric game to play then you can't go wrong with this game. Especially with the sheer amount of replayability present; a single play through will merely scratch the surface of a much deeper and more terrifying story.  Still not without a few issues here and there, but the devs are usually pretty prompt at fixing the issues that have arisen. If anything I just wish the game wasn't so cryptic when it comes to certain puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game to be pretty rough around the edges - I had several gameplay bugs/issues with my playthroughs. No actual crashes though. The control scheme could be more simplified, and the controller support still leaves a lot to be desired (movement is only done with d-pad, selecting 'continue' brings up a Windows menu that can't be closed with the controller, pause screen gives a list of keyboard buttons but the UI uses the controller buttons).  However, this game is ambitious, atmospheric, unique and its developers come across as earnest and respectable. It's definitely worth playing.  Great concept, and good job on a first game. I will be looking forward to future releases from this team.",
            "review_score": "1"
        },
        {
            "review_text": "Wack: that is my single-word description of the game. It purports to feature replayability, multiple endings, and player influence, but accomodates none of those in its design. It makes you go thru the same stupid ten-minute intro EVERY SINGLE TIME YOU PLAY IT, with only minor variations possible. I chose two completely different paths for my playthrus, and wound up with EXACTLY the same ending. The whole game is based on time, but it has an invisible stamina meter to make moving around as cumbersome as possible, AND THE STUPID CLOCK IN THE STUPID BUILDING DOESN'T EVEN CHANGE. It's at 12PM forever. Lazinesss. Sloth. Bad game design.  I love the idea of what this could have been--the graphics and atmosphere are charming, and the writing is above cringe-worthy; tho, here, it's worth noting that 75% of the exposition I encountered was thru reading emails on computer terminals. NO. This was bad, lazy design ten years ago, and it is bad, lazy design now. Oh, and there are audio tapes, because Bioshock proved those are necessary, right? Never mind perhaps having the characters themselves voice-acted...  This game sucks. Sorry. I don't recommend anyone buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very interesting so far, it took me 1 hours to beat it and i was real confused so i will be playing it again to try for a better ending. I do like the atmosphere in the game alot and the music is nice aswell. I'm sure the more i play it and the more i figure things it i will like it even more.",
            "review_score": "1"
        },
        {
            "review_text": "One of the scariest horror games I have ever played and man it is just an 8 bit game! This game builds up such an intense atmosphere combined with very good sound and an interesting plot it comes together so well! Really worth the money especially on sale. Can't believe that I found out about this game just now",
            "review_score": "1"
        },
        {
            "review_text": "Just died for the first time in this game...  holy  ♥♥♥♥.  Now THIS is psychological horror.  Just to clarify that ending (one of several)   A cyborg woman captured me and said she'd take care of me, I accidentaly slit my wrist (meaning I was just clicking around with 'broken glass' item to find an answer for a puzzle and I clicked on myself, and BAM.... she dragged me to a room with meds and said 'hold still I'll fix you, silly Tom'... she searches through the closest and after 3 seconds of quiet search she screams and runs at me with intense music in the background, I run for it, she throws me on the ground, I wake up tied up, she says I'm too clumsy to be left free, I might end up getting killed... she cuts off all my limbs and burns them to stop the bleeding, then she just hugs the poor dude who passed out and keeps stroking his back while the screen fades to black and she just says 'I love you'... and that's basically 10% of the horror I've seen in the underground of that creepy ♥♥♥ facility.)   ",
            "review_score": "1"
        },
        {
            "review_text": "Ya. games really scary...but I wish I knew that they didnt have the damn controller up before I bought it ♥♥♥♥ move guys...I have bought it....little hard to be scared when i have to keep looking at the keyboard.....",
            "review_score": "1"
        },
        {
            "review_text": "Alright, I'm going to try and keep this short and concise mainly because I'd rather be bludgeoned to death than be writing game reviews at 3:36 A.M.  The basic premise of the game is explained pretty well in the description and I can tell you after nearly two hours of playing it that it's pretty on point. You play as a guy named Tom who for some reason you will likely find out later (or by looking it up on youtube...) has decided to move to ♥♥♥♥ing nebraska or some ♥♥♥♥. It's pretty much just 'guard simulator' if you just do the objectives that are obviously given to you. However there's a point where you need to do something in the apartment building and the game is a little unclear on what it is. If you don't mind spoilers, google it. Now you can get bored like I almost did at first and try to leave via subway but uh... well you'll find out on your own.  This game rewards exploration, mostly. I mean, it rewards you exploring as much as a horror game should but you have to work past some obstacles at points. That's perfectly fine, the obstacles kind of feel like any of the enemies from the Silent Hill series. By that I mean that the things that will hurt you are always where you want to go next. You'll find plenty of background information for the game's story if you search through the zones you're almost denied access to. Trust me, you'll want to hear and see the tapes once you find them, it really gets you invested in the setting.  While we're on the subject of setting, it is so dreadful it hurts. I don't mean 'terrible' or anything, I mean full of dread. Like, from the second you hop the fence it's just this constant feeling of impending death. Like something is waiting for you every time you open the elevator or that one night you'll be killed in the forest by the things you can see in the trailer. The best part is (usually) there's nothing there to even be scared of. That just makes it terrifying when something finally wants to hurt you. Usually that doesn't happen until you go somewhere you weren't meant to be which, let's face it, you will.  Honestly, the game isn't some great blockbuster. It doesn't terrify you the way that one game would   you know the one, the one that when you unplugged the console it didn't stop. The one you weren't supposed to be playing.   But the thing is I think it does what it had set out to do, it builds a sense of lasting dread and even if just for a little while you might be afraid of the dark again.  In summary:  Pros: Great atmosphere, completely dreadful and creepy Always a sense of suspense in every room Pushing boundaries is rewarded Not some stupid 'early access' cash grab  Cons: Unless you try to push boundaries there's no danger, you could do the same thing for hours After messing with the generator the objectives are significantly less clear LOTS of small bugs and glitches(luckily the devs do work on fixes as they learn of them) Lack of waifus(or is this a pro?)  Maybe wait for it to go on sale to pick it up. However if you feel charitable you should definately pay full price to support the devs in future projects. Seriously, look up indie game development's economic forecast for employees. 95% of indie games don't bring in a profit and as a matter of fact 80% operate at a loss. It's all up to you  I give this game a 8/10, Uncanny Valley is a very well made attempt at a new entry into the horror genre that manages to evoke a feeling I haven't felt since back in the days of point and click adventures and Silent Hill games.",
            "review_score": "1"
        },
        {
            "review_text": "Now I'm not really into pixel games, but Uncanny Valley really won me over. Really immersive and creepy story and environment / setting. Poor Tom!",
            "review_score": "1"
        },
        {
            "review_text": "I only dared to play it once. It ♥♥♥♥ed me up that bad. :/",
            "review_score": "1"
        },
        {
            "review_text": "It seems like there's a lot of potential for this to be a really cool game, the art direction is really nice and the bit of storyline I can eek out is pretty decent, if not extremely predicatble after 15 minutes. The issue is the actual engine; it's glitchy and weird. I'm pretty sure the game skips around in time based on accidentally missing dialogue or accidentally going to sleep before you start your shift. I've gotten stuck in a never ending shift three times and been forced to quit and restart the game, to be on the next day; I can't verify because I haven't played more than once, but I feel like I'm missing something when I restart the game. The main character didn't even react to finding Buck's corpse in the generator hut and then I'm jumped by gangsters, blackscreen, robot eve, I FEEL like I'm missing some story there.  Overall I wouldn't recommend this game, it feels like it's imcomplete but it's been out for a year and a half.....",
            "review_score": "-1"
        },
        {
            "review_text": "  6/10  I have extremely mixed feelings about this game.   Pros- 1- Interesting story telling mechanics  2- Great atmosphere  Cons- 1- Frustrating Controls 2- Repetitive 3- Time Limit mechanics   I did not have the patience to replay the game 4-7 times to fully appreciate the story..",
            "review_score": "1"
        },
        {
            "review_text": "(This should be a free game on Newgrounds.)  Bugs, bugs, bugs!  I get what you're going for with this game, and I felt the atmospheric cinematic style.  But, it's shrouded with glitches. Text overlaying constantly, the inventory screen shrinking randomly, sound clips playing over eachother each time I press a button. Bahh!  It doesn't quite appear to be in Early Access, so I'm not sure why I'm seeing these problems for the finished version.  It could have just been me, but my first playthrough was very boring. I kept spamming the R1 button, trying to sprint even though my character was exhausted, WAITING for something interesting to happen, HOPING that these cheesy chase sequences would actually lead me somewhere.  All I was left with was running around for half an hour, clicking on random things  I admire the lack of handholding, being sure to read the texts (Might I add the way the text scrolled was atrocious) to understand where I need to go. Yet the secrets are so in plain sight. 'Hey! Your birthday is the code to your safe', &gt;next message, 'Happy Birthday! Today is [Insert Date Here]'  On a final note I was kinda pushed away at how it seemingly attempted to replicate a movie sequence for mainstream horror. Indie developers can get more creative than that! Horror isn't just 'running away from dark figures'. A horror can be the existential thought of knowing one day you're going to die, or not knowing where your loved one is after they've gone missing. Like I said. We're indie developers! We're not Hollywood. We don't need to stick to some ♥♥♥♥♥♥ formula.  Not a bad game overall, just extremely buggy. Still, it belongs on Newgrounds for free, instead of Steam for $9.99",
            "review_score": "-1"
        },
        {
            "review_text": "The game won't hold your hand, but it isn't an illogical adventure game either. It is fine if this isn't a game for you, but if you judge it on its own critera and have a little patients there was enough here that made me want to keep playing, and enough that made me feel going after 100% of the achievements was fun and rewarding. Don't take a bug here or there personally, the dev isn't trying to screw you over. There is a lot of care and craft here, that yes, will get interrupted from time to time with a bug. I do feel that a non-sale price of $5 or less would have been more appropriate for this scale of game, I had it on my wish list since it came out and only finally got it when it was 99 cents.  At any rate, yes there are some bugs, and yes some game mechanics are unclear, but after 100%ing this I can look back and say I really enjoyed the story, atmosphere, mood, and tone of the game, and would recommend it. It's quite stable after the post release patches at this point, in 11 hours and I don't know how many times through the game I only experienced one crash, and I was able to reload exactly to where I had left off, so it was inconsequential. Download the demo and give it a try at least!",
            "review_score": "1"
        },
        {
            "review_text": "The game is ubsurdly buggy and unstable. Be warned, although it is playable half of the puzzle is trying to work with the bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "Chased by dark figures with white eyes...... Checked! Play as the lazy fat guard............................ Checked! Die as the lazy fat guard............................. Checked! Die a horrible death with main char............ Checked! Be scared.................................................... Almost checked!  Grade as game played with a gamepad/joy2key config: 8/10. Can't wait to try other endings.",
            "review_score": "1"
        },
        {
            "review_text": "Uncanny valley is a neatly wraped blunder.  Short list of pros and cons:  Pros: ----- - Nice graphics - Good atmosphere - Good background music and sounds  Cons: ------  - Single save file (overriden with every autosave) which forces you to play all over to correct a minor mistake. - Plot is non-linear, but structured badly. - Main plot is predictable right from the start (kinda destroys the idea of twist ending) - Run/Exhaust intervals are more annoying than atmospheric - Goals are mostely unclear - Time passing mechanism seems random and is just a burden. - Twitchy and buggy at times, not polished enough.  For a game that focuses on storytelling, the structure is far from perfect. The prospect of multiple ending is nice, but the storylines collide more often than not and leave the player confused. The first time I played it I got the extremely bad ending without understanding who are the charachters involved. That is a huge disadvantage for a plot based game. Add to that the single save file which autosaves arbitrarily and prevents you from undoing a mistake and you get a really bad experience.  4/10 - just because the atmosphere is still good",
            "review_score": "-1"
        },
        {
            "review_text": "This is the story of Tom, a respectable new security gaurd who is trying to maintain a normal life despite his paranoia and intense nightmares Eve, a lovely young woman who has become socially repressed from living in such an isolated town and only seeks emotional attachment. and Buck, the fat old security gaurd who dousn't give a danm about his job or anyone and dies painfully soon after the story begins.  Will Tom be able to fight through his constant fears and save Eve from the gangsters invading their small town, only time will tell.  P.S. I Love You Too Eve.",
            "review_score": "1"
        },
        {
            "review_text": "The story seems interesting but unfortunately the game is rather buggy. Either I do not know how to save or what I thought was an auto save indicator wasnt that or my data was lost. Got stuck in what seemed to be a never ending loop of days and another time a series of events took place so fast or dialouge was skipped and I could no longer tell what was going on. The controls also seem pretty clunky and just do not feel like they were well thought out, mainly the inventory system. I had to check the store page to see if this was in early access after all this happened but the game has been out for a year so... why such strange bugs? This game could really benefit from a patch.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly promising, but currently bugged up the butt. I'm very excited to play it through, but it is currently so badly broken that it simply doesn't seem possible. If I were you, I wouldn't buy it just yet, no matter how fun it looks.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a horrible buggy mess.  First of all, the dialogue is horrible. Only several words of text are presented in one dialogue box. Sometimes you have to hit the enter key multiple times to display one sentence. For a game that relies on immersion, this ruins the experience. The dialogue also often bugs and presents several phrases on top of each other making them an unreadable mash up of words.  I also got a game ruining bug that made me just have to give up on this game. After my character fell asleep on the first day, the game just went absolutely insane, jumping around to different parts of the game, until it left me on day 3, skipping a ton of the story.  Worst $1.01 I've spent.",
            "review_score": "-1"
        },
        {
            "review_text": "Controls are wrecked. Now neither keyboard/mouse or controller is a good option. The game switches between both almost randomly. Main menu cannot be navigated by keyboard/mouse if a controller is even plugged in. Main menu cannot be navigated by controller at all. You can bring up your inventory during cutscenes and even loading screens. I wish I could play the game to see what kind of game it is, but the control scheme is too messed up to bother with it at all. Buggy and nearly unplayable with the current controls.",
            "review_score": "-1"
        },
        {
            "review_text": "I've tried playing the game a few times and it's way too buggy to enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "From the amount of time I played Uncanny Valley It\\'s somewhat tricky to decide whether I recommend it or not because it has a bunch of good things I liked, things I don\\'t like, and potential that may not have been executed to the desired hearts of gamers.  Uncanny Valley is another one of those games that sound good on paper but the execution may not have been as good.  First the good things I liked from what I\\'ve played; - Story  Specifically the endings I got so far as they remind me of the clock tower endings and they are quite interesting especially the part where \\'someone prevents you from hurting yourself\\' that ending cause a little dent of cringe in me as I watched what happened. - The horror  The horror is somewhat alright, I enjoyed the dream sequence sections where messed up things happen like a nightmare would. The endings also qualify with the one mentioned above. I wasn\\'t totally scared at all but it certainly did alright.  What I didn\\'t like; - No skips   Not being able to skip/speedthrough the first couple of minutes of the game where you have to watch the credits, get to the work place, and mess around for a couple before things can actually happen. It\\'s so tedious I wished there was a flow chart liek from Virtue\\'s Last Reward/chapter select where you jump to the part where you actually have some influence on the story. Replaying the game? Sure that\\'s fine. Replaying a part of the game that I\\'ve seen? Not fine. - Glitches  The only glitches I\\'ve seen is that if you interact too fast the text in the text box actually blend togerther to where you can\\'t read anything, Also sometimes if you play the game too fast or do something weird your characters disappear.  In my first playthrough I kept making your character go to sleep in bed(by accident) and I wasn\\'t punished for it. In fact it felt like I trapped the game in a loop because I had no need to go do the security job afterwards and the timer never starts counting again. Oh and when I got the objective to go fix something, I wasn\\'t allowed to fix the thing I was told to fix(thankfully it didn\\'t matter). - Lack of real consequences  The conseqeuence gameplay sounds like a good idea once again but they never really did anything with it. As with the continous sleeping I made Tom go through and never got punished at his job at all, which on that note you don\\'t need to do shifts everyday there\\'s no point from what I\\'ve played aside from finding info on the company through tapes and emails. As for avoiding combat there\\'s not much to say just don\\'t get hit.  - The text  The text isn\\'t hard to read, buuuuuuuut sometime the text choice for these games can go kiss my boot to the face because they can be hard to read sometimes. - Your character  For a guy that looks like he\\'s in his mid 20s he\\'s such a pusshi, running out of breathe quickly, getting tired and SLEEPING ON THE SPOT(then later teleported to his bed). Your character is such a wimp. - The horror  I know I said the horror is alright, but that\\'s the thing. It\\'s just alright. The horror in the real world in the game are just meh and you quickly find out what the horror is and after that you\\'re just fighting something out of James Cameron\\'s nightmare *hint hint - Confusion  The notepad that keeps track of your object are sometimes not clear like when I was suppose to meet up with a character, there was a note, but in the notepad it doesn\\'t tell/remind you of where to meet that character. Also the game could have been more helpful by telling me I picked up because I found some bandages that look like ammo but I never noticed that until I replayed it which could have helped me.  Overall Uncanny Valley can be interesting and I would urge you to give it a chance. But I can\\'t in good conscience recommend it in it\\'s current form and price it\\'s being sold at and that you should get it on sale.",
            "review_score": "-1"
        }
    ]
}