{
    "app_id": 359900,
    "name": "The Incredible Adventures of Van Helsing III",
    "release_date": "2015-05-22",
    "developer": [
        "NeocoreGames"
    ],
    "publisher": [
        "NeocoreGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Adventure"
    ],
    "achievements": 61,
    "positive_ratings": 387,
    "negative_ratings": 281,
    "price": 10.99,
    "description": "Van Helsing, monster hunter will face the most difficult trials of his life as he is trying to destroy his nemesis. The civil war is over in Borgovia, but the future still looks grim. The city of weird science is in ruins and a strange cult prophesises the coming of the end times.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359900/header.jpg?t=1507544518",
    "minimum_requirements": "OS: Windows XP SP3, Windows 7, Windows 8 Processor: Dual Core CPU 2.0 GHz Memory: 2 GB RAM Graphics: GeForce 8800, Radeon HD4000, Intel HD4000 (min. 512 MB VRAM) DirectX: Version 9.0c Network: Broadband Internet connection Storage: 20 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 7 (64 bit), Windows 8 (64 bit) Processor: Quad Core CPU 2.5 GHz Memory: 4 GB RAM Graphics: GeForce 560 or Radeon HD5800 DirectX: Version 11 Network: Broadband Internet connection Storage: 20 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "As a fan of the first two games in this series, I am disappointed. You can't import your character as expected because of the entirely reworked skill tree and class system. The skill trees have been significantly dumbed down, many abilities are gone, auras are pointless, and each class now only has one combat style with no more switching between ranged and melee combat. Level cap reduced down to 30, Katarina's is 25. No starting on veteran mode with an imported character.  The game has its fair share of bugs too. The controller profile does not allow you to access all parts of the character creation panel, nor can it access the bonuses in the skill tree when leveling up. I've also encountered a game-breaking bug preventing progress in Valley of Frost due to my character constantly falling through the floor.  Bugs aside, this could be a decent ARPG title for ~$12, but it's not a very good Van Helsing sequel.  edit: Latest patch has addressed the falling through the map glitch. I'm not sure if the controller scheme issues have been fixed since I progressed through the game with mouse and keyboard instead. The game is less than 10 hours long. Glory points seem to be broken, so there is literally no point to importing a character at all, since those were the only things that would carry over. Multiple achievements are still broken, like reaching level 30 with a certain class, hitting an enemy over 1K damage, being hit for 1K damage, etc. There is a tower defense quest that still cannot be turned in. Even if Neocore fixes all these bugs, it still remains a really poor finale to what was once a great series.",
            "review_score": "-1"
        },
        {
            "review_text": "Only get this game if you feel like you really want to see how the saga ends. Spoiler alert, predictably.   I am not saying anything other reviews haven't said - the fact that you have to build your character up from scratch all over again, and you don't have very much time to do it due to the game being (or feeling, at least) a lot shorter than the previous ones, is not very fun. Especially in comparison to the end of the second game, where you had two game's worth of time to get ALL the loot and build yourself into a monster-killing powerhouse. Somehow, after all he's been through, Van Helsing feels like he's getting too old for this ****. And not in the cool nonchalant cop kind of way, but the 'get off my lawn, you damn kids' kind of way.",
            "review_score": "-1"
        },
        {
            "review_text": "A disappointing conclusion to a trilogy that held much promise. Although not an overwhelmingly bad experience, it has failed to match the heights of the second game, which remains the best in the series. Fortunately the world and monsters remain consistently impressive, almost enough to recommend the game. The iconic character has been diluted to bring class variety that was not required. It is also a shame that the Tower Defense missions and Secret Lair aspects have regressed. Likewise, Lady Katarina is a ghostly companion that never quite met her potential in the trilogy. Numerous technical issues make the game difficult to recommend for cooperative play, and some single player bugs add chinks to the flawed armor. The final game in the Van Helsing saga is the victim of the success of its predecessors, and it should have been so much more.   Read full review  [www.newgamenetwork.com] ",
            "review_score": "-1"
        },
        {
            "review_text": "Note: this review is written for players of the previous two installments. If you are a new player to the franchise, I would NOT start here. Play the previous two and, if you enjoy them, you might want to risk the third game just to complete the story.  I like a lot of what they did with the mechanics and streamlining. No need to collect potions or split the stack and hand some to Katarina, you both have infinite potions on (I believe) the same cooldown from the previous games. The classes are more focused to particular playstyles, so you don't waste a skill points picking up a single rank of a skill you will never use just so you can get to the stuff you want. Several of the classes possess unusual gameplay mechanics (such as the Protector's block skill) that make them unique, rather than Class A just increasing a different set of numbers than Class B. Every class has every skill available from the get go rather than having to gain 20 levels and traverse a skill tree to make your build.  On the other hand, some of it feels really shoddy. Each class has a much clearer focus than in the previous games and they could have used that to make the skills deeper and more rewarding, but instead they just tacked on two more passive upgrades per skill and called it a day. Sending your officers out on missions becomes mostly luck-based later in the game, as the mission descriptions are not as clear and your soldier effectiveness is much harder to maintain; I tried to make logical choices, but my officers failed almost every mission from midgame onwards. Tricks were removed entirely, cutting out one of several major features meant to allow customization. The level caps are insultingly low (30 levels for Van Helsing, 10 reputation ranks, and 25 levels for Katarina) and easily reached before the end of a single playthrough on Normal.  The story is rushed. They hint at some interesting lore, but ultimately the delivery falls flat. It is cool to learn about Katarina's past, but it comes so quickly over the course of a single (short) act that there is no time to really explore it or allow much interplay between Van Helsing and Katarina. The ending, especially, is anti-climactic. The big bad goes out with a whimper instead of a bang.  It's not just the story that is hurried, either. Equipment upgrades are so frequent that the few unique/set items you find are unlikely to last more than a few minutes. This also means enchanting and essences, the other major customization features in the previous two games, are a hassle at best and detrimental at worst, encouraging you to waste money on rapidly obsoleted equipment. Your chimera still has slots for summoning candles in the UI, but there are no candles in the game, and even if there were, there are no Tricks so you have no way to summon him anyway. Katarina has all of her old skills, but with only 25 levels, she can't pick up the final two points of her final tier skills because she has to be 26 and 27 for the 7th and 8th points, respectively. The game doesn't feel polished at all.  I am apparently lucky and had a bug-free playthrough. The only thing that felt like a bug was when I encountered a few monsters (including the final boss) that had immunity to every damage type. I don't know if there is a trick to fighting them or not, but Katarina can damage them for whatever reason and I played a Protector, so I tanked them and let her take care of the heavy lifting.  Overall, this is a pretty big step down from the previous two installments. I loved the previous two games, but I can't recommend this one. If you really must finish the story, go ahead and buy it. I recommend tempering your enthusiasm, though, so hopefully you won't be as disappointed as I was.",
            "review_score": "-1"
        },
        {
            "review_text": "The dungeon crawling role-playing game genre has always been dominated by Blizzard's Diablo series but this doesn't mean that other, smaller studios have given up on the market. Quite the opposite, as there's been stiff competition from the likes of Torchlight and an even smaller experience, in the form of The Incredible Adventures of Van Helsing, coming from Hungarian studio Neocore. After delighting plenty of fans with the first two installments in the series, the developer's back with The Incredible Adventures of Van Helsing III, which continues the story, adds quite six all-new classes, and continues to refine the gameplay mechanics from its predecessors. At the same time, however, it does make a few sacrifices, as veterans can't import their old characters and the level cap has been lowered to 30. The Incredible Adventures of Van Helsing III picks up from where its predecessor left off, continuing the story by focusing on what Prisoner Seven plans for the world of Borgovia, as well as on the origins of Katarina, Van Helsing's ghostly companion. The plot is pretty interesting but what really elevates it is the fun dialog that retains the wit and sarcasm from past entries and doesn't even require knowledge of previous games to enjoy. There are also plenty of hilarious sequences involving monsters and other such things, offering a change of pace from the somber things you'll see throughout the rest of the plot.There are a few interesting twists and turns but some you can smell from a mile away. Even so, especially for veterans, the plot is pretty enjoyable. In case this is your first Van Helsing experience, while you certainly take greater pleasure if you've gone through past titles, you'll still be brought up to speed through cinematic sequences and diary entries. In terms of gameplay The Incredible Adventures of Van Helsing III brings a few controversial changes over its predecessors. While it's still a pretty good dungeon crawling RPG experience, Neocore has made some sweeping modifications to a few mechanics, not to mention its classes and skill trees. Gone are the three main classes from past games and in are six all-new ones that offer some pretty varied experiences. For melee enthusiasts, there are two wildly different classes. The hulking Protector wields a giant flail and a shield, similar to Diablo 3's Crusader, but can actually use the shield in combat to block damage, instead of it acting as a passive damage reduction. The Umbralist is a swift dual-wielding rogue that uses twin blades to inflict plenty of damage. Those who prefer shooting from afar can pick from the other four classes. The Elementalist feels like the traditional Wizard from Diablo 3, for example, but his flashy abilities bring plenty of style. The Phlogistoneer is certainly the most intriguing in terms of visual style, unleashing fire, rockets, and other projects at foes, while relying on a shield to protect himself in close quarters. The Bounty Hunter relies on guns to do the damage, so don't expect him to act like the Hunter class from past games. Last but not least, there's the Constructor, who relies on building gadgets and machines to do the dirty work for him. In combination with Katarina, who can engage enemies in melee or ranged forms, you can take a hands-off approach to combat. All the classes are pretty varied but the fact that they can only be leveled up to a cap of 30, after Van Helsing II's 60 limit, does put a hamper on your fun. The skill trees are pretty varied but they require quite a lot of study and experimentation before you can really master them. Throw in the same rather complex interface that hides things away with buttons, tabs, and panels, and you'll need to invest a bit of time before you can really figure things out. The other dungeon crawling mechanics, such as the inventory or the loot systems are still quite good, offering plenty of different gear and options for your different classes. Besides the regular dungeon crawling mechanics, you can still engage in Tower Defense missions, which offer some pretty interesting challenges, but also in mini-games that task you with managing your forces and your Chimera by sending them on missions in exchange for loot and other rewards. Unfortunately, you can no longer go through the game via its Endless Story mode, which acted as a sort of New Game +, so there aren't a lot of reasons to replay it. There is a Scenario mode that allows you to try and complete certain situations in the fastest time possible, so players are encouraged to keep coming back to the RPG.  The level design is very good, managing to offer plenty of different environments to explore, including hidden nook, crannies, and Easter Eggs that reward thorough players. Like previous titles, Van Helsing III offers an online cooperative and a competitive mode. Up to four players can go through the story together while up to eight can go up against one another in a test of skill and gear. The multiplayer mode handles relatively well but matchmaking is a bit lengthy, especially during certain time intervals. Even so, it's pretty fun and a nice diversion over the regular campaign. In terms of graphics, Van Helsing III retains the style employed by its predecessors and, while it's not that detailed or pretty to the eye, it's still fairly good and manages to keep things fresh for an isometric dungeon crawler. Enemies in particular are varied and well-designed. The soundtrack is also pretty good but some of the audio taunts and effects used by certain enemies can wear on your nerves. The voice acting is great, particularly when it comes to Katarina, which manages to deliver her witty remarks very well. The Incredible Adventures of Van Helsing III is a good game but it might not exactly delight all of its players. Yes, it's a pity that players can't import their characters and classes but the new ones are quite varied, even if they can only reach level 30. For such a low price, Neocore's RPG is a great investment.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed the first 2 games  This one seems to over simplify some of the character progression (skills/talents) which is a big downer.  Also, there are never any other players online to play multi with which sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "The game should have been a DLC. Graphics are the same than the previous opus, Just new playable characters, and you can't import your previous characters.   I bought it as soon as it is released because I loved the first and second episodes, but this one is a huge disappointment.  Neocore, you did bad this time :(",
            "review_score": "-1"
        },
        {
            "review_text": "One word: disappointed. I was hoping Neocore was going to fix the bugs that plagued the first two games and redeem themselves in this one, but no. Multiplayer is still unplayable, content is simply regurgitated (copied and pasted in places) from the previous game. Classes are a scam, they took three classes from previous game and split them in two, i.e. making them all ranged and all melee. Wish I could get my time and money back.  Will never buy a Neocore title ever again.",
            "review_score": "-1"
        },
        {
            "review_text": "This is entertaining action-RPG when it's not crashing. Sadly, it crashes often.",
            "review_score": "-1"
        },
        {
            "review_text": "Where did they go so wrong?   As a big fan of VH1 I was really please when VH2 came out and improved upon what they had already designed.  When I saw I had missed VH3's release I was a little surprised and of course bought it straight away...  What a mistake.  VH3 feels like a hollow shell gameplay wise when compared to VH1 and VH2. Features have been stripped to the bone. Level cap reduced. 6 classes, most of which are terrible. Crafting and Enchanting seem to have taken a nerf. The skill system feels dumbed down, with seemingly less types of skills.  It's a shame as the world/lore crafting seems to be okay, with its own quirky pop-culture references.   As it is, I recommend buying VH2, it's a far superior game. Try it out before they ruin it with their plans to implement the 6 class system into the previous games.",
            "review_score": "-1"
        },
        {
            "review_text": "+) More interesting side quests.  +) More interesting monsters.  +) Bonus attributes has become lower but they've become more effective. This also makes quest rewards like additional level ups.  +) Headquarter doesn't tell you to come back immediately. You still have to go back during the quest but it's better than Van Helsing II which tells you to come back immediately: Huge Buzzkill.  +) Lady Katarina has become more amazing woman.  +) Lady Katarina became tougher.  +) Healing and Mana potions has become some sort of basic skills with cooldown. They are now infinite.  +) Images for Rings and Amulets became more stylish.  +) More Images for trophies.  +) I love the background music.  +) The mood is even greater than before.  +) No additional mana cost for higher skill level.  +) There aren't that many army commending quests.  +) Chimera levels up faster.  +) Some of the land marks were amazing!  +) It was nice to see max level being set. This seems more propriate considering the length of game play.  +) Shops have good items time to time.  +) Dialogues were really interesting.   -) They shouldn't have changed the classes. They should've just added more.  -) Bunking Van Helsing character like second one was terrible move. What was even worst was that Van Helsing character can now only use ranged weapons.  -) Van Helsing character's skill window was not even finished!! There was only one skill in each tab for his skills menu! That's not a bug, that is just not finished! What the heck man?! Get a grip man!  -) Character description was wrong. For Umbralist it should've been 'Hit and away' not 'Hit and run'. Run sounds like actually runing away: far.  -) Skill description for 'Blink Assault' should've been different. Instead of saying 'Simultaneously hit six enemies' which sounds like you won't be able to do anything until the action is done, they should've said something like 'casts a shadow that hits 6 enemies.'  -) You still can't do side-quests or events after the main quest is done. Some main quests pop up all of a sudden. What is this? We're supposed to fail or ignore the quests you made for days or months?! Why put'em there then huh? Do we need to do a web search and get spoiled in order to do all of them? What's the point?! Don't expect users to play your game more than once. That's arrogance. I did but Not everyone would do that. Wake up, get a grip man!  -) Skill description for 'Hunter's Rejuvenation' is wrong. It starts from +3 hp, not +10.  -) In Empyrean defense mission, they made ink portal hard to notice. This obvious is on purpose. This kind of approach towards adjusting difficulty is that of 90s. Come on! Wake up man! Game industry needs to be developed! Not go backwards.  -) There are some places that once you get in it is hard to get out simply because some giant terrain object is making your cursor unable to click out of there. Come ON MAN! GET A GRIP FOR GOT SAKES! THAT IS SO BASIC! I appreciate you put a lot of perodies that we can laugh about but do that after dealing with this basic things man!",
            "review_score": "1"
        },
        {
            "review_text": "Game crashed during the loading process sometimes with no reason， whether single or multiplayer. Please fix that. Nobody wants a awful game experience.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is crash painfull crash to play crash crash.",
            "review_score": "-1"
        },
        {
            "review_text": "The franchise took a definite increase in replay value with 6 available classes and 4 player CoOp as well as the continuation of the scenario-mechanic and the addition of PvP game modes.   The gameplay is dungeon based; although I have to admit that I dislike the static maps (as opposed to games which generate the maps each time you restart the game).  The storyline is diversive and they manage to keep it intrigueing even in the third installment of the series ... but you should have played the first two games if you want to understand the storyline of this game.  The graphics were slightly improved and there are a lot of new mechanics added to the game alongside the new classes and different roles, just increasing the fun in the multiplayer!  In short; if you have some friends to play this with ... do it. It is an excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "good game but suck online system",
            "review_score": "1"
        },
        {
            "review_text": "Definitely does not deserve bad rep unless you want something different from episode one and two. If you liked one and two you will like 3. Doesn't add much but doesn't take away much either. The price is good too, in these days of games that cost 59.99 it is nice to not have to invest so much. At first i was cheezed off when i found out the magic guy had his powers reworked; i like going around wielding the powers of a god but hey that's me. After awhile and experimentation with different abilities i may not be a god but i am a demi-god (in the game of course, not in real life) ; )",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved this series, I haven't been this immersed in a video game since 2012.  Great voice acting Great story Tons of different loot Lots of different ways to build your characters and allies 6 different classes At least 20 hours gameplay from each game invuvidually. (without playing new game+.  If you're a fan of diablo or want to get into these types of gamews, I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Its good but not as good as the first 2",
            "review_score": "1"
        },
        {
            "review_text": "Does this even ♥♥♥♥ing work?",
            "review_score": "-1"
        },
        {
            "review_text": "Not as good as the first two, feels rushed and has a vastly limited skill tree compared to the earlier games. A lot of weird little glitches and underwhelming/slightly broken cut scenes. Epic conclusion not very epic. This one can be completed in 8 hours flat.  Still, a very pretty game. If you're looking at diving into this series, I would recommend waiting for The Final Cut, which will be all three games, presumably with a lot of fixes.",
            "review_score": "1"
        },
        {
            "review_text": "the next chapter of van helsing",
            "review_score": "1"
        },
        {
            "review_text": "I finished the story and played several rounds of scenarios with my Umbralist, which has crazy burst damage and many ways to stay stealthy.The game is very short, but the story is ok. The skill trees changed a lot, I'd try most classes out.",
            "review_score": "1"
        },
        {
            "review_text": "Its not the same as 1 or 2 but is great.",
            "review_score": "1"
        },
        {
            "review_text": "good game with good humour and reference to fairy tales. sadly, its the last of the series.  ",
            "review_score": "1"
        },
        {
            "review_text": "l really like the game but i miss the old skill tree you have a lot less skills to play and try out white",
            "review_score": "1"
        },
        {
            "review_text": "i hate problem of this game",
            "review_score": "-1"
        },
        {
            "review_text": "So far its a letdown from the first 2, 6 new lame classes and importing your character from vh2 does nothing you loose all your progress levels items skills ect. then changed to a lame diablo class system that restricts your character customization no more freedom to make the character how you want.  so far very disapointed they wanted to do something new and failed  the reason the first 2 were fun was because they were not like diablo  i may change my review after i beat it if i can make it through hard to play through a entire game that disapoints you from the start  Update: made it a few hours into the game got to the valley of frost and now i keep falling through the world and cannot progress through the game anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "The game gets a lot of hate for only one reason: you can't import your character from the previous games. While it's a pretty big deal to be honest, VHIII is still the same Van Helsing game we loved.  It has some negatives like the difficulty is not balanced: hard is super easy, but the difficulty above that is punishingly difficult (I'm saying coz I'm not a regular arpg gamer). The game has less side quests and puzzles than the previous installments which makes the game more grindy which is not a good thing. It doesn't bring new elements to the series either.   But it has some good things as well. The story is more enjoyable than the previous games, Katerina's side story is particularly well written. The ending is satisfying unlike some other franchizes. The artstyle of the areas is the best in this episode, and also the level design is quiet good. I enjoyed the boss fights as well. They bring some freshness to the usual game play. The soundtrack is also the best here.  Overall is a fun and solid closure of the series. If you enjoyed the previous games and you can live with the fact that you need to start a new character you will enjoy this game. If you were not a fan of the previous episodes, there is no reason for you to buy this. If you are a newcomer, play the first game which is the most original and complete experience of the series. VHII and III are only expansions after all, not standalone new games.",
            "review_score": "1"
        },
        {
            "review_text": "I have played all 3 games and am some what upset with the new skill tree setup. Combat needs some balancing. Game play is no different from Van Helsing II other than the new classes and the skill tree.  I recomend playing for the story. If your new play the first two before this. If you've played 1 and 2 , then play 3 for the story.  I played as the constructer and for the first 30min kept forgeting I now had robots to fight for me and wound up rushing in to the fight and dying ,lol.",
            "review_score": "1"
        },
        {
            "review_text": "NeocoreGames delivers yet another satisfying and solid action role-playing game with The Incredible Adventures of Van Helsing III.",
            "review_score": "1"
        }
    ]
}