{
    "app_id": 359960,
    "name": "Choice Chamber",
    "release_date": "2015-07-16",
    "developer": [
        "Studio Bean"
    ],
    "publisher": [
        "Studio Bean"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO",
        "Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Massively Multiplayer"
    ],
    "tags": [
        "Action",
        "Indie",
        "Massively Multiplayer"
    ],
    "achievements": 34,
    "positive_ratings": 142,
    "negative_ratings": 62,
    "price": 6.99,
    "description": "Choice Chamber is a real-time, crowdsourced, procedurally generated game where your fate is in everyone else's hands.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359960/header.jpg?t=1462246392",
    "minimum_requirements": "OS: Win 7 or higher Memory: 2 GB RAM Network: Broadband Internet connection Storage: 80 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "i found this game and seeing the videos it made me think that this game is only for twitch players but its not ive had loads of fun just trying the game randomly on my own and i really enjoy it from the art style to the way the player changes on you i would highly reccomend you try it out even by yourself or with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game. I don't stream. Game is still fun. I recommend this game. GG Bean. Way to make a game.",
            "review_score": "1"
        },
        {
            "review_text": "You play the game, the audience plays you. I am nominating this game for The  'Game Within A Game'  Award.",
            "review_score": "1"
        },
        {
            "review_text": "2 hours. Hardly unlocked anything. OMG if you are a streamer get this game. It is worth EVERY PENNY. My viewers and I had such a blast in one night I have already decided to make this a permenant part of my streams. Maybe not daily but for a while this will be a main staple of my streams. Any game that gives people a chance to interact with you is worth it. I will hoist this game up on a pedestal for now and hope it can only get better. It may not be a AAA title but please give these people the chance.  For those of you who like pros and cons: Pros: Great sound Great look Great controls for a platform adventure game Gives viewers a way to interact with you IS FUN Never the same game  Cons: A few bugs that made me restart the game mid playthrough but can only get better.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fun and hilarious if you are a streamer. You find out who wants you to succeed and who wants to watch you die.......over and over again. The rage quits and epic victory dances are very real with this game. If you are interactive with your chat and they wanna help choose your fate in a game, I highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is awesome! If i didn't had this game i wouldn't be able to stream now, thanks to this game i met lots of friends that im talking to more than a year now. Definetly get this game if you want to grow up fast on twitch or just want to play it with fans!",
            "review_score": "1"
        },
        {
            "review_text": "Choice Chamber is a real-time, crowdsourced, procedurally generated game where your fate is in everyone else's hands.",
            "review_score": "1"
        },
        {
            "review_text": "Don't Buy this game if you intend to play it with a controller Currently using Razer Sabertooth 360 controller for all my controller games.  This game is the only game in the vast collection of games ive used my controller that does'nt work.   The threads here are at least one year old so it doesnt seem like they're gonna fix it.    E v e r.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a pass or fail game! It either wokrs or your ♥♥♥♥ out of luck, there is no trouble shooting help, tech support, the dev dont give a ♥♥♥♥! ♥♥♥♥♥♥♥t! I bough this game spent two days sending email and looking in forms and nothing it just sitting and rotting in my library. Ps this game i beleive is a TCP Connection on port 6667 and 80 as a back up. ♥♥♥♥ THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "Great fun game to play with friends. A streamer/friend of mine on Twitch makes a few runs in this every so often (' Sunday Funday with viewers :D '). Your friends / enemies vote on making the game easier or harder and even effect the rooms and enemies with their votes. If you stream I recommend you pick it up and be ready for a fun time.",
            "review_score": "1"
        }
    ]
}