{
    "app_id": 359920,
    "name": "Highlands",
    "release_date": "2015-04-21",
    "developer": [
        "Burrito Studio"
    ],
    "publisher": [
        "Burrito Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "RPG"
    ],
    "achievements": 27,
    "positive_ratings": 175,
    "negative_ratings": 39,
    "price": 3.99,
    "description": "Highlands is a hand-drawn turn-based strategy game with unique characters, resource management and RPG elements where the focus is directed toward decision-making.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/359920/header.jpg?t=1478048479",
    "minimum_requirements": "OS: Windows 7 or later Processor: 1.7 GHz Dual-Core Memory: 2 GB RAM Graphics: DirectX 9.0c compatible graphics card DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Highlands is a unique strategy game that does exactly what it says on its store page. But just as importantly the devs at Burrito Studio are VERY responsive to community input. Steam achievements are already in and a new 'casual' difficulty is being added (within the next day or so) mainly due to the fact that Highlands' gameplay is so different to what we are used to that extra climatisation may well be needed for the average player despite already having a well made integrated tutorial. There is little doubt that this is a challenge that none should take lightly. In addittion, the guys have added some nice extra features including extra craftable consumables, extra character abilities, and extra enemy abilities. All in all, the 1.1 build will radically alter an already good game for the better making Highlands very close to being a must-buy for anyone interested in a fresh look at the tactical turn based with RPG elements genre. Overall an extremely professional piece of work destined, at the very least, to become a cult classic.  *edit* Don't underestimate that word 'unique' up there - everyone claims it but few actually achieve it.",
            "review_score": "1"
        },
        {
            "review_text": "The first things that will draw attention on Highlands are the good designed characters and the beautiful hand drawn environments, and the music fits very well to the game and helps in keeping you immersed and setting the tone, though while the main characters look all unique the recruitable NPC doesn't offer a great variety, understandable as the game was funded via Kickstart by getting just a little more than what they were asked.  The story develops through the dialog between the main characters, the Arislaan family and there are some random events with choices that helps to keep the game fresh if you decide to replay it.  The gameplay elements, while simple, serve very well to purpose of the game. You have three resources that you need to take care and gather during the game, food, leadership and scraps, they are used to recruit new characters maintain and heal your troop, build items and weapons etc.  There are four classes, combatant, mechanic, leader and academic. As you expect each one has a different function and status and they get new abilities when leveling up.  Recomended.",
            "review_score": "1"
        },
        {
            "review_text": "Highlands plays a lot like Risk, but has some really interesting elements to it that balance the gameplay and difficulty out. In Risk, and Civilization, once you gain the upper hand the game is as good as won, and it's an unmotivated steamrolling of whatever's left in the game, which can really drag on. In Highlands, taking a slower paced strategy can actually work against you, as every few turns there are respawns that get higher over time. The third chapter in particular I had to restart because I wasn't aggressive enough at the beginning, and got boxed in and overwhelmed. The resource management is pretty basic, but works well and plays a vital role to your success. I felt like some abilities were slightly overpowered, but then on the last stage I realize it would have been impossible without them. I think great attention was given to the overall balance of the game.  It falls a bit short on the story, and overall length. It's about 15 hours total. It lacks any kind of customization beyond a limited set of equipable items, which even on the weapon side is a one size fits all selection. Level ups are important, but adding a character attribute to advance each level would have added a ton of replayability to the game.   In summary, if you are looking for a quick, easy to learn, addictive turn based strategy game, this is an easy choice. It has that Civilization feel of 'one more turn' and the difficulty scales really well as you advance in the game. I personally recommend doing the 'Challenging' difficulty level if you are big into strategy games, which is the level I selected,",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful little game. While short, it is worth your time to enjoy this title.  The art and vision of the game makes me wish I could watch this as an animated movie or series. The only 'downside' is its limited duration and replay. Its a great story, and it left me wanting to spend more time in the world this game paints, but not enough to replay the same missions over and over.",
            "review_score": "1"
        },
        {
            "review_text": "Highlands use some creative ideas to bring a new take on the Strategy/RPG genre.   Using the 4 classes the game offers, you need to think to plan your strategy carefully. I played on Normal, and you can easily get overwhelmed by the enemies if you act recklessly. Whether you decide to attack an enemy, heal your wounds, fortify your quarters, create new items or capture ressources, the game presents multiple options for you to conduct your missions.   The game is short, but it is definitely worth it. Really recommended if you like SRPGs.    ",
            "review_score": "1"
        },
        {
            "review_text": "The headline is the stunning artistic style, but there is a compelling strategy game at its core. You have to manage your time against your resources, new mechanics are introduced as the game progresses, new enemy types and player abilities. Each map is a puzzle with multiple solutions and it tells a good story. Absolutely worth the cost. For a more hands on look you can watch this video:         YouTube™ Video:  Indie Inbox - Highlands&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Tight turn based strategy game with nice artwork, well developed universe and story line.",
            "review_score": "1"
        },
        {
            "review_text": "Really casual on normal and quite challenging on brutal. Simple mechanics but consistent.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished this cool game. I think it is worth like 6-7 euros max. A few crashes. Nice artwork. Not too easy on normal difficulty,",
            "review_score": "1"
        },
        {
            "review_text": "great animation. interesting approach. game time matches price point. wish there was a skirmish mode",
            "review_score": "1"
        },
        {
            "review_text": "A nice little strategy game. The length of the game is a bit disappointing but for the sale price it was a very good deal. It doesn't have the depth of an Ogre Battle but it certainly has the potential to be greater in a sequel. I will definately be looking out for this companies next title.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game with beautiful graphics and decent story.  Gameplay is refreshing and easy to learn. The only con for me was the difficulty. In most levels when you reach the point where there's only one enemy left, you can abuse the system pretty hard and craft equipment for your whole team. That made the game too easy. I'd say it's worth the 10€ for some nice hours of playing through once. I tried to replay, but didn't actually play through it again.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game with beautiful graphics and decent story.  Gameplay is refreshing and easy to learn. The only con for me was the difficulty. In most levels when you reach the point where there's only one enemy left, you can abuse the system pretty hard and craft equipment for your whole team. That made the game too easy. I'd say it's worth the 10€ for some nice hours of playing through once. I tried to replay, but didn't actually play through it again.",
            "review_score": "1"
        },
        {
            "review_text": "The setting and style are fine. The story is not bad, but nothing special. The mechanics is all right, but shallow - there’s not much to explore in terms of developing your characters or your districts. It’s not a bad game, but it has little new to offer and it gets repeptitive too quickly.  It reminds me of Rebuild: Gangs of Deadsville, with somewhat more stylish graphics and story.",
            "review_score": "-1"
        },
        {
            "review_text": "Under construction, atm.",
            "review_score": "-1"
        }
    ]
}