{
    "app_id": 36000,
    "name": "Foreign Legion: Buckets of Blood",
    "release_date": "2009-08-04",
    "developer": [
        "Sakari Indie"
    ],
    "publisher": [
        "Sakari Indie"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Third Person"
    ],
    "achievements": 23,
    "positive_ratings": 184,
    "negative_ratings": 111,
    "price": 3.99,
    "description": "Foreign Legion: Buckets of Blood is a cartoon-style third-person shooter. You take the role of a last-standing hard-boiled Legionnaire taking on an entire rebel army. A small campaign with various objectives, such as defending civilians, escorting a tourist bus and a mass-chicken-murder map.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/36000/header.jpg?t=1447352370",
    "minimum_requirements": "OS: Windows 2000, XP, VistaProcessor: 1.2 GHz CPU or higherMemory: 512 MB Graphics: DirectX 9 video card and 64 MB VRAMDirectX&reg;: DirectX 9.0c or higherHard Drive: 150 MB Sound: DX 8.1 Compatible Audio",
    "recommended_requirements": "OS: Windows 2000, XP, VistaProcessor: 2.4 GHz CPU or higherMemory: 1 GB  Graphics: DirectX 9 video card and 128 MB VRAMDirectX&reg;: DirectX 9.0c or higherHard Drive: 150 MB Sound: EAX Compatible",
    "reviews": [
        {
            "review_text": "It's a nice game, a bit short even with the achievements, if you want something fun and quick give it a try, killing chickens it's the best though",
            "review_score": "1"
        },
        {
            "review_text": "Foreign Legion, Buckets of Blood is the perfect example of a developer creating a casual game that's not simply a frenzied money grab. Despite being an incredibly simple game, and an incredibly small one at release, the developers have worked hard to improve every single aspect of it.  While the lower difficulties are pretty much impossible to fail on the harder ones provide genuine challenge. The leaderboards and small meta-game will keep the game interesting beyond the initial 30 minutes of excitement.  The LEGO-style graphics are cute but not very pretty and the sounds are about what you'd expect from an indie title.  Probably the most important thing you need to know about this game is how much bigger it has gotten since release. Any review written before the major content updates should be considered invalid because the amount of content that has been added by the developers since release is truly amazing and something that we as gamers should reward in this age of Season Passes.",
            "review_score": "1"
        },
        {
            "review_text": "not fun at all... maybe good on a phone or tablet, but I'm sorry I spent $$$ on this for my computer.",
            "review_score": "-1"
        },
        {
            "review_text": "dont recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game. Not worth any money.",
            "review_score": "-1"
        },
        {
            "review_text": "Ran out of ammo the first mission, can't do much with a pistol. Mission failed. Thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "I really have no idea why I bought this game :/  2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Is a nice game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little lego man esk fps, simple gameplay but fun. Few weapons and difficulties to choose from to keep it from getting stale, the same could be said for outfits.  Game also has fun little easter eggs.  The game also doesnt have hard achievements so if your an achievement hunter it is worth a look at for some quick achievements. The game missions are pretty cool to, they do vary from defend an area, to escort and just survive. The game is pretty short but is good for killing time or if your bored from your main game i.e. dota 2, tf2 etc  5/10 simple and short but a good laugh :D",
            "review_score": "1"
        },
        {
            "review_text": "it OK not great, if you want this game but your afraid that its not fun, then i recommend foreign legion:multi massacre but if you want to get this, i still recommend this!",
            "review_score": "1"
        },
        {
            "review_text": "Worthless game. Rip off at any price. There's nothing there... it's a joke to call this 'mini demo' a game. Countless free games are better than this, like 'Wolfenstein HD,' for starters. Scammer company.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is putrid. this game is garbage. this game is s­h­it. this game is horrible. this game blows. this game is absolutely positively wretched. this game is not at all worth playing",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money on this piece of ♥♥♥♥. Ty.",
            "review_score": "1"
        },
        {
            "review_text": "Very funny game (and at times rather intense). Well worth the very reasonable asking price, although the developers' issues with chickens are somewhat disturbing...:D",
            "review_score": "1"
        },
        {
            "review_text": "This game does not launch on Mac OS 10.9, this has been a known problem since August 2013, and the developer has not made a single update or even a comment to rectify the situation.",
            "review_score": "-1"
        },
        {
            "review_text": "Such an awesome game! It's great on a laptop!",
            "review_score": "1"
        },
        {
            "review_text": "Do try the Christmas-level as well :)",
            "review_score": "1"
        },
        {
            "review_text": "A way fun 3rd Person Shooter! This game can go far in the future if they decide to improve it some more. The graphics are very simple and great to look at. The gameplay is not hard to learn and get used to. The game doesn't take long to beat and get all the Steam Achievements. Its a wonderful game that was very enjoyable all the way to the end. If you love shooters then this is one not to miss out on. This is a great humorous game that puts alot of joy into shooting the enemy. There is not a multiplayer in this game but when they do involve it then this is a must buy because its going to be a hoot to play. There is a massive chicken you have to fight as a boss fight which is funny to fight. I loved playing this game! If you are considering getting it then dont hesitate any further and get it and i know you would enjoy it if you gave it a decent chance.",
            "review_score": "1"
        },
        {
            "review_text": "This game was on sale for less than $2 so I deciced to get it.  At that price I feel I overpaid.  The game is SHORT. The game is almost all defense. The game doesn't want you to precisely aim so it will not let you.  You can finish this game in under 30 mins. It is a 'wave' game. So clear all the waves before the time expires and the scenario will finish. Even if you complete it in less than half of the time set...  Aiming will P### you the #### off. There is no 'precise' in this game. The game gives you a general idea of where you are shooting and where the bullet ends up is decided by the program...not where you aim and not your skill.  There is no story. You enter a scenario and then exit the scenario. You have a goal, usually defend 'x', and you fight off waves of enemies.  Field of movement... You want to aim up? That's fine...until you realize you aren't allowed to aim as high as you want. Also, there is no running in this game. The speed you initially move is the speed you will always move.  Graphics... Fine, I saw the graphics in the game's store page and knew what I was purchasing. But when aiming/looking up I had my screen/vision blocked by the object behind me? That is bad programming. How could the programmers overlook the fact that the 'camera' can be obscured by objects near the player character? That is not only bad programming but lazy programming.  If this game is ever less than 99 cents...I would say 'buy it'. But at the price it is currently at? AVOID THIS GAME. IT IS NOT WORTH YOUR MONEY.",
            "review_score": "-1"
        },
        {
            "review_text": "At first I thought this was some sort of lego adventure game. When I realized it wasn't I was a little disappointed. But after I played it a little while longer I have to say it is a pretty solid game. Its fun for short jaunts of play. Give it a try its cheep and fun enough.",
            "review_score": "1"
        }
    ]
}