{
    "app_id": 3600,
    "name": "Escape Rosecliff Island",
    "release_date": "2009-04-15",
    "developer": [
        "SpinTop Games"
    ],
    "publisher": [
        "PopCap Games, Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 97,
    "negative_ratings": 57,
    "price": 4.25,
    "description": "An unexpected storm has left you shipwrecked on a mysterious and remote private island. Seek & find cleverly hidden objects and solve puzzles to find a way off the island! Find over 2100 hidden objects in 25 intriguing and mysterious locations to find items that will help you escape!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3600/header.jpg?t=1447351775",
    "minimum_requirements": "OS: Windows XP/Vista/2000                    Processor: 350Mhz Pentium or greater CPU                    Memory: 256 MB RAM or greater                    Sound and Graphics: 16-bit Graphics and Sound card                    DirectX: DirectX 7 or later                    Hard Drive: 42MB Free Space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great, atmospheric, entertaining I spy style hidden object game. My only complaint is the scenes dont look natrual, they are clearly photoshopped so to speak. It'd be nice if they had taken more time on the art, blending things in better. However this would also have made the game more difficult, so it makes sense. If you enjoy hidden object games, I 100% recommend this one.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly good seek-and-find game mixed with a handful of mini-games, Escape Rosecliff Island is an addictive title that should satisfy anyone who likes casual games.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly typical find-the-hidden-object game, with mini game puzzles at the end of each level. Nice to relax with. :)",
            "review_score": "1"
        },
        {
            "review_text": "I moved away from buying straight hidden object games for the adventure kind but it still delivers. Getting off the isalnd is clever. Will play again.",
            "review_score": "1"
        },
        {
            "review_text": "I just love this game. It's just splendid!",
            "review_score": "1"
        },
        {
            "review_text": "ehhhhh... good time kill and if you like find it games then this is for you",
            "review_score": "1"
        },
        {
            "review_text": "The creators of this game dont know they difference between a wrench and spanner. Several other items are also listed by, what I can only guess is, local terminology from where they live. Not very wordly. But other then that, not a bad spot the item game, even if it makes no sense.",
            "review_score": "1"
        },
        {
            "review_text": "This is the worst hidden object game I've ever played. It's unimaginative and the same scenes are repeated over and over. I went through this one thinking it had to get better, or it was going to have a great ending -- nope. Complete waste of time and money. The horrifying thing is that two more entries were spawned in this series that are carbon copies with new scenes. Wow!",
            "review_score": "-1"
        },
        {
            "review_text": "There is no storyline and no appeal to the game",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy unless you have a very good discount",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible low resolution mobile game.",
            "review_score": "-1"
        }
    ]
}