{
    "app_id": 360150,
    "name": "How To Survive: Third Person Standalone",
    "release_date": "2015-07-02",
    "developer": [
        "Eko Software"
    ],
    "publisher": [
        "505 Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Survival",
        "Zombies",
        "Action"
    ],
    "achievements": 27,
    "positive_ratings": 632,
    "negative_ratings": 509,
    "price": 6.99,
    "description": "Driven by community suggestion, 505 Games and EKO Software introduce you to a new single player 3rd person view experience that allows you to re-play the zombie crafting adventure &quot;How to Survive&quot; from a deeply immersive point of view.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/360150/header.jpg?t=1463562158",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core 2 Duo or better Memory: 4 GB RAM Graphics: Ati 5700 series/NVIDIA GeForce GT240 or equivalent Network: Broadband Internet connection Storage: 6 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Actually a pretty cool game, but this shouldnt even cost money, it should be an option for the base game not a standalone game",
            "review_score": "1"
        },
        {
            "review_text": "i thought this game looked cool after i looked at the screen shots, oh boy i was wrong. i bought it for $1 on steam summer sale, this is garbage, there is only audio options and keybindings nothing else, the graphics are terrible, so is the gameplay (just hit it until it dies) the zombies sound like farm animals giving birth (pigs to be exact) and you cant even jump?! im embaressed to even have this in my library i dont reccomend buying this game at its $10 price tag nor its $1 sale price tag. 505 games had embaressed themselfs",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible and just awful... I actually enjoyed the original isometric game but it really doesnt translate well into 3rd person perspective like this. Its feels like its a super low quality game from early 2000s, with low poly assets and poor animations. Not worth your money, because you cant even do coop in this version. Maybe if this was some sort of added bonus version that came with the original as a package it would be worth a playthrough just to see how not to convert games just for it's own sake, but the fact that they charge you for it adds insult to injury.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Exactly the same game, Completely different. Just moving the camera over that right shoulder changed EVERYTHING about the original. Some things are harder, some are easier. Example?   Try looking out for night stalkers when you can't spin 180 instantly, and can't see 360. Try getting actual headshots for that extra EXP, no redline to confirm it for you.   Easier? You can actually see what you're picking up. It changes everything about the original, and yet nothing has changed but the camera...",
            "review_score": "1"
        },
        {
            "review_text": "Not a horrible game, and probly would be decent if it didn't start bugging out. After finishing the 'tutorial island' as I would refer to it, ALOT of things were not rendering when you return back to the main island, to include some tents, the NPC you're supposed to talk to, but perhaps the most highly aggrivating-to which cause me to quit the game- would have been the invisable mobs, wether zombie or the night aggressive zombie I would not know as I was being attacked with no mob around me to retaliate aginst.",
            "review_score": "-1"
        },
        {
            "review_text": "There's a lot of bugs my screen became blurry then some codes are showing in a big letters and big numbers, Pls.. Fix this because it is hard to play when your screen becames blurry. Thank you :)  #I waited this game to become a third person survival mode :)",
            "review_score": "1"
        },
        {
            "review_text": "Same game in 3rd person. Still just as fun. Will survive again, um again.",
            "review_score": "1"
        },
        {
            "review_text": "while the original games was good this version is awful. no way to adjust graphics settings makes this game lag like mad. do not get this, buy the original, it is a much better game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very good game. I played the top-down and finished it and thought when this went on sale that it would be pretty cool to play in 3rd person. In fact it is quite fun and more challenging than the top-down. To me it was worth the money and the fun is there. People say it should have been a free-addon, but I disagree it's like a new game. They did a really good job making this a 3rd person game.",
            "review_score": "1"
        },
        {
            "review_text": "3rd person h2s is trash. buy the other one. this game is not meant to be played 3rd person. the physics of this game do not corespond with 3rd person controles. the aiming is off by a whole hit box and the frame rate is shot way down. the over way the game opperates is like being drunk riding a skate board while juggling pistoles made of paper trying to shoot your way out of a bad sittuation. 3/10 dont buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful. It has great potential to be an awesome zombie survival game, but there are never any updates, to date I've only seen one. The controls are not user friendly at all, the fps is terribly slow, and the characters movement and fighting only help the zombies in their attempt to eat you.  Pretty sure this was an attempt to make quick cash and bail. Save your money",
            "review_score": "-1"
        },
        {
            "review_text": "For me this game is more enjoyable than How to Survive... but wait. It's a graphical remake. It is exactly the same game story and all as 'How to Survive' but only in 3rd person. For this reason it has more of a 'State of Decay' look and feels better and controls slightly better with my Xbox controller. A really fair price for a Zombie apocalypse game with nice graphics and decent gameplay. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I owned 'How To Survive' on both PS3 and PC. Loved the game, but I have to admit I found it boring after a while. I just purchsed the third person version and it just feels like a much better overall game. I only paid $2.99 for it since I had the original version.  It's a lot of fun to hunt zombies, deer, go fishing, start campires. Check this game out and it's a great price!",
            "review_score": "1"
        },
        {
            "review_text": "Never getting really far in the original version of this game, i must say, HTS 3P is definately a grab. If you were one of the people who didnt like the camera view in the original, or is looking for a good zombie/crafting game, this is for you. However, it definately is a Progression by Error type of game...Unless thats just me. Playing on normal and having 2hrs in the game, ive probably died about 10-15 times, but because the checkpoint system is set up how it is, you are able to load the checkpoint, and basically be right where you died, except BEFORE it, so you can have a chance to do something else. The crafting in this game seems pretty awesome. I say 'seems' because ive only crafted a shotgun so far, but have the ability to craft molotovs, medpacks, and bows/arrows, also, there is a cutscene that shows the seemingly limitless possibilities to craft numerous types of weapons. I can't review the graphics or performance of the game, simply because im running it on a ♥♥♥♥♥♥ laptop on lowest res and low quality, but it runs smooth just based off that XD.   TL;DR : Pick up this game. Lots of crafting. Progression by Error WITH great checkpoints. Addicting.",
            "review_score": "1"
        },
        {
            "review_text": "Graveyard simulator. 10/10 would look at graves again",
            "review_score": "1"
        },
        {
            "review_text": "While this doesn't live up to the original as much, I think it's definately worth the $3 I paid for it, sunk a few hours into it so far and it's quite fun. Still prefer the original though as the combat is far more polished. Here's why: -&gt;Crosshair doesn't seem aim to where you're actually shooting with ranged weapons. (either that or there is some serious bullet spread. -&gt;Sometimes headshots don't work, other times headshots happen when you think it's going to miss. -&gt;Zombies get stuck quite alot. -&gt;Had some weird screen glitches during combat. (flashing bars which went away after alt-tab)",
            "review_score": "1"
        },
        {
            "review_text": "At first, this looks like a good idea: take a good Top-down Hack-em-up and make it Third (almost First) person and it should be good, right?  No. Not at all. This game does not translate well to a 3d-perspective. Playability is dismal and leaves one wondering what is wrong with their keyboard. Targeting and striking is not precise and requires a fair amount of guesswork. You almost get the enjoyment of playing a game while being drunk, but without being intoxicated at all; it's the game, not you. The remainder of the game feels like a shadown of How to Survive or rather a beta test that needs work.  BUT... that's not really the problem with this putrid game.  Do you like Lagzilla? Do you? I don't. I could understand frame-rate issues if the details are set high and the PC is not up to it. However, a significant delay between pressing a key or button (1/2 second or more) is simply inexcusable. It is not limited to movement or attacks either, this wonderous feature also applies to mouse movement, rotating the camera, and even, as an added bonus, navigating the menu! Want to exit the game and be done with it? Well, be prepared to fight the interface to be free!  One of the charming aspects of this games 2d predecessor is the witty animations and narrations, subtly echoing the inane deliruim of the Pip-man character from the Fallout series. While these ran perfectly fine in that title, they don't here. Instead, we partake in a garbled mess of interlaced vomit smeared across the screen. If you think changing settings will fix this, think again. Perhaps you're the ingenious sort who fiddles with his computer and updates video codecs with great skill and precision. Well, fooled you twice, no dice for you! Perhaps you can just watch the original videos on some Youtube Lets Plays and fast-forward to the needed footage. It's not like you paid for this game or anything.  It's sad, really. The publishers did fair job on this games predecessor, How to Survive: Storm Warning Edition. It wasn't perfect, it wasn't even a 8/10 title, but it was acceptable, fun, and (most importantly) FUNCTIONAL. In this version, while we get to get a annoyed-parrot's eye view of the action, the daunting task of making the game work properly was clearly not a priority. In fact, it wasn't even on the list... not even the To-Do-When-Everything-Else-Is-Done List.  It dissapoints me to pay money for a game and find that the publisher has taken an 'Up yours' attitude towards its customers. The development clearly went straight from alpha directly to publication. There is no excuse for this rubbish.  Do not buy this game. Look at the screenshots, smile, and wonder 'What if?'. In fact, don't even accept this title for free or as a gift.  -2/10 (yes, that's a Negative two)",
            "review_score": "-1"
        },
        {
            "review_text": "No multiplayer. I bought this game only so I could play it with my friend like the original game.",
            "review_score": "-1"
        },
        {
            "review_text": "Well i've only played a little bit of the game but otherwise it seems good, I wish it was coop but as I was checking it out there has been no sight of multiplayer, but then again this game came out like right now",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't stand this. Game is misrepresented. I had never played the original (and now i'm glad of that) so I expected to be able to walk freely through the world and jump over stuff etc...NOT in this game. It is on rails. You can only walk on the path sometimes having to go 180 degrees the opposite direction of where you want to go to find the path. Enemies are not wandering the map they are along the side of the path. This is fine for some but I hate those kind of games. Only reason I'm giving it a bad review is that from the videos and game description none of this is made clear. Games should be like those drug commercials  you see on TV that spend 3/4ths of their airtime listing all the things wrong with their product and who should avoid it.",
            "review_score": "-1"
        },
        {
            "review_text": "still same like the original , but it worth if u just looking for another prespective from this game . but i think its better play the original one , because the camera will help a lot then this one .  having camera prespective from back its really hard , because those creatures will attack u from all direction . and the annoying things , when night come u have watch your back all the time ,",
            "review_score": "-1"
        },
        {
            "review_text": "The story its same but the graphic its nice!",
            "review_score": "1"
        },
        {
            "review_text": "This game says its a multiplayer buy u cant play online it only shows other players death spots.",
            "review_score": "-1"
        },
        {
            "review_text": "I started off liking this game, but that quickly turned to dislike as I progressed further. The enemy spawn rate is bad enough by itself, add in the food, drink and sleep requirements after visiting 'Kovac's' island, the game became an exercise in fustration for me. At the very least, allow clearing of an 'Island' of zombies and don't respawn them until you leave and return.",
            "review_score": "-1"
        },
        {
            "review_text": "this kinda breaks the game, it sucks refund please. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's good.",
            "review_score": "1"
        },
        {
            "review_text": "There's this weird glitch where on the tutorial island it was like 'food is everywhere go get it' and you get the food and you're like okay cool so you go to the second island and you die in like 10 minutes because there's like 500 zombies everywhere and no food to be seen. I'm not really into that. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "cant get past the FIRST main quest. for some reason you cant kill the zomvies without a stick as a weapon and you cant talk to the guy until all the zombies are killed so there in lies the problem. for $4 may as well buy it and maybe they will fix the problems.",
            "review_score": "-1"
        },
        {
            "review_text": "sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics that look like a Nintendo 64 and boring, repetitive gameplay. I would get a refund except it only cost 99 cents on sale. Still too much.",
            "review_score": "-1"
        },
        {
            "review_text": "Not co-op.",
            "review_score": "-1"
        },
        {
            "review_text": "This is ♥♥♥♥. Graphics are horrible, shooting is horrible and multiplayer lack is horrible too. Total money waste.",
            "review_score": "-1"
        },
        {
            "review_text": "BORING, cant even light i fire i got the skill and says i must have the skill to light a fire.",
            "review_score": "-1"
        },
        {
            "review_text": "No multiplayer, and buggy as ♥♥♥♥, not a fun game... for now",
            "review_score": "-1"
        },
        {
            "review_text": "Why the ♥♥♥♥ i buyed 3rd person it's the same game :( :( :( :(   JUST WAST MONEY!",
            "review_score": "-1"
        },
        {
            "review_text": "How to Survive is your quintessential zombie slaughter and escape style of game. The game takes place on a tropical island upon where you wake up on the beach surrounded by 'zombies' of various makes and models. You must then fight your way through the undead and the elements by crafting, looting and clearing. The idea holds up pretty well, even in the dirge of zombie-themed survival games simply because this one has more of an action-adventure feel. It's fast paced, gives you plenty to shoot at and crafting is simple and intuitive.  The survival mechanics are pretty basic: drink water, eat food and get some sleep/caffine each day. There's not much to it and it's pretty forgiving so I'm not sure it really adds much to the adventure, but at the same time it doesn't detract from it either. The crafting, on the other hand, is actually done quite well. Instead of a 'gather materials/find bench' approach, you actually combine parts into the finished product. I really like this approach. You don't put items in a grid or follow a recipe, you simply combine parts until you get a finished product. The order you do so is usually pretty lax too, so it serves as both an intuitive interface but also as clever inventory management as most things can be broken down again. Since you are limited to combinations the game accepts, it's perhaps a bit limiting since that serves as your guidance for doing so, but I found it more interesting than the typical crafting offered by other games.  The game itself is a 'update' from a top down twin stick shooter, and personally I think both versions work alright, though the world itself was clearly built from an overhead perspective so there is a conspicous lack of things such as indoor areas. Additionally there is a clear distinction between 'paths' and 'walls' and the perspective does make the island feel a lot smaller. However, the translation to 3rd person works. The biggest issue I ran into is simply trying to shoot an enemy very close to me. You'll absolutely want to switch to your melee weapons in these types of scenarios as the game does not have any aim assist, shoulder swapping or range compensation. It's a small hiccup though, I found it to be just as or even more enjoyable than the original.  The debate on whether it should be it's own product or a standalone aside, I think this game has gotten a far worse rap than it deserves, it's functionally and technically sound. It's recognizable among the endless hordes of similar titles thanks to some off-beat humor and despite being mindless fun, has quite a bit of content and challenge if you are up for the harder modes. If you are looking for a decent single player zombie survival experience with an action adventure feel, here you go: it's cheap, fun and not in early access.",
            "review_score": "1"
        }
    ]
}