{
    "app_id": 360940,
    "name": "The Mean Greens - Plastic Warfare",
    "release_date": "2015-12-08",
    "developer": [
        "Virtual Basement LLC",
        "Code Headquarters LLC"
    ],
    "publisher": [
        "Virtual Basement LLC"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Multiplayer",
        "Third-Person Shooter"
    ],
    "achievements": 24,
    "positive_ratings": 5043,
    "negative_ratings": 1370,
    "price": 3.99,
    "description": "Take part of history’s greatest battle of Green VS. Tan. Fight amongst and against others online. Jump, shoot and roll your way into victory with fast paced objective based gameplay. Sometimes the greatest battles are fought by the smallest of soldiers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/360940/header.jpg?t=1549931084",
    "minimum_requirements": "Минимальные: ОС: windows 7 Процессор: 2 GHz Dual-Core 64-bit CPU Оперативная память: 4 GB ОЗУ Видеокарта: DirectX11 Compatible GPU with 1 GB Video RAM DirectX: Версии 11 Сеть: Широкополосное подключение к интернету Место на диске: 14 GB",
    "recommended_requirements": "Рекомендованные: DirectX: Версии 11 Сеть: Широкополосное подключение к интернету",
    "reviews": [
        {
            "review_text": "My review so far....  +ve points  No OP players due to class/upgrading weapons/spending a ton of real money getting better things - everyone starts out with the same weapons, it takes skills to master them.  Lovely graphics and the maps look beautiful - sometimes there are a few things that spoil this... but 99% of the time it looks stunning.  Good clean fun.... you turn on, go into a map and just start shooting. I can see teams of five people, using team speak, really making something of this. I can see tactics etc being used to win matches amongst five friends.  There are a few different game modes... the one involving the fooz table is my favourite so far... basically you have to score a goal whiles killing other army men!!  Plenty more scope... I haven’t played loads yet... but i'm gunna suggest my mates get this so we can all have a go.  -ve points  There are only 5 people on each side.  There could be more customisation/weapons to make the game more in depth.  There could be a chat function so users with microphones can communicate if they want too.  I would love to see swimming and parachutes... but maybe I am greedy!  It is difficult to get a game at this point in time... although I do realise this is brand new and not many people have got it yet. (hence I have no really factored this into my score) ",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Just needs more people to play.",
            "review_score": "1"
        },
        {
            "review_text": "I was blown away on how amazing this game is, think army men on ps1 but online multiplayer, game modes and level design are so unique and my favorite thing about the game, awesome fun indie that will give you tons of entertainment!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Little Army Man Simulator Better Than Star Wars Battlefront!",
            "review_score": "1"
        },
        {
            "review_text": "DOA no matches this is a wast of money unless you get it cheap to idle for cards.  dear dev please add bots and i would gladly change this review.",
            "review_score": "-1"
        },
        {
            "review_text": "This game DOES NOT replace the old army men games of days past like Army Men 2 on PCby 3DO. It is a nice nod to them though and the game is a wacky fun shooter if you can find a aerver with people on it. This game is best suited to play with a group of friends for a casual or competitive fun time. (Music is also great in this game!)",
            "review_score": "1"
        },
        {
            "review_text": "Game is completely dead. Reinstalled this to find a grand total of 2 people playing. Averages around 20 maximum a day.   Just look at the Steamcharts page for this.  [steamcharts.com]   Sad because it was had potential but obviously couldn't get of the ground.  The actual game was a fun call back to the Army Men games, but it just really didn't have much to bring players back. This, combined with server issues and people having problems actually running the game seems to have killed this before it really had a chance. Heres hoping the team behind this can pull something out of their hat and resurrect this. It's a shame because they seem to believe in this title but just can't seem to get people 'in the door' in a manner of speaking.  RIP Mean Greens Dec 2015-Dec 2015",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of fun, no gimmicks, just evenly matched FPS with a decent number of maps - each with their own objective. Gameplay is not complicated, every soldier spawns with the same set of weapons. Ammunition is refilled upon depletion after a short cooldown. Most maps are team based, but there's at least 1 FFA at present. Each map has a unique goal and are laid out in a way that promotes various playstyles.",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty good, it only has a lot of the basic things a shooter must have though. The game modes are pretty good. A big downside of this game is that, unfortunatly, the servers are almost all empty. Every time i'm online there are only like 3 servers with people in them, which also have a ping above 300. But I would still recommend this game even though it has some crucial downsides.",
            "review_score": "1"
        },
        {
            "review_text": "  The Mean Greens: Plastic Warfare",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely recommend this game to everybody. one fatal issue right now is the fact that steam have decided to no longer make 4-packs ..meaning people will have to pay for this game at full price multiple times for their friends or have them pay the money. I know for a fact that people who want to play this would much prefer to buy it at a lower price seeing as bundles are no longer a thing. Or to have them pull their finger out and give us what we want. It's an amazing, fun, action-packed, goofy 3rd person artistic masterpiece filled with nostalgia and childhood wonders.  Most definetly a game to play with friends, online or privately, it's a perfect party game. With each of the classic 'green army men' weapons to choose from, you can flip between them all over without the need for time consuming class change. It also has pretty awesome and various game types, not the boring stuff like you get in repetetive dull games like call of duty or battlefront. Have fun with this for sure! It IS worth the money, so get it.. just try and pursuade either steam to give packs again or your friends to do the same.. Honestly..it's a game you won't regret as long as you get the numbers, the servers are suffering due to low playerbase ...no packs is the entire reason.",
            "review_score": "1"
        },
        {
            "review_text": "Are you a fan of some of the old Army Men games? Guess what, It's back! I really compliment the developers for the amount of details that are incorporated in the map designs. The unreal 4 engine really makes the miniature world come to life and it feels immersive. You're a little toy soldier in a world full of giant objects. When I'm writing this review the game does not feel complete yet, and there are a number of issue however this game shows a lot of promise. I'm confident that with further development and added content the game will gain a lot of replay value.   The price of the game is very reasonable for the amount of content you are getting right now, and it will only get better. Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Not a lot of people play it, so it might be hard to actually find online play.",
            "review_score": "-1"
        },
        {
            "review_text": "Why are you reading this and not buying it RIGHT NOW?",
            "review_score": "1"
        },
        {
            "review_text": "It fun, the musics good, needs workshop support and custom servers. also i wish the flame thrower melted you into a puddle",
            "review_score": "1"
        },
        {
            "review_text": "[Before you read this note that my english is not good..sorry :(]  1-First of all this game is really something fun to play sometimes the servers are empty but that doesnt really last for long I just start my own server and I wait 10 sec and people start joining  2-its devs try as best as they can to make the fans pleased they try to fix everything and even add more game modes  3-The gameplay is smooth and I haven't really met any hackers/cheaters yet  4-The game has 9 or 10 maps and each map plays different then the other If you you think this is COD with those plastic soldiers toy reskin then you are wrong each map has different objectives then the other and be 100% sure that you will at least find 4 or 5 maps that you will love out of those 9 maps  Now lets jump into a bit of gameplay  MAPS!:  1-BARNYARD BALL -F****** fun map that is huge  2-FISH TANK FRENZY you play in a fish tank you have to steal the enemy flag and bring it to you'r base [you can be stealthy if you want :D].each time you play this map you will dicover a new hiding spots your enemies will get rekt if they dont know where you are :D  3-BATHTUBE BASH Another huge map its a another capture the flag but its tons of fun   4-DEEP FREEZE You gotta melt a huge ice block same goes for your enemies but after that ? YOU FALL DOWN AND FIND 2 HUGE ICE BLOCKS!...each one has a dinasour make sure to melt the ice block and free your dinasour before the enemies  5-ART TABLE SHUFFLE THERE IS NO TEAMS IN THIS DUDE !!!! EVERYONE IS YOU'R ENEMY THIS IS YOUR TIME TO SHINE M8!!!!!!!!!!  6-TABLE TOP WARS 2 TEAMS BATTLING EACH OTHER. WHO EVER REACHS 50 KILLS FIRST WINS!  Not going to spoil the other maps WHAT ARE YOU WAITING FOR DUDE ? JUST BUY THIS GAME AND HAVE FUN!",
            "review_score": "1"
        },
        {
            "review_text": "Really insanely fun game. I think of it as a more casual game but its very polished with competitive aspects. When you think of toy soldiers or army men games you think ''what could you possibly do to make it more than CTF or DM?'' and they take that and completely smash through it. Different game modes that you HAVE to play to believe how unique and fun they are. Seems to be extremely well designed and seems to have a great team backing it. I would play this over all the major titles being released and its 1/6th the price. You can't go wrong. The graphics and gameplay are top notch, VERY beatiful art style. I could go on and on, try the game out you wont regret it.  My thoughts on a few game modes I really enjoy -  Kitchen run : You push over a cup and you will never have more fun doing so  Tabletop Wars : Team DM with an insanely well designed map  source : Streamer   twitch.tv/whatwhywhy ",
            "review_score": "1"
        },
        {
            "review_text": "Game is tons of fun, mixes the right amount of skill and sillyness to have an enjoyable time. Graphics are awesome, maps are really cool and game modes are interesting and exciting. My suggestions are create a multi pack for people to buy to gift to friends to grow the community.",
            "review_score": "1"
        },
        {
            "review_text": "Glad to see this on sale for the summer sale. (6/23/2016) The game is actually really fun, but the only problem is the lack of players. Hopfully this will get more people in the game and bring it back to life. :D It has alot of potential. I just hope the devs don't give up due to lack of player base. :(",
            "review_score": "1"
        },
        {
            "review_text": "Having alot of fun with this game. Player count has gotten better with the Linux and Mac build being out now.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for fun and played 2 hours straight... This game is my childhoods dreams come true! I love it even as an adult  I recommend this game for everybody who:  -liked Army Men  -played with little plastic soldiers  -has fetish about plastic things  -anybody who likes to play crazy and funny games  When developers add 10 vs 10 and fix joining problem its 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Mean Greens takes you back to your childhood in a way you could only imagine it. You play as Plastic Toy Soldiers on maps created with household items just as a child might put together for their Army Men Toys. The gameplay is flowing, fast, and very fun, with many creative maps and game modes to play on, there is Capture the Flag to Light the most Candles on a birthday cake with your flamethrower. Graphics are great and the feel of the game is just as amazing.   EDIT: The only real problem with this game is that no one plays it anymore. It actually makes me sad that such a simple, yet masterpiece of a game died off so quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Not only is the soundtrack awesome, the gameplay and artstyle is unique and so detailed. It's so worth checking out, it's one of my favourite multiplayer games which I want to play over and over again",
            "review_score": "1"
        },
        {
            "review_text": "Fast Paced Third Person Shooter, If you ever played any of the Army Men series and liked them, But want a modernization to it, This is the Game for you. Beautiful Animations, 10 Different Maps each with an eqaully fun as Beautiful looking enviorment.",
            "review_score": "1"
        },
        {
            "review_text": "Game is pretty cool but still needs to be cleaned up a bit. I am sure it will be. Each map has a different concept/ goal so thats pretty cool IMO. If you played Army Men: Sarges Heros on PSOne / N64 you'll like this game just for nostalgia. Its mutiplayer only as of 12/12/15. So don't get this game if you have crappy internet. Lots of servers but not always fast to find a game with decent ping on the West Coast of the USA / Seattle area.",
            "review_score": "1"
        },
        {
            "review_text": "Looks like a great game but unfortunately only works online. Since I'm not in the US, I can't connect to anything without lag. Unfortunate.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very fun with a surprising amount of match types. the gameplay is very fast pace third person shooter. The maps are small but fun and imaginative. As time goes on i hope they add more content including offline play.",
            "review_score": "1"
        },
        {
            "review_text": "The Mean Greens Plastic Warfare is an interesting game. It's a hidden gem on Steam, and for a multiplayer only title, that isn't good. The playerbase is so miniscule, you'll often times end up in matches with the same people. However it isn't hard to get into a game, and once you are in a game, the game is a blast. Right off the bat, you'll notice the visuals are amazing. Some of the textures could use some work but it's overall one of the better looking games I've tried, especially in terms of art direction and the creativity of this game's settings. The different maps are all distinct, vibrant and fun. The levels are based on different areas in a house each with creative objectives. There's one level that takes place in a freezer where you have to thaw out your team's dinosaur with your flamethrower before the other team, another map where you have to light candles on a cake and a level where you play on a foosball table to name a few.The soundtrack is also pretty memorable, if not a bit repetitive. This game is a 3rd person shooter, something we don't see often. The mechanics of the game are really solid, and the way the weapons are implemented. They basically run a cooldown system where you hold all 6 weapons. The catch is, if you use one too much the weapon will have to recharge before you can use it again, which also carries over after you die. This forces you to use a variety of weapons instead of running around with a shotgun or camping with a sniper for the entirety of the round. The gunplay is definately something I have yet to get used to but it's still a great concept and I can't wait to play more. A few gripes I have with this game, there are some maps where you are forced to platform which in a multiplayer only title can be annoying, especially when your internet hiccups which can make your platforming become imprecise. Another much larger issue is the lack of any depth. I'm not expecting much out of a $10 Indie game, but I really don't feel compelled to replay this game. The only replay value this game has is in the form of achievements, and nothing else. You start out with all the weapons, you can't change the look of your soldier, there's no singeplayer, there is only 10 maps all with unique modes, etc. Again, variety isn't a bad thing and when all the maps are catered to a specific mode they are overall higher quality. However this results in the game getting repetitive. Here's why I think the population is so low, there's nothing to come back to. Nothing to unlock and no secrets. Once you've seen all the maps, that's it. As much as I criticize the game, it's still being actively updated and the developers are pretty open to feedback, especially on social media. All of my issues can be altered in future versions of the game. Right now, for $10, I still think this game deserves a purchase. It's creative, bright, and fun with some really nice gunplay. For the price, it's one of the best on the market. If you're on the edge or want an shooter that you can really spend hundreds of hours on, I'd still wait for a sale to purchase this game. However, one way or another, you need to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game!! Very fun and is always a blast to play with friends!!",
            "review_score": "1"
        },
        {
            "review_text": "Toy story OAO",
            "review_score": "1"
        },
        {
            "review_text": "Woah this game is so much fun :D recommend it to everyone who loves multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "it is epic, some visual bugs but not annoying #childhood",
            "review_score": "1"
        },
        {
            "review_text": "Love It Very Fun Its A Blast!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The game is still receiving big updates (Dev hinted at vehicles soon, and I think they're still trying to balance the weapons out) but the basic mechanics are all here. The game is funny, has great music, and the levels are all very unique.   The basic premise of the gameplay is that it is online only, (no bots, no story) and each level has a unique goal. So it isn't like other shooters where you pick the game mode (death match, capture the flag) and then apply that game mode to your map. In this game there is one free for all level, a couple capture the flag levels, a couple base domination levels, etc. My favorite level is Barnyard Ball, where the soldiers are fighting on a foozball table and must push a giant ball into the goal.   On the downside, some the levels lack any kind of spawn protection, so you can run into situations where you spawn and die, spawn and die, spawn and die. This is typically less of a problem when there are more players at a time. But as other reviewers have noted, there don't seem to be that many people playing the game right now. Hopefully with the steam summer sale, the server population will increase. The game tends to be more active on weekends.   Mean Greens is at its most fun when the teams are evenly matched with a lot of players. It is meant to be a hectic game. Death counts for great players can still be pretty high. So don't feel bad if you die alot.  The combat itself is basic in a good way. There is no cover mechanic, there are no smoke grenades or flashbangs, you don't have to bust down doors. This isn't Rainbow Six. And that's a good thing. It's meant for a broad audience, it makes me laugh, and for the most part the regular community is good natured and fair.   I want you to buy this game, mainly because I want more people to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "So my buddy gifted me this game after watching about 10 minutes of a stream we decided we had to check it out since it's only $15, looks fun and gritty. I've only played for 55 minutes but I really enjoy The Mean Greens. It's fast and action packed, has tons and tons of maps (many of which I have yet to play) and lots of great gametypes. Has a nostalgic yet new feel to it. I absolutely love it. Kinda reminds me of Toy Story.  I know this game has only been out for a week but I can tell it's going places. I'll be playing it casually over the winter to see where this game progresses.   12/10 would spend $15 on it again.",
            "review_score": "1"
        },
        {
            "review_text": "It was tough to get it working due to some system issues on my sidem, but one of the developer's was kind enough to personally help me out, and according to my research throughout the discussion section, they do this all the time. Plus, the game is a creative and fun game that has a great mix of childhood nastagia and familiar shooter action. It really is a blast, and I'd recommend it for any looking for a fun game to play with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Ok so, I got this game for myself and my girlfriend. I played the old army man games way back when and was really exited, she just thought it looked fun. So, this is how the experiance went:  -Load in -Everything is really simple and easy to figure out -Get into a party with girlfriend  -Search for a game -Still searching -Still searching -Find a Free for all game -Game is really fun and enjoying game -Map changes to team game -1 person on other team is either ungodly good or has hacks and 1 shots everyone on our team -That 1 person sits by our spawn and racks up over 60 kills in a short game -That 1 person acts like a ♥♥♥♥ in lobby -Still searching for new lobby  Conclusion: Fun game at first, some annoying things (cant shoot in air), community is tiny and there are a good bit of ♥♥♥♥♥. It's fun but im kinda regreting the 20$ (10$ for each game). Its something I feel should be free and have some sort of ingame store. Needs a campaign or something more to make it worth. Will still recommend for the nastalgia though.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this is a succesful and epic game :). It has smooth experience and gameplay. Graphics are REALLY good, because it is made in Unreal Engine 4. The community is made of friendly users. All the maps look good and well-worked. This doesn't need something anymore, but I would love to play in First Person though.",
            "review_score": "1"
        },
        {
            "review_text": "I just saw that randomly in the recommendation list, and oh le ♥♥♥♥ thats prety nostalgic when you played the old toy soldiers game on the nintendo. And even outside of the nostalgia bit the game is really fun to play with some quite original gamemodes and whatnot. Can't wait to see future updates on the thing :P",
            "review_score": "1"
        },
        {
            "review_text": "Love this little indie game!!! Great presintation and awesome delivery.  Love the maps and the art style, this game has a bright future.  ",
            "review_score": "1"
        },
        {
            "review_text": "A nice game, will probably be short lived but lots of fun anyway. One frustration was that three of us on the same LAN could not connect to the same game to make a team. we had to play on seperate servers. It's probably something that'll be sorted soon hopefully but no support forum to tell the developers. Despite the connection issue I still recommend this game for the price.  The little time I have spent on this game has been great fun, the graphics are well made, the game runs smoothly on a fairly average PC.  ",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game its ♥♥♥♥ing amazing",
            "review_score": "1"
        },
        {
            "review_text": "10 vs 10 colorful chaos with one helluva nostalgia trip.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun, simple as that. Between the fun maps and music to go with you will have a good time playing this game.   However at the moment there are some gripes that need to be looked at, the biggest one is the difficulty in getting into a game that isn't already full or the host disconnects it currently take much longer than it should to find a game and actually connect to it, once you in tho the connection issues disappear.  Another is some maps feel a bit unbalenced or the objective to difficult to achieve due to the respawn rate and close respawn point of the enemy team. Last point maybe just me but the bazooka is a free kill and needs to some how be balenced. while you only get 1 shot per life and no good way to get ammo it still comes off to strong. A map summery should be available in game to know what we are supposed to do, tho to be honest is doesn't take long to figure it out is just a minor issue.  ~~~ TLDR:   Pros: -Gameplay -in game music -Maps are creative and feel new - devs are attentive, already 4 patches in 1 week to address community concerns  Cons:  -bazooka needs to be a bit more balenced (maybe reduced splash damage)",
            "review_score": "1"
        },
        {
            "review_text": "This game is simple , fun , nostalgic for anyone who played army men games. there are some current bugs the feature to swap teams for a balanced game doesnt work in a 3 v 5 game anyone from the larger team couldnt join the smaller team but the smaller team could join the larger one. rocket launcher is overtuned 1 shots anything within 8 yards of impact does no damage to the user so many just charge the enemy team and shoot down to kill everyone BUT themselves. assault rifle needs 1 of 2 things either a slight damage buff or an accuracy bump hip fire is terrible and aiming isnt that great on it. sniper is perfect how it is, only wish the ammo recharge was a bit faster. shotgun seems a bit random can sometimes 1 shot someone from 20 yards away hip fire but point blank while aiming its a 2 shot to the back and head, i think it may be better honestly if they lower the accuracy of the hip fire shotguns are supposed to be high damage bad accuracy but this one has damage, range and accuracy. grenade is allright will only kill people if there 2-3yards of impact i do wish for a longer cook time you only get 1 sec of travel time before it goes off so like the rocket launcher people charge and drop it at feet even if its set for 2 seconds would fix this charge tactic of people. flamethrower range is poor 10 yards at best damage is weak easy to avoid only used for freezer map really has no cd so you can just run and hold the trigger but it just makes you an easier to spot target. .do sort of wish there was a class system of sorts add in a few more guns, assault - standard rifle, add a pistol as secondary 10 clip 20 reserve make it a 3-5 shot give it a longer sprint pool, support - shotgun , rocket launcher , give him a temporary ammo resupply for team (but doesnt work for rocket laucher). medic - add a submachine gun 30 clip better hipfire then rifle but worse ADS/ pistol secondary with either a temporary health regen bag or allow them to revive a fallen teammate if its safe. sniper - larger ammo reserve for sniper rifle currently 6 would like atleast 12+ / pistol secondary give them mines since there primary weapon cant be hipfired. and let them be a spotter make enemy they wound temporary glow for teamates. These are all just examples/opinion and like ♥♥♥♥♥♥♥s we all have them.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game for ~2hours, seems really good so far. There's enough players to set up a good server, alot fun guns to use and everyone gets to play their own style.  Review on the scientific side: Hitreg seemed good, didn't miss anything I wasn't supposed to miss. No major bugs found, game rocked smooth ~200fps even with my mid-tier computer. Was smooth, no choppyness. Graphics are eye-pleasing, abit Toy Story-like, which was a good change from all these 'reality-looking' fps-games.  Suggestions for future: Add 'classes' so it's easier to pick what weapon you want to be using Scrollwheel-weaponchange should be instant, now you have to click mouse1 to change weapon.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game and well worth the price, just needs more players to fill up more servers!  Can't wait to see what they add in the future. Reminds me of Toy Commander and some old Unreal Tournament maps I used to play when I was younger.",
            "review_score": "1"
        },
        {
            "review_text": "A bit cheesy, but pure fun really. :)",
            "review_score": "1"
        },
        {
            "review_text": "i like it  pros: quick, fun, simple, no 'early access' bull cons: 'join game' button is broken, can't shoot while in mid air which is a pain in the ♥♥♥ on the fish tank level  overall: good",
            "review_score": "1"
        },
        {
            "review_text": "Like Toy Story, but with plastic gore.",
            "review_score": "1"
        },
        {
            "review_text": "If any game on Steam needs more love it's this one!  If you ever played the old Army Men games or generally like films like Toy Story or Toy Soldiers you'll likely enjoy this game for the novelty of playing as a small plastic army man!  There arent a whole bunch of features or maps in the game at the moment but for the price you'll get your moneys worth. The devs are gonna be releasing more maps and game modes aswell. All in all the game is pretty damn good to pick up and play in its current state, although lacking any sorta progression can get a little boring after a while.   9/10 boiss",
            "review_score": "1"
        },
        {
            "review_text": "So much fun. Just a very easy to play, casual, fun game to sit back and chill. No ♥♥♥♥♥♥♥t to deal with, no gimmicks...just shoot the army dudes.  Pro's: -The map and objective design is outstanding.  -Controls are tight and feel great. -Simple but very fun gameplay. -Looks and plays great. -By far the most pure fun you'll have in a shooter  Con's: -I only have one con to list, and it can make all the Pro's irrelevant. Which makes me sad...and that is the game just isn't very popular. I can get in matches, but the playerbase is tiny.  If you're mildly interested...buy it. These guys did an excellent job on this game. It just needs some support from the community.",
            "review_score": "1"
        },
        {
            "review_text": "Really a fun game, new and refreshing. However the servers are normally dead, not alot of activity on this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Fun and simple, and a lot of effort was put into it- especially with the environments and gunplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game whould be fun if more people owned it.  If... anyone owned it.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is fantastic, map design is great for most of them, and the devs are activily listening to the fans, 10/10 game so far",
            "review_score": "1"
        },
        {
            "review_text": "  I used to play Army Men on Playstation 1 and that was great. I hope there will be some optimization and multiplayer improvements for this because it lags but fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine the old Army Men games modernised with Unreal Engine 4, and you have The Mean Greens. A cool little game, not worth full price, but is definitely worth grabbing in the sales.",
            "review_score": "1"
        },
        {
            "review_text": "Can't recommend at all! No auto-team-balance (played this soccer game mode 1 vs 6, srsly developers?) , not enough players online (and no bots), weapon feeling can't be compared to 'real' shooters like Counter Strike. At least it was only one game of the bundle i bought...",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. However, there are already people who abuse weapons, such as: Bazookas Sniping from across the map with an M16 Sniping with shotguns FIx the stats. Also, I'm seeing reports of hackers ALREADY.",
            "review_score": "1"
        },
        {
            "review_text": "Really great jump in and play gameplay, the environments are absolutely goergous and since they are matched with a wonderful soundtrack the world is just a pleasant place to be in.  The game modes are tied directly to whatever map you are playing which I think is a good thing, because it feels well thought out and everything is very easy to discover on your own without the need of any sort of tutorial.  The first thing you will notice right away is that the menu is SLEEK, and this definitely helps make you like the game right off the bat. The menu music is pleasant, the sounds feel good, everything is laid out properly and easy to fined. Although its just a menu this is a huge issue for me with a lot of modern games, which for some reason often have horrible menu screens. So a big plus here!  Major positives?  - The world feels alive and the theming of every map puts a smile on my face - There are no balance issues that are presenting themselves after just a few hours of gameplay, everyone has access to the same 5 weapons at every point in the game. (Automatic rifle, with a lot of ammo and does mediocre damage/ Sniper with not too many bullets so you cant camp at the back of the map for long/ Shotgun that absolutely destroys up close/ Rocket launder that is a 1 hit K/O if you are at least close to the target, but only has 1 shot before having to wait a long time for another/ Flamethrower that is mostly used in objective game modes to light candles or melt ice, and has unlimited ammo) - The different modes are unique yet easy to learn, it took me and my friend only half a round of 'operation birthday' to learn how to light or defend the candles on the birthday cake.  - sprinting feels good, and so does rolling.  - You have a battery that shows the energy you have with jumping/sprinting/rolling all consuming the battery, which recharges at a good rate - Health regens after not getting hit for along time, but it seems to only regen back to 50. Which means you aren't useless after a single 1v1 but you aren't healthy either. - Grenades are fun to use but aren't strong enough to make you mad.  Negatives? - Had a few instances of losing connection to host, but im gonna go ahead and blame that on the fact that it was launch day. - The shotgun does not sound as powerful as it should for the one shooting it. What I mean by this is that it is easy to tell when you are being shot at by a shotgun, as you can see the spray and the 'ping' sound it makes, but for some reason when you are shooting it, there is little sound and since there is no screen shake of any kind its hard to tell if you shot it at times. (I think an easy fix would simply be to make the 'ping' sound a little more pronounced.   Overall Would definitely recommend the game, first impressions are a 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Cool Game",
            "review_score": "1"
        },
        {
            "review_text": "ehh... i'm mixed om this. I love the concept for this game. Play as little green (or tan) army men, and battle it out. Fight in places all around your house, ( bathtub, freezer, fishtank, ect) However, the gameplay itself is pretty lacking. Idk if it's just me, but i can't seem to aim for crap. (litteraly miss when i aim point blank with a shotgun) I also have the majority of the settings on low quality and the fps still doesn't improve too much ( i think i have a reasonable comp for this) and when i do, the buildings n such might as well be cardboard boxes. Like i said, love the concept, hate the delivery.   Score 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "An indy gem.  little hard to get a game going but the developer addressed the issues more or less instantly. Such a fun game.  would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "For the price this game is amazing. Good with friends so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "  Worst shooter I've ever played, I was actually kinda keen to try it, it 'looks' fun but believe me it is not.  The aim is all over the place and super sensitive and jolty which makes aiming impossible, you more or less spray, and if you turn sensitivity down it doesnt help at all it just stops your ability to turn fast. Trash. The jump is annoying and dumb its not smooth at all, i literally felt like a bunny slowly hopping around not jumping. If this was anything like COD or as smooth as cod feels, it would be good, hell maybe even fun but right now its trash and doest feel good to play, its a jolty piece of garbage. Oh and I have a decent rig and everything just stuttered and lagged too, which only added to difficulty aiming. I uninstalled this immediately. Good thing it was free. As it should be cos garbage is free. ",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, but servers are dead. Online community has abandoned it.",
            "review_score": "-1"
        },
        {
            "review_text": "no one ♥♥♥♥ing plays this game. ever. and it's a multiplayer only game.",
            "review_score": "-1"
        },
        {
            "review_text": "Sarge's Heros 2015. Just needs more players for online to be fun.",
            "review_score": "1"
        },
        {
            "review_text": "  fun and cool, this is definitly the game you want to play with many friends and make moments with them.",
            "review_score": "1"
        },
        {
            "review_text": "2 proov yur a man u must wip wib yur hand",
            "review_score": "1"
        },
        {
            "review_text": "Virtual Basement’s (Ark- Survival Evolved) latest game, The Mean Greens, does what a number of bigger games fail to do. While it may sound like some kind of Vegan juice drink, The Mean Greens is charming title that showcases vast amount of potential from a young developer.  The core concept is the classic battle between Green and Tan toy soldiers. Those little pieces of plastic, vaguely human shaped, that has entertained generation after generation. In this case, we’re no longer using imagination to act our play wars, we’re directly playing. From the outside, The Mean Greens looks like a cookie cutter third person shooter, and that’s partly right. The true star of show is not the gameplay, but the maps.    The Mean Greens is about as accessible as you can get. Simple third person shooting, no classes or perks. Variation comes in the form of different weapon types, allowing players to engage from what ever range they wish. It all works well, even if it can lead to some slight sense of repetition creeping in.  Virtual Basement have a clear vision of what they waned to The Mean Greens to be. Map design and concepts reflect the exact vision and themes that were desired. Each map is set in various parts of a typical house. Kitchens, table tops, bath rooms and even the fish tank. It’s nice little throwback to all the typical places we’d wage plastic warfare as children.    Each map has it’s own unique objective, from the classic to the crazy. Be it Free-for-all deathmatch or capture the flag, The Mean Greens puts a twist on it. The most notably of twists comes in the shape of the bubble bath battle for flags. Players are tasked with collecting flags dotted around a bath tub full of floating rubber duckies, with a giant octopus occupying the centre of the tub.  There’s also a play on foosball table in which players battle to push the ball into the opposition goal. Each and every map oozes with character and charm. It’s the little touches that go along way. From the popping of bubbles in the sink, to the haunting yet oddly catchy rendition of Operation Birthday’s ‘Birthday Cake’ song, it’s hard no to smirk when playing.    Presentation forms a key part of the experience. In order to get that true feel of playing with toy soldiers, the visuals have to be on point. It’s a testament to the craftsmanship and care shown by Virtual Basement that the game looks beautiful. The soldiers look amazing, almost to the point you swear you could pick them out of the screen. Environments blend real life elements and colour pallets similar to films like Toy Story, resulting in some brilliant imagery. Each maps has it’s own distinct look, feeding into the concept that this is what you used to think of when you were a child, army men in hand.  The Mean Greens only real issues come in the shape or some sever connection issues and the odd bit of balancing. Within a period of 4 hours, a number of disconnections from sever occurred once the match had ended. This issue was mentioned a few times in the in-game chat, suggesting it’s far from isolated cases. A minor niggle comes in the shape of hit detection and satisfaction. There’s times in which weapons feel like they should be hitting the target. Headshots tend to feel part luck more than skill. It gives the gunplay a touch of being rather floaty instead of satisfying.   Weapon balancing could use some work. One of the six weapons, the bazooka, is hugely overused by nearly every player in the game. The overuse of the weapon results in a number of modes becoming nothing but bazookafest, rendering other weapons slightly pointless. Additional weapons may be on cool down, but the regularity of death and respawns means you’ll be a victim of a rocket extra 30 seconds.  As a whole package, The Mean Greens is an admirable release. With 10 modes, 10 maps, 6 weapons and voice chat, it puts EA’s Star Wars: Battlefront to shame. Code Virtual Basement can be proud of what they’ve produced. It may not be packing all the fancy tricks and frills of other multiplayer titles, but it sure is packed with charm and sheer enjoyment. For less than £12, it’s hard not to recommend The Mean Greens, even more so as a nifty Steam stocking filler for Christmas.      ",
            "review_score": "1"
        },
        {
            "review_text": "a really good game, have some bugs but its a new game.",
            "review_score": "1"
        },
        {
            "review_text": "buggy, empty, feels like ♥♥♥♥, plays like ♥♥♥♥  even though it was a humble bundle, i want my money back from those charities",
            "review_score": "-1"
        },
        {
            "review_text": "Its Good",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun, though I will getting a refund, it's just pretty dead at the moment. With some better advertising hopefully more people will start playing and I'll repurchase but at the moment I'm seeing pretty dead servers. Also I don't like that everyone starts with all weapons, I think there should be a pickup system, particularly for powerful weapons like the rocket launcher. Also I don't get why there isn't a melting flamethrower animation when even the PS1 games had it. I still recommend this game because it is very fun and relatively inexpensive but there is room for improvement.",
            "review_score": "1"
        },
        {
            "review_text": "Fishtank Frenze is the New Facing Worlds.",
            "review_score": "1"
        },
        {
            "review_text": "The Mean Greens - Plastic Warfare  + Funny game and wonderful idea. + Cool maps and weapons - Not able to change my settings like movement. - Was laggy at the beginning, had an awful quality and a bad mouse sensitivity.  6.5/10 (would love they fix the movement settings)",
            "review_score": "1"
        },
        {
            "review_text": "Its a really good game but the bad thing about the game is 1.I want more people to play and most of the servers are in a desert and 2. I want the soldiers to melt when killed by the flamethrower.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious, with simple and intuitive controls. Brings you back to the old N-64 days and your childhood when 'ARMY MEN' was a bigger label than it is now.  This is not the kind of game to take seriously, ever. It's fast paced, cartoony, glossy, and filled with fun. The only downside is lack of players and lack of dedicated servers, so peer to peer and individual server hosting is necessary.",
            "review_score": "1"
        },
        {
            "review_text": "very good game but no player base",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun And i love the soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "The green means is great game - It's a fun twist on traditional shooting games. All the gamemodes are fun, immersive, and exciting.  Pros:  +Fun gameplay  +Great soundtrack  +Amazing graphics  Cons:  - no local multiplyer or offline play ( i.e COMs) - Weapons need balancing - no character customization - no weapon upgrades/mods  Overall Its a great game, but it feels very lacking in it's content. 7/10",
            "review_score": "-1"
        },
        {
            "review_text": "amazing game sucks if you dont live in the USA servers are non existant",
            "review_score": "-1"
        },
        {
            "review_text": "i just cant enter in any american servers, idk if there's any ping restriction but i cant.",
            "review_score": "-1"
        },
        {
            "review_text": "Add a bot mode to this dead game already.  Can't believe it's priced at S$10.50, thankfully I got it in a cheap humble bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game for my Macbook Pro Retina running OSX El Capitan 10.11.6 (2.4ghz i7 w/ 8GB Ram and Nvidia GT 650M 1024MB Dedicated Graphics card). Just downloaded the install files (approx. 2.4GB in size) and got ready to play the game. It goes through the welcome screens, then gets to the screen with the army man loading on the bottom right, then changes to another screen with 2 lines (1 top of page, 1 bottom of page) and the entire section between is blank. That's where it hangs... So can't play the game... The only available option is to quit the game. Lame :(",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game ruined by awful multiplayer reliability.   IF you buy this game have fun trying to play online as almost every dedicated server is extremely broken and you will mostly likely disconnect every game you try to join.",
            "review_score": "-1"
        },
        {
            "review_text": "Weak gameplay. Maps that force you to use slow and pointless 'death zones'.  Overall, Not worth it. Get *anything* else.",
            "review_score": "-1"
        },
        {
            "review_text": "amazing game when it first came out, but people quickly forgot about it so the servers are all pretty much dead, If they had included split screen, i could definitly see myself playing this with friends on the couch ",
            "review_score": "-1"
        },
        {
            "review_text": "Maps are very linear, mostly objective based, although very creative in looks, not very creative in play, nor very fun to play.   Weapons are unbalanced and feel very flat to shoot. Main issue is that you get them all, fully loaded ready to go, at every respawn. So the rocket launcher is basically the main weapon to use, and annoyingly get killed by every 40 seconds.   I was really hoping for something similar to the old army men 3d games. Bigger maps centered around childhood imagination with vehicles and humor. This is unfortunately another generic twitch shooter like the rest.",
            "review_score": "-1"
        },
        {
            "review_text": "What a load of ♥♥♥♥! Yes!..  No players, and wont even load up half the time.  Great Idea for a game just badly executed",
            "review_score": "-1"
        },
        {
            "review_text": "Battlefield minecraft in third person",
            "review_score": "-1"
        },
        {
            "review_text": "Plays like a quake 3 rip off but 3rd person with a roll  Edit: Look at the average playtime of reviews, it seems 90% of people can't break 4 hours in this game. Not worth the cash",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best FPS game ever made! its literally the only game ive streamed since ive bought it. if youre unsure on if you should buy this game then head over too  www.twitch.tv/waflaladdin  and watch how much fun it is &gt;.&lt;",
            "review_score": "1"
        },
        {
            "review_text": "this game has the worst net code issues i have ever scene in gaming history and the only weapons that work are th sniper and rocket",
            "review_score": "-1"
        },
        {
            "review_text": "It looks really promising but there's terrible spawn camping issues, the flamethrower is incredibly over powered, and using these two you can kill someone in less than a second from spawning. Not fun. Fix the spawn balancing.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate to say it but this game is pretty bad. This is the first time I completely regret buying a game. I really wanted to like it too since the theme really grabbed my attention, a jolly, fun casual game but there's just so much missing. And the game isn't even early access; it's a complete game that needs work which is disappointing. First of all the matchmaking is ridiculous. There shouldn't be so many complications to simply find a game that you'll play on for only 5 minutes. The hit detection doesn't feel right either, especially if you're used to playing legit shooters; you will not settle for this game. Just keep that in mind. Despite the good reviews which I hoped I would agree with, you will realize how bad the game is if you're used to playing high end or popular games. And keep in mind, the game is boring and on top of that, they didn't implement any reason to come back to the damn thing. No ranking or levels, no unlocks, no challenges, nothing. What gives me any reason to keep playing if it's not fun in the first place.    Add some kind of reward system so the players can put however many wasted hours they played into use. After playing a couple games I gave up; I might go back one day if I'm really bored or want to give it a second try. Until then I'm hoping some improvements are made and then I can possibly enjoy the game. Maybe I didn't give it enough time to grow on me, who knows? Either way I spent $10 (on sale) on a game I am not satisfied with, and it's fine that my money is gone but please don't waste others' as well. Drop it to $5 or less, considering that's the most it's worth. I'm really hoping the developers know there's a ton to change with this game, if they don't realize then it's pretty much going no where.    I suggest you high-expectation players out there pass on this game and allow it to get better even if you have to pay more later on. It has lots of potential but that doesn't change the fact that right now it's horrible. You'll be able to tell within the first few minutes of playing, a sense of just.. disappointment. It's unexplainable but the game does not feel right at all. and for $10... I'm trying not to remind myself...but yea go spend that on a few csgo cases. Peace.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  Cheap - only 9.89 on sale Childhood nostalgia - if you were into the whole army men thingy Interesting artstyle  Cons: Shallow gameplay mechanics - more shallow than EA's Starwars Battlefront Weird sensitivity issues with ADS Lacking server browser filters Janky netcode and hit detection  Can't shoot while jumping  How can anyone screw up so badly on Unreal 4 engine... ",
            "review_score": "-1"
        },
        {
            "review_text": "WORST ♥♥♥♥ING GAME IVE PLAYED. It made my ♥♥♥♥♥ fall off and crawl away. I had a better time licking the rim of a homless person's ♥♥♥ hole.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is really funny and the ideas are originals maybe the price is high... But the main problem here is that this game is dead, servers are empty and it's really difficult play it since there isn't a single player mode. I raccomand you that the game is good but only if you have friends that play it without is just a waste of money, considering this game was launched on december and I say this in may, the situation it's very ridicolus-",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept, flawed execution!",
            "review_score": "-1"
        },
        {
            "review_text": "Now that I am finally able to join the game after the first few days of launch and the terrible server connection issues there are still major flaws with this game.  First off, hit box detection is terrible. I mean really bad. I even went as far as starting games with friends and having them stand still. Aiming right at my friend and firing and not a single hit. Its bad. Also with hit detection there is very little to no visuals when you actuall hit a target, no sounds just a little pulse of your crappy cross hair.  The second major issue is map balance. Most maps are bascially tug of war style. When one team can push forward, the losing team will usually fail. Spawn times and points are weird on most maps making half the map you running and running and running while only actually engaged in combat for seconds before you either die or kill off the few enimes.  Visually, the game is fantastic. Along with great sound tracks makes for one of the great pros of the game.  It's not the worse game out there, but needs some polishing work before I would even call this out of beta process yet. Way over priced for what it is. I wasted money on a game that should have been considered early access at half the price. Already tried to play it enough to like it and went over the 2 hour window for a refund which is my fault.",
            "review_score": "-1"
        },
        {
            "review_text": "Seemed fun, was actually ♥♥♥♥. Refunded.",
            "review_score": "-1"
        },
        {
            "review_text": "crashes whenever I search for a game  and I got this ♥♥♥♥ing thing out of a humble bundle so I can't even refund it  f a n t a s t i c",
            "review_score": "-1"
        },
        {
            "review_text": "[ The Mean Greens Personal Review by Shwifty].  So far here are my concerns with this game as of late. Number one is the insta kill of the flame thrower. i get thaqt were plastic and plastic melts. but when the tiniest bit of the flame touches you or even touches you when you know you are out of reach and die already is already a problem at best with that and should be nerfed down to not instant kill someone. kind of unfair and wonky and janky when used by player's. Number two, the rocket luancher everyone complained about before it got turned into a ♥♥♥♥♥♥♥♥ rubber fetish of a missle. for one, a missle is sapose to explode after when luanched from the rocket. its a point and shoot. what the rocket has turned into is a point and shoot and the missle move-hops you to the left and not kill the person you aimed at hoping to gaina kill. Thirdly is how toxic anf dast the commute has grown since this game became a thing. you should find a way to implament mature content to fixed content meaning, those who choose to be and play immaturely should be on their own server where those that want to play the game to actually play the game for what it is and what its meant to play as on the normal server's. its stressful or stressing when your trying to play and enjoy the game for what it is and all you see is immaturity on all and past all level's past common sense. fourthly, the level fish tank needs alot of work, half of the maps environment actually kills you before you get to do anything because you have to jump so ♥♥♥♥ing much and you run into the environment and it slides you off the map and into the sand on the bottom. kind of unfair and frankly ♥♥♥♥♥♥♥t. Also people have said vehicles are comming to this game, i hope that is true but to compinsate the land velhicles you should make an acual large open map to play on and not one large area thats box'd in and you can tell thats box'd in from forced wall's keeping you out. Lastly i belie ve the game makers of this game should make an auto delete for all the 0/10 or 0/10 pretty much all the empty servers not a thing anymore. majority of the servers are all ut half and are totally empty 100% and not in use. should only make it so the server list has active only server's. this game is fun and has a chance to be great, but all of it needs to be extremely taken seriously and worked on more and not continue to have the things i listed. all in all atleast a 3/10 for the time being.",
            "review_score": "-1"
        },
        {
            "review_text": "has it's moments of pure joy. great army men vibe.  BUT  1) can't change shoulder camera, which is crucial for every 3rd person shooter 2) can't shoot while in the air. why? 3) limit on runing duration. WHY?  this is just too frustrating for me. maybe YOU would ignore these issues and enjoy the game.",
            "review_score": "-1"
        },
        {
            "review_text": "What a game! I cannot do anything but reccomend you not to buy it. What a waste of money.  Gameplay is actually somewhat fun, but the matchmaking system is the same as HL2. Finding a server takes hours and when you finally find one that does not have 400 ping you cannot connect for some stupid reason.   1/10. You get tired of playing after 15 minutes. Its repetitive and boring. Only reason why I played 1 hour of this is because I have exams in entry level geology next week and Im heavily into procrastrinating.   ",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is quite fun, if you have over 6 FPS. I have an i5 and can run most games on medium level grpahics. I set the graphics, motion blur, everythong down to the lowest possible setting and I was maxing out at 6 FPS. Only buy if you have a beast of a PC.",
            "review_score": "-1"
        },
        {
            "review_text": "refund asap",
            "review_score": "-1"
        },
        {
            "review_text": "2/10 complete waste of money! highly recommended for under 12s. if you enjoy csgo,cod etc. dont waste your time here like i did.",
            "review_score": "-1"
        },
        {
            "review_text": "The concept alone is great and brings a lot of potential for fun game modes and map designs however some things could be better.  The modes are probably the biggest highlight as it's what keeps the game interesting. They also did well on the map designs although I feel are a bit small in some modes. Not a lot of active players (I usually see about 5 servers with active players).  What I feel really needs improving is the feedback when aiming. Aiming and shooting reminds me of GTA where there's next to no feedback when aiming (no highlighting or change in crosshair to signify that someone is inside the crosshairs) which is fine for a game like GTA but not a dedicated TPS.   Despite this, I'm still having a lot of fun with this game and at $14.99USD ($9.89USD on sale) it's worth adding to the collection. ",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of the Army Men 3DO Sergant Heroes Days, I love this game because it made me feel like I was back in my childhood. Don't get me wrong I got this game on sale, which you should, but this game needs some work. LOVE this game though...",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game. It runs very nice. The dev team is also comimited to fixing any bugs and adding new content. It's definitely worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ing game is ♥♥♥♥♥♥♥ mother ♥♥♥♥ing adorable and I get so much ♥♥♥♥ing aesthetic pleasure and nostalgia from when I played the ♥♥♥♥ out of Army Men Sarge's Hereos on the MOTHER ♥♥♥♥ING NINTENDO 64 ENTERTAINMENT SYSTEM AND HOLY ♥♥♥♥ THIS IS JUST SUCH A FUN MESS AROUND GAME JESUS ♥♥♥♥ IT LOOKS GOOD FEELS GOOD IS UNIQUE AND I ♥♥♥♥ING REALLY LIKE IT.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would get PTSD from reenacting D-Day in Bathtub Bash again.",
            "review_score": "1"
        },
        {
            "review_text": "Was always a huge fan of the old Army Men games- if you liked Sarge's Heroes, then this is right up your alley. Tons of harmless fun, catchy music, and surprisingly not too bad to look at. All guns are available to you right from spawn, so there's no real balancing issues to be addressed; just nonstop tuney plastic carnage.",
            "review_score": "1"
        },
        {
            "review_text": "RIGHT... IN... THE CHILDHOOD!, Seriously though for an early access game its alright. Needs a lot of work but with the proper amount of community and Dev support, I could easily see our guys in green make a glorious come back.",
            "review_score": "1"
        },
        {
            "review_text": "It's a blast. Hoping for more to be added. It's a great arcade game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game!! Definitely brings out my childhood of playing Sarges Heros on N64 back in the day, amazing casual fun gameplay! Easily can be picked up by anyone and have a blast!! Dedicated servers run amazing, and the devs are always making updates and patches to the game! Maps are amazing, and the music is the best ever! Such a blast and I highly highly recommend this game!!",
            "review_score": "1"
        },
        {
            "review_text": "Spawned next to 3 enemies, shot a rocket and killed all 4 of us including myself. Broken spawns/10 Game is insanely good though.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to just quickly jump on and screw around with your friends. The only complaint I have is some minor server issues, but other than that it's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "The Game is great but there are a few things missing here are some pro´s and con`s : Pro: -10 maps with 10 different game modes and everyone is a lot of fun -nice graphic -its cheap -great multiplayer game -good balancing -nice weapons  Con: -missing 'feedback' like f.e. you cant see how much damage you have done to the enemy that killed you also you cant see where the sniper is when you get sniped -if there would be bots in this game the game would feel more alive because at the moment there aren a lot of people playing this game -i would like to have a level system a single player campaign a tutorial and skins maybe  All in all i would rate the game 9/10 if those cons get added/fixed this game would be 10/10 So buy it !!!",
            "review_score": "1"
        },
        {
            "review_text": "If you have played Sarge's Heroes, you will enjoy the hell out of this. Stop asking questions and play NOW!",
            "review_score": "1"
        },
        {
            "review_text": "The Mean Greens is a really good game. The graphics are polished. Gameplay is balanced. Maps are alright but creative. Very energetic and fast paced game. Would recomend as a break from counter strike or any competitive game.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game so much &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "BUY YOUR FRIENDS THIS GAME. ITS ONLY 10 DOLLARS. Extremely fun. Needs more players though, and possibly a few adjustments on weapons. IE Snipers not being rewarding enough for chest shots and shotguns being too rewarding. 9/10 for the price and enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "CHILDHOOD REKINDLED",
            "review_score": "1"
        },
        {
            "review_text": "BUY YOUR FRIENDS THIS GAME. ITS ONLY 10 DOLLARS. Extremely fun. Needs more players though, and possibly a few adjustments on weapons. IE Snipers not being rewarding enough for chest shots and shotguns being too rewarding. 9/10 for the price and enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, Needs more maps though still very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very good gameplay and graphics but the crown jewel of this game are the maps!   Recommend it for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "It a good game that my Review",
            "review_score": "1"
        },
        {
            "review_text": "When you see this game you say '10 bucks? what is this, it looks awful' but then you play it and see that this is a simple game that is really fun just to sit down and play.    p.s. really good music for a $10 game also get it during a steam sale",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun and well-made game but no one plays it (at least in my region). So I cannot recommend it since I am not able to enjoy it anymore. I press 'play now' and nothing happens. Good program, poor management.  Also it has horrible translation (I am a Russian user). Why translating with google? Just leave it in English.    Original review:   Ok, already 7 hours played and still want the next round.  1. It is fun. And it is a good concept. No blood, no gore - suitable for children and sensitive adults (like me). Original maps. Jump on the jally! I like it. 2. You/them basically die (broke) after a few shots. That's fair and makes the game challenging. 3. Team work. It works here! You alone is not that powerful as you are with someone to cover you. However, there are deathmatch maps here as well. 4. Some maps are a bit raw. The train one. We've got Tans blocked at spawn. That was dull. So.. I hope there would be map tuning in the future. 5. I want a regime without rockets and flammers. Only rifles, shotguns and sniper rifles. More fun, better balance. 6. Shortcut commands like 'incoming' / 'hold' / 'go-go-go'? That would help to organise the mess. It is not easy to type the message and I do not want to use voice. 7. Hardware demanding on some maps (snow and underwater). I have a top PC. However a friend of mine experience real problems on some maps - like 5-15 fps 'slideshow' instead of gameplay. Normal fps on some other maps.  So - this is a very nice game.",
            "review_score": "-1"
        },
        {
            "review_text": "BUY THIS FREAKING GAME  I know you're looking at the trailer-video and going 'holy ♥♥♥♥, this game looks awesome! why do only 66% of people-' PEOPLE ARE IDIOTS, OKAY?! I went through the time of reading those reviews and this one other guy doing a good review has already said it; it's just a chorus of 'ded gaem!', some of them even going 'it's good and all but ded gaem dood!'. Maybe the devs should introduce bots, or do a 75% off sale even though this game is already half the price it's worth (no seriously, I know I would buy this game if it was $30 on sale for $20). You do that and what do you have? A game that's already nearly perfect, crafted with love and by people who know what they're doing, with people to play with!  Don't waste your time reading those negative reviews. Buy this game, it needs strength in numbers and I am only a 1, trying to create as many other 1s as possible with this heartfelt review  Buy this game  P.S. Buy this game  tl;dr Buy this game!  UPDATE: It seems this game hijacks the microphone, making it unusable in Steam voicechat. Big issue",
            "review_score": "1"
        },
        {
            "review_text": "the game feels unique the map level are ridiculous but so fun and new, the game does have a few bugs here and there may experience some crash but for 10$ you will get your moneys worth the game is fun and exciting it has the potential to give 100+hr of gameplay. Looking forward to dlc and more content.",
            "review_score": "1"
        },
        {
            "review_text": "addicting and fun can't wait for more content",
            "review_score": "1"
        },
        {
            "review_text": "I loved the OG Army Men games on PC. I actually still have them. When I came across this game and it was on sale, I had to get it. The game looks good, runs ok. Not as well as other more CPU/GPU intensive games that I own but I noticed it was a little laggy fps wise.  The big drawback for me is that there is an extremely low amount of players that actually play this game. I finally get it installed, start the game up and there are a grand total of 19 people playing this game. That's 19 people combined between 2 servers out of atleast 20 dedicated servers! The other issue besides extremely low game pop is the fact that you can't seem to join servers when the game started. I tried joined the 2 servers that had people playing. Even though there were space in both, it just sat on the joining game screen forever, only to find out that I'm not getting into the server and cancel joining the game.  I'll play this again when the overal game pop grows and it's a little more optimized so there is better FPS.  Overall it has great potential but with the issues I spoke about, I give this a 6/10. I gave it a +1 for nostalgia or else I'd say 5/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! Simple controls and easy to learn wide variety of game modes. It is all online, so those of you that do not like exclusively multiplayer will not like this game. Also, being an online game some people might have connection problems and issues with servers. However, I have not. Great game for a reasonable price.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Awesome concept! however suffers with a few connection issues when joining games and also benefit from adding more info to game about game types and objectives,",
            "review_score": "1"
        },
        {
            "review_text": "Best game. All I gotta say about it.",
            "review_score": "1"
        },
        {
            "review_text": "With the latest patch this game is very enjoyable. No more connection issues and gameplay is smooth. Brings lot of memories back to my mind and is fun to play. Straightforward gameplay with nice maps.  If I would add something to this game it would a game mode where the other side is defending and the other side is attacking and trying to take over a stronghold or a bunker within a time limit.  FPS with memories :)",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is pretty fun. Major Major Major server issues though. That alone doesn't make it enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "I edited this review, initially I wasn't impressed as this game had a lot of technical issues, but the devs have been really helpful and have been in contact, which is a rare thing indeed. The game works a lot better now, and I now realize how much effort has gone into this game.   At launch the game has a ton of different gamemodes and maps, which are all very nicely done, I can't blame the devs entirely, it's a small studio working on the game and I like what they're doing, even gave me a free code for the game after I got a refund. I'd play this more if it didn't freeze constantly but the devs are working on a patch soon.",
            "review_score": "1"
        },
        {
            "review_text": "PROS: - Graphics are phenominal. - Map design is refreshingly unique - All but one of the weapons seem to be balanced - Seems like a great game to play with friends  CONS: - One of the weapons you spawn with is a 1-hit-kill rocket launcher with lots of splash damage. Granted, you only have 1 shot in it, but it still messes with the balance of the game. That ♥♥♥♥ should be a power weapon that is picked up from the map, or at the very least the cooldown shouldn't reset when you die. - As of 12/12/15, the servers are ♥♥♥♥♥. It takes multiple tries to get into a game without an error message, but it does eventually work with enough patience, and once you're in it works pretty smoothly.  All in all, it's a great game with a few flaws that I believed will be patched soon. Plz patch.",
            "review_score": "1"
        },
        {
            "review_text": "Spawned next to 3 enemies, shot a rocket and killed all 4 of us including myself. Broken spawns/10 Game is insanely good though.",
            "review_score": "1"
        },
        {
            "review_text": "Everything you loved about Sarges Heros, all without hearing Vikki yell, 'SAAAAAAAARRRRRRRRRRRGE! HEEEEEEEEEELLLLP!'",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic. Reminds me of the 3D0's army men games. Gameplay is fastpaced and fun. Some basic appearance customisation would be cool even if it's just choosing whether you're the soldier with beret, soldier with helmet etc. Regardless, it's a brilliant game, well worth the asking price.",
            "review_score": "1"
        },
        {
            "review_text": "Really like this game :3 the gamemodes are really fun and it reminds me of my old fav game Army men c:",
            "review_score": "1"
        },
        {
            "review_text": "“The Mean Greens - Plastic Warfare” is a fun little shooter game that is the result of our imaginations combining Toy Story and Small Soldiers.  The maps hold a lot more detail than I was expecting and each map has its own personality and feel. There are several different game modes that give great variability and offer a nice twist on the shooter genre. Are you capturing the flag in a bathtub or fish tank? Maybe you need to light candles on a birthday cake (which is huge to these little guys). Or perhaps you are on a Foosball table and are trying to push the ball into the other team's goal while shooting at each other. It is the little things like that which warrant a tip of the cap for respect.  Pros: - The Unreal Engine is great for this (the flamethrower will melt you and the rocket launcher shoots your limbs off) - Great attention to detail in the maps and character models - Nostalgic and fun and plays pretty quick (longest a match can go is 10 minutes) - Good replay value - Refreshing and doesn't get stale or repetitive  Cons: - Some connection issues are there (Devs have said they are addressing it. Once connected to a server, I've never lost connection. Just initially getting in can be hard sometimes) - The hit boxes don't seem fully there at the moment (just need some fine tuning) - Weapon balance seems off (the rocket launcher was recently nerfed to help, but the flamethrower probably needs the same then) - The matchmaking can be hit or miss. I don't like adding ranks with experience and all but sometimes it just isn't fair  Despite the technical cons, the fun-filled pros still outweigh it for me. I like this as a nice casual filler if I only have 15 min or so to play something. In the future, I obviously would like the technical issues addressed, but for some maps a vehicle or object that can be used would be interesting to implement. I know the Unreal engine can do it, but it has to fit, not be forced.  Verdict- Currently a  7.5/10  and the potential to climb up to 8.5 if some of the technical issues I see are resolved. I definitely recommend this game and encourage you to stop doing adult things and go play with some toy soldiers.",
            "review_score": "1"
        },
        {
            "review_text": "It's a blast. Hoping for more to be added. It's a great arcade game.",
            "review_score": "1"
        },
        {
            "review_text": "So I bought this for $15, played about an hour, and next thing I know they've 'perminately lowered the price to $10!'  I feel kinda gyped...  At least the game is good though; just needs more players... Hey if you guys add a $5 DLC later down the line, will original buyers get it for free? ;P",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of the Army Men 3DO Sergant Heroes Days, I love this game because it made me feel like I was back in my childhood. Don't get me wrong I got this game on sale, which you should, but this game needs some work. LOVE this game though...",
            "review_score": "1"
        },
        {
            "review_text": "This is worth is purely for the soundtrack. I would buy it. So good. Gameplay is great, really inventive. Recommending it to friends so we can play. This is a great game for parents who want to bond with their children.",
            "review_score": "1"
        },
        {
            "review_text": "Still better love story than twilight",
            "review_score": "1"
        },
        {
            "review_text": "Remember 'Army Men: Sarge's Heroes'? Of course you do! It was a fantastic game! This is like that, if not better; but online with some Toy Story-esq flair. It's a ton of fun and looks phenominal! Only issue is there are very few active players recently, but that can be fixed. Be part of the solution! Buy The Mean Greens: Plastic Warfare today! It's defintely worth the (small) price.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game, very funny :)",
            "review_score": "1"
        },
        {
            "review_text": "A lot of effort has gone into recreating that classic 3DO Army Men feel and it's great!  There are no ♥♥♥♥♥♥♥t classes or perks or any other modern-shooter nonsense, it's raw plastic combat between Tan and Green!   The game could definitely use a Co-Op or the ability to add bots into matches to even the numbers, at the moment there is no auto-balance, so you could feasibly have a team of 5 versus a team of 1. Playerbase is a little low at the moment, but I attribute that to no bot-modes, if you have people playing bot matches that people can hotswap into, the numbers will grow.  Most of the negative reviews are about the lack of a playerbase, which is ♥♥♥♥♥♥♥♥ and not a good way to grow a game. Currently on the Humble Bundle for $1! Definitely worth the pickup.",
            "review_score": "1"
        },
        {
            "review_text": "iT DOESNT LET ME PLy BUT stEEl GuD",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. I bought a bundle for 3.56 euro containing 6 games and this was one of them. I bought amazing shooters for high prices this year (I won't say their name since I don't know if it consider unfair marketing and they are not on Steam), but from time to time I would rather play this instead of those.  The servers are populated. I usually wait 5-15 seconds to find a lobby. The teams are made of maximum 6 players on each side - green and tan soldiers. After a few games some players might rage quit and it would be better to leave and rejoin. The graphics are satisfying (Unreal Engine 4). There are many maps and each one has different game objectives. Some maps are labeled as 'Coming soon' so this game is still receiving updates.  To sum up, I totally recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "✘",
            "review_score": "-1"
        },
        {
            "review_text": "The Mean Greens - Plastic Warfare is fun once per map. I thought it was neat that there are no classes; rather, you are just an Army Man or Woman and you take out whichever weapon you need for the situation. However, that novelty and the novelty of the maps’ design wears off quickly because the game simply needs more polish. Explosions are unsatisfying. The music grates on you quickly. It just needed a little more love to pull in CounterStrike’s “rats” appeal.",
            "review_score": "-1"
        },
        {
            "review_text": "A regular shooter from the 3rd person perspective except that instead of blood there is plasic and there are scattered toys instead of war zone obstacles. Would recommend it for those who have a good taste for sillyness.",
            "review_score": "1"
        }
    ]
}