{
    "app_id": 36100,
    "name": "Tradewinds Classics",
    "release_date": "2009-07-17",
    "developer": [
        "Sandlot Games"
    ],
    "publisher": [
        "Sandlot Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 2,
    "price": 3.99,
    "description": "Travel back in time to a world of danger and mystery; a place where the open waters can mean anything but smooth sailing. Get carried away in these three classic installments in the acclaimed Tradewinds® Series. &nbsp; Sail, trade and battle with legendary heroes such as Sinbad in the mythical Far East.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/36100/header.jpg?t=1447352327",
    "minimum_requirements": "OS: Windows XP/Vista                    Processor: Pentium III 750Mhz or better(1.0 GHz Vista)                    Memory: 256 MB System RAM (512 MB Vista)                    Graphics: 3D Hardware Accelerated video card with 32MB Video RAM                    DirectX&reg;: 7 or above (10 Vista)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Buy low, sell high, and hope Port Authority doesn't confiscate your Dream Dust.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing the original Tradewinds a lot in middle school. I'm a lot better at trading now than I was then. Worse at combat though. Meh. Definitely good for killing a few hours if you can figure out the combat. It feels a bit poorly balanced to me but I'm probably just not trying hard enough whoops",
            "review_score": "1"
        },
        {
            "review_text": "Don't let my time fool you. When Sandlot Games came out with this game me and my father bought it, We played the crap out of tradewinds so we tried this one next, and then the next one. It might be dull to todays crowd because of the fact it is older, but for the people that played it since its birth, this game is great.   If you are interested in getting it, get it when it is on sale. Better yet get the collection, this franchies for Tradewinds is just that good.",
            "review_score": "1"
        }
    ]
}