{
    "app_id": 361160,
    "name": "Steamalot: Epoch's Journey",
    "release_date": "2015-08-31",
    "developer": [
        "Risen Phoenix Studios"
    ],
    "publisher": [
        "Risen Phoenix Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Card Game",
        "Steampunk"
    ],
    "achievements": 30,
    "positive_ratings": 9,
    "negative_ratings": 1,
    "price": 3.99,
    "description": "Steamalot is a medieval steampunk tactical card game. As a player you build a deck of characters, skills, and equipment. During a game players play characters onto a battlefield. Then those characters maneuver around the field in turn based combat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/361160/header.jpg?t=1488485787",
    "minimum_requirements": "OS: Windows Xp Processor: 1.6 Ghz Intel Atom or equivalent Memory: 1 GB RAM Graphics: 64MB video card Storage: 200 MB available space Sound Card: A working one Additional Notes: Network connection required for PvP",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game looked stupid. And then the first video - BARF! super cheesy. But a reference to Card Hunter (dig it) caught my eye, so against my better judgement I gave the game a proper look. The game 'sounded' solid, and the second video seemed to like it, so I honestly don't know why, but i bought it.  I'm shocked. Halfway thru the campaign and my impression is that It's good. It doesn't appear to have the same depth or polish as Card Hunter, but it's a worthy comparison. For me it captures the same engaging strategy thinking in ~15 minute chunks without being punishing or tedious.  Pro's: Price - It's well worth $4 UI - Easy to grasp and efficient. Adding extensive mouse-over text would take it from good to excellent. Tutorial - Sparse but effective. The 'pass' mechanic (npi) seemed gimmicky at first, but now I see at as important to the flavor of this game. Quality - The writing and card descriptions are sharp. No major bugs. Only one crash and it even told me why (failed to adjust resolution) and crashed gracefully. Gameplay - It's deep enough to not be casual, and simple enough to not be hardcore. I'm fine with the amount of RNG so far. PvP - Haven't tried it yet, but if anyone else is playing, i look forward to it.  Cons: Marketing: The first impression (before buying) was so bad that I'm afraid not many others will buy it. Graphics: I'm not a fan of the overall appearance. It doesn't detract from gameplay, but I find it amateurish. Reminds me of Dungeons of Dredmore which I also liked despite disliking the visuals.  Card Hunter fans should enjoy this, it's better than it looks,  Other dumb looking games that are fun: Srututu (RPG/board game - not on Steam) Bravada (Battle of Tiles/TBS)",
            "review_score": "1"
        }
    ]
}