{
    "app_id": 361380,
    "name": "World War I",
    "release_date": "2015-04-09",
    "developer": [
        "Dark Fox"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War I",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 100,
    "negative_ratings": 33,
    "price": 3.99,
    "description": "World War I is a real-time strategy based on the modified version of the well-known Blitzkrieg engine.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/361380/header.jpg?t=1553512720",
    "minimum_requirements": "OS: Windows 98/2000/XP Processor: 1,5 GHz Memory: 128 MB RAM Graphics: 64 Mb GPU with pixel shaders support Storage: 3 GB available space Sound Card: DirectX-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Most difficult strat game I've ever played. Everyone dies. Probably because it's historically accurate.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent top view RTS game with lots of action, and gore 10/10",
            "review_score": "1"
        },
        {
            "review_text": "very dificult rts really good.",
            "review_score": "1"
        },
        {
            "review_text": "When I first encountered this game it did look interesting to me but how it just looked on the preview pictures, the graphics did not look good. Also the lack of videos or images on the internet did not provide me enough information to purchase it. When it went on sale to $1.24 I thought I might as well try it out. When I first played the game I was surprised at how fun the game actually was. There are 3 different campaigns; The Entente, German, and Russian campaigns with a variety of misisons. The graphics are not the best but what would you expect from a 2005 video game and also the gameplay makes up for it. There is a little bit of historical innacuracy though, with tanks in 1914 but still, it is a good game. I highly recommend this game to any video game strategists that like the World War 1 era.",
            "review_score": "1"
        }
    ]
}