{
    "app_id": 361560,
    "name": "Ice Cream Surfer",
    "release_date": "2015-06-22",
    "developer": [
        "Dolores Entertainment"
    ],
    "publisher": [
        "Dolores Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Shoot 'Em Up"
    ],
    "achievements": 0,
    "positive_ratings": 10,
    "negative_ratings": 34,
    "price": 1.99,
    "description": "The evil Broccoli, irritated by the fact that kids hate vegetables and love ice creams, has created an army of vegetables to destroy the flavor galaxy. Only the Ice Cream Surfer with the help of his 4 super tasty friends can prevent that.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/361560/header.jpg?t=1456849875",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 / 8 Processor: Any processor with at least 1.0GHz Memory: 500 MB RAM Graphics: Any card with at least 128MB Storage: 500 MB available space",
    "recommended_requirements": "Memory: 1 GB RAM Storage: 1 GB available space Additional Notes: Unsupported video chipsets: Intel HD Graphics 3000, Intel GMA X3100, Intel GMA 950. This game is not supported on volumes formatted as Mac OS Extended Journaled (Case Sensitive)",
    "reviews": [
        {
            "review_text": "This is so cute &gt;_&lt;  feel free to play this game after work thats was fun!!   ",
            "review_score": "1"
        },
        {
            "review_text": "8bit retro shooter, 'cute' story but controller support is sketchy with a common Logitech F310, so I had to use keyboard. Still 10 minutes to get the one achievement gained after clearing the first level.  Cheap bundle game, and thats about it. 4/10 in a bundle for about 35c, but you will be unhappy at $2.99.",
            "review_score": "-1"
        },
        {
            "review_text": "I played it once for about five minutes and didn't like it a bit, but it somehow gave me the 'completed game' achievement and became my first perfect game on Steam. I had to go through each and every one of my 200+ games' achievements lists to find that out  Easy 100% I guess, but man is it boring. Sorry devs, but you struck out hard on this one.",
            "review_score": "-1"
        }
    ]
}