{
    "app_id": 361970,
    "name": "Weather Lord: The Successor's Path",
    "release_date": "2015-05-07",
    "developer": [
        "Yustas Game Studio",
        "Alawar Entertainment"
    ],
    "publisher": [
        "Buka Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Casual",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 17,
    "negative_ratings": 9,
    "price": 3.99,
    "description": "Rebuild a devastated land, save your people from peril, and face off against an array of bizarre enemies in Weather Lord: The Successor's Path, a captivating time management epic! Play clever and play quick, and victory will be yours!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/361970/header.jpg?t=1522330085",
    "minimum_requirements": "OS: Windows XP Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 256 MB 3D graphics card DirectX: Version 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Weather Lord: The Successor's Path is a casual action puzzle game with a time attack element. Game play is very similar to Rescue Team 1 (by the same publisher 'BUKA Entertainment'). Your uncle has lost a sacred heirloom which has the ability to control the weather. You are required to assist with rescue and repair missions across the lands as you build houses, sawmills, lumber mills, foundries and other buildings. Along the way you will train or rescue workers to assist you. You will train brave knights to kill monsters and send workers to destroy monster lairs.   There are treasure chests which require keys, temples that need repair and mechanical devices that need to be repaired before rescuing innocent victims. Along the way to expanding your search in the kingdom you will meet a variety of beasts and challenges. You even have to bribe toads to allow you safe passage!  The art style is cartoon like and has a cute factor. The game plays perfectly at full HD 1080p resolutions.  The music is soft rock 'laid back' midi sequenced. Although repetitive sound loops are used the music is unobtrusive and pleasant easy listening. In game sounds are soft clinks and chinks and somewhat understated :)  Game play is fun and simple and gradually eases the player into more complex puzzle scenarios. Players can re-select any previously completed stage should they feel they could improve on their score or time performance. Completing all the objectives except one and ignoring the time restraint, the player can use workers to collect additional resources or just adopt a lazy sandbox approach but to get a good score players will need to beat the timer bar at the top right of the screen.  This game will appeal to young children and to adults who enjoy casual games. There is only low key cartoon fighting with no blood or gore, so the game is family friendly. This game and 'Rescue Team 1' as well as 'The Promised Land' would be great first additions to a young players game library.  Weather Lord: The Successor's Path will provide many hours of stress free casual gaming and leave the player feeling relaxed and happy. The game is extremely well thought out and almost bug free (unlike some disappointing AAA titles). The game did crash and lock up while attempting to take a screenshot as a level was completed, but progress had been saved automatically making it possible to resume play at next start up.  The biggest benefit of this game is the small file size (under 180Mb) which is small even compared to patches or updates of many games. So if you are one of the laptop casual gamers pressed for space this is the game for you!  This game is less complex and less demanding than 'The Promised Land' but is fun to play.  Weather Lord: The Successor's Path automatically tracks progress of each player name registered and so there is no need for a Game Save feature. This is a great benefit as a player can easily resume from where they were the next time they open the game without having to remember to save.  Weather Lord: The Successor's Path is a great casual time-waster and at the price is good value for money (especially if it is on discount). A fun game especially for the younger gamer age 4 to 10 but parents will need to accompany the child if the child's reading skill is not up to scratch yet.  6.2 / 10",
            "review_score": "1"
        }
    ]
}