{
    "app_id": 362160,
    "name": "Sydney's World",
    "release_date": "2016-02-01",
    "developer": [
        "Wise Dad Games"
    ],
    "publisher": [
        "Wise Dad Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "RPGMaker",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 3,
    "price": 3.99,
    "description": "Sydney's World is a family-friendly JRPG. Game focus is on the intersecting story arcs of a young girl seeking her father and a king in search of redemption.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/362160/header.jpg?t=1471010006",
    "minimum_requirements": "OS: Windows XP Processor: Pentium 4. 2.0 Ghz Storage: 535 MB available space Additional Notes: Resolution is 640x480",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sydney's World is a game that caught my attention when he entered in greenlight  an interesting JRPG with a great story, many great characters. personally I love RPG games. however many of today's RPGs are boring ..... same type of story same gameplay all repeated but Sydney 's World was more than that .... had a great story, many great sound effects and very creative. I would say this was the best RPG I've played this year then I say if you are looking for a great RPG I recommend Sydney's World and the game still gets updates from players requests ^~^ thanks for this great game and continue creating great stories.",
            "review_score": "1"
        },
        {
            "review_text": "What a adorable game, love the girl's voice, so cute♥♥♥♥ ~ Her voice is my power to keep playing the game ♥♥♥♥ I need to rescue her ♥♥♥♥ rescue her ♥♥♥♥ Sydney~ ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "If you all Loved Playing Games like Chrono Trigger, Secret Of Mana, The Final Fantasy's on the Super Nintendo and Games like that that were Kid Friendly, then Continue on Reading.  First time I've written a Review like this on Steam. As soon as you begin Sydney's World, if it doesn't bring a Smile to your face, then something is wrong. The way Sydney says her Lines is very Precious  indeed. XD  All of the Menu's are Hand Made, even the Cut-scenes. Character Pictures, Profiles, and a ton of the Sprites to, so you can tell a lot of love and care was put into this game. It's not like a ton of the other RPG Maker Games that have Flooded Steam where there is all Generic things in them. These are people that have really put a lot of love behind their Game.   Even the Names of the Items made me laugh, but in a good way. There truly needs to be more games like this on Steam. This is how RPG Maker Games should be done.  It's also Educational as it has been Stated before. Check everywhere when you get the chance because you have no ideal what you'll find. There's References to People that have Shaped our World to what it is today from Emotions, History, Life in General. Even the people Teach Important Life Lessons to.  I hope one day to play this with my Great Niece who also has a Speech Impediment because i know she'll truly love it. I can tell that Families will have tons of fun playing it together. :)  Voice Acting is very Spot On and Professionally done as well. The Voice Actors really Fit the Characters. I can tell you all right now that even if you have no Children to Share this Game with, you will enjoy it, Especially if your looking for a Lighthearted RPG. We have to many Flooding the Markets these days that are all about Gore and other things. Gone are the days it seems for RPGs like this. This Game is a Breath of Fresh Air among the RPG World.  The Music in the game fits the mood at the Given Situations. Weather it's a Dungeon or a Town, Etc., it fits the mood.   Combat isn't that hard either. It's very fun as well. The Monsters don't look bad either. XD In-fact, some look funny while others look like Real Life Animals that you would see in the World. Others, well,  let's just say they would Scare some people. Monster Sprites are even Hand Done as well, so that's another Plus for this Game.   I will admit that with the Maps and Sprites, some do seem out of place at times, but other times they're not. Mostly the Sprites fit the Area and Screen. Some can be Off putting to some though, but it shouldn't be to bad to make the game Unenjoyable.  The Emotions you will feel playing this game will range from happy, sad, warm fuzzies, and things like that. &lt;3 It truly is Wonderful and it is great.  Pyramids are evil BTW. EVIL I SAY!!! PURE EVIL!  Sydney is as I already Stated beyond Precious in this Game. If you don't Fall In Love with Her and Her Banter with the other Characters then there is something wrong with you. For parents and Adults alike,  I truly Recommend this Game Highly to everyone. Sure, it has it's Problems, but they're to far and few in-between to really be a bother.  This Game has Easily become One of my Favorite Games of All Time and is One Of my Top as well as my Favorite RPG Maker Game of All Time as well. It's going to take a lot to Beat this One. If you all think you know one that can, tell me the Name of it and I will Check it out.  Also, Remember to Save Often. You'll thank me for it later on. LOL  Just remember this. Use your head and think if you get Stuck. Usually the most Problematic thing can be Solved if you use your head. :) Just take a Deep Breath and do that. Also, my First Favorite Game here of all time I will leave this Review with a Quote from it that will help you all out like it did me for a Few Years now.   Nothing is impossible. -Marquis De Hoto",
            "review_score": "1"
        }
    ]
}