{
    "app_id": 362290,
    "name": "The Living Dungeon",
    "release_date": "2015-11-02",
    "developer": [
        "RadiationBurn"
    ],
    "publisher": [
        "RadiationBurn"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Local Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Adventure",
        "Simulation"
    ],
    "achievements": 21,
    "positive_ratings": 45,
    "negative_ratings": 11,
    "price": 7.19,
    "description": "5 actions. 2 minutes. Impossible odds, and many, many ways to die. There really is nothing quite like The Living Dungeon. Up to 9 players can take part in a battle of wits, luck and skulduggery, Or delve into a 30 hour story campaign and try to guide our hero's to freedom.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/362290/header.jpg?t=1487281794",
    "minimum_requirements": "OS: Windows 7 Processor: pentium i3 Memory: 2 GB RAM Graphics: Nvidia GTX 460 DirectX: Version 10 Storage: 2 GB available space Sound Card: any direct X soundcard Additional Notes: Unity based. Scalable performance so older machines may be fine.",
    "recommended_requirements": "OS: Windows 7 Processor: i5 Memory: 4 GB RAM Graphics: Nvidia GTX 560 DirectX: Version 11 Storage: 2 GB available space Sound Card: any direct X soundcard Additional Notes: Unity based. Scalable performance",
    "reviews": [
        {
            "review_text": "Edit: It should be noted that this review is only for the single player aspect, so look at other reviews if multiplayer interests you.  A very interesting game with fun turn based concepts, unfortunately a convergence of minor frustrations add up to make it not enjoyable for me.  The dice per turn, rerolling, cards, combat, and movement are all enjoyable, and the way they are combined together produce a game that plays like a board game without feeling like a board game, if that makes sense. I also liked the god-dungeon as explanation for why this place exists and why people go into it.  Unfortunately there are some problems. Seeing enemy turns is nice because you get to see in detail what the enemy is doing, but it's also time consuming. Which isn't so bad except that any time you fail you have to restart the level. Which wouldn't be so bad except I found myself frequently dumped in situations that were guaranteed failure - stuck on a spot needing 1 type of die (singular of dice) to get out, and even burning all my rerolls and checking my cards couldn't get me that escape.   Perhaps I wasn't properly thinking ahead, or there is a key element I was missing - I did only get to level 7 - but with the DM's wide variety of actions (including changing the shape of rooms, rotating rooms, spawning full-room-death hazards, etc) plus extra enemy actors thrown into the mix, it just felt like 'unfair' deaths were all too common, and the penalty too great (having to start over completely and wait through all those enemy turns over again). It felt like I spent more time waiting than playing, and that's never a good thing.   I'm sad that I can't recommend this game, because it has several clever and fun concepts/mechanics. But the overall unfair deaths + tedious time consusming nature of restarting a level combine to make it a game I'm glad I tried but I won't be playing further.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is really interesting, but it just doesn't work.  I stood in a corner, surrounded by 2 enemies. Which means: If I end my turn without getting out of the corner or killing them, I'll die. Well, I have 5 dice, so no problem. I roll my dice and... I get 2 swords, I kill them, but I can't move towards the goal. So I end my turn and another enemy spawns beside me. No problem, I can just move away. So I roll my dice again and I get... neither a foot nor a sword. I can rotate the f*cking room 5 times, but that doesn't help me get rid of the enemy, so I die. Which means: I have to restart the whole level.  That happened three times to me, but then I finally did it. Funnily I didn't even have to get this girl out, I could make her run in circles and let the other one run to the goal. Which is easier because she has different dice. Each character has a different set of dice (combat dice, movement dice, mechanical dice) and as you can see either the game is really unbalanced or the A.I. is really smart because it spawns the enemies near the girl who can only turn rooms.  The game became more fun afterwards. Until I got into level 7 which introduced shadow tiles. It was pretty exciting because I had to survive for 5 rounds and that was harder than it sounds, but it enjoyed it because I had to good set of dice. Well, I enjoyed it until the A.I. got stuck. I finished my round and a message popped up saying 'The A.I. is thinking...' - as usual when it's the A.I.'s round. After about 5 minutes of thinking I finally quit the game and uninstalled it. According to the Steam forums I'm not the only one experiencing this problem.  So, if you want an interesting game which involves lots of luck and bugs which keep you restarting levels over and over again, you're at the right place.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate that I have to recommend or not recommend the game in these reviews. TLDR I recommend getting it when it goes on sale.  Ok so there is a lot to like here, mostly in terms of story and art direction. The lizardman, Sajotir is an epic badass and characters like Meru are silly in an endearing, amusing way. The art direction and character design is cool and unique and it's well written. Unfortunately, it is saddled with such a threadbare game system that it just made me wish that these characters and this world was in a proper RPG. Like, this entire setup just freaking begs for a sick dungeon crawler and this is all I could think of while muddling through the game. And yes, I know this is a personal preference.  But as it stands the system is...well, kinda janky? I'm not sure how to place it but it feels like a the first draft of a board game which ends up being a bizarre mixture of randomness and static which I can't quite make sense of.   Also, I'm willing to forgive a lot in terms of graphics and physical presentation, but everything about the delivery is amaeturish. The actual voice acting is fine, but it seems to be low fidelity... like it was recorded on inexpensive hardware or encoded improperly. The animations are distractingly bad, especially when compared to the detailed 3d character models and it takes me out of the game. This is 2015 and you are asking 25 dollars for this game!! That kind of lack of quality in the implimentation does not cut it! If you didn't think you could pull off a full on 3D implimentation gracefully you should have gone 2D. There is nothing wrong with sprites or pixels, what we care about is that it's done in a quality way. A poorly done 3D game looks worse than a well done 2D one. Remember that.  Bottom line is that I think that these devs should keep on doing what they are doing. They clearly have good ideas and I think with some more practice they will be able to impliment them. Hell, the art and presentation of the game was enough to make me pick it up! I'd recommend getting this game if it ever goes on sale for less than 10 dollars, (I think a 6.99 price point is about where I'd be most comfortable and not feel like anybody is being screwed).  ",
            "review_score": "1"
        },
        {
            "review_text": "-",
            "review_score": "1"
        }
    ]
}