{
    "app_id": 362400,
    "name": "Regimental Chess",
    "release_date": "2015-04-29",
    "developer": [
        "Thomas Bacon"
    ],
    "publisher": [
        "Regimental Chess Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Cross-Platform Multiplayer"
    ],
    "genres": [
        "Free to Play",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "Chess"
    ],
    "achievements": 0,
    "positive_ratings": 57,
    "negative_ratings": 59,
    "price": 0.0,
    "description": "Regimental Chess is a battle game where large armies of chess pieces move and capture in mass formations. Up to 372 pieces in a single battle.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/362400/header.jpg?t=1447372413",
    "minimum_requirements": "OS: Windows XP DirectX: Version 9.0 Network: Broadband Internet connection Storage: 225 MB available space",
    "recommended_requirements": "Network: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "Needs AI badly. As of right now impossible to get a game going.",
            "review_score": "-1"
        },
        {
            "review_text": "I love it! It's fun when you have a friend to play with (or a girlfriend in my case). It's pretty rewarding when you win a heated battle between someone you love dearly, and it's pretty fun even when you lose. I recommend it to anyone who isn't a loner.",
            "review_score": "1"
        },
        {
            "review_text": "It is horriable, although it is an interesting idea it does not satisfy the chess player in me and seems to just butcher what it could have been.",
            "review_score": "-1"
        },
        {
            "review_text": "i kept on waiting for other players but they did not arrive",
            "review_score": "-1"
        },
        {
            "review_text": "This game would be really cool if it had a non multiplayer mode and more people playing",
            "review_score": "-1"
        },
        {
            "review_text": "I don't make reviews, but this game is so bad that I had to make one.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a little wonky and has a few bugs. I found it boring to play this game with random people but if you play with someone you know, then this is really fun. Like, tons of fun. If you have a friend, download this and play together.",
            "review_score": "1"
        },
        {
            "review_text": "-seriously need AI because there's no one online...&amp; tutorial for those who don't how to play chess...",
            "review_score": "-1"
        },
        {
            "review_text": "A very interesting and inovative concept on Chess, the gamplay is based more on noticeble positioning and aiming for the opponents better figures rather than ingaging actuall mnemonic abilities- but even if you do it only gives you like 3% advantage cause the results can always be unexpected, its fun to play as long as you understand the basic concept then it s not that hard but to claim that you plan strategies in this game is simply ridicilous - the level of complexity above the casual one is that you can actually link figures or squads of figurines in this game to complement each other. Still this game can be improved in a 3D way with complex geomethrics shapes where each flat surface is a regimental chess game and if you solve a sertain tier -lets say the cube one you get to do 1 move on a chessboard in the real world. :) -this idea just got patented :P Im kidding of course. I recomend this game as a inovative experiment in the area of developing classical Chess to the next level. ;-}  ",
            "review_score": "1"
        }
    ]
}