{
    "app_id": 362860,
    "name": "Sylvio",
    "release_date": "2015-06-05",
    "developer": [
        "Stroboskop"
    ],
    "publisher": [
        "Stroboskop"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 50,
    "positive_ratings": 78,
    "negative_ratings": 19,
    "price": 9.99,
    "description": "Sylvio is a psychological horror game set in a tranquil, disturbing atmosphere. Help ghost recorder Juliette Waters face an evil curse and a wicked family cult with her microphone and the voices of the dead.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/362860/header.jpg?t=1481719482",
    "minimum_requirements": "OS: Windows 7 or higher Processor: Dual core 2.4GHz Memory: 2048 MB RAM Graphics: Video card with 512 MB of VRAM DirectX: Version 9.0c Storage: 3 GB available space Additional Notes: Use headphones if possible.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sylvio is about sneaking into an abandoned haunted Indian Reservation with nothing but a microphone and tape cassette straight from the 90s. The game's red, black, and brown pallette create's a hellish atmosphere as you investigate distorted voices muttering through the static.  Pros: + amazing, creepy atmosphere + great story + unique concept + artistic + friendly, active dev  Cons: - repetitive scenery - details of ghostly mutterings don't make sense at times - crashing problems reported, although, I haven't experienced any  I really like this game because it manages to still create a suspenseful, beautiful, atmosphere, given, it's limited by being a rough-around-the-edge's indie title.",
            "review_score": "1"
        },
        {
            "review_text": "Time to beat: about 11.6 (did not do completionist) Played with keyboard and mouse. Mostly easy to control. (some times jumping was a little weird) Bugs: none that I came across. Motionsickness factor: was an issue when i was walking down corridors, but minor.  Story: You are an investigator! But not just ANY investigator! You are one that practices Electronic Voice Phenomenon   Link EVP wikipedia.  [en.wikipedia.org]   Yes. You are a ghost whisperer investigating an abandoned amusement park. You use an electronic device to record the atmosphere, play it back at various speeds, forwards and backwards, and listen to words and phrases trying to piece together the mystery of the lost souls who remain.   I really liked the idea behind this game and definitely give it thumbs up for being unique. The only thing that I found silly was the weapon of choice in this game. lol.   A potato gun.   I'm still on the fence with the game ending... more about that later.  What this game is:  lots of walking. (no running at all) lots of puzzles/problems to solve in every map. spooky/eerie calm and slow paced, but not to the point of boring yes, there are ghosts. Aggressive ones too. and yes, it is possible to die.  What this game is NOT: outlast or amnesia. jump scares. ghostbusters. gory/disgusting/bloody/etc. terrifying.  If you're the kind of person who likes to watch ghost stories on tv, or wants to try talking to ghosts in cemetaries or abandoned buildings with weird histories, or simply intrigued with the supernatural, you will probably enjoy this game.  Do I recommend this game? Yes!  BUT...When you go into this game, don't expect to be scared out of your wits. You won't be. You will be disappointed if you think this. It's a very mellow form of horror game.   Rumor has it, Summer 2016 the game developers of Sylvio are working on a sequel! Which I hope is a direct continuation of Sylvio since at the end of the game...   I was really left scratching my head at such an abrupt ending and I still had a LOT of questions unanswered. The game took quite a turn that made me feel like suddenly I was playing another game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Overall I really like this game, it's quirky and obscure but not game breakingly so. It's a unique idea amongst a sea of monotonous Unity jumpscare simulators and achieves tension through subtlety. It's a good game for people like me who can't handle the franticness of Outlast or Amnesia but who still want to enjoy a horror experience. I would highly recommend it on premise alone.",
            "review_score": "1"
        },
        {
            "review_text": "First, i like that game. Buy it :)  But: i do have some issues.. game crashes 3x.. -inside the recording-menu -- black screen -- restart (yes, sound still active) -switch to windows and back -- black screen -- restart (yes, sound still active) -interview with ghost - switch back to candle -- screen fulfilled with red dots (no sound) -- hitting mouse button = restarts  WTF ????????????  and yes, recordings are too loud.  ....",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw Sylivo I was excited. The sound recorder was a game mechanic I hadn’t seen done before and it is a very interesting idea.  Sadly though, the entire game is poorly executed.  First there is the controls. ‘C’ for flashlight, really? There’s no crouching, no sprinting. For some reason the scroll wheel turns the character left and right, jumping is inconsistent. It was incredibly frustrating when I needed to jump on a stack of sewer pipes to get to another area. The stack is right on the edge of the jump height, so if you don’t jump from exactly the right place you can’t get on the stack. Queue five minutes of trying to find just the right spot to jump from.   There’s also no cursor on the main menu for some reason, forcing you to navigate it with the arrow keys. There is on the settings menu though, just not the main one, giving me the impression the dev was just too lazy to use clickable buttons on the main menu.  All in all, from the controls my impression was it was a very bad port of an old PS2 game and the graphics are in line with this. So I was surprised to find out it is not a port, it was developed for PC on the Unity engine.   Then there’s the gameplay itself. The little jumpscares are predictable and not particularly scary, the atmosphere is kind of meh. Maybe I’ve just been desensitized too much, but I didn’t find it scary in the least.  The tutorial screens are also annoying as hell, covering 3/4 of the screen and they displayed the same thing repeatedly with no way to turn them off.  The flashlight is also useless, as it doesn’t even light up the dark areas. You might expect a dark corner to become visible when you shine a light at it, but it doesn’t, it remains dark no matter what.",
            "review_score": "-1"
        }
    ]
}