{
    "app_id": 362960,
    "name": "Tyranny",
    "release_date": "2016-11-10",
    "developer": [
        "Obsidian Entertainment"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Story Rich",
        "Choices Matter"
    ],
    "achievements": 70,
    "positive_ratings": 6121,
    "negative_ratings": 1001,
    "price": 23.79,
    "description": "Experience a story-driven RPG where your choices mean all the difference in the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/362960/header.jpg?t=1551262804",
    "minimum_requirements": "OS: Windows 7 64-bit or newer Processor: Intel Core 2 Quad Q9505 @ 2.80 GHz / AMD Athlon II X4 840 @ 3.10 GHz Memory: 6 GB RAM Graphics: ATI Radeon HD 5770 or NVIDIA GeForce GTS450 with 1GB VRAM Storage: 15 GB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": "OS: Windows 7 64-bit or newer Processor: Intel Core i3-2100 @ 3.10 GHz / AMD Phenom II X4 955 @ 3.10 GHz Memory: 8 GB RAM Graphics: Radeon HD 6850 or NVIDIA GeForce GTX 560 with 1GB VRAM Storage: 15 GB available space Sound Card: DirectX Compatible Sound Card",
    "reviews": [
        {
            "review_text": "Meant to stop playing at midnight. It's now 6am.  I think it's safe to say the storytelling has held me rapt.",
            "review_score": "1"
        },
        {
            "review_text": "As a huge fan growing up on baldur's gate, I finished the game already on normal and going through my second playthrough. I really had a great time with this game. It is a bit short compared to pillars because the meat of the game is the variation in the storylines, not the length of the story. The plot of the game can take many branching paths, so it's about 20-30 hours on your first playthrough.  Pros  - Storyline - UNIQUE (You're the badguy) I love the setting and darker tone. - Spell system - I LOVE the spell system in this game it is so unique and customizeably awesome - Characters - They are much more fleshed out and unique than in pillars. I really like the personality of the characters and get to know them and want to keep them in my party. Too bad they don't interact with each other while walking as much. - Branching Paths - What decisions and conversations you make have a SIGNIFICANT impact on the game. Not an advertisement false promises kind. REAL impact. - COMBO MOVES - I love the combat combo moves such a great idea! - Character customization is really fun  CONS - Story is a bit short, i wish there was more  The end of the game just comes too fast and you don't really get to play around in the endgame as long as you want. I never actually got to fight kyros, which was kinda boring. I didn't have to fight the judicator guy and the bleden mark fight was uneventful. So what was the final battle!? - Barik is your main tank, but you can't change any of his armor. having a main tank that can't use any heavy armor you find is boring. My Main character was a rogue. So all heavy armor had to be dumpstered. I know it's because of lore, but I think it's just a dumb design choice. I like to customize my characters. - Some dungeons are boring and a bit repetitive. - Towards the end of game, you get super powerful and teabag everything. Early game was a bit difficult (which was good) Endgame was WAYYY too easy. - No Bounties or Dragons.... I love testing my party with really hard fights - The maps are really small. Sometimes there are just 1 quest fights and then you're done. It feels like the maps are really shallow and not much in there compared to Pillars. - Strange fear loyalty system. I get a bonus for getting their fear too high? It's kind of confusing. - Too much dialogue sometimes! I mean talking to your companions is supposed to be fun not have a million branching paths that don't really give you any incentive but just to read about them. - No romance. The story seems a bit short to even warrant this. - The opening sequence determines alot about whether or not you are viewed favorably by the opposing factions, if you don't find that option (to barter a truce), then you won't even be given a chance to make peace.  I would still recommend you buy this game. If you wanna support the developer buy it now, if you're not a huge crpg fan, then wait till 30 bucks or further. Honestly you could play it through a second time for the story, but it will feel the same pretty much, not sure how to explain it. It's pretty shallow  I really enjoyed the unique concept of the game and branching storyline paths and I want to support this developer for the type of games I like. I hope their next game has more of everything!",
            "review_score": "1"
        },
        {
            "review_text": "The best Oldschool RPG this year.   Pro's: Choices truly matter in this game.  You play as an agent of the ultimate badguy.  You choose who lives and dies. The Unity engine looks great.  Magic starts off weak but becomes amazingly powerful and customisable. The game has Literally got a wicked humour imbued throughout.  Interesting NPC's and factions.  Difficult moral choices.  A Grand scale RPG adventure in the same vein as 'Pillars of Eternity' only way more absorbing in it's storyline. Combat is fun when you learn the basics.  Interesting and useful companions.  Puzzles range from easy to middle of the road (which is great because it's one thing i hate about RPG's)   Con's:  Combat can be tricky to learn initially.  Text heavy but brilliant lore. (A lot is voiced, and a lot isnt) Companion AI doesnt always do what you want it to. (getting stuck behind another npc in combat and having to manually move them for instance) Tracking quests is a bit flimsy but manageable.    9/10  If you like your RPG's you'll love it.      ",
            "review_score": "1"
        },
        {
            "review_text": "A fun game.... yet feels unpolished. Rather than a complete game feels more like an episode where you are expecting 3-4 more parts. If you have the money to blow give it a go. Otherwise wait for a sale. Unsatisfying ending.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant but feels like Act 3 and 4 are missing in this epic. No doubt there are expansions coming, the complete version of this game looks to be a masterpiece but as it stands, its just very good. Not so much of a review, more of a heads up for CRPG fans and their expectations.",
            "review_score": "1"
        },
        {
            "review_text": "Very promising start: Interesting setting, intriguing characters and a lot of choices.  Unfortunately after the first ACT the game starts to gradually get more and more mainstream and boring with the one and only goal being: Gain as much power as you can! (Spoiler: Which is not even put to use in the end...) I expected more interaction with the party characters (in terms of their background story), but did not even get appropriate reactions to certain outcomes of the story. I expected some epic answering of all the question the story had raised, but got a very bland ending... overall unsatisfying and a huge waste of potential! Why built such an interesting universe only to shift it back to 0815? Why explain all the lore and background story when it does not even matter one bit? Why create interesting characters and sketch unique personalities only to ignore them entirely as the story advances? Why destroy everything that sets Tyranny appart, by falling into the trap of utter clichée and then not even succeeding in delivering that!? Advice: Play this game until you are at the point of the story, where you have accquired all the party characters, then uninstall and imagine the rest yourself... Note: If your focus is party based combat and not the universe and story itself, you've got yourself quite a few options of customizing: Crafting, alchemy, spell creation, character skills, character talents, powerful artifacts...",
            "review_score": "-1"
        },
        {
            "review_text": "Hello,   I finished the game in Path of the Damned in 25h.  Game ended abruptly with a clear content cut (anti climatic ending). It's obiously a commercial move from OE to make players buy more DLC.  To be clear : good and solid game but feels half-baked towards the 'end game' (understand mid game). It's several levels of epic below Pillars of Eternity in that perspective.  I do not recommend it because of lack of replayability (all ending converges towards DLC status quo) and MMO look alike with the skill tree and absence of character creation.",
            "review_score": "-1"
        },
        {
            "review_text": "Bubba Lannister is the best hand of the king ever, you will respect him!  11 hours played on day 1, this game is addicting as hell and imo is the best game from Obsidian since Fallout new Vegas or Alpha Protocol. The writing is a good deal better than it was in Pillars Of Eternity and it is a blast to play. It also has some of the toughest choices and decisions ever.   Obsidian has done a wonderful job on this new IP and I look forward to many more replays of the game and more games in this series down the road. Where as Pillars was more a cross between Baldurs gate and Icewind Dale, I find with Tyranny I get more of a Planscape Torment vibe (Writing,etc..), with some of the tough choices that bring back memories of KOTOR2 and Alpha Protocol.  If you liked how evil you could be in KOTOR or the awesome choices/decisions you had New vegas or Alpha Protocol, you will love this. Well done Obsidian, well done. I really couldn't stop playing yesterday and spent way to many hours pulled into the games writing and wonderfully crafted gameworld.  The combat is enjoyable, the art design is fantastic and the opening Prologue which you can customize is fantastic aswell! Other things I like are the ability to create your own spells and the ability to have two party members do 'special moves'. So far, atleast for me personally this is up there with the best games of 2016.  The only real negative that I have at the moment is that the loading times are a tad long. Still that is one very small issue in a big game that does so many aspects perfect. There really isn't alot bad to be said about Tyranny, Obsidian has really done a wonderful job with this game.  Get ready for some very tough decisions to, this game tosses them at you left and right and alot of them had me really thinking hard about what I should pick. A few times I even felt really bad after I had done something really evil. Last time I can remember a rpg doing this, this well was KOTOR2 and how alot of the choices in that game had me sitting there for 30minutes trying to decide what to pick. Tyranny doubles down on that and brings many of its own aspects to the table.  **The game is shorter than Pillars Of Eternity was, but this has much much better replay value**  ****40 hours in on the game now, Overall I really love the game, for me it's Obsidians best since Fallout New Vegas or Alpha Protocol. The Ai and the combat need some work but everything else is amazing, from the fantastic writing, awesome decisions that are tough to make sometimes, great soundtrack, to the wonderful replay value and epic world creation. ****",
            "review_score": "1"
        },
        {
            "review_text": "So as I was playing this game I began to, very casually, make very evil decisions. Sure lets execute that guy, meh she can go free but she has to kill her friends with a rock. This was evil ♥♥♥♥, but it all seemed so natural within the world I was in and I didn't really question it. Then I smothered a baby in its crib. I killed a ♥♥♥♥ing baby. WTF. That was the moment I sat back and wondered what the ♥♥♥♥ I had become. WTF was this game! How had I become so bad so fast? I felt some real feels. And whats even better is you might not be put in this situation, you might never come to a moment where you have to kill a baby cause there are just so many decisions to be made that you might just miss the 'oppurtunity' to kill this baby and its mother, I nearly did, kinda wish I had. All in all learned more about myself and still have another 4-5 playthroughs to go through. Cool ♥♥♥♥. I just think that this person needs a hug. My character was a villain, power hungry, and was willing to stomp on people to get there. My character also didnt want to be in fights unless necessary and had a real desire to help her companions and become friends with them. I think that my character saw an oppurtunity, took it, and did some real bad things that keep her up at night, like she was swept up in a river of oppurtunity that took her to places she just wasnt ready to go. I think she would do it all over again but ♥♥♥♥♥♥♥ it she needs a hug and a good moment to cry so she can deal with her feelings.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing RPG where you chose the outcome of the whole story. There are many options and many ways to go about. Its alot of reading and alot of problemsolving but its worth every minute of it! The game has about 15-20hours in total gameplay (excluding the reading time) and yeat its one of the few RPG's that have made a huge impression on me and ive played RPG's since the 90's.  Pro: - Great storytelling/line - Easy navigation/quest overview - AWESOME characters, items and lore - Have potential for alot of DLC's - Replayability with totaly diffrent outcomes  Con: - When you finaly get those uber items, the game is almost over. ",
            "review_score": "1"
        },
        {
            "review_text": "As many people have stated before, this is a game where I wish I could choose an option somewhere between 'recommended' and 'not recommended'. There are a number of things to love about this game, that are balanced by negatives.  Pros +The worldbuilding +Lore  +Art direction +Player choice +Musical score +Home/Base management +Spell crafting +Reputation system   Cons -Combat becomes far too easy -Much of the lore is never fully realized in-game -Incredibly interesting game-mechanic introduced at the very end of the game -Sudden and unsatisfying end -Short length for this type of rpg, ~30 hours -Many areas of world locked by the main story  Overall, Tyranny was a decent game with some very interesting ideas. However, it has major flaws and as such, I can only recommend this game if you are a major fan of this genre. Otherwise, wait for it to be on sale. ",
            "review_score": "1"
        },
        {
            "review_text": "They took everything good from their previous titles and mashed it together in a fresh masterpiece. Companion detalization from NW2, faction wars from New Vegas, role-system (sort of) from PoE, double-egde influence from KOTOR2 (you may force companions to respect and obey you not only by making them like you, but by making them fear you as well, and these two aspects have separate scales and do not contradict each other (like in KOTOR2), so they can love AND fear you if you want). And, of course, it's got a branching and exciting story that practically begs you to play the game multiple times. Tyranny is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Another great story-driven cRPG from Obsidian. Much like Pillars of Eternity, the story and the choices you make during your journey, matter most. You really get the feeling to have the power to decide the outcome of this battle between 'order' and 'chaos'. Plus, you finally get to be the bad guy. If you - like me - are usually playing the neutral good type of characters (AD&amp;D veteran here), this is very refreshing. You still have the option of pursuing a rather 'good' path if you want to, e.g. you can spare prisoners or help others escape vs. executing them.  Beautiful graphics and nice voice acting (some voices you will immediately recognize from PoE), coupled with a clean and simple UI make playing this game a real joy. Combat is fun, requires (at least in the higher difficutlies) micro-management and knowing the strenghts and weaknesses of your party - a party of four! Four is in my eyes a much better party size than the classic six, although you will have to make some compromises regarding the development of your party members and your hero. Usually the tried-and-true trinity approach works best, i.e. tank, healer, DPS and maybe some support/CC-class.   Regarding the character dvelopment: Tyranny uses a 'class-less' (not 100% true), skill-based system. You have 6 different skill trees for your hero (like Melee, Range, Magic for example), which you can distribute your points received from level-lup in. Your companions usually have two distinct skill trees which you can use to specialize them further, e.g. the 'tank guy' can be either a defensive tower or an offensive slaughtermachine - you choose!  Another great game mechanic: the Favor/Wrath system. Your actions, choices and words make all the difference. They will change your standing with different factions as well as individuals. They will either like your ways because you share the same values for example, thus increasing your favor with them. Or they will dislike you and your way of handling things, causing to increase your wrath. At certain thresholds you will unlokc special skills (active and passive), e.g. an aura granting a bonus to one of the attributes for you and your nearby companions. This moral system works great and allows for diverse choices without treading on the boring path of good/evil.  Last but not least, the best part: you can create your own spells by using different sigils (fire, ice, lightning, etc.) and combining them with different traits (e.g. touch-based spell or AOE) and enhancing them (longer duration, more range). Works quite nice, although this is not the total freedom of spellmaking I still love from Oblivion for example.  To sum it up: if you are a fan of RPGs, liked Pillars of Eternity or similar games - buy it. You wont be disappointed. In comparison with Pillars of Eternity, I think it's better than Tyranny, mostly because of the story and the sheer size of the content (100h+ with the addons). Still, Tyranny is a fresh take on an old theme, and it's made by people who love RPGs. 'Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game with an above average amount of replayability. It's also much more accessible to an average player than the average Infinity Engine type game is, with a party size of 4 rather than 6, much clearer talent trees, and easy to use and craft spells. The world is unusual and intriguing, and most of the companions and characters are interesting enough to be memorable.  ",
            "review_score": "1"
        },
        {
            "review_text": "The combat is pretty boring. And constant.  Gone are the days of intricate magic battles (a la BG II), Tyranny is a bit gimmicky. I like the concept of sigils and the like, but found myself (like PoE) getting 2/3 of the way through and thinking 'I've already been to work today'.  Feels a bit like work to play.",
            "review_score": "-1"
        },
        {
            "review_text": "  A pretty fantastic turn based isometric rpg. Tyranny is a step up from pillars of eternity in almost every way.   Pros:   Much better engine. Better effects and prettier.  Much better combat. Fantastic magic system where you can design dozens of spells exactly how you want them. Everyone can use spells. Everyone can use weapons. Build your characters however you want.  Better soundtrack. Stellar job the music has a haunting feel at times that goes well with the games story and setting.   Cons:   A step down on some of the characters than pillars of eternity. This is not really a con but i felt i should mention that some characters were deeper and more interesting in poe (like the grieving mother or durance).   Hell yea you should get this game if you like good rpgs.   Final Note. Despite earlier impressions the game was not small (estimations where 15-20 hours). Took me 45 hours.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game, but I just couldnt get in to it. The Conquest pre-game is perhaps the coolest character/world creation tool I've seen in a while, and despite my limited time playing the game I could see my choices having a big effect on the game world. Im a newcomer to isometric RPGs like this and I really do enjoy the over all style and structure of the game and character customization/progression (as many have said before me, the spell creation mechanic is awesome and reminded me of old school Elder Scrolls). However what really turned me off was the combat; to me it is a big micromanagy chore where you really need to pause often and control every aspect of the battle or get seriously messed up or at the very least, quite wounded. Where other RPGs like KOTR make this pretty seemless and inuative, I found the combat character controls and UI here to be overly complicated and busy, with a subpar targeting systeming resulting in me having to zoom in to make sure it was hitting the right target. Add to that the difficutly in stacking multiple moves and it was a little game breaking for me. One other little thing that bothered me was the inconistent VO with character dialouge; one minute I'd get really good voice acting, the next minute I'd just be forced to read a block of text (same character).  I think if you've played other isometric RPGs like this and enjoyed them, you'll no doubt enjoy this game, however for me it was not a good fit.",
            "review_score": "-1"
        },
        {
            "review_text": "Finished it in 28 hours and read every single line of text. I have no desire to play through it again. The story is good, but it falls flat and ends abruptly, as if they dissected it for DLC sales. The maps are tiny and the world feels like it only exists as space for your character to move in. It's a very linear game, regardless of the choices you make. They also decided to include every generic MMORPG style system, like color coded gear progression, a DPS attribute and ability cool downs that fill up your hot bar by Act II.  This is no Baldur's Gate, Baldur's Gate II, Pillars of Eternity or even a Divinity: Original Sin. It's a very short and shallow game with forgettable characters and boring combat. The only thing that blew my mind was the spell crafting system, which is incredible, but the game is so short you can't even really use it to its full potential.",
            "review_score": "-1"
        },
        {
            "review_text": "I have not seen such 'Old-school' RPG for quite a long time, though some failures still stand, this is a Must-Play for CRPG fans. ",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like reading, do not touch this game with a ten foot pole.  If you don't like pillars of eternity for it's combat, character, crafting machanic, you won't like this game's mechanic.  Tyranny is a great RPG, with interesting story, great characters, and a enchanting world, but all that are in the writing.  If you are inpatiant and often read between lines when playing games like this, this game is not for you.  Personally I do not like the combat system, the crafting system, and the spire (homebase) system too much, which is challenging but not interesting. I absolutely hate the realtime with pause combat system since Baulder's Gate, but will endure it for samereason I did with Planescape: Torment.  In conclution, great game, but only for people who like to read.  9/10 for reading person.  1/10 for others.",
            "review_score": "1"
        },
        {
            "review_text": "If you're old enough to have played the Baldur's Gate games when they were new, as I am, and enjoyed them, as I did, I think you will like this game. Are there flaws? Of course there are. But I think this is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Overall Great game recommend if you liked Pillars. The choice design system was great it had me loading up trying to save everyone on multiple occasions.   There are however problems with the gameplay. Combat early can be tough requiring almost constant use of potions and a bit a tactical sense(played on hard, but not path of the damned) which is misleading as the pace of the game gets much much easier. Combat late into the game i wasn't using potions or skills i just clicked on the closest enemy and waited to win and considering i was fighting the supposedly boss like characters it was kind of a let down. Since you don't pick a class you just select a base specialization it made the talent system lack luster. I wanted to be a monk(unarmed specialist) so i went down that try selecting the only thing i could while doing this realized that all playthroughs would be very similar. The game gives you additional skills through rep or artifacts you can use which again by the time you get them you will be winding down on needing to use skills to win. One character is all the longevity you can get out of this system. Fortunately your companions have thier own trees which can make them feel like they have the better options when they level.   I feel I should mention the companions. Overall pretty well done. Each feel unique with thier own trees and have at time great lines, but some are far better then others practically. Also one is pretty much a staple because HE is the only one who can fullfill the tank role unless the player takes it. I don't know who plays an RPG of this kind thinking id rather watch the npcs kill stuff while i try to get thier attention, but whatever not a big deal. One also passively does area damage to enemies and/or buffs allies while it doesnt make her a staple it just makes her WAY favored over some others. I wish the companions had more dialogue tree towards mid and end of the game vs once you find them you talk them to max loyalty immediately.  Finally i will menntion secondary stats such as subterfuge, athletics, lore(also a primary for some). I said earlier i focussed on being a monk and subterfuge with that being said the only I may have only been denied a handful of options requiring lore throughout the game. Those three stats are so homogenized through leveling that they don't really have a meaning. They became so common that skill checks were sometimes the wrong option in a dialogue path. Why do i need a well balenced party when i can do it all? This was not a suitable replacement to skill checks.  TLDR I may have ragged on the game a bit but overall it was a good game. I wouldn't play it again which is sad because the choices do matter and have a significant impact on the story. If the next game these people produce build upon this I will happily play it. : )",
            "review_score": "1"
        },
        {
            "review_text": "Loving this! The replayablity is astonishing! On my first play through I have already noticed many story branches that were all vastly different! This game thus far has been worth Every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Your level of investment into the story will determine how much you enjoy this game. If you are the kind of person who speed-clicks through dialogue menus to get back to the action, you will not enjoy this game.   There's a daunting amount of content here, each companion character has an exhaustive dialogue tree, a network of conversations that could each end in comradery or betrayal. The tension and release between a choice and a consequence is addictive.   I've never felt more like I was authoring lore, pushing the story in the directions that I found compelling without bumping into guard-rails. Despite the depth of the game, you realize that the real story hardly begins by the time you finish. This is a good feeling. With my prologue written, I can't wait for the next chapter.",
            "review_score": "1"
        },
        {
            "review_text": "I love it. PoE was a bit too much DnD for me - crowded with useless abilities/spells. The writing was decent, but the maps were most of the time just empty.  Tyranny streamlines/simplifies a lot of things for the better. Additionally the concept of wounds/health got iron out and is imho perfect as it is now. Dying will have the side effect of gaining wounds which will decrease your total health. Resting will remove those penalities but there is a limit of how many 'campfires' you can carry, thus rest.  Spell creation is a very nice addition to the whole mix, giving you a limited but nonetheless the ability to craft your own spells.  I cannot wait for part 2.",
            "review_score": "1"
        },
        {
            "review_text": "Let me start out by saying I do not usually enjoy these kinds of games. So I dont really have the ability to compare it to other games of this genre (think Baldurs Gate and... Pillars of Eternity, I guess?)  Which also means I dont know what people expect about this kind of game  Positive Things about the Game: + Story + Spell Creation System + Characters + Voices + Dialogue  Negative Things - Pacing feels a bit off? - Very simple fighting system? - Pathing Problems  So let me explain a bit and let me start with the negative Things I have listet, two of which were marked with a question mark, because some people might care, some dont. I for one didnt mind the simple fighting system.  Pacing: After you created your character, with a backstory that actually matters at some points, you get thrown into a tutorial screen. Have a first act. To show you the game and then the second act begins. Everything feels major and its fairly lengthy and then the third act begins which is rather short in comparison. MAJOR spoilers ahead   The third act for me was, do this, do that, have one more dialogue, go back to your tower cast a spell and... the game is done. I was fearing I only had a bit of gametime left when 'finish ALL of the XXX' achievements started popping but then act 3 began, I was relieved only for it to be like... 2 hours maximum playtime    Combat: Combat seems very easy to be honest. I played on the normal difficulty, as I am not very well versed in this kind of game, and I had... well one game over. You click an ability, click on an enemy and you wait. Repeat. You dont really need to take care of your party or... use the pause feature. Veterans of the Genre might be turned away by that.  Pathing Problems: Well this one is the most obvious and actually the only thing that really bothered me. Sometimes the AI just cant find a way or some of your more stubborn companions decided that they do not want to move so the flippin' healer can get in range. Its annoying, but not really enjoyment-destroying. Enemy AI seems to have this problem way less even though there is a lot more of them.    Unto the good points then   The Story: You're a rather high regarded person in the hierarchy of the 'evil' Overlord who is conquering the planet. You're not one of THE topguy, but you're the Protege of one of the probably top 3 guys. So you're a big deal and… the game actually makes it so you feel important. You can choose what you did in the first three years of the conquest of this region and people will remember and reference that. Sometimes you have even unique dialogue options because – when that happened you were there or even the one doing that. It really did a good job setting you up and making you feel important – and intrigued. What it may not have done very well is feeling evil. Yes, your side is obviously the aggressor but… its not like those people are very friendly. I never really felt evil (MAJOR SPOILER:   Except when I killed a baby  ), but in the end I didnt care about not feeling evil, because… thats probably because everybody had some good points to their agenda.  Spell Creation System: Okay this one might be just me. But I love how you choose an element (the core), than a Sigil (basically what kind of spell it will be, very close, a wave and so on) and then you can even upgrade them with accents (which give them more power, range, cooldown and mandy more). And you straight out assign that spell to a spell slot. The only limiter you have is the lore skill of said character and what kind of stones you'll find. I thought it was very unique and creative. You can also rename spells.  Characters: I love basically every character you can talk to in this game. Thats really all I can say. They are very well written, have their own… well character. Especially your companions really shine. Having a distinct backstory, remembering stuff from the conquest and so on. Only thing weird is the loyalty/fear meters they have since… they are not exclusive. So you can be max feared and loved by the same companion, but whatever. At least they're sticking to their guns.  Voices: NOT EVERY DIALOGUE IS VOICED. But every time somebody speaks they put actual effort into it. All voices that I came across fit. Nobody with a voiced dialogue sounded like the same guy speaking a different guy, at least not for me and I played the game in 3 big sittings, day after day. The more down-to-earth guy sounded exactly like that, the crazy person who you werent too sure was being serious ever… sounded like he had way too much fun in the recording studio.  Dialogue: I like the Dialogue-System. It has some of the more typical have X in this and you can answer with this, which I always really love and then on top of that… your background actually matters. You were there in the conquest when something happened? You can refer to that. Or not, but you could. You were that, for example, a Hunter before you joined the Court? Well you have some unique dialogue options. Thats just something I really enjoy.   Overall, while I think it is not perfect, Tyranny is still a very good game that can pull you right in, with its unique charme and humour. It probably will not go down as the best RPG in history, but in my eyes its definitely worth the asking price (of the standard/commander edition, dont be silly).  ESPECIALLY if you dont mind running through the game more than once, since it does have genuine changes in the story depending on what you do.",
            "review_score": "1"
        },
        {
            "review_text": "Fresh out of Divinity: Original Sin and I was looking for an RPG that could match the fun I had there. I found it here with bells on. The story telling is so immersive that you'll find it hard to stop playing because there's always that one little thing left to find out...not to mention the amount of choice and freedom (or, at the very least, the illusion thereof, which is a convincing one) you have when it comes to conducting yourself in the world. Side with anyone, side with no-one. Possibly the only slight critism is that it doesn't take a lot of gameplay before your party becomes ridiculously powerful (for reference, I was playing as a pure offensive magic caster) which can make some battle more of a formality if anything, but with the additional difficulty settings this can be very easily circumvented. Highly recommened.  Edit: Actually, one other annoyance - the ending fell a bit flat. Will forgive if there's a kickass sequel to come!",
            "review_score": "1"
        },
        {
            "review_text": "  As a big fan of RPG/CRPG games, I would definitely recommend this. As someone who likes being a 'good guy', I would definitely say 'get prepared to be evil, no matter how hard you try to be good', because this game is the opposite of the normal RPGs out there: YOU ARE THE BAD GUY. You're bad and you're going against the world, yet it's a lot of fun. As someone who hasn't really played CRPGs or is into games for cinematics or good graphics or doesn't like reading, this might not be the game for you.   I was gifted this game as a birthday present and enjoyed every moment of it. I just finished my first playthrough at 27.8 hours and am definitely going to have to go back and play a few more times because there is a lot I missed out on. Plus, I'm still missing 30 of the 50 available achievements and I just had a lot of fun with it.   Like all games, there will always be pros and cons, despite how much I loved and enjoyed this game. So, I'll just get right into it.  Pros:  *The fact that you get to be the bad guy is pretty unique in comparison to most RPGs.  *Enough content that you can't experience it all in one playthrough, so it has replayability. *I feel like I got my money's worth (despite not paying for it) and so does my husband, so we don't feel ripped off. Woot! *I like the fact that you get a variety of choices to make for your character and the choices actually do matter. *You not only get loyalty bars, but fear bars as well. This makes it more of a challenge to 'make friends'. I love it! *I felt like there was enough stuff to do in this game that it kept me interested every time I played the game.  *You meet a good variety of characters and definitely come to learn a lot about the lore of the world, which was very fun! *Lots of cool weapons and armor. I loved finding artifacts and feeling awesome because they made me more popular.  *Watching your character grow and change as you go along in the story. The same for your companions, too. *Creating your own spells and discovering runes and different types of magic.  *Getting to do a variety of things, such as dual-wield and be a mage, etc. Definitely different than most RPGs. *Taking over tiers and building them/shaping them into what you want, just like Pillars of Eternity. Lots of fun! *Watching your journey grow and become epic as you go on and feeling more and more of a badass. *The AI for the party is actually really good. I was able to finish a battle without pausing while away from my computer.  *Being able to hide or reveal whether something you say is going to anger or make someone happy.   Cons:  *The end sort of felt abrupt and not as epic as I was hoping it would be. *The world map is huge, yet I feel like we didn't use it all up.  *Personally I felt like there wasn't a huge need for potions. In fact, I don't think I used a single potion in my first play.  *Lack of conversations with your party. After a while, it feels like they just run out of things to talk about. *The first few moments of the game should have been playable instead of just choose your own adventure-esque. *Some parts of the game basically corned you and you didn't get a chance to be anything but enemies with someone.  *You have to be a bad guy and evil. I tried my hardest to be as good as possible, but still had to do bad things.  *Loyalty and Fear bars was a chore sometimes, because sometimes it felt like some people did nothing but hate you.  *Lack of cinematics in the end. I liked the slideshow style they used, but would have preferred a little bit more oomph.   I would definitely recommend you play this game or at least check it out. There may be some issues with the game, but I was overall pleased with it and am looking forward to replaying it and checking out the stuff I didn't try, yet.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy isometric RPGs (baldur's gate, Planescape, Fallout) then you need to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "  A very interesting and addictive story that I can't stop playing. Design, arts, music and atmosphere created by all of that is beyond praise. Just finished the first Act. If you liked PoE - it's even much more intresting.  Main differences in my opinion are:  - Greatly improved combat: it's more intersting now; all skills became more usefull and meaningful; new great combo spells that depend on loyalty of your friends; no bottleneck abuse anymore.  - No grind like in PoE just greatly envolved in the story.  - Nice system of Loyalties (all your decisions are really meaningful).  - Much more intuitive and easy user interface.  I guess this will be my favorite game this year.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. I wish there were even more companion interactions and quests, but that's not a knock against the game.  The spell creation system is incredibly fun, and my second favorite part of Tyranny. The first being my beautiful, delicate turtledove, Kills-In-Shadow.",
            "review_score": "1"
        },
        {
            "review_text": "I just spent 79 hours on completing my 1st blind playthrough on hard mode and am truely in awe of this game.  Choices and decisions matter so much that i can see atleast 3 'completely different ways' of playing from biginning to end so, multiply 79 by 3 and no im not joking, there will be as much of different questing, reading of different story archs and conversations as I have done already.   The combat mechanics and system is amazing ESPECIALLY the spell crafting aspect where you can literally taylor a single element (say fire) in about 30+ ways, seriously just google 'Tyranny spell crafting'. ALL, without exception, rpgs from now on should inherit the spell crafting system as rpg gaming cannon!  All i can say is that this game, after 79 hours has made me feel 1 thing since i started typing this... like ive just watched all the lord of the rings films...... I want the 3 before made and more for after what ive already seen!!!!!!!! Its not often a game makes me feel this enthused and hopefull for another tyranny game.  To summerise yes, i am an Obsidian admirer from back in the day and yes i do just insta-buy all of theyr rpgs and you know why, because like with Torment etc and more recently Wasteland 2, Pillars of Eternity, Torment Tides of Numenara (havent played but am certain its going to be a good one!!!!) and GGG withPath of Exile and others alike they reward my trust by never disappointing me and continually proving me right, earing my trust and therefore my money and respect as support.  GG Obsidian GG",
            "review_score": "1"
        },
        {
            "review_text": "Tyranny let's you be the 'bad guy', putting you in charge of subjugating an entire nation and crushing the resistance wherever it crops up. Things get more complicated than that of course, and there are some pretty gut wrenching moral choices to be had.   One thing Tyranny is NOT is Pillars of Eternity 2. Despite sharing an engine, and many of the same gameplay mechanics, Tyranny sacrifices scale for choice. By that I mean that the world itself is downright *tiny*. It contains only a handful of unique areas and each one is a fraction of the scale of a standard POE region. By scaling things down it is able to offer up a whole lot more variety, however. There was definitely a lot of 'fat' in POE - massive regions you could explore that didn't really serve much purpose. Every area in Tyranny is in service to a particular narrative arc, and offers you multiple choices in how you approach it.  Do you execute the prisoner to show your ruthlessness, or try to recruit him? Do you speak to your subordinates with respect, or do you slap them around when they question you? There is no 'wrong' way to play. Every choice has a consequence, in the form of gaining 'Wrath' or 'Favor' with a particular faction. The beauty of this system is that both grant you unlockable bonuses, so if you want to spend the game being a ♥♥♥♥ to everyone you will be rewarded just as much as if you act like a saint.   There is a particular point where I had to choose whether to kill someone, force them to kill their friends, become a slave, or become a turncoat that spies on their allies. All four options were kind of evil but I wanted to see how flexible the game was, so I opted for the last choice and let her go back to her people as a spy, hoping I could free her later on. Some time later I turned on the people who had captured her and joined up with the faction the captured NPC had belonged to. I found her in their stronghold and she tried to give me a status report on how her spying operation was going, which I dismissed and told her she didn't need to be a spy anymore. THAT is the level of detail they put into choice in this game, I could have played it any number of ways, but the game played along and let me manipulate it to wring a positive outcome from a hopelessly dark situation.   If any of that sounds appealing to you, stop reading and buy Tyranny now. Obsidian's writing has never been better, and the level of choice on display here is truly mind boggling. That being said, there are some rough edges, including a healthy number of bugs (characters becoming stuck, sounds not playing) as well as technical hiccups (poor multi monitor support, long load times). And at the end of the day, if you were looking for more grand adventure in the vein of Baldur's Gate, you may not find much to like here. Tyranny is a lesson in amorality, a short story that can be re-written in hundreds of different ways. Frankly, I find that refreshing in an industry where most decisions are presented as black and white, and even the 'grey' stuff you might see in a Bioware game feels contrived and artificial. Obsidian has that stuff NAILED.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I liked Pillars of Eternity, but this game is all that, and so much better. The graphics are above and beyond better than PoE and the deep lore is very impressive. Within the first 10 minutes of the game, I was making choices that impacted the entire landscape. I am really enjoying this game and even the highly complicated mechanics of PoE seem to have been simplified to make this game much easier for newbies to jump right in. I'm loving it so far.",
            "review_score": "1"
        },
        {
            "review_text": "I complete my first play of this game. Tyranny is a very very good game in term of lore, battle system, character advancement and art. It's just not yet finished. The story stop midway as you would expected the second game to roll out some time afterward. Worth the play.",
            "review_score": "1"
        },
        {
            "review_text": "First, If you dont get invested with the characters and the environment you will miss the game. Miss a quest or conversation here or there and ♥♥♥♥ is not going to like you expect... Your ending will reflect not only your choices but what you don't do as well. Gotta love that you influence the world without even knowing it.  Most seem to bash how short it is, and of course its short, ACT III could barely be called a chapter. But it has true replayability. Besides, most rush the main quest on relatively low difficulties. If you get the game, play on Story / Normal only until you get the mechanics &amp; by the time you make the first real big choice, restart on a harder difficulty.  The combat has been refined, custom spells, amazing combos, and no character-class locks (though NPCs are locked to class like paths). Most also seem to find the ending abrupt... but if your reasonably inteligent you see it coming. Of course the game will end when you have the power to take down / challenge / submit four of the worlds biggest badies or challenge the Overlord. Do I want more? Do I wish it was longer? Hell yeah. The world has intrigue and wonder. While I wish I had more answers about the setting, that there are holes makes the setting more beleivable, but there is enough info to hint at what fills these 'plot holes' if you search.  Biggest downside is the game will make you wanting more, or at least find out what happens when you do something differently. If your a crpg vet then this could get easy once your used to the abilities, late into the game I rarely had to rest after the 1st 3rd of the game even on the 2nd hardest settings (PotD is next).",
            "review_score": "1"
        },
        {
            "review_text": " If you enjoy cRPG , then you should grab this. Overall everything is ok: good combat , good voice acting with interesting companions , new kind of storyline , you started as evil. Although you will find it rather short for a cRPG , but it has decent replay value , especially for those who enjoy this type of game. I've alot of gameplays videos for Tyranny , take a look and see if Tyranny its the game for you.  I've done 2 walkthroughs for the game  HERE   I also made builds video guides for Tyranny:     Solo Builds      Team Builds     ",
            "review_score": "1"
        },
        {
            "review_text": "Beyond exceptional!  A small number of HUGE! choices that affect how the game plays out in the most significant way i have ever seen in an rpg! Lots of minor choices that have more immediate effects. Outstanding RPG elements! This is as close to the true pen and paper RPG as you can get at the moment! Really impressive! Obisidian outdid themselves with this one for sure!  Even though there are major choices theres still a huge amount of content for a single playthrough, playing on POTD it would probably take at least 20 hours to get through the game if you want to finish all quests even if you know everything that you want to do/choices you want to pick in advance/skip through all the dialog!   Massive replay value!  Almost everything you do matters in some way!  Interesting party members and great character customization overall. Unfortunately there is one character in particular who is plain bad from a combat perspective *cough*Barik*cough* (i have to mention at least 1 thing that is bad, dont i?).  Streamlined and refined compared to its predecessor, less walking more doing things! Refined gameplay.  If you liked Baldurs Gate 2 or other CRPG at some point this is a must buy.  If you hate reading and/or rpgs you should stay away (chump!)",
            "review_score": "1"
        },
        {
            "review_text": "This is far and away one of the best stories you'll find in any recent story-driven Adventure RPG type game. The combat is fun and satisfying. The choices you make have ACTUAL consequences. The characters are absolutely fantastic and fully fleshed-out beings. The ending... comes a bit too early, honestly. The only thing I could possibly find to criticize about the game is that there isn't enough of it, but having jumped into a second run the moment I was done with the first, I can't even really say that since the replayability is so high. The way the story unfolds and branches out makes it very rewarding to play through more than once.",
            "review_score": "1"
        },
        {
            "review_text": "The best part of Tyranny is Act 1 and the conqest map at character creation, beyond that the flaws begin to rapidly pile up. Even if you manage to avoid some of the more gamebreaking bugs Tyranny still lacks in almost all areas, the abrupt ending especially left me wondering if I accidentally bought another unfinished early access game. Combat is easy even on higher difficulties, with the only real challenge I found being the last fight of Act 1 or struggling against the braindead AI. The funny thing is I actually enjoyed a lot of my time playing, largely due to the interesting world setting and magic system. Its just a shame the story and the choices actually don't matter compared to the bland narrative the game railroads you onto.  ",
            "review_score": "-1"
        },
        {
            "review_text": "It is very short and doesn't feel like a full game and is certainly not worth £35. Its great for what you do get to play but then it just stops short for no apparent reason other than it was probably cheaper to make a short game.",
            "review_score": "-1"
        },
        {
            "review_text": "Some quality cRPG goodness. I honestly think I might like it better than Pillars of Eternity. I finished the game at just under 20 hours, but that's after switching to easy at the halfway point because I really just wanted the story. I did do a few fights on normal and hard however just for giggles near the end.   Pros- Fantastic, lived-in setting Great all around writing Interesting companions (basically all of them are good) RTWP is still the best combat  Beautiful visuals The characters and setting react pretty strongly to your choices, that is always cool to see Crafting your own spells is fantastic  Meh- Too much junk combat. On harder difficulties the fights are interesting, but honestly there's just too much.  The new skills system. Leveling by doing is an interesting idea and sometimes it works well, sometimes not so much  Bad- The ending. This clearly could have been an 80+ hour game but I suppose Obsidian just didn't want to make it. Wrapping up this whole thing in one go just wouldn't have worked but the ending still just isn't very satisfying.  Overall, I can't recommend this game enough to RPG die-hards, for those who haven't played a game in the Baldur's Gate style though, maybe wait for a sale before hopping in here.",
            "review_score": "1"
        },
        {
            "review_text": "A Excellent RPG, in a world where the evil has allready own there isnt much left to do. or is there?  You can take on many different paths towards an ending, the most crucial selections are in the first act as you decide which path you will take.  Working with the Honorbound Disfavored, a group of knights following the Archon of War, the Archon of War gifts them with near immortal bodies.  Working with the Scarlet Chorus, a hoard of many different people. Their Archon, the Archon of Secret rules them through intimidation and fear.  Working with the rebels taking back their beloved Tiers  Working for yourself, this one gotta be my favorit.  As you play the game you find many various items, spell sigils and artifacts to further your conquest be it a loyal follower of Kyros, a Rebel or a Renegade seeking to claim the land for your own. a smart choice is mixing social skills into other skills, Athletics not only let you perform physical strainous tasks like pushing boulders, leaping great distances and the like (note those leaps can only be done at set points where the required level of skill is revealed) it can also be used for intimidation both physical or veiled threats. Subterfuge gives you the ability to find secrets, open locks, disable traps, stealth and lie in social settings. an over all important skill. Lore gives you access to resist things socially, reveal knowledge to impress or frighten someone. In addition to that it is needed for how much modifications you can do to a spell.  These three skills mentioned are infact super important to keep as high as possible, not only for social and revealing hidden items, getting to secret locations or the like but also to level up.  As your skills gain xp from being used, they give your character xp which gives you levels. Levels gives you attribute and talent points to further your powers.  Attributes affect several combat releated bonuses as well as several of the skills, you should focus on 1 or 2 at a time. Up to 19 an attribute cost 1 attribute point, from 20 and up it costs 2. I am sure that it will cost 3 and more if you grow it far beyond 20. Personally I have never taken an attribute point past 20, instead i focus on other areas to improve skills and general combat bonuses.  Talents work as in most rpgs, they improve your overall combat abilities, grant you use abilities and passive abilities.  Companions There are few companions and no romance as I have found, however they are rich personalities and fun to befriend. Each companion have 2 reputation scales, Loyal and Fear. Depending if you max out one or even both you get powerful companion abilities. These companion abilities have either 1 per encounter use or 1 per rest use.  Factions There are many factions and powerful indeviduals in the game, and like companions they have friendly and wrath reputation bar, some of them grant abilities based on Friend or Wrath reputation.  Leveling With the aid of the Consol command i made a character with cheats to find out the maximum skill and level, at level 436 and a skill at 890 i stopped bothering, it seems that maximum level and skill level is 999 so good luck maxing all skills and levels. In a regular game I reach act 3 at level 12ish with around 120 in my most used skill lore. I also noticed in the Cheating game that it might not be wise to cheat at all, because suddenly some athletics checks that needed 30 on my non-cheat character was 999, ofcourse i was level 300 something. regardless. the game isnt hard and really do not require cheats. However I have not found places to grind for levels, but a few tricks. Buying Training points each level, Each level up you have you can go to a trainer and buy 5 skill points, I tend to choose Athletics as it is the hardest to level up. Subterfuge, use stealth on enemies before attacking, lurking towards them gives you a great amount of subterfuge xp, Lore well casting spells gives you lore so just keep throwing those spells to keep it growing, in addition the more lore you have the more complex modifications you can do so win win.  My Non-Cheat characters have all been mages so Lore has always been highest, I also run with 2 of the 3 spell casters as my team and use the 'Ranger' companion which is the first one to join you, she has decent dps and can work somewhat like a tank.  For the Bad things Okay the game crashes a lot, so save often. Usually happens when you zone from one map to another. The tank character: horrible horrible companion, and tanking skills for your main character more so. So dont attempt being a tank, it doesnt work. AOE abilities from magic is far better at keeping aggro, make a beefy mage with a lot of cone elemental spells, it will work wonders. No Romance: Not that it needs to be in an RPG game, but it gives more flavor. But then again the story is lined up so that you act like a ruthless killing machine anyway, so no time for love i guess. Locked Gear: Some companions have locked gear, so they cannot wear gear thats much better than what they currently have, like artifact armor parts.  I am sure others have things they complain about, but that was it for me.  ",
            "review_score": "1"
        },
        {
            "review_text": "I can't remember the last time I had this much fun ignoring the need to eat or sleep for an entire weekend.",
            "review_score": "1"
        },
        {
            "review_text": "SOlid CRPG. Very morally ambigious, choices feel like they matter",
            "review_score": "1"
        },
        {
            "review_text": "Megadeth: Killing is my business and business is good! Anthrax: I am the Law!  This game is very METAL :D  I love it \\m/",
            "review_score": "1"
        },
        {
            "review_text": "Is good. Not perfect. But is good.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so I tried to go to sleep early, but this game just would'nt let me. Nope, nada. Gotta go forward... Need... To become... the new ruler!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "A very impressive CRPG where your choices actually matter and what you do affects you later down the games story line",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, 70 hours in haven't finished the game (because I've recreated my character 10 times).  Solid 5/7.",
            "review_score": "1"
        },
        {
            "review_text": "First and foremost: I really enjoyed this game. It has a lot of pros, but also a few cons, which lower the overall mark.  Pros: 1. This game (such as PoE) has amazing graphics. Upgraded PoE engine (2D+3D Unity) serves this game really well. Fantastic hand-made 2D-backgrounds with really decent 3D-models look gorgeous. 2. Music is also fantastic. One of the best fantasy OSTs of last years. 3. Lore is more simple compared to PoE and you learn it slower, whic also is a huge plus. Additional respect for floating hints in dialogues. 4. Role system is quite complicated, yet simple enough to understand how to level up properly. 5. Fights are more dynamic than in PoE and also look great. 6. Magic system is awesome. Basically, all spells are categorized in a specific way and you can create new spells with some increased values. 7. Setting is also nice. It's something new at last. Bronze/iron age, plus fighting for the tyrant. 8. You really can resolve issues in many different ways, which makes game replayable. 9. Voice acting. I really enjoyed it. Bleden Mark was especially good.  Cons: 1. Dialogues. Not all dialogues have sound, many of them are presented just as text. This might have been fine (due to development time and budget restrictions), as there are quite a lot of dialogues in this game, but... Even with one NPC you can have lines, which are voiced and lines, which only have text without voice. This inconsistency really grinds my gears. 2. There is not enough interaction with companions. There are no companion quests, companions have VERY little talk with each other, and once you have dried out all dialogue options with them - puff, you have almost no new ones. 3. It's quite short. I have beaten it twice, reading ALL the dialogues, searching all the corners. But honestly, this game is just 15-20 hours long. 4. But length itself is not the main problem. Main problem is with plot. This game consists of 3 acts. First act is kind of short prologue (which is fine), second act is very long (and a little bit dull from main quest point of view) and third act consists of about 20 minutes of gameplay. And then - game over. VERY frustrating. I mean, there should have been 4th and 5th acts, I can feel it. 5. And the ending itself was quite bad, honestly. Way too many unanswered questions.   So generally this is a really great game (especially for isometric cRPG fans), but it just looks... unfinished. So in my eyes it's about 7/10. Hope this review would be helpful.",
            "review_score": "1"
        },
        {
            "review_text": "An improvement over Pilars of Eternity. It is more streamlined, yes, but at least it respects the player´s time and theres not much of walking back and forth. Quests are interesting, as well as some of your decisions. The party size with only 4 characters make battles more fast paced and there isn´t as much trash mobs as PoE. I also enjoyed the upgrading system more. A good CRPG overall.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Cant stop playing it once you get into the lore and everything. Easier to follow that Pillars. Spell creation is also super fun. With the cooldown system, now combat is fast and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Very happy with this game. The story is dark and immersive, and there is so many possible choices! The magic system is one of my favorites of any game and that is saying something. Being able to craft your own spells and tweak them to your playstyle is awesome. I highly recommend this game if you are a fan of Planescape Torment and other such games.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed Tyranny; the table top beginning part alone during the character creation sold me on the game. Plan to play it more to get the alternate endings; my first play through was a bit gray.  Only Con for me was that it was too short. I really hope they add some DLC.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend Tyranny to those that enjoy good story telling and fans of RPG's. It has an excellent cast of voice actors. The music isn't that much but it's fantastic. The models, lore and character back stories were excellent.  I played through the game my first time and thought I got a very good ending i.e. became a superpower that rivaled Kyros. I did not get the sense that evil truly conquered. I found it lack luster in this regard. Rather, I found Kyros as a tyrant that was bent on conquering the nations. I really liked Tunon the Adjucator.   The ending reminded me of Fallout 3 NV ending. The choices were made throughout the game that impacted the ending slides. The ending was mediocre in my opinion. The ending slides didn't create closure but left, what I would call, material for a sequel. But, this requires more play through. I really hoped to challenge the Overload and dispel some myths about the Overlord.  Near the end, I found character interaction sparse. Wished the characters had more dialogue in this regards.  I played this game on an Intel Core i5 520M, Intel HD graphics, 4 GB RAM, Win 10. This was subpar from the min specs. Did experience horrible loading times in particular to Lethian's Crossing.",
            "review_score": "1"
        },
        {
            "review_text": "meh, i expect way more of you obisdian.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much what you expect it to be. This is not a bad thing!",
            "review_score": "1"
        },
        {
            "review_text": "On of the best RPG I ever played. Short, in my opinion, but awesome. I look forward to a sequel. Still not Baldur's Gate saga successor but very close anyway. 9 out of 10  At the time I played it, the game still had some bugs.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. If you love story driven rpgs this is for you. Also the charater creation may be the best thing i have ever done in a games it really is unique.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a little jewel.  I write this review just after finishing the game - sorry not the game, but one of its multiple stories. I have played the game for 60hrs, not bad for a 'short' game. Speaking of it, I wonder how people do to finish it in only 20hrs. Surely they do not read, or play in easy or normal mode. What a waste, this game deserve so much more.  This game is a little jewel of writings. The dialogues are greats and numerous. Every characters in this game has something to tell you. They are better than the ones in PoE IMO (which were already very good), often shorter and more interesting.  This game is a little jewel of story-telling. The story is excellent, one of the better I have had the luck to play. The possibilities are huge, there are multiple choices and decisions in each Acts. Some of them are minors, like siding one faction or not, but some are pretty big, opening new story direction. It is very well done, because even if I just finished the game (one of its story), I want to relaunch it just now, to discover another story with different character and different choices.  But, as an Obsidian jewel, this game has the usual default : bad combats (they are really bad, worse than PoE), some bugs (only technical ones, I have not seen 'story' bugs), some weird twist in the story sometime (very few), and of course an average ending, like every Obsidian game. But aside of that you have also great musics and graphics, which support very well the immersion in the story world.  This game is a little jewel.",
            "review_score": "1"
        },
        {
            "review_text": "Great game adds a lot to the isometric RPG genre, as well some new avanues to story telling. It is still working out some kinks here and there, but I expect this to become the new gold standard to this once dead genre.",
            "review_score": "1"
        },
        {
            "review_text": "Better than PoE, worse than BG2",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Spectacular story telling coupled alongside excellent world building  You can perform an abortion during the ninth trimester  Cool weapons  Cons: Short  Barik is a little b1tch.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Like Pillars of Eternity. Good game mechanics, lots of reading. Encourages multiple playthroughs. Good pickup for Baldurs gate fans",
            "review_score": "1"
        },
        {
            "review_text": "If you loved Pillars of Eternity you will feel the same way about Tyranny. Classic rpg goodness.",
            "review_score": "1"
        },
        {
            "review_text": "I was very interested in the game and now that is out i can say is really a great game. Nice old style rpg developed with great care and attention, very well structured , very immersive and with great freedom. (every choice made have an impact ingame and also on how your relation with npc will be) This game is especially dedicated for fantasy book lovers due to the great history and many text to read ingame.   Positive point  -Completely customizable spell system -Many treasures and artifact to find with no limit space in bag -Amazing soundtrack -Great possibility for expansion and/or dlc  -Very versatile character builds with many option (especially the main character). -Amazing enviroments, developed with great care and wonderful from the graphic point of view with nice artistic inspiration -Great party member -High Replayability with many choices and different outcomes -Customizable intro with multiple choices that will affect gameplay later in the story.  Neutral Point  -Game lenght   Negative point  -Long load times   Overall vote: 9 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "A more streamlined and focused version of Pillars of Eternity with a more interesting premise. There isn't much exploration or dungeon-crawling, as the game is very quest-focused. There's very little filler. Unlike most fantasy RPGs, there are no skeletons, wolves, rats, bears, spiders, zombies, goblins, trolls, etc. Most of the combat encounters are relatively small (typically 4-5 enemies) and serve a purpose within a specific quest.  Tyranny also introduces flexible spellcrafting system which is interesting to use, though the spells you make can get pretty overpowered. As a result, the game is much easier than Pillars if you focus on magic builds. Also worth noting is the removal of consumable spell scrolls. I've generally found those to be pretty useless in RPGs and apparently Obsidian felt the same way. You can still find scrolls but these are used to unlock different properties for the crafting system.   The writing meets the Obsidian standard and provides plenty of compelling characters to meet and choices to make over the course of the game. You actually get to affect the narrative and world in pretty significant ways. There's a faction and reputation system similar to that of New Vegas, only much more granular.  If you liked Pillars of Eternity and want something more concise and open-ended, Tyranny should fill that need.",
            "review_score": "1"
        },
        {
            "review_text": "I have some reservations.  I love the idea of Tyranny and thought it was fantastic how it flipped conventions on their head (not disimilar to how Planescape: Torment did the same way back when). However, the game loses some of its quality by the third act. The story seems to accelerate suddenly and crazily. The ending can be described as dissatisfying. To avoid spoiling much of anything I'll say that it flipped the plot back to the conventional.  This is not a half-done game by any means, merely one that feels 80% done. However, it is fantastic and fun with a pretty strong story that only really frays by the end.",
            "review_score": "1"
        },
        {
            "review_text": "So, this is going to be a long review, with one or two spoilers and plenty of comparisons to other RPGs and their mechanics. You have been warned.  First, let's get the negative stuff over with:   -At some point, you will probably feel railroaded into making a decision that your character should have the opportunity to avoid. This would work better if, say, the Disfavored had some kind of leverage over you that they could use to force you to keep the land around Cairn blighted, or if the storyline made some excuse for not letting you visit blocked off locations ('no, you don't have time to visit the Burning Library, there's a war on!'). But no. I'd really love to see a patch or an expansion pack that added in the decisions that seem to be missing in these situations (more opportunities to sabotage or betray your alliance when they're making sweeping decisions that you don't agree with, the opportunity to neglect the main quest to break more edicts, etc.). I found there were still fewer 'well too bad, I'm making that choice for you' moments than in other RPGs, and that a lot of them felt like natural consequences of other things I'd done, so this doesn't detract much from my enjoyment of the rest of the game.  -The third act is rushed. Very, very rushed. It's basically a dash from one boss battle to the next. Again, not a big issue, but it feels odd, and it adds to the feeling that this game is absolutely crying out for a Throne of Bhaal-style expansion pack. (After all, at the end of the game, we still have one very ♥♥♥♥♥♥-off Overlord that we haven't settled things with...)  -There is no manual. I tend to figure things out as I'm playing anyway, but it's not super fun to blunder around looking at icons and effects and trying to figure out whether you're sending your character into battle completely unprepared. If you've played Baldur's Gate, Icewind Dale, or a similarly old-school RPG, you should be able to blunder pretty successfully, but I hate to think what the learning process would be like for a pure Action-RPG player... and honestly, there's no excuse not to at least have a tiny Quick-Reference PDF.  -Tiny, tiny quibble: there's no need to sleep in this game, unless you're healing wounds or recharging an ability. This is at odds with Baldur's Gate, where you'd get 'fatigued' and suffer penalties to your combat skills unless you rested regularly. I was expecting this to be a difficulty factor in the game (making ambushes while traveling more difficult to deal with, making the time limit to deal with the Edict in act one more of a pressing worry, etc.), but... apparently Fatebinders and their buddies don't need sleep? Ever? Maybe this is just because I was playing on Story Mode, but I'm honestly disappointed.   -And if you're a big fan of the romances in games like Baldur's Gate and Dragon Age, be warned: you're not going to find any lovey-dovey subplots here. (In my opinion, RPG romances are a bit of a mixed bag in general, and they wouldn't work particularly well with this setting and plotline anyway, so I think that was a good move on Obsidian's part.)  And here's why I'm in love with this game anyway: -Forever ago, there was a mod in the works for BG2 called 'Mod For The Wicked,' which was supposed to give you compelling new ways to play an evil Bhaalspawn that went beyond the usual 'Hi there, I'm gonna be a ♥♥♥♥ for no reason and also lose out on all this gold and experience.' As far as I know, it basically ended up being vaporware apart from a couple of NPC/class modules, but now you have the chance to play Mod For the Wicked: The Game. There are so many different kinds of evil, neutral, and ambiguously good characters that you can play, and I'm looking forward to trying out all kinds of character concepts that wouldn't work in more traditional, good vs. evil-style RPGs.  -Also, you know those origins in Dragon Age: Origins? The ones that mattered for about half an hour and then mostly didn't? In this game, the background you pick for your character pops up throughout the story, and it can potentially give you unique ways to deal with characters and quests. It's still not as influential as I'd like, but it's a fun upgrade of the whole Origins idea.  -Whatever your playstyle, you're likely to find yourself staring down some pretty harrowing ethical quandaries. It's amazing how easy it is to find yourself saying 'well, they're in my way,' 'I have orders,' or something even worse. Playing a Fatebinder with any kind of moral code is hard- and since usually playing a good character just means 'I played the game the designer intended,' I really enjoyed the fact that making the warm and fuzzy decisions actually comes with its own set of consequences.  -I didn't find the game as a whole to be too short- instead, I thought that it was easier than usual to get drawn into the story, I never felt like I was slogging through filler or hacking my way through a lot of unnecessary spam-soldiers, and it took me about the same time to complete as my usual BG1 playthrough. All in all, it was paced pretty well apart from that third act.  -The puzzles were reasonably well-balanced. I had to do a lot of searching and trial-and-error for some of them, but in general, I was able to make my way through the Oldwalls and such without finding them eye-rollingly easy or impossibly hard. Which is good, because the wiki is patchy, and the stuff I found on Gamefaqs is no help at all.  -The magic system is so fun that my archer/rogue ended up morphing into a mage about halfway through the story. And that's another plus: hybrid classes are viable and fun. I think my next playthrough is going to be a part-time mage with a whacking great two-handed sword.  -Also, each of the three skills that influence your dialogue options are fun. Especially Athletics. I've never had the chance to pick up this many people by the neck and force them to apologize before, and it's kind of addictive.  -The relationship system is similar to the one in Dragon Age 2, except (a) they're on different axes, so it's possible (and very useful) to have someone both love and fear you, (b) they're not nearly as difficult and fiddly to manage as the Friendship/Rivalry meter, and (c) it's tied to plenty of new dialogue options, powers, and attacks, along with some major story options (like making major characters swear fealty to you when you get *really* powerful).  -The relationship system also extends to artifacts. This allows you to unlock some pretty useful artifact-based abilities, but mostly I'm just weirdly pleased that my sword likes me so much.   TL;DR: Is this a perfect game? No. Is it an experiment worth playing? Yes. Is it the most fun I've had with an old-school RPG in ages? Hell yes.",
            "review_score": "1"
        },
        {
            "review_text": "Note: I did not finish the game yet...but I have played enough to write a review.  The premise of this game is interesting enough. The beginning is very rich and detailed and through the first act you feel like your decisions are making an impact. That you're an ♥♥♥♥♥♥♥ is icing on the cake; that you get to decide what type of ♥♥♥♥♥♥♥ you want to be on a case-by-case basis is a really good take on a genre that too often presents 'choices' that amount to 'do the right thing and get the best items' or 'be bad and we actually didn't really finish that part of the game, oh well.'  Unfortunately, the game quickly makes it clear that beneath the interesting premise and fresh take on the lore and protagonist you're still just a typical blank slate guy/gal with party members questing in a fantasy world. As a Fatebinder, you're supposed to be the final arbiter of Kyros' law, but too often I feel like I'm being spat on and talked down to by other characters. I'm part of a conquering empire and my decisions are binding, but I never get the sense that this manifested itself properly as fear and respect (even though fear is a reputation metric). There was a lot of indifference and snarkiness, though.  Even some of the choices are a bit bland. Sometimes, you're presented with three options - help one side, help the other, or be a jerk and betray them both. They're presented without much context and the basis of your decision is, again, 'what kind of ♥♥♥♥♥♥♥ do you want to be?' For example, you conquer a town and you can hand it over to one of two factions that will either slaughter the townsfolk or conscript them, or you can take it for yourself. It's not really made clear how any of these decisions impact your game going forward, if at all, or why you should give it to one or the other (both commanders make their cases, to be fair).   The combat is interesting and very nostalgic for those who grew up playing Baldur's Gate and Icewind Dale. It's a very simplified version, which is a give and take. I like it because I don't need to spend hours on character creation and on each subsequent level-up. However, the simplicity of it leaves one wishing that their choices on level-up had more impact on the direction of a character build.  The dialogue is interesting to read and really does a good job of sucking you into the lore and keeping things interesting. It's a shame that your responses aren't as rich. There are the standard responses, but a lot of the more interesting dialogue options are gated behind specific skill thresholds and backgrounds.  Overall, I recommend this game because it's fun and interesting to play and you won't regret buying it. I wish there was a scoring system instead of a Yes/No on Steam, because I'd give this game a solid 7.5/10. It's certainly got a nostalgia factor going on, and the introduction is really well-done. But there are instances where I just didn't feel like a Fatebinder.",
            "review_score": "1"
        },
        {
            "review_text": "that's classic Obsidian game. there's an RPG, there's plenty of choices and replayability, there's plenty of useless stuff, and there's lack of design quality in terms of animations or aestetics (some locations are pretty, but most are super generic).  whatever I think of this game, I wouldn't mind of sequel, this game is entertaining enough.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished my first run and I feel so ♥♥♥♥ing bad about the choices I made, like I realized that i'm a complete piece of garbage. This game made me open my eyes on my true self. Just wow. Didn't think I could be such a ♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic RPG by Obsidian. The combat is great and the companion combos are really sick to pull off. Great replayability and fun story with some interesting twists. If you enjoy a responsive RPG this is for you!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend that game for RPG fans like BG, PoE etc.  Nice game, nice story, excellent game mechanics – towers, letters, etc. overall I hope for more games/dlc like this",
            "review_score": "1"
        },
        {
            "review_text": "What a great game, good crazy characters, what a time to be Evil  Only downside is the poor ending :( (Hoping it is setting up an expansion) ",
            "review_score": "1"
        },
        {
            "review_text": "This game is suprizingly fun. Furthermore there are more than 1 way s to play it and I find myself enjoying trying the different possible endings. Several problems that had been the case to similar tittles of paradox seem to have been adressed.  pros:  -there are no classes or experience points this game is dependent to skill leveling similar to skyrim. The main protagonist is the only character that can excel in everything though. -unique companions each with there own traits and abilities - interesting magic system. The spells in this game can be customized to incredible dept - Dialogs have been rationalized so they are not the walls of text you remember from pillars  Problems:  -Not bug free but nothing gamebraking. worst bug so far was a scroll up problem during dialog. -companions tend to excel in what they do better than you can ever hope to do in a particular aspect. This ranges from magic to close combat. Your special companions can always do it better -high level magic fries enemies, serves them in a plate, adds seasoning and prepares coffee cockies and desert. Maybe a bit over the top. ",
            "review_score": "1"
        },
        {
            "review_text": "  Once again Obsidian delivers a diamon in the rough. It's an easy recommend, but for newcomers I'd simply warn that bugs can be common (although not in any way game breaking for me) and be ready for a different approach to the kind of story writing than you'd usually see in other similar games. Obsidian has a love for the obfuscated - and it will usually take more than one playthrough to really understand everything that is going on. Especially in this game, as it was designed around just that.",
            "review_score": "1"
        },
        {
            "review_text": "Story: 9/10. Good beginning, great middle, rushed end. However, the excellent worldbuilding more than makes up for the shortcoming of the ending.  Gameplay: 7/10. Nice variety in the combat, though many of the options are superfluous, even on the highest difficulty level. The game is most difficult at the beginning as enemies sharply rise in power/number while your party's options are still limited, but you will quickly outstrip the enemies in terms of power after that. Play on normal unless you want to min-max your party, in which case Path of the Damned will provide several points of tense action.  Overall: 9/10 If you enjoy RPGs in general, even if you've never heard of cRPG before (like me), then get this game.  NOTE  This game still has several gamebreaking bugs in it, so be prepared to have multiple save files. There's been a patch that has fixed some, but not all of these bugs, so hopefully in the future they'll all be patched out. Keep that in mind if you want to do the Ironman Mode.",
            "review_score": "1"
        },
        {
            "review_text": "Everything you wanted to do in Baldur's Gate but couldn't.  Lesson one: How to send a message to those at the bottom of a tower on which top you currently stand:  Ingredients ---------------- 1 slave or prisoner of war 1 piece of paper pen or quill and ink  Instructions ---------------- 1. Write message on the paper 2. Apply paper with message to slave or war prisoner 3. Kick slave or war prisoner off the tower 4. People below now have one unread message  I was skeptical considering how much I loved PoE, knowing there were some changes, most notably 4-man parties and no possibilities to entirely build your own party from scratch like in PoE, D:OS or IWD. Also I'm not a fan of Bronze age and similar settings. Nonetheless this game not only lives up to PoE but it is even better. The story, the graphics, the design, the attention to details, everything is amazing and your decisions actually have an impact on the game, before and during the story. All of this delivered without any Early Access or pre-order DLC nonsense, I've found but one bug so far during character creation, that's it. Tired of Mary Sues' and politically correct medieval plots? Have bloodlust? Wished you could be a cleric of Bane or played a cleric of Talos in BG2? Want to walk around judging and condemning people for the lulz? Buy this game!   I have i5 6600 non-K, 8gb ram, w10, gtx970, ssd and the game runs like a charm.  I raise my severed heads to you Obsidian!",
            "review_score": "1"
        },
        {
            "review_text": "Unique  This game is, for better and worse, different than pillars of eternity. The story is phenominal, the combat system is bland if you want to be really good at one single thing(unless it's magic) but really shines when you mix and match different aspects. Loot effects and abilities are really fun but item scaling is poorly done and bland but doesn't take too much away from the experience.  What would make the Tyranny experience exceptional is a sequel succesfully following up on story decisions.   Easily worth my money for the story alone.",
            "review_score": "1"
        },
        {
            "review_text": "Burned down a village, broke a guys arm. Just need a hug",
            "review_score": "1"
        },
        {
            "review_text": "20 hours of my life later, and I can honestly say this is one of the most in depth stories I have played in recent RPG's.   +Battle is super smooth +Hard is HARD +Crafting, upgrading, researching +Spellcrafting is amazing +Virtually endless loot  -All the negative reviews  They need to hurry up and release a DLC or second installment.   10/10, would play again",
            "review_score": "1"
        },
        {
            "review_text": "it's a game where your decision matter. If you chose one side you will need to fight other side and see a consequence of your decision. Also this game is a little different from other games like that as here you play as a 'bad guy' so you dont save world but you want to see it in flames! Game is short but it will want you to play it again and again until you see all endings as there is few of them.",
            "review_score": "1"
        },
        {
            "review_text": "Much has been said about this game already, so if you want to know my opinion in-depth, I suggest reading my other--more critical--reviews.  Suffice to say that this game is what Pillars of Eternity should have been. Interesting companions from minute #1, a tall tale that gripped my attention from the very start, choices with real consequences, and unfolding secrets in a considerably long and detailed game.  Yes, the combat is still a bit meh, but it has improved a lot over Pillars of Eternity in my opinion. Same goes for the unintuitive UI. I struggled a bit with both at first, but by now it is a lot of fun to combine abilities and rain havoc upon my poor mortal enemies. The game kinda wants you to be a mage, which limits your companion choices, but I can live with that.  To anyone who loves Planescape Torment as much as I do, buy this. To anyone who loves Baldur's Gate, buy this.  To anyone who doesen't like to read much, don't buy this. And stop calling yourself a roleplayer, mkay?",
            "review_score": "1"
        },
        {
            "review_text": "Nice idea but it's constrained by a total lack of complexity. After a while of going through act 1 as a Fatebinder, you are forced to just give up any authority you might have had by a dialogue that only presents two options. Either of these options constitutes picking a band of incompetents and declaring yourself their biggest fan - suddenly, the other subjects of Kyros decide that you are persona non grata and start avoiding you, while your supposed authority as a Fatebinder amounts to, it turns out, exactly nothing - you get to make meaningless arbitrary choices between options that other people present to you.  Graven Ashe, The Voices of Nerat: Congratulations, you just got yourself killed by dismissing one of my orders - calling it a 'weak compromise' doesn't change that it was an order. *camps for eight days*  It's a nice idea that you have freedom of choice, and it's what this game DEPENDS upon. The character creation gives you a rich backstory and goals, most of the game's content is in making decisions.  But then you are arbitrarily told you can't make certain decisions, because although the people following you will follow your orders, you simply aren't allowed to give them. And also the game will punish you with reputation losses for trying - if these don't make you change your mind, tough, because you have to change your mind.  Incidentally, the choice you're offered is, according to the people in the room, dependent on knowing completely unknowable variables. One of them asserts it's about military tactical expertise that you have no way of assessing. The other asserts that it's about not interfering with something that the game refuses to explain, because it may or may not have some significance. How are we supposed to use world details to inform our choices when those world details are kept secret? Foreshadowing 'oldwalls' and 'spires' just results in a character who apparently has infinite forbidden lore knowledge but doesn't know anything about things peasants discuss as a matter of course.  This wouldn't be a problem except that the gameplay has little challenge or complexity and the story is really what is supposed to drive the game. Characters have skills that do very little and increase very easily, attributes that provide a few percent in bonuses, and very large regenerating health pools that make it very difficult to die on normal difficulty even when you use Vitality as your dump stat. It's not a deep enough experience to be worth continuing for.  Also, I find it a little dishonest more than anything that the first conversations you have are FILLED with little world links that explain things and reference your history... and then these little links essentially stop for the rest of the game, there's like one of them in act 1 outside of that first dialogue. Meaning it's laid into the first dialogue to impress reviewers and affect first impressions - but not actually representative of the game experience.  Basically what I'm saying is, I really wish game designers would COMMIT to their ideas. If you want a story about player choice and nuanced morality, write one. Don't just SAY you've written one to sell your game.  EDIT: I mean, I'm still PLAYING it tho. This stuff just makes it about as good as other modern RPGs, ie kind of disappointing and limiting but in a slick package.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm only leaving a review because I'm tired of seeing all these idiots leave their ♥♥♥♥ negative reviews for dumb stuff. (Waaah there are too many girls or why do we have cooldowns instead of per rest spells waaah)",
            "review_score": "1"
        },
        {
            "review_text": "Pros: + Great storytelling and writing. + Replay value. I'm just starting my second playthrough and already the story unfolds completely different. + Choices. Right from the start this game is all about making choices and then dealing with the consequences. There's rarely ever a clear cut right or wrong answer. The choices you make have weight, meaning and the game is full of them. + Graphics. Tyranny shows how art style and a great foundation in lore trumps the latest shaders and effects. The game world looks gorgeous. + Combat system. It's a fair bit simpler than most other, similar RPGs but I like it. It doesn't drown you in hundreds of stats, most of which you'd end up ignoring anyway, but rather keeps everything clear cut and well explained. Most of the skills make sense and are fun to use. What really stands out is the companion combo system as it makes your party lineup matter.  Cons: - Character progression. Throughout the entire campaign your hero doesn't really change shape at all. At the end of the game he looked pretty much exactly like at te start. It's because of the... - Item system. If you like seeing your protagonist go from zero to hero via epic items and shiny armor, Tyranny will kind of disappoint. All of the items are fairly generic both in terms of stats and looks and, besides their base stats, have little to no meaningful impact on combat. There's only a relatively small pool of base items and not a lot of progression on them. The only notable exceptions are the artifact items. The idea of making them carry exclusive combat abilities is great. Sadly this feature just isn't explored enough IMO. The lack of diversity here is kind of sad, because as far as story goes your hero grows into this super powerful entity but visually he'll look just like the peon your started out with.  To sum up: If you are into RPGs and particularly cRPG and you have important things to do in your life right now, do yourself a favor and hold off on buying Tyranny because it will hook you to the computer for 40 hours at the very least. Otherwise there's no need to hesitate. You won't regret buying this game. Promised.",
            "review_score": "1"
        },
        {
            "review_text": "3/5 It's like playing Mass Effect where you only have Renegade options. Do you want to slap the general or stab them?",
            "review_score": "1"
        },
        {
            "review_text": "I really want to recommend this game, but I can't for two reasons.  1. You're arbitrarily blocked from certain areas of the game depending on your choices, but without any indication of this, or any good reason WHY your choices block you out of an area. Idiots will say this 'increases replayability via choice and consequence', but it's forced replayability via idiotic choices with idiotic consequences. If you go Disfavored, PICK THE BURNING LIBRARY, because you will never get the chance to go there later.  2. The game ends in Act III out of V. By that I mean it ends abruptly, with major events unresolved, while going on and on about how ♥♥♥♥'s about to go down. It's like the Lord of the Rings ending after the charge of the Rohirrim, with a pre-credit slideshow telling you how epic the final showdown with Sauron is going to be.",
            "review_score": "-1"
        },
        {
            "review_text": "I still have a hard time recommending this game.   The branching and depth of the story is nothing short of extraordinary. If you go in knowing this is arguabily the best CRPGs to date that gives you roughly 20 hours of gameplay, but falls short with an abrupt ending that does not truely give you closure..... then it's for you.  For me, the partially tapped gameplay mechanics eluded to much longer and larger game. It has been three weeks since I finished this title - I am still shocked and angry at how this game concluded.   I have since played through Pillars of Eternity and would recommend it over Tyranny. Pillars is actually a complete game without sacrificing any content.",
            "review_score": "-1"
        },
        {
            "review_text": "I just finished this game and I had a lot of fun with it. I'll try to make this as concise and helpful as possible.  Pro: If you're a fan of isometric RPGs, this is an awesome entry to the annals of the few quality titles.  Lore-rich  BITE SIZED. If you get fatigued on 60+ hour RPGs, this is perfect. Enough replayability and short enough so you could actually imagine playing it twice. I finished in about 28 hours and I did everything I could find and played on hard.  Very interesting character creation, Conquest is one of the best character creation systems I've ever seen in an RPG.  Skill system levels through use, ultra customizable magic system.  Clean combat system, you can basically always tell what's going on. It's basically the same as Pillars of Eternity only none of the 'WTF?' moments, or far fewer, where you have no clue why something happens and have to scroll through the combat log.  Cons:  I played this game on hard with my main as Unarmed Combat and it was not hard. I knew going in it was going to be short so I wanted to pack it with challenge and... there really was none. The first couple encounters with Bane enemies were difficult.  Not really too much in the way of sidequests.  There's a lot of illusion of choice... You do have some pretty superficial choices but in a lot of ways I made it clear I hated the Voices/Chorus and they loved me anyway. I made a tactical decision in the first act that I thought was innocuous and it actually decided who I was allied with for the rest of the game. I wanted to break the edict on Stalwart by killing the baby (can't believe I'm confessing this) but couldn't find an option for it. I looked hard. I wanted to save Cairn, no option for this. Kills in Shadow was my favorite party member and I tried desperately to save the Beastwomen tribes and had full Favor with them and in my epilogue they were still being hunted to extinction or something even though I ended up in charge of everything. What is the purpose of Favor with Bleden Mark? He has only one conversation with you before you're forced into an event with him that has only one way out. Too much of this kind of thing, where you have few meaningful choices outside of what you do in Conquest.  Overall very happy with the game, it's short enough and has enough replay value that the few things I dislike about it don't bother me too much.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a fun game... in its own way.   Admittedly I am a bit bias on the CRPG side of things. Some of them I've taken to quite nicely, others I have not. This is mostly due to the pace of combat of a lot CRPGs have. This is a personal preference, buit one that tends to get to me. Its predecessor, Pillars of Eternity, was one of the ones I did not take too. Tyranny was a bit different though. It felt similar at first, but it had a couple things that made it feel a bit different, and at the end of the day, I took to it.   Good Things:    Presentation: The presentation was what really drew me in. I was pleasently surprised to learn that the cartoon art that was shown in the trailers and teaser images, was indeed in the game as transition between major story lines. They are also especially prevalent in the 'Conquest' minigame that serves as backstory. Even the UI was interesting as it had little hyperlink type things over terms and people, which, when scrolled over, would explain more about whatever the link was over. It helped keep me remembering the story.   Conquest: I freaking love the conquest mode. It in itself was a fun game. Any time you write your own backstory in an RPG, I am happy, even if it is something small (Hearing people call me the 'Queenslayer' and other things was much better than hearing 'Fatebringer' all day.) Coupled with that, it helped set the tone for the story and explained lore. Plus the little wartable look was a nice touch.   Story: Though not a very deep story, at least not as far as I've gotten, it does what it needs to do. I was utterly convinced that when they said that I was the bad guy, that everyone was evil. But no, it turned out much better than that. The side you serve on merely has a different set of views. There is camraderie and friendship, just that killing is frowned upon a lot less. It's a breath of fresh air too. In most games, if you are too 'Evil' people hate you. In this case, you can make eveyone hate you if you go too 'Good' or too 'Evil', people don't judge you on if you are 'Good' or 'Evil' either, but by how your choices affected them or their faction. That gives the choices a feeling of actually mattering. One companion joined me because I killed one of her allies in such a brutal fashion, that she was scared I'd do the same and she swore her life to me, hell yeah!    OK Things:    Factions: Factions in general were a cool addition... but maybe a bit confusing? I did like it, the factions were interesting enough as well. Nothing too out of the ordinary. I did get a bit confused though when it came to some of the values that each of the factions had. One thing that confused me was how much I was trying to get close to a faction that was supposed to be more like a gang. They pressganged people into service, loved to raid, and have the habit of making a death game with whole villages, forcing every singe Man, woman, and child to fight to the death. And yet... they always seemed to hate whenever I killed someone. There was always some excuse for why they didn't want me to kill someone. This was a bit confusing too as one of their people was my companion, and I maxed out her loyalty from, yep, killing people. Now there is an option to see how your choices affect each faction, but that doesn't make it any less confusing.   Graphics: I am not a big graphics freak. I've seen people who play brand new games with the best graphics ever say that they look horrible, which is silly. The graphics in Tyranny certainly aren't the highest out there, but that isn't the point. They fit a type of look, and that's the point. And I like that look, the environments did what they had to. The only reason I am not putting this in only the OK catergory, is that I think that perhaps there could have been more of a variety character wise. The archons, basically the huge leaders of factions of Kyros' empire, were the only ones to really pop out at me. Everyone else... pretty meh. Even one of your companions, who has a totally unique unchanging set of armor, just seems a bit boring looking. If my companions didn't have actual spoken dialogue, they would have just blended in with the background for me.    Annoying Things:    Combat: Now keep in mind, I do know a lot of CRPGs have similar combat, but that doesn't mean I have to like it. It's a bit repetitive, but honestly I don't mind that, I expect that and that's not the part that annoys me. And it did take a couple of tries to beat a lot of them for me. It just seems there's not a lot of chances to get better in combat. I had plenty of chances to up my abilities outside of battle, but not inside battle. I felt under prepared for a lot of them, and each fight I won seemed more like chance. Wounds were a bit annoying for me too. I understand the need for wounds and such, but considering how much damage you soak up, you get a lot of wounds. Normally I didn't mind, but in areas with multiple larger fights, I felt silly, because I was constantly camping after each of my battles cause the wounds would so heavily affect my stats. Not a bad combat system, just annoying. This was one of the only RPGs I decided to play on a more normal difficulty just so I could enjoy the story more.   Sirin: I Dislike her... but I think that's the point. A bit too strong too.    Bad Things:  Nothing Too Bad So Far  In Conclusion, this game is pretty fun, though most of that fun comes from the old 'Choose your Adventure' way it present itself. I just haven't found enough fun in the combat mechanic. Play for the story.",
            "review_score": "1"
        },
        {
            "review_text": "Great game when waiting for full Divinity Orifinal Sin 2. The evil vs. evil conflict is great, the dialogues funny, the battles fierce. Just be sure you have pretty good HW to battle smoothly.",
            "review_score": "1"
        },
        {
            "review_text": "As of this writing, I've played almost 4.5 hours. This is so far a very good game. It provides a different narrative take on the story-based RPG. It portrays the kind of hard bronze-age world that charactherized the ancienc Mesopotamian civilizations.   The overall theme reminds me very much of the AD&amp;D Dark Sun, with an element more akin to the cleansing war of Rajaat in the Green Age than the post-apocolypse setting of the boxed set.  You get to play the judicator of the soceror king. Overall, this is a very rich experience, and Obsidian did a fantastic job achieving their theme as I understand it.  The RPG elements are solid as well. There are numerous skill trees, and a well orchestrated party system, and a lengthy character background generation system. Furthermore, the effects of your choices seem to show up constantly, and in subtle ways.  As for the gameplay itself, it's very heavily text dialogue based. There are voice acted portions that are well done, but this isn't a game for anyone who doesn't enjoy reading for hours at a time. You'll be rewarded with a rich backstory, and some great character-driven plot development.   I'll update this review later after I get some more time in it. But the exective summary: If you've played Age of Decadence, but were disappointed by how poorly it pulled off a similar theme, and if you played Planescape: Torment, and enjoyed the more philosphical, text-based RPG....this is a good fit for you. If you favor Fallout 3, Diablo, or Grim Dawn style RPGs instead, this one probably won't float your boat.  This was exactly what I expected it to be, and exactly what I wanted at the time, so I'll tentatively say it's worth the $45.",
            "review_score": "1"
        },
        {
            "review_text": "That can't be it. Where is the rest of the game?",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked PIllars of Eternity from Obsidian, you will surely enjoy this fresh 'old school style' isometric RPG. The game offers in short lots of improvements in combat and other mechanics over PoE, some simplification in various statistics and item properties to cater to bigger masses (I don't mind), great writing &amp; companions and an unusually original story. It is not an epic length game like its 'big brother', but a good 40-50 hours if you play all quests, half if bybassing things. It kind of ends on a cliffhanger, so part 2 is surely to come. It is in my view a game for readers; great voice acting all around, but not everywhere. That's not all - some content of the game is unavailable after significant choices made starting from the very beginning, advocating replayability to a huge degree. Loved it in Witcher 2, enjoy it immensely here. A solid 9/10, more games like this please!",
            "review_score": "1"
        },
        {
            "review_text": "Overwhelmingly good. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I've just finished my first playthrough. Overall, I think this game is fantastic.  PROS - Fantastic battle system. All the good things of PoE and not much of the bad. - GREAT story. - Lots of choices that feel like they have real impact - Multiple routes along the story, makes replays feel fresh - Great companions  CONS - Can't create your own characters (like you could in PoE) - Spells (Mages) are really overpowered - On Normal, the game is too easy - Third Act feels rushed; Ending is Adrupt  Basically, if you loved PoE, you'll love this. I know I did.",
            "review_score": "1"
        },
        {
            "review_text": "Tyranny is a really easy sell. If you're the least bit interested, I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is...pretty good. The writing is a touch predictible at times, the ending seems a touch rushed, and there are a couple times where figuring out how to progress is like pulling teeth, but all-in-all it's fun for what it is. Time will tell how much replay value it has, but it's worth at least one playthrough. I just got one of the endings and I'm debating whether I want to try for another one, start achievement hunting, or just let it sit on a shelf for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic story, characters, and world building right from the start.",
            "review_score": "1"
        },
        {
            "review_text": "The game is rushed and badly designed. The story plays worse than a mod.",
            "review_score": "-1"
        },
        {
            "review_text": "Spent One Hour in Conquest mode(the thing where your choices decide the world state) Spent 30min Reading up on the random lore in the game Oh my look, six hours past by.",
            "review_score": "1"
        },
        {
            "review_text": "My scary boss was mad at me because I keep asking to see what his face looks like behind the mask.  Then I just went home and play this game instead.",
            "review_score": "1"
        },
        {
            "review_text": "  Skill System that supports you!",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best, most compelling single-player fantasy rpg I have played in years. If you're looking for a story-driven game where your choices can help shape what happens, Tyranny is your game.  Is it perfect? No. The pause-and-issue-orders combat style can seem a bit cluttered and clunky at times; the level of inventory management might seem tedious to those not familiar with classic-style rpgs; you and your companions start out relatively weak combatants, and have to grow into power; and I still can't figure out why the default zoom couldn't have moved in even closer than it does.  But, for me, the few flaws in the game do not matter -- they pale in comparison to all the things Tyranny gets right.  This is true story game, one that pulled me in, and refused to let go of my imagination. The choice-and-consequence system is the best I've seen yet -- rather than second-guessing what developers might deem a Good or Evil act, the game keeps choices relative -- and actions have consequences.  Win Favor with one faction and its people through your words and deeds, and you may incur the Wrath of another faction. Or multiple factions.  Your companions may stay with you because they're Loyal, or because they've learned to Fear your power. Both motivations will require something from you.  My only true complaint about Tyranny after 60+ hours of play, is that I wish there were more of it.  The ending seemed somewhat abrupt, after all the moment-to-moment adventuring which brought me there -- the consequences of my final actions and choices were played out through a series of title cards describing and depicting what came next.  I was so engrossed in the game by this point, I would've rather have played through these events for myself, rather than read about them in summary.  But I loved this game. It's companion characters became true personalities in my mind, who will remain in memory, alongside our adventures.  As above, the only thing I was truly left wanting was ... more.  Absolutely recommended for those who might be interested.   (Random Tip: Invest in Lore skill, no matter what you play -- it reflects your knowledge of your world and its customs)",
            "review_score": "1"
        },
        {
            "review_text": "I've finished a few playthroughs of Tyranny and I love it. There are many different ways to complete the main story and I like how morally ambiguous your decisions can be. Definitely recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like Tyranny as much as I liked Pillars of Eternity. But I couldn't. Tyranny has had a pretty cool story so far, but the uninteresting combat, and long loading and traveling times bored me too much to finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's an amazing game. Your choices really matter, combat is fun, dialogue is well written and the game looks fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Cons: very short (for such excellent game) Pros: everything else ",
            "review_score": "1"
        },
        {
            "review_text": "A new addition to my top 5 RPGs of all time, and trust me it's a long list.  In a nutshell, the writing destroys Pillars of Eternity. I liken it more to New Vegas in terms of how reactive and roleplayable every situation is. There are many factions and the way they regard you goes far beyond simple good and evil. It's great, and an instant classic IMO.  The one con I have is the combat, it's not terrible and it's not amazing, but Pillars of Eternity and even Baldur's Gate 2 still were more satisfying to me.",
            "review_score": "1"
        },
        {
            "review_text": "While the game itself is entertaining, it comes with severe bugs, some even gamebreaking. I would advise to wait for further pachtes before buying Tyranny.",
            "review_score": "-1"
        },
        {
            "review_text": "Tyranny ticks that box 90s Baulders gate good time feeling.",
            "review_score": "1"
        },
        {
            "review_text": "I am so incredibly mixed about this game. Act 1 and two were outstanding. Act 3 and the ending; an abrupt disaster that marrs the experience of the other 20 or so hours. I actually felt I was just getting into the game when it ended on me - with no warning. It's scope is superb - but to give players such a shortfall in terms of narrative closure screams DLC profit mongering. If the developers had held with their original view - extended their release and just released a game that was complete this could be in the Baldur's Gate/ II category. But it is not, I can't help but feel that I've been cheated out of a game that should have been memorable for so many other things - it's quests for one - some of which are brilliantly concieved. But, I fear I'll be remembering this for the lack of ending and thought for it's players.",
            "review_score": "-1"
        },
        {
            "review_text": "By my opinion this game pretends to be good, a lot of proven recipes are used here, but if you chose to go deeper, you can spot a lot of 'small' issues, which makes me sad: *First dagger has almost the same strength as the last one *Whole party in heavy armor, mage casting spell without issue, yep *Artifacts has same strength as other items, why do I need them? *20 abilities for main character, 4-5 cool, all others trash, I've not used most of them *Comparing two items it is hard to choose, non descriptive text, tons of small difference *Magic damage from magic stuff is calculated based on Strength *Tower don't give you anything, build shop, build blacksmith.... - time spent, no outcome. *You can improve Artifacts quality in blacksmith, lol *Voice and Ash behaves themselves like children, two Anchors arguing about several soldiers death, really? *You can improve armor on Barik, which he can't remove at all - FMJ Alchecmist *There are some dialogs, but they dont' allow you to break '4-th wall' - to find solution that satisies everybody involved *Useless skill system, small efforts at start, you can Lore, Athletic and Bluff always *Backgrounds, one dialog option for one background for the whole game, hmmmm *Easy to create unplayable character, if you doing melee and skip Parry - bad choice",
            "review_score": "-1"
        },
        {
            "review_text": "Beat it on hard - took 17 hours. Sided with the Disfavored. Built my main with a sword-and-shield and maxed out the leadership tree. The freak in the armor did about half the party's damage with a two-handed build, can recommend him. The rest (my main, an archer and and a water mage) did some work but not as much as the freak. The game became very easy toward the end as my characters got geared and began to max out. Only drank 2-3 health potions and not a single other potion during the entire game.  The second act is much better than the first; but the third one is iffy. The third act misses a proper final fight - especially given that one can skip some of the final encounters. I think Obsidian should have added about one more hour's worth of content involving a few heavy encounters.  Restrictions on resting have been largely abandoned and you have tons and tons of campfires. The multi-character combo attacks are extremely OP - to win the harder battles you just chain two or three of those combos. Throughout the game, you mostly fight packs of goons. From about the halfway point, you start finding 'artifacts' - i.e. items that are real items rather than just stat-sticks. Can also craft items and brew potions.  OK game but not as good as the old IE games. Though I'm still glad someone ripped off the old IE games. 7/10, will play whatever Obsidian make next. (PoE2?)",
            "review_score": "1"
        },
        {
            "review_text": "I love the ♥♥♥♥ out of this game.   Too bad it crashes all the time.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;First follower is a woman &gt;Can gain her loyalty by saying illogical things and letting her go on her menstrual rage. 10/10 for realism  In all seriousness, however, this game is awesome. Combat is great, the plot is original and rich and the endings are all pretty cool.  My only two concerns are the musical score, which is slightly repetitive, and the lack of a speech talent, which would be necessary to lie or convince individuals. In this game, you can simply lie, even to a demigod representing justice. It is rather... weird, for a rpg player like me, at least.",
            "review_score": "1"
        },
        {
            "review_text": "I have never felt the impact of my choices like this game delivers. This is a must play for rpg fans",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but too short for the price tag.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent so far. I presume there is much replay value and I've only gone through it once, but that one playthrough was excellent. Exactly what you've come to expect from an Obisidian game.",
            "review_score": "1"
        },
        {
            "review_text": "Tyranny was a great game to me. It was engaging, I was never bored, and I always wanted to come back for more of the game. The lore of the game was something that I liked very much, and I enjoyed learning more about the world through the game. It was a good balance of pre determined lore (as in world backstory) and history created through player decisions, too. The combat system became very easy after Act 1-2, simply allowing my party to just fight using AI mechanics, as my character and companions became unbelievably overpowered. In terms of content, Tyranny had a lot to offer, but the issue was that it was like a teaser. The game isn't super short, but I also don't feel that it's long enough either. There was much more I would have liked to see in the Tiers, and in terms of story line, it felt like just as you get to the REALLY juicy part (the entire story was juicy, I think) of the story, it leaves you with a bit of a cliffhanger/abrupt ending. While this does give Obsidian a lot of room to maneuver in terms of where they bring the story, I feel that it's a bit of a disservice to customers to charge $45 up for a game where you cut off the ending so abruptly.  TL;DR- Very good game, 8/10, maybe a bit too high of a price tag in hindsight, but definitely recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "The big cons =  Short. Not a lot of depth.(Do not expect a wow effect like pillars had .. very linair) Small Maps that look the same. Inventory is worse less customization. Spire is a bad version of a stronghold in pillars. NO exploration at all, just a hold your hand game.(Just go on a small map that just opend do the quest and come back and thats the hole game )  It still a good game, but its a step backwards from Pillars",
            "review_score": "-1"
        },
        {
            "review_text": "Very good if you like classical RPGs",
            "review_score": "1"
        },
        {
            "review_text": "Feels like PoE but different. Not better but also not worse just as good in different areas.",
            "review_score": "1"
        },
        {
            "review_text": "That 7 hours on my playtime record for this game, that is me restarting the game and trying to make a character that really suit my taste. This game is really something else, you'll feel really attached to the story and your role as the Fatebinder. They could've tone down the story changing choices tho, it's bit too much and sometime feel abrupt. Overall great graphic, great gameplay, amazing story and interesting companion characters.  My favourites are Verse and Sirin. If you like Pillar of Eternity, you'll 100% like this game too.",
            "review_score": "1"
        },
        {
            "review_text": "Another great RPG from Obsidian! Love it!",
            "review_score": "1"
        },
        {
            "review_text": "9/10, a most play if you are fan of RPG games. I've payed 42euros. Played 32 hours of unique gameplay with high quality story, speak of value. Finished all side quests but one(bugged i think), but there is so much replay value possible, i could play trough the game again choosing different actions. Such a high quality product for not even a tripple A 'AAA' title price,  I WANT MORE!!! expansion, or game in this universe would make me bleed my vallet dry if i had to!!! Ty for awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "Tyranny has a good story where you play after the bad guy has won where you either decide to either be a bad guy or a good guy.   The character creation is one of the better ones that i have seen in a while as it lets you choose a background and with the conquest mode it enhances this by giving you a bit of a tie to the game world. My only problem with it was i found that some skills were less useful than others when playing the game as lore seems to be the only one worth investing any points in.  The main quest is very engaging and i found that i always had to just play it a bit longer just to see where the story would go. I was a bit disapointed though with a lack of side quests, but with multiple endings it does have a repeat value.  Most of thw characters were well written with suitable backgrounds and motives but sometimes i found that some of the character motives were left unexplained in places which baffled me.  Although i wished that the combat was more turn based it did feel a lot less chaotic than pillars of eternity. The magic creation i found was very adictive but i thought the skills were a bit lacking and i never really ended up using them which is a shame as there seamed to be a few skills that might have been useful.  Overall Tyranny is an excellent game but you might want to hold off for a bit until some dlc is released and maybe a drop in price.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game a lot. Character creation and gameplay is linear, and the maps are small, but the storyline and decision making are so unique and good that it makes up for it. 8/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Summary: It's a shorter, more fleshed out RPG which allows you to be as bad as you want or walk the path of a hero if you truly desire. It has some flaws, but they don't take away too much from the game.   A fast guide to whether or not you should buy this game.  Do you like rpgs where you manage a party? Do you enjoy the medeival setting? Are you fine with a quicker RPG with more replay value the length?  You'll probably enjoy this game. The weaknesses are minimal, and don't take away from the strengths.The strengths are brilliant, and really shine.  One warning though, this game can be very dark and very adult in its content. You do start off on the side of the villains and there isn't really a 'good' side in the game unless you choose to become that good side. If you're intending to buy this game as a gift, it shouldn't be for anyone younger than 18 (16 might be acceptible for a mature individual.)  Strengths: -Reactive to player choice - Example: I chose to play a mostly silen character, responding to most NPCs, including my companions, with a silent glare when available. One time, when given the option to glare silently, I instead chose a brief and direct answer. The character said the response was what he expected, but was thankful that I hadn't glared at him until he made awkward comments. It also came up at another point in the game, but I can't talk about that without spoilers. -Diverse - Although I felt a bit constrained during the 'tutorial' section, the game following that is extremely open to player choice. If there's a path you want to take, you can take it (provided you haven't gotten rid of that option through previous actions.) However, I will say that choices will constantly open new doors and close others. -High Replayability - Between the Diversity and the Reactivity, there's easily 100+ hours of unique content (assuming you just looked at new content and didn't have to go through old content to get to it.) However, each play through will only take you 10-14 hours (if you're experienced with the genre.) -Conquest - You can opt to do a pre-game choose your own adventure which will shape the world you start in and the way the people view you, and many of these choices change which faction is in control of a region. -The Magic System - The magic system is a system where you combine 3 different types of runes to make a spell. The first dictates the element, the second dictates the spell type, and the third type is a whole bunch of spell augmentations which allow you to further modify spells. It's a system that allows for a lot of customizations.  Weaknesses: -Short - This is the other side to High Replayability. It's a deep game, but the run time isn't long. -Bugs - There are a lot of bugs. Thankfully, all the ones I ran into were fixed with a simple re-load. -Some parts are poorly optimized - I don't know why, but inside stalwart throne room and a few other places tank my FPS. Please note, inside stalwart throne room may be the smallest map in the game besides inside the teleporter rooms of spires and very little's occuring at the screen when you're there, so there is something at fault here. -Pacing's too Fast - If feels like too much happens too quickly. There isn't really enough side-quests in between main quests to allow everything to sink in or for you to gain as much of an investment in the world.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Pillars in terms of story (Pillars was just way over my head), but really abrupt ending, very dissapointing to the point I wanted to give negative review straight away. however the game is good, perhaps they will release dlc(s) to cover the ending shortfalls",
            "review_score": "1"
        },
        {
            "review_text": "This game will challenge your morals. Be aware. There are situations where you will choose between Pitch Black and Black. Awesome game",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best RPG I've played in the last several years. Finally an old school, Baldur's Gate style RPG that doesn't was clearly designed of, by, and for hardcore RPG fans. One of the most fleshed out and complete worlds I've seen constructed in any game in an extremely long time and I CAN NOT WAIT for the next installment to be released. Any fan of true, story focused RPGs should put this game at the top of their list as soon as possible.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun storygame with a game world that reacts well to player choices.  The RPG mechanics and combat are hot garbage, though. Stick with the Pillars system next time, boys.",
            "review_score": "1"
        },
        {
            "review_text": "This was the first game of this type i olayed and it wasn't disapointing. It mangeged to grab me early on and the combat was fun and challenging with out being so difficult that it slowed down the game. There was a coupel of bugs, but after reading the latest patch notes i think they have been resolved.",
            "review_score": "1"
        },
        {
            "review_text": "I had a lot of fun with Tyranny, all the branching choices for how you tackle each situation and possible paths to walk down, even allowing you to outright betray your own faction if you so choose.  I enjoyed the customized companions, the freedom of builds and have always endorsed a more point-buy approach to any 'class' system.  However I must admit some dagree of disapoint and its not gripe with the content provided: sound, combat, music, visuals are all great....but the game falls short of a -true- ending and I am somewhat disapointed but also fearing the idea of a DLC being handed out later on to give us a 'true ending'.  I kept this review positive in the hopes they wont do that, that we wont be sold the 'true ending' or something like that, fun game, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Compared to PoE this game sucks. I mean its ok. But compared to PoE it is so bad. POE is longer, deeper, more fun, and has a better ending. The ending to Tyranny is a joke, and its clearly set up to promote you buying DLC.  If you loved POE, this game is but a shadow of POE. Maybe in a vacuum, where Pillars of Eternity doesn't exist, this game would be better. But comparing it to POE, it loses in almost every category besides dialogue system.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I played Tyranny for a short time and quickly didn't enjoy it. The bugged combat AI made things frustrating, and the story never seemed to add up.   By the end of the game I was sitting there going 'wait... what happened?', and left sorely disappointed.   I would not recommend this game to a friend, simply because it seems rushed to completion, and while it looks pretty, I'll take a good story over pretty graphics most any day.",
            "review_score": "-1"
        },
        {
            "review_text": "Game plays like NW2 so much better then POE 9/10 will beat the game many times",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good.  Loading screens are too long",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! they managed to top pillers of eternity, better story, better combat, and a lots of meaningful choices a must buy for any one remotely in to CRPG's or just RPG in general.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, though a bit short. I finished it in about 20 hours but it left me wanting more.   Combat is nothing terribly new if you've played for example Baldurs gate but the new additions such as combo, reputation and artifact abilites are awesome. And the spellmaking system really gives you some great customization options.   The strength of this game lies in the story and the choices you make. This isn't a game about being evil (though you can). It's a game about choices and they (for once) really have impact. I am tired of games advertising where 'you control the story' but it always basically comes down to one or two instances where you choose 1 or 2. In Tyranny, it feels well done and I didn't even notice many of the choices I made because they felt organic and integrated into the story.   I strongly recommend this for any fan of RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "60h on play...finished 2 times..still dont get how some of the plots unfold...Game start great..u stay on your toes for every conversation...and at somepoint u just dont give a f!#$ anymore...lol...Problem here is...50% of the game was rush down to the end...and when it finish...u dont feel like is finished...and that leaves a bad taste on your mouth....but even so the game is good...i think they gonna realese a few 'DLC'(the partes that were cut off) and we may get a proper end...anyway..",
            "review_score": "1"
        },
        {
            "review_text": "Awsome Game.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game. Easy to play as compared to Baldur's gate and Pillars of Eternity. Great and enriching storyline. Well worth the $.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game but it could be great with tweaks.  - Great opening and the 'Conquest' feature really does a great job of introducing you to the world and factions.  - Companion combo abilities are great BUT they feel niched with certain character types  - Tooltips for main people or factions in the dialogue is a fantastic addition and helps a ton.  - You'll gain progression with factions, artifacts, and companions BUT it doesnt tell you what effects or bonus's you get.  - Small maps keep the pace fairly fast but re-used maps kinda take the uniqueness out of the world  - Item variety - my playthrough just didn't feel like I had many options - I finished feeling like my guy had epic gear but it was mostly gear with no real stats or procs  - the game felt rushed at the end for me - getting your last two spires just feels underwhelming  - THE BIGGEST THING THAT GETS ME: The story just seems to fall flat towards the end. Without spoiling it, it just feels very anti-climactic for this great evil empire war effort that has been going on. This is when you start to notice some things felt like a great intro and seem like they are done nicely but they just don't feel finished in their own right.  It is a cool game with a refreshing viewpoint. The choices are not easy and can have their own twists, but they don't feel like they have enough weight or are they shown to you in a manner that makes you feel the impact of them. This was something that initially drew me to the game so I felt like I would witness more actions having a dynamic effect. The combat is fun and the combo system makes you feel like a real team; although sometimes they bug out and one hero is stuff channeling a combo action. The world is cool and you can easily recognise the difference in factions and their mindsets. The world can use some more 'exploring' options to full flesh it out as an RPG environment.   TLDR:  It's cool and it's fun - but towards the end you can't help but feel it's a different game than it started.",
            "review_score": "-1"
        },
        {
            "review_text": "Spent this month playing baldurs gate enhanced, im in love",
            "review_score": "1"
        },
        {
            "review_text": "So, there is this guard tried to stop me (The Fatebinder) at gates I didn't even bother. Punched him till blood comes from his ears. Another didn't adress me properly I killed her that instant and another one though could outsmart me by giving false information, I immidietly sencence her to be slave till she die.   It's good to be Fatebinder",
            "review_score": "1"
        },
        {
            "review_text": "while i do enjoy and recommend this game, i do not recommend it at this price. it is a fairly short game but has high replayability. some minor story/choice issues or spelling mistakes. knowing paradox i'm sure they will fix any minor issues i have with a $30 dlc",
            "review_score": "-1"
        },
        {
            "review_text": "SJW paradise, short game, pillars of eternity and B♥♥♥♥re just better, not as biased, have a lot more content, cheaper and do have a replayability factor.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel like I wasted my money on this game. I enjoyed POE, as well as balders gate so I thought for sure this would be the game for me. Its not. I dont feel like im playing a game. I feel like im just reading the whole time. I dont mind reading in a game but here it just seems forced on the player. Some of the dialog is interesting I guess, but I want to PLAY the game not read the game. Even when the combat kicks in, It sucks. Its like one fight then back to reading. I know POE and Balders gate had its fair share of reading but maybe the exploration or combat balanced it better. If you want to read your games, and make choices, and thats all you need to enjoy a game.....id still wait for a sale. A shame because I really looked forward to this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels and plays like a true successor to Baldur's Gate. I would say this is a step up as the AI is great in this game. So if you loved Baldur's Gate or just RPG's in general I would really suggest giving this game a try. Theres tons of dialogue with the main quest voiced over. Your choices make a difference in how the game plays out which gives tons of replaybility. Just by the end of Act I you could have made major choices that will effect the rest of the game. Overall for me this is the best game of the year so far.",
            "review_score": "1"
        },
        {
            "review_text": "This came out of the blue for me and boy was I more than pleasantly surprised!",
            "review_score": "1"
        },
        {
            "review_text": "That ending was a huge disappointment. Talk about rushed, damn. There is no closure, only more questions. Seems like a money grab to me.",
            "review_score": "-1"
        },
        {
            "review_text": "Best Trump simulator of 2016!",
            "review_score": "1"
        },
        {
            "review_text": "Wait for a Sale. Tyranny is not the game you are looking for, especially not at $45.00. Its basically a linear story with 0 real choices and 0 exploration..   And the story is not good. Don't impulse buy, don't believe the fan boys. Its a major let down.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the first time i downvote a paradox game.  Tyranny is a good game, one of the best RPG i have played tbh.    I really love the story and combat in tyranny, but there are way too many identical dungeons and dumb puzzles!  More importantly, sometimes the puzzles bug out and trap my characters behind walls!   The whole game revolves around 10% of fun content and 90% of puzzles/killing banes(a type of mob). And believe me the puzzles are dumb as fak- you simply try to find something and put them somewhere to open doors. Yes you spend 90% of the time to open doors!     The game has a lots of bugs and the instruction is unclear. Missions usually contains only 1 sentence of instruction. There are side quests you can not return in some situations. I tried so hard on a mission without knowing it is already bugged, and wasted hours to find clues to finish it.   I had more frustrations than fun in this game. I doubt had anyone finished this game without being stuck yet.   I do not recomend this game to anyone before I am able to clear the game without a guide or walk through.   Now I am stuck in the burning library with my characters stood on different side of a magical barrier.  I hate this game.   update: I decided to kill everyone i meet in this game to avoid bugs and missions. I cleared the game in 2 hours. Much easier.  Update2, I cleared the game in ironman in damn difficulty, and I found this game too easy . Spells and AOE are overpowered, you only need 1 tank, and 2 rounds of aoe spells to kill anyone! But i didnt get the achievement, only ironman one WTF.    Another tip, do not play the game on easy and normal, you don't get orange gears!",
            "review_score": "-1"
        },
        {
            "review_text": "Only played for two hours. Pretty good so far. Watch this spot.",
            "review_score": "1"
        },
        {
            "review_text": "I'd give it a 10/10 but game crashes quite often!!! I don't know it's my problem or game bug.",
            "review_score": "-1"
        },
        {
            "review_text": "What I liked:  1. Truly reactive world - what you do is insanely consequential, unlike any other game of this type, imho. 2. Amazing voice acting - Kana from Pillars of Eternity as Barik was distracting to me, but still good. 3. Compelling plot - far better than Pillars of Eternity, imho. Loved Pillars, too. 4. Great writing - pretty standard for Obsidian, they are always excellent, imho. 5. I actually had a few 'holy hell, I am now a   badass  '-feeling moments in this game. Haven't had those in awhile. 6. Music is great, especially a somber cello piece that is just gorgeous. I found myself humming along with it every time it came on. Love it. 7. The combat effects and screenshakes, just the overall feeling of impact and power during combat. 8. I liked all the companions I used in my playthrough - Barik, Lantry, and Kills In Shadow. 9. The overall lore of the world is quite interesting, imho. 10. Building of character and the world-state at the beginning of the game. I didn't really feel it at first cause I hadn't played through already. But now going back for other playthroughs I can't wait to see how I can change the world-state. Great idea by the devs, imho. 11. Tied to #5 - a number of moments in the game where I thought 'Wait, the game will let me try to choose THIS?! And it's actually going to happen?! Sweet!'  12. Build-your-own magic - didn't think I liked it for the first few hours of the game, and by the end I saw the potential of the system. I respect it now and think it's awesome. 13. The quality of special effects in the levels, like the wind and dust and all that. Yes, all the objects are still static, but I liked how they layered in the effects to make it feel more alive. It worked for me. 14. Companion combos during battle. Awesome idea! 15. I thought the story resolved itself in commendable fashion, unlike what I've read from others. I felt totally satisfied and yet totally eager to get going on Tyranny 2: Electric Boogaloo.  16. Unique and cool weapons, unlike PoE had when it first came out.  What disappointed me:  1. Lack of enemy variety. I get their point from a lore angle, but still.  2. The combat never required me to use the companion combos or create crazy spells or change tactics to win. Barik tanked, I used bow and leadership tree perks, Kills in Shadow was rogue-like dps, and Lantry healed everyone and ran around to avoid being stabbed in the sacrum. It is fun, in a way, but I think literally every fight played the same. PoE and most other iso-rpg's clearly outshine this game in this aspect. 3. Beauty of the levels - I actually felt bad for having this reaction, but I couldn't help but feel like the overall quality of the art in this game is a step or two below PoE. The reactivity of the levels and the effects are better, but the assets themselves seem lower quality, for some reason.  4. The UI. I'll just leave it at that. I got used to it eventually, I guess. 5. No 'Defiance Bay', and no huge wilderness areas. That is one thing I love in these games, the vast wilderness with god-knows-what out there, and the intricate, multi-level cities with all the bells and whistles. I know this game is more a more focused experience than PoE, but I still wish it had these things. 'Basterd' (censorship) City ends up only being Tunon's Court, for example.  6. I finished the game yesterday and I can't really recall many of the sidequests. 7. Too many weapons of badassery, actually. Nothing felt that valuable because everything was so valuable, if that makes sense. To top it off, I don't think any of it was necessary to win in combat, which is lame. I would use the artifact abilities only when I remembered that I had it. 'Oh yeah, let's see what this does. That looks awesome! I'll never use it again though because I don't need to.' 8. Companions are cool, but felt shallow. 9. Probably more things, but that's enough. 10. The UI, again.  This game's positives far outshine the negatives, imho. I would recommend it to anyone who's an iso-rpg fan. I hope this game does well and doesn't get abandoned by Obsidian. If they wanted to kickstart or fig Tyranny 2, I would tell them to shut up and take my money.",
            "review_score": "1"
        },
        {
            "review_text": "WAIT!!!!! Do not buy this just yet, I know it may be hard but this game does not feel right. Many of the inventory menus look unfinished and I may have only played a little bit but the combat feels wrong. Rushed would be a word I would use for this game. Pillars felt and looked way more completed then this one. So wait! this game might be good or might be incomplete, so wait for more comprehensive reviews of this game before you choose to pay for it. There's no harm in waiting and in the mean time go play Pillars of Eternity if you haven't already!",
            "review_score": "-1"
        },
        {
            "review_text": "Gonna refund, it's a recycled Pillars of Eternity. Good thing it bored the crap out of me in less than 2 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "This game are stink",
            "review_score": "-1"
        },
        {
            "review_text": "This is the most man-hating game in the history of gaming. After playing for 5 hours straight I haven't met any decent man character, all of them are scum while women on the other hand - brave, strong and independent. Set aside this terrible feminazi lore, the image of men throughout the story is horrible. I've been playing Endless Legend where amongst 10 ingame races there were no man leader. Either genderless robots or female ruling over expendable unworthy men who are used as cheap firepower. But it could be explained as Auriga is a labarotory-planet of endless and The Endless were just checking whether Matriarchat could work. (The answer is no, everyone but one race have failed)  So where I'm going is, that Tyranny is even worse than that. Now I understand why Sawyer didn't work on this game, it was made by a bunch of dickless ♥♥♥♥♥♥♥ and feminazis.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a bit of a conundrum for me, while I enjoyed it thoroughly It didn't come with the open world aspects I have come to expect from an CRPG. However! This is a game clearly given time and love to grow under Obsidian's watchful lore-weaving eye, the world is vibrant and the lore is full of all sorts of interesting nooks and crannies that you can lose yourself in. Unfortunately the combat will have you looking at your watch in boredom, It is a tedious addition to what is a lovely game.    In short 8/10. Good, but bluster through the combat",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game so far. The magic creation style is fluid and dynamic, letting you change your spells on the fly in interesting ways. By finding new scrolls, you unlock different modifications for you spells, which is very fun and engaging. I recommend you run some sort of magic for your main character. Every spell and ability has a cooldown, instead of the limited count D&amp;D style of spells. Instead of say ,only using a spell 3 times before you rest, you can use everything every battle without resting. Resting is only used to get rid of 'wounds', which doesn't force you to rest after every battle.  Additionally, you have six camping supply s instead of two ( on hard difficulty) which is a nice quality of life feature, so you don't have to keep running into town for trivial reasons.  Compared to Pillars of Eternity, you have four party members, instead of six. While this may seem like a downside, I found that having six party members very difficult to micromanage. Four is a lot more manageable. A very interesting story, and great voice acting and personalities for the characters, specifically Lantry. I think Barik's voice actor is the same as Kana. Being the bad guy has never been more fun, and the reputation system actively rewards you for ♥♥♥♥♥♥♥ off another faction. So far, the Spire and it's upgrading is a bit more interesting than Caed Nua. We will have to see though by the end of the game, though. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Good: Story - deep and rich, love the lore Graphics - great looking game, maps are beautiful Gameplay - Decision and consequence approach is great. Building your reputation thru loyalty or fear is awesome. Companions - fun and entertaining, specially Verse and Berik.   Bad: Not enough companions. Also some of the existing companions are boring.  Too much emphasis on magic. Maps are really small. And I mean reeeeealy small, even for cRPG standards. Combat is neglected, repetitive and dull. It's obvious they spent most of their time developing story, dialogues and lore, not giving too much thought on combat.   In conclusion it's a great game with rich lore and interesting dialogues. Whole decision and consequence system works great and it's fun making hard decisions that impact the world and lives of people. Combat is somewhat boring but I don't find it a deal breaker. I recommend getting Tyranny if you are an RPG fan. New gamers who haven't played this type of games before might find it boring.  ",
            "review_score": "1"
        },
        {
            "review_text": "I have given this game a thumbs up because it is a decent offering in the old school style. If you liked Pillars of Eternity then you will like Tyranny. There are however some caveats to that &amp; in my opinion Tyranny has taken a few steps backwards from it's predecessor.  The story is your pretty standard 'become a superman and save the world' stuff ( you don't get to save the world though as this is only half a story ) and that is caveat number 1. The game is much shorter than it needs to be to justify the price tag and has obviously been left for future sequels, as evidenced by the missing spires which are catered for but not delivered and the fact that the game ends in a sort of standoff.  Caveat number 2 is that the maps are way way smaller that those in Pillars of Eternity with very little in the way of exploration.  Caveat number 3 is lazy &amp; bad design. This comes into play when you are tasked with finding a collection of artifacts. With good design these artifacts would always be useful to the main character &amp; in Tyranny they are not. If you were playing a rogue type for instance the artifacts should be things like a bow, dagger, suitable armour piece etc. which would be useful. Instead they are aimed firmly at sword &amp; board users which has you farming them out to your companions. What's more it isn't that hard to do. When you create the main character the game should take account of your chosen primary skill and branch to the artifact set that matches, simple. I have done similar things myself with the original NWN's world editor so for Obsidian to neglect it is just lazy.  Caveat number 4. Game forcing companion choice on the player. You need Lantry in the party &amp; Lantry needs a specific skill from the sage tree or you miss a crap ton of runes. Again this is very bad design. FFS Obsidian tie these runes to the lore skill and not a single companions skill, it isn't cool to force companion choices, that should be up to the player.  Caveat number 5. You can rest pretty much anywhere, even in the next room to a pile of enemies. Seriously, wtf?  Caveat number 6. Pathfinding. You will spend a lot of time simply trying to find the correct ( and only ) route even though the maps are small. A path that look perfectly viable turns out to be impassable because there is a pebble in the way that really does not need to be there and exists for simple frustration value.  Caveat number 7. Load times need to be optimised. It is almost 2017 and the load times are unacceptable,  Finally Caveat number 8. In PoE the ending sequences were well done and all voice acted. In Tyranny you get a few abstract drawings and text, which is a huge step backwards. Whats more, and this is for Obsidian. Either have voice acting or don't. Instead we have the same problem that existed in PoE where part of a conversation is voiced and the rest isn't. It was forgivable in PoE because nobody knew if the title would be a success and the game was crowd funded so finances had to be looked after carefuly. Tyranny was an assured hit after PoE and with Paradox behind them surely they could have afforded the few extra dollars or whatever to voice act the complete converstation.  With all of that out of the way and as I said at the start Tyranny is a decent game so it gets a thumbs up. I hope that future titles in the series address the things that I have raised and in so doing turn a decent game into a great one.  ",
            "review_score": "1"
        },
        {
            "review_text": "First and foremost is the story. While it does rely on some old tropes and doesn't reinvent the wheel, it does take an approach to the rpg story that we don't often get; the evil side. You work for 'evil' from the start and have to carve your path from there. Having said that, the game does a very good job of making you wonder if what you're doing is truely bad or if it's good; there really isn't a true 'good' or 'evil' action in the game. A lot of the characters have their own justifications for their actions that seem perfectly reasonable given the circumstances in which they are embroiled. Even still, it can be difficult to make some decisions that are either terrible or you have your own idea and you wish you could implement it (but you said the wrong word two dialogue options ago). The problem with the story (and problably, but just in case, spoiler warning) is that it just kind of...ends. It is very clear that there either is or should be more to it. You can tell that it's coming, but you hold onto the hope that surely it doesn't. We certainly want our resolution of the story. That being said, a proper resolution feels like it would take another full game.  If you've played Pillars of Eternity, then you already know the score with the combat. Now, I don't know if it's possible but I never figured out how to change the hotkeys for combat... Either way, this takes a lot of pausing, issuing commands, starting for a second, issuing some more commands, etc. ad nauseam. If you want go go go combat, then it is not for you. However, if you like to stategize and coordinate or if you're impartial then it IS for you.  There are some bugs to speak of, as well. I noticed in one conversation that I had level 1 wrath with someone but a conversation prompt of wrath level 3 showed up. Also, there were numerous instances of grammar errors that wouldn't have been a reasonable part of the game, but rather typographical errors.  Long story short, I really like this game. I've played it through once and I intend to play it through at least one more time, possibly more.  Pros: -Dark but engaging story with fleshed out lore -Choices have a lasting impact and may haunt/aid you down the road -Strategic combat  Cons: -Story abrubtly ends in what kind of feels like the middle -While companions have their own stories, they just kind of follow blindly as long as you say the right thing once or twice -There are some bugs and text errors",
            "review_score": "1"
        },
        {
            "review_text": "No issues here with load time or performance, it runs like a dream and plays like it, too.  Great voice acting, GREAT dialog, excellent world-building.. everything you'd expect!  My biggest and most prominent issue/complaint is that the combat AI is downright frustrating. Characters wobbling back and forth from pathing and being slain from disengage isn't fun, characters abruptly decided to stop doing whatever you told them to do isn't fun. If they can just tighten up the AI a little this game will be damn near perfect!  Alternatively, we can quit with this awkward 'realtime-pause' combat thing.. I get what the aim is, but it just always feels so awkward. You have to pause every half second and micromanage every single command, due to the AI constantly changing their mind, or just hope for the best. It was awkward in BG, it was awkward in DA, and it's awkward here. I love all the games aforementioned, Planescape is my all-time favorite, hands down, but that doesn't mean every aspect was perfect.. the combat, while fun and engaging, has always been a bit frustrating. Games like FF:Tactics take the cake in combat - you can plan, you can intercept, you can utilize abilities to their fullest. In Tyranny, I have to control characters and spam abilities sometimes for them to ever go off - if I queue it and swap they immediately start doing something else for some reason. Several characters are also kinda prone to standing aroudn - even when set aggressive! A certain large, hairy-teated individual loves to just stare off into space, despite her combat action saying attack - she just doesn't. With half my party half dead, and a caster set to support, half his heal/support abilities are unused for some reason - no matter what I set his AI to.  There's got to be a comfortable middle ground that works - I thought the newer Divinity did it well, for example! There are ways to work recovery and such into a *slightly* more flexible turn-based system, without it being a slog and crawl, but while giving a lot more control.  I am loving the story, the characters, the world, everything.. but I find myself letting out huffs of aggravation due to the party AI and the inherent awkwardness of the combat system.  If not for this one frustration I would be raving up and down the streets about Tyranny - and frankly I'm still enjoying and am very positive about it, and surely will continue to be.. Just tired of an awkward semi-hybrid system dragging down otherwise astoundingly good games.  Edit: Just finished one of the routes on the 'Hard' difficulty. Would have loved for it to be longer, but I can appreciate the replay value I suppose. Some aspects struck a little funny - the times I was kinda forced into a course of action without what seemed like valid justification for doing so, and the end did feel somewhat abrupt.. none the less? Overall, rock solid and I would surely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "an intererting twist to what if you were the bad guy that I think paidoff. helped by a cast intersting characters and setting. I also greatly enjoy the magic system being able to mix an element with sigial ( touch , AoE, sheild, etc) with focuses like better range or elemental blend. combat can certainly be challenging but ussaly it comes to how you approch a probelm dialog can also be an example of that. your choices ussaly come back to bite you so keep that in mind refering to the conquest mode upon character creation makes that playthrough differ from the others in how characters interact with you",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to give a recommendation to a game that I am currently having issues finishing, but that is what is happening in this review. The game is strong, well designed, good story . . . but I am not motivated to finish it as it seems that conversations trying to justify my butchery of the population in Tyranny doesn't hold the same companion investment as talking about the meaning of life in Pillars.",
            "review_score": "1"
        },
        {
            "review_text": "Rather short game, even tough that was announced ... I DO see opportuinities for several huge DLCs here, and really hope you will let our Godlike creature ingame get some more havy and cool stories. Alot can happen in that world after the victorious ending ... :) Anyway, grate game, been trough it with 9 characters during release and now Im fed up !   So new stuff please ...",
            "review_score": "1"
        },
        {
            "review_text": "Great Baulder's Gate type RPG, short campaign but many, many options which change the storyline and outcome - making the replay factor high. Very fun and hard to put down.",
            "review_score": "1"
        },
        {
            "review_text": "This is Tyranny!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i`ve played in a long time, Couldn`t stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG games i've ever played from its great combat mechanics, Smart Ai, amazing lore and down to the visual artistry that is this amazing piece of video game history that Recommend to anyone who loves games with lots to do, and the ability to do it your way.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, choice driven RPG that makes you feel like your choices matter, highly replayable, highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Old school RPG lovers, will love this game. It's good to be bad.",
            "review_score": "1"
        },
        {
            "review_text": "an exellent game  I really like the way the story is shaped by your actions",
            "review_score": "1"
        },
        {
            "review_text": "Lets you punch demi gods in the face.",
            "review_score": "1"
        },
        {
            "review_text": "I've been enjoying Tyranny quite a bit (the game) for 2.1hrs as of the typing of this review so I figured I'd click the recommend button and spread the joyul news to the entirety of the Steamiverse that I've been enjoying the game quite a bit for 2.1hrs as of the typing of this review.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good. Quite a bit of people complaining their choices lock them out of other choices, but that's sort of the point of having a choice, it matters.",
            "review_score": "1"
        },
        {
            "review_text": "Paradox and Obsidian knocked another story out of the park.  To me the game felt like just the right length for the story it was trying to tell, though it did leave an obvious sequel hook.  Solid mechanics overall but nothing special for an rpg outside of not having character classes.  Id recommend this to anyone who wants to get some Evil out of their systems :)",
            "review_score": "1"
        },
        {
            "review_text": "What a great game, a lot of improvements over pillars when talking about gameplay mechanics, but I'm full of questions now and I wish they could've been explained in the game. They might be holding it back for sequels and expansions but even so it felt 'incomplete' anyway.  Its a very easy game, hard only offered a challege in the first few hours with enemies interrupting my castings. The combo abilities are too strong same for scalling and stacking magical buffs. I had a character with +60 damage at one point. My next playtrough will be on path of the damned and with a single caster.  It felt a little bit rushed on some occasions, Pillars of Eternity for example took me like 90 hours to finish and Tyranny 55. It should have more content...  I Missed big dungeons and epic fights. and more regions. It had little exploration I know its not a 'Dragon Crpg' but still. Guess all I can do now is wait for an expansion and hopefully an iteration.",
            "review_score": "1"
        },
        {
            "review_text": "Comparing it to Obsidian's previous RPG Pillars of eternity, its an upgrade in some aspects and a big downgrade in others.   ++ Character progression and leveling up is way more satisfying then POE here, abilities active or passive feels significant and changes the gameplay to your playstyle, whether you want to have a mix of a mage and a rogue you can definitely do that here, they are no classes to define you character so you can go wild or stick to a specific build which is equally rewarding as each tree has powerful abilities the more you invest in them, which made the combat much more fun, skills level up as you use them so there's are no skillpoints in this game, but you get a point to level up your attributes every level which in turn level up your skills.  ++ Companions offer a lot of opinions and reactions to your choices and have a lot of dialogue and backstories, this isnt POE in terms of a major event that progressed the story that dosent have any reaction from your companions, here they will either gain your loyalty or fear or just have some insight depending on your dialogue options that's not necessarily good or evil but more of what suits their personality, Also each companions has A LOT of dialogue to delve into which very enjoyable to me.  ++ The whole setting is fresh and new instead of your typical fantasy game, it's a world that's tells a story from a side that you barely experience in an game.   +Conquest is such a fantastic idea to this game, its this small 'text adventure ? ' that dictates your actions and your choices in the start of the game so when the game begins there's actual backstory to your character that makes you feel like your character is a living breathing person in this world with their own choices.   + Art direction is gorgeous in this game, each location looks different, detailed and overall aesthetically pleasing, Soundtrack is just so good, fits this grim dark world that obsidian crafted.    -- If you're coming from POE and expect a lot of locations that you can explore and sidequests to complete then you're gonna be disappointed, this game sadly lacks that extra content with its linear locations that offer minor exploration, and quite honestly barely any sidequests.   -- Speaking of linearity I've never felt linearity in choices in an rpg game before, while other games at least have that illusion of choice this game offers none, there's about four pathes that you can follow and thats about it, the game will tell you that you gained wrath or favor with certain factions that makes you feel like you actually have a choice with them then surprises you with the one sole option of killing them and turning them hostile and does it over again and again at a rate that just ♥♥♥♥♥♥ me off being a huge fan of obesidan's work, they're usually masterminds at creating choice and consequence and huge freedom with factions that this game strongly lacks.  - Some companions will tell you their troubles and problems but that's about it, there's no followup quest or payoff to their stories,   Why cant I help Sirin with her headdress or help Verse find peace with her guilt for her scarlet sisters death?    ,instead there's barely any mention of these events in the game later on.   - The epilogue and the ending felt rushed and and an excuse for a sequel or an expansion instead of another full act, the story didnt really offer closure to my character's journey and left it unfinished.    tl;dr : Tyrrany is an enjoyable game set in a fascinating orignal world, while it lacks in content and leaves much to be desired in terms of decisions, Its still a soild RPG on its own right and offers you an experience that you're just not going to get from any other RPG.",
            "review_score": "1"
        },
        {
            "review_text": "7 hours in and I can say that I have two chief complaints. The first is the combat. It has alot of room for improvement. I don't even know where to begin it's just so trashy. The second is the vitality stat. Boost your vit and use your % healing potions to never die. Like ever. The pros however, are good but some may see themn as not enough. I love the story and gameplay. I can say that I've never played a game quite like it where legitimately every decision and conversation piece will affect how an individual or faction feels about you. I also like the class breakdowns and functionality. Overall 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "I just love this game the story settings is so much better then Pillars of Eternity!",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying it as my first isometric RPG.",
            "review_score": "1"
        },
        {
            "review_text": "I've always had trouble playing the ♥♥♥♥♥♥♥ in games. My Commander Shepard was so Paragon across all three games it hurt. My Fable dudes are always glowing a bright blue, and my iteration of Thedas is as close to rainbows and dewdrops as it's able to get after my targeted playthroughs. Playing virtual ♥♥♥♥ just doesn't come easy.  Except for Tyranny. Something about getting to be coldly efficent and brutal in your evil just makes it so much more fun than the usual puppy kicking and random dickishness that generally passes for Renegade options. My party members can love and loath me in equal measure, and when displays of brutal legal logic aren't enough to get needy NPCs to back down, a government sanctioned sword to the gut does wonders. I love it.  I've only played up to the end of the intro mission set (itself an all day task), so maybe it all falls to pieces later on, but as it stands, I am enjoying the hell out of this game. More than I have any recent ARPG release in quite some time.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, and I'll buy any expansion they make. :)",
            "review_score": "1"
        },
        {
            "review_text": "Tyranny is an amazing game with easy to pick up hard to master mechanics and your decisions really affect the story and the possible party memebers you can aqquire this is the first RPG in a long time where i felt as if my decsions actually matterd and make a difference replayability is very real for this game in the differences of classes and chocies you can make the game is hard in the beggining and when you learn how the game plays it becomes much easier   9/10 buy thuis game 45 bucks is a steal",
            "review_score": "1"
        },
        {
            "review_text": "I've heard that the game is short, and that very well may be true, but by god is this ever a fun game. The game is incredibly reactive to your decisions, and doesn't shy away from blocking off huge swathes of the game in order to reflect your decisions. The RPG components underneath are fantastic as well. Just an awesome experience.  If you like RPGs, do yourself a favour and pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "Love the lore, amount of it and the story overall. The Conquest option in character creator really helps feeling more like a right-hand of someone. A general as it were. And the choices really convey through the rest of the game.  The companions are a little less memorable and fleshed out than Pillars of Eternity (though I am only five hours in game). And I could not help but to notice the lack of sidequests (thought I probably miss them. I always do on a first playthrough). But it's not too bad because they certainly make their loyalties and beliefs known so that you háve to take them accounted for. Plus, gaining favor is gaining bonuses in combat.  Combat is easy. Less hard than PoE, making this game more friendly to newbies in the genre. It's not tedious however and you can do combo's with your companions, another nice feat.  Overall a pretty good game so far.",
            "review_score": "1"
        },
        {
            "review_text": "Basically Diablo meets Final Fantasy with the option to choose your path in the story at many points.  I know I've only scratched the surface of this game so far, but I must say that I've never been so invested in an RPG since Witcher 3. Granted, there are several RPGs I've played a lot of, but only a few were even remotely interesting as far as the writing (let alone the voice acting.) Not to mention the idea of starting off serving the typical enemy alignment is rather refreshing knowing where developers typically go for, but that's just me.  Also, the conquest mode at the beginning was an interesting way of laying out the events of the actual game, considering you're playing a role that undoubtedly requires a heavy background where you start in the game, so that was pretty neat.  All that aside, a solid, beautiful, and immersive RPG experience that I wish I could see more of. Would definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Sweet holy awesomesauce. Who knew changing one element of the standard RPG system could result in so much fun?  That's not saying Tyranny is a one-trick pony. There's a lot to love about the game: It flips the usual RPG story on its head - you serve the evil overlord conquering the land rather than fighting against them. It allows for a lot of character customization, including your backstory via the 'Conquest' feature where you get to make decisions about how your character, a Fatebinder, handled various situations during the initial conquest of the Tiers. The magic system is awesome and lets you create your own spells using three or more components. On top of that, it's one of the few RPGs where it doesn't make magical combat characters feel useless or weak until the very end of the power curve.  But where it really shines is the fact that they've changed the way you play the social game. Your power means something and that is the defining factor in all your social interactions. You don't need to make nice with characters that clash against your PC's morals or goals because your power keeps them bound to you, even if only because they're terrified you'll burn them to ash with a look. You get benefits from loyalty and favor, but you also get benefits from being feared and hated. This one tweak in perspective alters the entire approach to the story and frees you to play the way your PC would in a way that, honestly, rarely exists in any RPG.   This review has been a bit gushy, for sure, but there's very little to dislike about Tyranny. It is what it is and it's very well executed.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game, but it is a bit short.",
            "review_score": "1"
        },
        {
            "review_text": "Yet another great looking game from Obsidian. Although I personally think it falls a little short in it's promise to place you at the helm of evil - It's still really, really good. It plays well and feels thight, even though it has a somewhat dumbed down combatsystem compared PoE. I mostly liked it, it was more intuitive and easy to use. Minus the hotkey arrangement. I found the story to be interesting and a driving force throughout the game. However I felt that it did fall a little short at the end of the last Act, and it did leave some unanswered questions. This is a great game, it's fun to play and offers replay value to those who feel like exploring more of the games lore and alternative story.   Amazing, but ambiguous game.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to a rpg you can really evil if you want and still be able to finish the game.  Being to good guy can be tough will try it next time",
            "review_score": "1"
        },
        {
            "review_text": "Recommended if you like the genre but, too short, not enough!!! Cant even steal or kill...",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "I don't think I've ever played a game 4 times straight in a row before. Tyranny isn't without its flaws, including a rather rushed-feeling third Act, but the difference your choice of faction alliance can make in a playthrough makes this game the most satisfying replay experience I can remember.",
            "review_score": "1"
        },
        {
            "review_text": "Loved Pillars and Tyranny is a blast so far",
            "review_score": "1"
        },
        {
            "review_text": "Well written and nicely executed. interesting theme. One of the only games that kept me engaged until the very end.  Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Huge lore, captivating atmosphere, nice fighting elements. A must-buy old school RPG. Hail Kyros",
            "review_score": "1"
        },
        {
            "review_text": "A fun RPG that explores aspects of right and wrong, and forces difficult decisions, although it seems a bit short with Act 3 in particular being very short, I still feel it is worth recommending.",
            "review_score": "1"
        },
        {
            "review_text": "Good game with an innovative reputation system.",
            "review_score": "1"
        },
        {
            "review_text": "A great upgrade to the classic genre of isometric RPG's. To caviate, I have been a fan of older games like Baulder's Gate and Icewind Dale and I had much anticipation for this and was not disapointed. They have taken a stratregic squad based combat to the next level and taken a classic genre and done a great job modernizing it. Hope to see more of these kind of games in the future.  To address the similarities with Pillars of Eternity, it plays similar but thre are a slew of specific differences that change how combat plays out. First and foremost classless system is awesome, standing/reputation system is fun and well thought out, and the group combos are treasures to be saught after and spared for the most opportune times.",
            "review_score": "1"
        },
        {
            "review_text": "I eagerly followed the development of this game and I was definately not disappointed. I love this game. Sure it isn't perfect and is a little short but the replayability is great and the story line is amazing. The magic system is my favorite aspect. I highly recommend this game for anyone who loves old school RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "A good game. Good pacing in the start. Sadly the last Act and ending feels rushed.",
            "review_score": "1"
        },
        {
            "review_text": "9.5 Not as engaging as pillars of eternity but has good branching paths for multiple playthroughs. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable although playing as a mage I found my second act power spike took a lot of the challenge from the game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is one of the best games I've played in the past few years, at least for the 30 hours I've played. Last act of the game took me 3 hours to do everything I could in a run where I tried to keep all my options open. I would still recomend this game, but at the same time I hope a real final act will be added to the game at some point.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, really has you feel like your decisions matters and is chock-full of diverse interactions with real consequences. You are constantly faced with *serious* decisions, like those that would kill potential companions, often - and the game wholly changes in ways you can't predict. Didn't save that enemy guards life? The interaction with his brother 2 days from now will be totally different.  If you like RPGs, particularly 'deep' ones, this is a great title.   Those who like hack-n-slash (diablo) type games beware though, this is not that game.",
            "review_score": "1"
        },
        {
            "review_text": "Best RPG of this style that I've played since Dragon Age: Origins",
            "review_score": "1"
        },
        {
            "review_text": "Great RPG where your decisions really affect the journey to the ending, which also gives it good replayability potential.",
            "review_score": "1"
        },
        {
            "review_text": "For me:  Tyranny&gt; Pillars of Eternity",
            "review_score": "1"
        },
        {
            "review_text": "Great game. killed a baby. Destroyed a town. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Play as the bad guy Win as the bad guy Kill or die as the bad guy Fun stuff with the bad guys",
            "review_score": "1"
        }
    ]
}