{
    "app_id": 362930,
    "name": "Garfield Kart",
    "release_date": "2015-10-16",
    "developer": [
        "Artefacts Studios"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Cult Classic",
        "Competitive",
        "Racing"
    ],
    "achievements": 0,
    "positive_ratings": 4262,
    "negative_ratings": 598,
    "price": 3.99,
    "description": "Join Garfield and his friends in the funniest fast and fur-ious game! What character do you want to play with? Garfield, Odie, Jon, Nermal... you choose! Take part in no-holds-barred crazy races.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/362930/header.jpg?t=1478597787",
    "minimum_requirements": "OS: XP, 7, Vista, 8 Processor: Intel Core 2 Duo 2.0GHz (or equivalent) Memory: 1 GB RAM Graphics: 256 MB DirectX: Version 9.0c Storage: 250 MB available space Sound Card:",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "i crashed into a pole and the game crashed",
            "review_score": "1"
        },
        {
            "review_text": "It's like if Witcher III and dark souls III and Undertale had a child    But they aborted it and adopted this magnificent mixture of open world mmorpg, point and click adventure and another ♥♥♥♥ing idubbbz reference",
            "review_score": "1"
        },
        {
            "review_text": "I got this as a joke and I'm not laughing.  EDIT: 11/28/2016  Nope. Still not laughing.",
            "review_score": "-1"
        },
        {
            "review_text": "  you can use an actual steering wheel to play it  p.s i ate lasaga while playing  jon/10",
            "review_score": "1"
        },
        {
            "review_text": "Needs online multiplayer",
            "review_score": "-1"
        },
        {
            "review_text": "So I obviously didn't unironically buy this game, but I do honestly enjoy it. It's extremely similiar to Mario Kart...like, a LOT. The controls are weird, so that's why I plug in an NES controller to play it. If you want to fit in with the cool edgy kids, check out this game.",
            "review_score": "1"
        },
        {
            "review_text": "I hate that they had to have the 'it was all a dream' ending but the sex scenes were great. Also Christopher Walken's cameo was neat.",
            "review_score": "1"
        },
        {
            "review_text": "Stuffing your face as usual.",
            "review_score": "-1"
        },
        {
            "review_text": "The weed has been smoken",
            "review_score": "1"
        },
        {
            "review_text": "Best game I have ever played in my life.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is so much more in depth and did what no man sky could never achieve, and that's immersion. You want garfield to ♥♥♥♥ing win this race or else the president ♥♥♥♥ing dies from aliens that are revealed later in the story to work with hillary clinton.",
            "review_score": "1"
        },
        {
            "review_text": "I thought I had seen it all. I have seen water not rendering, games crashing randomly, Satan enjoying a nice serving of decapitated BLOODY CHILDREN. HOWEVER NONE OF THOSE THINGS COMPARE TO WHAT MY EYES WERE JUST SUBJECTED TO.  The controls feel like the rear of a homeless man's ♥♥♥ after having sex with 5 hookers, slippery yet surprisingly firm. The graphics are as if my dog somehow managed to access Microsoft Paint, not any other program mind you, and decided to bark on the keyboard. Later, when somebody cleaned the keyboard of the vomit they pressed down everything and somehow those pixelated lined were born. The music sounds like the death of every human simutaliniously being processed into a Dollarama grade microphone (So it was the highlight of the game)  TL:DR I felt my dreams melt away after playing this game. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Always been a Garfield fan. Cute little cat. So I got this game. Nothing wrong with it in my opinion. Fun, simple racing game similar to mario kart. Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "before this game i didn't have a single desire to live. after this game, i still don't have a single desire to live. 10/10",
            "review_score": "-1"
        },
        {
            "review_text": " Garfield Outshines Himself  Not since the days of Garfield and Friends has Jim Davis been so committed to the Garfield franchise on its current generation: 2009 was the year that Jim Davis revamped the 3D Garfield design with The Garfield Show. Just a short wait later, Jim Davis returned to his first Steam Garfield game to give it a second go: there is so much creativity, variety and challenge poured into this masterpiece. 2009 The Garfield Show was brilliant, but 2013's Garfield Kart is absolutely amazing.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Truley a mondern day masterpiece.  i like how the game becomes more difficult if played on a monday.",
            "review_score": "1"
        },
        {
            "review_text": "where's the eurobeat &amp; multiplayer we were promised at the e3 trailer?",
            "review_score": "-1"
        },
        {
            "review_text": "Runs 30fps and frequent drops on a gtx 970. 10/10 optimisation =",
            "review_score": "1"
        },
        {
            "review_text": "  You will never need to buy another game again.",
            "review_score": "1"
        },
        {
            "review_text": "Garfield Kart? More like, my life is falling apart.",
            "review_score": "1"
        },
        {
            "review_text": "best racing game.mario kart steal ideas from my game.lets sue nintendo",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year. Game only topped by No Man's Sky.",
            "review_score": "1"
        },
        {
            "review_text": "LASAGNA GN  This game is desserving of your money this is by far the best racing game on pc It's no joke challenging as ♥♥♥♥, good ♥♥♥ characters you'll remember from when you were a young lad, and you cant get it to run good even on a beast of a machine so ya   P.S. --------- NINTENDO RIPPED THIS GAME OFF MARIO KART 7 STOLE ALL THE MECHANICS FROM THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "why was bozin6 afraid of bozin7?  because boizn7 bozin8 bozin9.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly one of the best games I've ever played. Bought this with my youtube ad revenue.",
            "review_score": "1"
        },
        {
            "review_text": "Race Garfield™",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually preety fun",
            "review_score": "1"
        },
        {
            "review_text": "Even Shrek is not this good ",
            "review_score": "1"
        },
        {
            "review_text": "Garfield Kart is an abomination of nature that has no justification for its existance. Somehow this game has some of the worst optimization I have ever seen paired with controls that stripped any fiber of a will to live I had left. After dragging the corpse my soul is trapped in through the 'Lasagna Cup', I excitedly await to sleep my final sleep. Garfield Kart is definitive proof that there is no god. Kill me",
            "review_score": "-1"
        },
        {
            "review_text": "In one day, this game gave me chronic lung cancer, and then cured it.",
            "review_score": "1"
        },
        {
            "review_text": "  this game reminds me of clinical depression 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I highly reccomend this game. It is the glue that holds our modern society together.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game with my own money.  Mom is dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "crash bandicoot kart better",
            "review_score": "1"
        },
        {
            "review_text": "playing this opened my third eye and awakened a clairvoyant power inside of me. because of this game i can now summon crystals from abstract dimensions and cure diseases with my mind",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly the best Mario Kart installment from Nintendo ever! The addition of Garfield characters and getting rid of Mario was an amazing, but risky move to make on Nintendo's part. I'm still baffled on how they even got the rights to the Garfield characters. The controls, as you would imagine, are smoother than ever before, and the new items are top knotch. The addition of pies, lazagna, and UFOs really fit the new Garfield style. So, overall I would say this game is a MUST BUY, and it's only 8 dollars so why not!",
            "review_score": "1"
        },
        {
            "review_text": "[Snoring] - [Ringing] - Huh? What the... Aw. Oh... [Groans] I hate Mondays. [Yawning] Pooky, cover me. I'm goin' in. Alley... oop.! B-b-b-b-b-bah, ha! [Singsong] Oh, Sleeping Beauty, wake up. You can stop dreaming about me because I'm here. Now, just wake up. You've got work to do. You're not just my owner, you're my primary caregiver. - Now be a... - Not now, Garfield. Get... A-Ah... Just... All right. Cut the sweet stuff. Easy now. Just... Trying to cuddle with me, huh? Trying to avoid your duties, huh? Well, that just ain't gonna... fly! It isn't gonna work with m... me. See, I'm getting my exercise, doin' my job. Just one quick cannonball! - Oh! - Morning. Garfield! ?? [Jon Singing] Okay! I think you're clean enough now. - H-H-Hot.! Hot.! Hot.! - Got your towel right here. Garfield.! No.! [Beeps] - It's liver flavored. - Mm! Delicious. [Gags] Mm. Mm! Mm! Oh! Oh, liver! - [Spitting] - Well, actually, it's liver flavored. [Sighs] That was a good breakfast. Now I think I'll just fall off the 'Catkin's' diet... and get myself a little high-fat chaser. Mmm. - Garfield, look, the milk truck. - Oh, attaboy, Nermal. - The milk truck comes every day. - Yeah, but maybe not today. Maybe it's changing routes. Maybe this'll be the last we'll ever see of it. Come on. It's just across the street. We're cats. We like milk. - Let's go for it. - No. - But, you... - - But nothin'. I don't leave the cul-de-sac for anything. Out there, it's a hornet's nest of trouble. Bad things happen out there. So I don't go out there. Besides, I've found if you wait long enough... everything comes to you. [Nermal]? Here come the milkman Here come the milkman? - ? He got his shoes on, he got his milk pan?? - Hey, Nermal... let's play astronaut again today. - Yeah? - Yeah, I love that game. You're such a brave little astronaut. - All right. - Prepare tojump into your spaceship, Commander Nermal. But wh-wh-what about the milk? - Who needs milk when you can be in outer space? - Ah. - You got a secret mission today. - Yeah? - You'll be exploring the Milky Way. - Okay. I get the chills when you jump in your little spacecraft. The nation thanks you. Prepare to blast off. - I'm ready to go, friend. - Three, two, one. Whoa! Now I feel like it. Bon voyage. Look at me go.! Whoo-hoo.! - [Garfield] Don't look down.! - I'm an eagle flying.! [Garfield] Come to papa, baby. I can see everything up here. I can see my house. [Burps] Got milk? I can see the whole neighborhood. - Well, that's nice. That's very nice. - Hey, there's another milk truck. Ooh.! And that is even nicer. - I can see... Whoa! - Mission accomplished, Nermal. Whoa.! Whoa, Garfield, do it again. Where did everybody go? You're on the wrong side of the street, fat cat. Beat it! And you, Luca, the wrong side of the evolutionary curve. Okay, that's it. - You're gonna get it good today. - I make a point to get it good every day. The real question, Luca, is how shall I outwit you this time? - What? - Shall I baffle you with simple math? - I know how to spell. - Or should I distract you with something shiny? - Now you're making fun of me. - I hope so. You're no fun to look at. You'll never get the best of me! Aaah! - I think I just did. - Not the ducks again! Jump back! And kiss myself. Oooh! If I ever get off this chain, you're goin' down. Everybody back up! I don't know how wild this thing is gonna get. I love the smell of cinnamon-apple in the morning. [Sniffs] It smells like... victory. [Luca] Oooh! I hate this fat cat. So much time, and so little I need to do. [Squeaking] Mouse! No thanks, I'm full. Get him, Garfield! Get him, Jon! - [Jon Yelling] - [Objects Crashing] Oh, it's always gotta be smashing and crashing. Nobody poisons anymore. Aha.! Whoa... [Groans] There's my ball! What good is a cat that can't chase a mouse? I don't do the chase thing. All right, I'll handle this. I know you don't hear me, but can't you just listen? [Panting] Louis, what are you doing in the house when Jon's home? Sorry, Garfield, man. I couldn't help it. Look, when he sees you, he expects more from me. Don't you get that? Jon's got those macadamia nut cookies. I'm trying to maintain. - You understand? - Sure. As long as you understand I have to eat you. Aw! [Garfield Swallows] Mm. Mmm. [Slurping] - Mm! Mmm! - Oh, good boy. See, I knew you could do it if you put your mind to it. - You are the best cat a guy could have. - Mmm. [Chuckles] Mm.! Mm.! Mmm. M-M-M-M-M-M-M-Mm. Have you tasted yourself lately? Hey, it wasn't exactly the first-class lounge in there for me either. Get yourself lost. Take a powder for a couple days, get a haircut and grow a beard. Cool. I owe you one, 'G.' I got a question for you. Do you love your cat? Finally, back on my regular schedule. You're gonna make sure he has nothing but Kibbly Kat food. Isn't that right, Persnikitty? That cat's puss is everywhere... TV, newspapers, T-shirts. Who would want that kind of exposure? [Door Opens] - Hey, buddy. - Yeah, cut the small talk. What's in the bag? Remember, be happy. I'm happy when I'm with you, you delicate mlange... of tomato paste, ricotta cheese, ground meat and pasta! Garfield, don't even think about it. That's my food. I may just nibble. Thanks, Happy. And thank you for joining us. I'm Christopher Mello. Remember... Be happy. - [Bell Rings] - Okay, cut. Good. - [Sneezing] - [Man] We're clear. Give me the Benadryl. Give me the Benadryl. Yeah! Yeah. Yeah! Yeah. Damned cat allergies. [Sneezes] Any word from the network yet? Uh, no, but they're looking for a dog act on Good Day, New York. Dog act! Story of my life. Looking for a dog, and I'm stuck with a cat. I thought the segment went quite well. [Whiny Voice] 'I thought the segment went quite well.' Of course it went well, you toad! The 50 housewives who saw it, loved it. This is WalterJ. Chapman reporting live from The Hague. Oh, please, what a know-it-all! ...were met with angry crowds... And everybody always said I was the handsome one. I was the smart one. And I was born first. But there you are 'live from The Hague'... and here I am working with this sack of dander on a dead-end regional morning show. Back to you, Dan. Back to you, Dan. Garfield! - [Moaning] - Did you eat all four boxes of lasagna? [Hiccups] It's not my fault. They started it. What am I gonna do with you? Love me. Feed me. Never leave me. Come on. Let's go for a ride to someplace you love... that always leaves you feeling pampered and refreshed. Huh? Oh, I know... Chuck E. Cheese. [Garfield] Thank you. No? Wendy's? Taco Kitty? No? Well, I'm stumped. Maybe Olive Garden for you? Hmm. The only time I ever leave my cul-de-sac is when Jon takes me to the vet... which he's been doing a lot recently, and it appears to have nothing to do with me. Jon must want to go for his own reason. Well, there's nothing wrong with Garfield. He's just a happy, fat, lazy cat. No need for a second opinion. - Well, I worry about him. - I know you do. Ooh! [Giggles] You know, you care about him more than any owner I've ever known. 'Him' has a name. Is this an H.M.O.? Let's get Garfield in for his dip. I wanna talk to you in private. - Mm. Oh! - She's so beautiful. Uh, Mr. Pathetic, you've had a crush on her since high school. Would you please ask her out so she can reject you, and we can get on with my life? - I have to ask her out. - [Groans] - Wish me luck. - Okay, go get 'em, big tiger. You the man. You the fella. You the boss. You preach to her. Show her how the cow eats the cabbage... you hopeless loser. Betty, today, why don't you start me off with a Swedish massage... a manicure and a pedicure, okay? Seaweed wrap, loofah... belly rub, uh... tail waxing and then crack my toes to finish. Jon, there's something important I need to ask you. Something that I wouldn't ask most guys who come in here. Wait, no. I think I know where this is going. - You do? - I do. Liz, I've wanted to ask you the same thing for a very long time. - Are you sure that we're talking about the same thi",
            "review_score": "1"
        },
        {
            "review_text": "please understand this is my personal opinion on this game  Review is based on current state of game.  Game Cons • Not an Open world • No labels for options • No online • Not A hideo kojima game • what seems to look like micro transactions   Game Pros • Not a GPU/CPU heavy game. Easily runnable. Smooth as butter.  • Beautiful visuals  • Clean menu • In-depth story • You can easily get immersed in the game and play it for hours without even knowing it • Not a game you can just breeze through in just 10-20 hours.   Controversial Features controller support  i personally regret buying this game atleast it was very cheap on the steam sale  Relateable Games Sonic And Sega all stars racing ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't even buy this game as a joke. -This game is badly optimized -It's a port of an existing mobile game -The controls are so bad it makes you play Twister on your keyboard -Some of the background music has an annoying high frequency that can, literally, give you a bad migrain -The collision psychics barely exist -There's no catching up on racers ahead of you -Power Ups are pixel-perfect -Very boring when there is no obstacles -In-Game purchases needed to help you win -You only get 1 track and the rest need to be payed for  It may not seem that bad the way you look at it, but all of these problems are legit and serious, this is indeed one of the worst racing games ever, Big Rigs is better than this crap. You are better off buying a $50 2DS off Amazon and a used $20 copy of Mario Kart 7.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont know WHAT it is but this game makes my stomach sick but also gives me sort of an erection.  jesus christ",
            "review_score": "-1"
        },
        {
            "review_text": "All the problems of Mario Kart racing without its charm.",
            "review_score": "-1"
        },
        {
            "review_text": "This game perfectly repreasents nazi propaganda.",
            "review_score": "1"
        },
        {
            "review_text": "AAA Standards and the most realistic racing game currently on the market.",
            "review_score": "1"
        },
        {
            "review_text": "Jon is my favourite",
            "review_score": "1"
        },
        {
            "review_text": "please, please give me the sweet release of death.",
            "review_score": "1"
        },
        {
            "review_text": "Cant play, No online play,  Friends are here, Kicked backed to home page  Crashed five times Cried five times  Bought for memes So still good for me",
            "review_score": "1"
        },
        {
            "review_text": "ADOLF HITLER: EARLY YEARS, 1889–1913  Related Articles Comments How to cite this article Baptized a Catholic, Adolf Hitler (1889–1945) was born on April 20, 1889, in the Upper Austrian border town Braunau am Inn, located approximately 65 miles east of Munich and nearly 30 miles north of Salzburg.  His father, Alois Hitler (1837–1903), was a mid-level customs official. Born out of wedlock to Maria Anna Schickelgruber in 1837, Alois Schickelgruber changed his name in 1876 to Hitler, the Christian name of the man who married his mother five years after his birth. Alois Hitler's illegitimacy would cause speculation as early as the 1920s—and still present in popular culture today—that Hitler's grandfather was Jewish. Credible evidence to support the notion of Hitler's Jewish descent has never turned up. The two most likely candidates to have been Hitler's grandfather are the man who married his grandmother and that man's brother.  LINZ    In 1898, the Hitler family moved to Linz, the capital of Upper Austria. Seeking a career in the visual arts, Hitler fought bitterly with his father, who wanted him to enter the Habsburg civil service. After his father's death, Hitler eventually persuaded his mother, Klara Hitler, née Pölzl, to permit him to pursue his dream to become an artist. As she lay dying of breast cancer in the autumn of 1907, Hitler took the entrance exam to the Vienna Academy of the Arts and failed to gain acceptance. In early 1908, some weeks after Klara's death in December 1907, Hitler moved to Vienna, ostensibly in the hope of renewing efforts to win acceptance in the Academy of Arts.  VIENNA    Hitler lived in Vienna between February 1908 and May 1913. He had grown up in a middle-class family, with relatively few contacts with Jewish people, in a region of the Habsburg state in which many German nationalists had been disappointed that the German Empire founded in 1871 had not included the German-speaking regions of the Habsburg Monarchy. Yet the legacy of the Vienna years is not as clear as Hitler depicted it in his political autobiography. His impoverishment and residence in homeless shelters began only a year after his arrival and after he had frittered away a generous inheritance left by his parents and rejected all arguments of surviving relatives and family friends that he embark upon a career in the civil service.  By the end of 1909, Hitler knew real poverty as his sources of income dried up. That winter, however, helped briefly by a last gift from his aunt, he began to paint watercolor scenes of Vienna for a business partner and made enough to live on until he departed for Munich in 1913. It is likely that Hitler experienced and possible that he shared the general antisemitism common among middle-class German nationalists. Nevertheless, he had personal and business relationships with Jews in Vienna and was, at times, dependent in part on Jews for his living. This may have been a cause for discretion about his actual feelings about Jews. It was not until after World War I that Hitler can be demonstrated to have adopted an “antisemitic” ideology.  INFLUENCES UPON HITLER IN VIENNA    Hitler was genuinely influenced in Vienna by two political movements. The first was the German racist nationalism propagated by the Upper Austrian Pan-German politician Georg von Schönerer. The second key influence was that of Karl Lueger, Mayor of Vienna from 1897 to his death in 1910.  Still in power when Hitler arrived in Vienna, Lueger promoted an antisemitism that was more practical and organizational than ideological. Nevertheless, it reinforced anti-Jewish stereotypes and cast Jews as enemies of the German middle and lower classes. Finally, unlike Schönerer, who was always more comfortable with the elitist nationalism of the student fraternities, Lueger was comfortable with big city crowds and knew how to channel their protest into political gain. Hitler drew his ideology in large part from Schönerer, but his strategy and tactics from Lueger.",
            "review_score": "1"
        },
        {
            "review_text": "I tried this game at 480p in very low settings (the lowest of lowest settings) and it still lagged! Thank god for the refund policy on steam so i can buy another game which will actually run with more than 10 fps.",
            "review_score": "-1"
        },
        {
            "review_text": "buggy trash also i bought it as a joke so yeah",
            "review_score": "-1"
        },
        {
            "review_text": "This game claims to have partial controller support. Now, imagine there is a god who is called the Steam Controller. Gaben is his son, so he is our Jesus. Now imagine all the people in the land bow to this religion. Mostly everyone in the enitre universe loves this God. They pray and worship, and then the day comes. To present the honor of being the new re-incarnation of God onto a mortal, because they are worried of the people no longer having faith in the Steam Controller and his son Gaben. Now imagine if this game is a nonbeliever. And no one knew until they passed down the honor of becoming worshiped to this game. There is no support. There is no God.  But at least I got in when it was on sale. :)",
            "review_score": "1"
        },
        {
            "review_text": "Gotta have a good game",
            "review_score": "1"
        },
        {
            "review_text": "This game claims to have partial controller support. Now, imagine there is a god who is called the Steam Controller. Gaben is his son, so he is our Jesus. Now imagine all the people in the land bow to this religion. Mostly everyone in the enitre universe loves this God. They pray and worship, and then the day comes. To present the honor of being the new re-incarnation of God onto a mortal, because they are worried of the people no longer having faith in the Steam Controller and his son Gaben. Now imagine if this game is a nonbeliever. And no one knew until they passed down the honor of becoming worshiped to this game. There is no support. There is no God.  But at least I got in when it was on sale. :)",
            "review_score": "1"
        },
        {
            "review_text": "gave me a reason to not kill myself i want to die/10",
            "review_score": "1"
        },
        {
            "review_text": "The best and worst game i have ever played 10/10 gameplay. The soundtract sounds like a cat being stabbed, graphics are next gen and it's a mobile game ported to pc: great game in general.",
            "review_score": "1"
        },
        {
            "review_text": "Garfield walked into my room and pushed my ♥♥♥♥ in. I've never felt violated in my life. He's a bad, bad kitty.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a spicy meme-a ball!",
            "review_score": "1"
        },
        {
            "review_text": "This game is as lit as ａｌｌ ｔｈｅ ｅｎｅｒｇｙ ｔｈｅ ｓｕｎ ｗｉｌｌ ｐｒｏｄｕｃｅ ｉｎ ｉｔ＇ｓ ｌｉｆｅｔｉｍｅ．This game is way better than maryo cart or whatever.",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME OF ALL TIME HANDS DOWN (not really it's crap)",
            "review_score": "-1"
        },
        {
            "review_text": "  So my dad is a veteran and I showed him this game... he said the intense gore and intense violence was to much like the war he was in... he cried a bit",
            "review_score": "-1"
        },
        {
            "review_text": "best game i've played in awhile...",
            "review_score": "1"
        },
        {
            "review_text": "Very well optimized and wonderfull tracks with great characters.",
            "review_score": "1"
        },
        {
            "review_text": "Controller support lacks in this, forces you to use a mouse as well o.O and the random game laggs which seems to be a common thing on this even on lowest setting, couldn't get much further than first race as I like 30+ fps",
            "review_score": "-1"
        },
        {
            "review_text": "I can run Overwatch at the highest settings but I can't even play this ♥♥♥♥ past Medium.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game so I could write a review, but sadly, the memes in this game are on a completely different level than reality, therefore they can not be talked about here. I have to refund the game quickly before the world as we know it falls into the abyss.",
            "review_score": "1"
        },
        {
            "review_text": "Wanna last longer during sex? Well now you can! Just get ya girl in the good ol' doggy style and play this game my friend! :D",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Plot 10/10 Game Design 10/10 Game play 10/10 Lasaga Deserves game of the year for every year. I voted 'Sexiest characters' Award.",
            "review_score": "1"
        },
        {
            "review_text": "very good and fun game would buy sequel and love garfield",
            "review_score": "1"
        },
        {
            "review_text": "In a multiverse of infinite realities, we are lucky enough to live in the one with this",
            "review_score": "1"
        },
        {
            "review_text": "Got this game during the Halloween sale because it was tagged 'Phycological Horror'  11/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best purchase i have made in a while. This game is really fun",
            "review_score": "1"
        },
        {
            "review_text": "  I want a refund",
            "review_score": "1"
        }
    ]
}