{
    "app_id": 363460,
    "name": "Spermination",
    "release_date": "2015-04-29",
    "developer": [
        "Phr00t's Software"
    ],
    "publisher": [
        "Phr00t's Software"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "VR Support",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Action",
        "Indie",
        "Racing"
    ],
    "achievements": 16,
    "positive_ratings": 351,
    "negative_ratings": 56,
    "price": 1.99,
    "description": "Fight the battle you already won, but never remember. It is you up against 1000 other sperm fighters. Can you beat off your competition and come first? Finally, collect your very own baby gnomes as trophies for your minivan!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/363460/header.jpg?t=1451573651",
    "minimum_requirements": "OS: Windows 7 Processor: Dual-core Memory: 2 GB RAM Graphics: ATI or NVIDIA (Intel HD NOT supported) DirectX: Version 9.0 Storage: 200 MB available space Sound Card: OpenAL Supported Additional Notes: Java 8 included in Spermination",
    "recommended_requirements": "OS: Windows 7 Processor: Quad-core+ Memory: 4 GB RAM Graphics: ATI or NVIDIA (Intel HD NOT supported) DirectX: Version 9.0 Storage: 200 MB available space Sound Card: OpenAL Supported Additional Notes: Java 8 included in Spermination",
    "reviews": [
        {
            "review_text": "This game is for children, 'IF YOU ARE A PARENT,' and only if you are a parent. Show your children this game. It will explain how babies are made.  Pros -Addictive -Fun -First-person Sperm -Educational  Cons -Needs Multiplayer!!!    Don't pullout  ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 let me play with sperm and not get messy",
            "review_score": "1"
        },
        {
            "review_text": "For years now I've been trying to kill off these pesky little buggers. This game totally ROCKS! It's Out-Of-The-Box concept makes for hours of crazy fun. If you're having trouble running the game (like I did), the devs are great and will work with you to get the game up and running....It's so worth it! I have to said it, devs...Those little 'Bundle OJf Joy's are truly Butt-♥♥♥ Ugly, lol! Anyway, the price certainly is fair enough for one of the funnest games out there. I laughed so hard, I thought I'd have a laundry problem! Devs, thank-you for giving us a game that's totally out of the box and off the wall. Hope to see more adventurous games like this in the future.",
            "review_score": "1"
        },
        {
            "review_text": "   A Crazy Racing Game",
            "review_score": "1"
        },
        {
            "review_text": "took a chance on 3 bucks and it was worth it. simple game, but pretty fun blowing through all the sperms. was a bit hard to get my first baby though, which sounds really funny to say lol",
            "review_score": "1"
        },
        {
            "review_text": "Best Birthday Present Ever.",
            "review_score": "1"
        },
        {
            "review_text": "Well, what can I say... It's something different?",
            "review_score": "1"
        },
        {
            "review_text": "Played Spermination in Science while we were learning about DNA and that crap. Showed the teacher and she approved. Rate 10/10. Will probably get an E for science because of this game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game just based on the name alone. Wasn't too sure what I was getting into. This is the best mistake I have ever made. Relive the day of the 'big race' and get to the egg before someone else does! This game is a great little game. Get it",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fun. This small game has given me more laughs for my dollar than more complex and expensive games. More than worth the three dollar price tag. Anyone saying its too small of a game or not funny enough is seeking way to much out of a game thats about as expensive as a candy bar.  ",
            "review_score": "1"
        },
        {
            "review_text": "Can get Spermy the emoticon from the trading cards and I get to hear a guy nut whenever I want. Nice.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it already. You'll laugh, you'll get digested, you'll enjoy the disco show of turrets shooting at you, and you may even create your own gnomeling at the end (assuming, of course, that you didn't get digested instead).  It's literally that sequence from Family Guy, with extra puns thrown in for good measure. In fact, it's  mandatory  to shout 'VICTORY IS MINE!' in your best Stewie impression when you make your first gnomeling.  I have no other words -- just buy it and play it already.",
            "review_score": "1"
        },
        {
            "review_text": "When It was on sale for a few cents I bought roughly 30-40 copies and gave one to all my friends... Needless to say... It was worth it...  'Prepare your load' 'The Majestic Uterus'...  This game is amazing on so many levels.... Just not the ones that count.  This is a joke game, its also very fun...  Buy it when its on sale... its worth it.",
            "review_score": "1"
        },
        {
            "review_text": "100% anatomically correct. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "What. The. ♥♥♥♥?",
            "review_score": "1"
        },
        {
            "review_text": "okay so take star fox but replace the space ships with sperm and you've got yourself a 10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "I was just curious to play this hilariously themed game, but after downloading it said something about a missing dll file when I try to boot it. So it's not even playable... please fix so I can give this game a proper review.  I have to vote 'no' for now since the game is not even playable, but that may change after I try it...if it's fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "made me ♥♥♥ in 10 seconds",
            "review_score": "1"
        },
        {
            "review_text": "Hillarious game to play with friends who have innapropriate minds like the kids at school.",
            "review_score": "1"
        },
        {
            "review_text": "Bought a GTX 1080 to play this game on VR. Wait can anyone lend me a VR headset to learn the path of a sperm in legitmate first person? thx",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what I expected.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sorry, who's idea was this?",
            "review_score": "-1"
        },
        {
            "review_text": "Based on what I did to your moms last night.",
            "review_score": "1"
        },
        {
            "review_text": "Its OK.",
            "review_score": "1"
        },
        {
            "review_text": "Just so funny to play in VR",
            "review_score": "1"
        },
        {
            "review_text": "Process of elimination.",
            "review_score": "1"
        },
        {
            "review_text": "I looked I hoped now I have this game  This is not what i hoped for but i looked so i passed on this curse std what ever you want to call it to like 3 people they all have terminal seven now and my parents disowned me   Most best thing ever welp later",
            "review_score": "1"
        },
        {
            "review_text": "This is how i impregnate people, with guns",
            "review_score": "1"
        }
    ]
}