{
    "app_id": 363510,
    "name": "STAR-BOX: RPG Adventures in Space",
    "release_date": "2015-08-17",
    "developer": [
        "Michael Flynn"
    ],
    "publisher": [
        "FlynnFour Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 12,
    "positive_ratings": 44,
    "negative_ratings": 43,
    "price": 3.99,
    "description": "STAR-BOX – RPG Adventures in Space!Strap on your gravity boots, power up your laser, and climb aboard your spaceship for a retro-styled, RPG-jaunt into the unknown!Travel an open-world, sandbox universe where you are the architect of your own story.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/363510/header.jpg?t=1454502746",
    "minimum_requirements": "OS: Windows XP Processor: 2.0 Ghz Intel Pentium 4 Memory: 2 GB RAM Graphics: Intel 4000 Integrated, Nvidia GeForce GTX 260/460/550, or equivalent. Storage: 250 MB available space",
    "recommended_requirements": "OS: Windows XP, 7, 8 Processor: 2.4 GHz Intel Pentium 4 or equivalent Memory: 4 GB RAM Graphics: ATI Radeon 7870/R9 270 or Nvidia GeForce GTX 660 Ti/760 Storage: 250 MB available space",
    "reviews": [
        {
            "review_text": "I think this game has great potential after the minor bugs and crashes are taken care of. The premise of this RPG is very cool. I'm reminded of the early Final Fantasy games on the SNES. It took me some time to get adjusted to the controls but once I figured it out, it was pretty simple. I used WASD as well as the Up Down Left Right Arrows and the numpad. Enter Esc for buying.  I was actually quite surprised by the amount of material in this game. There were at least four stores and two I have yet to figure out. I'm guessing to craft. Anyways, I'm playing this game at my own pace, which is slow, so there is much more to explore and learn. Overall, I think this game is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "The game looked great from afar... But, so did the Atom Bomb. I've already uninstalled this once but came back when I noticed the 2016 updates, hoping things had shaped up. Not certain how a game with RPG Maker graphics and only being about 212 (ish) MB in size can be so laggy. It's certainly just, as laggy, as before. Using arrow keys in the 'closet' to change my loadout the selection bar still jumps over and around items like a sadistic game of drunken leap-frog. I'm re-uninstalling the game and noticed you have pay for DLC... So you have DLC for a game that just barely works and has nearly the same issues as when it was released. Real ♥♥♥♥ move, man. Real ♥♥♥♥ move.  I'd certainly like my money back and maybe steam will actually start taking into account the steaming bowls of ♥♥♥♥-chowder they allow on their market? But I guess I'm a dreamer...",
            "review_score": "-1"
        },
        {
            "review_text": "So, I started tutorial. Obligatory space battle after visit to space station ended with 'cannot find laser_shot' error communicate when I tried to shot, then game crashed.  Sorry, crashing error in very base aspect of the game, plus numerous spelling mistakes... I don't see 'early access' notice - is this game even finished?  Give me back my money.*goes for refund*",
            "review_score": "-1"
        },
        {
            "review_text": "*resolution is crap *can't play game because it keeps moving the character into the left upper most corner for some unknown reason *garbage",
            "review_score": "-1"
        },
        {
            "review_text": "* Controls are weird, can only see them when you press ESC and that leaves out the buttons for the grenades (which are listed on the grenade itself, to be fair). * Hard to hit 1-4 to fire lasers while using WASD, so you'll have to do arrow keys + 1-4 or use joy2key to map buttons to a controller (remember to map the arrow keys directly, do NOT map WASD instead, it won't work).",
            "review_score": "1"
        },
        {
            "review_text": "STAR-BOX: RPG Adventures in Space is a game that I can't recommend because: - the price is too much for it's quality (if it has one) - it is full of bugs - it crashes all the time - it doesn't deserve to get a cent  - it is unplayable - it has no graphical options - the only good reason to install this game is for the trading cards",
            "review_score": "-1"
        },
        {
            "review_text": "This game gives the Arial and Times New Roman fonts the recognition they deserve. Oh, and mechs.",
            "review_score": "1"
        }
    ]
}