{
    "app_id": 363790,
    "name": "Egg Returns Home",
    "release_date": "2015-05-05",
    "developer": [
        "PigelPix"
    ],
    "publisher": [
        "PigelPix"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "2D"
    ],
    "achievements": 11,
    "positive_ratings": 397,
    "negative_ratings": 107,
    "price": 0.79,
    "description": "Egg Returns Home is a simple platformer about an egg, which is trying to find his way back home. At every level egg needs to get to the teleport.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/363790/header.jpg?t=1470926744",
    "minimum_requirements": "OS: OS: Windows XP / Vista / 7 / 8 Processor: 2 GHz Memory: 256 MB RAM DirectX: Version 9.0c Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "HowToBasic the video game.",
            "review_score": "1"
        },
        {
            "review_text": "Humpty Dumpty sat on a spike Humpty Dumpty fell off a wall Humpty Dumpy hates right angles Humpty Dumpty is not a ball.  8/10 Spent 30 hours torturing myself to try to get all achievements (I WILL DO IT!!!!)  'Egg Returns Home? Not for CC' - says my bff. 'Why do you hate yourself so much?' - asked my bro But I'm totally enough a sadist to heavily recommend this to others. Especially masochists, and anyone good with egg-rolling and jumping physics =\\ Not recommended for rage quitters who hate platformers where you die over and over and over and over...",
            "review_score": "1"
        },
        {
            "review_text": "Purchased for 49 pennies during the Summer Sale. Got all achievements in 108 minutes, with the 1000 deaths being the last one. Fun times, pretty rewarding except that hard mode is (almost?) identical to casual mode. It's true that there's a bit of luck involved, but knowing how to quickly capitalize on those fortunate moments is what separates the salty from the successful. I recommend it to everybody, and if you don't like it, it's probably your own fault.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible controls. Terrible hitboxes. Amazing dialogue. ♥♥♥♥ing 100% completed the game in 1.6h. 10/10. Would recomend. Worth every cent. Had an eggcellent time.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun and plays as expected. The one thing that threw me off is you can't just roll you have to hop left or right to create momentum, it is fun when you start going fast, you do get cracked when falling too far but much farther than in real life, and I have yet to break from falling. If it's on sale, and you like rolling eggs, then buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Egg has become my patronus.  P.S. I hate spikes. T_T ",
            "review_score": "1"
        },
        {
            "review_text": "Litterally can't complain about anything.",
            "review_score": "1"
        },
        {
            "review_text": "I played for 58mins and beat the game.... that being said the game was short. The controls need some time getting used to; momentum and timing are EVERYTHING in this game. Most of the levels were the same obstacles, just got harder and more frequent as you progressed. Definitely a game you wait to go on sale (which is why I bought it).  On the brighter side, once you learn the game its really fun and simple....3 buttons. People get annoyed about how frustrating it is, (and it is) and how much you die (and you do). Once I beat a few levels and got stuck, I would TURN IT OFF and beat it first try the next day. Just a great senseless game to waste literally an hour with.  7.5/10  -cheap -fun -simple -addicting but easily turned off -would recommend if on sale",
            "review_score": "1"
        },
        {
            "review_text": "The best main character I've ever seen, totally recommend",
            "review_score": "1"
        },
        {
            "review_text": "Lets go ahead and get the negatives out of the way: This is very difficult to control, the jumping noise can get a bit repetative, and sometimes the hitboxes feel a bit too big. However, I assume the control issues were intentional. You are playing as an egg, and if you have ever tried to make an egg roll in a way you want it to, you should know that this is a nearly impossible task. The levels are simple, but frankly if they weren't this game would be getting a bad review. It may be challenging, but it isn't impossible. Nothing that you have to do is more precise than you can manage. As far as plot goes, it couldn't me more simple. You are an egg, you want to return home. Also there's some guy who wants you dead or something.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Stanley Parable, CSGO, and Skyrim combined. Best 51 cents I've ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "This game has the worst controls ever seen. If you got it, farm for the cards then gift them to me so I can dump them in a pile, pour gasoline over it and watch it go up in flames.",
            "review_score": "1"
        },
        {
            "review_text": " It's stupid game and i like it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "for $0.39 this game 10 out of 10 would buy again. Gifted it to meh friend is was so!",
            "review_score": "1"
        },
        {
            "review_text": "I now refuse to eat an egg unless it has a moustache. That way if someone asks where my curly moustache is at, I just open my fridge.    9001 / 1337.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good simple game! I like it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly impossible to play! There are only 3 controls that you can use (jump forwards and backwards and a button that allows you to jump slightly higher) but the game requires you to move in very specific ways that are almost impossible to achieve! I can't really recommend this to anyone, unless you're into poorly designed and frustrating games.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is fun but it too hard for me but it good, (so hard)",
            "review_score": "-1"
        },
        {
            "review_text": "A Platformer should be difficult because of well crafted situations, not difficult controls. This isn't worth the time for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Pick it up for 90% off for cards? Worth it.  Otherwise nope.  Edit: Oh boy there was an update to the game!  I'd modify the above review but adding a couple of achievements did not make this game any better.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is frusturating and lacks controll, boring and random",
            "review_score": "-1"
        },
        {
            "review_text": "Definatly not reccomended. It seems like a cute little platformer at first but less than a minute into the game and you figure out that the controlls are sub-par especially when the egg just straight up stops moving and just hops up and down in one place. I'm not one to give up on games but I can tell that this one is not worth it even for how cheap it is.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥",
            "review_score": "-1"
        }
    ]
}