{
    "app_id": 363960,
    "name": "Devils & Demons",
    "release_date": "2015-10-06",
    "developer": [
        "HandyGames"
    ],
    "publisher": [
        "HandyGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Hex Grid"
    ],
    "achievements": 28,
    "positive_ratings": 27,
    "negative_ratings": 49,
    "price": 6.99,
    "description": "In a magic age, where dragons ruled and the world of Desola was at the height of its glory, a demonic portal opened its infernal abyss in the shadowlands. The realm was ravaged by Devils &amp; Demons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/363960/header.jpg?t=1533635450",
    "minimum_requirements": "OS: Win7 or newer Processor: 2.0 GHz Memory: 512 MB RAM Graphics: DirectX 9.0c compatible DirectX: Version 9.0c Storage: 1 GB available space Sound Card: OpenAL-compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I picked it up cheap as part of a bundle. It has nice graphics and intuitive gameplay, but altogether it's pretty uncompelling. You start as some person who has to fight a demon, and then you get more people who also have to fight demons. Fighting the demons is pretty boring. So I stopped playing.  Everything just goes kinda slowly as well - it loads each turn, all the moves happen slowly, etc...",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't find it very enjoyable. Not much more to say than that. I enjoy turn-based combat, but this just wasn't for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm pretty positive I got this game in a bundle, lately I've been going through my 400+ Steam list of games carefuly playing all of them and rating them, that eventually lead me to stumble upon Devils and Demons.  My first impression when I played it was 'oh it's a nice little game', it isn't heavy on the computer, disk size or performance wise so pretty much everyone can run it and the mechanics are simple and entertaining, a nice little game, but that's all I have to say in it's favor to be honest.  It's clearly a pay to win microtransaction model of a cellphone game port, not the best one at it to be honest, but it's mildly entertaining, what is NOT entertaining is how terribly it was ported and the price they set it at, I was going to recommend it to a few friends of mine on Discord, thinking it was 2~3$, but after checking it's cost I found out it was priced at 10$, I was shocked, this game is nowhere near being worth the price tag it was set at, at most you want to grab it from a bundle and not just consider it a +1 trash game, it's worth giving a shot and playing it for a bit to see if it floats your boat, at least for a couple of hours, but I wouldn't recommend shopping for it unless it was on sales.  It's pretty much a turn based strategy game in which you have action points to move or perform spells in a hex grid map, but the music is average at best for this type of game and the animations are subpar, especially for it's price tag, STILL, it's a fun little game that can keep you entertaining for a couple of hours maybe, if you're lucky enough to get it from a bundle or a huge (75%+) discount.",
            "review_score": "-1"
        }
    ]
}