{
    "app_id": 363930,
    "name": "Dead Age",
    "release_date": "2016-11-04",
    "developer": [
        "Silent Dreams"
    ],
    "publisher": [
        "Headup"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Zombies",
        "RPG",
        "Survival"
    ],
    "achievements": 77,
    "positive_ratings": 2889,
    "negative_ratings": 595,
    "price": 10.99,
    "description": "Survive the zombie apocalypse with a “Final Fantasy” turn-based combat and permanent death! Manage survivors, craft materials, and make difficult decisions. Defend your camp against hordes of the undead to prevail in this non-linear rogue-lite (comparable to FTL). Innovative Indie Survival-RPG!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/363930/header.jpg?t=1548169003",
    "minimum_requirements": "OS: Windows 7, Windows 8 (8.1), Windows 10 Processor: Intel Core2 Duo 3.00 GHz / AMD CPU 3 GHZ Memory: 3 GB RAM Graphics: Nvidia GPU GeForce GTX 660 / ATI Radeon HD 3600 Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7, Windows 8 (8.1), Windows 10 Processor: Intel CPU Core i7 2.5 GHz / AMD CPU 3,5 GHz Memory: 4 GB RAM Graphics: Nvidia GPU GeForce GTX 770 / ATI GPU Radeon R9 290 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Not many zombie RPGs out there. This one is entertaining and worth the $15",
            "review_score": "1"
        },
        {
            "review_text": "One of the best survival game I have play. The fact that your progress help in the future walktrhough make this game replay interresting without starting from strach. Good work! ",
            "review_score": "1"
        },
        {
            "review_text": "Ok, so this is actually a very basic zombie survival game: find teammates, foods, kill zombie, escape. what make this game a good game from others, is one thing, difficuties. not too hard but just one mistake, then you can watch your team collapse day after day, experience the feeling: hopeless.  very simple game, but it sure can give you a touch of the end of the world",
            "review_score": "1"
        },
        {
            "review_text": "  Its a good game, i play it almost 3 days now and still like it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun and random twists good game so far im enjoying it",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable so far just got the radio working so will have to complete more togive a full review.",
            "review_score": "1"
        },
        {
            "review_text": "worth playing multiple times.",
            "review_score": "1"
        },
        {
            "review_text": "Great Rogue lite with old school final fantasy feels but with the undead and raiders. Looking forward to more polishing though and some more story line.",
            "review_score": "1"
        },
        {
            "review_text": "So far I am at Day 12 and enjoying what they have had to offer i look forward to seeing how much better they can make this game",
            "review_score": "1"
        },
        {
            "review_text": "Wasn't sure about this game but I'm addicted and LOVE it!!! I love to replay games and this one has a different story every time. At least so far! You will not regreat this purchase!",
            "review_score": "1"
        },
        {
            "review_text": "Played for several hours now and game is a fun twist on the normal zombie genre.  Pros:  RPG style  Mechanics work quite well   Cons   Could do with a bit more variety in early game hand weapons, splitting hairs really.  Recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this",
            "review_score": "1"
        },
        {
            "review_text": "good game so far tho hope it's not a short game, would prefer if it was like a see how long you can last until you die.",
            "review_score": "1"
        },
        {
            "review_text": "I love Trish, can't romance her tho...",
            "review_score": "1"
        },
        {
            "review_text": "I was unsure of this game at first,but after playing an hour or so I've found a diamond in the rough.Is it AAA of course not but It's a good sold game,great job devs keep up the good work.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't even occur to me to stop playing 5 minutes in. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, quests are too long and difficult for beginner-style quests. Loot is too random, not enough loot in the more difficult places. Everything costs food or tools so it is difficult to balance missions with upkeep of camp.",
            "review_score": "1"
        },
        {
            "review_text": "My only complaint so far isn't really even much of a complaint. I was under the impression that I could customize the protagonist - gender particularly, but other parts as well.  Dead Age doesn't revolutionize anything in the RPG, survival, or roguelike (or lite, as it happens) genres. It's fun and pretty much everything it says on the tin. Nothing shocking or new as of yet, but I'm still playing through it so we'll see. It's not overly challenging or particularly easy.  I'd give it a solid 7/10, maybe a 6.5 if I were in a bad mood.",
            "review_score": "1"
        },
        {
            "review_text": "As a zombie nurse, I can only recommend this game because it has zombie nurses in it. Don't believe me? Here's your proof:          YouTube™ Video:  The (short) adventures of Zombie Nurse&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  7/10   I know its indie, but its need some more balance and change same things in the game.  -Game push you always for anything...some to much. -You need always to have your mainchar to send group outside of camp -Why the Tools get used for Hunting?? I can understand it for crafting...but hunting? -Global Achivment say thats only 0.01% people had craft 3 items. So here is a big problem... -Why punks attack and steal stuff even 'Punk Dangerous 0%'   If you can get this game for good price just grap it.",
            "review_score": "1"
        },
        {
            "review_text": "Suggestions: -There should be maybe 5 safehouses in the game - each one is reached by exploring a path of the 5 paths available from your current safehouse. 25 paths in total (Feel free re-use backgrounds and environments for now.) -The shop was not useful at all - the only thing I wanted was a weapons upgrade that cost 24 materials, and I ended up finding only 1 before finishing the game. And it hardly made a difference by that time. Consider lowering the prices and have it restock at random instead - then I'd visit it more often! - I got a character to Level 10 in some stat, but he'd still mess up a little too often. Perhaps change the probability of success to 95%? - The deadlines in the game are too rigid. I want to be able to undertake every side-quest in the game before the time runs out, but in reality I might have to cheat to do so! - The game ended too abruptly - is this so you can make a sequel, or is it because I bought the game early? - Rare materials are way too rare. I just finished the game with only 1 guy fully equipped in basic clothing! I tried crafting medium stuff near the ending, but encountered a ridiculous rule preventing me from crafting more than 2 items at a time. I never got a single high-end piece of gear (Save for the AK-47 type 1, not type 2).  Thank yous: The latest additions to the game, the random discoveries of new houses, churches and dark pits, really lifted the game and speaks to the explorer inside of me. Please add as many as these events as you can get photos for :D ",
            "review_score": "1"
        },
        {
            "review_text": "Fun casual game, and Linux support. A win all around.",
            "review_score": "1"
        },
        {
            "review_text": "Preety basic game, but really good value for the buck.... Combat reminds of final fantasy 7....",
            "review_score": "1"
        },
        {
            "review_text": "I feel compelled to review this game as it was an instant-purchase and a subsequent let down for me. Firstly, I can see what the developers tried to do here, but imo they failed to produce a game thats fun to play for more than an hour. We want realism but we don't wan't constant frustration when it comes to difficulty, game UI and strange development choices - This is more of a resource management, strategy game, not an rpg, so why give us a main character who must survive or else - Game over! That's lame, especially considering we have no reason to care any more about him than the other survivors.   When it comes to the games difficulty, it suffers in the same way most similar games do, difficulty - building difficulty as the game progressed would actually give us a chance to learn how to play which would be far more preferable to just being dropped in the deep end, experiencing frustration and then dying. As a result of this, I have no motivation or desire to attempt the game again.  Sadly I have yet to find a post-apocalyptic survival game that is truly fun to play. (Not including zombie games of different styles/genres such as Telltales The Walking Dead, The Last of Us and Left 4 Dead - Zombie games done right in their own respective genres). In this genre, this is far from one of the better attempts I've seen which is sad because, for a game idea, this has practically unlimited potential but that is sadly missed once again with 'Dead Age'; Monotonous scavenging, pointless, reptitive zombie killing. I am a huge fan of the zombie genre when its done right, but this is not the case here. Refund requested.  TLDR - Another clone of a not-so-well thought out and repetive zombie survival / resource management genre. Not very fun to play and sporting a combat system that just doesn't suit the genre (Zombies healing each other - wtf?). There are much better similar games already on steam. The dialogue feels tacked on and we have a main character who we don't care about at all but must keep alive unless we want to start over.  Overall 5 / 10",
            "review_score": "-1"
        },
        {
            "review_text": "The only thing this game is trying to do 'differently' and i use the term very loosely, is to inject a bland and VERY repetitive FF-style fighting system that does literally nothing to elevate the game above the tons of shovelware zombiegames out there.  If you take out the worst parts of this game (the fighting system and horrendous balancing issues) then it's just a bad clone of other games that do the same things and more, but better. (and cheaper, i might add)  After fighting the same predictable lineup of the exact same monsters 20 times in a row, i can honestly say i regret installing this tripe.  Ui is horrible, sound is just awful, animations terrible, gameplay is.. Better found elsewhere.  How this game can get a 'very positive' review score is beyond me, all of these reviewers must have missed the other games that this one is failing to imitate.   i give it a 2/10 , you will literally have more fun playing papertoss with your money.",
            "review_score": "-1"
        },
        {
            "review_text": "While the base-management and resource-management aspects are interesting, the game is fundamentally too grindy and resource drops/losses too RNG based. Characters are introduced well enough but end up playing generically, accomplishing anything involves killing the same reskinned zombie enemies in each area en masse, and the animations are initially appealing but after an hour feel agonizingly slow.",
            "review_score": "-1"
        },
        {
            "review_text": "Dead Age is another of a countless stream of Zombie Apocalypse games, and the devs seemed to have stripped away some of the most fun and exciting things that the best Zombie Apocalypse games have, and that I loved about them. From DayZ Mod and on, the thrill of searching through offices, homes and even dead zombies, you always knew you had the chance to run across something cool. You always had a chance to find a cool backpack, or ammo for your winchester, or even the gun itself. Searching the military tents or runways always had a chance to land you an AK, night vision goggles or other various military gear.   Dead Age strips away that excitement, and give you the chance to get materials, so tiy cab craft lame gear. So you have a chance to find lame crap, all so you can craft ever so slightly less lame crap. I think the devs really missed the mark on what made Zombie Apocalypse games so fun, and I am not saying they are alone, as I believe MOST of this genre's devs have sorely missed the mark. In the end this game is another in a long list of games that is ok, but I don't believe you should spend your money on it.   This game is clunky, requiring mouse clicks for everything, and is basically a point and click adventure, with most of the adventure done through reading, and no voice over. If it had a voice-over for the main character story bits, I could see this game being worth $15, but as it is, it isn't worth more than $5. Seriouisly save your money, I am refunding this in favor of something that doesn't bore me so quickly.",
            "review_score": "-1"
        },
        {
            "review_text": "I may modify my opinion later, if I can bring myself to give this game another shot.   My problems with this game are entirely subjective, full disclosure. It seems to run appropriately (though you can't change graphics settings from within the game) and appears to be a functional rpg.  No, my problems with the game are that it's not serious enough in tone, there's no characer customization, and I personally think the art is ugly/mediocre. I was under the impression that this would be a gritty, rough survival-rpg, and yet monsters have slapstick move names like 'dishonorable discharge' when the zombie in question isn't even a soldier. The story makes an attempt at seriousness, but I can't care about the protagonist right off the bat just because I'm playing as him. Which brings me to my second problem; 'Jack', I'll call him, is who you are off the bat. If there wasn't going to be any way to customize his appearance, why let the player rename him? Why not develop and build him as his own character? And you have to start off the game with him being referred to as a 'student' as far as job title, but seriously, dude looks like a war vet. Which comes to my third problem; Jack is... well, generic at best. Character design is bland and unmemorable, for all characters encountered by the 20 minute mark. And maybe it's just me, and I know this is harsh, but these peoples' faces are...kinda wonky and uneven. The thick, black lines only seem to be on some characters' profile pictures and while it may be that the artist was perhaps going for a comic book look, the characters look flat and dull. I'd dare say that Darkest Dungeon wore it better.  Honestly, if even one of those elements were different, I'd be willing to forgive it, but as it stands, I wish I'd bought through steam instead of the humble store so I could request a refund. Perhaps I'll come back if it gets modding support so I can add in different 2d art.   tl;dr: if you're not bothered by its aesthetics and care more about gameplay than story, knock yourself out, but it's just not for me because I'm a snob.",
            "review_score": "-1"
        },
        {
            "review_text": "moderately gay flash game.  I gave it a fair go, but couldn't find significant redeeming qualities.  It's like those penny arcade adventure games, only without the wit and humor",
            "review_score": "-1"
        }
    ]
}