{
    "app_id": 363920,
    "name": "SWR JST DX Selective Memory Erase Effect",
    "release_date": "2015-04-20",
    "developer": [
        "Nekomura Games"
    ],
    "publisher": [
        "Nekomura Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 0,
    "positive_ratings": 16,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "An atmospheric platformer where players fight weird monsters that keep on claiming they're part of an operating system.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/363920/header.jpg?t=1458020473",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Memory: 512 MB RAM Storage: 25 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Getting a 'Twin Peaks' meets 'Ghost in the Shell' vibe  You play real cute ♥♥♥♥♥ cat with one hell of a double jump. Throwing daggers at dog wizards is as fun as it sounds. Looking foward to more.  'weird &amp; hard' /i/that's what she said//i/ ",
            "review_score": "1"
        },
        {
            "review_text": "A fun old-style platformer with wonderful visuals and soundtrack that really capture the dreamlike feel the dev was going for.  Overall the difficulty hits the sweet spot of not being too easy or too hard. There's a short minecart section you're pretty much guaranteed to lose quite a few lives on, but beyond that there's nothing rage-incuding.  While the dialogue is a bit rough (at one point they spell crisis 'crysis', like the video game), the actual story being told is pretty cool and well worth not letting some grammar and sentence flow errors ruin it for you.  If you didn't see on the store page, be aware that the game has no save function. It takes just shy of two hours to beat, so make sure you set the time aside to clear it in one go.",
            "review_score": "1"
        }
    ]
}