{
    "app_id": 364250,
    "name": "XIIZEAL",
    "release_date": "2015-06-05",
    "developer": [
        "TRIANGLE SERVICE"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Arcade"
    ],
    "achievements": 12,
    "positive_ratings": 27,
    "negative_ratings": 4,
    "price": 8.99,
    "description": "Enjoy a fast and frantic arcade shmup from Triangle Service! Attack in all directions and rack up the multipliers - do you have XIIZEAL?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/364250/header.jpg?t=1498143730",
    "minimum_requirements": "OS: Windows Vista/7/8 Processor: Multicore CPU (Core i or Better) Memory: 512 MB RAM Graphics: GeForce 300 or Better DirectX: Version 9.0c Storage: 50 MB available space Sound Card: DirectSound-compatible",
    "recommended_requirements": "Memory: 1 GB RAM",
    "reviews": [
        {
            "review_text": "Over the years we've grown accustomed to hanging out near the bottom or the far left of the screen. Why? To dodge the 100s of 1000s of 10000000s of bullets that accost us. Naturally, numerous scoring systems all but demand that we get closer to the top (or the right side) of the screen. Still, for the most part it's easier to just stay as far away as danger as possible, and give those bullet-spreads room to...well...spread.  XIIZEAL is an oddity in many ways. First off, the level of difficulty fluctuates greatly. Normally we go through X number of stages, each one offering a steady increase in challenge over the last. Here? The first two stages are a cakewalk, the third is a sudden jump, and then the other stages are like hills and valleys (as opposed to one tall mountain). To balance this out, there are only three lives (no extends or hidden 1ups). To balance out the lack of lives, the bombs are exceptionally useful. Not only are they plentiful and offer a good bit of invulnerability, but with proper placement, they can absorb enemy bullets and you'll collect gobs of points.  Then of course there's the side-attack. The forward cannons are actually rather weak, and the enemy spawns as well as bullet-patterns don't really benefit those who just want to hang way in the back. Your best method of offense is always getting next to an enemy and 'wiggling' them into oblivion. The side-attack also massively affects your score (up to a 12x bonus). Throughout the game it is repeatedly drilled into your head that you must use the side-attack, as well as the upper 2/3rds of the screen. It's a shame performing the side-attack will turn your wrists, keyboard, d-pad, and/or joystick to butter. Thankfully the weapon can also be used by holding down a button. There's no need to perform more motions than a fighting game tournament just to complete a stage.  The bosses are a bit more traditional. They're large, take a little bit of punishment, and will throw a great many bullets on the screen. However, they can be easily defeated if you have a nice stack of bombs. Throw a bomb, mash the side-attack, repeat. Hell, for the most part you likely won't have to repeat much, because the bosses can be destroyed very quickly. However, in the interest of scoring, you'll probably want to use those spare bombs to milk the boss for awhile.   In a lot of ways, XIIZEAL was designed to be the antithesis to what we take for granted in a shmup. After awhile all these bullet-hell/danmaku titles start to blend together, and it makes the genre seem a bit stale. Triangle Service opted to create something different, and in that regard they succeeded. However, these ideas, while intriguing, might not be palatable for most 2D-shooter fans. Other concept-driven games (like Ikaruga) have a high level of depth to them. Each stage is very different from one another, and problems can have multiple solutions, or players develop slightly different tactics. With this game it's like a concept still in the early stages of development. There's the side-attack, knowing when to throw out a bomb, and that's about the extent of it. On the other hand, XIIZEAL isn't nearly as demanding (I forgot how many times I replayed the first stage in Ikaruga just to get a piddly A rank), and there's still enough of an incentive to keep playing for score.   I believe this is a worthwhile entry in the genre. The concept doesn't get quite the exploration it deserves, but there's enough merit in replaying stages to capture that hi-score. Mechanically it's a solid little game, and offers some interesting ideas. There is also a certain (masochistic?) satisfaction in mashing the stick to perform the side-attack. I suppose this dates back to the time when gamers actually had to press the button repeatedly if they wanted rapid-fire. Back when I played Darius Gaiden on the Saturn, I mapped the fire button to A &amp; C, and would get a higher rate of fire by alternating between the two. Part 2D shooter, part track &amp; field videogame? Okay now I'm just rambling.",
            "review_score": "1"
        },
        {
            "review_text": "Twelve! twelve! twelve! tw-tw-tw-twelve! tw-tw-tw-tw-tw-twelve!",
            "review_score": "1"
        }
    ]
}