{
    "app_id": 364390,
    "name": "Downfall",
    "release_date": "2016-02-15",
    "developer": [
        "Harvester Games"
    ],
    "publisher": [
        "Screen 7"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 30,
    "positive_ratings": 522,
    "negative_ratings": 37,
    "price": 7.19,
    "description": "There is nothing Joe wouldn't do for his wife. But as they try to save their marriage with a romantic getaway, things go from bad to worse, and from worse... to insanity...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/364390/header.jpg?t=1540795628",
    "minimum_requirements": "OS: Windows XP, Vista, 7 (32-bit or 64-bit OS) Processor: Quad-core Intel or AMD CPU Memory: 4 GB RAM Graphics: NVIDIA or AMD ATI video card with 1GB of RAM (Nvidia GeForce GTX 260 or higher/ATI Radeon 4890 or higher) DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX compatible sound card Additional Notes: Keyboard",
    "recommended_requirements": "OS: Windows 7, 8, 10 (64-bit OS) Processor: Intel Core i5-750, 2.67 GHz | AMD Phenom II X4 965, 3.4 GHz Memory: 8 GB RAM Graphics: NVIDIA or AMD ATI video card with 2GB of RAM (NVIDIA GTX 550 Ti 2GB/AMD Radeon HD 7870 2GB) DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX compatible sound card Additional Notes: Keyboard",
    "reviews": [
        {
            "review_text": "Very much everything you'd expect from the developer that gave us Cat Lady. Raw, gritty, without peers, hauntingly beautiful at times and a complete mind ♥♥♥♥.  This visuals are a continuation of the unique art style of the Cat Lady, along with the story the stand out element of the game. From the outset the game is manic, as early as 10 minutes in tackling issues such as the incredibly gruesome   death of a sibling  , eating disorders, break down of a marriage, control within relationships &amp; later infidelity. There are plot elements which leave you completely and utterly torn between whether or not character choices were the selfish or the selfless thing to do or more likely both. I fealt helpless, useless, no comprehension of whether I was helping or harming. True to it's name as the game progresses the plot points and character's sanity levels plummet to the point where reality is a blur, the game makes your head spin, leaves a bad taste in your mouth like a fryed belly fat / human head and 'oregano' smoothie but for all the gore it's an immensely beautiful game in it's own bizarre way akin to doing the perfect swan dive from a waterfall into a pool of blood. The scene composition is stunning, something any photographer would rightly be proud of.  For fans of the Cat Lady there are many popular returning characters and elements of the story tie directly into that game thus it's hard for me as a fan to not recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, before you, fanboys and vanilla girls, start taping with your fat fingers smth like YOU WRONG GTFO ITS MESTERPIECE, let me explain why my opinion here is in a red box instead of a blue one.  Downfall'09 was a great game. Despite poor visuals and unpolished plot, it was a uniqe experience I've never encountered in videogames before. It was scary, humorous, even enjoyably stupid B-movie style sometimes. Most important - this game knew what it wanted to be and never changed its' tone until the very end. Even now, after seven years, it stands as a perfect 'study in scarlet' for Harvester Games.  Unfortunately, Rem doesn't feel the same way. As a matter of fact, he called it 'kinda ♥♥♥♥' in 2015, couple of months before this remake was released.  To begin with, nobody asked for anoher Downfall. And those who did lied to themselves. Because we all waited for another Cat Lady. Everybody wanted to burst into tears once again and follow tragic characters who overcome not only disgusting villians but their own demons as well. Which brings us to the 1st major problem of the Downfall'16.  This game doesn't know what it wants to be. It manages to catch the spirit of the original, but strikes hard to push it in chains of a different narrative. The result is not only plotholes ( like    Why Ivy behave like she never met Robbie? Why they never discussed this tragedy? Why Queen of Maggots asked Agnes to blow off the candle, if the girl wasn't even real? Why this crasy old b1tch imprisoned Ivy in the first place?   ). Somehow it also affects visuals. I mean, art style is great for the most part, but it often doesn't work as it supposed to.   The most obvious example of this is the kitchen. Remember how gory it felt when you first encountered this room in 2009? With all this meat and dirt all around the place? The same kitchen in remake feels like a pale copy - less detailed and monochrome with slightly red. Cooking scene also lost its charm. The most stupid and terrifying sequence of '09 somehow became less entertaining and even boring in '16.   Black and white imagery, btw, is overused to death here. Original game was more competent about it - there were only few monochrome scenes, and it worked much more effectively. But here almost everything is monochrome, and it kills the mood completely. Main thing about Downfall'09 that I enjoyed a lot was black humour involving cannibalism and murder. And this kind of fun only works in full colour grindhouse-style. But no, only black and white. Mb red sometimes, but not much. We've got some serious story here.  And this brings us to the main problem of this remake. It tries so hard to make deep narrative using methods of 'The Cat Lady' that it forgets about characters. During the whole game I didn't give a ♥♥♥♥ about Joe Davis, his wife or any other character in this game. Nobody talks like real human. Nobody feels here like real human, except Agnes,  ironicly . Achieving all 3 endings, I don't feel like I know these people. Who the ♥♥♥♥ is Joe Davis? Where does he work? What's his favourite dish? What he's afraid of the most? Poor voiceacting doesn't help at all. Sorry, Jessie, sorry, Chisaleya - you need a lot of practice.  Of course, you can tell that original Downfall also had poorly written characters. But this game wasn't about characters, you know. It was all about massacre, death, cannibalism, demons and subconsiousness that plays tricks with your mind. And you're just some guy with the gun and chainsaw called Joe Davis, who wants to make these things right. It was brutal, simple and rather satisfying game that didn't need any kind of remake.  Anyway, this game is also here in this bundle. So if you want to experience both of them and compare - spend your money. I do feel disappointed, but I don't feel decieved. Nobody does it to you like Harvester games after all.",
            "review_score": "-1"
        },
        {
            "review_text": "  Downfall: ~~~~~~~~    Joe and Ivy Davis have been married for several years but their marriage has not been smooth sailing for a while. Ivy has not been herself lately as bad memories from the past keep haunting her. Joe organized a small vacation at the “Quiet Haven Hotel” in an attempt to work out their marriage. As they arrive at the “Quiet Haven Hotel”, they are welcomed by an incredible storm and heavy rain. Could this be an omen for what is to come?    Downfall is a point and click/rich story/adventure game where you play the character of Joe Davis.  First you will play a prologue (tutorial) where you will learn how to interact with other characters and as well as how use items from your inventory. In the prologue, you will be told how Joe and Ivy met for the first time when they were but spring chickens. It will also outlay Ivy’s prime concern at this particular time of her life, and what happened to Robbie, Joe’s little brother.  Then you will get a short, effective intro which will give you the feel of how the atmosphere will be portrayed in the game. As you enter the lobby of the hotel, Ivy will act in very strange ways, speaking in an incoherent manner and then back to normal several times. After speaking with manager, Joe will move up to their room and head off to bed. After a while dreaming, he wakes up in the room alone. From here, Joe will need to find out where his troubled wife is.   Throughout this dark adventure, Joe will meet interesting characters to talk to in hope of saving Ivy. There is Doctor Z, who conducts brain transplants; Agnes, who does not know Joe but will party with him; as well as other intriguing personalities. Most of the story will be in the hotel, but Joe will also visit places on the outside, keeping you alert and entertained.   Downfall look goods graphically with its peculiar atmosphere. All the mechanisms are easy to control with your keyboard. The highest resolution you can play this game is 800X600. The voiceover could have been better.   Positives: ~~~~~~~~~~  - Good &amp; Interesting Story - Easy interface to use - Good graphics and atmosphere - Achievements &amp; trading cards  Negatives: ~~~~~~~~~~   - Puzzles could have been harder - Highest resolution is 800X600 - Voiceover could have better  If you enjoy a rich story with a freaky atmosphere and strange characters, then downfall should be in your game library.  7/10  Key provided by developer/publisher for review purposes. Any opinions expressed are entirely my own!    EPIC “THE CPT FROGGY” REVIEWS UP NOW ON ZEEPOND, THE HOME OF THE ALMIGHTY FROG!   [www.zeepond.com]     FOLLOW THE CPT FROGGY CURATOR PAGE HERE   ",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful vile art. Take it, let your pleasure be bloody and grotesque. Must have ffo The Cat Lady and Harvester. I think it takes some guts to create such unique game, Remi Michalski can be proud of himself.  Includes original Downfall game from 2009, you can choose which version you want to run in Steam launcher.",
            "review_score": "1"
        },
        {
            "review_text": "Another great game by Harverster. Probably one of the best psychological horrors I have played. Great addition to the Cat Lady. If you love weird, gory, and ♥♥♥♥ed up games, this is definitely one for you.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! It's a very apt remake of the freeware original, and while it doesn't really capture the Cat Lady's spirited angst it's definitely a worthwhile adventure. [Will expand upon this at a later date.] [Never did expand this.]",
            "review_score": "1"
        },
        {
            "review_text": "This game was great! I played the original Downfall a while back and now seeing the remastered version of it is amazing. This game has a unique plot and characters, and it always kept me on the edge of my seat. I really like how the choices one makes affects the game's outcome. I played through it multiple times and finally got all possible outcomes and achievements. The music and art used in the game was amazing, and well-placed for each scene. Without a doubt I say it's one of the best dark, psychological horror games I've ever played. It only comes second to The Cat Lady. I'd like to say 'well done' to everyone who had a hand in making this game, and I hope to see more from you in the future!",
            "review_score": "1"
        },
        {
            "review_text": "Downfall is not a game about death or about love, it is simply a game about life - and all its horrors and wonders. Notably different from the original, and still true to it, cleverly related to The Cat Lady, this graphic adventure offers moments or pure happiness (because of the writing, the music, the art and a smooth, fluid but not superficial gameplay) and lots of violence and gore. Always motivated. I'll recommend it also to non gamers, because the language it speaks is universal. Just give it a chance (and play The Cat Lady first, if you already haven't).",
            "review_score": "1"
        },
        {
            "review_text": "Another masterpeice; a must play. If you loved the Cat Lady, then you will LOVE this. However, I still wish they would switch engines and have a resolution section instead of me streaching the screen with my graphic settings but if thats the only problem, then thats a good sign.",
            "review_score": "1"
        },
        {
            "review_text": "   Review written on Monday, Jun 27th, 2016",
            "review_score": "1"
        },
        {
            "review_text": "Downfall can be enjoyed as a remake/retelling of the original 2009 version, as a sequel to The Cat Lady or as a stand-alone game. There are nods and allusions to both the original and TCL, but you honestly don’t have to be familiar with either one to play this game. All the background information you need is given in the prologue; heck, you don’t even get this much in the original Downfall—it simply begins with a husband and wife seeking shelter from the storm in a hotel in the country.  If you’ve played The Cat Lady, you know what to expect in terms of graphics, sounds and gameplay. The game’s color palette is almost exclusively black, white and red. There’s voice acting! (More on that later.) The interface is simple and easy-to-use with the names of objects you can interact with appearing on the screen whenever you walk passed them. I’m not in the best position to judge the difficulty of the puzzles, having played the original Downfall in which many of the puzzles are the same, but I think they are easy, with clues that more-or-less tell you what to do whenever the solution isn’t obvious. I’d say the difficulty level is lower than TCL. Probably the designer wants players to enjoy the story that unfolds rather than getting stuck and spending a lot of time wandering around the hotel in search of what to do next. I would have enjoyed some more challenging puzzles though; it’s a bit like one of those games where puzzles seem designed to keep you from getting ahead of yourself (e.g. you can’t get through this door until you find object X which is in the room where you meet Mary and that is because we want you to talk to Mary first). In addition to the inventory based puzzles, you lead your character, Joe, through some conversations and places where he has to make choices. These can affect the ending of the game.  I’d give the voice acting an 8.5/10. For the most part I really liked it (I especially liked the voice of Joe, the protagonist), but there are some places where the voice actors make an odd choice on which word to emphasize (this is a pet peeve of mine); also Joe often speaks lines softly where it seems natural that he would raise his voice.  OK, I am a big fan of Downfall 2009 so I’m really aching to discuss my feelings about the differences between the remake and the original (And, hey, it’s included in the bundle so you can play both of them). Some minor spoilers ahead… * Some background regarding Joe’s childhood that we don’t get until the very end of DF2009 is expanded and moved to the prologue here—I thought this announced right away that this was going to be a new take on the story. * I like how the Queen of Maggots is changed so her nature is more consistent with what we learn in TCL. * I prefer the twist ending in the remake to the one in the original. It fits better tonally with the rest of the game and it is set up more, so it doesn’t seem to come out of nowhere. * Joe and Ivy’s relationship is developed more here and its changed some from DF2009. I suppose it’s handled more maturely, it’s a more cohesive story and Ivy’s problems are more relatable. That said, I miss the flashback with Lucifer in the bathroom. I also miss the psychotic episode Ivy seems to be having when they first arrive at the hotel in DF2009 (screaming, seeing things). In DF2009 it’s implied, at least at first, that this is a source of their relationship issues, but the problems they face in the remake are, I guess, more in keeping with the game’s theme. * I really miss Joe’s descent into madness and (at least potentially) evil in DF2009. I remember loving the dark choices he needs to make throughout the game. Here his interactions with Sophie are less intense. In the original he says at one point that she deserves a more painful death(!), and I really miss the extra ingredient you have to add to the smoothie recipe. Maybe this is just me, second time through DF2009 I decided to play Joe as a total a-hole. * In addition to thinking the developer might have a swung a bit too far in the opposite direction when it comes to the puzzles (eliminating some, giving the player big hints for others), I actually miss the chase scenes in DF2009. They added a level of fear and exhilaration.  So that’s my 2 cents. I would definitely recommend this game for its story, graphics and atmosphere and the multiple endings lend it replay value. My one criticism is that, partly because of the lack of difficult puzzles, the game is on the short side. It took me about 4 hours to complete it.",
            "review_score": "1"
        },
        {
            "review_text": "Love love love it! &lt;3 More suspense than The Cat lady I think and less slow walking around. Feels like more of a hole story in a way too.",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece directed by R. Michalski, about Joe Davis, a man traumatized by his past.  Blinded by love, he looses the grip of reality.   A Point &amp; Click horror game at its finest, enhenced by soundtrack of MicAmic.  9/10  (Ps: This games contains tons of references to the game 'The Cat Lady', which is absolutely worth a shot.)",
            "review_score": "1"
        },
        {
            "review_text": "This is a crazy great game. A better love story than twilight.",
            "review_score": "1"
        },
        {
            "review_text": "This game's downfall is the horrid voice acting (with a few slight exceptions). The Cat Lady had iffy voice acting but some characters (like Mitzhi) were good. This, on the other hand, really, really drops the ball. I think the only reason I got through the game was because I knew it was made by the folks who made the Cat Lady. Unfortunately, it's just not as good (most likely due to it being a remake of an older game).   I would skip this and get The Cat Lady. The voice acting is really that bad. I'm talking 'Master of Unlocking' bad. This is why developers need to treat voice actors like essential members of the development team, in my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "If I based this review on the voice acting, it wouldn't be very good. But that aside the story is amazing and kept me interested throughout. If you give this game a chance i promise it wont disapoint!",
            "review_score": "1"
        }
    ]
}