{
    "app_id": 364640,
    "name": "FreeCell Quest",
    "release_date": "2015-10-19",
    "developer": [
        "Legend Studio"
    ],
    "publisher": [
        "Legend Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Casual",
        "Strategy"
    ],
    "achievements": 36,
    "positive_ratings": 234,
    "negative_ratings": 101,
    "price": 6.99,
    "description": "FreeCell Quest is an RPG Free Cell game. You've never played Free Cell like this before! Explore 533 cities while collecting cards, gold, levels, armor, and spells on your epic quest of card sorting! Think quickly before the cards strike and drain your precious health. A new twist on a classic game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/364640/header.jpg?t=1547492739",
    "minimum_requirements": "Минимальные: ОС: XP+ Процессор: SSE2 instruction set support. Видеокарта: DX9 (shader model 2.0) capabilities; generally everything made since 2004 should work. DirectX: Версии 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Card-based games are few and far between, at least on Linux, so I jumped at the opportunity to buy this as soon as I saw it released. I'm not disappointed!  Especially intriguing to me was the 'Quest' portion of the game's title, and for the most part, it lives up to it. Sure, it isn't on par with something like the original Puzzle Quest's transformation of Bejeweled into an RPG-lite, since it currently appears to lack any real story elements. However, it is a nice game of FeeCell, and includes RPG elements such as experience, leveling, gold, equipment, shops, spells, character classes, health and healing items, to add some more depth and purpose to playing beyond just a game of cards.  It doesn't have gamepad support natively, but the mouse-heavy controls map nicely to the Steam Controller, if you've got one of those.",
            "review_score": "1"
        },
        {
            "review_text": "First, before anything else: FreeCell Quest is not FreeCell. If you wish to play FreeCell, install the default one found in Windows (I think that they have some free versions for Linux as well).  This game is well done, I did not have crashes or any problems.  Why I do not recommend it? I did not enjoy too much the experience, because: - I expected to play FreeCell. This is not FreeCell, the game in which I was always aiming to obtain 100% success rate (I had 1 failed game every few hundred games played). This game has 2 or 3, or 6 or more suites to complete: it should be fine if it would not be time restricted. - In this game you should click like crazy. It is not the classic FreeCell where you actually have time to think, here you have to click-click-click or otherwise there will be some quite fast punishes (time limiting) and you will have to take again the 'challenge' to finish one arrangement. Funny thing, I received some punishes for not shuffling some prepared suits that I had... I had one column and I received the command to flush it. Forget it, I arranged to have that suit, I will not destroy it just because.  If you find it at reduced price, maybe you would like to try it. Personally, I am uninstalling it without finishing it, it is enough already.",
            "review_score": "-1"
        },
        {
            "review_text": "This really is rather good, it expands on the basic game of Freecell, there's a TONNE of map to cover, there seems to be loads of stuff to find/buy/unlock - but it's basically a LOT of Freecell ;0  If you don't LIKE Freecell (probably the most played computer game in history given it's inclusion in Windows from 95 thru 7!!) this won't change your mind perhaps - but it certainly adds quite a bit to the formula and it gets pretty challenging at times too!!  It's a great little time-stealer, basically - my ONLY complaint is that the music consists of just a couple of short loops which, whilst fine in themselves, might start to drive you insane after about an hour ;0",
            "review_score": "1"
        },
        {
            "review_text": "Interesting idea, to have a solitaire card game combined with RPG elements -- like loot chances, improving abilities (via experience and levelling-up) over time, increasing encounter difficulty along the way, some grinding on occasion, and a huge map. :-)  There are some things that could make my own personal enjoyment of this game even greater (like a fight timer that would allow me to check if i am still able to improve my previous best or if i am within the achievement requirements; the ability to pan the map using the arrow keys; or the option to request specific item types [i need more cards!] from shops [at a greatly increased price, i would expect]) but these are in no way preventing me from recommending the game. Enjoy it, i know i did!  PS There is one glitch (though it's quite rare, in my experience) that might be annoying if it appears late in a fight: sometimes, the card i pick up can get 'stuck' to the mouse and then it cannot be released anymore. The only work-around i know of is to just quit the fight and restart it, an action i am pretty familiar with, from when i manage to get stuck in a hopeless position... xD",
            "review_score": "1"
        },
        {
            "review_text": "I thought my addiction to freecell was over after years of playing the free version that came with XP. Well, I picked a bad decade to give up FreeCell. Addiction re-started.   FreeCell Quest is a great, fast paced (many features to speed up card movement), and many variations of card layout (depth vs width) which get more challenging the farther you 'fight' your way across the beautiful map, added with a layer of card and gear collection to open new options, powers and gear to assist your way through ever increasing and larger stacks of suits and cards. Another great game by Legend Studio.",
            "review_score": "1"
        },
        {
            "review_text": "Many solitaire games on steam are variations of golf solitaire, so I was excited about 'FreeCell Quest' because it's a different - it's a free cell solitaire. I only got 15 minutes into the game and decided it wasn't worthwhile to me. Here are my 4 issues. If changes were made to address these issues, I would defiitely give this game another try.  #1 - cards are hidden - the play screen has informational boxes describing different sections of the screen. This is great...except that you can't toggle them on/off. The box can cover up your cards so you can't see some cards.  #2 - autofill - I prefer to move my cards myself, not have the computer move cards for me. Unfortunately, this game autofills cards to the foundation throughout each game and doesn't give an option to turn this on/off.   #3 - autofill - besides my dislike of autofill, it's possible this will cause a handicap later in the game. If you're playing with all the suites, sometimes you don't want to move your cards to the foundation right away because you need to use them to move other cards around and free up other critical cards. Maybe there's a workaround; I did not play enough to findout.  #4 - can't save during game - minor point but if you need to quit in the middle of a solitaire game, there is no save. Will lose progress.",
            "review_score": "-1"
        },
        {
            "review_text": "I have not had this game for too long, but i really enjoy it. Its a fresh turn on a classic game, I really enjoy the RPG elements implemented in this game. I also enjoy the music, its a great game to pass the time, 10/10 would Recommend.",
            "review_score": "1"
        },
        {
            "review_text": "  Not bad card game with cards",
            "review_score": "1"
        }
    ]
}