{
    "app_id": 364750,
    "name": "Hacker Evolution Source Code",
    "release_date": "2015-05-11",
    "developer": [
        "exosyphen studios"
    ],
    "publisher": [
        "exosyphen studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Hacking"
    ],
    "achievements": 0,
    "positive_ratings": 13,
    "negative_ratings": 5,
    "price": 18.99,
    "description": "Ever wanted to see how the popular Hacker Evolution games were made? Here is your chance with this package which contains all 3 Hacker Evolution games and their source code.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/364750/header.jpg?t=1447372976",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: 1Ghz Memory: 1 GB RAM Graphics: OpenGL compliant video card Storage: 1 GB available space Sound Card: DirectX compliant sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I don't think John Carmack program’s like this: modulerender_directx.cpp(872): error C3861: 'strlen': identifier not found. With some tinkering, you will be able to compile and run the games, but is nothing useful to see in the source code. It's best actually to look into the Carmack source code from github and you will learn far more from him and the Doom/Quake source code. This developer didn't learned anything from Carmack, as he claims.  Added some clarifications: When I was referring to usefulness, I was referring to to code quality and the knowledge offered for the asked price (50$ was the original price). For a less chunk of money, you could support Casey Muratori (Handmade Hero) on Patreon, which provide more interesting and fun stuff. I recommend watching his channel from Youtube. Also, Shawn McGrath (Dyad, Fez) has some very interesting stuff on Patreon and Youtube. Hacker Evolution Source Code offers only some source code without any documentations or real support, and sometime with compilations errors. The main problem is that these errors should not been there or should be already fixed by an update. Also, we are talking only about some basic SDL and 2D stuff, nothing fancy. The code is written in the old C style of the '90, even if the file extension is C++. For a beginner in programing this source code package is like learning OpenGL from NeHe old tutorials (fixed pipeline with glBegin/glEnd).",
            "review_score": "-1"
        }
    ]
}