{
    "app_id": 364890,
    "name": "The Lost Battalion: All Out Warfare",
    "release_date": "2015-04-23",
    "developer": [
        "Jake Olson"
    ],
    "publisher": [
        "Impartial Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 43,
    "price": 0.79,
    "description": "A simple Side-Scrolling Shooter set in the Western Fronts of World War 1.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/364890/header.jpg?t=1455323220",
    "minimum_requirements": "最低配置: 操作系统: Windows 7 处理器: 2.2 Ghz 内存: 512 MB RAM 图形: 256 Mb Graphics 存储空间: 需要 500 MB 可用空间",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'm very sorry I've bought this utter Unity crap made probably by a severely handicapped marmoset, I really thought it might be some fun, no it's not. I lkied the art, I better be looking at it on screenshots. Totally unresponsive controls ruin even that minimum of gameplay there is, character sticks to objects, no precise posinioning etc. It should have been a kind of bullet hell but with such programming execution I don't even know how to call it - a scam? Right. Humour could be a redeeming factor here, but it just feels gross.  Очень жалею о покупке этого полнейшего ♥♥♥♥♥♥♥♥♥♥а на Единстве, по всей вероятности созданного руками сильно недоразвитой мартышки. Я правда думал, что смогу повеселиться, но нет. Мне понравился визуальный стиль - надо было любоваться снимками экрана. Совершенно неотзывчивое управление разрушает даже тот минимум игрового процесса, что тут присутствует, герой застревает на объектах, нет точности позиционирования и тд. Это должно было быть адом пуль, но с таки программным исполнением я даже не знаю как это назвать - на*балово? Точно. Юмор мог бы еще как-то вытянуть, но он и слишком груб.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage, It's a 99cent game. It's everything you won't like. If you like ww1 don't buy this. save up and get battle of empires or something.",
            "review_score": "-1"
        },
        {
            "review_text": "you cant play germans...in score 700 enemies cant kill you...but if you have cupon -50% its good",
            "review_score": "1"
        },
        {
            "review_text": "Fun and simple, but not perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Lost Battalion is a continously improving side scroller shooting game with a really nice developer behind it who is very excited about the game and receptive to new ideas and changes. The game is getting updated 2 times a day. The developer wants to add more game modes and settings to the game and has confided to me that he will not ever charge for DLC on Lost Battalion. So you will be investing in a game that will be quickly improving from one day to the next. If you are on the fence about this game or want something to be changed, I say buy the game and friend the developer and tell him what you would like to be changed like I did. It's a cool game on its way to becoming something really special. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "EDITED REVIEW AFTER 6 MONTHS:   I am changing this review because the game and the developer have both shown a lot of improvement. First let me say that the developer is human and it's not an easy job. Gamers are quick to espouse their opinions and rarely offer the same degree of politeness expected in person. It can be very hard to hear harsh criticism from strangers when you have shown the bravery to share your art with the world at large and sometimes hurt feelings can lead you to make rash decisions. In this case the developer has matured and taken the criticisms to heart. He has stopped censoring opinions and put a lot of hard work into his game. It shows and it is appreciated. I now support this developer and look forward to his future work. I would also like to apologize if I offended Jake from Statefarm at any stage of the process.   WARNING: Another developer who deletes negative criticism posts and bans users for them. Avoid this game and developer at all costs. The User CashPanda and myself have both had forum posts with negative, but constructive criticism deleted as well as being banned with the following message 'You have been permanently banned from all The Lost Battalion: All Out Warfare discussions. You were banned by a The Lost Battalion: All Out Warfare developer. Reason: 'Toxic behavior'' There is NO ROOM on Steam for developers like this.   I am having trouble recommending this game for any reason. I am a huge supporter of indie games and can usually find a redeeming idea or element of execution, but here I have no hope. The whole game is less functional and rewarding than ANY game you will find on the free flash game websites like Armor Games, etc. This game is merely a series of static screens consisting of one length scroll right, one left with endless waves of stupid enemies that come along. There is no point other than try to beat your score. As if that wasn't bad enough, it's wonky and unpredictable. Jump up and down a few times and you will randomly ending up in 'the mud' and instantly die. Walk to the right and you might end up in the mud and instantly die. It's incredibly bad at this point and while I do believe in cutting low priced games some slack, I would tell my friends to stay away even if it was free. This is a course in how NOT to develop games. This team seems to have failed to develop a concept or design document even though they have been working on this for '8 months'. I do not have any interest in being mean or hurting the feelings of this team but this type of production has no place on Steam. It is damaging to the overall quality of the platform when an aimless team sells something that an average newcomer could make himself in 5-7 days with Game Maker. Developer, please consider taking your game down from the store until you have a concept. This is in response to the only post on the forum at this time which is from you asking us from gameplay ideas. This is NOT how to make games. I wish you better luck in the future, please study our industry a bit and learn the steps to making a game that is going to be enjoyed and appreciated by others if not a commercial success.",
            "review_score": "1"
        }
    ]
}