{
    "app_id": 364970,
    "name": "CopperCube 5 Game Engine",
    "release_date": "2015-05-01",
    "developer": [
        "Ambiera e.U."
    ],
    "publisher": [
        "Ambiera e.U."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Includes level editor"
    ],
    "genres": [
        "Animation & Modeling",
        "Design & Illustration",
        "Education",
        "Software Training",
        "Utilities"
    ],
    "tags": [
        "Design & Illustration",
        "Animation & Modeling",
        "Game Development"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 15,
    "price": 55.99,
    "description": "CopperCube is a full-featured 3D game engine. No programming needed! Create 3D games, apps and even 3D websites quickly. Includes terrain editor, low poly modelling tools, 3D models, precreated game AI, effects and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/364970/header.jpg?t=1478232728",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 8.1, 10 or later Processor: Intel Celeron, Athlon Sempron or better Memory: 1 GB RAM Graphics: Direct 3D 9 compatible or better DirectX: Version 9.0c Storage: 60 MB available space",
    "recommended_requirements": "OS: Windows 7 or better Processor: Intel Core 2, Athlon 2 X2 or better Memory: 1 GB RAM Graphics: Direct 3D 9 compatible or better Storage: 120 MB available space",
    "reviews": [
        {
            "review_text": "Though I only have 2 hours 'playtime', I have used this software outside of Steam.  This Engine is  awesome  for beginning developers, The interface and workflow is enjoyably  easy to understand  and it has to, since there is  not much information  available on the interweb. (yet) The Engine itself gives you  very basic props and textures  to start with, however it's possible to  import your own models, textures,...  to make things look smoother.   Exporting  to eg. Android  goes with ease  (although you need the Java and Android sdk installed) and this is the main purpose I use Coppercube.  Do not be deceived by the 'not so cool' looking video above,  the power is within the commands you don't need to program yourself.  Coppercube is a real good tool for beginners aswel for intermediate developers. If you would like to make Android games or Apps, be sure to have Coppercube Basic on your rack, if you want to add Ads to your apps you will have to upgrade to the Pro edition to get into the Android Source code.   Do not hestitate to contact me if you would like to have more information!  Have fun!",
            "review_score": "1"
        }
    ]
}