{
    "app_id": 364930,
    "name": "Koi-Koi Japan [Hanafuda playing cards]",
    "release_date": "2015-04-27",
    "developer": [
        "Zoo Corporation"
    ],
    "publisher": [
        "Zoo Corporation"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Card Game",
        "Anime"
    ],
    "achievements": 35,
    "positive_ratings": 731,
    "negative_ratings": 51,
    "price": 6.99,
    "description": "&quot;Hanafuda&quot; is a traditional Japanese card game. Now you can enjoy &quot;Koi Koi,&quot; its most well-known variation, in a purely Japanese milieu with elegant and refined graphics. Online Multiplayer!!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/364930/header.jpg?t=1479445122",
    "minimum_requirements": "OS: Windows 7/8/8.1 Processor: 2Ghz Memory: 2 GB RAM Graphics: DirectX compatible card DirectX: Version 11 Network: Broadband Internet connection Storage: 500 MB available space Sound Card: DirectX-compatible sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game is great, but please add multiplayer!! I am sure that a community would form!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for anyone wanting to play Koi-Koi on your PC. It looks pretty, has good music, is easy to play (even without knowledge of the rules etc.) and now there's even a multiplayer! Unfortunately there are very, very few people playing so you'll have a hard time finding opponents unless friends of yours play this game too, but if you have enough patience, you'll eventually find someone to play with. All in all a very enjoyable little game - if you want to play Koi-Koi that is (obviously :D).",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "Nice. Easy to learn as well for those who just started playing. Adding the online multiplayer was the right thing to do (Y)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, especially to kill some time. Easy to learn for the most bit, but to learn all the combinations of cards is a bit of a chore. cant wait for some multiplayer, as I find computers good, but easy at times. Would love to have a cheatsheet type of menu for ease of combinations, or have an option to know what cards are needed to start the koikoi phase. 8/10 (will be 10/10 with online multiplayer!)  ",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game enough! The gameplay is solid, fast paced, and fun. The learning curve is perfect. I often open up the game and play 2 or 3 matches when I just have a few minutes free time. Zoo have put a lot of time and effort tweaking this to make it perfect, constantly upgrading the AI, the UI, the feel and speed of the game. This is a gem of a game, that has been expertly polished. No downsides, just fun especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: A game of chance and little strategy. You will experience lots of salt.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, feels just right for a quick play. For this price you get a lot of relaxing play. Only minor point is ... lady luck must be smiling, skill has almost nothing to do with this game.",
            "review_score": "1"
        },
        {
            "review_text": "A very nicely designed game that can be relaxing to play. It can be a bit confusing at first but once you have some practice it becomes very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: The recently released 2.0 update fixed almost all of the issues I had with the game. Card animations aren't awkward anymore; there is online multiplayer; you can skip the displaying of the hands name by clicking (a huge improvement!). And even the banner isn't ridiculous anymore. I have still an issue with the fixed rules and the AI, especially what seemed to be rigging for the few games I played (I have played hanafuda for over 20 years, and I have never experienced this much stacking of same month cards, let alone a case where there was 2 stacks of 3 cards at the start, with the computer opponent owning the last cards for both of them - let's call this incredibly bad luck, for the time being).  For archive purpose and show how much changed, the previous babbling is below :   This is a very, very basic hanafuda game. For a start the interface and feel of it is very amateurish. Stills are nice, but once things start go get in motion... I confess before this game, I never would have thought you could fail at animating cards moving over a board.  There is also the odd artistic choice on cards here and there, and the omnipresence of the English language, even if you set the game to Japanese. There is of course no multiplayer, because who plays with real people? Even against an automated opponent, the pacing of the game is pretty bad on fast setting, with scoring being handled by individual banners for each trick, one after the other - if you are familiar with the game, you know this can happen dozens of time in a big hand game.  Then, and this one is a deal-breaker : there is the glaring absence of any (really,  any !) rule customization. They are all hard-set, and you better be glad with them. The AI is also pretty stupid, not attempting to reverse a loss on the final month of a game, and stopping early.   You can get better, for free. And you can get infinitely better, for a small fee, on any phone or tablet.  Also, the boob-fishing on the game's Steam banner? Not awkward at all, and very classy! ",
            "review_score": "1"
        },
        {
            "review_text": "to start:  i love hanafuda decks. love the games i've been taught by friends with them.   (i've even loved drunkenly losing money as the nights turn serious, from playful koi-koi variants to cash piles, shot glasses and curses. as the hands get more and more complex, we drink more.)    so even if this game was awful, i'd still enjoy it.   but it's not awful. at all.   since i bought it on a lark, its grown to be both fun against the AI, to now a multiplayer experience. with teaching tools in the game that started as spare as the sheet of paper folded in most physical decks. they have been expanding as the game continues to be updated.   truly, if you're curious about hanafuda decks, have a less than literal mind that can enjoy the fact that cards that 'match' (gameplay / scoring wise) don't look identical (some are close, the rest are linked in natural, seasonal and cultural ways) or at the very least if you're just curious about how gorgeous hanafuda cards have always been and are, give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "i play this game to hear the bgm, haha u love japan? u should buy this game and feel the sakura",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game. Currently on sale 90% off buy the $#*7 out of it!",
            "review_score": "1"
        },
        {
            "review_text": "On the whole, this is fun, and worth the 99 cents I paid for it in the Steam winter sale. I'd go as far as to say that it would have been worth it had I paid up to $2.49 for it. The full price of $9.99, on the other hand, would've been too much. It's not THAT good.  While the AI appears to be competent with regard to deciding which cards to play, it's not as good on deciding whether to koi-koi. As a previous reviewer noted, it appears not to take the overall point standings into account at ALL, leading to spectacularly poor decisions in the final round of a match. (But then I'm not that great a player, and I like winning, so maybe I shouldn't complain about this.) A choice of AI strengths, and some options regarding rule variants, would've been nice.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended for people who likes card games.  But in this game you must remember all cards picture and the combination to win the game.",
            "review_score": "1"
        },
        {
            "review_text": "On the whole, this is fun, and worth the 99 cents I paid for it in the Steam winter sale. I'd go as far as to say that it would have been worth it had I paid up to $2.49 for it. The full price of $9.99, on the other hand, would've been too much. It's not THAT good.  While the AI appears to be competent with regard to deciding which cards to play, it's not as good on deciding whether to koi-koi. As a previous reviewer noted, it appears not to take the overall point standings into account at ALL, leading to spectacularly poor decisions in the final round of a match. (But then I'm not that great a player, and I like winning, so maybe I shouldn't complain about this.) A choice of AI strengths, and some options regarding rule variants, would've been nice.",
            "review_score": "1"
        },
        {
            "review_text": "I was a complete Newbie to 'Hanafuda' when  I first got the game.  And admittedly, at first it was all confusing,  but once you got through the tutorial and the first few games one comes to realize it actually is a lot of fun! I wouldn't say that one could spend hours playing this game in one go,  but every once in a while it's actually really nice to get back to this game to either relax or simply fight boredom without feeling like you wasted time.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to learn the basics of Hanafuda / Koi-Koi gameplay.   Card animations need improvement. I have played other Hanafuda games that incorperate full 3D on Android (for free) and ad free for 1.50$   This was was purchased on sale for 1$, and there are no other similar games on Steam to be found.   For the quality, It is not worth full price, there are better alternatives on mobile.    ",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy playing this to kill time. Hanafuda is quite fun as a card game in itself. I also like how it's not easy to win against the AIs. I lose a lot, but I can win, too. Many hanafuda games I've tried before allow you to get the best combination (Gokou) way too easily. This game's difficulty balance makes it feel more realistic. As a more objective perspective, the difficulty falls on the harder side. It is much easier to lose completely than to win for someone like me (I'm not very good at strategy games).",
            "review_score": "1"
        },
        {
            "review_text": "Most played game in my library as of now. The only cons is no multiplayer yet, although the AI gave pretty good challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect replication of the Hanafuda card game.",
            "review_score": "1"
        },
        {
            "review_text": "Frankly there are better Flash versions of Hanafuda Koi-Koi that are completely free on the web. This version is extremely basic for the £6.99 price tag.   There are very jarring animation issues - for example when cards are dealt from the stack they disappear and appear elsewhere on the board, rather than moving from the stack to the new position. This is extremely jarring even for experienced players. The same is true when you match a card, the card begins to move in one direction and then just disappears and pops up elsewhere.  There's also no way to turn off the 'hint' mode (which highlights matching cards on the board when you hover over a card in your hand). This is pretty frustrating for advanced players and will cause lazy/bad habits in new players.  Nor are there any difficulty settings, so whether you're a beginner or an expert you get the same experience.  The game only offers two modes 'Full Screen' or 'Windowed' - you cannot resize or set the resolution of either mode. The windowed mode is rather small on a large resolution display.  'Yaku', 'Koi Koi' and 'Stop' overlays cannot be skipped and take too long to display which will make each game longer than it needs to be.  The main reason I'm being so particular in this review is that for £6.99 I would expect a more polished experience. Compared to other versions of this game (on iOS, Android, Windows 8 Store or even on the web) the game is lacking in polish and I recommend getting your Hanafuda fix elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy playing hanafuda as a way to relax, but this game is moreso boring than soothing. The music is soothing though, and I would rather listen to it to relax than play.  The interface is nice and smooth. Simplistic, at best. Granted, there is no way to turn off the animations that are within the game. When you leave the window, the game ends up being at a standstill. So, if you think you can play while multitasking... It won't work. There is no option to fix this within the game settings either.  Playing in either Quickplay or Collection mode, there isn't a significant difference besides collecting postcard images in Collection mode. So there really isn't much to go on. There isn't a change of difficulty either. So you're just playing a very linear game through and through.  When playing, you are stuck with mouseover hints and, if you accidentally click on a card where there are two options.... there are no take-backs. You HAVE to play that card. There is also no way to skip in-game animations either. So sometimes the game feels a bit stretched out than it should.  As others have said, it is a very basic hanafuda game and, for the price of $10, you may as well play it as a free flash game or get a free version for your mobile device. So even if you pay for the mobile versions, those at least give you a bang for your buck. To the very least, there are some of those that have a multiplayer option.",
            "review_score": "-1"
        }
    ]
}