{
    "app_id": 365050,
    "name": "Escape",
    "release_date": "2015-04-20",
    "developer": [
        "Stephane Bottin"
    ],
    "publisher": [
        "Stephane Bottin"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 173,
    "negative_ratings": 118,
    "price": 0.0,
    "description": "Escape is a simple 2D game with 35 levels already unlocked (for the sake of gaming of course). Require jumping skills, a brain and patience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365050/header.jpg?t=1447373028",
    "minimum_requirements": "OS: Windows 2000 Processor: Intel Pentium Memory: 80 MB RAM Graphics: Intel HD 4000 DirectX: Version 5.2 Storage: 91 MB available space Sound Card: - Additional Notes: If your computer can play solitaire you're good to go.",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i7 Memory: 100 MB RAM Graphics: Nvidia GTX 750 DirectX: Version 9.0 Storage: 100 MB available space Sound Card: -",
    "reviews": [
        {
            "review_text": "It's a great game with subtle hints here and there but, i only have one problem:   Theres no music ",
            "review_score": "1"
        },
        {
            "review_text": "Escape reminds me of one of those 'unwinnable' flash platformers you see on the internet, only thing is Escape is very much winnable. I completed Escape in what feels like 20, its a short game. Really there is nothing special about this game, but there is nothing wrong with it either. The only reason I can think you might not want to play this game is perhaps if you are easily frustrated? Either way, this free platformer is neat enough for me.",
            "review_score": "1"
        },
        {
            "review_text": "could easily be a browser game.i dont see a reason for this to need downloading it's like a poor version of the impossible game or the geometry dash,at least in my opinion but that doesnt make it necessarily bad its nice 7/10 give it a try,i mean it takes roughly one minute to download it",
            "review_score": "1"
        },
        {
            "review_text": "Fun and hard (REALLY REALLY HARD!!!!!!!!!)",
            "review_score": "1"
        },
        {
            "review_text": "'This is my first game'  ♥♥♥♥/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game made my fun, i cried and rage a lot when i died about 50times in simple round.  And this end was really funny. ! :D I press all keys. Damn you troll i laughted hard ;p Guys you must try this game because 'bugs' and other problems are fake",
            "review_score": "1"
        },
        {
            "review_text": "its a great game some levels are hard but a great game overall i would give it 4 stars",
            "review_score": "1"
        },
        {
            "review_text": "I make it to level 9 and then come my frustration,pretty though game !!!!",
            "review_score": "1"
        },
        {
            "review_text": "Escape is a free game. 2D platformer game with simple graphics and hard puzzle gameplay. Does have level selection menu so you can skip past something you cannot do. Might be buggy also. Game I guess is a coding demo. Try and delete.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game... I give it 7/10 but its half broken... most of the levles arnt possible and it has no help menu... You have abillty to skip ahead through levles but still... I think he/she should test out his/her game before requesting and upload to the steam store...",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst games I have ever played.  Pros: ------------- Small in size.  Cons: ------------ ♥♥♥♥♥♥ graphics, very ♥♥♥♥♥♥, actually no graphics at all. No music. Visual bugs (Brightness) and other bugs (movement depends on your settings). How did this game make it to steam?",
            "review_score": "-1"
        },
        {
            "review_text": "Oh god, not one of these again.",
            "review_score": "-1"
        },
        {
            "review_text": "Best gan=me ever. 10/10 would downlosd and totaly not waste space on my pc. Imma wait for Escape 2 Return of the peg walls!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fine for killing a bit of time, but you can't jump high enough to complete a lot of the levels which is very annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "addicting",
            "review_score": "1"
        },
        {
            "review_text": "Terribly floaty controls and weird solutions to some levels that require hitting keys you didn't know could be used. Also you're required to almost make frame perfect jumps on some levels. Very much rage... but I did force myself to beat all the levels. But never again.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm terrible at it, but my son is all over it. He will be installing and losing his mind over it within minutes. Problem solving and quick reflexes required!",
            "review_score": "1"
        },
        {
            "review_text": "This game is nig.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is next to impossible",
            "review_score": "1"
        },
        {
            "review_text": "??? This game is so random, there is really bad collision and the levels are not puzzles but just randomness with no logic to it. And as for those 'hints' seriously! They do not help at all. And the ending is just stupid. The game is completely mute... although I'm not sure I'd want to hear sounds from this creator... just thinking about it sends a cold shiver down my spine... Brrrr cold so cold...  BONUS REVIEW CONTENT This is the creators thought process:  LOOOOOLLLOKLOooLLo8iygg",
            "review_score": "-1"
        },
        {
            "review_text": "really boring and annoying to play",
            "review_score": "-1"
        },
        {
            "review_text": "Rage inducing games are still supposed to be fun.   This isn't fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Beat it. It likes to mess with your head but helps you with a hint sometimes no hints and you have to figure it out 7/10 decent not the greatest but decent.",
            "review_score": "1"
        }
    ]
}