{
    "app_id": 365070,
    "name": "One Manga Day",
    "release_date": "2015-05-04",
    "developer": [
        "DeXP"
    ],
    "publisher": [
        "DeXP",
        "MyLifeGame.RU"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "Anime",
        "Visual Novel"
    ],
    "achievements": 12,
    "positive_ratings": 502,
    "negative_ratings": 361,
    "price": 0.0,
    "description": "Manga are comics created in Japan. The problem for most people is, as they're made in Japan they're only produced in Japanese; someone has to translate them to English! Is one man able to accomplish this? Is there more to his team's relationships other than business? Can everything in a translator's life be simple and clear?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365070/header.jpg?t=1451681531",
    "minimum_requirements": "OS: XP/Vista/7/8/10/12 Processor: 700MHz Memory: 512 MB RAM Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "More like 'I overdid my weed and saw hell' simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "You can get all achievements in less than an hour.",
            "review_score": "1"
        },
        {
            "review_text": "Well.. One of my friend told me this game is free and you can get 100% achievement in 15-30 min.. I didn't believe him. So I tried.. It took me 35 Min.  The game it self is some brain dead fun laugh and not much of anything else. So IF you want to improve your achievement % and have some quick fun then delete and forget.. Get this and play it.. won't take you more then 15 for 1 game and 30 min for all achievement.  5.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately, One Manga Day disappointed me. It supposed to be funny, but it is not.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like getting achievments, this game gives a few achievments if you spend and hour or so. Other than that, I don't think this game is too worthwhile to keep.",
            "review_score": "-1"
        },
        {
            "review_text": "One Manga Day is a sloppy, awkward mess of a visual novel.  I cannot name one of the characters, do not feel like I grew closer to any of them, and have a folder of screenshots of dialogue I felt needed to be preserved for future generations.  The story is nonsensical, one of the characters seems to be ripped from 'Lucky Star: Comic A La Carte', the sprites are strange photos of 3D models and the entire game just sort of ends out of nowhere after a little over a half hour of pressing enter.  That said, this game made me laugh.  It might be the pure lack of logic, or the cringe-y jokes that fall flat, then stagnate as they are repeated over and over and over again. Every now and again, something will happen out of nowhere that just works, and it's a moment of unexpected joy. The game is clearly one giant joke, and I can kind of commend that, at least for a free-to-play VN.   So yeah, Manga fans should give it a shot. Everyone else should hit 'Not interested', block the devs on all social media, uninstall steam and live out the rest of their days somewhere far away, where this game can't hurt them.",
            "review_score": "1"
        },
        {
            "review_text": "This Visual Novel shows part of the behind the scenes work when translating manga. It's certainly made quite humorously, so You can't expect here some serious work but rather a loose abstract humor. Music, drawings and story seem to be okay... Achievements are easy to obtain and the gameplay time is about 1 hour. This title should enjoy not only the faithful fans of Visual Novel, but also people who are looking for some specific kind of sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "I have a jackhammer arm. I am capable of clicking 14 times a second, for a sustained 3 seconds (before the pain sets in). This is without a doubt, the only game I have ever truly needed such a skill. This is a waste of time. A terrible and tedious 'adventure', I had to ♥♥♥♥ my left key button to skip past the pointless, uninteresting dialogue, and attempting to get 'endings' was stupid as ♥♥♥♥, and was in no way fun. It's like a fetch quest, but instead of fetching, you have to ♥♥♥♥ing read Wikipedia articles, until you know all the source material, then make a ♥♥♥♥ing guess, which I, every time, failed. Because ♥♥♥♥ this 'visual novel'. It's not a VS, it's a GIGANTIC piece of ♥♥♥♥ JOB sit-in, and has no interesting dialogue. It basically feels like it was made by a pack of wanna-be-nipponese weeaboo, 'ill-be-something-one-day' anime ♥♥♥♥♥. Seriously. This game is a waste of time, in my opinion. Not to mention, character design was bland and uninteresting.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is very short. The story hasn't much to it and the artwork is subpar at best.  While the pricing is accordingly (free), there are way better alternatives out there at a low price or even for free.  The only positive part is you get a glimpse on the topic (manga translations) and the achievements are quick and easy to get.  Overall however, unless you are an achievement hunter, you can find better elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "press s to take a screenshot hah a",
            "review_score": "1"
        },
        {
            "review_text": "Unless you love bad manga games, or after a quick 100% achievement fix, avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "The Poogle search engine is the most efficient app i have ever seen for the use of translating manga",
            "review_score": "1"
        },
        {
            "review_text": "It's free Achievements are fast to get  100% recommended",
            "review_score": "1"
        },
        {
            "review_text": "Bad English Bad Graphics Bad Ending  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is kinda weird. 10/10 Would play again, but meh",
            "review_score": "1"
        },
        {
            "review_text": "Cute short game +1 Have multiple choices +1 Have different endings +1 Can tell some girls to get undressed and then gets beaten up +1 It would be great if the story can be a little bit more exciting though.",
            "review_score": "1"
        },
        {
            "review_text": "DEATH APPROACHES this game is a constant reminder of how close to death i really am. god i wish i could just end myself now. please kill me someone.   Good game had fun somehow ended up in space not sure how.",
            "review_score": "1"
        },
        {
            "review_text": "I didnt enjoy this game at all. I immediately lost interest in the story and managed to get the 'good ending' by simply typing randomly through.",
            "review_score": "-1"
        },
        {
            "review_text": "As a Hentai scanlator, this is painfully accurate.",
            "review_score": "1"
        },
        {
            "review_text": "/",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Do you want to make mangas? &gt;♥♥♥♥ no &gt;Too bad you're coming with me!  0/10 would not get forced into making manga again.",
            "review_score": "-1"
        },
        {
            "review_text": "The characters make Mr.Game and Watch look like Korra.",
            "review_score": "-1"
        },
        {
            "review_text": "Samuel 18:25-27  And Saul said, Thus shall ye say to David, The king desireth not any dowry, but an hundred foreskins of the Philistines, to be avenged of the king's enemies. But Saul thought to make David fall by the hand of the Philistines.  And when his servants told David these words, it pleased David well to be the king's son in law: and the days were not expired.  Wherefore David arose and went, he and his men, and slew of the Philistines two hundred men; and David brought their foreskins, and they gave them in full tale to the king, that he might be the king's son in law. And Saul gave him Michal his daughter to wife.  ",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I started playing this to see if I could get 100% of the achievements, but it was so painful I had to give up. The character design and graphics are mediocre, and the story is grating at best. There are definitely worse visual novels out there, but there are also so so many better.   Don't play this unless you're achievement hunting, and even then be prepared to hate everything around you for the hour or so it'll probably take.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: -Is f2p  Cons: -The game",
            "review_score": "-1"
        },
        {
            "review_text": "3/10 MANGO SUPRMARKKET TOYS FOR ASIANS AND CHINEESE ,PROBABLLY WOULD BENG AGAIN ;))::):):):)::):) IM KOBE",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to write a manga? well now you can do anything but that. a crazy story that has all the laughs and is free!",
            "review_score": "1"
        },
        {
            "review_text": "No. Simply No.",
            "review_score": "-1"
        },
        {
            "review_text": "i woke up this morning with an irrection but on the end of the errection was something i never thought id bare to see again in my life. it was an old arch nemesis, dr doofinshmurts. after all platypusses are the onlly reptiles that lay eggs. i proceeded to walk down the stairs while simultaniously masturbating while wearing my favorite aprine that sais daddies angel on the front. i poored my favorite breakfast into a bowl, my grandmas ashes fresh from my dads ♥♥♥♥♥♥l, gives it that special seasoning. usually i dont light myself on fire when massaging a ♥♥♥♥ on my dad but one manga day got me by the shorts. the dlc was fabulous. if you masturbate to hentai like i do youll be really interested in this game. as level 1 you start out as a tenticle monster that has to anally penetrate all the school girls in mini skirts. reminds me of when i was a kid and my godfather told me. neil im gonna have to take your ♥♥♥♥♥♥♥♥ and put it in my refrigorator so it can de frost over night. i was ready by then. i recommend this to all animeme lovers. please friend request me",
            "review_score": "1"
        },
        {
            "review_text": "One Manga Day is a very special kind of game. It is a game I recommend. Not because it is good. Oh no, of course not. I recommend it because it is SO BAD. And it's free too. What do you have to lose?   My initial impressions were bad, as it was plainly obvious that the character models were generated with the ComiPo! software, and I gave the developer some criticism about that on the Steam forum. But that is truly the least of the game's problems. The fact is, this is one of the most disjointed, nonsensical, poorly-written pieces of fiction I have ever come across, and I read Bleach.    It doesn't make sense. Really. You are introduced to a team of Manga translators (and it's plainly obvious that they are translating Manga illegally. Not that it really bothers me, I just thought that was amusing) who each have a job in the process of translating a Manga from Japanese to  Russian  English. You are offered a job on the team and I ended up taking the 'Typist' job (which is called a Typesetter by actual English translation groups, by the way) and I was presented with absolutely nothing related to typesetting whatsoever in my entire runthrough of the game. My job was completely irrelevant to the progression of the plot.   Speaking of the plot, it makes no sense. The general idea seems to be that another rival translation group has decided to pick up a project that your group left abandoned for several months and you basically declare war on them for daring to finish what your group refused to finish. But most of the time, it isn't even focusing on that. Instead, we are treated to completely random, disjointed, incomprehensible scenes of absolute nonsense. In the span of my playthrough of what I assume to be one small route, I watched our group talk about translating manga, engage in get rich quick schemes, perform random acts of violence on each other, go to a dance party, go to space and meet God, eat lunch on a Kotatsu in the middle of the park whilst a bird poops on them, deal with 'chemists-satanists', and speak to an unexplained entity named Spicy who appears out of nowhere to offer random sagely advice that usually amounts to 'Google it'. There's also a Dragon-Girl for... some reason?   It just... doesn't make sense. There is supposed to be a flow to a story, yeah? One scene is supposed to lead into the next. But this game completely ignores every established concept of a story. There is no sense to any of it. It's just one random event to the next without anything tying them together whatsoever. And it certainly does not help that the author's native language is Russian as opposed to English, and it clearly shows. There are many, many scenes where the dialog can barely be described as Engrish, much less proper English. And even if it was in proper English, the plot structure is a complete mess and probably still wouldn't make any sense.    So... why am I recommending this game?    Because this should be a prime example of what NOT to do when developing an indie visual novel. It's a learning experience. Don't be this guy. Don't be a chemists-satanist. And shame on you, Steam, and shame on everyone who voted this through Greenlight, because even though it is free, this sets a bad precedent for the kind of content that can be on the Steam storefront.",
            "review_score": "1"
        },
        {
            "review_text": "speedran this in 0 seconds (according to my calculator) tbh it was a pretty challenging game and i would not reccommend it to the casual anime audience, more for the thrill seeking button mashers trying to top the leaderboards.",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea what I just did, but I know I will never try it again.",
            "review_score": "-1"
        },
        {
            "review_text": "I fixed the description: Manga is the Japanese word for comic. In the west, the term has been calqued to refer specifically to Japanese comics despite not actually holding this distinction in Japan. The problem for most people is, as they believe everything they read and hear, they take their understanding of such terms as their universal meaning; that's why someone has to come in and localize everything for them so that it fits their linguistic register and matches their specific understanding of foreign words. Is one man able to do this? Is there more to his team's relationships other than business (guess that answers the previous rhetorical question)? Can everything in a translator's life be simple and clear (um.. what)?  But yeah, it is kind of ironic that, for a game about the translation process, the devs entirely overlook how meanings shift as words are borrowed and instead present the western meaning of a Japanese word as its only meaning.   Anyway, the game sounds like stereotypical pandering to teen nerds who want to grow up to move to Japan and become manga anime translators after first doing the jet program.  That said, it is free and the dev’s first creation so hell, play it if you're interested. The English translation is god awful. Machine translated I think. Not that much is lost because of it. Could be worth a laugh though. Admittedly, I found the game description more interesting than the actual game.",
            "review_score": "-1"
        },
        {
            "review_text": "Even after drinking a pint glass of bleach, I can't seem to wipe away the stain that this game has left on my soul.",
            "review_score": "-1"
        },
        {
            "review_text": "Today I learned: - how printers work - how to translate random text - how to undress a girl in correct order  All of these knowledge would have been very useful at middle school.",
            "review_score": "1"
        },
        {
            "review_text": "im 9 min in and the cringe worthy writing is not worth playing any further.",
            "review_score": "-1"
        },
        {
            "review_text": "Refused to learn anything Got kicked out of school Robots took over the world Beat the game in under five minutes  10/10 would manga again",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game changed my life. I was in a dark place when i started playing and this game helped me through it all. Thanks a bunch... Really. You guys are awesome. Can't imagine my life without it.",
            "review_score": "1"
        },
        {
            "review_text": "love it!  its a really cute anime game where the anime girls dont undress theyrselfs so... AWSOME! but a lil bit short :( x3",
            "review_score": "1"
        },
        {
            "review_text": "good game i think i'll play more of it if my owner lets me play it again -_-",
            "review_score": "1"
        },
        {
            "review_text": "soooo boring my bread toast!",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "I spent more time skipping for the achievements instead of actually reading. The story has the potential to be at most decent, but it was miserably executed.",
            "review_score": "-1"
        },
        {
            "review_text": "~~ I am giving it a postive review because there is no neutral option ~~ There is not much to say about One Manga Day. It is the developer's first game, and it kind of shows. The charaters dont have much depth and the plot is all over the place. BUT I can see the work of making sure the charaters have some personality and the story's concept is oringal. Basicly, it reminds me of the vocaloid date simulators sometimes scene on deviantart. It is not bad but not that good.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun,quirky quick game.If you need some time to kill,this can ease a few minutes out of your day.The characters are cute,and vharry random.Nothing serious here,just quick laughs,and random giggles .....oh... did I say it was random?",
            "review_score": "1"
        },
        {
            "review_text": "This game is just random. I don't even understand what I played...Good for somebody that just wants to loose 1 hour of their lives, I'm not a fun of too much random, so I didn't manage to even waste that one hour unfortunately. Might be slightly educational regarding scanlation groups, but in none of the scanlations groups I've been in have I encountered that many cray people all in one place. XD",
            "review_score": "-1"
        },
        {
            "review_text": "Teaches you about manga translation business...nothing more...",
            "review_score": "-1"
        },
        {
            "review_text": "So... I spent a bit of time on this game, as you can see, and got a few achievements that I don't think I even wanted. This game, in my opinion, is a waste of time. I do not post negitive reviews very often, but this... This was simply confusing. The plot made no sense, the characters made no sense, and the art was nothing impressive (unlike what I think a visual novel should be). I would not recommend this game, and I don't think I will ever revisit it again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made me look for the nearest stash of LSD. Because that's the only way it's good.   10/10 would play again.  In all seriousness, I would recommend this game only because the achievements are easily earned and it is humorous if you laugh at being completely confused from the absurd plot line.",
            "review_score": "1"
        },
        {
            "review_text": "  i had the best time playing this game! although at the beginning i had to look up a walkthrough because the combinations were a bit hard to understand but other than that it was hilarious. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I honestly have no idea what this tory was about, mainly because i skipped as much text as i possibly could. I did it for the achievements! It took me less than an hour to get all twelve achievements, and its the only reason why im recommending this game.",
            "review_score": "1"
        },
        {
            "review_text": "Wow i enjoied it was short is was odd but lin was nice and acheivments were easy so i cant complain.... p.s. you will apreciate manga translaters and then feel trolled and hate them.",
            "review_score": "1"
        },
        {
            "review_text": "This game made absolutely zero sense whatsoever. The dialouge was disjointed and the characters were all way too weird. The soundbites used in this game were oddly picked at best. And when I got the bad endings, I felt like I didn't deserve them. I was given no clear guidance. Ugh, I felt like I was in some horrible alternate universe throughout this game. At least it was free.",
            "review_score": "-1"
        },
        {
            "review_text": "Can I have my soul back?",
            "review_score": "-1"
        },
        {
            "review_text": "The art is abysmal, but the story was... interesting.",
            "review_score": "1"
        },
        {
            "review_text": "eh...it's meh. Had a laugh...once...i think (wait...did i?)",
            "review_score": "-1"
        }
    ]
}