{
    "app_id": 365140,
    "name": "DREAMFLIGHT VR",
    "release_date": "2015-05-21",
    "developer": [
        "REFUGIO3D®",
        "Claudio Panzanaro"
    ],
    "publisher": [
        "REFUGIO3D®",
        "Claudio Panzanaro"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "VR Support"
    ],
    "genres": [
        "Adventure",
        "Simulation"
    ],
    "tags": [
        "Adventure",
        "Simulation",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 5,
    "negative_ratings": 6,
    "price": 1.69,
    "description": "You close your eyes and when you open them again, you wake up in a new world full of magic. Decide for yourself whether you prefer, to fly on the back of an eagle or would you rather be the pilot. This game is perfect after a hard day's work. Try this game, put Oculus Rift on and relax .",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365140/header.jpg?t=1460746721",
    "minimum_requirements": "OS: WinXP, Win7, Win8, Windows 10 Processor: I3 Memory: 4 GB RAM Graphics: GeForce GTX750 Storage: 310 MB available space Additional Notes: Oculus Rift 0.8.0.0",
    "recommended_requirements": "OS: Win7, Win8.1, Windows 10 Processor: Intel I5 Memory: 8 GB RAM Graphics: GeForce GTX960 Storage: 310 MB available space Additional Notes: Oculus Rift 0.8.0.0",
    "reviews": [
        {
            "review_text": "Please update to the new Oculus runtime.",
            "review_score": "1"
        },
        {
            "review_text": "I never write reviews, but I really need to warn people about this game. I paid, downloaded, and installed the game. Game doesn't activate the oculus for me. The oculus store is still up on my screen. I tried playing it using steam VR. The game starts on my screen and freezes, but doesn't work on my rift. Waste of money and my time for troubleshooting this crap. Also I found the developers website to contact them for help. It's in Germany...",
            "review_score": "-1"
        }
    ]
}