{
    "app_id": 365280,
    "name": "Alexia Crow and the Cave of Heroes",
    "release_date": "2015-05-04",
    "developer": [
        "Questtracers"
    ],
    "publisher": [
        "Questtracers"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 14,
    "positive_ratings": 29,
    "negative_ratings": 25,
    "price": 4.79,
    "description": "An adventure game with hand-painted graphics and an intriguing story. It's up to you to escape from the mysterious Cave Of Heroes by solving brain-bending puzzles. Explore a game world based on Ancient Greek mythology in this fascinating and thought-provoking journey.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365280/header.jpg?t=1447373078",
    "minimum_requirements": "OS: Microsoft® Windows Server 2008, Windows 7, or Windows 8 Classic Processor: 2.33GHz or faster x86-compatible processor, or Intel Atom™ 1.6GHz or faster processor for netbook class devices Memory: 512 MB RAM Storage: 120 MB available space",
    "recommended_requirements": "OS: Windows 8 Classic Memory: 1000 MB RAM",
    "reviews": [
        {
            "review_text": "This is a somewhat cute game, but also a very fast and easy one. Some of the mini-games are actually pretty fun, though I ocassionally had to look at a guide to tell me what my end goal was meant to be, as the game itself contains no directives. The cut-scenes really need to be skippable, and there are definitely glitches, especially with the mouse functions in relation to the background (sometimes you need to be a little off-position in order to make the function work). I will recommend it, but only as part of a bundle or good sale. After all, for the two chapters released thus far, my first two hours of play time constitutes fully completing them with all achievements. The rest is just getting the card drops.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure where or how I got this game but it was a good 1.5 hours. I wouldn't pay $5.99 for it though. Maybe $2.99 would be a more reasonable price. Other than that, Good game, when chapter 3 comes out, i'll play it.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a HOG, but it could easily be one. They took all the ♥♥♥♥♥♥ puzzles that are the worst parts of HOGs out and made a game completely comprised of them. They also took out any semblance of a hint system or suggestion of where to go so I just said ♥♥♥♥ it and got a walkthrough to make my hour's time less painful. I made it through the first chapter and then the thing glitched out and didn't give me an item i needed to progress so I said ♥♥♥♥ it I'm done.  The voice acting sucks, the puzzles have been in a hundred other games, the interface is terrible and caused me to fail one puzzle several times just because I didn't click exactly where the game wanted me to. Not happy with this one at all and glad it's out of the way, even though I didn't know it was coming or what to expect from it. Just avoid this business, kids",
            "review_score": "-1"
        },
        {
            "review_text": "Unless you like puzzles that are almost impossible to solve, do NOT buy this game!",
            "review_score": "-1"
        }
    ]
}