{
    "app_id": 365420,
    "name": "Apollo4x",
    "release_date": "2015-05-05",
    "developer": [
        "Digital Entertainment"
    ],
    "publisher": [
        "Digital Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Includes level editor",
        "Commentary available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 15,
    "negative_ratings": 31,
    "price": 1.69,
    "description": "Apollo4x is a casual-to-difficult space trading tycoon game, where success is measured in earnings from how efficient your trade routes are in transporting supplies to demands on your planets. Combat is card based, and uses a unique system never before seen.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365420/header.jpg?t=1509205154",
    "minimum_requirements": "OS: Windows XP Processor: 2.0 Ghz Memory: 2048 MB RAM Graphics: DirectX Compatible DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows XP Processor: 2.0 Ghz Memory: 2048 MB RAM Graphics: DirectX Compatible DirectX: Version 9.0 Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "This is very much a 1st Impressions review and will be edited if necessary as playtime increases.  So... You have an interest in Space 4X? You like the many Space Trading Games? You enjoy games like Magic: The Gathering? You actually crave games that make you think?  If you have answered yes to one, or even all of the above. You owe yourself to give Apollo4X a purchase. Yes, I am saying that right away. Why? Because all the aforementioned is in this game and then some! But now, you are probably thinking..  'Oh great, another game genre mashup that just will not work!... I'll Pass!'  Hold on... Not only are each of these elements solid in their own right. But in Apollo4X, they come together to make a super solid, unique and rather innovative title that shouldn't be overlooked. As a 4X game, you will not do something, then mash the turn button waiting for something to do. Each turn has strategical depth. You must meet colonial demands, purchase resources, build up colonies, prepare and plan for trading.   Trade is not an option in this game. It is one of Apollo4X's core mechanics. If you do not trade, you will go bankrupt, and you will lose the game. No population building leading to masses of taxes here. You have to be strategically aggressive in your interplanetary business, as the more you expand, the greater the upkeep. Colonists Empire-wide will also make demands. Ignore their demands, you suffer loss of approval rating and if that hits 0, you will also lose the game.  If that wasn't enough, there's the Alien Centaur threat to deal with. They are aiming to take over the whole galaxy, and most importantly, take you out by capturing your home planet of Apollo. Whilst their are no space battles in the game, land battles are played out as a card game. This game has a fantastic strategic complexity as battles are not one on one. Each card will affect several others in a deck. So what you select, and the tactics you choose in how to play them matters. So even when you are outnumbered and outgunned, it is still possible (But not easy) to win a battle.  So after some 1st impressions. What are the pros and cons?  PROS  - Starting the game, maps are not final. Feel at disadvantage? Just don't like the map? Throw it out until you find something you like.  - This game has depth from the start to the end. You will not be hammering the 'End Turn' Button. Gameplay is engaging and there's always plenty to do. Strategy is key, you will have to think! A strategy that works in one game, might not work in another.  - A genre mashup that actually works. There's no 4X like it. Apollo4X is truly a unique and innovative game that pulls you in!   - One more Turn Syndrome? You bet! The game is fun and totally engaging.  - A welcome 2D galaxy option for those who require it.  - Many options before starting a game can potentially serve up lots of replay value!  - Your purchase will be helping to save rescued dogs... Good bang for your buck in both game and charity.  CONS (Can also be positives for some, including myself)  - Although not a disavantage by my standards. This game takes the old school approach. There is no tutorial mode. You will have to read the manual. Understand, and pay attention to what every section of the UI does. The learning curve will be steep at first.  - Maps can get busy fast, and initial confusion might arise. There's a lot of information to react to every turn. Turns are not quick, and neither is mid-late game trading and combat. You will not finish a single game in just a few hours.  - No storyline or campaign. Just the old school way to play. If you're looking for 100's of random events, and a story to follow. You will not find it here.  - A few very small issues here and there which will be tightened up with a bit more community feedback.   TL;DR? - An innovative 4X game that dares to be different from the normal formula, and as first impressions go, it suceeds! If you are looking to buy something different, buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Apollo4x is a very unique attempt at a 4x game, that focuses on building and optimizing an economic system. The problem is that it's not even a 4x, more like a 3x. It lacks exploration...  Without any fog of war, you can see everything about each planet at turn 1. Disappointing...  Lets talk about the combat system, its basically an uninteresting card game. It goes painfully slow and you can't really skip it.  Managing your trade routes and ♥♥♥♥♥ can be fun for a while, but the whole experience is underwhelming once you understand how the game works. Possibilities are too limited, you either are doing it right or not. You can't just play your own way, and try something different in a next game. You are going to learn how to play and then realise that it's always going to be the same, more or less, each game. Add to that the fact that there's only one race for you to ''choose'' from..humanity.  I have 6hrs of playtime on Apollo4x and I would not say that I regret purchasing it, but I am not going to play anytime soon. Not when Gal Civ3 and StarDrive 2 are around... I say buy it if you are still curious about it but otherwise that's a Not Recommended.",
            "review_score": "-1"
        },
        {
            "review_text": " This game is NOT worth playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another game that I bought, played for 10 minutes and gave up on. WHEN WILL THE PUBLISHERS STOP ASSUMING PEOPEL UNDERSTAND THE GAME AND PROVIDE USEFUL TUTORIALS??? If you have not played this kind of game before do not try and start with this one.",
            "review_score": "-1"
        }
    ]
}