{
    "app_id": 365660,
    "name": "OlliOlli2: Welcome to Olliwood",
    "release_date": "2015-08-11",
    "developer": [
        "Roll7"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Skateboarding",
        "Indie",
        "Sports"
    ],
    "achievements": 27,
    "positive_ratings": 338,
    "negative_ratings": 65,
    "price": 10.99,
    "description": "Drop in to Olliwood and prepare for finger-flippin’ mayhem in this follow up to cult skateboarding smash OlliOlli.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365660/header.jpg?t=1498680307",
    "minimum_requirements": "Минимальные: ОС: Windows 7 or later Процессор: Dual Core 2.4 GHz or higher Оперативная память: 2 GB ОЗУ Видеокарта: NVIDIA GeForce 9500 GT or equal AMD Video Card / Intel HD4000 DirectX: Версии 10 Место на диске: 1 GB Дополнительно: Microsoft Xbox 360 or Sony PS4 DualShock strongly recommended.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "i have played olliolli 2 before on the ps4. so i know what i am getting. but so happy its on WIN/MAC/LINUX.  handles great, tight controls and the gameplay is stepped up a notch because manuals/reverts are in. so combos are huge. the soundtrack is brilliant. great and well chosen music, perfect for olliolli. a perfectly balanced game, that really does make you wonder if your gamepad will last the night from retry after retry to get the highest scores  one thing i can say on a bad note is that the optimisation seems to be a bit slow. unlike olliolli 1 which was stupidly fast, there seems be some slow down here. it may be because of the port [because it feels like one, if not fair enough]. but i will leave that up to updates in future and hope it gets addressed.  all in all, a great product, sequel and tons of fun. well worth it. you should buy it  rating: solid  -*UPDATED ADDITION REGARDING SLOW DOWN*- i did actually turn down the resolution in video settings, and that has really made a difference to what it should be like. so maybe try that if slow down is a problem ******",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure why, but Steam had sent me a 50% off coupon for this game. At $7.50 I'd be a fool to not buy hehe....  Ok, if you've played Olliolli 1 you'll notice right away that the graphic level, while minor, has been enhanced. New Tricks, locations, interface, etc will also greet you, but the core game remains unchanged.  You'll like this game if you are into quick-twitch gameplay with simple controls. Nice for a quick gaming fix!",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay has been vastly improved upon the original OlliOlli, it's more responsive and the addition of manual and reverts makes the game deeper, more challenging, and more fun.  The graphics have also been improved quite a lot. A new multiplayer mode is cool, although it is only splitscreen 4-way (even if you're just 2 players) on your monitor, an online multi would have been awesome. The soundtrack is still great, but it might be the only point where the first one was better. There are still some fantastic songs on this one, but a couple of them are a bit forgettable, and I'm missing a couple of the best ones from the original. Gonna look into a way to 'mod' them into this version if possible.  For newcomers, be warned, this game is HARD. It can be really frustrating if you don't get a hang of it, some of my friends that tried it on my pc couldn't figure the game at all (granted they didn't play more than half an hour), but I love that it's challenging, it reminds me of the old Skate or Die/Ski or Die games, and when you're half decent at it, it's a lot of fun!  10/10, will get carpal tunnel syndrome again.",
            "review_score": "1"
        },
        {
            "review_text": "Way better than the first game. If you see the trailers and some footage and you think you might like it, believe me you're going to love it. Full level combos now possible thanks to new mechanic: manuals, perfect landings are not that strict and frustrating anymore, fun achievements and level goals, great new tricks like double flips, 720 flips and kickflip underflip. I still don't dig the art style for a game like this, but at least the environments are more interesting and everything is vivid and colorful. Unlike the first game on Steam, 360 controller works w/o additional apps",
            "review_score": "1"
        },
        {
            "review_text": "really good soundtrack. pretty fun when you pick up the controls. feels nice and plays nice  WOULD DEFINITLY RECCOMEND",
            "review_score": "1"
        },
        {
            "review_text": "Make sure you read the manual",
            "review_score": "1"
        },
        {
            "review_text": "I loved the first OlliOlli. Tight controls, no lag, and fantastic flow. OlliOlli 2 is lacking these elements.  I got pretty good at the first one, but in this sequel I'm having major difficulty landing tricks, doing combos and executing grinds. It's just not responsive. Some times it's so bad that I try to do a 3-key combo, 2 of the keys execute, I don't succesfully land, and then the 3rd key I pushed starts executing the next trick.  Grinds in the first game were super fun to do. You'd practically magnetize to rails as long as you were above them. Now you have to be accurate like landing a trick normally. I'd normally be okay with increasing the difficulty, but this just ruins the flow of gameplay.  Also, this game sadly falls into the ever-expanding category of 'games with Retro-Like Graphics that take a ton of system resources to run'.  In conclusion: I'm so disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "having framerate issues but so much depth to the mechanics im loving it",
            "review_score": "1"
        },
        {
            "review_text": "Overall the game is fun, soundtrack is good and look OK for the type of game. There are however glitches here an there and the controls feel somewhat off with my non-xbox controller (could be my controller, could be the game). It's still unclear to me when exactly to “plant” a trick, the momentum feels random most of the time. Also, try to ride down some small stairs without jumping/tricks and try to land, it's impossible to do this right/not-sloppy. Grinding is a big part of the game and especially when you just started playing the game it's unclear whether an object is grindable or not. So you don't know if your just missing the hotspot or you cannot grind it. This is very frustrating. I still like playing the game but in my opinion it's not worth the €14,- and I wish I would have waited a while longer for a discount or something. Cheers.",
            "review_score": "-1"
        },
        {
            "review_text": "I no longer have a thumb...  GET THE GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, this is a game you can play for 5-500 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the first in every way. Just don't really enjoy the genre anymore.So that's why I don't play it or the original  First game review ",
            "review_score": "1"
        },
        {
            "review_text": "My review on this game is going to be mutal, Mostly because it is nothing like the first one. The manuals are harder than ♥♥♥♥ to get down and don't always work, it seems like you have less of a window for perfect landing/grinds from the first one. It just isn't as fun as the first one. I'm actually disappointed in this and have actually requested a refund for it. I have completed OlliOlli all levels on the Vita and 3DS and would still stick with that one before coming to this one,",
            "review_score": "-1"
        },
        {
            "review_text": "this game is laggy and shopy... I would actually love this game if not for that. ",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very well polished, satisfying, arcade-like game. It's simple to play, but difficult to master. The controller support is excellent, and the fact that it supports linux natively means I can play this in my living room on my steambox when friends are over. Local co-op extends the game to allow many more hours of fun with friends even after you get tired of playing solo.  I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "this may be a wierd comparison, but this game reminds me of guitar hero... it has a certain rythm to it, on the landings and tricks, that felt somewhat familiar to geting good at a GH song... this made it for me",
            "review_score": "1"
        },
        {
            "review_text": "Everything I had hoped it would be, AND MORE! A sequel to the still-fun OlliOlli, but with much improved graphics, additional moves that keep you chaining mad combos until you run out of pavement. I would recommend this to anybody to like quick moving skating games. A controller is a MUST for maximum fun. Okay, I gotta go play some more.",
            "review_score": "1"
        },
        {
            "review_text": "OlliOlli2 is an awesome arcade game, with simple basis but complex advanced techniques, so you can have a lot of fun with any skill level, by trying to finish a level, or doing a level-long combo  to reach the world record.  Concretely, the game is a 2D skating game, I think you noticed it, but what the screenshots and the trailer don't show you, is that this game has a particular gameplay.  You can enter tricks with the left stick, and do spins or special tricks with the triggers of your pad (pad game, almost unplayable on keyboard). but you need, when landing your tricks,  to press the A (or cross) button before hitting the floor to validate your trick. (and also not slam your head on the asphalt)  and this is a really particular gameplay mechanic, so you will need a little bit time to get used with it.  bit by bit, you will try more advanced tricks, and pretty insane techniques to do a level-long combo, but you shall first humbly try to finish the levels  without falling in deadly spikes or getting burned in lava!   now, what people expect from a review:  GRAPHICS: cool, a little bit generic and not really varied, but you won't really focus on it.  MUSIC: very cool, gets you really in the mood of skating, some music have a rythm that can very close to the game rythm, leading to moments where your actions are synced with the music, just by chance. also, no dubsteb. so really cool.  LIFETIME:  pretty much time, from 10 hours if you want to go straight,  to 35-50 hours if you want to 100% the game. (I played OlliOlli 1, so started with an advantage)  BONUS: MULTIPLAYER.  the game has a local splt-screen multiplayer, which is really great, but as you need minimum 1 hour of practice before not slamming your face on the road every 2 meters, it's not a game i would play with my friends, it's sadly not immediatly fun. (but really fun with a minuimum of practice!)  TO OLLIOLLI 1 OWNERS: More graphics, more music, more tricks, more difficulty. buy it.  LINUX:  the game's available on Linux. pretty cool. so if you are a linux user, first, I respect you, secondly, buy this game. (if you didn't played Portal 1/2, Super Meat Boy and VVVVV, though)   TL;DR: read the first five lines of my review, and buy the game. 11/10 would beat world records in RAD mode again.  Come on, buy the game, I need people playing this game, I have world records on almost every levels, I need new challengers!",
            "review_score": "1"
        },
        {
            "review_text": "This is great. Yeah. Somehow I feel like it's not quite as good as the original... something about the art change, or the slightly faster speed, or the sound effects, but it doesn't have the tactile joy of the original. It's still great though!  Also, the timing on landings is slightly different and it's really, really annoying going between the two games.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of those 'one-more-go' games. Your left thumb will blister, your right forearm will be sore, and you will fail a lot, but you will still want to keep on playing becaue the gameplay loop will lodge its hooks in you. Get this game!  Also, play with a controller",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "Easy to play, definitely hard to master. The control layout is impressive using both the direction keys and WASD to perform a wide range of cool tricks. I think this layout is comfortable and satisfying when pulling off some sick combos. I definitely recommend a controller for ever more comfort while playing. The soundtrack and art style of the game help to make it that little bit more enjoyable, but the sole of this game are those Olli's.",
            "review_score": "1"
        }
    ]
}