{
    "app_id": 365620,
    "name": "WarBirds - World War II Combat Aviation",
    "release_date": "2015-05-05",
    "developer": [
        "iEntertainment Network Inc"
    ],
    "publisher": [
        "iEntertainment Network Inc"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Massively Multiplayer",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Massively Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 20,
    "negative_ratings": 25,
    "price": 10.99,
    "description": "WarBirds 2019 is now in its 24th year of simulating flight combat in World War II. The game includes solo and online versions with over 225 aircraft. New for 2019 are more planes, improved flight models, new terrain areas and more online special events.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365620/header.jpg?t=1555514552",
    "minimum_requirements": "OS: Windows 8, 10 Memory: 1 GB RAM Graphics: Shader 3 Compatible DirectX: Version 9.0c Storage: 5 GB available space Additional Notes: Joystick, mouse and keyboard",
    "recommended_requirements": "Memory: 2 GB RAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "Highly Recommend this simulation! Been playing it since 2009, finally glad it is on steam. Very realistically structured, in terms of flight models of aircraft and weaponry and load outs. This isnt your typical shoot em up and fly home simulation. A lot of variables to keep you busy, and coming back. Very addictive once you get hang of it. Check in with some squads, and people will help you out :)",
            "review_score": "1"
        },
        {
            "review_text": "played this for 10 years online. game USED to be a lot of fun. in the last few years, the game has gone downhill. 24 or so year old graphics can't compete with the new games here. sound effects are terrible. ( some of the ground vehicles sound like sewing machines that need oil) short of a couple of bad eggs(all games have them) the people are really great to play with. try it at least,you may like it.",
            "review_score": "-1"
        }
    ]
}