{
    "app_id": 365850,
    "name": "Starchaser: Priestess of the Night Sky",
    "release_date": "2015-07-24",
    "developer": [
        "Nonlinear"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Anime"
    ],
    "achievements": 17,
    "positive_ratings": 32,
    "negative_ratings": 10,
    "price": 6.99,
    "description": "Defy gravity and traverse a twisted 3D labyrinth as a chosen priestess cast with the important job of naming the stars. However, when the night sky goes dark, only the maze remains.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365850/header.jpg?t=1555564907",
    "minimum_requirements": "最低配置: 操作系统: Windows Vista 处理器: CPU Celeron over 2.0GHz 内存: 1 GB RAM 图形: Monitor: over 24bit color, resolution over 800 x 600 px DirectX 版本: 9.0c 存储空间: 需要 500 MB 可用空间",
    "recommended_requirements": "推荐配置: 图形: GPU or Graphic card are recommended",
    "reviews": [
        {
            "review_text": "A fairly decent, laid-back puzzle game with one real flaw: the developers didn't play to the game's strengths. If this game were almost entirely logic puzzles with the odd bit of combat it would be better than what it is. It gets bogged down with a bit too much combat and some 'agility' sections that don't really fit. One level required me to jump and free-fall onto the end level marker far below but aiming the camera straight down doesn't work so you're fighting the spastic camera more than you are aiming skillfully toward the mark. As for the combat, half the enemies are these target dummy bunnies that don't even fight back which could just as well have been switches but instead the pace of the game is killed when you suddenly have to kill 6 or so of them to progress.   Aside from those points, though, the puzzle design is pretty good and the combat with bosses, while sometimes not perfect, is enjoyable. All of the labyrinths rely on the gravity mechanic where you rotate the level by jumping onto walls with a checkerboard pattern. Each labyrinth also has it's own theme which ties into the puzzles like the Pisces labyrinth having a lot of water tiles that push you in a certain direction, for example. The puzzles are the real strength of the game, as I said, and while they're not very difficult, it's still fun in a laid-back sort of way.  On the technical side of things, this game does have all the shortcomings of your average Japanese indie game: it has a pitiful set of options that are only accessible from the launcher, it defaults to a low-res window and max res isn't very high (1400x1050 or something odd like that), the audio is absurdly loud and needs to be lower via the volume mixer instead of in-game, the controls are not rebindable, etc. This is all pretty common for Japanese indie games but it would still be nice if they could step up the settings a bit.  Ultimately, I wouldn't advise against getting this game but I can't give it a strong recommendation, either. Pick it up if it really piques your interest but only if that. I would say it's around a 6/10, maybe lower if I wanted to be harsh about the lack of proper settings.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good.",
            "review_score": "1"
        }
    ]
}