{
    "app_id": 365960,
    "name": "rFactor 2",
    "release_date": "2015-11-12",
    "developer": [
        "Studio 397"
    ],
    "publisher": [
        "Studio 397"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Co-op",
        "Online Co-op",
        "Local Co-op",
        "Steam Achievements",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Simulation",
        "Sports"
    ],
    "achievements": 25,
    "positive_ratings": 1057,
    "negative_ratings": 227,
    "price": 25.79,
    "description": "rFactor 2 is a realistic, easily extendable racing simulation that offers the latest in vehicle and race customization, great graphics, outstanding multiplayer and the height of racing realism. It features mixed class road racing with ultra realistic dynamics, an immersive sound environment and stunning graphics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/365960/header.jpg?t=1537543659",
    "minimum_requirements": "OS: Windows 7, 8, 8.1 or 10, with latest Service Packs Processor: 2.8 GHz Intel Core 2 Duo or 3.0 GHz AMD Athlon II x2 Memory: 4 GB RAM Graphics: nVidia GTS 450 or AMD Radeon 5750 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 30 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": "OS: Windows 7, 8, 8.1 or 10, with latest Service Packs Processor: 3.0 GHz Intel i5 or 4.0 GHz AMD FX Memory: 8 GB RAM Graphics: nVidia GTX 760 or AMD 7870 DirectX: Version 11 Network: Broadband Internet connection Storage: 60 GB available space Sound Card: DirectX Compatible",
    "reviews": [
        {
            "review_text": "Best racing SIM in the market!   Be prepared to spend some time tweaking the graphics and HUD/UI to get the best out of it.",
            "review_score": "1"
        },
        {
            "review_text": "My only gripe is i never went to engineering school.. this game is so complex when it comes to settings for basicly everything.. I was reminded why i gave up on Rfactor original.   Other than that.. Loving it so far. AI is pretty good!   Give it a shot if you love real racing. (Mad not to at 40% off)",
            "review_score": "1"
        },
        {
            "review_text": "Been playing rFactor 2 since early 2013 and just migrated my copy over to Steam. To cut to the chase, rFactor2 is a brilliant racing simulator. It offers a very robust and detailed physics engine, coupled with an excellent tyre model, which will punish bad driving and reward good driving, in a way I have yet to see in other games/sims . As well as employing some very cool features, such as proper tyre deformation, both physical and visual, this includes the ability to flatspot a tyre(s) and also tyre curing (hardening of the tyre from overheating).   rFactor2 also features full 24 hour day/night cycles and dynamic weather. Although the latter is still, to a certain degree, a work in progress. rFactor2 also features a dynamic track surface, aka real road, which means a track will 'rubber in', based on where and how cars drive on the track. This also applies to a wet track which is drying out too, so you will see a dry line start to form.   The force feedback is, in my honest opinion, the best there is at the moment, however results may vary based on the type of wheel you are using, but this is the case for any racing game, in my experience. I currently use a Thrustmaster T500rs, and it pretty much works perfectly on default settings, although you will most likely want to tweak settings here and there to suit your own personal preferences.  rFactor2 is a 'constantly evolving product' which means new updates to the game itself, as well as the content, are released on a regualr basis (generally every 6-8 weeks there will be something new/updated, although there is no official timescale for releases/updates). Because of this constantly evolving nature, there are, some areas of rFactor2, where it is a little rough round the edges. A good example of this is the weather system, at least from a visual standpoint, needs to be finished at this present time, however it will no doubt be addressed in the near future.  The game can seem quite daunting to someone who has never played any of ISI's earlier titles i.e. rFactor (1) and indeed there is a huge amount of settings/customisation that can be done, either via the in-game UI or through fiddling with settings in the JSON game files.  Online multiplayer is good, but don't expect the same as something like iRacing, unless you join a organised league.  To sum up, here are my PRO's and CON's for rF2.  PROS:  1.) Excellent physics engine. 2.) State of the art tyre model. 3.) Very detailed force feedback. 4.) Dynamic track surface. 5.) Dynamic weather 6.) Full 24 hour cycle  7.) Continually evolving product, meaning new features and content are reguarly added, as well as exisiting content and features updated too. 8.) All ISI released content and updates are FREE and always will be. Even if you let your online subscription run out. 9.) Lots of 3rd party content available. 10.) Excellent AI for some truly epic offline races.  CONS:  1.) Some aspects/features are a bit unfinshed at the time of writing this review. 2.) As with many racing games/sims, rFactor 2 is quite resource hungry and requires a reasonably good PC to run it with all the graphics turned up and lots of cars on track. 3.) Online multiplayer can be hit and miss sometimes, unless you sign up to an organised league. 4.) rFactor 2 can be quite complicated to use and setup, to someone new.  In short, if you like racing games and you like them hyper realistic and packed with features, get rFactor 2, you won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the top sim racing games! The AI quality is so good that it takes away the need for racing games like Iracing or multiplay. This may be a negative for some, but for me it's great. And although there aren't many mods out there right now, the ones out are pure quality.   Now, I also have the advatage of not having played RF1 before. So recently I downloaded it, installed physics patches, and mods as people recommended, and OMG is there a MASSIVE difference! The game has improved so much it can't even really be compared. I do however have Game Stock Car Extreme, and what they have done to the RF1 physics engine to make it drive the way it does is master class!  I do realize that everyone is slowly moving toward Assetto Corsa, but I hope RF2 developers continue with what is a pure racing sim. We need these, and I for one would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The game lets you jump into the car and race. Nice and simple like the retro games i grew up with in the 8o's. Incorperated with more modern Graphics.  The car handels like the real thing as if you where in a Simulator rig. Minus the motion sickness. ",
            "review_score": "1"
        },
        {
            "review_text": "rFactor 2 may very well be the sim title with the most potential. But the best thing I can say about it is it feels incomplete.  The things that rfactor 2 does, it does best. It has fantastic FFB &amp; driving dynamics. Ever changing track conditions, tires, temps, to my eyes one of the most natural &amp; realistic visuals, great A.I, and on and on. But it somehow feels unfinished. It is a little short on content, but does have a decent modding community which is now a part of Steam's workshop.   rFactor 2 is an ever evolving title, and if you can stick with it, it will reward you from time to time. It is beautifully immersive with great sounds, 24hr day cycles (hello night racing!) full weather cycles, full car systems such as tire temps, brake temps, water, and oil, etc.   I recommend this game for driving purists. It is a demanding title, and will require you to work on your driving technique &amp; style, car set up, constantly aware of track conditions, line racing, and fighting for position. If this sounds overwhelming to you, perhaps check out other titles such as Assetto Corsa. If not, you cannot go wrong with rFactor 2, and similarly Automobilista.  Over all 7.5/10.  PS: Keep in mind that online racing is paid via subscription. However, it is one of the best titles for offline racing.",
            "review_score": "1"
        },
        {
            "review_text": "Played rfactor 1 a lot and also Iracing. I used to love gran turismo and comemasters f1 games. Basically the majority of sim racers I've played and enjoyed. But I would say rfactor delivers on a different level. I'm not even sure if it's fair calling this a game. It's tough to express how much I support ISI and this game - you need to just play it. Great AI, car physics, graphics, sounds, mod ability, etc. rfactor 2 is my top choice for a sim racer.",
            "review_score": "1"
        },
        {
            "review_text": "simply, graphics aside, the best existing simulator perfect for hardcore sim drivers and online championships",
            "review_score": "1"
        },
        {
            "review_text": "After lots of seat time in other sims and a carefull think how to conclude rf2 (break from rf2) AC, pcars, RRE, AMS. Coming to Rf2 i think its slightly lost its edge in the market. ..  - inconsistent content, some are good some are not so good , with just a handfull of decent feeling cars and mods (a small handfull!) Even some ISI cars feel better than others (cheating ffb self aligning torque, using caster on the formula renault and others).  - ai which can be great (annoying brake checking around corners is an issue and they dont overtake from a draft)   - weather that doesnt really work (wet area off racing line never dries) with ai (using wrong tyres not coming into change etc)   - dev team which i dont think care about this product (when was the last build?! apart from the guy doing the dev car blogs, hats off to his work).  Rf2 is becoming - lets say dead!........................!  I dont like how isi go about rf2 - for me Rf2 is and always will be a tech demo, of what ISI could do if they could be bothered.  Before i would recommend rf2, now theres just better packaged/value for money/almost as good as physics - sims on the market. Although when/if you do hit the sweetspot with rf2, not a lot can beat it.  Lets hope the new studio an bring rf2 out of the gutter and back to where it belongs, it certainly has ALL the potential!",
            "review_score": "-1"
        },
        {
            "review_text": "Best Racing Sim available.. just wish it was better organized and had more online activity",
            "review_score": "1"
        },
        {
            "review_text": "This is the best sim racing games I haver ever used. Why?  + phisics + real road + dinamic time and weather + one of the best AI + really cool racing series; cars and tracks (And yes, I like the oval tracks too. I remember how much loved the nascar 2002 and 2003 from Papyrus.) + the TrackMapPlugin is absolutely amazing 'tool' + magnificent price for this package + classic tracks!  some cons: - the rain effects could be better (It is under development.) - missing some dx11 effects   Now: I really hope that, the rF2 improvement doesn't stop. I like to see more tracks from ISI and I will pay for all of them. Keep going! Now I think that it's time for a competition!",
            "review_score": "1"
        },
        {
            "review_text": "Love this sim. I do play other driving simulators, but this is the one that delivers the most compelling experience and the one I always find myself coming back to.",
            "review_score": "1"
        },
        {
            "review_text": "Rfactor 2 has got to be the best online racing game out there, the single player mode I cant comment on as I don't normally run it. Don't let my time fool you. I've been racing rfactor gfor over 5 yrs, and have about a year in ther non-steam version of the game.  I usually run the Stockcar mod and there is no comparison to the other games out there, Iracing/Forza/Project Cars/Grand Turismo/Dirt, This game makes them all arcady. The imersion, driving feel, how the car reacts to set up changes and over the fuel run is certainly challanging. Its not a game its a simulation. There are a few leagues out there that are now runnning fixed setup races, so if your no so good at setting the cars up, help is available.   If your into online racing and are tired of all the wreckeres out there, give rfactor2 a try, bang for buck this the best there is, without the high prices and memberships, you buy it you have it all, no additional purchases for cars/tracks etc.  Thumbs up Thumbs up Thumbs up Thumbs up GREAT GAME WELL WORTH IT",
            "review_score": "1"
        },
        {
            "review_text": "rF2 is a great Simulator. It has a ton of content in the steam workshop and more can be found online. The graphics are not flashy and bright like other racing games. It has a more 'actual vision' look. This means that it shows you what your eye would see instead of what a camera would see (Lens flares, overly saturated colors. Etc)  Game uses DX9 but will be gettign it's DX 11 update in Q1 of 2017. This will usher in VR compatability as well as significant increases in graphical overhead resulting in better FPS and room for more graphical eyecandy to be added.  Studio 397, who now owns rF2, is a much larger studio and has quite a large number of developers working on rF2 development. They will eb releasing content and updartes significantly faster than ISI ever could. EVen if Studio 397 never made any further content or physics improvements the game would still be worth every penny spent on it.  Online mode is now free with game purchase and the serves are begining to fill with new rF2 racers.  For me, I have rF2 and Assetto Corsa. I prefer rF2 and it is my Goto sim racer. For me AC does not have nearly the same feel as rF2. Breaking, FFB, Sense of speed, real road, physics in general. It all feels better to me. Your mileage may vary.  Remember that rF2 has both its fanboys and haters. Both groups do their part to try and make rF2 look good and bad. The real deal is that the game is still in development and I think the furure is bright for rF2. It is worth having in your game list. ",
            "review_score": "1"
        },
        {
            "review_text": "Great sim.  Sadly rF2 is missing functionality that was available in the original, but makes up for it a little in improved features.  There are no championships, no single player progression, no earned car upgrades, and no in game currency to give you any sense of progression. Many would argue this is a true sim and therefor racing against real people is the only measure you need, but there is nearly no one online. Racing online will require you to join a league.  This is the truest definition of “not a game”.    ",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE 3: Now I bought a new graphics card. I had to reinstall the game to get it running. I just tried to install it on my SSD again and everything worked. So maybe they fixed this issue in the mean time.   rfactor2 is the most realistic racing simulation at this moment.  But: On this Steam Version, just a very limited combination of cars and tracks does not lead to a crash (rfactor2 has stopped worked...).  When the crashes are fixed I will change this review and write something about the game :)  UPDATE 1: Day Later: Now the source of the problem seems to be obvious: When I start the game now it says 'Downloading Workshop Items - 59 items remaining'. This situation does not change after an hour, so there is a problem to download the content. This is why most tracks and cars do not work as they have not been downloaded yet. As rFactor2 is not able to download them (I just use the official Workshop Mods which are subscribed by default), this review will stay negativ until the game has been fixed  UPDATE 2: Now I have reinstalled the game the second time. This time, I installed it to my normal HDD (not SSD). The reason for this was, that my Steam Folder on the SSD was unter C:\\Program Files (x86)\\Steam. So, maybe the (x86) was a problem for rfactor2, that it cant download to a location with special letters. Now everything works fine, my Steam Folder on my HDD is 'D:\\Games\\Steam'. Maybe this was a reason. I hope that the game will gun smoothly on the HDD and wont lod too long :)",
            "review_score": "1"
        },
        {
            "review_text": "Currently the best racing simulator on the market for physics, ffb, A.I and dynamic track/weather. Definitely not the best for graphics, multiplayer or usability. Hopefully the online component will improve when the U.I gets updated and is a bit more user friendly. The driving model has a pretty steep learning curve, but once you put in the hours you'll discover the depth of the physics engine comapred to other titles.   I've read the usual 'not enough grip' comments, and they are based on ignorance. It's been said before but I'll say it again - you REALLY need to wait for the tires to warm up, and then for the track surface to become 'rubbered in'. Once you do that there's plenty of grip, provided you don't just mindlessly crank the steering into the corner carrying way too much speed. You must be smooth with the steering and have the front tires pointed in the right direction (sounds obvious but takes practice), and be very gentle on the throttle mid corner. Look at the speedo and realize how fast you are traveling before you conclude that there isn't enough grip.   The ffb is the benchmark in the genre, though it takes quite a while to tweak it to your liking. I've read comments such as 'too much vibration' or 'too much rattling'. This is caused by two things, firstly a flat spotted tire from a lock up, secondly, rF2's ffb is extremely detailed and some consumer wheels (such as the G27) can't handle it - this isn't a problem, simply turn up the 'smoothing' and it's fine.   A.I is fantastic to race against, provided you know racing etiquette and are respectful of the A.I's track position. They will race you hard, overtake, and defend thier position. Not perfect by any stretch, but agian, the best in the business.   Leans heavily toward racing cars as far as content goes, though the road cars included are great.  Objectively the most advanced physics and tire model.  Ultimately it comes down to this - if you have time, patience, the ability to focus, and enough intelligence to understand the dynamics of car handling, this is the most harcore racing experience and is the sim for you. It will feel totally different from what you are used to, but give it time and you'll see why this is the sim of choice for the most serious racers. If you're just after quick fun, go buy another game, this will be an exercise in frustration.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: ● Very realistic tire and road physics  ● Great customization ability of controller ● Mods &amp; Steam workshop support ● Well organized and beautiful UI ● Realistic sunlight atmosphere (not fancy and I like it) ● Beautiful car model and high detail car texture  ● Much more realistic movements of AI in straight lane and startup ● Real time reaction of trackside marshals  Cons: ● Sometimes AI ignoring player's position and bumping to player in-and-out of turns (improved) ● Engine and environment sounds on the track less realistic on TV camera (no sound of echo, wind...)  I totally recommend this game if you like 'real physics feel' racing game and know how to tweak settings of controller.",
            "review_score": "1"
        },
        {
            "review_text": "After removing the online season pass, and making this a one time only purchase, this simulator is a must buy.  I have already improved my braking technique by using this sim (2 seconds gained!), the physics simulation and FF is the best in the market and even if the number of good mods is quite small now, after integration with steam workshop it can only grow.  Pros: - The physics are (probably) the best among all the simulators. - Online subscription permanently removed. - The hardware requirements are not extreme, I can run the software with good frame rates in a machine that's 5 years old. - Driving the cars in this simulator is a delightful and rewarding experience. - Mods can be managed with Steam Workshop, I like to manage everything with Steam. New mods will be added here, and it supports paid content (good bye rfactorcentral).  Cons: - VR is still not supported (December 2016). - The online servers are either empty or private. iRacing is still the best for competitive multiplayer. - The AI drivers are not good. (The other simulator I drive has no AI drivers, which is the logical option.) - The amount of good mods is small compared to the first rFactor. - The graphics are not as good as the graphics in non-simulator driving games. This is not important for me, but may be it is for the person reading this review.  Therefore this simulator can be recommended to anyone wanting to practice their driving, to improve their technique, to shorten their lap times and to master the nuances of the difficult cars like the Brabham, in practice mode or racing against the AI. Disable all driving aids for a good wheel experience.  I can only recommend this simulator for multiplayer if you already are member of a league and they want to use rFactor2. Otherwise stick with iRacing.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game and it is lots of fun",
            "review_score": "1"
        },
        {
            "review_text": "Just not to my taste",
            "review_score": "-1"
        },
        {
            "review_text": "I plan to revisit rf2 when its next on sale, but at the time of review:  Pros: Clearly one of the best physics engines Has all the 'essential' racing sim features that other games like AC are still missing AI cant be worse than AC, PCARS  Cons: Quality of the official content (some of which downloaded via ISI workshop) seemed all over the place. Some tracks had super low resolution mesh so felt like driving a 20 year old game, a couple of cars felt bad too, although maybe I was driving those on tracks that didn't have the real road feature enabled and it fell back to some other track grip mode (either way this in itself is a problem and annoying to have to check when going from one track to another).  Workshop is missing a lot of the 'must have' mods (mp server browser full of stuff not on there) Having random users upload the modders work is not ideal, and there arent enough reviews on the stuff that is there to tell if its worth trying  Paying for an mp subscription when the public mp is dead is also odd... you have to join a league/club to play online which is fine, but why do I need to pay ISI for that?  UI isnt that nice, but its functional and easy to find stuff  Some inconsistency with sounds, didnt notice any collision sounds in several cars that i tried",
            "review_score": "-1"
        },
        {
            "review_text": "Not even starts. The game freezes with the 'Unable to create default shader' message with a black screen. No support available.",
            "review_score": "-1"
        },
        {
            "review_text": "Well... what can i say about this game?! Project Cars, Assetto Corsa and R3E... i've spent lots of hours trying to master Nürburgring - Nordschleife. And i'm must say as an amateur driver i'm quite fast in most categories. Bought RF2 just to run the Green Hell. What a lousy driver i am.... dang!!!!!! It is definitely not a game for a casual player but a real hardcore simulator.  10/10 to learn Nordschleife all over again.",
            "review_score": "1"
        }
    ]
}