{
    "app_id": 366270,
    "name": "SHOCK TROOPERS",
    "release_date": "2016-05-18",
    "developer": [
        "SNK CORPORATION",
        "DotEmu"
    ],
    "publisher": [
        "SNK CORPORATION"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Arcade",
        "Retro"
    ],
    "achievements": 15,
    "positive_ratings": 58,
    "negative_ratings": 15,
    "price": 5.59,
    "description": "“SHOCK TROOPERS ”, the fan favorite 2D top-down view action shooting game released exclusively on NEOGEO MVS in 1997, returns to the battlefield on Steam!Progress through the battlefield, choosing the best routes and strategy!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/366270/header.jpg?t=1545195540",
    "minimum_requirements": "Минимальные: ОС: Windows Vista, 7, 8 Процессор: Pentium 4 2.4Ghz Оперативная память: 1 GB ОЗУ Видеокарта: Intel HD Graphics DirectX: Версии 9.0c Место на диске: 500 MB",
    "recommended_requirements": "Рекомендованные: ОС: Windows Vista, 7, 8 Процессор: 2 GHz Dual Core Оперативная память: 2 GB ОЗУ Видеокарта: NVIDIA GeForce GT 640 DirectX: Версии 9.0c Место на диске: 500 MB",
    "reviews": [
        {
            "review_text": "There are some people who wish videogames dealt with complex themes like war and terrorism with just an ounce of seriousness. I’m not one of them. Games like  Shock Troopers  epitomize what it means to be a digital soldier to me. You can expect violence at its most glorious, getting points for making others suffer, and then flexing, laughing, and maybe even doing a sexy pose when it’s all over. This Neo Geo game makes war seem pretty dang fantastic.  Videogame plots exist to give the most paper-thin reasoning behind why you should kill everyone. Some guy points you in the general direction of the bad guys, hands you the biggest gun and sends you on your merry way. To be more specific: The Bloody Scorpions are a terrorist organization, and they have captured a neurologist and his grand-daughter, in the hopes that they’ll create a drug that mutates regular people into invincible super-soldiers. In Operation “Delta Storm”, the eight members of Vulcan Team must make their way to the enemy base, and destroy everything. You didn’t really need to know all that did you? Just pick a route, go through seven stages, and... destroy everything.  The game gives you the option to go it alone like a wolf or as a three member team… like a pack of wolves. Either way you have one life* to work with, and each life is backed by a health bar that can take between 8 and 12 hits. Each of the eight playable characters has their own speed, defense, weapon and bomb ratings. To be honest, I’m an incredibly shallow person, so my team consists of the three ladies of Shock Troopers:    Milky – The token buxom blonde has this codename for a good reason. She loves Milky Way candy bars. What? Were you thinking of something else? How naughty…   Marie Bee – Every game requires a German badass/sweetheart. Her fiancé was killed by the Bloody Scorpions so you can imagine that she’s not too fond of them. Her weapon of choice is a Steyr AUG. This bit of trivia is meaningless in the actual game due to most assault rifles behaving the same but whatever, I’m an AUG fan.   Big Mama – This is one lady you wouldn’t want to cross. Well you wouldn’t want to cross either of the other two, but Big Mama? She punches people so hard all of their organs fail at the same time. She’s basically a character from Fist of the North Star, except somebody gave her a gun. Thankfully she prefers saving lives over taking them.   If you’ve ever played a  Metal Slug  game then you’ll find that Bloody Scorpions make for quite the familiar antagonists. They stick to wearing ski-masks and somehow become endearing through their antics and well-animated deaths. It’s one thing just to take a few bullets and slump to the ground but these guys go the extra mile by losing arms, taking bullets in the knee-caps, exploding, and doing everything in their power to make their deaths satisfying to you, the player. They also commandeer vehicles and weapon emplacements, which also tend to explode when you put enough bullets into them. These guys also do what they can to defend themselves, using guns, knives, and whatever they happen to be lugging around. Still when just one of your soldiers is billed as a one-man (or woman) army you’re pretty much expected to mow them down singlehandedly. At the end of each stage you can expect a boss-fight. The generals of the Bloody Scorpions tend to get the nicest vehicles and after so many stages will take the fight to you on foot.  Running riot on this battlefield is as simple as turning one’s palm. Shock Troopers works in a manner similar to the classic Capcom title  Mercs . By tapping the fire button you can move and fire in any direction, while holding the button allows you to strafe. The dodge-roll is an amazing technique since you’re completely invulnerable for a brief moment. Just be sure not to dodge-roll into danger. As with similar games the enemy loves to leave random weapons lying around for you to take advantage of. These guns have limited ammo and run the gamut of spreadshots, heavy machine guns, rocket launchers, and what looks like the freaking Cobra gun from  Robocop .  Unique to this game is the mechanics of the close-range attack. This is performed by getting close and attacking, if you kill an enemy with this move they will drop bonus point items or power-ups. It’s somehow more rewarding to be able to look into the enemies’ eyes while you take their life away. More likely however it’s because getting the close-range kills is much more difficult. If you mess up you’re going to eat a bullet. This technique is difficult to master but can be very rewarding, especially because a boss taken out with a punch can drop an incredibly useful medkit.  As far as concerns the game itself, Shock Troopers is one of the better overhead run’n’guns I’ve played. It is a bit on the easy side if you play it safe — even in just a couple hours of play I’ve already come somewhat close to beating the game without continuing. Still, if you think about it, I have a ways to go. I’ve come nowhere close to beating the game without taking damage. Aside from the challenge ahead, the game also offers multiple paths, five other playable characters and cooperative play. All in all, I highly recommend that you check this game out.  *This version of  Shock Troopers  is version A. There's a second version (known as B) that makes the player-character take more damage, but they have three lives to work with. This adds a strategic element to the team-mode, since each member has a separate life-meter. The Playstation Network edition (available on PS3) is version B. In my opinion, B is the way to go, but it's not available on Steam. Hopefully Dotemu looks into this omission, along with the online/sound issues that tend to crop up in these SNK releases.",
            "review_score": "1"
        },
        {
            "review_text": "Super bloody cool!",
            "review_score": "1"
        },
        {
            "review_text": "This port is ♥♥♥♥ing abysmal. The controls don't work, it lags, my character flat out won't move at times, and the menus and UI suck ( I CAN'T TELL WHAT IM SELECTING HALF THE TIME). Emulate this game. Get MAME or some ♥♥♥♥, idk.",
            "review_score": "-1"
        }
    ]
}