{
    "app_id": 366250,
    "name": "METAL SLUG",
    "release_date": "2015-06-25",
    "developer": [
        "DotEmu"
    ],
    "publisher": [
        "SNK CORPORATION"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Arcade",
        "2D"
    ],
    "achievements": 15,
    "positive_ratings": 1169,
    "negative_ratings": 128,
    "price": 5.59,
    "description": "“METAL SLUG ”, the very first title in SNK’s legendary 2D run &amp; gun action shooting game series where all began, returns to the missions on the Steam gaming platform!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/366250/header.jpg?t=1483595362",
    "minimum_requirements": "OS: Windows Vista, 7, 8 Processor: Pentium 4 2.4Ghz Memory: 1 GB RAM Graphics: Intel HD Graphics DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows Vista, 7, 8 Processor: 2 GHz Dual Core Memory: 2 GB RAM Graphics: NVIDIA GeForce GT 640 DirectX: Version 9.0c Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "Metal Slug is a rarity. This is one of those once-in-a-forever franchises that'll never be duplicated, perfectly cloned, or perhaps even improved upon. To accurately explain just how unique this series is, I have to start with Nazca Corporation. As you might already know, Nazca developed the first four* Metal Slug games. Before they started work on the Neo Geo, they were originally a part of Irem.   A number of Irem titles have a unique style of pixel-graphics. Aside from making for highly-detailed sprites, backgrounds, and effects, this technique allows for a lot of manipulation. So when you see a wall crumble, a ship explode, or an enemy get torn to ribbons, you can actually see the pixels pull away from each other. It's difficult to describe, but it looks incredible in motion and lends a lot of flavor to the action. Some examples that immediately come to mind are  R-Type 2 ,  Undercover Cops , and  Geo Storm  aka  Gun Force 2 .  Metal Slug is a showcase for Nazca's pixel-wizardry. Not only does each stage look incredible, but the game goes above and beyond in terms of personality. Every character in the game is loaded with animations and creativity, most notably the enemy soldier. This is the most common foe in the series, and Nazca put more effort into making these adversaries more memorable than entire games. These games also perfectly blend humor and violence, At no point does the tone ever shift to a point where the player starts feeling uncomfortable. Although, the designers do know when to play around with emotions, such as when a destroyed enemy helicopter drops a letter. Sure it's just bonus points to you, but for that soldier, it was probably a letter from a loved-one. It was still sealed, so maybe he was going to read it after the battle.  All of this would be irrelevant if the actual games weren't any good. Needless to say, this isn't the case. Metal Slug is a master-class in Run &amp; Gun game-design. The controls are loose enough so that you can freely rush through enemy territory, but they're also subdued and accurate for when you need to prioritize survival over everything. Like most other shooters, the heroes of MS die in one hit. Being able to shift between situations of wildly varying intensity is massively important. Nazca accomplishes this goal via one running speed, mid-air controllable jumps, grenades, and the ability to shoot in multiple directions. In these games (aside from later post-Nazca entries) there aren't any special moves like slides, dodge-rolls, or parries. You have to read every moment, consider every possibility, and make the movements that keep you out of danger.   The phrase 'doing a lot with very little' is one I just love to throw around, and it definitely applies to Metal Slug 1. This is a short game, and it doesn't have the enemy and stage variety of its sequels. However, this game has enough presence of mind to play with ideas, employ the same foes in different fashion, and create moments that remain exciting even on replays. The tight mechanices and game-design allow you plenty of room to focus on improving. Every time you die, you'll know exactly how it happened, and you can quickly mull over where it all went wrong, in the brief seconds before your next life appears on-screen.   Metal Slug also establishes a lot of the rules of the series. Not only do the heroes die in a single hit, but there aren't any extra lives. In fact, since all POWs are lost upon death, you pretty much have to adopt a '1-life' mindset if you're playing for score. In arcade games, we tend to look at lives as resources. I know when I reach the final boss of a 2D shooter, I do an inventory of all of the lives &amp; bombs in-stock. I know what I can afford to expend, in order to guarantee that clear. This approach simply doesn't work for Metal Slug. These three lives represent three chances, you have to protect them...well..like they're your own. Obviously that's extremely difficult due to the armies you have to contend with, but over-time you work everything out.  Honestly though, even if you approach this series with the mindset of 'I don't want to worry about 1CCs, 1LCs, or any of that other stuff' you can still have a lot of fun. The moment-to-moment combat is just so visceral it's a reward in itself when heavy-machinegun fire chews through half a dozen soldiers, or a shotgun blast rends a tank into nothingness. Simply playing these games, without a specific goal in mind, is just flat-out glorious entertainment.   While it's easy to say that the sequels are better, there's a level of simplicity and charm that absolutely fits Metal Slug 1. Feel free to revisit it whenever you have the opportunity. Oh but just one thing, while I have all the praise in the world for these games, I don't have anything nice to say about Dotemu.  *I count Metal Slug X as a separate entry.",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't reccomend a purchase of Metal Slug as it is in this incarnation.  It's a shoddy port which has been wheeled out to tap the nostalgia viens that run through the folks who really enjoy Metal Slug as a series.  The gameplay is sluggish (no pun intended), the musical instruments stutter, jerk, and clump together making the music sound out of time, there is nothing in the way of extras (such as the fantastic concept art which HAS been released in previous, more accurate ports).  I'm hesitant to say it's not worth your cash but know this before you buy - You are not getting anything other than a barebones, unoptimised and fundamentally graceless version of one of the best arcade shooters of the 90s.",
            "review_score": "-1"
        },
        {
            "review_text": "Metal Slug is one of my favorite games. This is my least favorite version that I've played. I can't believe how choppy and crappy this game runs on my modern PC. It ran perfectly ten years ago on an emulator on WinXP. I had reservations before I purchased this game, since I can just keep playing all of Metal Slug games for free, and now I have regret for my purchase. If you emulate this on MAME you have way more configuration options, and it will run better. Get this game for the trading cards and achievements, or if you don't know what emualtion is.",
            "review_score": "-1"
        },
        {
            "review_text": "One reason: poor controller support. it. is. soooo. bad.",
            "review_score": "-1"
        },
        {
            "review_text": "What an awesome game, a $1.99 for a game I probably spent over a hundred bucks pumping quarters in at the arcade. Took me months to beat it at the arcade, and only about 60 mins to complete on pc.  Looks great on a 1920X1080p resolution instead of a scratched 800X600 plastic screen Lots of replayability, the game is hard even on easy difficulty Online leaderboards, pretty nifty  Felt sorta weird no friend on the side bumping arms and screaming about dying, no lines of people waiting for the next turn, and playing with a controller was abit odd but worked out pretty well.  No cons for this one, nostalgia has a firm grip",
            "review_score": "1"
        },
        {
            "review_text": "It's freakin' Metal Slug what do you want. When you get down to it, it's like the arcade version of Metal Slug with some extra features, online leaderboards, etc. If you're only a casual MS fan, like me, you'll get the most fun out of this by getting a friend, and two controllers, and powering through the game on as few credits as you can, appreciating the great pixel art and ridiculousness of the whole scenario. My brother and I had a lot of fun trying to figure out if we were in Germany or Cuba or Vietnam and what the game was even trying to be. It's a solid arcade shooter with those obligatory token taker levels, and that's just fine by me.",
            "review_score": "1"
        },
        {
            "review_text": "A REALLY GOOD RETRO GAME! :)  I remember playing Metal Slug in an Arcade when I was a kid. My parents don't have enough cash back then to buy me a Playstation 1 so they bring me to arcades every weekend. And sometimes my friendly neighbor invites me to their house just to play Metal Slug and other PS1 games.  Now that I have work to sustain my Gaming Lifestyle I wanted to buy the games I couldn't own/play when I was a kid. Good thing Steam has Metal Slug! When the Franchise went to sale I immediately bought them.  I was very happy and satisfied! :) The game is good on PC! But I need to buy a PC Gaming Controller to play this because it is much easier to use a controller instead of Keyboard and Mouse and it also adds to the nostalgic feeling :) Steam also added an Achievement System to add some challenge and I only need 2 more to 'Perfect'this game :)  I can't beat the game without dying xD And also the Multiplayer Achievement... -_-  Yeah even though I'm already an adult I still can't master the game! :D Although I already finished the game without spending enough hours to receive all card drops -_- ",
            "review_score": "1"
        },
        {
            "review_text": "It's Metal Slug. The original. it runs fine. I still don't like how DotEmu has the Autofire set higher than arcade autofire options and I'm not 100% everything is pixel perfect but the game is there, and it's still such an excellent game. The worst Metal Slug is better than the best Contra and this is far, far from the worst Metal Slug.",
            "review_score": "1"
        },
        {
            "review_text": "Hold X and keep going foward to kill all your enemies 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, but unfortunately kind of a shoddy port. Or at least I do not remember there being this much slowdown in the wii version of metal slugh anthology, OR the arcade versions.  I might be misremembering.   The sound quality is also weird. Like in the other DotEmu metal slug ports, it seems to get desynchronized and then speeding uyp to compensate. That is quite annoying since Metal Slug is a series with fantastic sound design and that takes me out of it.  Fantastic gameplay, but it IS quite unfir. With good reason, too, since this was made as a token taker arcade. Still, not the best in the metal slug series (that is probably tied for me between X and 3, even though 3 does get overlong and too hard in the last levels).  All in all, not the best way to experience Meal Slug, but very worth getting even with the dotEmu port issues.",
            "review_score": "1"
        },
        {
            "review_text": "Still as good as the arcade.",
            "review_score": "1"
        },
        {
            "review_text": "I just got the bundle with 5 SNK games and ALL of them no exception, runs really really BAD. Sound is weird and it so slow that is like unplayable. Seriously install MAME install all the ROMS and be happy. Keep away from this bad ports!",
            "review_score": "-1"
        },
        {
            "review_text": "the first metal slug game thats starts it all back in 1996 and still popular till now .",
            "review_score": "1"
        },
        {
            "review_text": "Controls are sloppy. It simply doesn't play well enough to do what's expected of you in game. Be read to die A LOT, because your guy didn't jump when you pressed the button or wouldn't turn the f*ck around to shoot something coming at you from the other direction. This goes for all these METAL SLUG games. I bought the pack on a steam deal and they all play like crap.",
            "review_score": "-1"
        },
        {
            "review_text": "my childhood i was play this game on PS 1, and i miss it, i hope they can port all serial Metal Slug on PC and Steam, sure i will buy all",
            "review_score": "1"
        },
        {
            "review_text": "It's Metal Slug, but on Steam with online co-op. A pretty satisfying game to play with friends, even if the sequels (well, except for 4 and very maybe 7) are far superior.  It's not the best port (although way better than the Saturn/PS1 ports), I've definitely ran into some emulation issues, but still worth a look if you love the 'run 'n' gun' genre.",
            "review_score": "1"
        },
        {
            "review_text": "Read through the negative Reviews after i bought the MS-Bundle. Yes, there is some slowdown in this version of the game, but it's still way better than the digital version for the Wii. Technical it's still okay and fun to play. i'm playing on an average i5 and a GTX760 (average Game-gear for todays standart) and i got no problems that i really have to care about. Controller Support: I played Metal Slug now with a common Xbox-Controller which i solely bought for PC and it worked plug'n'play. No dump settings, pop controller in, start game, readjust Controls (if necessary) and on goes the party. People complaining about horrific Controller Support shouldn't buy bad Gamepads ;)  Total: Good game, above-average port, bought it on sale for about 7€ for the MS1-3-Bundle, good Controller Support = having fun with it and do not regret spending those few bucks on it :)  So: If you like retro-Contra-Style Shoot'em'ups -&gt; Get this one if you didn't have it",
            "review_score": "1"
        },
        {
            "review_text": "This is 'A' GAME :D:D",
            "review_score": "1"
        },
        {
            "review_text": "What to say... this is simply one of the best game ever made, never getting old, always good to play with a friends or to spend 30 min. of fun on your own. the feels!!  Vote: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended - not much difference in graphics however you get online gaming and multiplayer ( not many players online though ) !",
            "review_score": "1"
        },
        {
            "review_text": "God, I love these games. It's everything you expect from a classic arcade, run-gun quarter♥♥♥♥♥♥♥. The game seems to have been ported pretty well, at least for single player, but the menu's are a mess, local multiplayer didn't accept 2 controllers on my PC or quite simply didn't work AT ALL. These seem to be emulation issues that could easily have been caught in any half-competent QA-division, but then again the entire menu UI and the design of its backgrounds is about as low-budget as they come. At least it's not going to take you a couple dozen quarters to get through the game like with an arcade cabinet! This first game in the series focuses on the battle against Gal. Donald Morden (thank you trading cards for revealing his name to me) and his army of faux-nazis, but also expect wacky mechs, tanks, planes and other vehicles, as well as mummies.",
            "review_score": "1"
        },
        {
            "review_text": "Great game in the arcade great game on steam. I have had this game on psp ps2 psv and now steam love this game. I think its arcade perfect. I get slow down but I have gotten the same slow down on all versions. recomended. Got it on sale :)",
            "review_score": "1"
        },
        {
            "review_text": "Classic game not to be overlooked despite all its sequels. It has a great ending sequence, excellent art, and a perfect soundtrack. It also sticks out in the Metal Slug series for not being all about aliens and the like with more of a WW2-art feel to it.   Fun to play, do achievements, and has CO-OP both offline and online from what I recall. Pick it up, OK? OK.",
            "review_score": "1"
        },
        {
            "review_text": "The game that started it all. Based mostly on the Humble SNK Bundle (DRM-free) release of Metal Slug, so don't take my Steam stats too seriously.  To understand Metal Slug's place in gaming history, ya gotta travel back to the mid 1990s, when SNK rivaled Capcom in the arcades. In my late-teens and early twenties, I'd find myself bored at the local laundromat in St. Pete, Florida. To aleviate said boredom, it was a Neo Geo arcade machine to the rescue. Aside from Capcom's 2D fighting game offerings, there was SNK's multi-game cabinets featuring King of Fighters, Fatal Fury, Samurai Showdown, and...Metal Slug.  While consoles had the likes of Contra and Gunstar Heroes, the 2D side-scrolling shooter king of the arcades was Metal Slug. While Metal Slug's action was on par with Contra III (SNES) and Gunstar Heroes (Sega), it's artwork was iconic. At home Gunstar Heroes kept my ol' Sega Genesis arockin'. In the Neo Geo multigame arcade cabinets I grew to admire Metal Slug.  Fast forward to 2016, when Steam carries Metal Slug 1, 2, 3, and X. Most of these games have been ported to every platform from the Sony PlayStation to the PS2 to the GameBoy Advance to XBLA to Nintendo's Virtual Console to the Android App Store. With the Steam release featuring Achievements, Leaderboards, multiplayer, co-op, cloud saving and XInput gamepad support, there's no reason to not own Metal Slug.",
            "review_score": "1"
        }
    ]
}