{
    "app_id": 366320,
    "name": "Seasons after Fall",
    "release_date": "2016-09-02",
    "developer": [
        "Swing Swing Submarine"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Platformer"
    ],
    "achievements": 21,
    "positive_ratings": 1411,
    "negative_ratings": 317,
    "price": 11.99,
    "description": "Seasons After Fall is a 2D platform-puzzler game that will let you dive into a captivating universe and explore a land governed by magic and nature.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/366320/header.jpg?t=1476102548",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: Intel Core 2 Duo E4500 (2.2GHz)/AMD Athlon 64 X2 5600+ (2.8GHz) Memory: 4 GB RAM Graphics: 1 GB, DirectX 11, AMD Radeon HD 6750/NVIDIA GeForce GT 640 DirectX: Version 11 Storage: 4 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Beautiful, magical and completely enchanting!! I know, I know...I'm kinda late with my review, but this game is soooo beautiful. Just watch the trailer. If you like what you see or are a fan of artsy games then this is the one to get. Gameplaywise it is kind of metroid-vania style exploration and revisiting of areas. You control a fox that can only do fox things, that is run jump and bark. Changing seasons after unlocking them is more of an outside effect and only affects the environment. Speaking of the environments, they are beautifully drawn and change quite in traversabillity by changing seasons. While the environmental puzzles are kind of straight forward and easy, except for the one that got me stuck for quite a while, it is a highly enjoyable experience and a true feast for the eyes.  I really fell in love with the trailer, when I first laid eyes on it and I really enjoyed my time with Seasons after Fall. For me it's simply the best graphics of 2016 and was worth definitely worth the price I payed at launch!!",
            "review_score": "1"
        },
        {
            "review_text": "Wondrous, marvellous, beautiful, stunning game, Season After Fall is purely love for videogames. Probably the best graphic and sound I've ever encounter in a indie product, this is a metroidvania 'light' with smart puzzles and no enemey to fight. A splendid fairy story written nicety.   I've over 1100 games, this is the first one I completed at 100 per cent.",
            "review_score": "1"
        },
        {
            "review_text": "Visually stunning puzzle platformer",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes you find one of those games that turn out to be little gems. This is one of them. What first attracted me to this game was the artwork and soundtrack. And that is exactly what makes this game so beautiful and charming. But not only that makes it worth it. There were these little moment that made this game so good: the way your fox moves, jumps and barkes, but also the way the fox behaves if you are standing still for a while (for lack of a better word, the fox gets impatient and paws the ground in an adorable way). This shows how much passion the developers put into this game and that's why I gaive this a big thumbs up.  So, in conclusion, if you like puzzle games with a nice story, amazing design and accompanying music, you should buy this one.",
            "review_score": "1"
        },
        {
            "review_text": "warning! if you look for gameplay, keep looking this game doesn't provide anything to fill your needs. But I will still recomand this because most of my friends would probably like to play this at one time.  This is a pretty game, this is a pretty game. That is it! That is all you need to know. The platforming is okay but turning feels kinda stiff. They mock the fox at first for not being as sly and quick as a wolf but I gues that the creators just love foxes and tried not to make this a 'long life the fox' statement. But the protagonists realise that the fox is the best thing that ever came in exsistens!. Also very enjoyable is the changing of the season feature. But here I have something to say. They really nailed the spring, and I absolutly hate spring because it just looks like ♥♥♥♥ all the time, it is cold like winter but with no snow and no leafs. But they where going for a more literature kind of spring with a bit of rain on the side. But the atumn on the other hand looks disgustingly brown. I know it is brown but there are still greens and there is more than one orange brown.   But I can't recommand buying this game today. Because it has some really weird performance issues. For some reason I only gt a maximum of 45 fps. Which for some reason doesn't seem to work very well on my 60hz display. I can't focus on the background while moving so half of th games joy is destroys. I have 3 cards in my PC including 2 gtx 1070 and I cannot run it with 60 fps. Something is really ♥♥♥♥ed up here.",
            "review_score": "1"
        },
        {
            "review_text": "A ridiculously pretty and well polished puzzle platformer with lovely music and audio work and exciting mechanics. It's obvious a LOT of work went into this, and it really shows. I'd say get this in a heartbeat.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice beautiful game and loved the season change mechanic. It was really something. Didn't like the Sirocco stone puzzle. Kept falling down from the moving stones when changing the seasons. But I guess that just added to the difficulty so I can't exactly complain. All in all a really good experience. The storybook styled art was a really nice touch.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly beautiful, and it's worth it. This one has a narrative, the meaning of art, relaxing landscapes, and wonderful graphics for us to enjoy playing. To anyone who is looking for a great, calm, relaxing game, then this is the one you're looking for. Give this a try, You would not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "a really relaxing game with a good story and memerable characters. Beautifull soundtrack and visuals is what makes this platform standout. Reminds me of ori and the blind forest but without the fighting",
            "review_score": "1"
        },
        {
            "review_text": "Seasons after Fall is pretty as all hell. Its environments are beautifully rendered and the animation is mostly smooth. That said, I can't recommend this game in good conscience because of the ridiculously glitchy state the developers have released it in. You will (there is no maybe) find yourself falling through the scenery because the game hasn't loaded properly, or find yourself stuck in the scenery.  There is a KNOWN PROBLEM THAT HAS NOT BEEN FIXED with a particular section in the summer part where after you have destroyed an obstacle, it can take upwards of thirty tries and thirty minutes to get it to recognise said obstacle is gone and allow your fox to grab onto the ledge. Given that you have to use this ledge at least twice, this becomes a rage inducing nightmare which has had nothing done about it. Add in the controls, which are looser and even less responsive than Ape Escape for PS1 (if you've played that you know what I'm on about), and the actual gameplay is a mess.   Stick with Ori and the Blind Forest.",
            "review_score": "-1"
        },
        {
            "review_text": "beautiful game,  with nice gameplay,  and atmospheric soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "  At it's core Seasons After Fall is a puzzle platformer that utilizes its' season changing mechanics to distinguish itself from most other puzzle platformers.  While the game is a puzzle platformer, the game is more of a puzzle game than a platformer in my opinion. The platforming is mostly just jumping between platforms to get to the next area. There really aren't any tough jumps where you need good timing. This is a good thing since the controls aren't as responsive as I would have liked but that isn't a huge issue since you don't really have to make any tough jumps.   The puzzle elements of the game are pretty good overall. The early game is a little on the easy side but overall the game's puzzles are moderately challenging. The game does a good job using the season changing mechanics to create some interesting puzzles that require you to regularly change the seasons.   The game's presentation is also really good. The graphics are gorgeous and really add to the atmosphere. The game's soundtrack and voicework are also really well done.   Overall I really enjoyed Seasons After Fall but I had one issue with the game. The game has quite a bit of backtracking. You actually have to visit each area of the game three different times using new abilities that you have acquired to reach new areas. The bigger problem though is that the game sometimes doesn't give you enough direction on what you are supposed to do next so you will likely waste some time running around trying to figure out what you are supposed to do next. It doesn't help that the game doesn't have a map so you can get lost at times.  While the lack of direction can get annoying at times, it doesn't ruin the game. Seasons After Fall is still a really good puzzle platformer. If the concept interests you at all and you like puzzle platformers I would highly recommend picking up Seasons After Fall.  If you would like to read my full review you can read it at   Geeky Hobbies   [www.geekyhobbies.com] .",
            "review_score": "1"
        },
        {
            "review_text": "  Beautiful graphics, and a creative twist on the puzzle platformer genre. ALSO THE FOX IS SO CUTE AOSFJKOIDSHGOG",
            "review_score": "1"
        },
        {
            "review_text": "In this world, what's the diffrence between eternal or inferno? The dreams and truth, what if the seed was right?",
            "review_score": "1"
        },
        {
            "review_text": "The art/graphics are amazing and i like the season changing mechanic this game is good what more to say",
            "review_score": "1"
        },
        {
            "review_text": "Very good looking game, relaxing, but traveling the world without map is annoying. Puzzles are very repetitive and sometimes you just walking around and don't know what to do.",
            "review_score": "-1"
        },
        {
            "review_text": "scrolling backgrounds are a little to crazy. watch out for motion sickness",
            "review_score": "-1"
        },
        {
            "review_text": "An Amazing adventure! I really enjoyed this little games artstyle, story, and characters. Prebuying this game was a really good idea for me because I 100%ed the game the very next day it came out. I have never felt so alive after playing such artistic games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet and beautiful. Visuals alone make it a must-buy.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really a good platformer/reflexion game with a very poetic feeling. It's a must have :)",
            "review_score": "1"
        },
        {
            "review_text": "Main story finished in 7 hours, still a few things to hunt.  Season After Fall is a really nice game, excellent art and music as well as a carefull attention to small details. Each area looks different and change during the whole lengh of the game.  It's a puzzle plateformer, and while I think the gameplay is less efficient than SwingSwing Submarine last game (Tetrobot and Co, play it, it's a masterpiece in puzzle games), it's still a very enjoyable experience. A very unique game, taking it's roots from early Nintendo games.   Sometimes it's just magic, you'll stop and listen the beautiful music while looking at the handcrafted levels, full of colors.   Side note : even if Season's After fall is probably not a game for a young child (less than 10) alone (some puzzles are tricky), I think it could be a wonderfull experience if you want a game to play WITH him. The story and the tone is perfect for that.   Go ahead, it's a great title !",
            "review_score": "1"
        },
        {
            "review_text": "The game was super fun !... until the last puzzle with the insects. Very frustrating, the platforms are soooo slow. I still recommend the game but... yeah, it kind of killed my experience and i don't think i will finish this.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, reminescent of Ori and the Blind Forest, or Child of Light. Perhaps not as complex as those, but with an artistic flair. Some of the puzzles were actually a bit challenging to figure out, which is a refreshing change for modern games.",
            "review_score": "1"
        },
        {
            "review_text": "worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "  Seasons after Fall is a relaxing platformer with a short but sweet story, a great visual design and beautiful classical music.  This game is all about the exploration of the world. On your search for the Guardians of the Seasons, you have to travel through 4 big areas (each with a few sub-areas). Using a season changing mechanic, you have to solve different puzzles and pass platforming segments. When you have unlocked new powers, you can revisit an area to further explore it.  Apart from a tricky puzzle near the end and searching some secrets, the game never gets very hard. There are no enemies and you can't die. The worst that can happen is missing a jump and having to pass a platforming segment again. On the one hand, this makes it easy to just lean back and enjoy the world and music. On the other hand, you may get bored if you're looking for a challenge.  The controls are a bit slippery, you will miss some jumps, but you get used to it pretty quickly. In the ~5 hours it took me to 100% the game, I ran into a small bug twice where I couldn't interact with an object. Quickly leaving and reentering the area or just quitting to title and reloading the save fixed it and I could continue.  A friend gifted me this game. I was going to buy it soon, though. After finishing it this quickly, I'm not sure it's worth the full 15€, but I definitely would pay ~10€ on sale.  Pros: + Sweet, fairytale-like story + Beautiful graphics + Great classical music + Relaxing gameplay  Cons: - Very short (~5 hours to 100% for me) - Way too easy if you're looking for a challenge - Some small bugs - Controls a bit slippery",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game, with good soundtrack, adventure, controls and adventure strategy. I really recommend this one :)",
            "review_score": "1"
        },
        {
            "review_text": "RUN RUN YIP YAP! ^ -^ Little foxy! This game is a fun little puzzle, very relaxing to play.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a very enjoyable experience thanks to its thoughtful artwork and gorgeous music. Compared to other platformers, the world isn't large and confusing and you will usually have a rough idea of where you need to go. The controls are simple enough and the puzzles aren't terribly difficult. I occasionally got stumped but I figured it out eventually.   As far as story, don't be fooled by chipper, cheerful narrator at the beginning. It's not all sunshine and cinnamon buns—the story becomes more serious and dramatic after the first few hours; I definitely wanted to know what was going to happen next. (The voice acting is believable and well done, too. It also breaks up the monotony and drives you forward at times. I feel it fits without being distracting.)  For people looking for a casual, artful experience, this is definitely your game. If you are looking for a game with a Health bar, enemies to fight, extra lives and a skill tree you won't find it here. The appeal of this game is playing a lonely fox as it runs around the forest solving puzzles in a tastefully artful environment.",
            "review_score": "1"
        },
        {
            "review_text": "Seasons After Fall is not only a breathtakingly beautiful game with calming music and an awesome basic concept, but also geniously composed. The puzzles're quite challanging, but never impossibe - it's such a good feeling, while getting familiar with the suitable and creative powers of the seasons and slowly realizing the solution (with the cutest protagonist ever). I would definetely recommend it, with all of my heart.",
            "review_score": "1"
        },
        {
            "review_text": "Just didn't hit hard or fast from the start. Feels like an over-narrated, no-brainer puzzle platformer with way too much running space between obstacles. I get Ori and the Blind Forest meets Oracle of Seasons, but the execution just feels far too soft.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very pretty, but that's about all it had going for it. It feels like they spent SO much time focusing on the art, that they just neglected the rest of the game. The controls are very stiff and clunky. And, as an example of focusing too much on art, you can't just turn around and start moving. There's an animation for your fox to turn 180 degrees and you need to wait for the animation to finish before you can execute another command like jumping. The music was pretty when it was actually present, but a lot of the game was just atmospherc noise or silence. The story felt extremely neglected, and the game itself felt like it was missing essential mechanics like a map or a better indication of what you should be trying to accomplish. Overall I was very disappointed with this game and ended up refunding it. There are better platformers that are equally pretty like Ori and the Blind Forest.",
            "review_score": "-1"
        }
    ]
}