{
    "app_id": 366700,
    "name": "Breakout Invaders",
    "release_date": "2015-04-24",
    "developer": [
        "DreamsSoftGames"
    ],
    "publisher": [
        "DreamsSoftGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 29,
    "negative_ratings": 29,
    "price": 2.79,
    "description": "&quot;Breakout Invaders&quot; is a fun fusion between two classic game genres: &quot;Breakout&quot; and &quot;Space Invaders&quot;.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/366700/header.jpg?t=1447373422",
    "minimum_requirements": "OS: XP Processor: Pentium IV Memory: 1 GB RAM Graphics: DirectX 7 compatible graphics card with 1 GB memory DirectX: Version 7.0 Network: Broadband Internet connection Storage: 180 MB available space Sound Card: 16 bits",
    "recommended_requirements": "OS: Windows 7 Processor: Corei5 Memory: 4 GB RAM Graphics: DirectX 9 compatible graphics card with 4 GB memory DirectX: Version 9.0 Network: Broadband Internet connection Storage: 180 MB available space Sound Card: 16 bits",
    "reviews": [
        {
            "review_text": "Not sure why this game reached mostly negative.   This game is pretty darn fun. I like breakout clones and this one is up there on my list. Add in the fact there's nearly one hundred levels and you've got one hell of a game. It's challening, sure. Is it perfect? No. But if you're a true arcade game lover, you'll see the genius and creativity in combining two of the best games of all time.  10/10. Would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "Instead of writing a review pointing out of all the things Breakout Invaders should of done better. I'll just get to the point.  Breakout Invaders is a great concept that is poorly executed. The game just isn't fun to play, and you'd be better off sitting down and playing the original Breakout or Space Invaders. Both games still hold up and are better than this hybrid.",
            "review_score": "-1"
        },
        {
            "review_text": "I did a single game and got quite bored... Normal levels are your usual breakout level in 3D... The 3D view makes thing a little bit weird and prevent to see the ball(s) on numerous occasion. Because of the perspective, the distance between the brick and the player looks really small... it is OK because the ball(s) go(es) generally slow and that makes the game a little bit borring. Then comes the levels that includes space invaders and that is where you start losing life quickly due to some impossible multitasking and the bricks being extremely closed to the player make the level even harder to play. The game play should probably review...   The game suffers also of poor development (it looks like a game make by a team of one or two people - no offense to indie development), the game took for ever to load on my 16 gb computer, the graphism are not great either and the music is quite too repetitive..   So for the price it might be OK to risk or to get through some bundle (thanks groupees... I think), but don't expect the greatest game.",
            "review_score": "-1"
        }
    ]
}