{
    "app_id": 366960,
    "name": "SECTOR",
    "release_date": "2015-06-29",
    "developer": [
        "UD"
    ],
    "publisher": [
        "UD"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 22,
    "negative_ratings": 84,
    "price": 0.0,
    "description": "SECTOR is a simple hardcore classic shooter game that you play the role of Dimitri, he and ​​another scientists made fail biological tests and the infected enemies took possesion of technology evolution. Survive at this severe place, fighting against creatures and solving problems, now you need to place the order.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/366960/header.jpg?t=1468887547",
    "minimum_requirements": "OS: 2000/XP/Vista Processor: PIII 1GHz Memory: 512 MB RAM Graphics: Direct X9.0c compatible with 64Mb memory DirectX: Version 9.0c Storage: 700 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Worse than imagined.  -Limited engine -Piece of junk -Worse than E.T Game on atari -I Played it and later left it in my steam libary  EVEN ON FREE TO PLAY IT SUCKS!  DEVELOPERS SHOULD ADD A PATCH OR I WILL DO IT FOR YOU.",
            "review_score": "-1"
        },
        {
            "review_text": "Sector was made using software called FPS Creator. I use this software to make games aswell. there isnt much you can do about crappy graphics, but if you put time and effort into a project you can make some fun games. unfortunately this game was made by someone who didnt know what they were doing. the game is broken, you cant get past a locked door that either has no key, or was accidentally locked by the developer. atleast its free, though honestly it waould be a watse of hard drive space.",
            "review_score": "-1"
        },
        {
            "review_text": "My story: I was looking through Greenlight and found a game called SECTOR. It looked promising enough, they CLAIMED it was a simple HARDCORE shooter, and I kinda wanted to play, then I checked the store, and there it was. Completely free of charge. I heard it used to be a lot of money, but for a game like this, I thought free was a blessing! Then looking t the reviews, I thought, 'These guys must be crazy! It's like saying that Adam Sandler's Eight Crazy Nights was bad, and it wasn't, at least in MY opinion (plz don't flame for having different thoughts). I decided to try it, and boy, did I have fun.  I just loved the fact that I couldn't change my controls (escpecially since the 'use' button was ENTER, ENTEEAAAR, WHERE YOU HAVE TO LIFT YOUR LEFT OR RIGHT HAND (FROM WASD OR THE MOUSE) IN ORDER TO ACTUALLY PRESS IT). I just loved that time where I had no idea where the first key was and I was searching for 15 minutes looking for it, then I finally found it completely blending in within the side of this pipe, I just loved that time where I died for no reason other than loading up my save. I thought it was a doozy for the 5th level to have a puzzle with some crates and barrels and make it impossible. At least until I saw this other review where the guy said he stacked 3 crates and spammed jump.  I'm not going to even BOTHER. But y'know what, I'll give the dev the benefit of a doubt and say that this is probably the first game this guy ever made (if not, then...well...), and at least it's better than Bubsy 3D, or Big Rigs: Over the Road Racing. But still, don't bother with this game.  Hey, at least I have this 'spot in my heart' for bad games like Sonic R, this game, and others, so I migth still play this, y'know, for novelty, at best.",
            "review_score": "-1"
        },
        {
            "review_text": "Where's the key?",
            "review_score": "-1"
        },
        {
            "review_text": "I played a little, finding the key in the first sector will be challenging, after that you unlock the pistol  +good  9/10 -I hate getting stuck in games in exception of point and click adventure games",
            "review_score": "1"
        },
        {
            "review_text": "'Deep in space a young pipe repair tech and his skeleton co-worker, davis, are just about to get off shift. cleaning up all hte strewberry jam from Davis' sandwiches, and rechecking the bad aumbiance lighting. The young pipe repair man starts to confidently walk back through the corridors to finally get some sleep. but what is this? davis, asleep at his post again. ahhh thats just like him. nothing more natraul than seeing a sleeping skeleton man. not that young pipe repair man is bone-ist.   He will let davis sleep it off, davis is married to three wives after all and knowing them he could use all the rest he could. the young pipe repair man walks back to the main office only to findd that the ship is under attack by pirates. shell shucks, thats simply unfortunate.   after ddistinigrating the poor maurading pirate, the young pipe repair man takes a quick jaunt to main office and talks to his old friend Taloc, the pasafist security guard. after shooting him a few times in the chest and them both having a good laugh over not being able to die, it is time to rest. young pipe repai man walk to his room where he finds davis already sleeping against the wall. and finally goes to bed.'  This is, as far as i can figure out, the exact story line from start to finish. there is nothing to suggest other wise. and i tried hard to find something.",
            "review_score": "-1"
        }
    ]
}