{
    "app_id": 367300,
    "name": "Pixel Star",
    "release_date": "2015-05-22",
    "developer": [
        "Soul Forge"
    ],
    "publisher": [
        "Soul Forge"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Space"
    ],
    "achievements": 17,
    "positive_ratings": 103,
    "negative_ratings": 14,
    "price": 2.09,
    "description": "Endless arcade action takes a modern twist, creating a uniquely challenging open space shoot-em-up experience. From brutal bosses to black holes and beyond, countless hazards await discovery. How long can you survive?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/367300/header.jpg?t=1453647022",
    "minimum_requirements": "OS: XP, Vista, Windows 7 Processor: 2.0 GHz Memory: 512 MB RAM Graphics: DirectX 9 compatible graphics card with 512MB of VRAM DirectX: Version 9.0c Storage: 8 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fast paced, simple, and fun, Pixel Star writes a love letter to the large old arcade machines like Asteroids while adding in quite a few dashes of modern flavor to keep things fresh and interesting.   No deep plots here, this is score attack and bragging rights at it's finest, coupled with enough modification options to the load out of your ship that everyone can find a style that matches them, and experiment with others without feeling overwhelmed.   Music builds with the difficulty curve, adding to the hectic laser flinging as the screen starts to fill with enemies when just moments before you were surrounded by a deceptive lack of anything not to mention the occasional bosses to break up any complacent cruising.   Random AI and a large selection of foes will also guarantee that each play-through is never the same, while matches don't tend to last too long, making this game a fine choice to pass a lunch-break as well.",
            "review_score": "1"
        },
        {
            "review_text": "unbelievably amazing. buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool retro flavoured game, that doesn't take itself too seriously.",
            "review_score": "1"
        },
        {
            "review_text": "A good game to play when you just feel like messing around. It's only 2.69, and it's the perfect game for anyone who's a fan of the arcade genre. Quite a treat for something so cheap!",
            "review_score": "1"
        },
        {
            "review_text": "ever feel the need of destroying things, this is a good game to do that in, but with challenge! it has a nice arcade feel and almost the classic astroids feel if anyone remembers that game! only this game is far better. start out with your little drones is something i would recommend if you are looking to stay alive. they have helped me countless times! also having so many out is just plain ridiculously amazing. this a real good game.",
            "review_score": "1"
        },
        {
            "review_text": "It's like fapping without lube.  Hard but possible.",
            "review_score": "1"
        },
        {
            "review_text": "3/10  Really not much here. It's an asteroid rip-off that even uses the same graphics and models of asteroids. You just fly around shooting asteroids and boring looking ships and then die, get a high score, lose everything and repeat. Theres no progression, or upgrades, or anything to make you better or make it easier. you can choose between a few different special weapons and abilities from the start. You use the same ship, fight the same guys, a boss shows up once in a while but doesn't stop anything, and then you die. The enemies sometimes just fly in super fast and run in you and you can't do anything, or shoot 5 different bullets all over and you cant dodge it. You get hurt and lose a life. There is no way to get more lives. Most of the pickups you get are boring restore of second weapon ammo and a shiel. you can get increased fire rate an a few other things, but those are pretty rare. It just gets boring and super repetitive. Theres nothing to encourage replayability besides high scores, but since this isnt 1970 anymore, id expect more than that. The game wants you to die and makes it a certainty. It's just if you're dumb/bored enough to stick around and keep playing the same little bit of content it offers over and over again. Thankfully I wasn't.",
            "review_score": "-1"
        }
    ]
}