{
    "app_id": 367600,
    "name": "Skyshine's BEDLAM",
    "release_date": "2015-09-16",
    "developer": [
        "Skyshine Games"
    ],
    "publisher": [
        "Versus Evil"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Turn-Based"
    ],
    "achievements": 21,
    "positive_ratings": 477,
    "negative_ratings": 303,
    "price": 14.99,
    "description": "BEDLAM is a strategic turn-based strategy game set in a post-apocalyptic wasteland. Now with more battle strategy!!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/367600/header.jpg?t=1545331755",
    "minimum_requirements": "OS: Windows XP SP3 Memory: 4 GB RAM Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows 7 SP1 Memory: 8 GB RAM Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "At this time I would advice most people to stay away from the game till it is balanced. The game starts out fun and enjoyable, but once you have a threat level higher than 50 you are looking at a mad rush to hope you dont get RNG'ed to insaninty. The game will throw you 7-8 AI to beat on an easy side mission area. Then you will have 3 AI on a main mission point.   The game balance is bad you get 4 slots to use for your team and you get power ups and special weapons to use, OH and the AI get it also but they dont lose the ability to use their 2 action moves after using the power ups like you do. This is a huge downer for the game. There are missions that the only way to win is use all your resorces that are not easy to come by.  The game really has no way of teaching you the smaller details on how to play or what the AI power ups do you get to find that out as you play and watch out some of the power ups are hard to see if they are active when there is a cluster of characters next to each other.  The controls are slugges. I have found when you are wanting to switch from one of your characters to another you need to make sure that the right character is selected before you move. There is no hot keys to switch and no way to rotate the cam to see when things are in the way.  This game could be good if the devs would be more active with the community and keep the game moving forward. The last update was 6 months ago, dont see any more coming any time soon. If you like games like this play FTL or Final Fantasy Tactics.",
            "review_score": "-1"
        },
        {
            "review_text": "Equal parts Mad Max and FTL mixed with old school grid/turn based combat, Bedlam is a game that is as punishing and harsh as the environment it represents but nonetheless provides a worthy challenge if you're a fan of the rogueishlike genre that is all the rage nowadays for indy devs.  I've only played it on normal and well... I don't know how many attempts is going to take me to finish it properly but based on that first attempt I don't think I'll make it anytime soon. If that sounds appealing to you get on this right away... at least during a sale. I got it for 90% off or something and I daresay it was a steal at that price. To anyone that finds the gameplay style and setting appealing, I'd easily recommend the game but if you are easily frustrated, yeah maybe this little sojourn into the wastes isn't for you.",
            "review_score": "1"
        },
        {
            "review_text": " Skyshine's BEDLAM",
            "review_score": "1"
        },
        {
            "review_text": "I'm about two hours in and so far I like it. It's a budget game, the mechanics take some getting used to. I woulda preferred normal initiative combat, and the enemy does start to close (I can't get 2 hp snipers out of the killing field many times) and I hope they keep making it better with patches. Nice overall concept and art style and FTL/XCom-ness to it. It's a budget game, but fun so far. I'll see how it goes, don't regret buying so far.  REDUX UPDATE: So, I'm real impressed so far with the update. They fixed my biggest gripe, you have the option of an Xcom (variant) type combat which I'm really enjoying. The polished alot of little stuff along the way, I tried Arcade and Campaign mode and I'm having alot of fun. The basic game had obvious potential, good theme/art/production value and for once a company listened to feedback and the end result is good. This is how Early Access is supposed to go.  My one minor complaint (like the original Xcom) there is no notification when a character dies ('My trencher just got blown away, who was that again?') and there's no Memorial Wall.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game current rating is underserved. Sure, at the start it was somewhat rough with some things being not fully and some bugs. But right now lot of negative reviews it has arent correct anymore. Latest update made it into the game it really should ve been, and after trying in its latest iteration I can recommend it without second thought for those people who enjoy TBS games. Game has 2 modes and can be tweaked to one's preferences in term of game rules (which combat mode you prefer) and difficulty. Developers still seem to be reading and listening and willing to improve the game based on the players impressions and suggestions.  So in short I do recommend this game for people who like TBS tactical combat, like post-apocaliptic setting and atmosphere and enjoy good artistic style.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure what all the negative reviews are about. This game is fun and engaging. Love the art and strategy. Quite difficult which keeps me coming back for more.",
            "review_score": "1"
        },
        {
            "review_text": "I live! I die! I live again!  Possibly the most enjoyable roguelike I've played.",
            "review_score": "1"
        },
        {
            "review_text": "TLDR: Game is very good. Think early stages FTL with a different setting and XCOM-esque combat. It's getting a lot of bad reviews and that feels unfair, especially since they're already addressing the things that everyone is downvoting for.  Pros: -Soldier classes and leveling: Would be nice to choose the stats to level, but it's plenty rewarding as is.  -Concept and setting: It's basically post-apocalyptic FTL, what's not to love  -Replayability: It's hard to unlock new dozers. I mean like scouring the correct regions AND getting a little RNG love hard. Similar to a few of the ships in FTL, where you have to get the right event in a specific race's region. That said, I totally want to try the other dozers and this gives you subgoals aside from just beating the game. There are also dozens of different weapons and boosts you can find in your travels, making each game a bit different.  -Combat: Combat is fun and gratifying. A lot of reviewers seem to hate it, but if it was too easy to outsmart, then it would be dumb. You'll likely have to sacrifice some soldiers to get levels on others, or to simply beat a battle. Don't buy this game if the thought of playing god and having to sacrifice soldiers for the sake of your masterplan is an absolute deal-breaker for you.  Cons:  -Troop placement at the start of combat: Honestly, this one isn't that bad. Reviews keep saying you insta-lose snipers etc because they spawn nearest to the enemy. While this does happen, you always get the first move. So really, at worst you're losing a turn relocating your troops. This is something they are updating anyway.  -Dozer upgrades: Resource management in BEDLAM is pretty good. Not overly complex, but managing fuel and food requires some forethought. That said, there are dozer upgrades to reduce your food and fuel consumption that are pretty much completely necessary to survive. You just end up leveling those to max before you can even consider your other options.  Last Thoughts: If you really like FTL, even the ♥♥♥♥♥♥ RNG and the sometimes unfair boss fight, and $20 isn't going to make or break you, then pick this up. It just released, it is good, and the cons listed here are already being worked on.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is a lot of fun and really tough on normal difficulty. Bedlam difficulty does seem to me a tad over the top but can be really fun as well if you like being punished by the games you play. I have read a lot of the negative reviews stating how the 2 turn combat system is unfair and some of the units are too weak to be useful etc. etc. I disagree with this and would say that tactics and patience are extremely important to actually complete a playthrough.   I personally think the combat system including the blitzometer mechanic is really intriguing but yes there is learning curve. I would say play the game on easy mode and find what unit combos work for you.  I do agree that some random POIs are a little redundant and some are literally just flavor text. I would like cargo to pop up more regularly and be more useful in the POI's but I have found some really cool new units to play around with because of cargo I found.   I do recommend this game because even though I have experienced a few glitches I still come back to the game and want to play more.   ",
            "review_score": "1"
        },
        {
            "review_text": "God, this is fantastic. It's a great feeling world with gameplay very reminicent of the world map in the earlier Fallout games. Tactics factor in as you take cover and strategically move around the battlefield.  I also love assembling the crew for each encounter. Taking a few moments to think really pays off.  Encountering strangers, random encounters, and I'm becoming more and more engrossed as the world lore opens up.  GREAT game.",
            "review_score": "1"
        },
        {
            "review_text": "Bedlam is ruthless roguelike with turnbased combat. Combat system is simple but rewarding, you leave you most precious guy in a bad spot ? BOOM its GONE ! I was entertained and cant wait to get to play it again.   Im one of those guys who think losing is part of the experience, Hello kitty adventure island ----&gt; that way.  I cant understand the amount of negative reviews with people who have 0.1 HOURS PLAYED ! Bunch of adhd kids with attention span of a ferret.",
            "review_score": "1"
        },
        {
            "review_text": "Killed a man by kicking him in the privates and elbow dropping him!  10/10  Seriously though. This game is harsh and unforgiving. It's how a rogue-like should be. Combat is tight, even if unit placement is a bit too random at times. Resources can be hard to come by. With common sense and a bit of strategy, you can get through half the wasteland and last over 2 months on a few playthroughs. But with the right crew selection, combat strategy, upgrades and levelling of your crew.. It can be possible to get to your goal with resources to spare. I almost managed this on my 3rd playthrough on normal difficulty before finally being brutally massacred. Luck played very little part in that run.  I feel the negetive reviews are rather harsh. The last time I checked, Post apocalyptic wastelands with multiple roaming factions battling for power were supposed to try and kill you. I guess that isn't everyone's thing though. Different strokes and all that...  Personally for me, I am enjoying this more than FTL, and can certainly see myself sinking many more hours into it. I already own many Rogue-likes on Steam. This already sits rather comfortably in the top 5 of my Rogue-like collection!",
            "review_score": "1"
        },
        {
            "review_text": "Full disclosure: I backed the Kickstarter and I know the devs on Skyshine’s Bedlam (great people, in my opinion)  Skyshine's Bedlam is a passion project by three core dev's. These guys are all industry vets with a ton of game experience. What does that have to do with anything you might ask? Well, it means they care and want you to have the best game possible. Simply put, they continue to listen to the community well after the initial release.  Bedlam is tough for sure and there are many awesome ideas in it. The thing I would like to impart in this review versus the many others is you are dealing with a top notch crew making the game. Since Early Access they have been active in the community and provided feedback as well as game updates.   If it looks interesting and you have done your due diligence – I recommend checking it out. It’s a great ride and I hope to see more from the team.",
            "review_score": "1"
        },
        {
            "review_text": "So ... i think this game has potential to be very good... Bedlam is really hard and challenging, but it requires some serious polishing. Fortunately developers listen to the voice of the tribe, and their response is pretty quick... so it's promissing .  Personally, i enjoy this game at it is  ( yes - i'm masochist ;) Besides i absolutly love John Mueller's artstyle )  Do i recommend this game ? Yes, but not to everyone, and the reason is ... Bedlam is freakin hard.  If you are a casual player, you will probably fail to complete easy mode, and rage quit after few failed runs...  Also - the most important thing - it may be better to wait for future updates ...",
            "review_score": "1"
        },
        {
            "review_text": "Great game.   You're in control of a giant moving fortress called a Dozer and your goal is to travel across a war torn, irradiated, hellish landscape called BEDLAM. Keeping your crew alive through BRUTAL fights with chess like calculation and your Dozers abilities (function similiar to spells in heroes of might and magic.) but you also have to care for around 1000 citizens or more on the journey by properly managing and using supplies. The game has epic bosses that you can acquire by defeating, although they're difficult they provide a great bonus. In this game everything has a cost, and its GREAT! BUY THIS! DO IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "This game is much like FTL, but it's hard to say it's a clone. You are in a barren land, going from adventure to adventure and meet FTL like instances. Except the battles are turn-based instead of real time. And they're decent.  So I'll list the pros and cons in comparison to FTL. Also: if you haven't played FTL, go play it. It's the greatest game of 2010s.  PROs: * The battles have more tactical depth. * Boss fights - and the fact that they all join you. This is probably the best side. * The chance to explore freely rather than always forward. * Big weapons and spell-like abilities. * Graphics are cute.  CONs: * Your crew don't matter except for their battle prowess. I.e. they don't use engines and such as in FTL. * Upgrades don't mean much. They don't get you excited. * Writing isn't nearly as good as FTL advanced edition. * Instances are not as exciting.",
            "review_score": "1"
        },
        {
            "review_text": "Yes your best veteran characters will die. Yes you will run out of fuel and get into sticky situations. Yes you will head into a fight and get steamrolled. But stick with it. Understand what the game is. Don't expect to win on your first try. Read the story and immerse yourself. This is a ridiculously difficult gem with depth and a vibe all its own. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "I tried really hard to like this game, I love the genre, the context, everything about it seemed perfect and the first 2~3 hours were marvelous, but then... all the other 6 hours were exactly the same. Not FTL. Not newer Xcoms. No replayability whatsoever. It is disappointing to see a game that had everything to be incredible having its gameplay so shallow. Yes, there are things I liked very much. Devs' sense of humour being one, but all in all, this game is not worth more than 5 hours I'd say. If something, this game is the perfect 'Try doing something like this, but not this'  On a final note, buy only if extremely cheap",
            "review_score": "-1"
        },
        {
            "review_text": "Never played the original version of the game, but since there's been a lot of patching going on since then and it's now version 3.0 I decided to give it a shot. I'm only an hour in so far but most problems people had with the game seem to have been fixed, especially the AP system (it's now 2 AP per unit instead of 2 AP for the entire crew). I'll update this review once I'm further in, but so far it looks to be a fun and tough rogue-lite strategy game in a very cool post-apocalyptic world.  [Update] Alright, further in, finished campaign once (on normal), currently doing an arcade run (alternate game mode). Still loving the setting and the visuals, the drawings of the characters and little special events and everything are brilliant and probably one of the strongest pros for the game. The text events (FTL-style) have some nice humour and different outcomes (and special solutions if you got the right people in your Dozer), aren't that varied though. The different people you can meet are also very colorful, each with their own drawings and backstories. The fighting is kind of neither pro, nor con for me. It's decent and has its tense moments, but it's not really what keeps me playing (though the death animations are hilarious!). All in all, I very much keep recommending this. There are some bugs, but the devs seem quite active and a fix for a bug I reported is supposed to drop tomorrow, so that's pretty neat.",
            "review_score": "1"
        },
        {
            "review_text": "This game was super hard to the point that it wasnt really very much fun to play, even on the easy mode. But it's lastest reincarnation is really good and i'm enjoying the combat. The difficulty is more on a par to FTL now, which was always a fun game. And now Skyshine Bedlam is also fun to play! So well done guys, nice work. Those who had been on the fence should now go for it!",
            "review_score": "1"
        },
        {
            "review_text": "I got this at half price...and that may impact this review.  I did not play this before they released the 'Redux' update/fixes, so I have had nothing but fun with this game.  Yes, it is a little like FTL, not a lot. Resource management is really minimal.  The sound is excellent, firearms having a real meaty, hard-hitting sound. (Sound is very important to me).   The game is really a connected series of small tactical battles with some recruitment thrown in.  Nothing too complex.   I have only played it on Normal, and have gotten to the destination a few times. Not as punishing as many have said.  I loved this game. Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome turn-based post-apocalyptic fun with a really cool art style!",
            "review_score": "1"
        },
        {
            "review_text": "I am very on the fence about this game to the point I had trouble deciding to up or down vote. I love x-com/banner saga fighting style. This game took a chance to try to differentiate itself by giving you 2 turns that you can use for any character. They did this obviously to try to be different. People have been comparing it more to chess than X-com. The problem is this is not chess and it doesn't make sense to move 1 guy 8 times in a row while your other guys sit there. I tried it and have to say I don't like the move this piece at the expense of that piece style. I bought the game and so will continue to try to put some more time in but this is a core piece of the functionality of the game. Turn based strategy games are 90% the fights and this really hamstrings it for me. I'll update if that feeling changes but for now this game is just a decent try by an indy that will be forgettable which is a shame because the setting and turnbased system is something that had me really excited.",
            "review_score": "-1"
        },
        {
            "review_text": "REDUX has given this game a new breath of life, new mechanics, dozers, crew members, sprites, events and overhauls to the campain and the arcade mode show that the devs listened to all of the feedback from the initial release and have taken it to heart, activly changing the game and listeneining to feedback to make the game better and much more fun.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I picked it up following the redux update. The art is pure joy, both static and in-combat animations. However I did hold off hoping the reportedly flawed game design would mature a bit.  Now I wish this game would become the poster child for the virtues of long term support.  In short, it's brilliant.  Pros : - Art is seriously top quality all throughout the game (check out the videos to see if you like the aesthetic). - Core gameplay works flawlessly, in my mind much improved upon The Banner Saga formula. - Replayability seems pretty good given the amount, quality and variety of content and unlocks. - Game difficulty is well balanced, keeping you on your toes without ever feeling unfair (though Normal is a bit easy). - RNG power is completely mitigated by the many strategic options, very explicit and transparent game info, and overall length of every run (unlike FTL for instance). - Back story of each character and the writing in general is superb. - Super parent friendly : can be paused between moves and events.  Cons : - Although I found the writing great, the same events tend to reappear too many times in a single playthrough, somewhat breaking the immersion a bit. - I wish I could sometimes have a way to improve my units a bit further, they max out pretty quickly (mid game for me).  TL;DR : if you like turn-by-turn strategic games, or just its art style, Bedlam is a very lovely experience and you should check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Tactics mode seems to fix the AP gripe of many early reviews.  The game still has a few rough spots and has a little trouble 'engaging' a new player with its style of play and even an understanding of what the F is going on. But once you dig trough the initial learning curve, it's pretty good. It leans more heavily in the direction of management then turn-based-tactics...maybe to far for my tastes...but I'm glad I gave the game a try.",
            "review_score": "1"
        },
        {
            "review_text": "It's not even close to being as bad as many other players say it is. It's not THAT hard and they're already working hard on the balance. It has some pretty cool ideas and is a lot of fun.   I'm not sure why so many people are whining.",
            "review_score": "1"
        },
        {
            "review_text": "This game i have a love and hate relationship with, I loved it when it first came out (knowing the dev's were gonna tweak it) Then i hated what was - wasn't done, now i have to say they (dev's) are really listening to what us folks are saying and trying to make this a great game. That being said i recommend that you give this 1 a shot,there on to something here in this genre and i think it will only get better . Great game. Recommended!!",
            "review_score": "1"
        },
        {
            "review_text": "TLDR: The reason for mixed reviews was the initial game mode. It's been updated to hell and back and a new gameplay mode exists that fixes all the problems without removing the old style.  IN SHORT: Recommended, ESPECIALLY to people who have always wanted a bit more 'roguelite' XCOM and love post-apocalyptic themes. To those people, this is manna from heaven now. Also to people who liked FTL. The game has two ways to play it, 'arcade' and 'campaign', first one is more like FTL (turn based, though) and the latter is like FTL met XCOM and they had a child that looks like FTL but acts like XCOM. Unfortunately, with less depth than either.  WARNING: This game is VERY much like a Roguelike in the sense that randomness has a huge impact on the game. This mean you will often lose just because you had ♥♥♥♥♥♥ luck. This is reality in 99% of roguelikes as well. I'm not good enough player to make this reality, but I expect that there is a certain level of skill where winning is more likely than losing despite the randomness. This is true for FTL as well, which most non-roguelike players considered 'unfair' because of random ♥♥♥♥, but there are players that can win every game they play. Just keep that in mind.  NOTE: I am not sure the difficulty level is balanced quite right, or whether I just suck. It could be the latter, despite playing a lot of roguelikes and some rogue-lites I am nowhere near best at them so take that with a grain of salt.   IN LENGTH: ------------------ So originally, and the reason for the mixed reviews initially was that there was only the 'arcade' mode and a random unit placement on map. So instadeath at the start of the combat for units was a real thing. Further, the game system was so that there was two action points that you could distribute however you wanted among your units, and the actions they did, then the enemy did the same.  This meant that people died, often, and easily. The game was won only by husbanding one unit and getting him/her to Elite status and then using that unit to murder enemies mercilessly with the two AP you had per turn.  This mode still exists, it's called 'ARCADE' and you can go and play it. Sans the random unit placement, that was fixed pretty soon, for obvious reasons that really should have occured to the devs while making the game. It's a bit like more unforgiving FTL with more content (random encounters, etc) but with less tactical depth. The realtime of FTL is actually somewhat deeper, and unlike XCOM there's no skill trees for the units even when they level up.  But now it also has a 'CAMPAIGN' mode that it's like a XCOM meets FTL kind of thing. It's pretty damn nice combination that I haven't seen before. There is a very simple leveling system for the units, so it's not super full of special abilities or any such things. There are few special skills that you can use while in combat, but they use resources and are not unit-dependant. Which is a bit of a shame as it does reduce from the depth of the tactical gameplay, but also I am not sure it would really work in the long run. Interestingly, despite this, upgrading your units is crucial for the later game, so distributing kills is arguably as important as winning the fight in the first place.   This exists in XCOM to some extent, but it's more of an annoyance in that game as the game is more granular. Here, leveling up someone once is huge. As is the special units you can recruit along the journey. They provide a major tactical advantage in combat. However in Bedlam as the maps are pretty small, this is not actually annoying, but instead adds an another layer of strategy on top of the actual tactics of the combat. You absolutely want to make sure you level up your units in a sensible manner, so just 'winning' a fight is not always the perfect solution. Of course, sometimes you just have to make do with what you've got.  It's a great little game, that on surface seems to have more stuff and depth than FTL does, but doesn't quite feel like it while playing it. I am not exactly sure why it feels like this, perhaps it is the nature of the tactical turn based combat?",
            "review_score": "1"
        },
        {
            "review_text": "Game unbeatable, huge c*ck tease.  Three times now, I have made it to near the end, and at some point, a relic goes missing from my inventory. Can't beat game without all 4 relics. Don't waste money on this game. There is a ton of potential, but any game that can't be beaten is worth nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic tactical play for anyone. If you liked XCOM and need another fix of turn based tactics, this is an awesome choice.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, so I haven't played this game in a while and I deleted my previous review to start anew! I don't know if it's because of the new mechanics offered in the 2.0 version of the game, the fact that there are faction based chars that now have that sorta variety of unf (Just got a cyborg champ that takes damage to buff her damage, and a mutant champ that appears to heal himself etc) but it's pretty cool so far. The biggest 'bleh' I have is the combat, but as it is in the 2.0 beta, I'm enjoying it. I get far less frustrated, it has a bit more challenge when planning things out, and since your party doesn't lollevel quickly it actually adds that bit of hard that I enjoy.  The new addition of 'destroy all the bedlam factions' is nice too. I donno if any of my passengers will make it to azteck since i've got a mentality from my last playthroughs of 'not caring for them at all', I probably should now. But, point is... In the 2.0 version, which to my knowledge is a beta you can opt into (They have it in the information!) It's pretty fun. Like I said, biggest eh is the combat, it's a gimmick that is interesting but, it feels like I'm just dragging in big champ chars to back my main one champ I level as a 'just in case I needa save them' or something.  Not sure if they should keep the combat or dunk it but, I'm enjoying the game now. I give it a tenative thumbs up-- Especially since the devs do seem pretty active on fixing everything and reading fan feedback. I think. I mean, I'm sure there were a lotta people complaining about the lack of variety and bam, it was fixed. Or maybe that was the plan from the get go.. Yeah.  Tenative thumbs up, if the devs continue going outta their way to figure out the rights and wrongs, I can see this becoming a real big and fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Skyshine's Bedlam sound like a good game, the redux version isn't.  The idea is good, not new but good. The balancing however...  Leveling up is limited to lvl 4. Starting at 1 means you get 3 extra point for elites and 3+1 for basic troopers. That's not enough. To be more acccurate that's enough to let you play 10-15 battles before getting owned. Cause enemies suddenly become stronger than you would ever be. like twice as much hp with almost same damages. And since you can have only 4 people in a team, you get outnumbered. Cause AI can throw 10 at you.  The difference in power is so incredible that tactics and all doesn't do much cause they just rush and bite you to death. Which doesn't take long cause they can 2 shot every one.  If someone tells you that buffs and dozers weapons are here to balance this, that may have been true a year ago. Now it's just crap : -The 3 turn incapacitating thing is down to 1 turn. -The tactical nuke doesn't do enough damage to kill stuff when you finally need it. And the IA isn't limited by numbers when it use it. -The final boss is immune to those...  Ho ! and the game is bugged : -Battles going on but you can't see what happen cause screen doesn't refresh. -Targets in range not properly marked, so it's up to you to know how things work. -Some encounters which should be battles end your run on the spot, as if defeated.  Also, here are some troubles you will encounter with the interface : -Descriptions are often wrong or insufficient -Elites attacks are AoE, each one as his own, meaning you're propably gonna kill one of your guys before understanding it. -Troubles selecting targets : wanna shoot at something ? better checked you are not clicking on him higher than his feet cause else you are gonna move.   edit : i have modified some stuff cause i played in easy and finally found out how things work.  2$ ? worth. But no more than that.  I forgot to mention troops stats randomly reset when you load the 'autosave'...",
            "review_score": "-1"
        },
        {
            "review_text": "The fighting system is brilliant - a game of chess - but its downside is that the hardcore strategy skills are needed at the beginning rather than at the end and that is why it got mixed ratings while it would deserve much more. If you can survive the frustrating learning curve and get to master the game a bit, it will suddenly reveal itself as a gem worth its money and more. Waiting for some expansions. Please port it to tablet. :d",
            "review_score": "1"
        },
        {
            "review_text": "Decided to edit this, simply because of the new game-changing patch that came out. I haven't managed many more hours with it (due to life, not crashes), but what I've been able to play was much better than what was originally offered.  The fights are still hard, no question - but they're supposed to be. There's far less nonsense as a factor making these fights hard. Don't plan, you die. Simple as that.  The 1.5 Patch made the game far more enjoyable, though I've yet to unlock anything (again, haven't put as much time in as I could). Still, your veterans make all the difference, and it feels a bit more rewarding to be able to accomplish things. The game feels like it has moved from an early access buy (we've all had enough of those, right?) to a full blown game.  That, and they listen to feedback and care what people post. It's now a recommendation from me. I look forward to seeing how the game continues to grow!  PS: You're no longer screwed in fights from the get-go. You screw yourself by not moving the right way when enemies start advancing on you. Make the fault your own; give Bedlam a try!  (read my former post just under this. Sad pandas were had.) ---- [OLD REVIEW] I've sank the better part of two days into this game and I do like it... in theory.  The problem(s) with it are what a lot of people mentioned, but even when you get past the combat, the 'rookies will die / you're stuck with what you got' motivation and the fact that everyone you pick up (except for some special, special units) also starts at rookies, the game does have a method to it's madness.  However, I find myself restarting if the first fight goes poorly. Usually, it does. If the first fight goes badly, you have First Fight 2, which usually doesn't go any better (because you have no veterans). If you DID get a veteran, that veteran is now Rocking House (capital letters), with no need to level up any other characters. It's kind of disappointing to not pick up any other veterans or anything while on the road.  Here's the meat and potatoes though.. this game crashes a LOT. Got a neat looking event pop up, leading into a fight? Crash. Go back into the game, event is lost (as well as all other side events). Travelling between two different zones? Crash. Finally start using a chain of event items that may or may not give you a new dozer (dozers are your ships, essentially, for the FTL comparison)? Crash.  It's frustrating, and it's disappointing. I backed this game and was waiting for it to come out for a long time.. I only hope it can be playable, because I'm sick of being irritated at no obvious probability displays, random crashes, and ludicrous encounters. I honestly think the game would be 100% better if they let you place down your own troops before the fight, but they aren't inclined to do that. [OLD REVIEW]",
            "review_score": "1"
        },
        {
            "review_text": "Great round based strategy game. Very difficult, but if you once got it lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend to start on easy difficulty. It's true, this game is hard but once you figure out the mechanics it gets a lot easier. I can see why most people complain if they sit for the 1st playthrough on normal and expect to finish it right away, but the difficulty must be amped so the game won't become too easy too quickly on multiple tries. It's worth getting this game in the price range of 2 to 5 bucks. Get it while it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a case of trying to cover poor mechanical choice by claiming that it makes for a challenge. Interesting ideas hampered by appauling lack of consideration  This game is closer to chess than it is x-com, with the move limit being 2 per turn for the entire squad rather than a move per unit. You also tend to find your units in a Dead or Not dead situation, simmilar to being 'taken' in chess rather than actualy having a hope in hell of surviving.  The issue is unlike chess you cannot afford to sacrifice units in this game. you have a finite number of troops per run and no way of reliably getting more. Compound this by the game forcing you to gamble for resources and random events which may kill you but are still crucial to being able to advance and you have a game that is frustrating in how harshly you are punished, while at the same time it forces you to make these bad choices.  Each unit was clearly meant to fill a certain role but that gets a little fuzzy because they all perform the same two actions, move and shoot. Sniper = damage dealer, Frontline = meat shield, Gunslinger = generalist risk taker, trencher = target practice. With none of them possessing any real useful abilities and the Sniper being the only one who can deal enough damage to dependable take out the enemy you will find yourself rarely activating some units. I feel if each class possessed a unique feature to differentiate themselves you could have had a far more tactical game experience.  To compound this further you and the AI use identicle units, adding to the chess illusion. however the AI has advantages that you have no equivilant to, such as the Blitz mechanic where after a certain number of turns the enemy gains a one off additional action. This is serves no real purpose but to punish the player for being cautious or trying to gather resources (which you need to stay in the game). The player version of this are resource draining boosts you can use, but they start out so expensive early on as to be unusable until mid/late game at which point you have bigger concerns.  After two attempted runs and some internet research I have no desire to play this game. I feel unrewarded for good play and punished for choices I had no real option but to make.",
            "review_score": "-1"
        },
        {
            "review_text": "Masochism and good music.",
            "review_score": "1"
        },
        {
            "review_text": "A cute little game with a lot of charm and everything is great but...  The combat implementation just doesn't work. The aracade mode and tactical mode both seem more like puzzle modes than actual tactical games, and for me it really hurts the game. Moreover, the combats are extremely high variance with people frequently one shotting each other. This leads to unexpected deaths when the cover rules work differntly than expected (could use a lot better UI on when cover applies or not, sometimes when you are flanked it stops working, sometimes not). The abalnce of resources seems a ittle random as well, with some games they not being that scarce, and others extremely dear to the point of impossible.  The art/music/writing/ and core programming are all excellent and I hope for more great things from this team, but sadly this game just isn't that fun as is.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of bugs!!! During the battle the game just stops showing a cursor. Very disappointing especially when you can't save your progress.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun turn based rogue like strategy game!  + Awesome artstyle (soooo amazing!!!!!!) + nice 'mad max like' wasteland feeling + decent story/ events + easy and forgiving combat/difficulty for beginners + unlockables + several different factions to play (each with their own small advantages)  - gets repetitive kinda fast due to lack of options - repetitive unit design (4 base classes and one elite unit per faction) - AI is not very clever and predictable - Some special attacks like airstrikes feel very strong - not that much upgrades and own playstyle personalization  I would recommend this game for everybody who likes turn based rogue like strategy games with awesome artstyle. But you shouldnt expect too much due to repetitiveness. 20$ feels too expensive I would grab it for 5$-10$  Estimated playtime 1hr - 8hr  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I really want to like this game, I really do.  As others have said, it attempts to portray itself as a tactical RPG, but is little more than a computer based choose your own adventure.  Issues include: -No way to customize your party members. -Foes appear to not have the same AP restrictions as you do. This enables them to move, shoot twice and kill one of your people, and then move another unit. -Little difference between novice and elite members. -Dozer abilities are too costly and appear to be one use / combat. -Little reason to trust any group you encounter, so no reason to treat any encounter as anything other than flavor text. -Foes jump onto the dozer and cut into it in about every encounter I've played so far. What use is it to have an armed dozer if it can't be used to fight them off? -Guns in combat can't be used above or below the set range. This severely limits combat. Combat is boiled down to a pseudo knight's dance to get your man to the right range to shoot. Keep in mind that with 4 AP, this takes 3 of it (1 for movement, 2 for combat), leaving only 1 AP to move another.",
            "review_score": "-1"
        },
        {
            "review_text": "Bedlam's combat plays more like some weird chess game with an irritating set of rules about weapon range. Snipers for example have a very specific engagement range of a one square. Too close and you can't use them, too far and you can't use them. Combined with limited actions on turns and you get basically a game that's not a really a tactical combat strategy game and more of a weird board game.  Fortunatly I bought this on sale for pennies on the dollar. Read other reviews before buying.",
            "review_score": "-1"
        },
        {
            "review_text": "So a developer asked me to write a new review for this game based on the Redux, which I thought was nice of them, but sadly I'm not seeing any changes at all. Yes, the option to change the difficulty was present, but it didn't seem to make any difference. The second battle I was involved in, the enemies still charge in heedless of any danger, taking advantage of their extra numbers and increased damage to shred my team to hamburger.  I've read other reviews that say you need to focus on strategy, what strategy? Run away until the enemy makes a mistake?  The shield-bearers can now provide cover... well if I could fire around cover that would mean something, but as it is they usually manage to distract the enemy shotgunners for one, maybe two attacks before being put down, and even then you'll most likely have to reposition a character to counterattack.  Also... didn't we used to be able to attack twice if we didn't move? That got taken away?  The Equalizers still cost a ridiculous amount of resources to use, so even if they do have new fuel types to use it's not worth it.  Map's still random, even trying to plot a course to take advantage of crude locations can lead to lots of backtracking and running short just before the end.  I see it's gotten a lot more positive recommendations, and I'm not really sure how that happened but maybe it appeals to the Dark Souls / Darkest Dungeon crowd who like being supremely frustrated by games. I'm not one of those people, so maybe the game's just not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Repetitive combat. Random events that look like quests. Not fun. Avoid!",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: I don't really play on Steam anymore but I'll probably play it eventually.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically ♥♥♥♥ xcom, really ♥♥♥♥ xcom.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to enjoy this game, but the frustrating 95% luck based combat system makes rock-paper-scissors look like a strategy game. Enjoy getting one-shotted because the game randomly spawns all your weakest characters next to guys that do 3x their health bar. ",
            "review_score": "-1"
        },
        {
            "review_text": "I love the art directon &amp; I love the story &amp; background, but this game has the worst controls of any tactical combat game I've ever played. The 'tutorial' doesn't actually help either.",
            "review_score": "-1"
        },
        {
            "review_text": "after the update its a crappy cheap version of Xcom",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like Skyshine's Bedlam......  I saw glimpses of greatness that put it up there for me potential wise with FTL, but i just can't give it a possitive score at the moment with some of the glaring issues the game has. The combat(at the moment) while solid feels completly unbalanced even at low bedlam levels. The AI completly outmatches me because i'm lacking some pretty basic feedback in the interface that should be there, stuff like an actual grid option on the floor to plan movements better and easier to see/understand range markers.   I get that the theme of the game is that your suppost to have the odds stacked against you as you progress (i play a lot of XCOM so nothing new there) but even with veterans and max level guys the combat balancing feels horriffic in certain fights even with equalizers avalible to you. Plus theres no real padded out progression on your soldiers other than flat stat increases. Normally i wouldnt have a problem with this but whats the point in having all those cool backstories and lore for your guys if all they get on a level up is a sole re-skin job and some +1's. The Dozer isn't much better with flat percentage upgrades and a few (but admititedly intresting) unique abilities per vehicle.  Despite all of that i do have some hope for the game, we are only 6-7 hours into open release, im a picky *ss lol and most of what i see wrong with it can be patched out or changed, there is a solid game under the hood somwhere here and with some luck the devs will change some things for the better.  Pros:  - Lovely art style and setting - Interesting characters even with individual backstories - Solid turn based combat  Cons: -The combat (at the moment) feels completly broken and unrewarding - RNG is huge (yes i know its a rogue-like but 2 HP sharpshooters getting RNG'ed on spawn 4-6 tiles from the enemy every fight is just stupid)  -Any lack of meaningfull upgrades on the Dozers or soldiers",
            "review_score": "-1"
        },
        {
            "review_text": "I really wish there were more options than just thumbs up or thumbs down. For me, this game exists right at the border.  It's a 5/10 game as it is right now.  I have the feeling that the game will get a lot better as the devs respond to feedback and flesh the game out. I may end up revising this review.  But, for right now, it only feels like half a game. The main issue is that there simply isn't that much to do. You drive around the desert on rails, random stuff happens, you fight. Problem is, the fighting system isn't all that robust. I understand that the devs are currently reconsidering the two turn activation system, and I think they should. As someone who has played numerous tabletop wargames over 25 years, this system makes no sense to me. It's both needlessly complex and too simplistic at the same time. There are lots of better ways to achieve what I think the devs were going for with it.  I hate to say it, but, as the game is currently, it's basically Oregon Trail with really awesome art design and lore. But it's got potential to become something great - the art design is quirky and beautiful, and the world they've created is very rich. Make the combat a little more robust, add some playable races, and make Bedlam more of a sandbox and this game will be great. Until then, I hate to do it, but I've got to give it a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful but unfinished game that does not hold together. Bugs, missing content and unbalanced systems.",
            "review_score": "-1"
        },
        {
            "review_text": "Bedlam didn't have to be an awful game. It had a lot going for it, with the interesting setting and backstories. However. The combat in its entirety is infuriatingly bad. I have played through atleast 15 or so fights now and everytime I atleast lose 1 unit. This is, from what I can tell, usually unavoidable. That wouldn't be so bad if it weren't that you have a very limited number of units to deploy and once one dies in combat its gone. Permanently. It gets to the point where the most valuable resource you have isn't food or oil but just the numbers of poor hapless mercs you can burn to make it through an encounter. This game doesn't test any cultivated skill, just your mental breaking point.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like FTL x Wasetland/Fallout x Xcom, plays like chess with guns, except your opponent has made a few moves while you were in the kitchen getting drinks.  Think about playing xcom, but with two moves, and moving and shooting with one character is counted as two moves. It's not uncommon to spawn in with half your crew in an immpossible position, where half of them are going to die regardless of tactics.  No overwatch.  The sniper class is basically a rook/knight where line of sight does not equal a shot, it goes off a wierd circular grid system that is not in the least bit intuitive.  Your highest leveled veterens in cover can still be one shot by the lowest leveled rookies.  Wasted potential save your dosh, go play wastland 2. ",
            "review_score": "-1"
        },
        {
            "review_text": "I really wish I could recommend this game but I just can’t. My expectations for this game were fairly hi which is suppose is my own fault. I really thought this would be something like an FTl fallout hybrid. Sadly this game is just bedlam. I’ll start with the combat. The combat is just bad plain and simple. I was expecting combat to be tactical like Banner saga or Fire Emblem instead your units are dropped in a random cluster. You are only given two actions per turn this means if the enemy has two or more snipers in attack range of your men you are almost guaranteed to lose a unit on the first turn of combat. This happens because there is almost no unit balance snipers for example insta kill almost everything or die to everything. Melee units do pretty much nothing they die to fast to be effective tanks and don’t do enough damage to kill even snipers. Even after units level up pretty much all of them die to one or two shots so investing time in leveling units is meaningless. Aside from the poor combat the game is ok at best. The art style is interesting and fun, there are plenty of cool death animations you will see these a lot. The wastelands themselves leave much to be desired. At a glance at the map there are a number of unique zones with different factions and interactions. Upon closer examination every zone is pretty much exactly the same with enemies being graphically different and that’s it and the events themselves are all pretty much the same regardless of the zone you are in. This game had a lot of potential it just failed to deliver combat was bad the events were boring really the only thing this game delivered on was a cool art style.",
            "review_score": "-1"
        },
        {
            "review_text": "Hey fellow strategy lovers! This is  not  FTL, Mad Max and XCOM combined. This is chess on steroids with cute graphics. Don't get fooled!",
            "review_score": "-1"
        },
        {
            "review_text": "Update: I have had a chance to play since the fixes and Skyshine has basically redone the game. The new version(s) do not appear to have any of the old bugs and it actually quite an enjoyable experience.   It really is nice to see a company go back and fix things that were broekn and improve a product this vastly.",
            "review_score": "1"
        },
        {
            "review_text": "As SkyshineJeff, a dev, has noted in his reply to my original review, there has indeed been a lot of changes. I am going to withhold a review until I've had a chance to delve back into the game and give it another chance. Until I get a chance to do that, I'm changing my review to Recommended because it's unfair to the devs to not recommend it based upon a very old version.",
            "review_score": "1"
        },
        {
            "review_text": "Game is simply not fun,   The challenge is unfair and the mechanics are unbalanced.",
            "review_score": "-1"
        }
    ]
}