{
    "app_id": 367670,
    "name": "Controller Companion",
    "release_date": "2015-05-04",
    "developer": [
        "Koga Tech Limited"
    ],
    "publisher": [
        "Koga Tech Limited"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Full controller support",
        "Steam Workshop"
    ],
    "genres": [
        "Utilities"
    ],
    "tags": [
        "Utilities",
        "Controller",
        "Software"
    ],
    "achievements": 0,
    "positive_ratings": 1603,
    "negative_ratings": 149,
    "price": 1.99,
    "description": "Navigate your PC desktop with a controller! Put mouse, media and keyboard control in the palms of your hands so you'll never have to leave the couch again!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/367670/header.jpg?t=1494060059",
    "minimum_requirements": "OS: Windows 7 Additional Notes: Also required is an XInput compatible controller. If you have a wireless Xbox 360 controller you'll also need an Xbox 360 Wireless Receiver.",
    "recommended_requirements": "OS: Windows 10",
    "reviews": [
        {
            "review_text": "Summary: If you have some change to spare and are a gamer who likes being comfortable on the couch for non-keyboard games, STOP READING AND ADD THIS TO YOUR CART!!  Necessary for the controller or couch based gamers. Period.   Obviously, not made to be able to play keyboard-only games, but this eliminates the hassle of using a wireless keyboard or traversing to the desktop to make some KB+B changes.  I personally have a Logitech TV730 for this problem (love it!) and have tried using custom controller schemes to take the reins of windows, but so far this is the simplest launch-and-use app I've seen. Simple. Creative. Works.  I wouldn't pay for it, but to support the devs in finally--ephasis on FINALLY--making something like this, $3 is not a blood sacrifice to any diety. LOL  Disclaimer: Is not for everybody. Is not for MMO players or programs and games that REQUIRE a keyboard. Only best for couch gaming a la console or laziness. Have only tried it with an XB360 controller, though, I do not see why other wouldn't work.",
            "review_score": "1"
        },
        {
            "review_text": "I love being able to navigate porn on my TV from my couch with my controller",
            "review_score": "1"
        },
        {
            "review_text": "Does everything it says it does and does it great at that. The virtual keyboard might take some time getting used to but I expected no less.",
            "review_score": "1"
        },
        {
            "review_text": "  Controller Companion makes couch gaming/surfing experience like a breeze &amp; this software does a quite an impressive job differentiating from other freeware/paid 'Controller&gt;Mouse apps' Great job developers, you guys really redeem yourselves with a quality product here.   *Pros*  + Unique Spiral keyboard. (Something you don't see from other alternative software &amp; its takes time to get used to) + Nice &amp; simple UI for customizing according to your likes.  + Rebindable controls w/ quite large amount of options to pick + Developer being committed &amp; taking advantage of feedback in Community Hub to improve this software &amp; fix major bugs. + Controls can be rebind to launch any applications of your choice + Can easily be disabled/re-enabled on fly for playing your controller supported apps/games.   Effectively, this feature extends your Big Screen game library since this allows u to play your point n' click games &amp; VNs easily with your controller. ",
            "review_score": "1"
        },
        {
            "review_text": "This program works perfectly! I use Xbox 360 Wireless Controller For Windows.  Before buying this program I had some concerns, but no worries, the developer really has thought everything through.  Even without Big-Picture the program turns off so you can play your games like you want. It works great with VLC. Doesn't turn off when using fullscreen VLC, like it shouldn't.  The 'most' unique thing about this is that you can actually turn off the controller without taking out the batteries!!  This program indeed has some neat features that are way superior than any other program out there, so the only 2 negative thing I have to say about it is that it is over 100 MB! I guess it's all the interface and the nice writing feature that holds this many bytes. It's not a problem for me, but I have been using other programs kinda like this(mouse and media features) that is only 550 KB.  As for DualShock 3 controller, DS3 (PlayStation 3 controller), it does work! You just have to use MotioninJoy, DS4Windows doesn't work for DS3, only DS4. It also work through MotioninJoy when I use my bluetooth dongle, but I will have to shut down Controller Companion first, because when I take out the USB-wire from my DS3, so it's only connected with bluetooth, Controller Companion thinks that the controller is disconnected even though it isn't, it works fine in games, but can't use CC. So shut down CC, connect with bluetooth, turn on CC and CC works fine with bluetooth connected DS3 controller.  ^I don't know if that is something that the developer from CC can actually fix, seems hard, but I hope they will.  Controller Companion FTW.  Also, it was so hard to write this review because Steam doesn't record when you use the program, only for 2 seconds. I had to turn it off and on 150 times or more oO Don't say I didn't work for this review! lol",
            "review_score": "1"
        },
        {
            "review_text": "Thanks to the new Controller Companion, my life has changed. I was looking for a cheap alternative to a girlfriend and now I've found one. It's flexible, easy to configure, no audio feedback, no artificial intelligence, and no waiting for it to get ready. I do believe I will have to get use to the feeling of the new nipples, after-all, the xbox 360 controller analog stick does flex a bit more than the standard nipple that comes with a female, but I think this will be an alright substitute. (I highly don't recommend telling your girlfriend that her nipple reminds you of an xbox 360 controller).   All in all, great substitute. 10/10 - would play with again.  [On a serious note] It is a great program for anyone who wants to use an xbox360 / xbox one controller for gaming. Very configurable. The program itself uses very little system resources. Only thing to pay attention to is that when you install it, steam records it as you always being 'in-game' with 'Controller Companion'. So your time will always go up if you have the program installed, even if your controller is not plugged in. But hey, it's $3.00, is that really a decision-making factor?  [Update] In-Game fix thanks to bnscv  - Open Controller Companion on Steam - Set the program to startup with Windows on the settings - Close CC - Go to the folder \\SteamLibrary\\SteamApps\\common\\Controller Companion and open ControllerCompanion.exe - Done, CC will open with Windows, will be always ready, and no more 'in-game' indication on Steam!  Regards, Richard YouTube: IAMRichardT",
            "review_score": "1"
        },
        {
            "review_text": "More like Lazy ♥♥♥ Companion. Best $3 I've invested in my whole life. I can now sell my legs for a thousand bucks. Btw I wrote this review using this amazing app. 10/10  ☻/ /▌ ",
            "review_score": "1"
        },
        {
            "review_text": "Great utility that should be native, but well worth the few bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Works great, even on a dated processor like mine the impact is almost unnoticable.   Thanks to this app, I can actually launch my Bethesda games from Big Picture, because Valve couldn't bother adding a feature to bypass launchers. Hell, I don't even need big picture anymore.  ",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant user-friendly utility for using a gamepad instead of keyboard+mouse not only in video games but in the OS itself. There are alternatives, including free ones, but this one is really polished and pleasant to use. Scrolling with the right thumbstick is fun!",
            "review_score": "1"
        },
        {
            "review_text": "Now I can use my gamepad to help me with work!  10/10 - would play the role again.",
            "review_score": "1"
        },
        {
            "review_text": "This my friends is a MUST BUY, my god it's made my life easier. I can finally sit on my fat A$$ and control my laptop while in bed or chilling in the living room.",
            "review_score": "1"
        },
        {
            "review_text": "Version: 1.0.0.4  Highly recommend these, its well worth the 3$ price tag on it  Works wonderfully so far, pretty easy to get use to and to use Wanted something like these for a while, but most of the ways to active something like these are not as comfortable  I will add more info on these when i have used it more, and try to see what is the max that i can do with it  I do think it needs more feathers to it, and i think it may be added over time, even that only time will tell  Even that my self i think that the 3$ price tag, is more then fair for what you get for it even with out anything more",
            "review_score": "1"
        },
        {
            "review_text": "While it should be obvious that it won't increase your typing efficiency (at all), being able to use your controller is never the less a fun and novel alternative to the traditional mouse and keyboard. As far as utility goes, using it to play away from your screen might be its most useful function. If you look at it as a novelty, however, you will certainly enjoy this piece of software. If you are concerned about its compatabillity with games. I can attest that it seamlessly switches your controller to gaming mode and when you close your game it will immediately switch back to the mouse and keyboard mode. The spiral keyboard design is also interesting.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "As an Owner of an Xbox One controller with wireless adapater this is food and water.  -Can do all the things you want to do in your PC -Play Music wirelessly :) -not fully gamepad supported game? no problem -sometimes games crash this is what you need -is your TV the second monitor? -are you Lazy? -do you like Gamepad for games? -want to play in the couch forever? -you want a powerful console? xD f - u - c - k console. XD  I recommend getting this before you buy any game on steam.",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorites apps on the makes ur lazy life way easier  ",
            "review_score": "1"
        },
        {
            "review_text": "best program ever... would have bought this program even if it was 25 euros, the virtual keyboard still needs some details... fun fact: i wrote this with my controller",
            "review_score": "1"
        },
        {
            "review_text": "This app is great, but there seems to be bugs after I customize the bindings: 1. If the LT bind key is Ctrl (default), there is no problem, but if I bind the LT to other keys (e.g: Del), it will act as if the LT is holding down all the time, deleting my text. Happened to all of my controllers so I think this is the app's fault. 2. The 'Show virtual keyboard' is bound to L-Stick by default, so, obviously, pressing it once, the spiral keyboard will be shown, pressing it again, the spiral keyboard will be closed. However, if I bind another controller key to 'Show virtual keyboard', pressing that controller key, the spiral keyboard will be shown, but pressing it again will do nothing, to close the spiral keyboard, I have to press the L-Stick, as if the show and the close one are two different keys and you can only bind the show one, the close one will always be L-Stick.  TL;DR: The LT if bind to some other keys not Ctrl, it will act like it was holding down all the time; 'Show virtual keyboard' can be bound to another controller key, but to close it, you will have to press the default key (L-Stick),  Hopefully you guys can fix these bugs.  EDIT: Devs have fixed the first bug, and I have a workaround with the 2nd one by editing the cfg file so yeah, no more problem :D I'm gonna say this is the best app for peeps who wanna ♥♥♥♥ their pc up with a controller",
            "review_score": "1"
        },
        {
            "review_text": "The weird virtual keyboard is better than it has any right to be.",
            "review_score": "1"
        },
        {
            "review_text": "Best software I've gotten on Steam to date. I can play pretty much any game with my controller now. Forget the Steam Controller and just pick this up. It even gives you the option to put mouse movement on your analog sticks and WASD on the other analog stick. You can even bind combo keys and media keys. The possibilities are endless!",
            "review_score": "1"
        },
        {
            "review_text": "Controller Companion is an application which allows it's users to enjoy of all the functions of a mouse and keyboard in a joystick, simple, but with so many customization options, and the constant contribution of the Steam Workshop Community, Controller Companion is worthy of a  HEAVYTHUMBSUP  [heavythumbsup.wordpress.com] .",
            "review_score": "1"
        },
        {
            "review_text": "This is your couch gaming option for controller + mouse control.  For a mere 3 bucks you get: - the option to rebind your controller however you want (mouse, media controls, alt-tabbing, keyboard buttons, other shortcuts) - the option to turn these controller bindings off and use the controller normally (on the fly!) - the ability to create specific controller binding profiles for specific games and have the program switch automatically!  On top of that, you can choose to run this software when your pc starts and use it turn off your wireless 360 controller without having to remove the batteries.  If your mouse is out of reach more often than not and you are willing spend 3 extra bucks, get this beautiful piece of software and add some quality of life functions to your couch gaming. (Seriously, it's just 3 bucks, don't be picky)",
            "review_score": "1"
        },
        {
            "review_text": "Does the job it says it does. Never really found myself using it much as I have a laptop. Could be awesome for PC people who wanna sit on the sofa and play though",
            "review_score": "1"
        },
        {
            "review_text": "Very helpful, anyone with an Xbox controller or any other kind of controller (I think....), connected to their computer should get this.",
            "review_score": "1"
        },
        {
            "review_text": "Works great.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for any windows steambox. Ive had connectivity issues in the past with my 360 controller. This program actually fixed them all! Navigating windows with this program and an xbox 360 controller feels very natural.  P.S. Don't full yourself into thinking the keyboard emulation will do for typing. It takes a while to get used to and typing any more than a google search can be a bit annoying.  ",
            "review_score": "1"
        },
        {
            "review_text": "This application works great I can set custom keys switch between languages now from my controller time to uninstall Xpadder.",
            "review_score": "1"
        },
        {
            "review_text": "This application works great I can set custom keys switch between languages now from my controller time to uninstall Xpadder.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely excellent! Purchased out of interest since I occasionally use joy2key so I can use my desktop from afar. nice intuitive software that just works. A must have for any gamepad partial/htpc owner. Bargain at £2 too.",
            "review_score": "1"
        },
        {
            "review_text": "It works like intended, If you want to use your controller on your pc then buy it. Watch the video they made and you will understand the concept.",
            "review_score": "1"
        },
        {
            "review_text": "No brain buy. Definitely worth the 3 bucks. The only thing that would make this program so much better is if support for the Xbox 360 controller keypad was added. Otherwise, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended...",
            "review_score": "1"
        },
        {
            "review_text": "Best 3 euro's ever spend on steam.",
            "review_score": "1"
        },
        {
            "review_text": "Always wanted to use my wireless logitech F710 to browse my PC properly. Tried various binding and free software but none worked up to my expectation. Saw this and bought it immediately. It's the best yet. I see no need to get out of my couch anymore.",
            "review_score": "1"
        },
        {
            "review_text": "In fairness there are many a software that offers what this program does but after trying this myself I found it was really fluid and kinda natural in a way. There are one or two really small bugs (nothing that stops the software though only annoying things) however I am really happy with it, especially because of how little it costs and how simple the setup is as well as the interesting mapping and keyboard spiral thingy! I would definitely recommend anyone whether its actually useful for you or merely a novelty! 9/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a grate software, I like it... 10/10...",
            "review_score": "1"
        },
        {
            "review_text": "Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic peice of software. Long time PC gamer, but Im sorry AAA titles I love to play with my A S S planted on the couch with a beer, and playing on my big screen. with a controller This is absolutely perfect for it. Been playing Killing floor 2 with it, while watching Star wars 2 on sep monitor, the ease of use on this thing is great! Onyl setbacks are 1) the acceleration system, it kind of goes to fast when dealing with 2-3 monitors and its hard to be precise with it on deskotp applications. 2) The typing system, just seems like there can be a more simple faster design. Other than that, if you plan to pc game, or use your pc at all from your couch. Get this!",
            "review_score": "1"
        },
        {
            "review_text": "Great app!!! Hope in a future it could support the xbox chatpad!!!",
            "review_score": "1"
        },
        {
            "review_text": "Always wanted an app like this one! I'm currently using a 32' Smart TV as my computer monitor, and as you can imagine I watch movies and series on this same tv ( on windows enviroment).  I used to control everything with a wireless Logitech mouse from afar, and it lagged a little bit, which can be pretty annoying at times. This app works perfectly well, it doesn't lag one bit, it's 100% responsive!  11/10!  Keep up with the good work Koga Tech Limited! Awesome job! ",
            "review_score": "1"
        },
        {
            "review_text": "Edit (6/20/2015) - Okay so I have run into a hitch. The controller will stop responding if a program brings up an administrator approval dialogue window. I am running windows 8.1 pro 64-bit. It resumes working once you approve or cancel the request though and the window goes away.  --------------------------------  I bought this so I could use my controller as a mouse with my tablet; thereby keeping with the travel aspect. It's great to be able to hold a controller, in cases where there might not be space to set a mouse.  This software works exactly as advertised and that's just amazing. The best part would have to the exent of the rebindable controls. There are plenty of options, so most people should able to easily set everything up how they would like it. The cursor feels very responsive and it's handy to be able to bind things like forward and back to a button on the controller.  The only complaint I would have, and it's a pretty minor one compared to how great this software performs, is the keyboard layout. While it is cool, it's a little bit tricky/ impractical and is not very conducive to fast typing. The spiral can be a little finicky sometimes, making it difficult to select the key that I want. Considering that is my only complaint though, should tell you enough.  I'm playing the Steam Monster Summer Sale with it right now. I'm better at rapid button mashing than I am mouse clicking it would seem.",
            "review_score": "1"
        },
        {
            "review_text": "So i have been usiong controller companion on and off for about 2 months now when lay in bed or just being to lazy to use keyboard and mouse and I have to say I love it it works well and i personally have had no issues with I completely and utterly recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Awesome now i can play nearly all the games i want to.  There was some bugs with the virutural keyboard but its fixed now.  Awesome !  10/10 controllers!",
            "review_score": "1"
        },
        {
            "review_text": "this lets you use your xbox 360 controller to control windows",
            "review_score": "1"
        },
        {
            "review_text": "This is the answer you have been looking for.",
            "review_score": "1"
        },
        {
            "review_text": "HTPC 10' away from the sofa in the living room, formerly using a Logitech K400 keyboard, if I'm having a gaming session this is way, way more convenient than repeatedly switching between kb and controller.  Desktop PC 10' away from the bed in the bedroom, formerly using a BT mouse to control the Windows 8 Netflix app, this is vastyl superior to balancing a mouse on my naked thighs whilst selecting Orange is the New Black.  Using a wireless 360 controller, everything works exactly as expected. 10/10. ",
            "review_score": "1"
        },
        {
            "review_text": "This is so awesome, it even lets you configure which buttons do the actions you want. The text input is so awesome, I love it! Can I suggest you to add a qwerty text input type? Just like the xbox or the play station. I would really love different types of text input.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best softwares I have ever bought. It is totally worths it and it is very helpful.",
            "review_score": "1"
        },
        {
            "review_text": "this the best program i ever bought  ",
            "review_score": "1"
        },
        {
            "review_text": "Works pretty darn well.",
            "review_score": "1"
        },
        {
            "review_text": "Works pretty darn well.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing help for livingroom gamers. Shame it doesn't suppot steam controller at least yet",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome app. I use it daily for my home theater pc. much better than a clunky wireless trackpad(iphone using mobile air mouse)",
            "review_score": "1"
        },
        {
            "review_text": "Best two dollars I've ever spent on Steam, hands down. Works like a charm. I wrote this whole thing using the Controller Companion, just to prove my point.",
            "review_score": "1"
        },
        {
            "review_text": "Works great at controlling Virtual Desktop while using my Oculus Rift CV1. It also comes in handy for configuring some games looking for keyboard inputs during configuration from VR.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect. It turns off the controller when you sleep/shut-down the computer, it turns its functions off during full screen gaming. Pretty much everything can be customized (you can set a function for the guide button.)   If you use a x360 controller for gaming, then buy this now.",
            "review_score": "1"
        },
        {
            "review_text": "This software an input mapper for the xbox controller and the xbox 1 controller, however it has a driver that will allow Play Station controllers to work as will. It allows an infinite number of keysets and stores them by the .exe it runs with. Once choose an .exe to apply the software to it will remember your choice and boot the key bindings every time. You must save these proflies somewhere on your computer. It also allows steam controller support to supersede its own bindings. (Thank the makers!) Overall this is the best input mapper software I have ever seen.  Recommendation: Must have for controller users ",
            "review_score": "1"
        },
        {
            "review_text": "Just perfect! It has everything that I needed!",
            "review_score": "1"
        },
        {
            "review_text": "say goodbye to your mouse yeah~",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Companion! This is the App I searched for",
            "review_score": "1"
        },
        {
            "review_text": "This is AMAZING! You have no idea how difficult it is to control your mouse with paws, so a gamepad is a lot easier!",
            "review_score": "1"
        },
        {
            "review_text": "The program is very helpful but the keyboard is very very LAGGY and Soooooo bad designed ,,, i really suggest to be like steam 'big pictures mode''s keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "I decided that I would write my first (ever!) review on Steam for controller companion. This will be a short one.  TL;DR: 9.9/10 absolutely fantastic, controller users, purchase immediately.  The purpose of this software is to bridge the mouse/controller gap, much like a Steam controller would. And to that end, it works perfectly. This is ideal for 'couch gaming' or for those of us whose computers are within reasonable reach of the bed - you can easily cruise through videos and webpages without ever going to the computer itself. In the past, I had accomplished this with very long mouse+keyboard cords, but I would have to say this is preferable.  Pretty much everything has been thought out here, with shortcuts mapped to logical places and an easily accessible help guide to rectify any misunderstandings that may arise about the controller functions. I might go so far as to call its design 'perfect' in this regard, or in other words: I've been using it for twoish weeks, and am finding new ways to be impressed with it all the time.  The only weakness of controller companion, if you can call it that, is its inability to replace the functions of both the mouse and keyboard. That's not to say that it doesn't try admirably, indeed, it does. And the keyboard popup is beautifully designed, to the point where sometimes I bring it up just to see it. But just due to the physical limitations of the controller, it can't be a keyboard replacement. I don't consider this a flaw because the developers did their absolute best to bridge the gap, and they really did quite a nice job at it, considering.  A final note I'd like to make is that controller companion handles alt+tab beautifully. You might've thought that a software which essentially has to register a connect/disconnect as it shifts the input between 'mouse' and 'controller' modes would have some fudge ups, but I've encountered none. And when I say that, please understand that I'm alt+tabbing like 50-100 times daily if I'm gaming. It has never, ever, had an issue. It's glorious. I've come to really like the USB connect/disconnect sound as I tab around-- it just reminds me of what a great software this is.  For $3, it's a heck of a lot of bang for your buck. Consider all the other things $3 would buy, and then consider that this thing offers far more convenience than any of those things. The only hassle I ever encountered was needing to find a way to be 'in-app' long enough to post this review (since it runs in background). This is, of course, not the dev's fault. Do I recommend it? Yes, absolutely I do.",
            "review_score": "1"
        },
        {
            "review_text": "I use this app on my media center and it works great!  Now I can just use my wireless gamepad while I'm in my couch in front of the TV to control everything.  Pros: -The Mouse feature works perfectly. -You can program the button functions. -You can disable or enable the app with the gamepad buttons. -You can even use non XInput controllers with a little addon app. -Very simple, functional, beautiful interface.  Cons: - I still havent figured out how to use the virtual keyboard function.",
            "review_score": "1"
        },
        {
            "review_text": "played csgo with a controller 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really amazing game, sick graphics (running very smooth in 4k). Great job, guys!   This review was typt using my Xbox One Controller (incl. Chatpad) running Controller Companion",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most useful thing I've downloaded off Steam",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this to anyone that needs a temporary solution to get a controller working for a game.",
            "review_score": "1"
        },
        {
            "review_text": "why are you reading this?  BUY IT ALREADY YOU FOOL",
            "review_score": "1"
        },
        {
            "review_text": "Finally I glitched the software out somehow into steam recognizing it running for more than 5 minutes.  This program was exactly what I was looking for around the time it came out and I couldn't be more pleased. Controller companion allows you to use any driver supported controller to control your mouse cursor and keyboard. It is eternally useful for those who want to couch game or use their PCs as a media center with their TV but don't want to keep a wireless keyboard and mouse around for aesthetic or battery or whatever reasons.  The keyboard is accessed via a spiral menu - on a 360 controller the default is pressing the left stick. This also leads to the one and only problem I've encountered with the software. Some PC games do not work well and natively support controller, as we know, so for those games you need to launch controller companion. However, for those games that do, and you have CC running when you eventually press left stick as part of the games control scheme - or on accident if you're a dumbass like me - it opens up the keyboard menu in the background and then it will constantly switch your control input between keyboard and controller until you alt tab and close the text menu. I don't know if this has been fixed yet but I don't think. Resident Evil 6 is a prime example of this and it makes it quite difficult to play if it happens.  Mouse operation, again on Xbox pad, is handled by right stick and A to left click. I am not sure of right click. Other than that, there seems to be a bit of a dead zone when you first try to move the mouse but I'm not so sure that's the software's fault.  CC also supports custom schemes and the workshop has blown up with them since it released. So you no longer have to use dodgy crap like Pinnacle Game Profiler that costs like 5 times more than this and doesn't necessarily even work.  This is $2. You won't find a better solution for controllers. Trust me, I've looked - I've used Xpadder, Pinnacle Game Profiler, neither one of them compares.  11/10 would get frustrated with text menu again.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little app - hope we get Linux version",
            "review_score": "1"
        },
        {
            "review_text": "Call me crazy for dropping $3 on a program that does what Xpadder did for free.  See, for the price of a cup of coffee, I got a product that worked 'right out of the box'.  Some features that this program has over the likes of Xpadder:  1. It comes pre-loaded with an intuitive control scheme for the Xbox 360 controller, identical to what I'd set up myself using XPadder. It's worth looking into the settings at first just to be sure of what everything does, but it does pretty much everything you'd expect with buttons to spare.  2. You can change all of the bindings, and this software works from the controller first. In other words: with this you bind your macros to the buttons, whereas with the likes of Xpadder you assign buttons to existing keyboard inputs. It sounds like a small difference, but it means that this software is purpose-built to let you control your computer with a controller.  3. This program sits in the system tray (out of sight) and automatically disables itself when you start playing games. It also has your Xbox button bound to Steam Big Picture. This means that right from the moment you install it, you can launch Big Picture mode and transition seamlessly into and out of controller-enabled games. I'm pretty sure that with some fiddling, you can bind certain button combinations to automatically start Netflix or pull up Google for a quick search.  That's why I was willing to pay for this software, and I think that you should too if you're someone interested in couch gaming. It's much easier to use than the available free software, and it comes with enough functionality to do just about anything you want.",
            "review_score": "1"
        },
        {
            "review_text": "Its so goood",
            "review_score": "1"
        },
        {
            "review_text": "Handy Little Tool That i use play no games but movies",
            "review_score": "1"
        },
        {
            "review_text": "Best thing to have for your pc when you don't wanna deal with mouse and keyboard",
            "review_score": "1"
        },
        {
            "review_text": "Helps me bury my bone without having to get up to remind netflix that I am just playing movies to sheath my meat",
            "review_score": "1"
        },
        {
            "review_text": "this is an amazing app.. really well done guys!",
            "review_score": "1"
        },
        {
            "review_text": "Works perfectly and is a very streamlined program! I love it! The keyboard function I was skeptical about but it actually is incredibly useful for using your computer from across the room. I dont see myself writing any long paragraphs with it but it is absolutely great for searching or typing quick texts.",
            "review_score": "1"
        },
        {
            "review_text": "Another Steam steal!!! Take your pc and place a it in your lap with Controller Compaion!  Pros: ease of use price  cons: Controller not included ==&gt; LOL  Great I strongly recommend... A gammer must have ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those applications that do EXACLY what i wanted it to. I have a Wireless Xbox One Controller, I bought a wireless windows 10 adapter, and couldnt figure out how to use the home button to open Big Picture mode so i could sit on my couch and launch a game just by picking up my controller. This application does EXACLY that plus when i dont want to play a game i can use the controller to do basic windows functions without ANY setup.  I dont review any software. I went out of my way to find out how this time because this application deserves it.",
            "review_score": "1"
        },
        {
            "review_text": "I originally bought this program for Contorller support on old games. Works like a treat. Workshop game profiles are available to get you started. Don't forget to set in game control settings to Keyboard and mouse, so you can map keys from those input devices. Now i use it for everything. It's the best three bucks i have spent on Steam so far.",
            "review_score": "1"
        },
        {
            "review_text": "Great app! 10/10 Would buy again! I love that there is a workshop for this! it has proven VERY useful! The one 'flaw' I have found with this is I absolutly dislike the keyboard... it is hard to use, and I would really appreciate it if you updated this app so I have an option to pick the current keyboard or a keyboard like the X-Box 360 keyboard.  Please and Thank You.  - --  GaminCreeperYT",
            "review_score": "1"
        },
        {
            "review_text": "Does exactly what it's supposed to do. Clean UI, Simple, Workshop profiles.   Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Works perfectly and is a very streamlined program! I love it! The keyboard function I was skeptical about but it actually is incredibly useful for using your computer from across the room. I dont see myself writing any long paragraphs with it but it is absolutely great for searching or typing quick texts.",
            "review_score": "1"
        },
        {
            "review_text": "Its awesome in general. works with most controllers i have My only problem is that it doesnt work with my wii u pro controller (of which i have connected to my pc succesfully.) Please add DirectInput support. #pcmasterrace",
            "review_score": "1"
        },
        {
            "review_text": "The mouse function works well enough, but the spiral keyboard replacement has terrible flow. I'd be better off with the hunt-and-select keyboard emulation from a console.",
            "review_score": "-1"
        },
        {
            "review_text": "Straight up just does not work with my xbox one controller. The only time the controller is able to manipulate anything on the computer is when the program itself has focus.  It also either renders the keyboard completely unusable, or forces it to act as if the control key is always held down.  I also now have to wait around another 4 minutes just to be able to post this review. Good try, guys.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this program to hopefully play steam games with a controller and was extremely disappointed (after I bought my friend and I both copies) that It wouldn't connect my controller. I don't know if I am doing something wrong but I wasted around $7 for nothing. If I could connect my controller I think that I would love the product, hopefully there is a fix to this problem and my friend and I can use this program in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "PS3/PS4 controlers do not work even with the patch installed, and for some odd reason cant get a xbox controler to work ethier. 3/10 i give 3 for the idea.",
            "review_score": "-1"
        }
    ]
}