{
    "app_id": 367700,
    "name": "SHOFER Race Driver",
    "release_date": "2015-06-30",
    "developer": [
        "Zhoori Maang Entertainment"
    ],
    "publisher": [
        "Zhoori Maang Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Indie",
        "Simulation"
    ],
    "achievements": 25,
    "positive_ratings": 17,
    "negative_ratings": 62,
    "price": 6.19,
    "description": "SHOFER Race Driver takes you deep into Middle East. Real cars, real tracks and also … . Some local music. Unlock new cars and tracks by participating in series of races and don’t worry about anything, because you’ll never be left alone, your partner lady will contact you to get you out of any trouble.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/367700/header.jpg?t=1459173789",
    "minimum_requirements": "OS: Windows XP, Vista, 7 Processor: P4 2.0 GHz Memory: 1 GB RAM Graphics: 1 GB RAM, GeForce 8800 or Radeon Storage: 6500 MB available space",
    "recommended_requirements": "OS: Windows XP, Vista, 7 64-bit Processor: 2.5GHz dual core CPU Memory: 2 GB RAM Graphics: 2 GB RAM, GeForce 8800 or Radeon Storage: 6500 MB available space",
    "reviews": [
        {
            "review_text": "If Adam Sandler was to make a video game, that would be it.  Nothing in this game makes any sense. Real roads from somewhere in the middle east with balloons everywhere. Real cars on the screenshots and videos, but badges are missing in the game ( to avoid paying licencing I suppose ). The 'rubberband AI' seems to crash constantly. UI design looks as if it was drawn by a 12 year old with crayons. His favourite colours were obviously toxic green and pink.  I wish I could say something about the handling, however the game doesn't really have 360 controller support. It does seem to detect the input, but there is no way to reassign key mappings. I used to accelerate with the 'X' button back in 2002, trigger support please. The arrows seem to control both the car AND the chase camera. I dont understand how in a team of 10 people that made the game they all thought this is a great idea. If I want to steer my car left, that also rotates the camera left and I have no idea where am I going anymore.  On the plus side, congratulations to the developers for trying. This is the first game I have ever played from their country so I applaud their ethusiasm. However they should have started with something simpler. A Mario Kart clone maybe?  My review is negative for the obvious reasons, but by all means please buy this game. I suspect it will be taken down due to licensing in the next few weeks. Now is your chance to get it and show it to your friends after you have finished watching 'The Room'. A cringe classic in the making.",
            "review_score": "-1"
        },
        {
            "review_text": "dev abandoned the games. version 1.0 is unplayable. don't buy it if it will be patched in the future (and I don't think it will happen). i regret my money, don't do the same error, even if the game is on sale. 1/10.",
            "review_score": "-1"
        }
    ]
}