{
    "app_id": 368160,
    "name": "WORLD END ECONOMiCA episode.02",
    "release_date": "2015-07-21",
    "developer": [
        "Spicy Tails"
    ],
    "publisher": [
        "Sekai Project"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Visual Novel"
    ],
    "achievements": 0,
    "positive_ratings": 161,
    "negative_ratings": 8,
    "price": 9.99,
    "description": "From the creator of Spice and Wolf, Isuna Hasekura, comes World End Economica. Haru woke up with his life but without his dream. 4 years after the incident, he finds a new cause, as a driven young lady offers him a chance to return to investing and to find justice.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368160/header.jpg?t=1523055441",
    "minimum_requirements": "OS: Windows XP or higher Processor: 1.2 GHz Pentium 4 Memory: 256 MB RAM Graphics: 1280 x 720 DirectX: Version 9.0c Storage: 2 GB available space Additional Notes: For the original Kirikiri release",
    "recommended_requirements": "OS: Windows 7 or higher Processor: 1.66 GHz Intel Atom Memory: 1 GB RAM Graphics: 1280x720 compatible display (2560x1440 recommended) DirectX: Version 10 Storage: 2 GB available space Additional Notes: For HD edition",
    "reviews": [
        {
            "review_text": "WORLD END ECONOMiCA Episode 2 is the sequel to the first game bearing the same name. Like in the first episode, you take on the role of Hal/Haru although the events take place 4 years after the end of episode 1. As this is a kinetic novel, again, I'll do my best not to give away spoilers. So basically, Haru is in a place where he has moved away from investing, stocks, the business world, etc. He is now in university, majoring in legal studies. Although most of the characters from episode 1 make a return here, one very important character, Hagana, has disappeared and Haru feels responsible because of how he behaved towards her. Of course, there are new characters as well but I'll get to them soon. So this is Haru's life until a chance encounter with a young woman, Eleanor, motivates him to return to his previous life. However, he clearly isn't the same person as he was 4 years ago so he makes his decisions more cautiously now. As you delve deeper into the story, you find out the reason that Eleanor really wants Haru's help with her company as well as Haru's emotional issues that developed at the end of episode 1. There is more character development as well, such as the changing relationship between Haru and Chris (Hagana's math student from episode 1). The end of episode 2 leaves off on a cliffhanger, more so than in episode 1, although I'm clearly not going to reveal what that is. ;)  Compared to episode 1, I liked episode 2 more. I felt that the events moved at a faster pace although it is understandable. (Usually, in trilogies, the first one sets up the story so events move slower while they pick up in the second and third ones.) Also, I liked the new characters, especially Eleanor. At first glance, Eleanor appears to be a young noblewoman who has fallen from grace but it turns out that there is so much more to her once Haru spends time with her. The story was great and I loved that cliffhanger. (It's a good thing I recently bought episode 3 so I can find out how this trilogy will end. XD) The one critique I have with the writing is the lack of proofreading again. There were clearly typos, grammar errors, etc., that really should have been ironed out before the game's release. (I do wonder if the devs use a professional proofreader to check the English writing of their games. If not, they really should.) The art was beautiful although the style was different from the first episode so that takes getting used to. Music tracks were great and placed appropriately and again, I liked that both the music and CG gallery were unlocked after you finish the game. I tend to like looking at all of the CGs I unlocked. XD   Overall, I enjoyed this sequel of WORLD END ECONOMiCA and I can't wait to play episode 3. The end of episode 2 reveals that a major character will return and I can't wait to see the events unfold. I should note that although episode 2 is a sequel, it isn't necessary to have played episode 1 although it does help. ^^",
            "review_score": "1"
        },
        {
            "review_text": "A story that has proper character arcs and deep characters. A touching story that has no clear good or bad sides. Each party have their struggles and you have to make the right choices for you.   One of the best new stories to be enjoyed out there with only a few cliches. Superb translations and great dialogs. The art is also very good.   Interesting theme: economics. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's just bland ♥♥♥♥ing amazing. I'm 20% through the episode 2, I guess I'm sad Hagana doesn't appear... If episode 3 comes out I hope Hagana comes back.  I really enjoyed the episode 1, so far I'm enjoying episode 2 aswell.  The plot is really good.  I'm really addicted to the game.  EDIT: I apologize if I looked like a dumbass  Episode 3 is currently on Greenlight.  SPOILER:  It appears Hagana will be coming back in episode 3",
            "review_score": "1"
        },
        {
            "review_text": "Since 132/140 people found my WEE Vol1 review helpful, I felt compelled to write a WEE2 review.  One of the main problems I had with Vol1 was that the main character was... somewhat unlikable. But it's changed dramatically.  The orchestral performance was one of the strongest points of Vol1, and it's only improved since.  But most importantly, the plot is incredible. Let me tell you, this story is truly deep.    Some quotes below:  'The pursuit of justice itself has become sullied in evil.'  'This ♥♥♥♥♥♥ world... it should just vanish.'    Overall rating 9/10 cannot wait for Vol3 and the conclusion. Hopefully we'll get choices in Vol3, rather than being railroaded down this path.    Poor Chris... Although, I think I support the Eleanor ship.  ",
            "review_score": "1"
        },
        {
            "review_text": "Only Isuna Hasekura is able to write these kinds of stories",
            "review_score": "1"
        },
        {
            "review_text": "Finally finish this story full of train feel.... wonderfull story totaly worth the money payed even more. downside of it will be getting the feeling of cliffhanger so to people who don't want to feel down just wait for ep 3 to release before playing it. i give 4.5/5 ratting for this game because there is some word that isn't fitting there but overall it is a good.",
            "review_score": "1"
        },
        {
            "review_text": "I'm currently around half-way through Episode 2 and I'm really impressed with the story so far. Having completed Episode 1 and really enjoying that, there are a few minor concerns but nothing that can't easily be fixed for the next game update.  Firstly I really think there should be consistency between the 2 episodes on the spelling of character names when translated from Japanese. Too many characters names have changed in spelling (Hal-&gt;Haru, Lisa-&gt;Risa, Serault-&gt;Cerrow) that it has become distracting. please update at least one of the episodes to be consistent with the other.  Secondly Please do a spell-check of the text/dialogue I've noticed a few minor spelling mistakes along the way.   Otherwise these two episodes so far are the first visual novels I've played. I've been really impressed with the story and some of the conversations made me laugh quite a bit. The moral dilemas and consequences of people's actions in this environment have a very strong and important message about the good and bad things about the world of finance and investing today. Finance and Investing are not things I've ever been interested in until I read and watched Spice &amp; Wolf, these worlds that look at economics as a way to tell stories with strong characters have been an absolute treasure.   Thank you Isuna Hasekura for these wonderful stories if you ever read this review!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful kinetic VN, much like the first WEE, the characters really make you feel for them, the music, artwork, and story are all wonderful.  It took me about 8 hours to read through the whole story, so decent length as well  The only complaint I can think of would be a few typos and grammatical errors, still a very polished release over all",
            "review_score": "1"
        },
        {
            "review_text": "I really liked this. About an 8-9 hour read but it cliffhangered! Unlike Part 1 which seemed fairly self contained.",
            "review_score": "1"
        },
        {
            "review_text": "Follows the same recipe as the first game, the conclusion was very exciting!",
            "review_score": "1"
        },
        {
            "review_text": "The games don't always have the best pacing and structuring, but setting that aside they are still a worthwhile game to play. If you enjoy visual novels, I would totally recommend this game if you're looking for another VN to play. If you are a sucker for piano music and emotional stories, even if they aren't the most well presented, this game is a no-brainer.",
            "review_score": "1"
        }
    ]
}