{
    "app_id": 368150,
    "name": "Rising Angels: Hope",
    "release_date": "2016-03-18",
    "developer": [
        "IDHAS Studios"
    ],
    "publisher": [
        "Sekai Project"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 18,
    "negative_ratings": 4,
    "price": 10.99,
    "description": "Rising Angels: Hope is the visual novel of Faye Moonfallow, her squad of somewhat loveable misfits, and their dreams of joining the Katajion Space Force.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368150/header.jpg?t=1529373002",
    "minimum_requirements": "OS: Windows XP Processor: 1.2 GHz Pentium 4 Memory: 1 GB RAM Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I played Rising Angels: Reborn prior to this and that is how I ended up finding Rising Angels: Hope. At first I was a little bit hesitant because of the price, but after looking at the artwork (which is fantastic, btw!) I took the plunge and don't regret a thing. This visual novel was amazing! My favorite to date!  All characters are interesting and well developed and the storyline is solid. The balance between positive and negative events is good and most conflicts or problems are resolved quickly enough that the stress that they induce isn't too bad. I get heavily emotionally invested in games and visual novels, so a drawn out conflict resolution can be quite stressful. The character subtleties and backstories are also very well thought out and well implemented.  Without giving away any specifics; there is a plot outcome in Rising Angels: Hope that I have never seen in a visual novel before that left me speechless when it happened. Never has a plan gone so wrong so fast in anything other than real life.  My final rating is definitely 10/10. I hope (hehe) that the continuing adventures of this crew will come out soon! I can't wait to see what they get up to!  If anyone is still reading this far, I have one final word about the price. It is somewhat higher than many other visual novels, but the production value is high. The artwork is fantastic, the music is well done and suits the mood of each scene very well and the writing is great. For the cost of going out to see a 2 hour movie at the theater; you can have an 8 hour adventure with a handful of great characters. If I see anything from this studio again; I will not hesitate to jump on it even at full price.",
            "review_score": "1"
        },
        {
            "review_text": "I very much dislike the fact that your unable to chosse who you fall in love with. Also I rather chosse any other female character for Faye to fall in love with. No at all found of Lenna, Would rather Faye fall in love with Lotor.",
            "review_score": "-1"
        }
    ]
}