{
    "app_id": 368680,
    "name": "Super Mutant Alien Assault",
    "release_date": "2016-07-11",
    "developer": [
        "Cybernate"
    ],
    "publisher": [
        "Fellow Traveller"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 17,
    "positive_ratings": 81,
    "negative_ratings": 4,
    "price": 7.19,
    "description": "The Citizen Kane of Super Crate Box clones - dance with death through randomised rooms to clear your space freighter of irradiated aliens in a brutal arcade platformer shooter stuffed to the brim with unlockable weapons, explosives, special abilities and defense moves.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368680/header.jpg?t=1532351671",
    "minimum_requirements": "OS: Windows XP Processor: 1.2GHz or faster Memory: 1 GB RAM Graphics: 256MB of video memory Storage: 150 MB available space Additional Notes: Best played with controller.",
    "recommended_requirements": "OS: Windows XP Processor: 2Ghz Memory: 2 GB RAM Graphics: 1G of video memory Storage: 300 MB available space Additional Notes: Best played with controller.",
    "reviews": [
        {
            "review_text": "1. Have you played Super Crate Box. IF 'Yes', GO TO (3). IF 'No', GO TO (2)  2. Go find Super Crate Box on Steam and Play it (It's free), and then GO TO (1)  3. Did you enjoy Super Crate Box enough to spend money on a deeper, expanded experience? IF 'Yes', GO TO (4). IF 'No', GO TO (6).  4. Is this concept worth spending $10 for you? IF 'No', GO TO (5). IF 'Yes', GO TO (7)  5. Put the game on your wishlist and wait for sale then GO TO (7)  6. Avoid this Game. It's clearly not for you.  7. Buy this game! It takes everything that is great about Super Crate Box and expands upon it in interesting ways. Certainly worth the buy if this is a genre that interests you.",
            "review_score": "1"
        },
        {
            "review_text": "It wears its influence(s) on its sleeves but overall seems to add enough to be enjoyable on its own merits. Add to that the great art and (not surprisignly) Vlambeer-ish polish and out comes a fun experience.  My biggest issue would be longevity. I am not sure yet how higher difficulties might change this but I beat all four stages on normal on my third try and ~45 minutes. This surprisingly also included all bosses without having them seen them before, take that as a sign of fairness or too low difficulty as you will. While I definitely will come back to unlock more and try myself against higher difficulties I don't think that it has enough raw content to hold up after you can consistently beat it unlike something like Risk of Rain or Binding of Isaac. So I definitely recommend it to anyone who enjoys this kind of rouge-lite 2d gameplay and who doesn't demand dozens or even hundreds of hours out of every game.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't even aware of this game untill TotalBiscuit reviewed it a while back. Basically, you play as robots scrambling to get all sorts of weapons from crates and/or machines. Then, you attempt to fend off aliens while trying to complete a randomized goal. I tried the 2 player local-coop (with controllers) and it was a lot of fun.",
            "review_score": "1"
        }
    ]
}