{
    "app_id": 368600,
    "name": "Terra Nova: Strike Force Centauri",
    "release_date": "2015-07-23",
    "developer": [
        "Looking Glass Studios"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 44,
    "negative_ratings": 1,
    "price": 4.79,
    "description": "Lead an elite fighting team battling for freedom from the sinister forces of the Earth Hegemony. Engage in combat on the bloody battlefields of four unique worlds. Encased in your Powered Battle Armour (PBA) you are an unstoppable fighting force.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368600/header.jpg?t=1466791210",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 800 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 800 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "18-09-2016: Updated review after second playthrough: added some lines, fixed a few errors.   This review does not go into details of how the game works, nor does it mention everything. It only broadly explains what you can expect when playing it.   So, one would hear about this game, and would at first glance think: Well, this game looks interesting, let's give it a try, right? It's made by Looking Glass after all! (sounds a whole lot like me ;)  And then you play it. Holy crap, this game is amazing. Complexity unlike i've ever seen before, to the point that I have learned so much to fill a whole game at my second playthrough alone. one of the best soundtracks i've ever heard (albeit pretty biased), a story that starts very cheesy but then keeps punching you in the face with plot-twists and the gameplay is nothing short of excellent either.   About the story, do your research (in-game), or you won't understand much of it. I highly recommend you to read all of the information they give you between each mission, and before the story really starts, no matter how long it takes. Playing this game without a good understanding of the storyline just takes too much away from the attractiveness of the campaign.  Weapons and equipment that felt useless at the default difficulty setting suddendly become much more important at higher difficulty settings, which keeps the game fresh for at least a second playthrough, although you're still going to stay fairly close to your preferred setup.  Oh yeah, this game is NOT easy, expect to die a lot while you refine your strategies and personal skills.  Talking about setups, this game provides a ton of possibilites to prepare and plan your strategy before, and during each mission, by allowing you to choose your squad members (should i pick a repair or electronics, etc. expert on this mission?), their equipment pieces of equipment, decide in which way they handle combat situations and what they should follow.  This brings us to your squad members. Depending on the orders you give them, they can work greatly to your advantage or get themselves killed in seconds. Per example, 'Cautious attack' isn't a 'Only attack when it's relatively safe', it's a 'Always attack, but through the safest route possible'. You can guess, taking the 'safest route' to a massive squad of enemies is still going to get them killed very quickly. So, you take the next option in the list, 'Take cover'. While this works excellent to keep your squad alive at all times, If your squad spots an enemy just once, and that person doesn't come towards you but runs instead, they will stay at their nearest cover forever. So you walk towards your enemy to engage in combat and wonder where you squad is, to die on your own shortly after.  These are good examples of how good and bad strategies can unfold, and why it's important to be flexible and change your strategy in the middle of a mission, or in combat even. This important decision-making at all times and getting your carefully planned strategy to work (imo) is biggest charm of the game, and is one of the biggest factors to this game's high replay value.   Sounds awesome right, a game with absolutely no flaws! ...Well, even though i would love to say this, there are some tiny nitpicky things i have to mention. The videos sometimes don't play, but a simple reboot (or pressing alt + enter to switch to windowed mode) of the game fixes this 4 out of 5 times.  Afterwards, you start a mission, but i screwed up and i want to retry. Maybe i still need to get used to the quite clunky controls yet (which feel surprisingly natural, but still difficult if you're willing to learn them). But I haven't read this game's 46 page manual to find out where the pause button is (this is mentioned no-where else). Aaaaand, i ran out of explosives to kill myself. So i shoot my teammates excessively, and they call me a traitor and kill me. ...Wait a minute, i can do that? How much attention for detail does this game actually have? I am supposed to talk about the negatives now but i can't even stop myself from noticing even more good points of this game! This should really tell you enough, JUST BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "I've only played this game for a few missions but I'd like to provide a review as a Mac user.  This game has a lot of audio stuttering. I'm running it on a standard 2014 macbook pro running OS X 10.9.5. That's pretty much it. Graphics are fine, controls are fine. CMD+F transitions from windowed to full screen mode easily, even if the game freezes. The only time I have a consistent error is when exiting game from the save screen, this returns you to the start up menu but, on my computer at least, the windows of this screen get all wonky and the best way to exit is just to hit CMD+F and close the game from outside.   Having mentioned all that, the game runs very well. It's fun. The story and acting are interesting and well done for the era. If you grew up playing games like this, but never tried this one, I can recommend it with a clear conscience. I personally really enjoyed games like Wing Commander, Descent, Terminal Velocity, and Mech Warrior, and this game seems like a bit of a forgotten gem from the era of real 3D action on CD-ROM featuring an amazing 255 color palette. Maybe you didn't even play these games using a mouse.   Anyway, its a bit wonky but very playable.",
            "review_score": "1"
        }
    ]
}