{
    "app_id": 368640,
    "name": "htoL#NiQ: The Firefly Diary / htoL#NiQ-ホタルノニッキ-",
    "release_date": "2016-05-18",
    "developer": [
        "Nippon Ichi Software, Inc."
    ],
    "publisher": [
        "NIS America, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Strategy",
        "Cute"
    ],
    "achievements": 24,
    "positive_ratings": 256,
    "negative_ratings": 65,
    "price": 6.99,
    "description": "In the depths of a labyrinthine ruin, a young girl named Mion rises from a deep sleep. Lost, alone, and with no memory of how she got here or where her parents are, she is greeted by two fireflies—one composed entirely of light, and another who lurks among the shadows.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368640/header.jpg?t=1513883860",
    "minimum_requirements": "OS: Windows 10/8.1/7/Vista Processor: Intel Core i3-2310M 2.10 GHz Memory: 2 GB RAM Graphics: Intel HD Graphics Family DirectX: Version 11 Storage: 2 GB available space Sound Card: Realtek High Definition Audio",
    "recommended_requirements": "OS: Windows 10/8.1/7/Vista Processor: AMD A10-5800K APU with Radeon™ HD Graphics Memory: 2 GB RAM Graphics: NVIDIA GeForce GTX 560 Ti DirectX: Version 11 Storage: 2 GB available space Sound Card: Realtek High Definition Audio",
    "reviews": [
        {
            "review_text": "It's a port of a 'indie' Vita game released by NIS a few time ago.  It's was a very frustrating game on it's original console (Since originally you were supposed to control the fireflies with the touch screens on the devices, they eventually patched it to support analog control, but even those weren't optimal); but this being on PC's, being able to use a mouse feels like a godsend and definitely alliviates the frustration, even though it still can be a pretty frustrating game. I mean, sometimes it can be tough to make Mion stop doing something and so something else.  It does have a really good atmosfere, and I can appreciate that this game basically has no dialogue (Only lines of text you'll see in the game are the tutorials), so if you consider yourself a patient person, I'd recommend giving this a try if you're looking for a short cheap game.  PC port is capped at 30FPS, but the developers made a pretty good post explaining why is that (It's on the discussion forum); you can change resolutions too, but since it's a fully 2D game, you'd be just scaling the images up and down, which doesn't look too hot. Also, you can play it with mouse only; it puts some buttons on the screen, which kinda hurts the atmosfere, but hey, it's great if you want to play the game on a tablet or something.",
            "review_score": "1"
        },
        {
            "review_text": "htoL#NiQ is a game that's hard to love, hard to hate, and even harder to pronounce. In terms of gameplay it plays a lot like Ghost Trick, where instead of controlling any character directly you control a pair of fireflies who can interact with the environment in different ways to lead a small girl around. Sometimes this works fine, and sometimes it doesn't, like when you're trying to maneuver a crate and Mion keeps climbing on top of it or when you try to take control of a plant and end up dying in the time it takes to figure out how to release control of it. It's at its worst in some of the boss encounters that are just not built for this sort of delayed reaction control style. But the puzzles and atmosphere are great, and there's probably a good story somewhere in there that I couldn't interpret. If you like Ghost Trick, anger management therapy, or watching small girls die over and over then htoL#NiQ is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: At the time of this review most of my experience with the game comes from completing the Vita version. That being said the port seems very well done. The visuals are upscaled and fine details are much easier to see. It runs great and I haven't had any technical issues yet. The mouse controls are also fantastic and work very well for the game, better than any method on the Vita. And the sound design is also improved, which is a huge plus because the game has amazing music.  With that out of the way, I love this game. It is however difficult to recommend to everyone. It's a game meant for people who like frustrating but fair games, and who can forgive some gameplay shortcomings for atmosphere and presentation. That being said, the game still provides quality gameplay and interesting puzzles. At its heart, htol#niq is a puzzle platformer, mixed with a bit of classic escort oriented games. The story is presented entirely through environment and gameplay.   If this sounds like your kind of game, I would strongly recommend Firefly Diary.",
            "review_score": "1"
        },
        {
            "review_text": "Timing based tests of your command of the clunky control system are not what I would call 'puzzles' and the frustration from dying repeatedly is not nearly worth the satisfaction from succeeding. Buy this game if you like atmosphere and hate fun.",
            "review_score": "-1"
        },
        {
            "review_text": "  The art, and simplicity of this game will have your eyes peeled to this game.  Soothing soundtracks that ease into your conciousness and guide you along the way into the puzzles this game has to offer.  This game has me wrapped and the surprises this game has shown me so far, you shouldn't doubt a cute looking game.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say; this is one of my favorite horror games yet :) It isn't really scary; it certainly has a darker atmosphere though. The main complaint I would have is that the gameplay is EXTREMELY frustratingly difficult, up to the point where the puzzles can be bullsh*t, but I will admit; it has perhaps one of my favorite protagonists from any 2D game i've ever seen! Mion is such a precious soul; and I wanted to get through the game to make sure that the precious antler child would be safe ^^ heck, I'm even making fanfics with Mion ^W^ I HIGHLY recommend this game; as the community needs to see this hidden gem of a horror game. The artstyle is fantastic, the story is mysterious yet extremely tragic and emotional, and it's an EXTREMELY challenging game. I recommend this game extremely ^W^ I give this game a 10/10, hell! I'd give it 20/10! Even though I've finished the game; I can't stop thinking about Mion, she's one of my all-time favorite characters in gaming history :)",
            "review_score": "1"
        }
    ]
}