{
    "app_id": 368780,
    "name": "President for a Day - Corruption",
    "release_date": "2015-08-05",
    "developer": [
        "Serious Games Interactive"
    ],
    "publisher": [
        "Serious Games Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "achievements": 5,
    "positive_ratings": 24,
    "negative_ratings": 24,
    "price": 1.99,
    "description": "President for a Day- Corruption gives you the opportunity to assume the role of an African president. As such, you must make controversial decisions revolving around topics such as: democratic evolution, corruption, development aid- and cooperation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368780/header.jpg?t=1447373989",
    "minimum_requirements": "OS: Windows Vista Processor: Intel Core 2 Duo Memory: 1 GB RAM Graphics: Intel Graphics / 512MB VRAM Storage: 100 MB available space Sound Card: Compatible with DirectX®: 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " tl;dr: Interesting and depressing depiction of the issues plaguing Africa in strategy game form. Short and ocassionally frustrating/unsatisfying, but if you want strategy game with mechanics based on social commentary, consider checking this out.   I think I see what they're trying to do, and it is quite admirable. It's a simple little strategy/resource management game in which you try to lead a non-specific African nation to 'victory' (as in, clear the scenario with the highest score). You have several presidents, including the corrupt elite, the military dictator, the Nelson Mandela-esque character, and so on, each of which has a different bonus condition and a different benefit for achieving it, which grants at least the  appearance  of replayability.  Each turn, you have to move your engineers and armies around, dealing with events and crises as they come up. An in-game news feed will hint at the larger events that you'll have to deal with, but you'll usually have to deal with things as they come (although repeated playthroughs reveal a certain consistency with events).   If I am correct, the thing that distinguishes PFAD: C is how it tries to convey the really crappy situation that many African nations have had to deal with in modern times through its game mechanics. For example, foreign powers are the absolute worst. Seriously. !@#$ the West.   In many respects, this frustration is a good thing. However, the game doesn't quite click in the way you'd hope something that dealt with this subject matter would. It's also quite short, with four scenarios, and it might not hold your interest long enough to figure out how to 'beat' them all with the best outcome.  While I'm definitely mixed on the execution, it is interesting enough to warrant a recommendation in my eyes. It might not satisfy, but if you approach it with an awareness of the subject matter, it might actually get you thinking in ways you wouldn't otherwise expect.",
            "review_score": "1"
        },
        {
            "review_text": "Cool cencept but poorly excuted. I truly hope the devs can learn from their mistakes and develop the game machanics a bit more. It's very difficult to understand what is happening and information seems hidden beneath layers of poorly drawn animations. Better animations might make the game alright enough to give it a thumbs up dispite the lack of gameplay. However it just doesn't warrent the full price. If they want more than 99cents for this one don't waste your money.  Again, very cool concept that could be salvagable, however the current state lacks even an options screen to play the game in a window.",
            "review_score": "-1"
        },
        {
            "review_text": "This is just a really short review and it will be completed in the future. Maybe it is not a real review and I give you just my shots about the game.  The game is setteled in Africa and you lead a different country in the missons, which differ in their difficultiy - I think that the easiest mission is most ♥♥♥♥♥♥♥♥ mission :) . Also you got a fixed time for every mission, e.g. 13 turns this is means you can just make 13 different moves with one army. I just wanted to give you a brief glimpse. I will extend the review after my breakfast.",
            "review_score": "-1"
        }
    ]
}