{
    "app_id": 368830,
    "name": "Adventure in the Tower of Flight",
    "release_date": "2015-12-23",
    "developer": [
        "Pixel Barrage Entertainment, Inc."
    ],
    "publisher": [
        "Pixel Barrage Entertainment, Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 28,
    "positive_ratings": 73,
    "negative_ratings": 11,
    "price": 3.99,
    "description": "Adventure in the Tower of Flight is a retro-styled platformer in which you fly instead of jump! You are Wing, a young adventurer. Wing must climb a seeming endless the tower and collect all five known relics held within to become the ruler of the known world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368830/header.jpg?t=1520553143",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core 2.0ghz Memory: 512 MB RAM Graphics: gForce 8800 DirectX: Version 9.0c Storage: 350 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Dual Core 2.4ghz Memory: 1 GB RAM Graphics: gForce 260 DirectX: Version 9.0c Storage: 400 MB available space",
    "reviews": [
        {
            "review_text": "Adventure in the Tower of Flight review ( Also on  Supergamezeit.com  )  In terms of video game releases, there’s usually a drought during the summer season, as publishers are prepping their triple-A titles for a fall/holiday release.  Oddly enough, that doesn’t seem to be case this year. The Witcher 3: Wild Hunt eased us into the summer at the end of May; in June, The Elder Scrolls Online came to the PS4 and Xbox One, Final Fantasy XIV received its first major expansion with Heavensward, and finally, Batman: Arkham Knight headlined the month; nothing notable in July besides Deception IV: The Nightmare Princess, God of War III: Remastered, and N++; things pick up again in August with the pair of Sony exclusives Until Dawn and Everybody’s Gone to the Rapture.  With such a busy summer, it’s even stranger, that I found myself playing Adventure in the Tower of Flight, a debut indie title from developer Pixel Barrage. But hey, just as my appetite for 2D action platformers was satiated with Shovel Knight, it’s been hollow ever since I completed it, and this looked as if it could fill the void.  What is it?  Adventure in the Tower of Flight is a retro-styled 2D action platformer. Assuming the role of Wing, you’re tasked with ascending a tower in search of five relics, with hopes of becoming “ruler of all known land”. Just as in the era of the games it emulates, the story here is bare bones and only serves as a means to get you into the action. Adventure in the Tower of Flight wears its inspirations on its sleeves, and it permeates every aspect of the game, from the visuals, sound, presentation, and most importantly gameplay.  The tower that you’re climbing is split up into different areas (essentially worlds), with their own thematic rooms. The level design is top-notch, as each room is impressively crafted, and makes use of all the screen real estate, both vertically and horizontally.  There are two types of currency (in the form of treasure) to collect throughout the game: gold, represented as coins and jewels, and magic feathers. Treasure may be found on the bodies of dead enemies or hidden behind destructible sections of the environment. The treasure can eventually be spent on a limited variety of items found in various shops scattered throughout the game, but unfortunately, these lack diversity, largely being made up of health refills, extra lives, instant revive bottles.  How does it play?  I’m happy to say, the movement is extremely tight; no momentum on your run speed or slipperiness. As far as jump trajectory, here’s where the main gameplay mechanic comes into play. Just as your name implies, you have the ability to hover in the air for a certain period of time. This is measured by a meter in the upper left corner of the screen; the longer you hold jump, the faster it will deplete. If your timing is impeccable, you’ll be able to remain airborne for as long as you like. With what could’ve been a mere gimmick, it’s used extensively throughout the game, as you are constantly ascending up this tower. Plenty of situations, with tricky platforms and devious enemies, require you to have a mastery of the mechanics in order to proceed.  How’s the presentation?  Out of all the retro-styled games I’ve played in the last few years, and there’s been a lot (far too many actually), Adventure in the Tower of Flight distinguishes itself from the competition, partially due to the restraint the developers show; it succeeds by not doing too much out of the ordinary, so if positioned alongside native NES titles, it wouldn’t look out of place. The models aren’t overdone, showing just the right amount of detail to provide personality and differentiate from each other. Similarly, a familiar palate of primary colors provides the backgrounds with the right blend of diversity and familiarity.  Just as the visuals were carefully created, the sound design is another aspect that harbors the essence of the era. Naturally, being in the constraints of its inspiration, there’s only so much they can do here without overstepping the boundaries they’ve set for themselves. With that being said, the sound design is great. There’s just the right amount of crunchiness and distortion to certain sound effects, and the music is wonderful. The melodies become infectious and each theme has enough breakdowns to never become repetitive.     What didn’t you like?  As my time with the Adventure in the Tower of Flight was thoroughly positive, when I did come across certain parts of the game that soured me, they were more prominent. My biggest issue with the game was the boss battles. For a game that’s so well designed, it was surprising that nearly every boss battle felt uninspired and brainless. Central to the problem was their lack of attack patterns; because of their predictability, they never posed a threat. The only enjoyable boss battle came at the end of the game; by constantly keeping you on the move without a moment of respite, the boss forced you to leverage all your moves in order to survive, resulting in a legitimately difficult and fun fight.  I also had an issue when the game tried to get out of its comfort zone and offer a bit of exploration; it’s very minor, as it only occupies a small percentage of the game, but still worth noting. There’s a point where you come across a small village half-way up the tower, but in order to progress, you need to obtain a key. The problem is that the NPCs are very vague in offering you information on the steps that follow, and there’s no indication of when you actually obtained the item. Yes, I understand that this might be in the same vein as “NES hard” platformers, but it was unnecessarily frustrating.  Unfortunately, retrieving keys to progress through locked doors comes up a few more times after this point, but it’s never as frustrating as it was in the village. When you encounter a locked door, several different rooms are available for you to search through for the key. My primary complaint is that there’s no easy way to determine which door leads to what room or where you’ll wind up exiting from. It seems like an idea that wasn’t fully realized, as if the developers wanted to offer some exploration, but decided against it to keep the game more action oriented. I would be all up for it, if they decided to go that route, but then a mini map would be a necessity.  Final Thoughts  If you need that retro styled 2D action platformer itch to be scratched, I can’t recommend many other games over Adventure in the Tower of Flight. Solid level design, tight controls, wrapped up in a faithful aesthetic and infectious soundtrack go a long way to solidify it as one of the best games in its genre released this year. Just as the era of games it wants to fit in with, its short length (I completed it in about three hours) and four difficulty modes, provide tons of replay value. I must warn you though, at its current price point of $15.00, some might not find the game to worth its price of admission.  Score  3.5 out of 5",
            "review_score": "1"
        },
        {
            "review_text": "Another honestly pretty cool game. It's nothing especially new in that it's one of about a zillion retro style platformers, but it plays well, has some interesting mechanics, and functions almost like a super light metroid-style thing in that you are gradually spoonfed upgrades as you accomplish goals. It's polished, it's not assholishly difficult, and is just a pretty fun little game. It isn't going to blow anyone's mind, but I'll count it as a nice surprise regardless.  When it comes to games like this, I always find myself wondering what it is exactly that separates and distinguishes one modern retro platformer from another in terms of quality. I've mentioned it before on my 8-Bit Boy post that I think too many indie devs get caught up in just mimicking that older visual aesthetic and forget that the reason we have nostalgia for those old games is that they were actually fun and not that they looked like they were old.  When they were new, we didn't know any better in terms of the aesthetic so we didn't really give all that much of a ♥♥♥♥ about how the game looked. And when we played a bad game back then we tried to suck it up and choke it down because we were dumb kids who just ♥♥♥♥♥♥ away our weekend game rental on something trashy like ♥♥♥♥in Beetlejuice on NES or Home Improvement on SNES. Now that we have choices and easy access to just absurd numbers of games, we don't have to put up with stupid garbage (unless you're a masochist like me) and we'll just move onto something different if the game is ♥♥♥♥.  I dunno. It's fun to think about, and I think the central and easy answer is that the gameplay in a modern retro platformer is the important thing because invoking that particular time period brings me back to that 'who cares what it looks like' mindset. But there are a few other smaller things going on there, I'm pretty sure.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great platformer with a super nostalgic feel to the old PC and NES days.  Contrors are tight and the checkpoint system can be punishing if you aren't careful.  The music and the game look great together.  Give it a shot if your looking for something new that plays like something classic!",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game, but the Flappy Bird-esque platforming and occasionally frustrating hitboxes sour the experience. I'd give it a 6/10 and will never finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "A really well crafted retro platformer that gets right what so many miss when trying to emulate this type of game. Tight controls and reasonable difficulty means that you want to keep coming back to try that area again and again and if you die, you know it's probably your fault.  This game has influences from several major titles, all of which were gems. You have an overall feel of Kid Icarus in the level designs and setting. A flight mechanic similar to Gargoyle's Quest which challenges you to constantly think about how you can squeeze just a little more flight power out of your character to make it to that treasure and sword play straight out of The Legend of Zelda. Couple that with a spot on 8-bit graphic style and music and you have a game that really has the potential to launch a series of fun adventure platformers.  If you love these types of games, you can't go wrong with this one. Worth every penny of the asking price.",
            "review_score": "1"
        },
        {
            "review_text": "6/10  An interesting but slightly confusing platformer game.  Adventure in the Tower of Flight is a game where your character has the ability to fly from the start. While the game shows a lot of potential at first, it becomes repetitive and confusing soon as you fight the same enemies over and over while traversing through rooms that look similar to each other. Sometimes you're given a choice of a path to choose, but you have no way of knowing if you're going to the right direction or towards an optional area and sometimes you end up re-visiting the same areas.  In game, you'll collect both gold and feathers which can be used to purchase items, but there is not much to buy. The only thing worth buying with feathers is an instant revive potion (the Magic Feather grants 15 seconds of invulnerability, but it's used immediately and is very rarely useful). There are no significant upgrades to be purchases with either gold or feathers and, because of this, very soon there will be little encouragement for the player to even bother trying to pick them up or even to look for secrets, as secrets usually just lead to more gold and feathers and are therefore often meaningless.  Cons aside, it's a fun game nonetheless. It's neither too short or too long, has some very interesting boss fights and there are (meaningful) upgrades to be obtained along the way.",
            "review_score": "1"
        }
    ]
}