{
    "app_id": 368970,
    "name": "Haywire on Fuel Station Zeta",
    "release_date": "2015-09-24",
    "developer": [
        "Mad Goblin Games"
    ],
    "publisher": [
        "Mad Goblin Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie"
    ],
    "achievements": 13,
    "positive_ratings": 17,
    "negative_ratings": 8,
    "price": 2.79,
    "description": "Something has gone horribly wrong on fuel station Zeta. All of the robots have gone haywire. It is up to you, a lone maintenance bot, to help a friendly space traveler fuel up his ship and get home. Explore your way through a dangerous labyrinth of traps and hostile robots.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/368970/header.jpg?t=1447374039",
    "minimum_requirements": "OS: Windows XP, Vista, 7 or 8 Processor: 2ghz processor Memory: 1 GB RAM Graphics: AMD/ATI Radeon 9500, NVIDIA GeForce 5 FX, Intel GMA 4500, or better  supporting OpenGL 2.0 or better Storage: 300 MB available space Additional Notes: Java Version 1.6",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a challanging classic arcade game, featuring fun characters. One of the challenges is that you can't just go straight through the game, You need to explore and learn as well as try things that are not obvious.",
            "review_score": "1"
        },
        {
            "review_text": "This is a serious call back to old school games and it's been done right to maximize fun. Make no mistake, the difficulty level is no joke but the rewarding feeling that accompanies accomplishment is super HIGH. I miss that feeling in games that I've worked by butt off to attain something. This game makes me feel that again.   It has a great, fun story with super cute characters and funny interactions. You have to really think about which items to carry with you to make the most progress at any point. Very well thought-out. Pretty amazing that one guy did all of this.",
            "review_score": "1"
        }
    ]
}