{
    "app_id": 369070,
    "name": "Slain: Back from Hell",
    "release_date": "2016-03-24",
    "developer": [
        "Andrew Gilmour"
    ],
    "publisher": [
        "Digerati Distribution"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Pixel Graphics",
        "Indie"
    ],
    "achievements": 30,
    "positive_ratings": 957,
    "negative_ratings": 399,
    "price": 9.99,
    "description": "Slain: Back from Hell. A heavy metal inspired arcade combat with puzzle elements and gore galore. Stunning visuals and true old school gameplay accompanied by the most metal soundtrack you've ever heard.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/369070/header.jpg?t=1539959367",
    "minimum_requirements": "OS: Windows XP, Vista, 7 or 8 Processor: 1.5 Ghz or faster Memory: 1 GB RAM Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "patch#1 has made Slain the game I was hoping it would be. I use a 360 controller and it plays smooth and responsive. I love the graphics and music in this game. Totally worth buying now if you like sidescoller action platformers!  Patch #1.25 Better controller support and I love the new block button. Great job getting this game fixed devs.",
            "review_score": "1"
        },
        {
            "review_text": "After awaiting this game's release for months, I bought it the week it was released and like many others, was severely dissapointed. I contemplated getting a refund which I've never done with a Steam game, but after seeing the developers' posts about recognition of the game's flaws and upcoming updates, I decided to stick it out. Best decision I've ever made. This game is damn good. Until hell freezes over and Konami releases the Castelvania library on Steam, this is about the closest you can get to the pre-SOTN style games. The game is difficult but give you plenty of mechanics to use and they work well. Useless mechanics like the beheading feature are gone and replaced with useful ones like blocking and a better timed back-dash. The music is great, the combat has been finetuned, and the graphics are as amazing as they were when the game first released (about the only thing it had going for it back then) Also, my main complaint has been fixed: you can now play using the D-pad. Plus you have 2 CRT options a la Megaman: Legacy Collection, so your SNES dreams have been fulfilled.",
            "review_score": "1"
        },
        {
            "review_text": "Very good platformer, the X box pad answer well. You will like this game if you like your platformers dark and challenging. Music and art are awesome.",
            "review_score": "1"
        },
        {
            "review_text": "While this platformer had a rough launch, the developers at Wolf Brew Games have improved the gameplay significantly over the past month. Check out my video review below!          YouTube™ Video:  The Rookery: A Bird's Eye View - Slain!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  Slain is freaking metal    Ultimately if youre going to buy this you should understand that this game doesnt do anything special   mechanically   However,   Thematically   this game pulls no punches.  If you like heavy metal music and imagery, then Slain shouldnt disappoint. This game is best compared to the older   Shadow of the Beast   games.  I guess you could call it a platformer, because there are platforms, but the emphasis is mostly placed on combat. Your job is to go from left to right and kill things more or less.  If youre into this kind of stuff, you will definitely get your money's worth. I certainly enjoyed it.    ",
            "review_score": "1"
        },
        {
            "review_text": " Progress at the Time of Reviewing",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR An enjoyable if short experience with cool graphics and sound, good controls, challanging but fun gameplay, and an abrupt ending. Buy it on sale.    ++THE GOOD++",
            "review_score": "1"
        },
        {
            "review_text": "After the disaster launch, the devs fixed all the things within couple of months, rereleased the game adding some new stuff and gave the early buyers an extra gift copy.",
            "review_score": "1"
        },
        {
            "review_text": " Literally back from hell, and with full power",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good, beautiful Castlevania-alike game, with a very cool counter mechanic. Pretty hard, but good kind of hard.  This is NOT Metroidvania. Blame the morons that wrongfully tagged this as Metroidvania. Pl0x, Google what Metroidvania is.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what a change. I played this when it first launched and it was riddled with issues and the gameplay was broken. Just tried it tonight, since its patch, and it's like a completely different game. This is a lot of fun now and I didn't come across any problems. This game had tons of potential; I'm trilled to see it live up to it.",
            "review_score": "1"
        },
        {
            "review_text": "I have anxiously waited for Slain! to be released. I am still waiting for it to be released on the ps4 and the Vita, but I wanted this game so bad that I joined Steam just to get it. I can't go on enough how much I love this game from the art style, and the music and the gameplay. This is exactly the type of game I want to make myself, and it inspires me. I love the gruesome brutality especially. I will be happily getting Slain! again when it does finally find its way to the Sony platforms to. I can't honestly go on enough about how much I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Do you know who Ronnie James Dio is? Do you know who Koji 'IGA' Igarashi is?  You like these people?  Then buy this game now!!",
            "review_score": "1"
        },
        {
            "review_text": "Very old school. Very METAL!!! Probably very dividing; I like it, but can see why others might not.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Animations are detailed. Awesome soundtrack. Very difficult but so satisfying when you reach the next check point. Then take a break and continue on.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to get this game before but the reviews stopped from doing so, now with the updates and postive reviews I finally took the chance on getting it, and I must say, if you like classic Castlevania without the need of holding ones hand, this ones for you.  I applaud the developers for not throwing a temper tantrum and actually listened to the audience and fixed the game. I also appluad Steam for their new review system, if I relied on the old system and not reading the reviews, I would have still stayed clear of the game.  So, yeah, get it.",
            "review_score": "1"
        },
        {
            "review_text": "I played this when it first came out and was really disappointed, but this newer version is much better. I'm surprised they put as much effort as they did into improving the gameplay.  It's a decently fun game with a lot of great art and music.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah it's pretty good now.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent,if you enjoyed retro Castlevania, this is a must have,awesome gameplay,nice sound track,not too easy not to hard,3hours of amazing gameplay,cant wait for Slain 2 to come out, really a big 9/10 for this one!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't completed this game yet but from what I've played so far I feel that I've gotten my moneys worth out of it and would highly reccomend Slain as a fun action oriented platformer. 1 to 10 I would give it an 8.   Wonderul graphics and pixel art, by far the best the best aspect of this game. The audio is decent with a metal soundtrack. The action in the game moves along in a good pace. The bosses and enemies are challenging but not frustratingly hard. There is a regular sword attack, a charged attack, a backwards dash to evade enemy attacks, a standard jump button, and a parry that can be used effectively when timed correctly. You also get a magic attack that has two different functions- a standard projectile and a charged 'needs and uses all your mana' attack. You can get different sword type. So far I have a freeze and a fire enchanted type sword. The different types of swords can be easily switched on the fly. Different types of swords do more or less damage to the different enemie types. I haven't found a way to know which type of sword does better or worse damage to which enemy other than what is mentioned in the game regarding only witches and knights. There are a few other minor gameplay functions that I won't mention but the gameplay overall is satisfying and fairly simple.  There are checkpoint that are spaced out fairly well. Usually one before every boss as far as I know. There are hearts for health occasionally that renew your health completely. You can recover mana by using a charged attack to finish off an enemy. There really are no items or inventory. The gameplay is very challenging with a difficulty on par with any Dark Souls game. You'll die a lot, but as mentioned above, the checkpoints are placed nicely and with a quick reload time to keep you in the game at a constant pace.  I am not a huge platformer fan but after enjoying Salt and Santuary I needed more platformering fun and Slain is surprisingly providing.",
            "review_score": "1"
        },
        {
            "review_text": "This is a preliminary review for the fixed version of the game. After trying the game on launch and getting sorely disappointed like most, I can now say that it looks like the game I originally backed on Kickstarter and will be worth its price. I can't review much of the game yet as I've only played half an hour of the new release, but the developers deserve some love for rolling up their sleeves and going through all the improvements. If this looks like a game you'd like, you can now safely buy it!",
            "review_score": "1"
        },
        {
            "review_text": "I was hesitant to play Slain initially due to the user reviews of its initial release. But since the 'Back From Hell' release I decided to give this game a shot. If you enjoy heavy metal, and amazing scenery that looks like it comes straight out of a death metal album, then Slain is definitely for you. The combat is nice, although countering takes a bit of practice with timing. The bosses are cool, the levels are brutal and gore(geous), and its a hard game.",
            "review_score": "1"
        },
        {
            "review_text": "IGNORE THE MIXED REVIEWS!!!!!!!!!  Go listen to 'Under The Sign of The Black Mark' By BAthory. Now Imagine Somebody made a game based entirely on how awesome that album is.   That game is SLAIN.  Every 'TRVE' Metal fan who plays video games should own this game.  even if you dont like metal, buy this game.   If your a masochist, buy this game.  If your a gamer who hates games with length width and height, buy this game.  It's a game made with real passion, by people who understands who they are marketing towards, what are you going to do instead, Pre-order the new COD?  Exactly.  Buy SLAIN now.",
            "review_score": "1"
        },
        {
            "review_text": "good game   but too damn hard - reminds me of trying to play hotline miami over and over and not getting anywhere!! I had more luck with darksouls than this lol  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is more metal than the left side of the periodic table  ",
            "review_score": "1"
        },
        {
            "review_text": "Got decipitated Got devoured alive Got the psyche of the hero stolen Got squashed in to a putrid pile of goo Got split in half Got completely obliterated by a pack of Sinistar™-looking floating heads Got immensely incinerated by, what seemed at the moment like a manhole but was actually a flamethrower trap of pure evil Got abominably impaled thru the very poor ♥♥♥♥♥♥ of the hero, by redundantly sharp and rusty fence posts  But hey.. You headbang while the corpse of your fallen foe bleeds perpetually... That's a reason enough to buy it. ",
            "review_score": "1"
        },
        {
            "review_text": "And you thought Dark Souls was hard.",
            "review_score": "1"
        },
        {
            "review_text": "Aweasome game. Slain showed my entire youth in front my eyes! This game has a lot of stuff that you'll like. Best soundtrack and great metroidvania, like the nines!",
            "review_score": "1"
        },
        {
            "review_text": "This game is alright so far. Everyone seems to complain about the controls, but they seem to work for me. I do agree that this game needs a turtorial and how the buttons work. Though I have gotten some of the controls down, I wish to know how to use a 'Spirit Bomb'.  Other than that, I don't have a real problem with this game yet. It's visually breathtaking and the soundtrack is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I originally posted a negative review after having backed this game on Kickstarter. The game was in quite a sorry state when it was launched, but enough about that.  The developers stuck with their creation and have updated it to a release worthy game over the last couple of months.  After the re-launch I feel that I have finally gotten the game that was promised - and a pretty good one at that! The gameplay, sound and presentation have all been polished and it's time to enjoy playing this game in it's pixel-blood dripping, metal glory.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Gorgeous crunchy pixels. ♥♥♥♥ing awesome soundtrack.  Cons: Weak sound effects. Slight gameplay input delay. Moderate menu input delay.  Combat is obviously the biggest issue with this game. There needs to be some 'oomphf' to it. If I'm swinging a giant sword then there should feel like there's some impact to it. That's just the issue with the asthetics. The practical reason is that there should be a rhythm to the game play rather than button mashing and hoping that the weapon knockback is enough to halt the enemies' advance. Some enemies shouldn't meant to be halted, so the other part is having the attack range longe enough to hit and then have room to dodge backwards. And then the dodge needs to cover a sufficient enough distance to be able to repeat this process. All of this with a slight input delay makes the combat annoying. I can deal with it, but it's not versatile enough for me to have fun jumping and dodging and hacking my way around the screen.  A tutorial section of the game would be helpful to teach about blocking and how the mechanics of the game work.  Also the special attack to kill everything (down and one of the attack buttons) is a bad way to map it as I'll be ducking in combat to block projectiles and then can accidently hit the attack button when I immediately want to follow through with an attack which will trigger the special attack and waste all of my mana.   However, the art and music of the game is that brilliant that I'm not getting a refund and will wait for patches. Despite the shortcomings, even if the game was never patched the game is certainly worth the price tag.",
            "review_score": "1"
        },
        {
            "review_text": "SOOOO I 'finished' Slain! and despite the audio issues and confusing (for me at least...) save system, I loved it! I hope the rougher issues (steam achievements not unlocking included) get ironed out and this game gets more love. I found it challenging, but not so much that I raged and quit. It brought me back to my NES days, pushing myself further. The 'END' of the game is also a little disappointing (won't ruin it here). Sadly, the price also feels a little high for the amount of time it took me to complete. IF YOU enjoy more classical platforming/hack and slash games reminiscent of Castlevania series and the like, I suggest you give this game a go. A gamepad is also the way to go with this one. GREAT JOB overall to the developers, but there is more work to be done on your beautiful game!",
            "review_score": "1"
        },
        {
            "review_text": "A better review of the game. (This might be a tad bit arrogent)  So I like this game and here is why: 1. I like the difficulty with the game 2. I like the old school feel to it 3. There is a learning curve to the game and it rewards you for learning  So lets delve into this: A. Graphics B. Game Play C. Music D. Controls  Graphics: Excellent graphics. It brings back memories of Ghost and Gobblins and the 8 bit era. Very metal, very metal. The only complaint is that some of the traps blend in very easily into the environment, although that may be the intent of the developers.  Game Play: You have access to quite a few things that make the game interesting. To discover them is part of the game, and the game was meant to relive some of the old style hype. So if you discover the flame sword fairly early on and then die, then can you re-equip it? or is it gone forever? (HINT: LOOK AT THE CONTROL SECTION). You have access to three primary attacks with one screen wipe: Regular slash, beheading slash, range magic attack, and magic bomb. With the other two unlock weapons or so, you get different effects with each of the slashes. For example, the flame sword is faster and moves you further across the screen, while the ice axe will throw enemies quite a distance from you. There is an indicator for everything, but you would have to figure out what it means, and I will make a beginners guide on what each one means. For example, why do enemies have a red line around their necks? or why is there blood all over that patch of ground that the surrounding area lacks? Each enemy has a clear pattern and a clear counter play to them and some have counter play to alternative attacks. (HINT: DO NOT BOMB THE BIG RED SKELETONS) so the frustation there is that the patterns will change as you unlock more weapons. But I like a game that evolves with you.  Music: I like the chords that are playing in the background. Yeah the repeat every so often, and so times they cover up sound clues to what you need to do next. Aside from that, you can control the music from the pause menu. If you don't like metal chords, then play with no sound.  Controls: This seems to be the biggest complaint of the game. However, I disagree with those complaints. Before the game loads, a white box shows up and you can change the controls from there. The controls are as follows for those that do not have a joy stick or game pad: arrow keys for move left, move right, jump and block (which is down) Q for quick slash W for beheading slash 1 for range magic attack 2 for normal sword 3 for flame sword 4 for ice axe p for pause enter for continue or navigating the menu's Now for some of that good old explaination for how the controls work: Your momentum is controlled by a few things: how long you are holding the key, and whether or not you have taken damage. Damage stops your momentum, so a couple of parts are hard because of a range enemy on the other side of a pit. That was fun to figure out. The platforms that are solid are solid through and through. That means if you try to jump to another platform from underneath, you will bonk your head and lose some of your momentum.  Each weapon has a plus and a minus to how it works: Normal weapon is a basic no bonus and no minus tool. The downside is that other weapons will handle situations better and you will take damage from enemies, because this things has a very small stun lock. Range magic is good for dealing with weak enemies that you are having some trouble reaching. It consumes a small amount of mana, but with a full bar you can maybe fire it off about 10 times. Flame sword is good agains witches. It is faster and deals less damage, while moving you farther with each attack.  Ice axe is good against most creatures, but terrible against witches. Each swing has a big stun time and the final swing in a normal combo knocks an enemy back far enough for you to reset and move.  TLDR: The game's difficulty comes from not giving you any sort of tutorial to learn anything. It expects you to 1. be patient and not click, click through the game. 2. pay attention and try different combo's to advance. 3. finally focus on how each enemy fights. This game is a departure from the normal here is the first level, now we will walk you through the tutorial before letting you go HAM. Be patient and you will eventually make it through.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly do not understand all the negative reviews here. I purchased Slain expecting a (Gorgeous) sluggish sloppy mess that was going to be hopefully patched in the near term to address the major shortcomings in the gameplay. I have been following this game for a long time, and the dev's seem to be very engaged and genuinely desire to provide the best product they can, so I decided what the hell - I'll give em the chance. It sounds like perhaps there are some optimization issues that at the time of me writing this need to be resolved for some folks, but the devs are already looking into it. Anyhow, I saw none of this. Instead of a 12 buck gamble on a future quality product though, I was pleased to discover a very enjoyable game right out of the box! I'm running on a i7, 16 gb ram with 2x 770gtx cards, and Im using an xbox 360 controller like a filthy console peasant would. I have not tried with a keyboard but with that said, I have played the game on max graphics quality and it handled exactly like I hoped it would. Volgar the Viking or old school early Castlevania games would be the best approximation of gameplay that I can think of. Perhaps the old Blackthorne game from Blizzard? These are all good things - they were all fun games! The controls are simple, and the combo chaining crowd will likely be confused by the fairly straight forward approach, but that's the point - this is an homage to the classic 16 bit side scroller, and they were all about making the most of pretty basic gameplay. The game is challenging, but the ballance is well done - some fights are intended to beat you to a pulp but if you play smart you will live through it there is always a health pickup to keep you going. The pace is good, and if you keep your cool, you will do just fine. This game is dripping with atmosphere. The graphics are absolutely stunning - some of the finest pixel art I have ever seen, channeling the very best of the 16 bit consol era along with the glory or the old VGA pentium days of platform gaming. Every screencap is art. The atmosphere is augmented by fantastic music and flavor narrative that complete the dark, Gothic environment and works on the same vibes that made Diablo or Symphony of the Night so engrossing. This game by my observation is damned good. It does what its supposed to do, and it does it well. I don't understand where the negative posts came from, though they may well have valid points - what works on one computer may not work on another. That said, from my own experience, this was exactly what I wanted.",
            "review_score": "1"
        },
        {
            "review_text": "I think people are fundamentally not understanding what this game is trying to do. Remember Egorapter's sequilitis video about castlevania? Remember how he said that the jumping was perfectly responsive but the whip had an ever so slight delay and that this forced you to plan your attacks more carefully? This game does the same. Jumping is spot-on but attacks are delayed very slightly. This gives the combat a similar feel to the NES castlevania games.  There's nothing wrong with the gameplay, it just doesn't sync with most people's expectations.  Also, this isn't a metroidvania, it's just a vania. Learn the difference people.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly it's a good game. I am writting this because too many negative review focuses on the wrong issues.  Peoples said that controls were bad. They aren't, they just fit a certain type of gameplay: a old school one.  And guess what? That's exactly what the trailler says.  Peoples said that they were bugs. They don't affect the game in an important way, or not at all. And guess what? They will be fixed (if they haven't already been by the time you read this)  I've been following this game for quite some time, and yet those bad reviews have almost conviced me not to buy it... If you look for a game with some mesured difficulty, metal musics and amazing pixel art or if you are a fan of the gender: Go ahead, and prepare to be Slain!",
            "review_score": "1"
        },
        {
            "review_text": "I love metal. This game need work. I really hope all that all the problems will be fixed. But it has great music and art.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Castlevania clone. The game looks stunning. Disagree with most of the negative reviews as the controls were responsive enough and the game is easily playable (XBox One controller). Good enemy variation and the difficulty seems standard for the genre - fair amount of button mashing with minor strategy needed for tougher enemies and bosses. For the price, this is definitely worth it, especially if you have played, AND ENJOYED, the pre-Symphony of the Night Castlevania games. I was hesitant following the mostly negative reviews, but am glad that I gave it a shot anyway.",
            "review_score": "1"
        },
        {
            "review_text": "I cant understand negative comments - game is exacly what i saw on the trailers controls are really responsive (at least on x 360 pad) go play pony island with a nyan cat while listening to cherry K-Pop ya rotting haters ;p",
            "review_score": "1"
        },
        {
            "review_text": "I didn't play Slain before the relaunch so I cannot comment on the state the game was in at that point, but currently the game is pretty great. The bosses are challenging, but fun. The environments are cool, and the metal soundtrack is interesting if not exactly memorable. There are check points in the right places for this kind of (somewhat difficult) action-platformer.  There are a few level sections that could use some re-balancing. Especially towards the end of the game, there is one level (Hogres area) that eschews level design in favor of simply throwing waves of enemies at you. On the technical side of things, the game ran great on my PC, although the store page claims 'full controller support', there is in fact a launcher that you can't navigate with a gamepad. It's a minor thing, but it sucks if you play games on a TV through Big Picture Mode.  Despite those weak points the overral experience is excellent. Get it if you enjoy classic action games like Castlevania.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely unresponsive controls!  No key tutorial! To hell with this unfinished game...  EDIT: Well, they fixed it and controls now responsive...",
            "review_score": "1"
        },
        {
            "review_text": "Slain Expectations   Full disclosure: review copy provided by developer/publisher!  And so like The Lady before it, Steam has sharted out another half-baked indie title for us to enjoy in the waning days of winter – this time it's Slain!, an arcadey, 2D hack n' slash. Let me get this out of the way right off the bat: this isn't an AWFUL game. It looks great... no, it looks SPECTACULAR. This is lovingly crafted stuff: the baddies, the bosses, the backgrounds, the foregrounds, the GROUNDgrounds! It's a slick looking, heavy metal album cover of a game.  But it all falls apart, unfortunately, like a conversation with a beautiful airhead.   “So what kind of hobbies do you have, Slain!?”   “Pizza!”  “Pizza isn't a hobby, Slain.”  “Horses!”  “Alright, we're done here.”  It's just kind of... vapid? That's my biggest complaint, and the most damning, unpatchable one. The combat has no impact... and that's CRITICAL for a hack n' slash. What it lacks in combat depth it should make up for in VIOLENT, RADICAL, FEEL-GOOD COMBAT. It doesn't sound good, and it doesn't feel good. The majority of the game you can spam the attack button and watch as the minions of SATAN crumble like so much tissue paper before your standard sword. Hell, I didn't realize I could switch between elemental weapons or use spirit bombs until halfway through the game (I figured they mentioned fire, ice, and steel as a Game of Thrones reference or something, honestly). I guess that's another issue in and of itself: the game doesn't really explain itself well. “Spirit bombs are great for clearing out tons of enemies!” Thanks game! How in the ♥♥♥♥ do I do that?  And besides all that you run along a fairly linear path, slapping switches and jumping on platforms. It's all very uninspired, save for the brilliant art design. And the story? Forgettable. You play as one Geralt - I mean Bathoryn? And you have been brought back to life to destroy evil? And that's that. Go around and kill evil. And the dialogue is bizarrely disjointed - sometimes they stick to the old timey spiel, sometimes there's a weird modern tone that's just short of 'LOL.'  This is likely a byproduct of this game having been rushed out the door before it was ready... it was delayed at least twice as far as I know, and it still feels unrefined, unpolished, unfinished. The platforming is MOSTLY okay, but there are some serious spatial issues with some platforms (lookin' at you Wolfswood Caves with your stupid aggravating smashy, insta-death falls if you don't jump on the last frickin' pixel of a GOD DAMN LEDGE ♥♥♥♥). The enemies all look cool, but they're just so much fodder – even the bosses. Slash 'em, run around 'em, slash 'em, rinse and repeat, dead. I seldom had to dodge, just casually smack them as they (in futility) try and break through my attack spamming.  Despite there being checkpoints, if you quit out of the game during a level you have to start the whole damned thing over again – and some of the more frustrating, platformy ones can take a substantial amount of time. If you decide you have somewhere else to be don't quit out until you actually beat the damned boss. Once you beat an area you're free to explore, replay a level... but why would you? It's mostly linear, the combat is unsatisfying, and the “puzzles” aren't all that puzzley.   At the end of the day this is a gussied up pig. It looks AMAZING – but wipe away the makeup and you'll see it's a Berkshire boar with beady little soulless eyes. Even if they fix the myriad of issues (achievements, control issues, sound issues, typos) this is one to avoid unless heavily discounted.",
            "review_score": "-1"
        },
        {
            "review_text": "  Target Audience:     Those who are Masochist in nature, and want a visual and audio experience more then anything else.     Video Review:           YouTube™ Video:  Slain! (Critical Eye) - Unexpected Horrors&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly buggy, ridiculous controls.",
            "review_score": "-1"
        },
        {
            "review_text": "My first review. I generally don't care to leave such comments as these, but this one really surprised me.  - Extremely stiff controls - 'Tutorial' pop-ups that serve no explanation of how to perform certain moves. - Questionable font choice for dialogue. It's hard to read. - Repeating soundtrack that has a jarring hard stop / loop. - Menu input lag. I thought I was having controller issues. - Boring gameplay / combat mechanics.  I've been looking forward to this one for a while, but 20 minutes in and I know it's not clicking with me. Needs more polish, so unless some of these issues get addressed, my money will be going back into my wallet.",
            "review_score": "-1"
        },
        {
            "review_text": "dang. I wanted to like this game. Cool music and art style, but the controls are very unresponsive and the combat is hard to control, making the diffuculty level WAY to high. I like a challenge, but this is just not fun.   There a good game in here somewhere. It just needs some serious tweaking.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is about as responsive as one of those unlicensed NES games from the 90's. The input lag is atrocious and movement and attacking are anything but smooth. SoTN this is not. The soundtrack seemed promising but the coolest riffs happen in the trailer. In game, it's just a loop of distorted guitar chugging. It really, really, freaking disappointed me. This could have been a sleeper hit but instead is unplayable to the point of making me write my first steam review ever. Insta-refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Based on V1.0  They delayed the game because it was too hard but now it's WAAY too easy....heck you barely need to dodge attacks. You will cancel some of your attacks if you're spamming X on your xbox 360 controller while wielding the blue axe. You can get damaged/killed by fire even if they are not touching you. Bosses are broken(you can like kill them on the first try without even trying).  ''heavy metal inspired''  pfft. 2MuchDubstep4Me also the music is kinda repetitive  ''10+(?) hours of bone-crushing, metal fueled mayhem &amp; gore. '' People have completed the gamer under 4 hours  bugs that need to get fixed You can jump on walls(not sure if we are supposed to be able to) Achievements wont pop There's delays in the main menu and in-game  And of course i got the game from ♥♥♥ so I can't do a refund :/",
            "review_score": "-1"
        },
        {
            "review_text": "game seems to be decent but the controls i just cant and wont get used to them definately need keybinds and half a second input delay on keyboard killed it for me",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it. Tried it. Returned it. The controls just aren't reponsive at all. Floaty jumps, big delays in combos, etc. The tone of the dialogue felt wrong. Felt like quite a few sound effects were just missing. Enemies didn't have tells, and you're expected to learn soley through trial and error. Words on screen were surprisingly difficult to read, even at high resolutions. The soundtrack was great, the first time. Given how often death occurs, the music got old, fast. ",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are awful on keyboard and using an Xbox One controller, they're sluggish and delayed, the music sounds awesome for roughly 5 minutes and then it's just repetitive and eventually abrasive, the best solution for any enemy is to just mash the main attack and hope you manage to kill everything approaching you and block everything being shot at you, the secondary attack is useless it helps you gain mana but moves so slowly and inflicts little damage that it just isn't worth using, the mana attack is ranged and can one hit kill some enemies but since the attack used to get it back is useless it's not that great. This game could of been something great; a castlevania-esque looking, side scrolling, badass soundtracked murder-a-thon, unfortunately it's infuriating to play. If the music had something more to it, the controls were tightened up, the enemies didn't stun block you to oblivion, the everything was balanced a little better I'd love this game; It's just disappointing overall.",
            "review_score": "-1"
        },
        {
            "review_text": "I Will assume this is an open beta... for the love of the dark gods that rule the world of this game.. PLEASE BE A BETA,... but to be honest, Im sure my prayers wont be answered since this game has been already delayed 3 months since I prebuy it... I really want to suport the indie industry but teabagging like this makes me wonder if I should. art is great.. music is gorgeous but the gameplay.. which finaly is the most important thing is a mess, Im was hoping this game to be the new castlevania simphony of the night... but it isnt.. there is no method to the madness, no indicators whatsoever of how or what should you do, fightingh is completly plain and you have no way to defend yourself of the incoming attacks.. and I played with controller!, hopefully they will adress all the issues this game has... and QUICKLY... until then DONT BUY THIS!.",
            "review_score": "-1"
        },
        {
            "review_text": "I can already see people marking this review as not helpful, but while I consider the game to be pretty good, I can't recommend it because I got bored of it before reaching 1 hour of playtime.  The atmosphere promised is definitly there, the gameplay is decent though falls flat and boring extremely quickly (comparing it to other platformers). The 'metal gods darkness blood metal metal gore beard beard metal swords demons beard metal darkness' idea works really well, and as good as it is for an idea it quickly becomes clear that the filler content stages, the lack of music (tracks) variety, the unimaginitive enemies with the slow and 'it's not, but still turn based feeling' fight system just couldn't make me launch this game a second time the same day, next day, or ever again since.   What's good?",
            "review_score": "-1"
        },
        {
            "review_text": "Game is broken and by no means enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Look I love the visuals of the game but nothing else really stands out. In fact, I would argue the worst of the game is the combat for the sound effects and it devolves into a slap feast with the enemies. Hell, I beat Level 1 by spamming the X button because I didn't know I had a magic button or a backdash button till I got to the very end. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is broken beyond beleif. It looks like there were just trying to sell synthisized heavy metal mhe usic instead of a game. It plays unfairly as your far weaker than the monsters at the first level. The controles are very delayed and unresponsive, and dodging attacks is a pain. The level design is also terrible as checkpoints and health recovery items are placed in inconvenient locations making you dodge all these obsticles and hoards of enemies over and over again as you will keep dying over and over again. I see that this game has gone through some updates, but it still plays horribly, the damage is already done.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought this was going to be a nice experience - similar to Castlevania: Symphony of The Night - but I was wrong. It is too repetitive, softcore challenging, no puzzles at all, and the achievements not even work. Just hit sword, jump, die a lot, and secrets, well... Secrets are places with nothing inside! The graphics are nostalgic and the music is great, but the lack of enterteinment is hugely disappointing. Hoping for the devs to improve the game fast. Until then, no more Slain!",
            "review_score": "-1"
        },
        {
            "review_text": "A beautiful game ruined by a rediculously unnessisarily difficult string of overpowered enemies that relentlessly drain your heath bar. Save points are few and far between meaning yuou'll likely be replaying the same section of each stage over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over and over...",
            "review_score": "-1"
        },
        {
            "review_text": "So many cheap deaths",
            "review_score": "-1"
        }
    ]
}