{
    "app_id": 369100,
    "name": "Predator Simulator",
    "release_date": "2015-05-15",
    "developer": [
        "Imran Arafat"
    ],
    "publisher": [
        "Reality Gameware"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 50,
    "price": 5.79,
    "description": "Predator Simulator is an action arcade RPG packed with endless gameplay and new missions for every game session. On a quest to become a true Lion born, you get to save the planet by wiping out humanity from the face of the earth. Yeah.... didn't you always want to do that anyway? Now is your chance!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/369100/header.jpg?t=1541730214",
    "minimum_requirements": "OS: Windows 7 Processor: 1.3Ghz+ Memory: 2 GB RAM Graphics: 512MB+ with Shader model 2+ DirectX: Version 9.0c Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows 8.1 Processor: 2.4Ghz+ Memory: 4 GB RAM Graphics: NVIDIA/ATI 1GB+ with Shader model 3+ DirectX: Version 9.0c Storage: 200 MB available space Additional Notes: XBOX controller for better controls",
    "reviews": [
        {
            "review_text": "Predator Simulator is an 'action arcade RPG' game from GameIndica Entertainment. In PS you are a lion on a mission to become 'lionborn' and rid the Earth of humanity. As you kill more animals and people you'll get higher defcon levels which eventually leads soldiers to try and kill you.   +Decent graphics +Simple controls (M&amp;KB) +Quite a few different 'enemies' to hunt +Once you have got a few kills under your belt civilians will flee from you, sometimes even soldiers run away +You can unlock upgrades with one of the currencies you collect  -It's made entirely from assets found in Unity Asset packs, take from that what you will -Extreme lack of content, I'd seen everything that's in the game within 25 minutes -The game has a twitter feed style interface which displays 'jokes', the jokes get repetitive almost instantly and I found a few of them somewhat offensive -Despite what the dev says on the store page this is about as far from a simulator as you could possibly get, it's just another jokey simulator except it's not funny -The screaming sound effect gets irritating very quickly -Some things don't even soundeffects, such as gunshots -Animations are awful and for some creatures, particularly chickens, the animations don't work -It's riddled with graphic bugs and glitches -It feels like a iOS game, especially with the two currency system -One of the currencies is seemingly useless -You lose health if you don't eat enough which is a good idea but the health bar goes down very quickly -Not much in the way of environmental interaction -Only one map which is not only incredibly small but as far as I'm aware it's an unedited map from a Unity asset pack -Most importantly I did not have fun playing it  Verdict: Don't buy it.  Predator Simulator is a clear attempt at making a game similar to Goat Simulator but sadly it falls flat in a ridiculous number of ways. Unless this gets some major content added and gets its issues fixed I simply cannot recommend this game.  ***Written using a free key***  El K.",
            "review_score": "-1"
        },
        {
            "review_text": "I guess it's TECHNICALLY a game. But I don't recommend anyone ever play this. The entire game can be summed up in the first 10 minutes of playing.",
            "review_score": "-1"
        },
        {
            "review_text": "Only time I didn't get ninja'd in the key raffle.",
            "review_score": "-1"
        },
        {
            "review_text": "💔",
            "review_score": "-1"
        },
        {
            "review_text": "it is a fun game to kill some time.",
            "review_score": "1"
        }
    ]
}