{
    "app_id": 369390,
    "name": "Scourge of War: Waterloo",
    "release_date": "2015-11-19",
    "developer": [
        "NorbSoftDev"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Trading Cards"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Wargame"
    ],
    "achievements": 0,
    "positive_ratings": 109,
    "negative_ratings": 31,
    "price": 29.99,
    "description": "Scourge of War: Waterloo follows in the footsteps of its American Civil War predecessors and takes the action to one of the most famous battles in history. It is by far the most detailed game about the final battle of the War of the Seventh Coalition.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/369390/header.jpg?t=1491485758",
    "minimum_requirements": "OS: Windows XP (SP2+), Vista, 7, 8, 10 Processor: Dual Core 1.5 GHz CPU or higher Memory: 2 GB RAM Graphics: 256 MB Dedicated Video Card with DirectX 9.0c or higher DirectX: Version 9.0c Storage: 512 MB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is not like Napoleon Total War especially concerning graphics. But it is a much deeper wargaming experience in its detail, scale and historical simulation. I enliken Scourge of War Waterloo with NTW in the same way I do with IL2 Sturmovik 1942 in regards to War Thunder.   SoWW is deeply satisfying to play if you enjoy the grand scheme of Napoleonic line battles. It can be adapted from casual to hardcore gamestyles -- HITS, Headquarters in the Saddle, being a unique feature. Be prepared to invest time in learning the game controls as this will repay you in greater satisfaction.  Now go and try your hand as Napoleon, Wellington or Blucher (or a score of other historical commanders)!   (I have been playing the game since its release in June, 2015.)",
            "review_score": "1"
        },
        {
            "review_text": "Best game about waterloo",
            "review_score": "1"
        },
        {
            "review_text": "I really loved the Take Command: American Civil War Series and this game vastly improves everything that has gone before.",
            "review_score": "1"
        },
        {
            "review_text": "Not a big fan. It feels half finished. The interface is clunky and its paindul to get into. It needs more of the positive interface elements of the Total War series without the over simplification. It will appeal to a very small minority that will buy every Napoleonic game out there but unless your a geek about the period, I would wait until they patch / improve it or not bother.",
            "review_score": "-1"
        },
        {
            "review_text": "I have a head trauma from years back so please excuse the spelling /Grammer .. that said , I have bought the Scourge Civil war serise about a year ago, just when this came out . I loved that one so I thought I get this one this year when it came on sale . I really like the game and this is a nice 'upgrade' if that is how you want descride some of the mechanics graphics , game play . Although with just 10 hours or so into the game I feel I know the game already to write a good review. I would read the manual , or look at a few videos on you tubes before playing as some of the mechanics are diffrent from the other versions . The came out with a nice Campign generator though I only messed around with it for a 1/2 hour or so it shows great added game play as well as the random battle maker . I have not loaded any mods yet . but like the Civil war version there are plenty of extra battles .  I have a medium I5 quad 8gig computer with a intergrated graphics card / plays fine and noticed no drag on the stock settings ...  It is worth it to me on sale and at full price if I made more money would say yes it is as well . since there is a LOT I mean lot of game play and the replay is going be forever random if you want .  I have read comparisons to Total war serise there is none this is the Jaguar , the other the Volswagon Bug . when comes to historical play and graphics . Want the best battle sim in this era this is by far it nothing else comes close  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Considering the fact that I have no problems waiting for a 50-75% discount on AAA games, I think the price is a little high - even with the 20% off. 20-25,-€ yes, not higher than that. But price is always a personal thing.  To the game: Graphics are bad, no kidding, they are bad - really bad - as are the animations... Sound follows the graphics... not synchronized, just random sound.  Having said that, the gameplay itself is really really good. You want to micro manage all - this game has it. You want to macro manage the war and let the AI do all the micro management - this game has it. I have only played for about an hour. Reason was the price tag and I wanted to refund. I am going to consider buying it at a later time. I loved all the litte details (Riders running off to deliver and receive orders or support requests. Requesting reenforcements at a certain flank might be granted by your higher generals and suddenly there is a battalion helping out, all the different uniforms and flags,...).  Learning and mastering this game is challenging. But if you do, it will be extremly rewarding and you will feel as if you actually deserved that victory (or loss).  Do not expect a good looking game for some fast action. You need to bring time and even more time. I would say, if you love Hearts of Iron and all the other games of that kind, you should have a feeling if that game is for you. Man, if the graphics wold have been a little better, I could actually see myself paying the current price...",
            "review_score": "1"
        },
        {
            "review_text": "The game mechanics and grpahics are worse than napoleonic games from 10-15 years ago The inversed mouse wheel for zooming is a hell, sending troops into a fort is a mess, they mostly land behind the fort and get shred by artillery. The graphics are incredibly outdated, even whith low expectations we have with strategic games",
            "review_score": "-1"
        }
    ]
}