{
    "app_id": 369370,
    "name": "Crossfire: Dungeons",
    "release_date": "2015-05-21",
    "developer": [
        "Random Thoughts Entertainment"
    ],
    "publisher": [
        "Random Thoughts Enterainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Tactics",
        "Turn-Based Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 30,
    "negative_ratings": 30,
    "price": 2.79,
    "description": "Battle against rival fantasy armies in this fast paced turn based strategy game. Fight powerful bosses while you hunt for treasure in dungeon mode, play through over one hundred single player missions in campaign mode, or match wits against your friends in multiplayer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/369370/header.jpg?t=1478161775",
    "minimum_requirements": "OS: Windows XP or newer",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I wish Steam had a 'meh' button.  Pros: The price is right. (I bought this for $2 at the time of purchase) Decent artwork. Decent music. Games play really fast.  Cons: No options of any kind. Including full screen or resolution, which does not help the art. The sound effects are terrible. The saving appears to be broken. The game is more of a board game than an rpg.   In the end, a very middle of the road project. I was glad I got it on sale. 5/10",
            "review_score": "1"
        },
        {
            "review_text": "simple and adventurest great game for half a buck",
            "review_score": "1"
        },
        {
            "review_text": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.",
            "review_score": "1"
        }
    ]
}