{
    "app_id": 369830,
    "name": "Toonstruck",
    "release_date": "2016-11-15",
    "developer": [
        "Burst"
    ],
    "publisher": [
        "Interplay Entertainment Corp."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "FMV"
    ],
    "achievements": 0,
    "positive_ratings": 86,
    "negative_ratings": 5,
    "price": 6.99,
    "description": "Toonstruck combines live action, cell animation, and an all star cast: Christopher Lloyd, Ben Stein, Dan Castellaneta, Tim Curry, and Dom DeLuise, for a not-to-be-missed adventure through a zany cartoon world on the brink of total Malevalation!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/369830/header.jpg?t=1479269228",
    "minimum_requirements": "OS: XP and later Processor: 0.3 GHZ Memory: 20 MB RAM Storage: 1200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Got to love seeing old school 90s games here on Stream.  Great voice acting, hilarious characters and more. The puzzles are releatively simple, but that is not a bad thing for a game like this. As someone else before me said, this is a lot like Who Framed Rodger Rabbit.   If you like comedic point and click adventures, this one is for you. The downside is the control mappings aren't accurate and the only one that I've found which works is F5 to save.   To exit the game you can hit the Windows key if you have a laptop/computer which has it, and close the game via right click.   It runs well and so far i have not run into any glitches.",
            "review_score": "1"
        },
        {
            "review_text": "I was hoping to be able to replay this classic adventure game. It has been two decades since I first tried this game, and it has aged well. I'll cut to the chase because I just want to give this game a thumbs up. I assume Christopher Lloyd is a character designer in an animation company. Lloyd's character, Drew Blanc, receives a task from his boss to design a whole bunch of new cartoon characters for a new animation show and is given only one day to finish the job. Frustrated and exhausted, Drew Blanc falls a sleep on his work desk and later on wakes up to find himself in the toon world that requires his help on an important matter.   Pros:  - Character design and animation - Location art  - Voice acting - Puzzles and well hidden hints on how to solve them   Cons:  - Christopher Lloyd's awkward acting at times - The plot line of how Lloyd is connected to the toon world feels absurd and abrupt  ",
            "review_score": "1"
        },
        {
            "review_text": "A blast from the past for sure. ToonStruck is a fun point and click game from the mid 90's complete with your very own sarcastic Christopher Lloyd to control.  I've played this game time and time again as a teen and it's still as charming as ever graphics are showing their age but if you are into 90s cartoons then it won't bother you, what you see in the trailer and images is really what you get. Worth checking out! this gem deserved better!  One thing you have to know is that the (options) menu was removed for this port. you can still save and load your game (use F5 and F6) as well as all the hot keys functions but to quit you'll have to do it the hard way.",
            "review_score": "1"
        }
    ]
}