{
    "app_id": 369990,
    "name": "Gremlins, Inc.",
    "release_date": "2016-03-10",
    "developer": [
        "Alexey Bokulev",
        "Sergei Klimov",
        "Charlie Oscar Lima Tango Interactive Entertainment"
    ],
    "publisher": [
        "The Merchant Guild of Rund (Limited)"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Board Game",
        "Strategy",
        "Card Game"
    ],
    "achievements": 100,
    "positive_ratings": 3232,
    "negative_ratings": 550,
    "price": 14.99,
    "description": "This is an intense strategy board game in a steampunk world of corrupt capitalist gremlins who compete for money, political power and prestige. Save and invest, steal and extort, arrest and get arrested – in single-player and multiplayer, with ranks and ladders, team mode and spectator mode.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/369990/header.jpg?t=1553877973",
    "minimum_requirements": "OS: XP Processor: Intel Pentium Memory: 2 GB RAM Graphics: Intel Iris 4800 DirectX: Version 9.0 Network: Broadband Internet connection Storage: 1 GB available space Sound Card: internal",
    "recommended_requirements": "OS: 7, 8, 10 Processor: Intel Pentium 3+ generation Memory: 4 GB RAM Graphics: GeForce 9XX or AMD DirectX: Version 9.0 Network: Broadband Internet connection Storage: 1 GB available space Sound Card: internal",
    "reviews": [
        {
            "review_text": "Monopoly meets Munchkin, beautiful board game with good and easy gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "As you guys can see this is my first ever review   I dont usually write reviews because I am lazy but this game and the developers deserve one in my oppinion.  First things first:  Had 2 Problems posted them in the discussions got instant reply (maybe 4 minutes later)  Very kind helpful and made me believe in Video game support service again, thumbs up!  About the Game:   Graphics: Board Game style classic kinky fun all it needs   Gameplay: Smooth and even the AI is not dumb not at all...  Sound: Well I would love the Goblins to talk since I thought they would (read it somewhere I believe) Maybe I dont kow how to activate it haha) non the less Music is sweet little noises are funny so all good here  Price: After I played it I would say the Game is worth 29.99$ that is the amount I would have paid and still be satisfied. It is however way cheaper so nothing to complain here   Multiplayer: I have no experience on Multiplayer since I am in Australia I happen to be online when no one else is or just 2 more which tend to not Join me or open any Games so... I can however Imagine it to be a lot of fun and very frustrating due to humans being more vicious and unforgiving so they might pick on you whereas the AI tends to pick on all or lead Goblin   GAME RATING for the Genre: 8/10 but I raise to  9\\10 because of the Game Support Service    One last note:  Damn get ready to be majorly ♥♥♥♥♥♥ of and wanting to have a real chat function to swear the ♥♥♥♥ out of the AI for ruining your A+ move you had planned! I am seriously concerned smacking my Screen some day being so ♥♥♥♥♥♥ off haha   BUY IT ENJOY IT SUPPORT IT!   One more thing..... HOT SEAT.... I want a Hot seat function devs please make it happen",
            "review_score": "1"
        },
        {
            "review_text": " Gremlins Inc.  is a crazy steampunk card game that has a focus on making money through movements on a gameboard. You get six random cards, and you play against other people or AI and try to win by ending with the most score resource.  You can play by tweaking various amounts of score limits, or whoever is ahead at the end of a certain number of turns, for instance. There are a lot of various rules that are included in the game, based on spaces you land on, and cards with varying effects, depending on what cards you end up playing, or getting as you go around board game style spaces. You really have to watch what is going on, and employ your own strategies each round on which cards to keep, and which ones to use for movement, or to hold for later on in the game. The cards you play have the movement amounts, as opposed to dice, but dice play a 'roll' *cough cough* in certain events in the game as well.    Pros:",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly balanced chaos of backstabbing and risk management within a very well polished online board game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best board games i played so far, its a ♥♥♥♥ing blast to play it online with ranked mode also the art style its just amazinggg",
            "review_score": "1"
        },
        {
            "review_text": "If you like Magic the Gathering or Dominion you may like this one as well. Perfect game design!",
            "review_score": "1"
        },
        {
            "review_text": "This game a great, well polished, original digital board game that I would highly recommend if you are okay with winning or losing based on the draw of the cards, or the roll of the dice. There are strategic elements, decision making, and the ability to screw over other players, but ultimately, this game does come down to chance - draw good cards and roll good dice, and you will have a massive advantage. The game is well presented and stylish, with good tutorials and game help, it's surprisingly easy to get the hang of. While it might be scary at first glance, the systems are all very logical and consistent. It can be frustrating if you are playing against AI and get many bad rolls - you can lose to the AI through no fault of your own, simply because the AI got better luck than you. But multiplayer is where this game really shines, as you can laugh about being lucky or unlucky with your friends. All in all, I've had a great time with Gremlins, Inc.",
            "review_score": "1"
        },
        {
            "review_text": "My expectations for this were pretty low, but I have to say I ended up being impressed. This game is great. It lets you screw with the other players and they can do the same to you. The multiplayer is also easy to get into and not intimidating.",
            "review_score": "1"
        },
        {
            "review_text": "+Polished Gameplay +Excellent Music and Sounds +No microtransactions or card collection. Everyone owns the same set of cards. +Just the right amount of RNG (6 face dice rolls) +Excellent art work +Strategy and long term planning is rewarding though difficult to achieve +Not a money sink like hearthstone.   -Difficult to pick up as you need to understand the board and cards first. -Require a friend who owns the game for a nicer experience. -Games can get very long though you can set a time limited game (minimum 30 minutes) ",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played this for very long I know, however I thought I would let people know how good this game really is. Although I have only played SINGLEPLAYER so far, it's been fun &amp; frustrating (although laughable) when actually trying to win the game! On my second game I was so close to obtaining the required 20 Cogs to win, but as I got to 19 and looked like I was just one play away from winning, my opponent took away 2 of the cards that I needed to use in order to take that win (although either card would have been sufficient!) I won shortly after, but it could have been and should have been earlier, I called my opponent names (won't mention what here lol) then laughed right after.   Brilliant game imo, fun and frustrating and laughable right the way through. The music is good too, the layout and friendly menus make it worth it.   Not sure why the guy earlier complained on how long it takes to win, because you can customize the game to suit your needs, play short game or a longer one, entirely up to you. Perhaps he didn't realise this and lost his temper for the lack of knowledge of the game. But come on, there's a Tutorial for those that can't get into it properly. Plenty fun for any type of player, again imo!",
            "review_score": "1"
        },
        {
            "review_text": "step 1 buy game and invite friends to play step 2 play a couple of turns and get a good deck on your hand step 3 get back stabbed by so called friends and loose the good cards and go to jail step 4 get out of jail and make your way back to desired destination with highend card and money step 5 loose even more then before and what you began with due to friends backstabbing again step 6 get new cards thats usefull then loose them yet again step 7 end up in jail and loose the game as your friends laugh at your misery step 8 remove friends from steam step 9 backstab them and laugh at their misery then end up at jail again step 10 use last saved card: jailbreak to get out  9/10 would end up in jail again!!",
            "review_score": "1"
        },
        {
            "review_text": "I love how in this game there is no discussion about rules, either it works or it doesnt. Another aspect of it which I really like is that it's designed so you can mess with your friends.  I like the sound effects, but I turned of the music in the menu's.  It looks quite pleasing to the eye, more boardgame than pc game, and it suits the game well.  Overall, alot of fun and in my humble opinion well wort the money!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Simple to learn complex to master. A board game of such extreme rules that the only way to play is on PC. Be the good the bad and the ugly.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant boardgame. Good replay value. A little slow when there are more than 3 AI opponents. A fast AI with 2x 3x etc would very very useful when wanting a quick single player game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I've only played the single player so far and I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Beware! Needs Internet connection, even for single player games. Not a problem for most people I imagine but since I live out in the deep country my internet connection is so crappy that half the games never complete. Really a headache. Fun game though. I saw the hardcopy version in the store first, Just playing the digital versian a bit gives me the feeling I should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game , has very uniques mechanics and features that makes a very interesting game. love it.",
            "review_score": "1"
        },
        {
            "review_text": "A Cross between Monoply and Magic The Gathering Card Game.   If you like board games or stragety games then I would reccommed it.  9 out of 10 Score from me :)  ",
            "review_score": "1"
        },
        {
            "review_text": "The game is way too random to be labelled a 'strategy' game. Your movement depends on the randomness of drawing cards and victory conditions depend on the randomness of drawing cards. Basically, the game is almost completely random.  That doesn't mean that this is a bad game. If you like randomly chaotic games then this is for you. If you are looking for a strategy game, look elsewhere.  I wish that I could vote one thumb to the left and one thumb to the right but I have to give it a thumbs down for false advertising.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is really addicting, funny to play and challenging. You never know what can happen and how the game can turn out. I really enjoy playing it with other people online.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really great. But i can't say the same thing for the servers. I couldn't compleate any single game !",
            "review_score": "1"
        },
        {
            "review_text": "Really efficient way to destroy you friendship : ) Great music, great interface design and GREAT EMOJI!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Light, relatively straight forward game. Worth $15 if you are the kind of person who could zone out to Monopoly against the computer, or you have friends who are willing to play it at least a few times before forgetting it and leaving it uninstalled. Don't expect a lot of strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game to play when you have an hour to kill",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game, but best played with friends so you can hear the reactions when you send your buddy to jail. The game itself is naturally a social experience that seems a little hindered by the lack of online options for interaction.   If you have a group of buddies to kill some time with I would reccommend it.",
            "review_score": "1"
        },
        {
            "review_text": "overpriced good card game",
            "review_score": "1"
        },
        {
            "review_text": "Almost the entire game is random. Dice rolls, random cards, random effects, misfortunes. It doesn't feel like I'm playing so much as watching random things happen.  DO NOT RECOMMEND!",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like DRM's ? buy this game Do you dislike DRM's and you do not have a proper internet connection? do not buy this game, simple as that.",
            "review_score": "-1"
        },
        {
            "review_text": "not enough cards very unfair cards too much random time in jail etc  TOO MUCH FKN KILLING RANDOM!!!  pure lame. avoid it",
            "review_score": "-1"
        },
        {
            "review_text": "I don't believe I even heard of this game before it was released (and I received a coupon for it in my inventory)... or I just ignored it. At first I was thinking 'nah, not my cup of tea' ... but then I started reading the reviews and accessed the web site to learn more about it and decided to give it a try. 8 hours of play into it now and I have to say, I'm glad I did, I really like it. I'm glad I took the plunge. In-fact, I've been looking around for other similar games (haven't really found any though).   I especially like the pace of the game (i.e. if I need to take a break, I can just walk away for a little while and it will be waiting on my turn when i come back (of course, some times I end up in jail too!) ... although I won't do that if I was playing multi-player.  I keep forgetting I have Chaos Cards available which can really help win the game especially towards the end when the additional malice won't matter anymore. At least that's what I've used them for so far.  I did find that the high contrast option does make it more comfortable and the user interface is nice.   I don't feel I'm quite good enough to try multi-player yet, but it shouldn't be too much longer. I've won some of the easier single-player sessions a couple times, really just trying to learn the ins and outs of it at this point. ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Way to end a friendship. 10/10, would yell at my spouse about sending me to Jail again!",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game of irratating your friends. I totally recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly under-rated",
            "review_score": "1"
        },
        {
            "review_text": "Funnest digital board game i've ever played. Great for single player and multiplayer! It's like playing Monopoly on steroids except with more cut-throat politics :D  &lt;3&lt;3&lt;3 Love this game, recommended for anyone. Heavy RNG aspect in game, even if you play safe the RNG gods may still Sh!t on you :D",
            "review_score": "1"
        }
    ]
}