{
    "app_id": 37010,
    "name": "Ninja Blade",
    "release_date": "2009-11-19",
    "developer": [
        "FromSoftware"
    ],
    "publisher": [
        "ND Games",
        "bitComposer Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Hack and Slash",
        "Ninja"
    ],
    "achievements": 0,
    "positive_ratings": 128,
    "negative_ratings": 72,
    "price": 6.99,
    "description": "It was July 7th, 2011. While investigating reports of unlawful weapons trafficking, peacekeeping forces encountered an unclassified carnivorous species occupying a small village in Northern Africa. These rabid creatures were easily provoked and resistant to conventional attack.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/37010/header.jpg?t=1447352567",
    "minimum_requirements": "OS: Microsoft® Windows® XP/VistaProcessor: Pentium® 4 3,2 GHz or similar Athlon® 64Memory: 1 GB RAMGraphics: 3D Video card with 256 MB VRAM, DirectX® 9.0c compatible (GeForce 8600GTS/Radeon HD2600XT or higher)DirectX&reg;: 9.0cHard Drive: 5 GB free disk spaceSound: DirectX® 9.0с compatible sound cardController Support: Keyboard, mouse, gamepad (Microsoft X-Box 360 Controller Compatible)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Definitely not the best of ports. It's gonna give you some trouble no matter how your rig is. But trust me, once you got everything all worked out, it is sooooo worth it. It's pretty rough around the edges even once you've gotten everything in order, but it's well worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Worth experiencing for the sheer ridiculousness of everything that occurs in the game. It's like other wacky Japanese games, except on steroids.  Though on the other hand, it's a rather poor port and only offers a pretty shallow, though fun combat experience.",
            "review_score": "1"
        },
        {
            "review_text": "Ooooh my goood, where to start? This sums up everything that is wrong with Steam: it's a terrible console port with awful framerate, it's just unplayable! Anytime you change a setting, it goes ; 'Saving. Please don't turn off your console', i mean what the hell? It's a chore to even navigate the different menus. Takes ages everytime you press 'accept' or 'back'. As for the gameplay itself, it's ok when you are fighting but you are immediatelly thrown boss fights that are just redudant and boring, especially the spider boss, it's so repetitive, I only wanted it to end as fast as possible because i wasn't even afraid of dying cause it's mindblowingly easy. the QTE, i don't really mind them but seeing on screen both controller AND keyboard keys to push is another proof of the extreme lack of ♥♥♥♥s given and amateurism put into porting it to PC. And I am sick of this! The gaming industry is making fun of its consumers, feeding unfinished, unpolished games to a target audience that has such low standards they don't even realise they are being sold games that lack depth, innovation and basic quality, cause they dont know better. It's a shame Steam even allows this to be sold, don't they have people testing the games? don't they have quality standards? It's 2016!! Remember back in the 90's, you would buy a game and think:  'Wow it's so cool! I can't imagine what games will look like 20 years from now!!' Well, they look like ♥♥♥♥. I have to break it to you, it's going downhill instead of uphill because of the people working in th egaming industry and have no knowledge of what a good game is. It's 2016!!! and we still get the ♥♥♥♥♥♥ woefull console ports the ♥♥♥♥ing steaming pile of ♥♥♥♥ Unity engine made games with ♥♥♥♥♥♥ assets we've seen over and over, people who know nothing about programming, coding, putting assets together and call it a GAME. it's wank is what it is! Anyway enough ranting, ♥♥♥♥♥es ♥♥♥♥ you and have anice day! Game ain't worth a buy!  ",
            "review_score": "-1"
        },
        {
            "review_text": "Quick Time Souls",
            "review_score": "1"
        },
        {
            "review_text": "This is the game Dark Souls should have been.",
            "review_score": "1"
        },
        {
            "review_text": "This game is in an absolutely unacceptable state for a commercial product. There are various bugs ranging from audio not playing, animations looking like they are having siezures,the game freezing when trying to skip cut-scenes, and some of which are potentially game breaking bugs like being unable to break down walls to progress through levels.   It's also filled to the brim with quick-time events. It quickly becomes tiring and tedious. They don't difference in the outcome of any cut-scenes They are used in absolutely every possible opportunity, and if you mess up you are forced to replay it over and over until you get it right. It was just too much.  The weapons and combat mechanics are unimpressive. They work, but the attacks don't feel like they carry much impact and timing to pull off some moves feels very loose. Enemies don't convey their patterns or behavior very well either, so anticipating them is difficult. None of the combat flows and it just feels lackluster.",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty okay.",
            "review_score": "-1"
        },
        {
            "review_text": "Never mind the ♥♥♥♥♥ textures, the buggy audio and the mangled collision detection. This game just isn't fun, and the port is utter trash. You regularly clip through things. The audio is buggy, when it's not just sounding like ♥♥♥♥♥. It's absolutely FULL of quick time events. It's just an all around mess.  What's really shocking is this tripe is from the same brilliant minds that brought us Demon's Souls and Dark Souls. Guess they're really not good at arcade style hack'n'slash.  Also amusingly enough, they actually removed the Japanese VO for certain segments that was in the original on 360 for no reason.  Even if you're into that kind of campy content, the bugs will kill it for you.   Stay Away!",
            "review_score": "-1"
        }
    ]
}