{
    "app_id": 37030,
    "name": "UFO: Extraterrestrials Gold",
    "release_date": "2010-02-17",
    "developer": [
        "Chaos Concept"
    ],
    "publisher": [
        "ND Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based",
        "Tactical"
    ],
    "achievements": 0,
    "positive_ratings": 122,
    "negative_ratings": 43,
    "price": 9.99,
    "description": "UFO: Extraterrestrials GOLD is a new GOLD edition which includes a number of changes and improvements giving a player a new look on the classic game: new maps, possibility to hire soldiers, globe UFO swarms and configurability.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/37030/header.jpg?t=1447352677",
    "minimum_requirements": "OS: Windows 2000/XP/VistaProcessor: 1.5 Ghz ProcessorMemory: 256 MB RAMHard Drive: 2.6 GB of free spaceGraphics: 128 MB Video Card with DirectX 9.0c compatible driversSound: DirectX 9.0c compatibleDirectX&reg;: 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game feels like an attempt to improve the good old X-com series (Which franky I liked quite a lot). Honestly, I played it through only once and I found it quite enjoyable, but I believe this will mostly apply to people who loved the old series.  It sports the same old train-your-troops, go to turn based battles which makes this this genre unique, however I found the difficulty somewhat unbalanced at points (too easy or damn hard).  All in all, I recommend the game for fans to kill time until you go and play the newer xcom series.",
            "review_score": "1"
        },
        {
            "review_text": "Love it, one of the best xcom clone i have played and are still playing. bman mod wich is included in the game lets you costumize alot of aspects in the game to your own liking.  9 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I don't know much about the history of this game, but I think this is a more up to date version of the old X-Com UFO defense game. Immensely enjoyable with a lot of replay value. Noah, or Paul it was one of you who recommended the old original X-COM game to me and I'm glad you did. If you don't own this game already, you will enjoy it. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't expecting anything spectacular, but this game felt like it was jury-rigged and half-finished. I don't get why it has so many positive reviews. It relies on an unofficial mod (which creates black-bordered arrows on the ground) and there's no story that I can see. The interface is also not even as user-friendly as, say, Xenonauts.",
            "review_score": "-1"
        },
        {
            "review_text": "This is same as XCOM with better graphics and new features. Cool game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "I sat down to play this game at 9PM, and played for an hour. I got my butt kicked and learned a bit about what i did wrong. After about an hour, i looked at the clock and it was 3AM. I'm never touching this game ever again.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "UFO: Extrabugs Crash Edition.",
            "review_score": "-1"
        },
        {
            "review_text": "UFO: Extraterrestrials Gold is hacked. I can not build a store or stores. I can not build anything in a second base. I can uninstall a game. It is a digital download and it is hacked. and how can I recomend a game to other players if it is hacked.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a fine game except for the hiccup with the Desert Spirit keeping ressuerting and giving me a ♥♥♥♥♥♥♥♥ of cash and it keeping crashing all the time, especially as I try to land more buildings, then its really bad. Sorry to post it in the review-folder but no feedback-folder were readibly availible.",
            "review_score": "1"
        },
        {
            "review_text": "This game shortens the time of endless waiting for Sid Meiers X-COM!  X-COM and UFO Veterans won't be disappointed by this amazing game. It isn't that difficult like the original games, but you will have quite the challenge as well!  Save humankind from the aliens!!!!1",
            "review_score": "1"
        }
    ]
}