{
    "app_id": 370300,
    "name": "8-Bit Adventures: The Forgotten Journey Remastered Edition",
    "release_date": "2015-05-22",
    "developer": [
        "Critical Games"
    ],
    "publisher": [
        "Critical Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Indie"
    ],
    "achievements": 40,
    "positive_ratings": 64,
    "negative_ratings": 11,
    "price": 6.99,
    "description": "8-Bit Adventures: The Forgotten Journey Remastered Edition is a retro-styled JRPG with polish and personality, that focuses less on references and more on telling a story...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370300/header.jpg?t=1537365589",
    "minimum_requirements": "OS: Windows (XP or higher) Processor: 1.5GHz Intel Pentium 4 equivalent or higher processor Memory: 512 MB RAM Graphics: 1024x768 or better video resolution in True Colour mode Storage: 100 MB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "In mid-June, I played the same game for three consecutive evenings/nights. I thought 8-Bit Adventures was that good and I was very seldomly bored with it, so it must have done something right. Yet it was difficult to capture that feeling in a review.  I grew up playing classic NES/SNES era JRPGs like Dragon Warrior (abb. DW, my favourite) and Final Fantasy (FF). The best ones of those keep the story flowing fast and smoothly so you never get bored. In 8-Bit Adventures  pacing  has been done extremely well. There's no point where you don't have stuff to do. Just get over NES-style graphics and music, which by the way is rather nice.  Story is both original and classic at the same time: naturally, you are controlling the heroes who got to save the world. You get to name the heroes (mine were called Elric, Melissa and Garland) but not choose their classic classes: warrior, thief and mage.  Okay, I said it was original but it does copy some features from some of its role models: e.g. it begins with you having to save the mystical crystals that somehow control everything in the world except not anymore (surprise!) and you have to fix it. At first you only control one of the protagonists at the time but it will soon become a traditional game with a party. After a while the world opens up when you get the usual, better transportation capabilities.  That said, there was something odd about the game in the beginning. I had all those peculiarly familiar feelings, like I've played this before but still don't remember what's going to happen next. Then it subtly drops a few story and background hooks and keeps you going. Story gets more interesting the farther you get.  Gameplay is traditional JRPG with towns for talking to random people (mind you: some of which your protagonists personally know), buying stuff and healing at the inn. Goody goody as they are, they will promise to save every whatever periphery they roam at the time. Wilderness is obviously for random encounters and exploration, and dungeons are for (more) random encounters and questing. Dungeons are almost never too big to get bored and every traditional helpful trinket possible is virtually given to you to help you progress (so many potions) and keep the story going. I'm particularly looking at you, Escape Amulet (thank god for that trinket!).  Thankfully, you can save anywhere and game helpfully warns you if 'something really bad is up ahead'. This unanimously means a boss monster. I don't think I grinded too much but I never lost a battle in this game, not even in the weak and initially difficult beginning. Even so, some bosses and even random encounters were nasty and felt challenging nevertheless. The colour combat mechanic keeps every character useful most of the time: every character and enemy is assigned a colour that is stronger against one colour and weaker against the other, similar to rock-paper-scissors. An observant or well-guessing player may use this well to their advantage.  The main characters are likable and grow along the story that spurts out surprises, funny references and both happy and sad moments. Why, I seldomly become moved by some random NPC's storyline but heck, even that happened (small spoiler: it was the   man whose kid disappeared into the woods  ).  Possibly the only chime I have is the rather cheesy ending and it felt forced (though oddly fitting), to use as neutral word as possible to save you from the spoilers. Overall the game was just really good. Okay, it's done with RPG Maker XP, so taking screenshots is a chore (F12 resets the game but Print Screen / paste to Paint is a start) and you are stuck with one resolution option. I played with a gamepad so I managed to avoid that keyboard thing that traditionally the keys in RPGMaker games are weird, nonrebindable and need getting used to. Also, one in-game thing to be noted: there was no log to check what you're supposed to do but I never faced this problem due to playing it through in just a couple of sessions. If I had taken more breaks, it might have been different.  To wrap up, it was good and lasted 14.5 hours / 3 evenings with 100% everything. The achievements are fun too and there are no truly grindy ones! So if you enjoyed classic DW or FF, you will certainly enjoy 8-Bit Adventures. If you didn't ever try them, I dare say this is a good JRPG to start in the genre!",
            "review_score": "1"
        },
        {
            "review_text": "...a retro RPG done (obvs) in an 8-bit style - well made, a definite nod for the soundtrack - better than most chiptune efforts out there... the poor 800x600 resolution really hurts it though, either play fullscreen and it's blurry or within a tiny window... nicely done though if you're itching to play something mimicking a C64 game.. it didn't even allow taking in-game pictures...",
            "review_score": "1"
        },
        {
            "review_text": "8-bit game in 2k16 which was interesting to play .... wow ))",
            "review_score": "1"
        },
        {
            "review_text": "Best RPG maker game I have played besides corpse party, and this one is an actual RPG.  It has a good simple story, lots of extras, excellent balance and it takes you back to the time of the old nes snes rpgs, really would recommend.  Also for any of the developers involved, I WOULD love a sequel.",
            "review_score": "1"
        }
    ]
}