{
    "app_id": 370510,
    "name": "Marble Mayhem: Fragile Ball",
    "release_date": "2015-07-07",
    "developer": [
        "Bimboosoft Co.,Ltd."
    ],
    "publisher": [
        "Epic Quest Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Racing",
        "RPG",
        "Simulation",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 665,
    "negative_ratings": 338,
    "price": 0.79,
    "description": "Devilishly difficult but insanely rewarding physics puzzler. Play through 85 levels of diverse and ingenious physics-based challenges. If you like Super Monkey Ball, Marble Madness, or Peggle, this one is for you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370510/header.jpg?t=1479753441",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 Processor: 1 GHz CPU Memory: 256 MB RAM Graphics: DirectX Compatible 3D Card DirectX: Version 9.0c Storage: 27 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Marble Mayhem Fragile Ball on PC 7.5/10 Review after 5 hrs and 37 / 100 mazes completed.  A little ball rolling around in 2D maze trying to get out by the door in the corner. And yet Marble Mayhem is so much more: Wild mazes with moving plates, gaps, skateboard ramps, spikes, water, and did I mention extreme angles? Sometimes this feels more like soccer. If the ball gets hit too hard - it shatters - start again…. Addictive.  Mechanics: Moving your mouse rotates the maze and gravity moves the ball; the controls are tight and the physics are spot on. Mouse rotational sensitivity is adjustable. Patience with trial and error always pay off in games requiring the mastery of physics…. I did not rage quit a single time !  Graphics are basic and audio is simple; both need polish.  Full price on Steam seems rather extreme, but if you find it on sale you may be pleasantly surprised by this digital version of a childhood classic XD  Oct 2015",
            "review_score": "1"
        },
        {
            "review_text": "Essentially, this game is like bagatelle (a forerunner of pinball). In Fragile Ball you tilt the screen to affect the trajectory of a marble. It sounds simple enough, but this is no ordinary marble... Oh no !... this is a marble that smashes into tiny pieces when it hits anything too hard. Believe me when I say, no game will ever test your patience like Marble Mayhem: Fragile Ball.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a fun little game to play and very cheap. Some levels are quite ridiculous, and not very well designed and also there is no scaling in difficulty of the levels, it seems as if one level is really easy and the next is super hard. However, it is very satisfying to beat a hard level you have been trying for, for ages.",
            "review_score": "1"
        },
        {
            "review_text": "Oh this game is SO BAD. Many levels you can cheese through it by abusing the phisics, others you are required to use the same mechanics that you shouldn't in other level, but with extremely accuracy and luck. It's just not good for your health.  Most of the obstacles you can't predict where to go, like fire and water, you just have to try over and over until you get lucky.  And the level design just show you that you can't trust anything, see an arrow? DON'T follow it, never. You have to pass through this corridor at lightining speed? how about some spikes at the end so you need to break precisely.  Way to go punishing you for playing the level for the first time, and when i finish a hard level, its not rewarding, i just feel that i traded one burden for another even worse.",
            "review_score": "-1"
        },
        {
            "review_text": "You get to smash your balls over and over again. What's not to like? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Disclosure: received review copy  I can imagine the brainstorming process to this game went something like this: 'Hey lets create a awesome marble game. It should be about every possible cool scenario we always dreamed about when we were kids. A game where you mess around with gravity and a glass marble. Levels should be ranging from mazes and pachinko machines to cannons that fire your (breakable) glass ball far away into spike traps'  And it works like a charm.   Simple looking but controls are are as tight as the resolution on your mouse so it's as good as it gets. Good fun for all ages.",
            "review_score": "1"
        },
        {
            "review_text": "Good game to pass time. Remind me those board ball games you have to tilt to reach the goal.",
            "review_score": "1"
        },
        {
            "review_text": "level 13 is impossible beacuse there's a glitch on the end gate that you don't enter on the ♥♥♥♥ing door   3/10",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING: Verifying the integrity of the game's cache will delete your saves.  Despite this, this is an interesting game that can give you a few hours of challenge before reaching the hardest levels, because there's a HUGE difficulty spike after level 80, and i played on normal. It requires a lot of pacience. On sale, it's definitely a good time killer, but nothing special in the end.",
            "review_score": "1"
        },
        {
            "review_text": "  Sometimes when you hit walls, you bounce, and other times you don't, it was a bit odd. I tried testing using different conditions, but most times it gave a different result, this was apparent with the bouncy and regular marbles.  Some mouse tracking issues, sometimes the game just pulled a spazz attack on me when I tried to flick in the other direction, rotating different amounts for the same flick. I also found that the screen would not rotate smoothly when moving the mouse at certain speeds.  Some levels felt a bit cheaty - Some required lots of precision, which I feel is unfair due to the tracking issues with the mouse.  A large portion of levels were easy to cheat on, most easily completed by spinning the screen in 360s to help guide the ball midair.  Interesting design choice to see some levels in the second row unaccessable.  The moving platforms were a bit misleading, they don't help the ball move along, you still have to continue rotating your screen in order for the marble to move, which is not how physics works :P  I'm really picking out all the negatives, despite all these criticisms, I actually really enjoyed the game. I went in just to collect the steam cards, but ended up coming back because I was genuinely interested in finishing the game.",
            "review_score": "1"
        },
        {
            "review_text": "this game is baulshit",
            "review_score": "-1"
        },
        {
            "review_text": "Good game to test your patience and accuracy...",
            "review_score": "1"
        },
        {
            "review_text": "Each of the cleverly designed levels in this retina-scarring brainteaser provided a suitable challenge, as well as a way to hone my dexterity. The fragile ball, (which I've nicknamed 'Bimboo', after the game's developer), feels like a tangible element of the game's box-like environment thanks to its incorporation of 3D graphics. There is a rustic-looking meter at the top of the screen, the player's means of gauging their range of movement for that level. The gameplay will last an average user a considerable amount of time to complete, with 85 levels to frantically press your arrow keys to move through. I had to invert my mouse controls via it's software driver in order to get a harder challenge.  ++sufficiently challenging ++price ++utilization of 3D graphics ++appropriate level of frill +ball bounces a little and has a tangible existence +satisfyingly frustrating    -textures and shadows paired with abrupt movement can be hard on the eyes -resolution limited to 1920x1080   MAKES A GREAT GIFT  Thank you Bimboosoft Co.,Ltd. and Epic Quest Games for a fun and challenging time.  **you are able to listen to your own music while you play this",
            "review_score": "1"
        },
        {
            "review_text": "This game is the reason why people violent",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game because if you play a lot with it you will be angry because some levels are insane.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing stupied game u can't control gd",
            "review_score": "-1"
        },
        {
            "review_text": "It Sucks no 30 cents",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely frustrating and not in a fun way. Might come back to it later but actually getting the ball where I want it to go shouldn't be this difficult.",
            "review_score": "-1"
        },
        {
            "review_text": "enjoyable physics game. My one complaint is that on later levels the levels get *longer* in addition to harder. It gets frustrating going through the first 3 challenges in a level a bunch of times (failing at them some because they're still hard), just to get one chance to *try* the later part of the level. Still, certainly worth the price",
            "review_score": "1"
        },
        {
            "review_text": "It's good. If you are looking for something new, get this. It is simple gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "I realized that the egg is so fragile. Although I knew very fragile eggs.",
            "review_score": "1"
        },
        {
            "review_text": "Poor quality 2D version of the 3D games. Rate: 4\\10",
            "review_score": "-1"
        },
        {
            "review_text": "It's an okay game. Reminds me of those games you carefully balance a ball through a wooden maze and avoid the holes or have to start over, except it's going downward with some little control over gravity depending how fast you turn.  More of a time killer game.  -----  Check out more games I see that deserve more attention from my curator group:  BluePaw's Underrated Games List  Join and/or follow if you wish.",
            "review_score": "1"
        },
        {
            "review_text": "  Just for the sake of your own sanity, don't buy it. According to my friend it is really enjoyable to watch people play this game.  The game is so bad that it's somewhat amusing to see how bad it is. Thanks for this amazing pile of garbage gift.",
            "review_score": "-1"
        },
        {
            "review_text": "This game lol, so much fun! cant stop playing",
            "review_score": "1"
        },
        {
            "review_text": "Good game for time consuption, althrough it is a bit small in variation of things to do :) The only bad part I found was that the controls were inverted compared to how I felt like it should be, and I did not find a way to chance that, which made it harder in the beginning than it needed to be.",
            "review_score": "1"
        },
        {
            "review_text": "Well the developers compare this to Super Monkey Ball, Marble Madness and Peggle. I think the only comparison is that there is a marble that rolls around. If anything its Marble Madness in 2D. Not to say its a bad game cause it does have some pretty difficult levels. I haven't fully completed the game but I am pretty close. For 25 cents or 1 whole dollar its well worth it. I've been enjoying the game and I think you will to. Don't let the look of the game decieve you its nifty and fun. As for the music not much going for it... but hey its a FUN!!! game get it now.",
            "review_score": "1"
        },
        {
            "review_text": "Wow - Just Wow - I love this game.   While initally it looks simple and a good game to unwind with once you get it in to and past the first few learning levels then it turns fiendish tricky and highly addictive. I've been playing for a few hours and I've only just passed level 9...  I would highly recommend this game and at the amazing purchase price I don't know why you haven't bought it already...",
            "review_score": "1"
        },
        {
            "review_text": "That this game has only mixed reviews is pretty unfair. It's a small, dated-looking, but fun marble-rolling game, and totally worth getting, although I'd wait until it's on sale for like $3 or less. It's tricky, challenging, simple arcade fun.",
            "review_score": "1"
        },
        {
            "review_text": "$.19",
            "review_score": "1"
        },
        {
            "review_text": "If you want to simulate advanced aspergers syndrome with a hint of cerebral palsy this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "Gets stuck on third level. Good thing Steam gives refunds now.   13/24, would fail on the third level after saying, 'THIS IS TOO EASY!'.",
            "review_score": "1"
        },
        {
            "review_text": "I'm recommending this game because it delivers on what you'd expect from the trailer, screenshots, and other reviews.  I stupidly purchased this, knowing I wouldn't like it. I tend to grow frustrated easily with these ball-balancing games (yes, just like the toys I had as a kid), and this was no different. It seemed pretty good, though I couldn't push through my frustration.  The atmosphere irritated me even further. I hate the zany typefaces and music so much, and learned to dislike everything else about it. I'm admittedly elitist about the aesthetics I enjoy in games, but I feel bad being so negative about this product that was well-done. Therefore, I recommend this game to people who are not myself.",
            "review_score": "1"
        },
        {
            "review_text": "Unless you like the idea of spending 1.99 on a bland and brown (aka. blown) version of something you'd find on Kongregate or Newgrounds for free... go right ahead and get this for this... But seeing how most Steam sales these days don't go below $0.49 these days. It's not even worth the trading card sales you collect.",
            "review_score": "-1"
        },
        {
            "review_text": "you should play this game because there is absolutely nothing you could do with 0.24 euros ...other than that i have no points to highlight :/",
            "review_score": "1"
        },
        {
            "review_text": "I got this on sale for .50..... I played this longer than some of the games I have bought for over $20. Would you rather buy a stick of gum or buy something that will last at least as long as the gum and maybe a couple of hours longer.",
            "review_score": "1"
        }
    ]
}