{
    "app_id": 370590,
    "name": "Gem Wars: Attack of the Jiblets",
    "release_date": "2015-12-14",
    "developer": [
        "Queen Birdface Productions"
    ],
    "publisher": [
        "Queen Birdface Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 47,
    "positive_ratings": 37,
    "negative_ratings": 23,
    "price": 0.0,
    "description": "Gem Wars is a hardcore combat platformer with unique mixing of weapon elements for online/local couch play. Layers of complexity will have you coming back for more. Endless ways to play: new Infection Mode, Survival Mode, 7 Battle Modes with tons of mods and single player Challenges.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370590/header.jpg?t=1503676528",
    "minimum_requirements": "OS: Windows XP Storage: 40 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It is without doubt that Gem Wars: Attack of the Jiblets has an opportunity to force its into a niche dying out for high quality games on the PC – competitive couch games. Queen Birdface Productions have clearly taken inspiration from the likes of console giant Super Smash Bros. It’s a combat party platformer where the last man standing wins. It has all of the right game mechanics to be a great entry in the genre. Where the differences between titles such as Smash and Gem Wars is is in the key elemental mechanic. Players pick up elements that will transform their weapon with each element creating a different weapon. I can definitely envision a mad scramble occurring for the weapon power ups as they can and do prove to be the difference in winning and losing.  The single player mode is stronger than I was initially going to give it credit for. Initially I found that the AI in the challenge modes was overpowered but then I read the actual tutorials – a must read to understand how to play beyond the basic controls – and I was able to find them a beatable challenge. There’s a lot of depth to the single player mode with quite a number of different challenges and a great survival mode giving the game extended gameplay.  As other critics and reviewers have mentioned due to its lack of popularity the online multiplayer is not thriving. That appears to be the biggest weakness for the game and hence why I wanted to provide the game some of the spotlight that it deserved. In the week that this goes to print it is also a part of the Indie Gala Monday bundle which will hopefully further increase the player base. The developers deserve an opportunity for their game to shine as they have been great towards their community for a long time – even before the game was submitted to Steam Greenlight.  If you’re looking for a competitive couch game on PC or an ultra challenging single player experience then please give Gem Wars some consideration.",
            "review_score": "1"
        },
        {
            "review_text": "controller options are rubbish and response of game is a joke definetly not worth the price but hey i got it for a quid and even wish i could have had my money back for that.  ",
            "review_score": "-1"
        }
    ]
}