{
    "app_id": 370670,
    "name": "The Tale of a Common Man",
    "release_date": "2016-09-02",
    "developer": [
        "Aldorlea Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Casual"
    ],
    "achievements": 12,
    "positive_ratings": 92,
    "negative_ratings": 4,
    "price": 6.99,
    "description": "Undefeated's devs are back with a bigger, better tale of a man seeking revenge for the cruel murders of his wife and son. Can Jerrat achieve his aim without ceasing to be the man his wife loved? Find out in this great 16-bit style RPG, where the tale of a common man intertwines with the destiny of a nation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370670/header.jpg?t=1535992339",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 200 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A loving father farmer will put up a fence, while pitiless soldiers will steal them. A drama occurs and the farmer swears to revenge. This focus will change in the end ;)   The team is touching, of whom a shy man of the woods except for a haughty knight. The player should read the dialogue carefully to notice a scheme. You have also inner thoughts for some which is a first in a game for me. Jerrat’s life lessons to Aaydan are great. Jerrat the victim made a lesson to the bad boss, it shows a common man can worth more than a wealthy man. We also see change of mind and the evolution of the characters. There are verry funny NPC like musicians, reapers twirling and an animal appears a bit late in the game, he’s incredible.  Artwork: I loved the windmill and Neston’s ship, Asterie’s long hair and Grawin’s smile. The menu music is so stimulating to go on playing. I loved “theme crystallized” a good start on the adventure. I loved “angry avenger” and “high stakes low chances” battle soundtracks, so exciting!  I recommend Gemelle Games!",
            "review_score": "1"
        },
        {
            "review_text": "New RPG game from a studio that seems to be making only rpg games - and they are getting better and better with time. This time we even have a difficulty selection - and i've never met this feature before in RPG games. Tale of a common man is a story about a usual 'little man' that tries to change a life of a whole nation, this is about a place of a person in history, this is about moral principles and values.",
            "review_score": "1"
        }
    ]
}