{
    "app_id": 370640,
    "name": "Midnight's Blessing",
    "release_date": "2015-05-25",
    "developer": [
        "Warfare Studios"
    ],
    "publisher": [
        "Warfare Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Casual"
    ],
    "achievements": 13,
    "positive_ratings": 22,
    "negative_ratings": 13,
    "price": 6.99,
    "description": "Sidni Larkhearst lived a simple life, delivering messages for her village, until her home is attacked by vampires one night. To her horror, Sidni learns that Dracula, the most feared vampire of all time is hunting her. But why? Find out in this exciting 16-bit RPG from the &quot;Valiant&quot; team.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370640/header.jpg?t=1535992038",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 200 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Plain and simple truth, It's broken. The fact of the matter is that it's not just one minor bug here and there but massive game crippling bugs. and looking past that the game become tedious. Every batle is frout with so many misses it make it mind numbing. the story continues to break the 4th wall for no reason. There are a few funny bits here and there but it donesnt make up for the colasale ammount of bugs. It has potential but given the fact that its not this devlopers first product. I can't recommend this at a 1.09 little lone 10.99.",
            "review_score": "-1"
        },
        {
            "review_text": "funny rpg game made with RPG maker. lots of different levels and characters - game feels like a kid's animation movie. great for the price.",
            "review_score": "1"
        }
    ]
}