{
    "app_id": 370600,
    "name": "Hello Kitty and Sanrio Friends Racing",
    "release_date": "2015-07-09",
    "developer": [
        "Scarab Entertainment"
    ],
    "publisher": [
        "Scarab Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Casual",
        "Sports"
    ],
    "achievements": 25,
    "positive_ratings": 26,
    "negative_ratings": 28,
    "price": 14.99,
    "description": "Come and join Hello Kitty with her best friends in this action-packed Family Racing Party never before available on Steam!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370600/header.jpg?t=1447374504",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core 1.8 Ghz Memory: 2 GB RAM Graphics: 512 Mb DirectX: Version 9.0 Storage: 900 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is a little slow paced compared to Call of Duty and other FPS's, but this game is by far the best military simulator with extremely large maps and a huge variety of vehicles and weapons to choose from. Singleplayer is not so great but all of the fun and action comes from the co-op missions online. You won't get anywhere in this game without an organized team which is one of the many reasons why this game is so fun. Highly recommended. Blows any competition out of the water (Op Flashpoint: Dragon Rising, CoD, MoH, etc.).",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome! A lot of characters and a lot of cars!  It´s like Mario Kart but you can drive too in the water and in the sky!  I recommend it if you like that genre!          YouTube™ Video:  HELLO KITTY AND SANRIO FRIENDS RACING PC | HELLO KITTY ES MI PRIMA ლ(╹◡╹ლ)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty obvious that there wasn't any testing done on this game and they just wanted to fire it out as quick and cheaply as possible. There are 16 tracks spread across 4 cup events as well as 20 skill events to complete a lap quickly or collect items with the entire game being completable in around an hour. The racing takes place in karts, boats and planes depending on the selected race. Although this game seems to be aimed at a slightly younger audience, you can get Sonic &amp; Sega All-Stars Racing Transformed for the same price and it's a much higher quality product.  Positives: +Bright and colorful tracks +Many characters and vehicles to unlock +Catch up mechanic helps keep the races close if the player falls behind  Negatives -AI gets stuck or lost in every race -Tracks and assets are reused frequently  -Massive invisible wall in the middle of one of the tracks -Controller support is intermittent and doesn't work properly in the menus -tons of clipping issues -objects and vehicles can appear above or below the track instead of on it",
            "review_score": "-1"
        }
    ]
}