{
    "app_id": 370710,
    "name": "Last Heroes",
    "release_date": "2015-11-13",
    "developer": [
        "Warfare Studios"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 16,
    "price": 2.09,
    "description": "Enjoy another classic 16-bit RPG from Warfare Studios of Vagrant Hearts, Ashes of Immortality and Valiant fame, and embark on a quest with Viktor as he makes new friends, experiences dreams, and discovers his destiny.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370710/header.jpg?t=1535991826",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 50 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "An rpg in the classic style, Last Heroes finds three brothers at odds over who should really have been named king after the passing of their father. One brother is the game's hero (Viktor) and king of the land, another (Viper) has nefarious plans to unseat the hero by finding 4 relics that will give him the power he needs, and the third is reluctantly in the middle of the conflict.  There are other characters rounding out Viktor's group as they set out to find the relics first so the land will be safe. A simple enough beginning to a story that expands as you go. And you do go to many places to hunt down the relics ---- all with their treasures to find, secrets to discover, and enemies to battle. Enemies do not reappear, so you can't level up by repeatedly fighting ---- instead, you have to carefully manage the money, items, weapons, spells, etc. that you gather along the way. And, as you let the story unfold, it draws you in bit by bit.   Originally released some time ago, the graphics and music hold up nicely, and you will soon enough find yourself absorbed in the task of seeing what happens next, who is allied with who and why, and finding out about the different characters' individual backstories. I'm happy to see this one arrive on Steam, and believe it to be an excellent addition to my rpg game library.",
            "review_score": "1"
        },
        {
            "review_text": "Hi This games is awesome i finish at 4 hours.... :-)",
            "review_score": "1"
        }
    ]
}