{
    "app_id": 370920,
    "name": "Cosmophony",
    "release_date": "2015-07-09",
    "developer": [
        "Bento-Studio"
    ],
    "publisher": [
        "Frogames"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Music"
    ],
    "achievements": 5,
    "positive_ratings": 88,
    "negative_ratings": 14,
    "price": 3.99,
    "description": "Cosmophony is a musical shooter designed for demanding gamers seeking an original and intense experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/370920/header.jpg?t=1478071261",
    "minimum_requirements": "OS: Windows XP+ DirectX: Version 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Cosmophony is a difficult but satisfying rhythm runner with psychadellic visuals and a fantastic Drum and Bass musical soundtrack. I am a huge fan of all rhythm games and this is no exception.   I would describe Cosmophony as falling into both the genres of runner and rhythm. It is relatable to the style of the likes of Temple Run and Subway Surfers. The screen itself moves by itself and you can only control your ship to move left and right. You have to avoid the objects that appear in your way. Through this you will also encounter so called enemies that you can shoot. The enemies don't actually attack back though so that's why I don't like the title of enemy for them.   What I prefer to call 'enemies' is stars or collectables. This is because the reason for killing them is 100%ing the level. If you manage to shoot every star then you get 100% on the level. So this is an extra incentive to get them all.   You are helped along in Cosmophony by it's rhythm element. All the obstacles and enemies appear in patterns that are with the beat of the song. Everything seems to sinked fantastically well to the beat and really makes it a lot easier to follow the flow of the game. At the start of each level seems to be about a 30 second simple intro sequence to get you into the beat. This definitely helps instead of chucking you straight into the difficulty. However after dieing loads of having to repeat the level from the beginning everytime you get really bored of this simple start.   The pyschedellic graphics and the soundtrack go together perfectly. The soundtrack is entirely drum and bass. It has a wide variety of differences in the tracks and has points of slow music and points of fast beat. Within the background while playing you get an assortment of colours and strange effects. You sometimes get images in the background or get the colours be distorted. I love these effects but I can't help but think they could have used them a lot more than they did.   Cosphophony is very difficult. Each level get's progressively more difficult. You will have points in the level where you are having to extremely rapidly press opposing buttons to avoid a barrage of incoming barriers. You will die a lot and you will have to restart each level a hell of a lot of times. Despite how difficult is though I never found myself getting angry with it. I was always determined to get to the next level. I'm currently on level 3 and i'm still determined to complete it and get to level 4.   The game includes only 5 levels. This may not seem like much but each level takes a lot of retries to beat. But despite the fact of this I think they maybe should have included a few more than 5 levels or given the option for people to make there own. The only achievements as well are for completed each individual level. I mentioned earlier that you can 100% each level as well but there aren't achievements for doing this. So therefore you don't have too much of an incentive to do it. I think they could have made more of an effort in putting in more achievements to add in a bit of replayability.   Really there isn't a huge amount of content in Cosmophony but the content that is there is done to almost perfection for the rhythm genre. If your as big of a fan of the rhythm genre as me then I would definitely recommend this game to you. I mean the price of £3.99 isn't too much to ask of you really. Although if you don't like difficult games and having to repeat  each level multiple times to win it then this game is definitely not for you.    TheIronicGamers rating system     Don't ever buy this game.    Maybe consider it on a sale.    An average game.     A good game that should definitely be considered.     A must play!   Disclaimer: I was provided with a free key by the developer to write this review.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth a buy. It's cheap, so why not? If you like Super Hexagon then it is very similar and just as enjoyable. I have completed 3/5 of the levels so far and do not think it is very difficult. I expect the last 2 to be more challenging, but nonetheless I think it's a fun arcade game that will keep you entertained every now and then when you're bored.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this cancer 11/10 this game made kill my whole family",
            "review_score": "1"
        },
        {
            "review_text": "I had a lot of fun playing this game.",
            "review_score": "1"
        }
    ]
}