{
    "app_id": 37100,
    "name": "Aztaka",
    "release_date": "2009-11-05",
    "developer": [
        "Citeremis Inc."
    ],
    "publisher": [
        "Citeremis Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "RPG",
        "Indie"
    ],
    "tags": [
        "RPG",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 94,
    "negative_ratings": 39,
    "price": 3.99,
    "description": "Inspired by Aztec legend, this action/rpg side-scroller will casts you into the middle of a war between the Gods and Mankind. As Huitzilo, heir of the Sun God, skilled in both the arts of combat and magic, only you can save your people from the wrath of the Aztec Gods by reuniting the seven phonograms.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/37100/header.jpg?t=1447352526",
    "minimum_requirements": "OS: Windows XP/Vista Operating SystemProcessor: Intel Pentium 2.0 GHz or higher processorMemory: 2 GB of available system memoryGraphics: 256 MB (512 MB recommended) DirectX 9.0c compliant video card with Shader Model 2.0DirectX&reg;: DirectX 9.0c Hard Drive: 1.6 GB of available hard drive spaceSound: DirectX 9.0c compliant Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is actually a pretty decent game--a nice slow paced casual adventure. It's mostly a platformer game, but includes some basic RPG elements. A unique story with complementary music, very intuitive controls, and a good amount of leveling skills keep it interesting. On the downside, there isn't a whole lot of action, fighting is one dimensional, and casting spells is a little awkward. The sale price is a good bargain--there's definitely 10+ hours of gameplay here.",
            "review_score": "1"
        },
        {
            "review_text": "If you like side-scrolling adventure games with Metroidvania elements then you will like this game. The combat is a bit clunky at times, but if you actually take the time to backtrack and find all the hidden goodies then you'll be so overpowered by the end it won't really matter. My biggest criticism of the game would be that the later levels are a real slog - I often found myself rushing through the areas rather than fighting the suddenly super-durable enemies. There also isn't really any replayability, but it's not like this an expensive game and sometimes it's nice to finish a one-and-done kind of game.",
            "review_score": "1"
        },
        {
            "review_text": "Aztaka is a nice sample case for the rapid development and, connected with it, the growing significance of indie games in the last 4-5 years.  It came out in 2009, around the time Braid topped the charts, when indie movement was in its foetal stage and back then I remember thinking it was the hottest thing one could whish for. Nowadays though, one can easily dismiss it as yet another jump'n'slash game with clancky platforming mechanics, dated, unoptimized and unwieldy UI and noticably poor production values.  So why did I give it positive, rather than negative recommendation? Well exactly  because  it so precisely embodies so much of the now standard indie charactersitics. It depicts original and fairly unique setting - Astec culture, names, iconography, mythology; interesting and, agin, original magic-casting mechanic, (still) nice visual style; and last but not least, beautiful music.  We can now say Aztaka is somewhat mediocre because there was surge of inovative and selfsufficient games before the Kickstarter boom, before the major industry creatives managed to bring back entusiasm for scrapped genres, breathe fresh life into them and, not to forget, raise millions of funding for their new/old games.  Is Aztaka great? No. But does it provide overall fun platforming time? Yes it does! In no way can I claim it's bad. And if you want to enjoy a story in Aztec setting? I think there still isn't any meaningfull other such game out there.  I'd say current price of 7€ (or equivalent) is just a bit too steep, but if you manage to snatch it in some bundle or sale (like I did),  and  you already went through all the other more modern platformers, like Rayman's revived franchise, you won't be sorry.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful little pseudo-RPG with some amazing hand-painted art to make up your set pieces. It's very much like a 2D Diablo in which you run around clicking madly to destroy things while looking for cooler stuff. However, it's got a lot more story and a lot less color coding to make it lean more towards the RPG side. One of the better Indie games I've played in a long time. Worth the pennies if you can spare the time to play it this holiday season.",
            "review_score": "1"
        },
        {
            "review_text": "a very interesting and engoyable game",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to have to say that I didn't like Aztaka at all. I've played worse games than this and I did complete it but the experience wasn't very enjoying. Combat is my biggest complaint about Aztaka. It's just too simple to be interesting. I also encountered a couple of bugs but those were nothing major. Aztaka is a beautiful game but it simply wasn't fun enough for me that I could recommend it. However if you overlook the problems with the combat you might actually enjoy it, especially if you like 2D sidescrollers. I do but the combat was something I disliked so much I can't really recommend the game, at least not to everyone.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game, but it's simply not fun. The gameplay is slow and boring, and the story isn't compelling enough to make it a good adventure game.",
            "review_score": "-1"
        },
        {
            "review_text": "Run from left to right! Aztaka is a metroidvanian platformer that I found to be a bit lukewarm. The art is nice but the actual gameplay seems to be quite limited and it never really grabbed me in the time I played it.  Good - nice environments - Aztec's are good and cool Bad - enemies are ugly and simple - skills are meh -your attack is a short stab forward, really needs a way to aim up -foreground often obscures gameplay and items -character walks too slowly -the jump feels more like a stumble -ect ect ect  Some effort has clearly gone into this but I had to many niggling little annoyances and not enough fun while playing it to want to play it more.  Not recommended 2/5",
            "review_score": "-1"
        }
    ]
}