{
    "app_id": 3710,
    "name": "Judge Dredd: Dredd vs. Death",
    "release_date": "2009-03-26",
    "developer": [
        "Rebellion"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "First-Person"
    ],
    "achievements": 0,
    "positive_ratings": 559,
    "negative_ratings": 79,
    "price": 5.59,
    "description": "Welcome to Mega-City One, a city of over 400 million people - every one of them a potential criminal. It is the third decade of the 22nd Century, unemployment is widespread, boredom is universal and only the Judges can prevent total anarchy. Empowered to dispense instant justice, they are Judge, Jury and Executioner all in one.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3710/header.jpg?t=1478600057",
    "minimum_requirements": "Supported OS:  Microsoft® Windows® XP/Vista Processor:  Intel Pentium III or AMD Athlon 700MHz computer or equivalent Graphics:  32MB graphics card that supports Transform and Lighting (GeForce 1, ATI Radeon 7500 or better) Sound:  Windows compatible sound card  DirectX Version: DirectX 9.0 Memory:  128 MB RAM Hard Drive:  1.5 GB free hard disk space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A veiled work of art that satirises police militarization and the corrupt nature of the criminal justice system  lol jk you just arrest fat people for being a 'public obstruction' and kill vampires",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game on PC for the nostalgia from my PS2 days, great decision. Despite its incredibly aged graphics, the fast paced gameplay stands up to the likes of Doom and and other arcade shooters, with the gore to go along with it (decapitations and gallons of blood galore). The storyline is good, leading the player to action around pretty much every corner. But the best part is that you can arrest fat people for obstruction. Seriously, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a trip ! This game was made by Rebellion back in 2005 and is still full of old school goodness.Game play is pretty good and standard FPS controls.Its funny and fun to arrest peeps for just doing nothing lol (kinda sounds like today in age :P ) I say if you looking for some old school FPS fun pick up Judge Dredd : Dredd vs. Death !   I AM THE LAW!!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome retro judge dredd game. The graphics are obviously not photo-realistic, but still servicable. No bugs so far.  Lots of fun if you are a fan of Judge Dredd...and if you aren't; WHATS WRONG WITH YOU!?!? Atleast watch the movie. The game is based on the comic though.  Read all the old comics (available on Amazon for a little over 10 bucks per volume) for background info. The plot of this game is based on one of the more sinister and creepy episodes, where Death from another dimension (where all life had been declared a crime) comes a visitin'",
            "review_score": "1"
        },
        {
            "review_text": "Well this is a hidden gem. Very neat and quirky game. Pretty much exactly what you'd expect from the Judge Dredd comics. Rather short as well, and with a dearth of weapon variety. But it's wildly entertaining. If you like fps, it'll be an afternoon and few bucks well spent.",
            "review_score": "1"
        },
        {
            "review_text": "If you're wondering whether this is a faithful adaptation of the source material, the answer is a resounding Yes. You get to wield Dredd's famous Lawgiver gun (complete with six modes of fire) and the control scheme includes a 'You're under arrest!' key that gives your enemies a chance to surrender. The game awards you for doing Judge-like things such as arresting criminals and rescuing civilians while you blast your way across Mega-City One.  The campaign isn't all that long, but completing it does unlock lots of side challenges, which in turn also unlock additional content for the multiplayer modes, which include your standard Deathmatch variations (and yes, they have bots) as well as a Dredd-inspired 'Judges Vs. Perps' gametype.  The campaign had a few frustrating parts, sure, and the jump physics feel a bit floaty, and the reloading animations seem to go in slow motion, but despite being rough around the edges, I felt that it delivered on its promise of making you feel like Judge Joseph Dredd himself, almost to the point of shouting 'I AM THE LAW!' at your screen.",
            "review_score": "1"
        },
        {
            "review_text": "Best police simulation ever. Far better than  Battlefield Hardline .",
            "review_score": "1"
        },
        {
            "review_text": "Crime: Loitering, j-walking, and illegal parking Judgement: Incendiary rounds. ",
            "review_score": "1"
        },
        {
            "review_text": "A classic! Pure and simple! The nostalgia trip is strong with this one.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason i can't close the game.",
            "review_score": "1"
        },
        {
            "review_text": "Judge Dredd: Dredd vs Death is an Ego-Shooter from the year 2003. While the graphics of the game haven`t aged so well, the humor definitely has. The one liners of the protagonist are spot on and that you have the power to arrest people because they are too fat or don`t possess a goldfish license just has to put a smile on your face. A bit annoying is that the jump movement is broken and you will only jump every fifth time or so. Fortunately the game requires you only to jump three times over the whole game.  Dredd has to restore law and order in various sectors of the city while he fights against zombies, vampires, criminals and the four dark judges of the apocalypse. The mission have a great variety of locations and each feels a little bit different. Besides the interesting story there is also a arcade mode, in which you have defend hostages and need to defeat waves of enemies. The multiplayer is kind of dead, but if you got some friends you can also play the whole game in a coop campaign. One of the biggest weaknesses of the game on the other hand is the length of the campaign, which only lasts about 4-5 hours. But this 4 hours are truly entertaining and gave me in every second the feeling to be Judge Dredd, the only who can the defeat the criminal scumbags. I AM THE LAW !  Result: As a Dredd fan I really enjoyed the game, it captures the atmosphere very well and is quite entertaining as long as it lasts. But if you are not Dredd fan, don`t like old games and if it is not on sale you will maybe give this one a pass due to its short campaign. Everyone else should at least take a closer look and at sale it sure is a good choice.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "I cannot stress enough how fantastic this game is!  Firstly, this is true to the comic style, the characters look brilliant, the guns look brilliant, the voices are brilliant, the maps are brilliant etc etc, for a game made in 2003 it works and looks fantastic!   The main story is wonderful! 11 chapters in total (12 if you count training) and they are all linear and fun, there is even the odd slightly unsettling and creepy level, such as the under city and the shopping mall (I won't reveal any spoilers!) I've played this game since I was 9 (I'm 17 now) and probably completed it over 60 times but man, I still love every second of every mission! Dredd's hardcoreness is perfect in this game! The arcade missions are also lots of fun, working to unlock all the cheats so you can play campaign again and have fun with cheats like infinite law meter and touch of mortis! Multiplayer is also a lot of fun with bots and friends over Lan (I think you can still do online??)  When you play this game and read the comics, you'll see why you could be left expecting more from the films. The Stallone film is a bit naff and not true to Dredd's personaility but the costumes and sets and props etc are on point, but the 2013 film catches Dredd's personailty greatly like this game does, but the costumes are a bit eh. You'll think to yourself 'Where were those damn vampires, zombies and dark judges?????'  All in all, buy this game right now! If we can get this game some exposure maybe we will finally see a sequel or remake, so get buying and raving! It will not disapoint, I assure you!",
            "review_score": "1"
        },
        {
            "review_text": "Dredd the vampire killer",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Story: pretty good keeps to the comics. Audio: Music and Voice acting is ok. Weapons: good variety of ammo, bouncy bullets, fire, etc etc  Cons: Gameplay isnt great, player movement is pretty ♥♥♥♥ in story mode, tends to be better in battles (multiplayer/vs bots.) Story Mode is short (completed 3/4 hours) Graphics badly dated and the models are ugly.   Other info:   Difficulty on story mode which i played on normal was pretty easy, boss fights and levels are pretty straight forward. You can only take one path. The boss fight on level 10 was probally the hardiest but still pretty easy compared with other games.  Arcade is pretty fun but gets boring quickly.  Online is supposed to be fun, the game runs very similar to quake but I could not find any servers even with google.  To be honest the game is pretty ♥♥♥♥ and if it did not have judge dredd in the title nor the comicbook story (the dark judges arc) you would probally not even bother to look at the store page. I like judge dredd but I feel this game isnt even worth buying as a fan. Its not that its the worst fps game but its just really boring and generic. give it a pass.  4/10  I AM THE LUHHHHHHHHHHHH",
            "review_score": "-1"
        },
        {
            "review_text": "You can arrest someone for owning a goldfish and then set him on fire. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i couldnt even get this game to work how do yo u arrest fat people",
            "review_score": "-1"
        },
        {
            "review_text": "When I was playing this game my dad went to go the store that was 5 years ago and he still isn't back the ♥♥♥♥ game",
            "review_score": "-1"
        },
        {
            "review_text": "Judge Dredd vs Death. Well, everyone hatin on this game, but i like it. I really like every AD2000 stuff. This game got amazing style/freakin brutal Dredd voice and you can judge creeps, lol. If you like Judges and THE LAAAW, just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "Music is damn good and the game itself is pretty much fun.",
            "review_score": "1"
        },
        {
            "review_text": "I only bought this game cuz Anthrax is one of my favorite bands",
            "review_score": "1"
        },
        {
            "review_text": "I got the game for less than two dollars. Unless you get it that cheap, you're not getting a good price. It's just funny to read some of the signs and arrest some people. Lots of great satire involved in both. However, once the shooting starts, it all falls to pieces. There are various gunshot types for the handgun, such as incendiary rounds, armor-piercing rounds, heat-seeking rounds, explosive rounds, ricochet rounds, burst normal rounds, and maybe something else I'm forgetting, too. Anyway, it's really impressive for one gun when this game came out. However, the enemies you encounter on the latter part of the first stage and during the second stage are easier to kill with punches...slow, wound up punches. The gunplay simply isn't fun. Despite all the ammo options, actually shooting the enemies just isn't enjoyable for me. The difficulty is pretty high on Normal and I can't be bothered to try it on Easy. I probably -could- do it, but aside from the satire, there's nothing fun about this game so far to make me want to keep playing it instead of ignoring it or just watching for the satire portions on Youtube.",
            "review_score": "-1"
        },
        {
            "review_text": "In a word, don't",
            "review_score": "-1"
        },
        {
            "review_text": "**",
            "review_score": "-1"
        },
        {
            "review_text": "After getting as far as the 3rd level I can say 100% as a Dredd fan (comics, movie &amp; game), this game rocks, you can arrest ANYONE except another judge, the law giver (Dredds main weapon) is absoulutly spot on, cannot ask for a better weapon in the game, not even an RPG could best this gun.  The graphics are ancient (2003) but if you want a game thats more than just how the graphics look then do your self a favor, buy this game, even better buy this game while its still on sale for less than £1. Story wise (so far I have gotten) its sound, its full of the Dredd universes humor, slang and has great character to it, so much so that when you complete a level you can't help but want to play more.  5/5 Deffintaly recommend.   ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 for oldschool!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played much of it, but from what I have played, I can see that this is a good game. The Graphics are old, but not unplayable, this game isn't just using the name of Dredd to make a shooter, it would fit the comic. It sounds like what Dredd should sound like, the Lawgiver feels like the Lawgiver, with changable ammo for it(Normal, AP, Ricochet, High Ex, Heat Seeking) at a click of a button(actually you scroll with the mouse wheel to do so). The NPCs like Fatties offers funny dialogues, but humour is also given by the reasons for arrest: The game generates sentences which includes real crimes like rioting, assault, resisting arrest, and also owning a fish/hamster without a license which earns you a month in the cubes. As Dredd you can arrest anyone you want, Afterall: You are the law.",
            "review_score": "1"
        },
        {
            "review_text": "most say yeah it's a old game but well made and fun and hard to, you dont want the vamps to hit you or we will die dam fast take like 3 to 4 hits from one to die and love the hand gun!",
            "review_score": "1"
        },
        {
            "review_text": "Great Dredd game. A must have for fans.",
            "review_score": "1"
        },
        {
            "review_text": "Very short, very fun game about shooting perps and yelling 'I AM THE LAW'",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of Judge Dredd and or older shooters you'll love this game! ESPECIALLY if its on sale for 2 bucks! ive had more fun with this little game than some TRIPLE A TITLES!",
            "review_score": "1"
        },
        {
            "review_text": "this game really surprised me, sure it didnt even look good when it came out (republic commando came out the same month) but it still looks good, once you get the widescreen patch. the game has varried levels but it's only 4 hours. the game has split screen co op but there's no online.  and dispite all it's flaws I really liked the overall game. esspecally for the bag of chips price. and overall this game is summed up like this funny yet flawed",
            "review_score": "1"
        },
        {
            "review_text": "Old, but so much fun, a must for Dredd fans. A fun shoot-em-up with a great story. Loads of extra features. Cheap as is, but got during the january/xmas sales for less than a £1.00 ;)",
            "review_score": "1"
        },
        {
            "review_text": "This was my childhood, along with Crash and Spyro. But this stood out as my first fps. Yeah, lacking in some places but fun all around. You still get to shoot people and arrest others. Then go back and shoot them if you want. Or set them on fire. Or both.   10/10 would spend childhood on again  PS: Did I mention you get to kill vampires and zombies too? Sorry, can't arrest them though.",
            "review_score": "1"
        },
        {
            "review_text": "I AM THE LAW",
            "review_score": "1"
        },
        {
            "review_text": "The introductory levels are a little slow at first and some mechanics of the game can be a little clunky at times in some of the scenarios of the game. But even with that though, I had much fun playing this oddity from start to finish as Megacity-One's most hardass Judge with an itchy trigger-finger and an itcher pair of handcuffs in a crime-ridden, monster-infested future. The only thing I consider disappointing about it is that the story-campaign lasts about eight hours and that this game only has LAN-only multiplayer -meaning you will have to install a LAN-faking client like Hamachi, Gameranger or so on to connect with your friends online with some stablity issues. It can't be helped though, seeing as this is a 2003 game.  All-in-All, if you like classic shooters with some sleazy-cheesy style and have some time to kill, don't miss out on this little rusty gem.  BE THE LAW!",
            "review_score": "1"
        },
        {
            "review_text": "Setup a windows VM to play co-op with a friend like I did, being a fan of the comics is a must for such an old game.  Good for a once play through and then uninstall.  ",
            "review_score": "1"
        },
        {
            "review_text": "A blast from the past, when devs knew how to make fun video games.",
            "review_score": "1"
        },
        {
            "review_text": "1 Year in prison for :  * Being fat ( which attributes to 'parking violation' )  * Owning a hamster without a liscense  * Having an annoying voice  * Smoking in public   I am the law.",
            "review_score": "1"
        },
        {
            "review_text": "You can arrest people for being fat and punch vampires in the face. 10/10",
            "review_score": "1"
        }
    ]
}