{
    "app_id": 371120,
    "name": "Discouraged Workers",
    "release_date": "2015-09-16",
    "developer": [
        "YGGDRASIL STUDIO"
    ],
    "publisher": [
        "YGGDRASIL STUDIO"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Nudity",
        "Sexual Content",
        "Mature"
    ],
    "achievements": 36,
    "positive_ratings": 61,
    "negative_ratings": 38,
    "price": 10.99,
    "description": "『Discouraged Workers』 is an independent progressive kinetic novel created by YGGDRASIL STUDIO. The episode is the fifth in the Project DW series, a satirical story based on the popular Korean soap operas-styled plot. It compares Ga-yeon’s bleak everyday life to the dark side of youth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/371120/header.jpg?t=1555967178",
    "minimum_requirements": "OS: Windows XP x86 Processor: Pentium 4 1.66 GHz Memory: 512 MB RAM Graphics: DirectX compatible card DirectX: Version 9.0c Storage: 260 MB available space",
    "recommended_requirements": "OS: Windows XP x86, Vista or 7 or higher Processor: Pentium 4 2.1 GHz or higher Memory: 2 GB RAM DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: FHD(1920*1080 16:9 Wide Screen) or higher, Steam Controller or Xbox 360 Controller, Adobe Acrobat Reader 5.0 or higher",
    "reviews": [
        {
            "review_text": "I gotta be clear, i loved the story style which i feeled hard, i loved the arts and i loved the music! But it was way too short... As you can see in my time play, in only 77 mintues i've made all accomplishment, so i've made every ending... Clearly this game was released in haste and would have a lot benefit to develop the prequel story much more, for me it's its only problem. But unfortunatly, from a viewpoint where the story is the main focus to give us or not a long term memorable moments, it's a major problem! So yes, we feel it, but as it is too short the story doesn't still engraved in our minds that's the sad side!  Would i recommend this game? Well, if there is a project to develop a free DLC of a prequel where we could get more link about their personal life with the protagonist, for the current price i would YES recommend it. But with the actual i cannot say yes! Otherwise, if i make abstraction of the price, YES i would recommand the game, so that's why my thumbs up despite my critics.",
            "review_score": "1"
        },
        {
            "review_text": "I actually... Kind of liked the story but I just cannot suggest this as something I think others should partake in. I personally felt emotionally connected to what transpired in the story but it is very very dark and it was kind of painful to re-live bits of my own past...    - No worth the money at full-price imo. - The sex scene was obscenely medical terminalogy. - A lot of epilepsy-worthy moments. - The music at times was awful... a reindition of a old song with weird off-tune bells thrown in.  - Over explaining unnecessarily.",
            "review_score": "-1"
        }
    ]
}