{
    "app_id": 371220,
    "name": "VERLIES II",
    "release_date": "2015-09-25",
    "developer": [
        "Koya Game"
    ],
    "publisher": [
        "Koya Game"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 44,
    "positive_ratings": 57,
    "negative_ratings": 49,
    "price": 3.99,
    "description": "&quot;Beware adventurer! The danger here is far beyond your skills, do not risk your miserable life.... Still there? Interesting.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/371220/header.jpg?t=1480844496",
    "minimum_requirements": "OS: 64 bits Processor: Dual Core 3 GHz Memory: 2 GB RAM DirectX: Version 9.0 Storage: 400 MB available space",
    "recommended_requirements": "OS: 64 bits Processor: Quad Core 3 GHz Memory: 3 GB RAM DirectX: Version 9.0 Storage: 400 MB available space",
    "reviews": [
        {
            "review_text": " VERLIES II  is a hardcore dungeon crawler with a very interesting art style and an addictive combat system.   You must attack, defend, use skills and potions at the right time, as each enemy has its own attack timing, and mastering this is very important to survive. If you make any mistake, it's almost a certain death! Having a good build is also very important, so keep it in mind when leveling up and choose the right skills.  This game is very challenging: if you die, it's over, you lose all your gold, XP, skills and items, and you'll have to start over again, in a new randomly generated dungeon. Also, there are some puzzles that you must solve to progress further in the dungeon.   If you like challenging games, VERLIES II is very recommended!    Review em Português   VERLIES II  é um dungeon crawler hardcore com um estilo artístico bem interessante e um sistema de combate viciante.   Você deve atacar, defender, usar habilidades e poções no momento certo, já que cada inimigo tem seu próprio tempo de ataque, e dominar isto é muito importante para sobreviver. Se você cometer algum erro, será uma morte quase certa! Ter uma boa 'build' também é muito importante, lembre-se disso ao escolher as skills corretas quando você subir de nível.  Este jogo é muito desafiador: se você morrer, já era, você perde todo o seu ouro, XP, habilidades e itens, e você vai ter que começar tudo de novo, em uma nova dungeon gerada aleatoriamente. Além disso, existem alguns quebra-cabeças que você deve resolver para avançar.  Se você gosta de jogos desafiadores, VERLIES II é muito recomendado!",
            "review_score": "1"
        },
        {
            "review_text": "I saw someone beat it and the developer actually said congrats. This was after people complaining it was hard and so forth. So much so that I had to try it, the amount of 'talk' about this game sold me.   This is what I liked : The game felt immersive, it's small and not built by some huge studio but the maker captured a pretty cool feeling with it for me. The art, the ambiance, the lone dungeon hole before you go inside. Heck the finding of a pick ax in a shadow of the wall. Ohhhh I like this, I can feel myself in the game, lost in this dungeon. I enjoy this.  The game makes you feel as if your all alone having come to some small town on the verge of nowhere to find only a handful of small time town's people who can offer basic aid. But the best feeling is leaving town to that lone dungeon, just sitting there all silent with just the sounds of the surrounds begging you to come inside and explore.  I feel also that the developer of the game is around and adding stuff to the game making me wonder what is to come next and that is exciting!   What I was meh on : Yep it's hard, the death comes fast and starting over is fun for a bit, then sucks as you want to progress but find you die and lose that run. The enemies hit your shield and you still take too much damage, while your rewarded for blocking, I didn't feel it was enough and died to fights I should not have, as I had a nice rhythm going on slash, block, slash.  The Modding (I am going to call this what it is, replacing core files with your own art or music or words) is fun for silly things, like making a pic you like the new intro, but it's not true modding, it's just changing the interface for funzies. One use of this I want to try to play with is to see if I can change the main character (as characters are unlock able this might not work), but will see in time if I can do this.",
            "review_score": "1"
        },
        {
            "review_text": "Game is not 'Too Hard'  There IS a learning curve....and its fantastic and highly rewarding. Yes, there are butt-clenching moments of death that result in a few seconds of rage, followed by a sigh, a smile, and a restart. Dont be foolish, greedy, or neglect your equipment!   Dying makes me want to do it better. It takes a few hours of learning the game mechanics, tactics, and timing to defeat the monsters...but you will become familiar with what to do and what not to do through the unfortunate deaths of your first many characters. I think its a genius game- simple, skillful, thoughtful, and a great nostalgic throwback style. And if anything it could be made harder in the future...i WILL master this game!  Also- ROFL the Little Kitty Update...♥♥♥♥♥♥s. What fun is a game you just go through the motions of playing? The difficulty is what gives this game flavor and meaning!!",
            "review_score": "1"
        },
        {
            "review_text": "Love roguelikes, and may have loved this if I ever got to play it for more than two minutes at a go before it would CTD. Graphics drivers are all up to date; have no issues with any of a hundred other games I run on this PC. One thing to note from my minute of play is there is absolutely no tutorial, and that's about as far as I got.",
            "review_score": "-1"
        },
        {
            "review_text": "bloody awful game, i seen flash games that looked better and ran better than this, tryed to launch this it locked my pc up and when i was playing it, it would crash when trying to load back in, STAY CLEAR from this, its buggy and there are far better games out there than this",
            "review_score": "-1"
        }
    ]
}