{
    "app_id": 371450,
    "name": "Awe",
    "release_date": "2015-10-09",
    "developer": [
        "Badland Development Studio"
    ],
    "publisher": [
        "BadLand Publishing"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 18,
    "positive_ratings": 167,
    "negative_ratings": 54,
    "price": 0.79,
    "description": "Awe is a god-game about expressing one’s creativity by shaping and building planets’ ecosystems in a soothing and relaxing ambiance carried by beautiful, minimalist lowpoly 3D art style and atmospheric music.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/371450/header.jpg?t=1526041697",
    "minimum_requirements": "最低配備: 作業系統: Windows 7/Windows 8 處理器: Dual Core CPU @ 2.00GHz 記憶體: 1024 MB 記憶體 顯示卡: GeForce 8600 / Radeon HD 3670 / Intel HD 4000 DirectX: 版本：9.0c 儲存空間: 300 MB 可用空間 音效卡: DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Hmm. A strange one, this. It's an odd sort of memory game/god game hybrid  thing , with a nice ambient soundtrack and an interesting, if low-budget, visual style. It's hard to critique the mechanics, because it doesn't have very many, but the largest issue I see is that it's very, very easy to set up each world so that you can complete any combo the game requires. In essense, this is a nice game to go a bit zen with when listening to podcasts or something, but it's nothing more than that. A pretty thing to do with your hands while focussing on something else. But, it's only 79 pence, so I don't feel I got ripped off, and it's very calming. Very... calm.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little puzzle and creative game until about the 3rd world. After that it takes too much concentration and timing to be a fun and relaxing game for me. Good experience for the price.",
            "review_score": "1"
        },
        {
            "review_text": "This is not another 'From Dust', although despite it's repetitive gameplay, and blatant design to cater to addiction based on accomplishment, I find myself wanting to play this game for the music and relaxing scheme. I still dont play it. I want to, but I don't. ☺    ",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing puzzle game. The low-poly artstyle is nice, and the ambient music is soothing.  The core mechanics are solid, and the difficulty ramps up steadily throughout the game. Sadly, the more advanced techniques are not explained very well, and some of the colors in later levels are VERY similar (red and dark red are especially hard to tell apart).  Awe could benefit from a simple tutorial or a 'how to play' page in-game.",
            "review_score": "1"
        },
        {
            "review_text": "honestly a hidden gem in the growing scene ",
            "review_score": "1"
        },
        {
            "review_text": "Awe advertises itself as a relaxing game about creativity and I'll be honest. It's not. I have a Rubik's Cube Revolution I could use if I wanted to spin a shape and press colors. I'm so glad I got this game on sale, since given the lack of clear instructions and misleading description, I felt a bit lied to.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 this game will relax you 100% ;) For it's price...IT'S AMAZING! You should buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best chill out game you will ever get for a dollar, way better than Proteus or Mountain. I'd liken it to Viridi. The graphics are low-poly and colorful and the difficulty will very slowly ramp up. Every time you tap a tile, a chime like a xylophone plays. I also like the variety of objects it gives you to drop on your planet until you turn into an AWEful spiky orb of death with temples at the end of the level.  Another thing no one seems to mention is that you have combos you can fill at the top for extra awe and you can wait to collect pieces to get bonus multipliers for a higher AWE score.",
            "review_score": "1"
        }
    ]
}