{
    "app_id": 371420,
    "name": "Teddy Floppy Ear - The Race",
    "release_date": "2015-05-22",
    "developer": [
        "Forever Entertainment S. A."
    ],
    "publisher": [
        "Forever Entertainment S. A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Indie"
    ],
    "achievements": 14,
    "positive_ratings": 632,
    "negative_ratings": 192,
    "price": 3.99,
    "description": "People of Animalville got a carting fever and you must help one of them reach for the championship. Take the wheel, choose a kart, decide which character from 'Teddy Floppy Ear’ universe you want, and start the wild ride!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/371420/header.jpg?t=1447374667",
    "minimum_requirements": "OS: Windows 7 Processor: Dual core from Intel or AMD at 2.8 GHz Graphics: nVidia GeForce 7800, ATI/AMD Radeaon HD2600/3600",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'If beauty was a farm animal 3D racing game'  Teddy's ear may be floppy.. but my ♥♥♥♥ isnt when i play this well crafted game. I would give this a Solid 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I love teedy floopy earses",
            "review_score": "1"
        },
        {
            "review_text": "ok i know this may seem like a joke but honestly this is one of the most refreshing, entertaining and overall greatest games ive ever played. The racing is never the same, and the tournaments are absolutely excellent. While this may seem like a joke or a meme, I honestly really enjoy this game, and seriously reccomend it to anyone looking for cheap, amazing fun.",
            "review_score": "1"
        },
        {
            "review_text": "Well here goes nothing, I honestly bought this game as a joke. But even with the small gameplay i have played, i fealt like this game have completed the other side of me. Its like the mario kart i always wanted on the pc, but with better items, and a much much much more memerable cast. Also i like the fact that there is online 128 player mutiplayer mode",
            "review_score": "1"
        },
        {
            "review_text": "What Can I say, i thought this game was gonna be a simple childrens racer, but its more then that, it goes back to a simpler time before graphics were the important thing, &amp; its cheap as well",
            "review_score": "1"
        },
        {
            "review_text": "This Masterpiece in gaming lacks a story, but makes up and oustounding gameplay and amzaing graphics. Not only is this game great to look at, its easy to run. A great starter game. It has local co-op so you can play it with your pals, the split-screen makes it great for parties and social gatherings. you can hook it up to the tv for hours of fun. The driving is realistic and cartoony enough to give you a unique racing experience. All together this game can go toe to toe with fallout 4, rainbow 6, or any other triple a title. In conclusion, this game cured my aids, which ment I didn't have to pay so much for my medical bills. so i quit my night job because i only worked there for the medical bills in the first place, giving me more time to play Teddy Floppy Ear - The Race.  I can't recommend this highly enough.  A Masterpiece in gaming",
            "review_score": "1"
        },
        {
            "review_text": "30 FPS in race,200+ cutscene when you Win Good gameplay,controls are little weird Easy achievements,controller don't work for me :( A.I is too hard for kids",
            "review_score": "1"
        },
        {
            "review_text": "Nice gaming/ I love gonochki/ It's so apritiated of this",
            "review_score": "1"
        },
        {
            "review_text": "Best racing game since Wacky Wheels. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Broken local multiplayer, 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "I've played all the recent need for speeds, the crew and other racing titles but this one beats them all with entertaining game modes tons of characters, tons of cars to unlock and race with and overall a really fun game",
            "review_score": "1"
        },
        {
            "review_text": "i like the part when i took a left turn",
            "review_score": "1"
        },
        {
            "review_text": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Believe it or not, for the price, pretty solid Mario Kart like game.",
            "review_score": "1"
        },
        {
            "review_text": "This game SUCKS! BUNNY FREAKING PASSED ME, AND PUT ME IN ♥♥♥♥ING FOURTH PLACE, IS THAT A JOKE?!?!?!?!?!?!?!?!?!?!?!!?!??!?!?!?!?!?!?!?!?1?1?/ JKJKJKJKJKJKJKJKK  CREDIT TO THE MAKERS OF THIS ADVENTUROUS GAME. MY GREAT FRIEND SANE REALLY RECOMENDED THIS GAME TO ME.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, Teddy Floppy Ear never dissapoints. Somehow difficult at some points. That extra challenge is positive though.",
            "review_score": "1"
        },
        {
            "review_text": "Pros -Better than Forza -Better graphics than FNaF -Story so clear and hits the feels -Approved by Nintendo -Mario Kart 10 DLC -Only 4.99 -INTENSE jump scares -Gory -Funny -Nudity -Intense cut scenes -Quick Time Events are just right -Not too cold -Not too hot -Cheat Codes -Over 300 DLC -Life Changing Decisions -Choices Matter -Suicidal Bears -Kayaking  Cons -Lost on Easy mode  19/21 Too Much Water -IGN ",
            "review_score": "1"
        },
        {
            "review_text": "It's so amazing I can't bear the excitement.",
            "review_score": "1"
        },
        {
            "review_text": "Fun serie, but this game has hard car handling. It's not like the other two games here on steam, but it's fun as well.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a review you've come to the wrong place, if you're here to cook a pie then read on ! Napoleon from the final puff pastry  You will need:  Ready flaky pastry - 1.5 kg five eggs Flour - 150 g&gt; Sugar - 400 grams Milk - 1200 ml Vanilla sugar - 1 n. Cognac - 1 tbsp. l. Shelled walnuts - glass sequence of preparation: dough defrost naturally at room temperature (defrost time indicated on the package). Cook the custard: grind the egg yolks with a mixer or a whisk to a conventional incandescent and vanilla sugar, flour and brandy to enter the mix. The mixture pour a trickle of milk, stir and cook, stirring constantly. Divide the dough into the desired number of pieces that will later Korzh. Roll out each piece on a board sprinkled with flour. Bake in the oven for about 10 minutes until golden color on a dry baking temperature of 200 degrees. Fluff the cooled cream cakes. If desired, each layer sprinkled with chopped nuts. On top of the cake lightly press smeared with cream and sprinkle all sides crumbs. Add layer cake in a cool place overnight.",
            "review_score": "1"
        },
        {
            "review_text": "JA PIE.RDOLE KU.RWA MAC CH.UJ WAM W DUPY IDE SPAC 10 pierogis out of 10, this is a masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "The best ultra hardcore racing simulator i have ever played!! 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "It's a good little cart racing game.  Music is not annoying, graphics are reasonably good, haven't found any bugs and the gameplay is fine.",
            "review_score": "1"
        },
        {
            "review_text": "This game is geared towards kids, but the handling is so difficult for kids that it really doesn't engage and/or entertain the audience that it is targetting.  However, once I grabbed the controls what I found was a relatively easy to play racing game where even the pro league was not much of a threat to my winning first place. The game from an adult perspective was too easy throughout, no matter what level you would compete against, and that the overall choices within the game were fairly limited. I think there were only 10 tracks, 5 of which were night time versions of previous daytime tracks. The variety of game modes is limited, but at least it gives a bit of extra bonus content compared to the track count issue. I can't recommend this game because of the lack of child friendly controls and due to the lack of variety and difficulty when it comes to the AI and the other racers.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game to play with my son, but after an hour of trying and troubleshooting, we can't get the cars to move or the race clock to tick. It just sits there doing nothing.  DO NOT BUY",
            "review_score": "-1"
        },
        {
            "review_text": "Are you ready for a hardcore kart combat racing game with realistic driving with a children's storybook art style? The joke is there is no joke. Teddy Floppy Ear's - The Race has a good unique look that makes it stand out from a pack of other kart racing games. The real deterrent is that its a lot tougher to play, if you take a turn too hard, you will spin out and turning feels loose in general. Perhaps that makes it a better game to play with a keyboard or a steering wheel peripheral. Because of the difficulty it misses that child demographic and falls into the men who like colorful ponies demographic.  You race in single player or two players with local split screen. Before you begin, you have your choice of fourteen anthropomorphic characters and two little girls. Its a bizarre choice to have two humans girls thrown in the mix with animals. There's no sort of indication that playing as the goat is better than the dog.  Next there is a choice of ten real world, European inspired vehicles including the Fiat, Maluch and the Trabant, with no indication of stats. You earn part upgrades by going through race seasons. You have them no matter what car you select. The only problem like the rest of the game is that without stats, its tough to feel any difference with or without them. Plus, once they're unlocked, you have them forever.  The tracks are all closed circuit courses with three laps each that last around 90 seconds for each lap. They each feel like a healthy length at under five minutes each, but any longer than that would be too much. Like other kart racers, the tracks are wide to make room for the chaos that ensues. These tracks all stay on the ground. There are no sweet jumps. At the most you'll go through a tunnel, under a bridge and then over it.  There are a few hazards to look out for, mud that will slow you down and water that's so brilliant its a true hazard. Normal kart racers would spin you out then and there, but with Teddy Floppy Ear's - The Race, the water affects when you next turn where even the slightest turn becomes harsh. If you ever drive through water, the longer you can drive forward, the safer you are. You always have brakes, but who uses those in a racing game?  The game lacks nitro and turbo, so the game is reliant on weapons. These weapons are all generic, bland and wholesome, but its what you want for a kids game. You run through hovering weapon icons each with their own color. White milk, yellow lemonade, maroon mud, cyan tacks, purple kibble, red fire extinguisher and blue boots. Milk makes you grow larger so you can flatten enemies if you're going fast enough. The only problem is that you're so large it becomes easy to tumble over and roll sideways. The fire extinguisher and kibble both seem to do the same thing which is a radial explosion that either pushes or tumbles over adversaries. The tacks spray a hard-to-see bed of tacks. Mud makes a mud puddle to slow down drivers, the lemonade does just about the same thing and the boots let you drive through any hazard. The mud, demimondaine and boots each give you a short nitro boost. Someone thought it would be a good idea for animals to leave pools of yellow and brown liquid on the track.  One of the best risk or reward mechanics in the game is having single weapons alone next to kiosks. Ninety-nine percent of the time you can grab the weapon just fine, but its that one percent that has you colliding into the stand. There is a respawn button, but it drops you from a bit high so its a few second penalty for using it.  The bulk of the game is short, two hours spread across four seasons with five tracks that each have a day and night to make them feel different. Three of the closed circuit tracks blend together while the castle and town feel beautiful and a fresh take with the art style. Night races are dark and only challenging because its tougher to see. There are lights and lanterns, but going over bridges and some other areas, they've been forgotten about.  There is no difficulty setting for the seasons. Instead the earlier seasons start with three tracks and the latter ones have more. It never felt like the later championships were any more difficult than the earlier ones. There are four difficulty levels for single races.  To keep you in the game there is a collector's slalom which has you collecting stars along a path. Collecting over eighty percent grants you a voucher for a free vehicle. Collect all five and you unlock the new vehicle. This feels like a great mode to increase the game's longevity without having too much development time. It sure beats having only a time trial.  Then you have the floppy cups which are tournament races where you go one-on-one against drivers. It just feels dull in a kart combat game to only have one racer. It also looks awkward when I'm the winner standing alone on top of a podium meant for three.  The unsung hero is the music. Its noticeable how soothing it is with a good light beat and melody. Its rare to find flutes in video game music let alone a racer.  Its a definite toss up whether to recommend the game. Its worth the cheap five dollar price tag for the two hours and whatever else you can garner from the game. It feels like the driving should have been more typical when it comes to a kid's game. Plus there should really be a kid's auto drive mode that mobile phone games seem to have. Its a game worth having a sequel for its style.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe a 5 year old would like this.",
            "review_score": "-1"
        },
        {
            "review_text": "bought game and despite it supporting the xbox for windows controller the buttons dont work properly. waste of £4!!",
            "review_score": "-1"
        },
        {
            "review_text": "  This is the best game on steam. Actually no, not really.  The main strategy is to ram your opponents off the track so that their crappy AI won't be able to recover because they keep driving into a wall or tree.",
            "review_score": "-1"
        },
        {
            "review_text": "Your kids will hate you if you try to get them to play this game. It is frustrating, buggy and definitely no Mario Kart. As others have said, even on easy mode, the handling is hard to get grips of. Don't make your first game split screen with an XBox controller as the cars will all just sit on the start line, not a nice first impression. Playing a couple of single player games seems to fix this. Overall though the gameplay is frustrating and the power-ups are pretty useless. The graphics and music are also a bit of a mixed bag, initially fun but gets tiring very quickly. I got this game for a dollar, and would love to recommend it, because there isn't much of this genre on Steam apart from Sonic. But the sad truth is you'll probably get more fun split screen in a shareware copy of 'BC Racers' on DOSBox, as aged as it is. Been waiting decades for a decent Mario Kart style game on PC, this is definitely not it, probably 'Beach Buggy Racing' on the Windows Store is the next nearest bet, the graphics are way better and it supports up to 4 players ...",
            "review_score": "-1"
        }
    ]
}