{
    "app_id": 371550,
    "name": "A Bastard's Tale",
    "release_date": "2015-05-26",
    "developer": [
        "No Pest Productions"
    ],
    "publisher": [
        "No Pest Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 10,
    "positive_ratings": 164,
    "negative_ratings": 38,
    "price": 3.99,
    "description": "A game about parrying, attacking, and overcoming difficult foes",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/371550/header.jpg?t=1462617559",
    "minimum_requirements": "OS: Windows ME and 2000 and later Processor: CPU with SSE2 support, including Intel Pentium 4, Pentium M, Core or Atom, AMD Athlon 64 or later. Memory: 1 GB RAM Graphics: 256 MB RAM Storage: 68 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " TL;DR: I highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Tough and really fun. I like this fighting system.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap, Simple, Fun but actually not as easy I thought but I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, just play the demo. Full game is garbage.  Level 1 is exactly the same as the demo and it conveys a harsh but fair sense to the player about the gameplay.  Level 2 immediately betrays this trust developed with the player by having enemies with almost non-existent wind-ups and questionable indicators of how they will swing at the player. Even after you overcome that aspect, one enemy with death throes tosses his spear up and instead of coming straight down, IT STARTS TRACKING THE PLAYER FOR NO LOGICAL REASON AND IS UNBLOCKABLE.   This is what's called trolling your customers. Please don't support it.",
            "review_score": "-1"
        },
        {
            "review_text": "Get jump scared by the rotating bull.  10/10  P.S.  Steam says: 'You need to have used this product for at least 5 minutes before posting a review for it (3 minutes on record).' Me: i raged quit! but i will come back, back for you my fiendish bull friend.   P.P.S I opened the game just for the 5 minute requirement, played another one and raged quit again.   10/10 would rage quit and play and ragequit ang play again!!",
            "review_score": "1"
        },
        {
            "review_text": "1. Turn off lights 2. Sit in underwear 3. Play some music by a Vatican Orchestra in the background 4. Prepare to cry a lot  10/10 would become a knight",
            "review_score": "1"
        },
        {
            "review_text": "Such an awesome game! Art style, gameplay, details in it! Espeacilly the death animations. I like they change to the way you swing. With enough practice as the trailer says game is so cool. It really gives that tense to you. You can feel that hit. You can feel that victory inside you. IT IS SO COOL! The only thing I didn't like is that characters repeat it self. Maybe with a different color or with a different hair it would be better. But that doesn't effect this: 10/10 Awesome Game!",
            "review_score": "1"
        },
        {
            "review_text": "If you like playing darksouls with your genitals only, this is the game for you.",
            "review_score": "1"
        }
    ]
}