{
    "app_id": 3720,
    "name": "Evil Genius",
    "release_date": "2009-06-22",
    "developer": [
        "Elixir Studios"
    ],
    "publisher": [
        "Rebellion"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Base-Building",
        "Strategy",
        "Villain Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 1847,
    "negative_ratings": 95,
    "price": 6.99,
    "description": "Everybody wants to rule the world! Achieve global power with EVIL GENIUS, the one and only complete world domination simulator. All the everyday tasks of the deliciously wicked mastermind are available to experience and master from building your ultra-secret base to developing spectacular super-weapons to carry out your nefarious master...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3720/header.jpg?t=1478599968",
    "minimum_requirements": "Supported OS: Microsoft Windows XP / Vista                    Processor: Pentium® III 800MHz processor                    Memory: 128MB RAM                    Graphics: GeForce2 16Mb or equivalent                     Hard Drive: 1.4 GB of free hard drive space                    Sound Card: Windows compatible sound cardDirectX9®: DirectX 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "One of my favorite games of all time. Where other games similar to Dungeon Keeper failed, Evil Genius succeeded in so many ways while also creating a world that was unique in itself. The goal of the game is to build an evil secret base on a deserted island and further your plans of world domination. Be careful, however, for the forces of good will do everything in their power to stop you from fulfilling those dreams. You control everything from a birds-eye view where you build rooms and objects via 'blueprints' which Minions then proceed to purchase and place for you. The game overall is very smooth and challenging. After all these years, I still haven't managed to beat the game and I bought it when it first came out! All in all, I love this game and I highly recommend it to anyone who wants to rule the world and throw foolish special agents into giant mixer bowls.",
            "review_score": "1"
        },
        {
            "review_text": "This game rule! Since I was a kid I played this game, and somebody should come up with evil genius 2!",
            "review_score": "1"
        },
        {
            "review_text": "Let me say one thing first. I have played and loved Dungeon Keeper 1,2 as well as Evil Genius. Saying Evil Genius is a clone of Dungeon Keeper is to me like saying Chess(EG) is a clone of checkers(DK). There are similarities but one is a lot deeper and harder to master than the other. There is nothing before or since like Evil Genius. There have been attempts to do something like Dungeon Keeper with mixed results. No one has to my knowledge has even tried with Evil Genius. It is also the only game I know where so many people(like me) are crying for a sequel. The game does have some flaws involving minion, space and gold management. The learning curve is very steep at some points and it is not always intuitive how you do some simple things like interrogate a prisoner. Even with the bugfix patch it can be a little unstable. For the first time through, expect that you will have to go to the glossery and the internet for help and that you should save often. Even on easy mode, Marimba Mamba (the weakest superagent) is most likely going to wipeout many of your high level minions, steal some of your ill gotten goodies and blow up your power stations while you are checking on an act of infamy. On the plus side there is a lot of humor and some replayability. The graphics are dated but it still looks good. It is worth buying this game, even at its non-sale price.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  + fantastic art style, everything is presented nicely + best soundtrack in a game + extremely original idea of a game, executed very well, balanced gameplay, a bit on the hard side if you want to master it, but not unfair + addictive, great atmosphere  - it's meant to be played all at once, you will forget things if you save and play it after many days, since there are no chapters or something like that, gameplay is continuous - as i said, might be too hard for some, but in management games it's all about balance and evil genius has great balance  so where is evil genius 2? waiting for it all these years",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best simulators where you play the bad guys on the market.  Has lots of content, from resource management and minion management to traps and worldwide domination. It does not fall short in any catagory other than story, as there is not much of one, so there is much room for roleplay in this game. Small price tag adds even more to the value, and it's a great game to play to kill time, be it in one sitting or in short bursts. Has a charming humor to it, and the lack of any real dismemberment and bloody carnage further adds this charm to it. The game can be very difficult and very frustrating, especially the last half of the game, but it only adds to the flavour of the game.  10/10, would lock Russians in a giant venus flytrap filled room again.",
            "review_score": "1"
        },
        {
            "review_text": "A seriously underrated classic. Anybody who was twitching anxiously back in 2005 for Dungeon Keeper III picked up this game like a heroin addict picking up used syringes for their fix. Much to our surprise, we got an entertaining, visually interesting, and mentally tantalizing base-building strategy game with far more depth than you might assume going into it - and far more challenge, too.  The premise is pretty simple: you're an evil genius just starting out on his road to world domination - but first you need a base of operations complete with your evil lab, your own private prison, your vault to store ill-gotten goods and your gold, your private sanctum for meeting with the world's biggest and baddest, and of course traps and security measures galore to keep out pesky special agents. What better location than a tropical volcanic island? The user interface and controls are easy to master and the tutorial takes about five to ten minutes to complete. But once you do that, it's on to figuring out how your minions work and function as they all have their own AI and need certain things to function at maximum capacity. Be prepared to make back-up saves and potentially start all over after having realized your entire lay-out for the base is inefficient and wrong. There's no shame in checking out a few guides for this one. Of course if you're an AbsoluteMadman(TM) then feel free to blow up the whole thing and start again - yes, you can do that.  The game has tons of interesting features and you'll find yourself attached to all the characters, from your own avatar (this game begs for customizable avatars and not presets), your personal elite henchmen, and all your various science, military, and social minions. The game does a pretty great job explaining its features so I won't linger on that too long, and it keeps a steady stream of new toys for you to play with and make you engaged.  A pretty great way to chew up an afternoon or seven. I highly reccommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Great 'monster' dungeon type game. Recommend going through population file and change the max population size to at least 200 or 400.",
            "review_score": "1"
        },
        {
            "review_text": "Everybody wants to rule the world! The one and only complete world domination simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Very recommended! The game allows so much fun to happen in just one session, and you'll be playing it for a long time, I assure you. Things are really balanced, and offers gameplay that many games dont have. And on top of that, once you're done the game, theres still so much playability! Really well inplemented thoughts in such a great game.",
            "review_score": "1"
        },
        {
            "review_text": "You get to be the bad guy. What more can you want. ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best and underrated base-building games ever made. Challenging gameplay, unique visual look, atmospheric soundtrack and marvelous humor. Do you need more reasons? Just try it and you'll understand what I'm talking about.",
            "review_score": "1"
        },
        {
            "review_text": "very good stratedgy game! just think dr evil + the sims....",
            "review_score": "1"
        },
        {
            "review_text": "You want to be an Villain? This game get's you going. Swirl enemys around and conquer the world.... kind of. Everything you've dreamed of,... or not. It's fun, It's old, It's totally insane - Best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Take every bad, or good, bond-type movie. Make yourself the bad guy. Hijinks ensue.  You might want to edit the game data files to make Jet Chan a bit less ridiculous.",
            "review_score": "1"
        },
        {
            "review_text": "+Smooth design +Great graphics for it's day +Smooth gameplay +Holy ♥♥♥♥ that soundtrack +Great Characters +Plenty of variety in gameplay  10/10 The Evil Genuis of base building.",
            "review_score": "1"
        },
        {
            "review_text": "Feel like being the 'bad' man instead of the commercial hero? Feeling like showing the world that you're smarter than the heroes out there? Then this is definitely the game! This game has everything that a villain wants; minions, 'special' bodyguards and genius traps!  This game got it all, and do remember, this game is harder than expected. Heroes only got one weakness, they are cunning and they are going to ruin your so masterly crafted hideout! Can you defeat them? Can you make it in time to create a superweapon to bend the world?  I definitely recommend this game if you got that little devil inside although it has some few bugs here and there that should be fixed, such as your prison cage is unavailable and minions being dumb as a door though that's to be expected as you are an evil genius and you don't pay them anything anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Such an awesome game. Super adictive and funny. I wish there was a second one :( I know this game is old but take a leap of faith and buy it. its so much fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "Reminded me a lot of Dungeon Keeper II!   Big reason why I bought it!  Also... who doesn't want to play as Dr. Evil?  The game is rather well crafted, even if the arbritrary unit limit can stall the game a bit late game IMO.. Easy work-around online to change unit cap, allows for some crazy army attacks on intruders lol  Totally recommend for all aspiring villans and Underlords.",
            "review_score": "1"
        },
        {
            "review_text": "Best Strategy game I've ever played. To this day it is still one of my favorites!",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious game, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "There is no other game like this. It's like an incredibles RTS where you're the bad guy. A real classic and a pioneer in RTS gaming.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Better and more intricate than any 'top' tower defense game on the market... This makes all those other games look incredibly dull and simplistic. It's a mix of Tower Defense and a Strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "It's an older game so it has its ... charms. But I think it is fantastic. Very deep game with a lot of cool features. Looks great too, looks like a stylized modern game. An all time favourite. But again as it is old, it does not have most features of new games LIKE A GOOD CAMERA. It also does have some bugs but if you look past those this game is a MUST HAVE  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Interesting RTS style game set in a stylized Bond Villian world. Simple, fairly short, but offers a lot of entertainment. Best feature is designing the most cunning impenetrable evil lair that you can. Defintiely worth it whilst on offer.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game probably way more than I should have. It's so addicting thats dangerous when I start to play it. I get so into it that I cannot stop. Its bad. Very very very fun game that eveyrone should beat at least once.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game many many times before. It never gets old. It is immaculate. I cant think of any other game like it. BUY IT",
            "review_score": "1"
        },
        {
            "review_text": "You play a Bond villain. You have your minions do your dirty work while you design and build up your base (which is on your private island). Set traps for those do-gooders to get caught in, like a flame trap, or a bee trap. This is one of the games i always go back to.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun if you enjoy being the villain, Or if you just enjoy base building in general.",
            "review_score": "1"
        },
        {
            "review_text": "Oversee a madmans secret underground base, dictate henchmen to do your bidding, get rich pillaging the world of its pennys and golden underpants. What more could one ask for in life?",
            "review_score": "1"
        },
        {
            "review_text": "While the gameplay is a bit buggy and I'd love to see more content, the game itself is incredibly addictive. Definitely worth the time, even if most of that time I'm thinking how much better the game would be with a few improvements.",
            "review_score": "1"
        },
        {
            "review_text": "Evil Genius is a RTS that could be categorized as slow paced. I have found this to be true. But, what it lacks in game speed, it compensates in humor and intriguing progression. If you enjoy humor, laying traps for NPCs, interrogating prisoners, and an overall enjoyable, some what slow paced game, then Evil Genius is for you.  And, REBELLION, when is EVIL GENIUS 2 going to begin production? PLEASE consider a sequal!!!",
            "review_score": "1"
        },
        {
            "review_text": "Evil genius is what I wish the world was like.  You play as an evil genius (Who'da thunkit'), bent on world domination through the creation of a doomsday super-weapon.  On your journey you must establish your evil lair, in the side of a mountain (and then volcano) naturally, train the strongest and most useful of sycophantic minions, recruit nefarious henchmen, and thwart the forces of justice at every turn.  Come, and build your empire...",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE this. Shen yu Lord Kane Eli Barracuda and granny henchmen are all in it. Yes i am not kidding you. You can have lil' ol granny at your doorstep destroying mobs of enemys.... Lord kane creeps me out but he is good at plotting and eli barracuda is black Dynomite! Not kidding. He is litterally from the TV show Black Dynomite Look.... The game was olny $9.99 and i thaught it was a crappy game. since we got steam refunds i thaught i would try it. and i never never rufunded it because i was blowing up nashville gathering a army of henchmen and minions and building a base of the likes the world had never seen! I tottaly recomend this game to anyone on steam. It is a base building sim like warfare game with james bond like stuff. Like.... the island is unknown to all of humanity... accept all the agents the tourists the guy who drives the boat and helicopter all of your minions and everyone who watches the news. Yep they out did themselves with the super agents too. But it is cool! everything about this game is AMAZING and olny $9.99 so what is the problem? buy the game and if you dont like it return it. But you wont return it because it is too amazing. It is great to see such an old game be so good. Just try it. Everyone else did!",
            "review_score": "1"
        },
        {
            "review_text": "Why does this not have a sequel?!?  Also, Rebellion are ♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to kill 007? Well, this is the game for you. Awesome concept. And a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Evil Genius is a good strategy game, and fairly funny. On the down side the game is a bit buggy, and it can be a bit boring from time to time. If you can overlook that you will probably really like this game. I am looking forward to Evil Genius online.",
            "review_score": "1"
        },
        {
            "review_text": "The K.G.B landed on my super secret island, broke through my base door by kicking it, then killed all my minions.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "I Can Say One Thing For Sure... Only Cool People Play This Game. This Game Is Really Really Fun Even When James Bond Himself Walks Into Your Base And Kills You Still Fun, When Rambo Starts Killing Everyone Heading Right To You Still Fun, When It's The Year 2216 The Game Will Still Be Fun... Buy This Game.",
            "review_score": "1"
        },
        {
            "review_text": "i stole the Eiffel tower and placed in my office-Vive La France!   20/20",
            "review_score": "1"
        },
        {
            "review_text": "Great base builder game that was completely underrated.",
            "review_score": "1"
        },
        {
            "review_text": "Worked great until about 38 hours in, when the game stopped accepting input. No keyboard/mouse input even when attempted from various USB slots. Uninstalled and reinstalled, no change. Deleting this game for sheer nonplayability. Still a great game if it works.",
            "review_score": "1"
        },
        {
            "review_text": "No Mister bond. I expect you to die. ",
            "review_score": "1"
        },
        {
            "review_text": "The premise is good. Be an evil genius, send your minions out to do evil stuff. The problem I had with this game is that the explaination of how the mechanics work are not very good. The in game tutorial does an ok job of explaining the base mechanics, but the system itself doesn't tell you things that are essential to succeed at the game. Like if you don't finish x mission your base will be bombarded by a steady supply of soldiers until you complete it. Even a subtle hint of maybe you should focus on your mission rather than focus on defending your base, because the attack isn't going to stop.",
            "review_score": "-1"
        },
        {
            "review_text": "Big Story , 8/10 awesome game .",
            "review_score": "1"
        },
        {
            "review_text": "Great concept, Great theme, Great game.   Definately worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "the hell!! is it that hard for then minions to put out fires?!!! they all walk by the fire, buuuut ya. i cant even put a priority on a duty... please fix, the henchmen cant even arrest, even when i mark them to arrest. please fix. i cant get past a fire without my base melting. the henchman is useless.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked it until John Steele showed up... I most likely won't be playing it any longer.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't tell if this is the best bad game i've ever played, or the worst good game i've ever played.  Evil Genius is one of a kind. You play as the typical James Bond villain, with 8 feet minions fighting for you as you forfill your dreams of world conquest. This concept could of worked, very well. But Evil Genius completely crushed this golden oppurtunity with terrible AI, and tedious grinding.  One of the HUGEST problems with Evil Genius is the way your 'Minions' work. In a game like this, you're supposed to feel like a badass, as you epicly fight through enemy soldiers with your loyal army of minions. But in Evil Genius, you don't feel like a badass, you feel like a victim. As soldiers wave through corpses of your minions while your remaining soldiers constantly desert you every 5 ♥♥♥♥ing minutes.  The only way to keep up your minions 'loyalty' is by interrogating enemy investigators/soldiers you captured. Which is extremely hard to do depending on the way you play. Minions drain on loyalty completely every 3 minutes, and depending on your heat trespassers barely ever show up.  While their not busy constantly deserting, their busy going insane, getting stuck in a corner on a big piece of nothing as they suck up minion space.  So then your last saving grace is a henchman, which you only get about 3 of in the time you play.  Evil genius can be fun in the first couple hours, but it gets REALLY frustrating, REALLY fast.",
            "review_score": "-1"
        },
        {
            "review_text": "Serious crash issue makes this unplayble. Ohterwise would be a great game ",
            "review_score": "-1"
        },
        {
            "review_text": "Worth 2 Bucks , otherwise skip it.  You may be able to have fun from the concept but the time kicks in (outdated graphics), the 'Heroes' that get annoying after some time, the bugs and of course messing with your patience.  If you want to try something 'new' and be the evil Bond villain, go for it, but don´t spend too much or you´ll get dissapointed",
            "review_score": "-1"
        },
        {
            "review_text": "By far the best game ever! Used to play this game when I was a kid, absolutely loved it, and still do! Has an amazing replayable story line that I could keep on playing due to the different events that occur throughout!  I wish they were developing a second Evil Genius!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun! I would highly reccomend this game as it is also one of my favourite games of all time. As well as radio broadcasts (containing stereotypical characters from the respective country) being played after you commit many crimes, would say this game has a lot of replay value and it's so cheap!",
            "review_score": "1"
        },
        {
            "review_text": "I have to say I am a sucker for the Dungeon Keeper Wanna Bes. This is one of the more entertaining ones, though it has plenty of warts.",
            "review_score": "1"
        },
        {
            "review_text": "One of the first games I played on PC. THIS ♥♥♥♥♥ THE ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Become a evil genius. Torture peeps. Build in a mountain. Kill James Bond knockoffs. Control a army of minions. Steal from every ♥♥♥♥ing country. Become known as the most evil person on earth.",
            "review_score": "1"
        },
        {
            "review_text": "Great game I definetley reccomend it, one of my favourites.",
            "review_score": "1"
        },
        {
            "review_text": "Take the classic James Bond movies and become the villain from one. This is a RTS styled game. Sort of like a tower defense game meets world domination. I find myself coming back to it again and again. Minions, Specialized Henchmen, Elite Henchmen, Research trees, Body Guards, Various Rooms, Booby Traps for the would be James Bond or soldier type characters trying to get into your base etc. The graphics are not that great since it is an old game.",
            "review_score": "1"
        },
        {
            "review_text": "Genuinely genial base-building game. Despite being a decade old, it's still, quite likely, the best in its genre due to its mix of setting savviness, interesting mechanics and decent humor.",
            "review_score": "1"
        },
        {
            "review_text": "Great hidden gem. Its a Dungeon Keeper-like game in TF2 style with a great sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "While the tutorial doesn't tell you every thing, and the AI is slow at best it is still worth what I paid for it",
            "review_score": "1"
        },
        {
            "review_text": "You are an Evil Genius, you want to control the world, and nothing will stop you. Build your base, recruit your henchmen and minions, keep it running, and cause havoc all over the globe.  Let nothing stop your evil plan until you have complete and total world domination!   Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would let man with Afro do everything for me.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is one of the best base-building games I've ever played. I've played this game off and on for years, ever since it first came out. It's fun and quirky. Who doesn't like the thought of becoming a maniacal genius, constructing the perfect evil lair filled with traps for any pesky super-spies that come your way? You get to order minions around, steal amazing artifacts (Shrunken Eiflel Tower? Check. Excalibur? Check. Cloning Machine? Of course).   The game involves quite a bit of strategy--it's easy to run out of money, or find your base overrun with police SWAT teams. Going through the story mode takes about 5-10 hours or so, depending on how you play. But I found myself running through the story several times, each time saying all make my base 'better next time!'. All in all, a great game.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely bad ♥♥♥ game for those of you who belong to the cult like following of Dungeon Keeper 1 &amp; 2. This is an excellent strategy game that is quite dated, but has aged gracefully. The game has its own dynamics where you balance out 'heat' while trying to complete various missions. If you generate too much heat then the powers of the world will start throwing their aresenal of henchman at you to invade your own custom built evil genius lair.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that in a world without copyright laws would be named SimEvilLair. It's exactly the same as most sim games, almost to the point where if it was a hospital, it'd be Theme Hospital.  It is a fun game though, and you'll be starting again and again just to see how evil you can be and how awesome your lair design can get, but it'll probably only last you a few days.  All in all, I'd give this game a a nice healthy 6.5 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Evil Genius is what happens when Dungeon Keeper and James Bond villains have a child together. You play, as the game's title says, an evil genius, bent on destroying the forces of good and conquering the whole world. You start off on a small island paradise, with only a handful of minions, 250,000 dollars, and a single henchmen. From there, your task is to build a complex base of operations into the mountainside, complete with traps, training facilities, and more, while at the same time plundering riches and fighting off the constant intrusions from the forces of justice. Evil Genius manages to bring out the worst in all of us, and you'll be surprised to find yourself stalking the despised well-doers as they land on your little shred of land, eager to find out how they will meet your demise. And with ways ranging from bazooka-wielding Russians, to a complex set of bee-related traps, you'll find dozens of ways to amuse yourself with their death.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic strategy game! Only bad thing about it is a lack of a modern-day sequel to it!",
            "review_score": "1"
        },
        {
            "review_text": "I missed this game when it first released but had always wanted to give it a go as I heard it was similar to Dungeon Keeper, a much loved game from my early PC gaming days. After seeing it had launched on Steam for a modest price I snagged a copy and am pleasantly surprised by how in depth this hidden gem is, in some ways I actually prefer it to Dungeon Keeper.   The interesting thing about this villainous base builder is that rather than building small lairs and moving from level to level, you only have two islands to build on, one that you access from the start and another that unlocks halfway through. This allows you to expand your HQ over time and it's a rewarding experience to finally see your underground criminal empire begin to flourish. You also have access to a world map screen that allows you to influence the world outside of your base by sending your henchmen to commit crimes or perform espionage in various countries which brings in gold, specialist units and ups your notoriety. But beware, the more influential you become, the more secret agents the governments of the world will send to your island to unravel your insidious schemes. It should be noted that the game's theme is heavily influenced by 60s spy serials and it carries this off with a comedic tone reminiscent of the Austin Powers movies, which I rather enjoyed.  If you're a fan of Dungeon Keeper or looking to get into to the whole base building, overlord style strategy genre, I highly recommend this game. It's a great time sink and it's easy to lose a few hours twiddling your evil moustache and plotting world domination. Just be sure to watch out for that pesky super agent John Steele.",
            "review_score": "1"
        },
        {
            "review_text": "By no means a perfect game, but a deeply enjoyable one. The game focuses on base building and management, trying to keep the endless waves of agents from discovering your evil lair. The world missions almost seem supplementary to that, though they are needed to progress the game. You will find yourself waiting for these missions before you can progress.   Many of the issues I believe would be worked out in a sequel, though rumours have been circulating for years whether this will happen. Personally I would love to play a sequel that captures the humourous spirit of the original with some of the edges smoothed off.",
            "review_score": "1"
        },
        {
            "review_text": "I love the idea of this Game, something good to pass the time. It only needs Co-op and VS play... then it would be AWESOME.",
            "review_score": "1"
        },
        {
            "review_text": "love this game... i wish someone would pick it back up and do remake or 2nd installment...   they are a lot of glitches in game (its understandable; old game and noone to make fixes): 2nd island where if you build too close to volcano center it creates doors to doomsday weapon bay (thus preventing you from deleting those rooms and creating something else), minion leaves organization - you psych weaken them but sometimes the return to their duties, the marker for weaken still active (minions standing in hallway to weaken instead of doing something else), takes way to long to rebuild/retrain units after big string of heists/missions/theft, etc  I think if they gave more techs/rooms/objects/missions etc i would buy this instantly... worth the buy on sale i think for $10??? if for right price i would buy it again :D",
            "review_score": "1"
        },
        {
            "review_text": "Buggy and slow paced. However the humor and base building more than make up for it.",
            "review_score": "1"
        },
        {
            "review_text": "The closest thing to Dungeon Keeper 1 and 2 that has been released since they came out. The game has some very overly cheesy scenes and characters that go together very well toward making this a classic super villian hideout game.  If you enjoy base building, managing a workforce to steal artifacts and blueprints from around the world, as well as building crazy traps and other inventions, this just might be the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Just know this is the best simulator evil genius.   11 minions / 10",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourites for years now, the game that picked up the gap that Dungeon Keeper left at the time. Fun Base-Building Game that I still replay to this day.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game years ago on disc...not sure what ever happened to it. I'm glad i picked it up one sale, now i can play anytime i like.",
            "review_score": "1"
        },
        {
            "review_text": "You get to play an evil mastermind who wants to take over the world, hire henchman to do the dirty work and place traps around your base to confuse or kill the good guys.  What else would you want in a game?",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my favorite games ever. I so look forward to the possibility of some developer taking on an EG2 project someday. Frankly, I wouldnt mind an app for my tablet either.",
            "review_score": "1"
        },
        {
            "review_text": "Brings out the Dr.Evil inside you.",
            "review_score": "1"
        },
        {
            "review_text": "Not much to say here. It's a game about being an evil genius and takeing over the world. With that information you already know if your interested.",
            "review_score": "1"
        },
        {
            "review_text": "were you an old skool dungeon keeper fan? well this was made by the same guy that made those games.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, fun for all. ",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious game, i love it. For the older players amongst us, the easiest way i can explain how this game works is that it is a combination of Dungeon Keeper and Theme Park/Hospital. Build your lair inside a mountain complete with traps, security doors and (your own design) corridors, train your minions and of course become an Evil Genius and take over the world. what more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Satisfies both my love of stretegy games and my repressed god complex. Gameplay is awesome, reminds me of old 'theme hospital type' games. It is a truly unique game and thoroughly addictive as my 130hrs+ is testament to -a classic for sure!",
            "review_score": "1"
        },
        {
            "review_text": "Hard but fantastic strategy game",
            "review_score": "1"
        },
        {
            "review_text": "Evil Genius is easily the best game in its genre. I highly recommend the game if it's concept even remotely interests you.  Be sure to check online for hints and mods...",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game in the world!",
            "review_score": "1"
        },
        {
            "review_text": "Ancient but still fun. Way better than the Online Facebook game.",
            "review_score": "1"
        },
        {
            "review_text": "Underplayed and a cult classic",
            "review_score": "1"
        },
        {
            "review_text": "This game mixes base building perfectly with solid retrospective humour. Those of you familiar with old James Bond movies, with feel right at home with this games comedic foundations. The game will have you developing traps that open the floor to a deadly pit of saws one minute and then have you interrogating a prisioner with Micheal Jackson choreography the next.   The game oozes with charm. Not only that, but the game offers a solid strategic challenge as well. You will find yourself having to keep track of both your base activies and your world domition tactics on the world map (Think total war, but with everything happening at once). This sense of micro-management will never leave you bored, or unatentive. The game always presents a obstacle for you to overcome, rather that be enemy agents trying to inflitrate your base, a power failure leaving your base vunerable or trying to keep pesky tourists from wondering into your evil lair the game consistently presents you with challenges, some difficult some not, and never at any point leaves you with nothing to do.   Overall, this game is ranked in my Steam favourites. The game is genuinly funny and light hearted. It presents challenge with its gameplay, has a addictive formula to boot and is a hit for those who are fans of games like Dungeon(s) Keeper, Tropico and the like.",
            "review_score": "1"
        },
        {
            "review_text": "Don't judge it by the Steam screenshots.  When I played this game way back when, I didn't get it, but I liked bits of it and over the years I have referenced it and it has influenced me beyond count.   I bought it here on Steam last night and I played for seven hours. Seven hours of perfecting my evil lair and twarting the forces of justice. The first time I threw an enemy agent in a big baking bowl for interrogation was the summing up of this game. Serious but hilarious.   The best part of it, I played for 7 hours and I'm not even close to a finish. Main objectives leads you forward as you shape your evil empire. You have to gain notoriety with the world to complete missions which means you have to finish other missions, all of it sprinkled with humor.   This is for anyone who likes light hearted management or strategy games. It has survived the wear and tear of time as well and looks good as it has a unique look and feel to it.   It's been a while since a game made me long to get home and play it.",
            "review_score": "1"
        },
        {
            "review_text": "Deadly Game :)",
            "review_score": "1"
        },
        {
            "review_text": "Really unquie game . you are an Evil Genius who wants to take over the world/. you Build a secret base in on Unknow island and reqruie minions . and manage the base security , watch over your minions ♥♥♥♥♥. Send them all over the world to steal money or do terrorist acts to gain notoriety .",
            "review_score": "1"
        },
        {
            "review_text": "It's not easy being a super villain...but it is so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, the shear silliness of it. It's just a fun game to play. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "well this game is very nice surprise . it remind me dungeon keeper  it worth the price",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my ALL TIME favorite games. This game takes a comical and lighthearted look at what it takes to be an Evil Genius who's plot is to take over the world! Mwahah-...right this is a review. Anyway, This game incorporated base building activites, with a fun traps and trap wiring system. This allows you to create epic combinations of deadly traps, like satan's chimney, dropping gas chambers, flamethrowers, and other fun traps that can be wired in tandem to go off in response to three different sensors (floor pressure pad, laser trip, and motion sensor). You must also pay attention to the agents invading your base (that's what the traps are for) and various activities out on the world map so you can gain research, unlock new minion trainers, and a variety of other nefarious activities, but mostly hilarious acts of infamy that including things like stealing frikken lasers, blowing up gnashville, and publically executing the stars of a silly 'brady bunch' type show. BUY!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, good for some James Bond style laughs. But you'll be bored of it before you finish the campaign (I played many more hours off steam, but you can see from my activity that it's a fun game)",
            "review_score": "1"
        },
        {
            "review_text": "This is, perhaps, the best simulation game for being evil that I've ever played and It's very addicting. Controlling minions, stealing funds, increasing technology, man I really hope an Evil Genius 2 with current modern day tech that makes it even more awesome than ever!!!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I wish they'd make an HD version like many older games have now. I mean you get to be an evil genius in the 60's with a secret lair in a mountain/volcano.",
            "review_score": "1"
        },
        {
            "review_text": "so much fun, traps are my favorite part",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to rule the world, build a evil lair in a mountain like no one has ever seen before, well you can with Evil Genius a over the top but really funny game that takes the mick out of spy films like james bond and Austin Powers if you want 1 million Dollers, then you can have 1 million dollers",
            "review_score": "1"
        },
        {
            "review_text": "Its a fantastic game. Ehm, somehow it fits perfectly with Team Fortress 2 :D",
            "review_score": "1"
        },
        {
            "review_text": "Thank you yuri for bringing back old memorys of this game, This is a game you will enjoy, turst me!",
            "review_score": "1"
        },
        {
            "review_text": "Such a great old game. Absolutely delightful to play through again. Drags a little as you must wait for minions to be replaced or to repair your base but all the great animations and little details to make your evil base come alive is outstanding to watch. The game draws a great line between the funny and the evil of being someone ambitious enough to rule the world. The desciptions and radio messages of 'Acts of Infamy' are great. Interrogating 'forces of justice' and 'superagents' is entertaining. Missing a piece of loot because of moving to your second evil liar or missing an important piece of labortaory equipment brings down the game. However, these small detriments to the game do not take away from the overall enjoyment.   I would love to see this game get a little old school love like some other titles. The addition of achievements (which there could be a number of great fun ones i.e. trap combinations) would add a more longevity to this aging title.  Too much to hope that we will ever see a Evil Genius 2? Similar to Dungeon Keep 1 and 2, we will see poor clones or attempts. This one is a classic and a must play especially for those with an inner evil heart inside!  Absolutely recommended.  -Chaos",
            "review_score": "1"
        },
        {
            "review_text": "Pure brilliance. Way ahead of it's time, fun, funny and damn well interesting!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Hope they will put Steam workshop for more ideas for this.",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive if you like planning &amp; building intricate bases (evil lairs), like me :-)  Can be a bit slow to progress at times though.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game 10/10 !",
            "review_score": "1"
        },
        {
            "review_text": "It's like the best base building game to date  Heaps good ay",
            "review_score": "1"
        },
        {
            "review_text": "A delightful, maniacal strategy romp. It gets rather sadistic as it progresses, but you'll make it, I'm sure... MUAHAHAHAHAHAHA!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite not-so-great game. Has plenty of errors, but makes up for it in charm and innovation. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun little game, a worthwhile purchase for anyone who is a fan of the old Dungeon Master games",
            "review_score": "1"
        },
        {
            "review_text": "A game where you play as the villain, what else would you ask? Be good? WELL IT'S GOOD TOO!  PROS: this game didn't get old, the video tutorials are well narrated, I haven't seen any game like this one even now, strategic and complex in its way.  CONS: you can't speed up time or pause, and from what I've heard (I've never beaten the game) it becomes repetitive.  I find it pretty fun to play anyway",
            "review_score": "1"
        },
        {
            "review_text": "Great game with great humour! And traps, deliciously evil traps!  Warning: After a few days you will start laughing with distinct evil undertones.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun although a huge time waister, occassionally a super agent will appear and cause half my base to blow up and kill all my henchmen, and even glitch out, but its good (this isnt a helpful review, im just making one so i can get that stupid steam badge)",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Can't think of any other game that has this much attention to detail with quirky humor, great soundtrack, and fun elements.",
            "review_score": "1"
        },
        {
            "review_text": "If you have not played this game and like strategy games, grab it now!! $2.50 for hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "First off, this game is fun but the in game tutorial is ♥♥♥♥♥♥♥t and doesn't explain anywhere near enough.  Also, the length of time required to do Anything is ridiculous. Honestly its damn infuriating sometimes.  Oh yeah, and the random arrivals of enemy agents that never leave and that you cant deal with (had three super agents on my island that won't ♥♥♥♥ing leave even though I have no heat and am doing everything I can to ♥♥♥♥ing avoid them; meanwhile they kill every agent I try and send on unrelated missions so I can never get anything done).  Its still pretty fun, but when you spend hours and hours on a game and never really progress because the mechanics are flawed, its maddening.  I hate that I cant give a mixed review. I'd likely give this a 6 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incedibly addictive! So much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. really fun and entertaining.10/10",
            "review_score": "1"
        },
        {
            "review_text": "Cracking little game from a bygone age, so much to offer that I've still never finished it.",
            "review_score": "1"
        },
        {
            "review_text": "Only Ivan understands me.",
            "review_score": "1"
        },
        {
            "review_text": "There are, of course, more games where you play an evil overlord (hello, Overlord!). There are also, of course, more games that focus on building an underground lair as an evil overlord (hello, Dungeon Keeper!). But there is, so far, only one Evil Genius. A must-play for all would-be criminal masterminds seeking world domination.   Amazingly, Evil Genius still looks fresh 12 years after its first release - mainly due to its cartoon-like graphics and wacky sense of humour. It's not a particularly hard game to learn; it's not even particularly hard to master as long as you remember to pace yourself a little. Perhaps most importantly, it's a game where actually winning is only part of the challenge. After all, why would you try to rush towards victory when there's so many deliciously vicious ways of dealing with your opponents (and the occasional disloyal minion) to think of? And remember, if things do take a turn for the worse, it's not your fault - it's just that you're surrounded by incompetent fools!  Unfortunately, a minor expansion pack (the World Somination Kit), including an extra henchman, is not included in the Steam release - but it is still available online, so don't forget to grab that one, too.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game 11/10 recommendation. lots of fun, very good way to pass the time :)",
            "review_score": "1"
        },
        {
            "review_text": "this is a total fun game. Extreemly addicting",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on the first day it came out originally and still play it 12 years later. 50h on steam is nowhere near the real number.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like a simpler dwarf fortress with spy movie themes. My only complaint is that it slows down a bit when you have to send your henchmen to steal cash rather than preform acts of notoriety. The interface can also be a bit clumsy if you’re used to modern games.",
            "review_score": "1"
        }
    ]
}