{
    "app_id": 372190,
    "name": "Astro Lords: Oort Cloud",
    "release_date": "2016-01-15",
    "developer": [
        "Aratog LLC"
    ],
    "publisher": [
        "BISBOG SA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "MMO"
    ],
    "genres": [
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Space",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 22,
    "negative_ratings": 25,
    "price": 0.0,
    "description": "Astro Lords: Oort Cloud is a free-to-play, science-fiction MMORTS combining construction management with click-and-drag Artillery style combat and strategy elements such as exploration, raiding and espionage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/372190/header.jpg?t=1452894342",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 Processor: 2 GHZ Dual Core Memory: 1 GB RAM Graphics: NVIDIA GeForce 6800 or ATI Radeon x1950 256 MB and higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "fun city build game, until your pilots eat all or your microships making you have to waste time in upgrading your power plants and your weaker buildings (not a big problem or anything, just stupid that your pilots have to eat a valuable resorce)  it is pretty fun for a 'free'to play. 'free' as in you have to buy ♥♥♥♥ every now and than with actual cash.  its stuck in a christmas view which is quite irritating.  no one comes to attack you, mainly because no ones ever on, and everyone is useing world chat and talking about how the game works or flameing over what is best pony (rainbow is best fyi)  the game is pretty much 50/50.",
            "review_score": "1"
        },
        {
            "review_text": "ANOTHER game i will NEVER get anywhere in.... because i REFUSE to PAY TO WIN!!! ANY game where you have to purchase ANYTHING to get ahead, is NOT worth playing. Obviously the reason there are pay to win games out there is because they are trying to raise funds to employ better game creators so they can make REAL games.",
            "review_score": "-1"
        }
    ]
}