{
    "app_id": 372150,
    "name": "Yasai Ninja",
    "release_date": "2015-07-21",
    "developer": [
        "Recotechnology S.L."
    ],
    "publisher": [
        "Recotechnology S.L."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 35,
    "positive_ratings": 9,
    "negative_ratings": 25,
    "price": 1.59,
    "description": "Yasai Ninja is a hack &amp; slash game set in feudal Japan where Kaoru Tamanegi and Broccoli Joe face the most terrible vegetable-fighters. Play 1/2 Player mode and finish the adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/372150/header.jpg?t=1478076013",
    "minimum_requirements": "OS: Windows 7, Windows 8, Windows 8.1 Processor: Intel Core 2 Duo @ 2.1GHz or equivalent Memory: 2 GB RAM Graphics: GeForce GT 320M or equivalent Storage: 1500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well, its obvious this game has some issues that I hope the devs are working on right now...  That being said, I played co-op with a couple of controllers and it was kinda fun. Sometimes, me or my nephew died just because, but the more I played the more I enjoyed controlling Broccoli. The Onion's combat abilities seemed way more boring.. I understand the title is a 'lets play this funny game with your kids for a while' sort of a thing, so, from that point of view, it was not bad at all. Especially the 2D levels are a lot of fun.  Pros: Creative character models, nice music, fun when playing 2Dlvls in co-op, Bosses, puzzles.  Cons: Keyboard controls, missing sounds, sometimes weird camera. ",
            "review_score": "1"
        },
        {
            "review_text": "I definetly see potential in this game! Sadly it just feels unfinished and the menu is a pain to navigate through! I only played with a xBox One Controller and i maybe had some problems you wouldn't encounter with a different controller or mouse and keyboard!  Let's start with the Pro's: Sadly here isn't that much to tell. The only positive things to say are, that i see potential, the characters seem interesting and unique and the artstyle looks very good.  The Con's are pretty much anything you can imagine. Starting with the menu. First i looked through the settings and i had the first problem: Long animations you can't skip! Please make them shorter or skipable! Next i noticed while i have a controller connected the game thinks i am constantly pressing left in the menu. This makes changing the settings impossible, unless you want everything as low as possible. (While playing the game the controller behaves normal) After literally one hour of trying to fix this i noticed that the problem is with the game, so i just skiped the settings and started the story (without sound, because of the mentioned problem with the controller in the menu) The controls feel spongy and you have no indicator if you hit the enimie. Because of this it feels like you swing your sword or nunchanks through air and don't actually hit them. This makes the gameplay boring. Another weird thing is the camera. I can't really describe it but it just feels wrong. While the artstyle looks great if you like this kind of artstyle the animations don't. They look sloppy and lazy.  Overall this game looks fun as long as you just see screenshots and some selected videos. When you play it it just feels unfinished and far from polished. I've played Early Access titles and games in a pre alpha state that felt more finished, wich is sad, because i see potential in the characters.",
            "review_score": "-1"
        }
    ]
}