{
    "app_id": 372160,
    "name": "Soviet Monsters: Ekranoplans",
    "release_date": "2016-07-14",
    "developer": [
        "santasco.com"
    ],
    "publisher": [
        "IV Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy"
    ],
    "achievements": 21,
    "positive_ratings": 11,
    "negative_ratings": 13,
    "price": 10.99,
    "description": "You are in charge of the day to day running of the Ekranoplan program. Manage resources and staff to keep your craft operational. When a mission arrives from on high you must be ready to face the challenge and pilot your Ekranoplan / command the crew to a successful and glorious outcome!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/372160/header.jpg?t=1486677790",
    "minimum_requirements": "OS: Windows Vista/7/8 (All OS must be 64 bit) Processor: Intel i3 2.6 or equivalent Memory: 4 GB RAM Graphics: Dedicated graphics with 1GB VRAM (DX11 compatible - Nvidia Geforce GTX 470/ATI Radeon 6900 series or greater) DirectX: Version 10 Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you like having fun with blowing stuff up while floating at 500 kmph than this is the game for, or if you like you can do stuff that is more peacful like evacuating chernobyl (my personal favorite) or saving a crashed helo, but if you dont have good patience than some of these missions arent for you. For those of you who dont know what the 'Caspian Sea Monster' is its a huge ground effect vehicle. Ground effect uses said ground to create a lift, this is what gives it speed. Im getting off track if you like the sound of this game, look up the ekranoplan project and do some research and buy the game!",
            "review_score": "1"
        }
    ]
}