{
    "app_id": 372540,
    "name": "The Lost Mythologies",
    "release_date": "2016-01-28",
    "developer": [
        "Basaltic studio"
    ],
    "publisher": [
        "Basaltic studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "Female Protagonist"
    ],
    "achievements": 1,
    "positive_ratings": 1099,
    "negative_ratings": 514,
    "price": 0.0,
    "description": "The Lost Mythologies is a Chinese styled action game with intense combat. Use various skills to defeat loads of enemies, explore the ruins of the fallen empire and finally face the notorious ancient weapon - the Black Rakshasa.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/372540/header.jpg?t=1496886026",
    "minimum_requirements": "OS: Windows 7, Windows 8 Graphics: Nvidia GTX 650 or above DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Trust me, you will spend more time finding the perfect view of the boob than actually playing the game.",
            "review_score": "1"
        },
        {
            "review_text": "The Lost Mythologies is a Beat 'Em Up Demo.  I only got it after seeing it on a list of easy (&amp; fast) 100% Achievement Games, but ended up being entertained for almost 1hr. I don't usually play fighting games though. The basics is, you enter a locked room, defeat all of the enemies inside, &amp; unlock the next room. Repeat. The graphics were pretty good. The sound effects were ok as well. It's not in Eng. so i only know what the Store page says, as far as story goes, but the contols were simple to pick-up using a controller. The store page also says that it's made by a student group, so i'm guessing their stuff will contine to get better.  Overall: + free + easy 100% Achevo's (takes 1sec.) + easy to pick-up controls + ok graphics + made by students  - kinda short - repetative  ",
            "review_score": "1"
        },
        {
            "review_text": "  Very nice. Oh I should probably qualify that. The gameplay itself is reasonably fast paced. Fortunately the controls aren't sluggish so you can respond in kind. Whenever I was hit I usually felt it was my own fault, so that's always nice.  The graphics, or at least the aesthetic they chose, seems this/next gen. Everything flows smoothly. The game duration is extremely short, but it's a tech demo/school project (or so is my understanding) so it works. When this studio actually releases a full game I'll definitely pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good for one random dude. (?) - Very nice character model. ( ͡° ͜ʖ ͡°) - Somewhat fun but very lacking hack and slash gameplay.  - Sttacks don't have any weight to them and its hard to tell if you're being hit or if you're hitting. - Setting seems a bit weird. looks like it starts out in ancient(?) china but then you have mechanical doors and metal ♥♥♥♥ here and there. - AI seems a bit cooked. - Camera is pretty annoying, and I can't see what is happening most of the time. - Controller support is very nice and works very well. Don't know what B does tho. - Very short, but fairly fun. - Only 800mb download, took me 10 minutes to download here in AUS. - Dashing feels somewhat like devil may cry which is nice.",
            "review_score": "1"
        },
        {
            "review_text": "You must add options to configure visual effects (disable), not everybody here have a good PC",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good I think  nice the graphic , gameplay",
            "review_score": "1"
        },
        {
            "review_text": "For a free game it has some nice graphics and the most challenging achievements. ",
            "review_score": "1"
        },
        {
            "review_text": "Well that was easy.",
            "review_score": "1"
        },
        {
            "review_text": "Something for Hack 'n Slash fans in asian style for free",
            "review_score": "1"
        },
        {
            "review_text": "Main protagonist has a nice pair of tiddies, and her butts pretty good too, other than that I dunno how to feel considering the gameplay is pretty standard for a hack and slash, and a full english translation still isn't out.  7/10 art is hot",
            "review_score": "1"
        },
        {
            "review_text": "Spent more time downloading the game than beating the game.  Essentially the same enemies are fought throughout the playthrough, and the final boss is a pushover.   How to become immortal: Hold down shift to target (which the game didn't explain) and spam f (dash), while mixing left and right-clicks (light &amp; heavy attacks).    ",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot reccomend the game in it's current form, even as a demo.  The enemies are boring, the dodge mechanism does not work (the enemies hit you in the back half the time even if you dodge), character is too slow (half naked demi-goddess slower than enemies in full suit of armor?) and the camera is really not helping, randomly changing direction during a fight.  The graphics are acceptable and very scenic, that is absolutely a good point and something that made me finish the game.  3/10 but the devs show potential, mabe next game is gonna be a keeper.",
            "review_score": "-1"
        },
        {
            "review_text": "i played for about 5 minutes character animation are stiff along with ai animations. mobs can run through walls and cause you not to be able to go any further seeing you have to kill everything to get the magic walls to come down. other then that a gamee that would possibly have some good potential if it where cleaned up a little better but as for now thats a no go for me",
            "review_score": "-1"
        },
        {
            "review_text": "  This game gets a thumbs up because the developer was smart enough to realize no one would pay for this mess.      -Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "ez achievement and easy game",
            "review_score": "1"
        },
        {
            "review_text": "It's free but you can't swim in it.",
            "review_score": "1"
        },
        {
            "review_text": "found little yellow octopus in a corner somewhere. 10/10 best game",
            "review_score": "1"
        },
        {
            "review_text": "Its Free and worth the download: This game feels and most likely is a Pre-Alpha test for the full game. The game looks good runs 'okay' (there are some frame drops troughout the 25 minute long game). Gameplay is okay, no where near the level of Devil May Cry or Ninja Gaiden games‎ but satisfying enough to keep playing for a while. The visuals is where this game shines, it looks beautiful with its polished simplified style. ",
            "review_score": "1"
        },
        {
            "review_text": "A handy way to kill an hour or so. If you're bored and like hack and slash games, give it a go.  Controls and movement feel a bit odd and unatural, but I aclimated quickly enough. The gameplay is actually pretty challenging too.  Overall I'd give it a B- (heh).",
            "review_score": "1"
        },
        {
            "review_text": "A very very stylish free(as in freeware/completely devoid of microtransactions) action game,for now the game is pretty small,but it's a promise of great things to come.",
            "review_score": "1"
        },
        {
            "review_text": "butts and boobs that all i can say about this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is good but I think this game need to be (Early Access game)    pros: -good hack and slash  -good effects  -simple control (Easy to understand)   cons: -No english language(even thou i am half chinese ._. i still don't understand) -can't understand the story(all in chinese) -this game too rush?(at least give an early access warning before putting this game on steam)  -abit of delay(when i boost jump with the pink color thing, few second delay then fly to other side)   Overall this game is not bad, you guys can try out even thou is not in english.    ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely terrible ",
            "review_score": "-1"
        },
        {
            "review_text": "  The moment when i was able to deinstall the lost mythologies....   I never had more fun in my life  Edit: By the way, the patch notes say 'english patch is out' the only thing that was in english is the menu itself.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my money back",
            "review_score": "1"
        },
        {
            "review_text": "I only downloaded this to get the 1 achievement that it has.....and it doesnt even work. Good for a laugh.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried this out for goofs, and it's honestly really bad.  Truly, the best part of this game is to use the camera to look at the model of your character because she is so well designed that she even has a more defined butt. And you can see that under the skirt because of the camera that, for some reason, overshoots itself.  Beyond that, animations are not smooth. I swear the game runs at 30 FPS, or at least the controls respond like they do. The gameplay is boring. I had times where the character was standing on air. And the enemies and death were not that interesting.  Oh, and gaining an achievement for opening the game is not an achievement.  It's worth a look-at for the curious or Chinese people that are absolutely broke. For all others, I recommend staying away.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah its in chinese but because i was playing moonlight blade open beta i didn't have to worry about that. Sure i cant read chinese but you just click stuff and figure it out..   So basically this game, graphically its okay, combat would be nicer if there was some half decent targeting because the one they currently have sucks and does nothing but make a yellow circle like thing appear. I just don't get this game, you start off run through a bit of a dungeon like thing and thats it run into a wall and your done..  Is there any more to this game or what? :S",
            "review_score": "-1"
        },
        {
            "review_text": "Very impressive for a 5 man unversity project.",
            "review_score": "1"
        },
        {
            "review_text": "For the game being free, its definetly a yes from me. Has some issues, but its great.",
            "review_score": "1"
        },
        {
            "review_text": "Basaltic.exe has stopped working.     Seriously now.  Review Name: 'The Lost Optimization'  The Lost Mythologies is a pretty good short free game, with Hack N' Slash combat. I can't get the story though. It's really badly optimized, and it's fine for me, and combat is pretty good, although it gets boring quickly. There really isn't much to say for it. Let's just rate it already. Also the graphics are good.  6.0/10 ~Could've been better",
            "review_score": "1"
        },
        {
            "review_text": "-Launched the game. -Got Acheivment \\o/ -Looked at boobs -Died, saw epic living skirt -Kncked guy off cliff -Jumped off cliff..... still falling -10 minutes later, relaunched the game. -Looked at boobs again -Got to the last room. Died.... continued fighting dead. -Beat game. Nothing happened.  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "It's a cool game that's very well animated and straight forward. I'm surprised this was a student project. It'd be cool if it was made into a full fledged campaign style game.  ",
            "review_score": "1"
        },
        {
            "review_text": "For a free to play student project this is actually pretty amazing!  Definitely worth a try if you don't have any bandwidth limits.  As a game though, this is not really a thing... it's very limited and is more of a showcase of this person's game making skills.  Still, give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "I am running Win10. This game stutters very badly, even on the lowest settings. The FPS is so low the game will lock up for 5 to 10 seconds . Yes, I know its a demo more than anything.  The controls are basic but there is really nothing in game for a tutorial. Yes, I read about having to redo the models for a tutorial and it needs translation.  Overall, I like to feel of the game and the crisp play but these two elements cripple the game.   btw, it says I played for 5.7 hours. Its more like 5.7 minutes IG, 40 min for the download, 15 to load to character twice.",
            "review_score": "-1"
        },
        {
            "review_text": "A very great game which you can complete in less than 20 minutes. Test your reflexes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just for killing time if youre bored. There is really no GUI other then the health and mana, press mouse left and right as well as key 1 and 2 and just kill monsters. The idiots who keep putting reviews on here about english support...... for what?.... you kill mobs and then a boss, it doesnt require any words in any language really... The graphics were nice, music was decent, and the model had nice boobs and butt to enjoy when the game play was getting a little boring. Its free, its a simple game, just stop crying and giving this bad reviews because you yourself are simple minded.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game :D i pretty like the character",
            "review_score": "1"
        },
        {
            "review_text": "As I open the game, the game starts in windowed mode and the settings can't be changed before starting a new game. When the game starts, I change the settings and move a bit to start the tutorial.   The tutorial is very aggressive, not even letting me fully see/use any of the abilities or key commands. I move to fight some easy enemies with high motion blur, noticing that in order to evade their unanimated attacks I have to jump instead of blocking or rolling away if my attacks are still in motion.  I take a look at my kawaii desu character's Dat Mass but also my surroundings, noticing that a lot of lens flare is used, that many of the ground textures look like plastic rock (or squared tiles) and how there is no sand or any filler texture to add realism to the environment, paths or walls.  I try to fight many of the ranged enemies and a big enemy all at once and die, causing the game to crash.  Not sure if I want to start it up again.",
            "review_score": "1"
        },
        {
            "review_text": "pretty nice game",
            "review_score": "1"
        },
        {
            "review_text": "Controls are smooth and tight on a controller, although the camera takes a while to move.  Rather fun game from the hack and slash standpoint   Combat can be a little janky at times and the death animations of enemies is a bit simplistic.",
            "review_score": "1"
        },
        {
            "review_text": "The Lost Mythologies was very fun for me. The character is very cute, monsters pretty easy to beat, scenery was excellent.  It is quite short tho, and it was freezing a bit although it was not that bad, and also I did not get the achievement upon opening the game. In short, would definitely recommend, and cheer for a longer game of this type.",
            "review_score": "1"
        },
        {
            "review_text": "This type of game is becoming rare. Fast pace with plenty of colourful slashing, similar with Ninja Gaiden (by Team Ninja). Half of players around the world loves this kind of game, especially when you mix shooting and slashing, and add a beautiful story then it will become a complete work, and soon will be a franchise. There isn't much of this kind lately, so if this one will push through, then the makers might make it in the market, with good money to cash in. Take my advice, the story will sell a game, but the game itself will produce an awesome profit - your formula should be: Story-Shooting-Slashing",
            "review_score": "1"
        },
        {
            "review_text": "My only issues with the game is the lag. It doesn't only affect the gameplay but it starts at the opening sequences, too. I'm still looking for the English subtitles, but that's the least of my worries/problems for now. Aside from that the graphics are awesome and I want to further enjoy the game as much as possible.",
            "review_score": "1"
        },
        {
            "review_text": " Short, free, fun action   The Lost Mythologies is an action, in particular a demo of an action game. It's pretty short. The controls (not customizable), graphics and music are fine, gameplay is fun enough. The tutorial messages are in Chinese, the menu is in English.     Also (it wasn't shown or I missed the info) press Q to use glowing red disks in the 4th room.  The achivement is bugged. And there's even one easter egg.  ",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphic and main character model (booty~~!)! Spend an enjoyable little moment (or a big one if you see what I mean~~) with this short but nice game.",
            "review_score": "1"
        },
        {
            "review_text": "It is free so..  But only good thing is lighting and camera motion blur. I think more 3rd-person games should use camera motion blur.",
            "review_score": "1"
        },
        {
            "review_text": "Lost Mythologies is a strong demo for Basaltic Studios. The combat was fair for a student project. The pacing and audio need work though. Between battles I found myself either dashing or getting distracted ;P  Looking forward to more from the devs.",
            "review_score": "1"
        },
        {
            "review_text": "This is a proof of concept more than anything. Its pretty, but unpolished.I'm no the look out for more stuff by these developers.",
            "review_score": "1"
        }
    ]
}