{
    "app_id": 372670,
    "name": "Eternal Realm",
    "release_date": "2015-05-18",
    "developer": [
        "Omega Games"
    ],
    "publisher": [
        "Omega Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "RPGMaker",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 6,
    "negative_ratings": 10,
    "price": 0.0,
    "description": "The journey begins with four silent protagonists. They go into dungeons, fight enemies, defeat bosses, and level up. But, is that all there is to their lives? Meanwhile, in the real world, a group of bored game designers are looking to bridge the gap between the virtual and real worlds.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/372670/header.jpg?t=1541726703",
    "minimum_requirements": "OS: XP / Vista /7 Memory: 512 MB RAM Storage: 120 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is the WORST RPG maker game on steam, the dev should be ashamed of themselves! There is nothing in this game that ANYBODY in the entire world could not do with a copy of RPG maker ACE. You can go on any RPG maker site and get a better looking, full screen game made with some actual love then this trash.  Cons 1. All default RPG maker RTP graphics 2. Small screen, doesn't even use the FREE full screen script for the game... 3. Takes up space on my HD 4. Is on steam and makes all RPG maker games/devs look bad. 5. Got in bundle so costs me about 30 cents, they should have paid me!  Pros 1. Makes me thankful for the GOOD RPG maker games.  Do not buy this game, the dev has no idea what he is doing, a 16 year old boy on any RPG maker site makes better games for FREE!  You owe me 30 min of my life back!  Update! This sack of ♥♥♥♥ dev is now flooding Greenlight with 100% Default RPG maker RTP 'games'! ♥♥♥♥ your mother!",
            "review_score": "-1"
        }
    ]
}