{
    "app_id": 372940,
    "name": "Lost Lands: The Four Horsemen",
    "release_date": "2015-07-14",
    "developer": [
        "FIVE-BN GAMES"
    ],
    "publisher": [
        "FIVE-BN GAMES"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Hidden Object"
    ],
    "achievements": 20,
    "positive_ratings": 170,
    "negative_ratings": 7,
    "price": 4.99,
    "description": "The captivating adventure of a brave girl, destined to fight the Four Horsemen of Evil in an enchanted world. After several centuries of peace, a terrible new evil threatens the Lost Lands! Find out in this thrilling Hidden Object Puzzle Adventure game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/372940/header.jpg?t=1545052653",
    "minimum_requirements": "OS: XP/Vista/7/8/10 Processor: 1.6 GHz Memory: 512 MB RAM DirectX: Version 9.0 Storage: 1111 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sequel to Lost Lands: Dark Overlord and second in the Lost Lands series. Though Lost Lands: A Hidden Object Adventure is created by the same developers, Five-BN, and quite possibly occurs in the same world, these games are not related by storyline. Though it would be interesting if somehow the developers managed to tie the storylines together.  Storyline: A few centuries have past in the realm of the Lost Lands and a new threat has appeared in the form of the Four Horsemen: Chill, Flare, Death and Darkness. These Horsemen are slowly and methodically destroying the Lost Lands world and Maraan, the wizard/druid sets a spell in motion to bring the warrioress and once before savior back to the Lost Lands. The intrepid Suzanne is teleported to the Lost Lands where she embarks on the quest of defeating the Horsemen and finding the Compass of the Worlds (the key to a magical portal) before one of the Horsemen does. For help on the quest, Maraan sends a dwarf named Folnur to Suzanne as a guide, to protect, and to provide useful information.  Gameplay: A quasi-open world with area based bottlenecks, and more of a Point and Click then Hidden Object quest adventure. The Hidden Object scenes are silhouette finds of the interactive type. Each Hidden Object scene shows silhouettes which when found are then used to do other things like open boxes, scrap wax from a table, cut roots out of the way, etc. until the main object of the scene is obtained. Nothing overly difficult though some intuition (such as looking in baskets or crates) and careful searching is required.  The Point and Clicks aspects are more complex and require not only careful searching of an area to find all the needed inventory items but often travel. There is a no penalty fast travel map which the further and further along in the story the player proceeds the more and more the fast travel map is needed. Many items and several puzzles found early in the game or in previous chapters can not be accessed until a later time when the needed inventory is eventually found. If playing on casual mode these items and locations are highlighted. If playing on Hard mode, notes or a good memory is needed. The game will give the player hints about where to find something, such as 'Where have I seen that before?' among other comments. There is also an in-game strategy guide if one gets stuck or can not find an item needed.   The puzzles are mostly sliders of some variation, straight picture sliders, put the correct piece in the correct place, and rotating sliders. There is also matching, codes, and picture puzzles. Nothing overly hard, but there are a few puzzles that do require some thought to solve. NOTE: One particular puzzle in the beginning of the game has an achievement attached if the player can solve it in less then 70 moves. The in-game stategy guide does the puzzle in 92 moves, so achievement hunters will have to earn that one on their own. (This puzzle can also be accessed through the mini-games in the Extra menu after both the main game and bonus chapter are completed. So no need to play the entire game again just to play the puzzle. Love, love this feature.)   The bonus chapter concerns the dwarf Folnur who Maraan has asked to help Suzanne after her arrival in the Lost Lands, and Folnur's preparations to do that and to craft a magical dwarven hammer. In the main game the player sees his arrival which is the conclusion of the bonus chapter.  There are two sets of extra finds: 1) is morphing objects (35 total) and 2) machine parts (35 total) found through out the main game. If the player finds all 35 pieces of the machine this unlocks a bonus feature which is a set of extra puzzles.   A few words about achievements: All achievements can be earned in a single playthrough since most are gameplay oriented. For one achievement the player can not use any hints DURING GAMEPLAY in either the main game or the bonus chapter or in any puzzle or Hidden Object scene which is standard. One achievement is found in the bonus chapter and is a timed picture puzzle. Also both the main game and the bonus chapter must be completed to earn a couple of achievements. If the player missed the puzzle achievements during gameplay they can be earned through the mini-game section in the Extra menu. That is so innovative and eliminates a forced second playthrough.   Extras: First of all there is the in-game strategy guide which makes playing the game on Hard mode the first time through easier if the player gets stuck or misses some needed item. This game has many extras which become available after completing the bonus chapter. Extras include wallpapers, concept art, music and cut scenes. It also includes a replay of the 21 puzzles found in the game and 3 picture puzzles. If the player found all of the machine parts there are 20 extra pipe puzzles to solve under that bonus feature.   Overall, an enjoyable game to play, not too hard and not too easy. Despite a bit of fast traveling near the end of the game, it plays smoothly and relatively logically. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wonder what would happen if lord of the rings turned into a hidden object game? This game reminds me a lot of the lord of the rings movie before the nasty ring took over. You have the wizard who could look like gandalf. You have the dwarf gimli. Then you have the hobbits here they are called the halflings. You also later run into some bad guys on horses. I should mention you also meet a werewolf. So their is that connection. The graphics and sound are very good.  The heroine who you play looks a great deal like sarah palin. I am not sure if thats deliberate or the guy may just be a fan of hers. The glasses and hair really look like hers a lot. A very interesting game as it does contain pages of the lore of the story that you find along the way. I really like how these games are made. Artifax could use some of these game mechanics. The best part is the extra goodies your supposed to find are labled on the map to make it a lot easier to find them. Arti needs to put this idea into their game maps as its next to impossible to find all of their special objects.  A very fun and good time for HOG fans like me. Pick this up if your fan of Lord of the rings like me.",
            "review_score": "1"
        },
        {
            "review_text": "The prequel, Lost Lands: Dark Overlord, is an excellent game, and this sequel is even better. Though it thematically fits in the 'casual point-and-click and hidden-object game' genre, actually it is mature, long, and difficult enough to appeal to fans of 'classic' point-and-click adventures. There are actually very few hidden-object scenes, and though there are several mini-game puzzles, most of your time will be spent in thinking about how to use the objects you find.  It's long, with a lot to do. I played it in expert mode, and it was quite challenging indeed. The bonus chapter is a fun prequel that satisfyingly fills in a gap in the story. There are lots of attainable achievements, and they are fully synced with Steam.  The graphics are good, and the cut scenes are exceptional. The story is neither amazing nor original, but serves well to keep the adventure going.  Voice acting here is a significant improvement over Lost Lands: Dark Overlord. The characters feel fleshed-out and flavorful.  Highly recommended for fans of the casual point-and-clicks and HOGs!",
            "review_score": "1"
        },
        {
            "review_text": "love the map icons and directions. the graphics are good.  ",
            "review_score": "1"
        },
        {
            "review_text": "I loved playing this game, I liked the story and doing all the puzzles.",
            "review_score": "1"
        }
    ]
}