{
    "app_id": 373240,
    "name": "Black Sails - The Ghost Ship",
    "release_date": "2015-09-17",
    "developer": [
        "Deck13"
    ],
    "publisher": [
        "Deck13"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 123,
    "negative_ratings": 47,
    "price": 6.99,
    "description": "Best played with the lights turned off and the volume turned up, Black Sails is a creepy and mysterious point-and-click adventure game.Two survivors of a shipwreck try to survive in the raging sea. Until another ship appears. Hoping for rescue, they are calling, but nobody answers. They manage to go on board. Will this be their rescue?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/373240/header.jpg?t=1452093745",
    "minimum_requirements": "OS: Windows XP (SP3) / Vista (SP2) / Windows 7 Processor: Processor with at least 2 GhZ Memory: 512 MB RAM Graphics: Direct X9 Compatible Graphics Card with at least 128MB Ram DirectX: Version 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "5.5/10 - Short Mediocre Horror/Suspense Point and Click!  This game is pretty average but I can appreciate that the creators didn't try to do too much. They stuck within their wheelhouse and made a short but decent game. This point and click offers a more realistic horror element than most. The characters are fully voiced and well done. The notes however are complete garbage; tiny scribble writing I stopped even trying to read. I completed the game in just shy of 2 hours; due to the quality, plot and length $10 is quite steep for this one!  You play as a woman who narrowly escapes a sinking ship and manages to find herself aboard another abandoned vessel. You and a new companion begin to investigate the ship, looking for the captain and crew. As you explore the true nature and story of the vessel come to life! Will you and your companion finally find salvation?   Worth $2-3; not bad, but I'd look for 75% off to truly enjoy this!      Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "fun, love the fact that the controls are responsive and when I mouse over things, there is actually an indicator... :) graphics look good, I even like the voice acting. def worth the money. These types of games are hit or miss with me though I love the genre.",
            "review_score": "1"
        },
        {
            "review_text": "A creepy and mysterious point-and-click adventure game. Story 10/10 Graphics 7/10 Gameplay 8/10 Choices matter 10/10  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Black Sails is a Creepy and Mysterious Point &amp; Click Adventure Game from the German Developer Deck 13. It's a story about 2 passengers who end up on a Ghost Ship. Like any Adventure Game, you search for items or clues in order to escape from the ship alive. If you like Adventure Games, this will be a very good addition to your collection. To maximize the game experience, turn down the lights and put on the headphones. The graphics and voice acting are great, but not always perfect. The puzzles are not too difficult until you get near the end. I suggest you save the game, think about it, then go back and play the game.  There are only a few problems with the game as I see it. The game is too short; you could probably finish it in a day. The other problem was that the game seems to crash often. Just Save the game often and you'll be OK. I see where someone commented about the voice acting, remember this is a Germain game. What you see is the characters speaking German, and what you you hear is English. I bought this game on sale for $4.99 and I'm quite happy with it, I got my money's worth out of it, so I am recommending this game for True Adventure Fans.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Black Sails - The Ghost Ship - Full Game GIVEAWAY ( 1 Steam CD-Keys ) [PC] [Ended]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Boring, somewhat convoluted point-and-click adventure game. It has a good idea behind it, but the execution isn't worth your time. The admittedly intriguing story is told through really bad voice acting (at least in the English version), and it all leads to an ending with no closure whatsoever.  As a life-long fan of point-and-click adventure games, I cannot recommend this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Why did this make a 345GB folder in my documents?",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to play this game but I simply cannot read the font used in the game.",
            "review_score": "-1"
        }
    ]
}