{
    "app_id": 373420,
    "name": "Divinity: Original Sin - Enhanced Edition",
    "release_date": "2015-10-27",
    "developer": [
        "Larian Studios"
    ],
    "publisher": [
        "Larian Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Turn-Based",
        "Co-op"
    ],
    "achievements": 54,
    "positive_ratings": 10601,
    "negative_ratings": 1201,
    "price": 29.99,
    "description": "Gather your party and get ready for the kick-ass new version of GameSpot's PC Game of the Year 2014. With hours of new content, new game modes, full voiceovers, split-screen multiplayer, and thousands of improvements, there's never been a better time to explore the epic world of Rivellon!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/373420/header.jpg?t=1512992769",
    "minimum_requirements": "OS: Windows 7 SP1 64-bit or Windows 8.1 64-bit or Windows 10 64-bit Processor: Intel Core2 Duo E6600 or equivalent Memory: 2048 MB RAM Graphics: DirectX 11 Compatible GPU DirectX: Version 11 Storage: 10000 MB available space",
    "recommended_requirements": "OS: Windows 7 SP1 64-bit or Windows 8.1 64-bit or Windows 10 64-bit Processor: Intel i5 2400 or higher Memory: 4096 MB RAM Graphics: NVIDIA® GeForce® GTX 550 or ATI™ Radeon™ HD 6XXX or higher DirectX: Version 11 Storage: 10000 MB available space",
    "reviews": [
        {
            "review_text": "This game is great in many, heavy aspects, and falls short on a few light ones. The negative aspects of it are more a matter of taste rather than being poor game design. Since so many negative reviews are written by people who think the game's too slow, I'll give a fast review so that you'll have time to play it sooner.  Pros: - Great game design. - Beautifully crafted world with a competent graphics engine. - Great soundtrack. - Combat is highly tactical and multifaceted. Planning and having a variety of strategies matter. (I recommend playing on Tactician Mode) - Profound character creation, that actually matters in gameplay.  - Dialogue choices (sometimes) matter and help build character traits. - Humour and pop-culture references. - Lots of secrets.  Matters of taste: - Very unforgiving to: Inexperienced RPG-players. Unskilled tacticians. People with bad dice rolls. Those who can't properly use Google as a last life-line. People who bought a keyboard without the F5 and F9 buttons. Sufferers of amnesia. - Slow, sometimes painfully slow. A beverage or friend to accompany you through some parts of the game is highly recommended.  - A bit too few 'in combat' tracks. - Arhu is ♥♥♥♥ing everywhere.  Cons: - Repetitive character auto-reactions to world effects. ('Feeling a bit hot under the collar!' 'On the mend!' 'What a deluge!' etcetera)  - Unnecessarily slow animations and queuing outside of combat. - A little too uninformative quest log. - Some quests/parts of quests are downright uninteresting. - As with any game of any publisher, a few bugs here and there.",
            "review_score": "1"
        },
        {
            "review_text": "I can not tell you properly with words how good this game is.  I will try however and I should start, as everyone, comparing it to old school RPG titles. Unlike recent RPG-called titles from this century —mostly made for the new generations of players, with little or no brains needed at all to solve quests—, Divinity: Original Sin looks like a true role playing game reminiscent of the old ages but with very cool new ideas —some of them unique— and fresh graphics.  The main characteristic, typical of Larian games, is the freedom to do almost everything you want: the game is classless, so you can choose a warrior in the beginning and later on you can change your mind and provide him with some spells or range skills, if you like it, when he level up; this way you will end up with four characters, two of them from the start and two more later on, with a combination of skills, traits and talents that fits you. You can interact with almost every item in the game: doors, chests, barrels, pictures, chairs, etc, and you can open them to look inside or destroy them if you prefer, or even take them and move them from one place to another. You can also choose if you prefer to talk to every NPC and solve quests, trade with them, or killing them if you like it, or even steal their items and loot their houses. Every action will make the villagers approach you in different ways, turning hostile to you or being polite instead. And if you don't like to trade with NPCs a lot you are able to craft your own gear and even spells if you choose to do it with the immense amount of ingredients and tools you will find everywhere.  What makes this game unique, and a gem, is a combination of the role playing part with the interaction between characters —even yours!— and its combat system. Divinity is not a combat focused game, it is more a conversational and exploration RPG title; however, combat is also very important and this is not a real time one, it is a turn-based combat system with action points mechanics that forces you to think about your resources, the enemies, and the environment; so each turn you can use your points to move, drink potions, attack or cast spells if you got enough points for them, or if you prefer you can reserve some of your remaining action points for your next turn, for example if you want to wait when the enemy is far away from you and later on you want to hit him two or three times in the same turn. The best part of the system is, no doubt, the chance —and mostly the need— of using the elements on your favour. It means you can cast a rain spell on your characters to stop them from burning; you can also cast rain on enemies, make them wet and then cast electricity spells for extra damage and stuns. You can also use ice spells if enemies are wet —state than come from your spells or from real rain itself!— to freeze them. You can shoot (after throwing it for example) an oil barrel with a fire spell to make it explode and damage the area, or just hit it with your arrows to make it pour the oil and later on cast fire on it if you wish. You can make an ice barrier to protect, wait until enemies are near it and then fire it, making it water and causing enemies to stumble, and then electrify them. You can combine elements to create clouds to avoid being a target. You can stealth and stab enemies too if you have the right character to do such a thing. You can use barrels and things of the environment to take cover, to protect you and to avoid damage. You can also try to flee if you find the situation too chaotic for your taste. You can... well, you can —and you should— do all these things if you want to survive, because combat is not always an easy task on this game.   For all these things I must say this is a heck of a game; I have not THAT fun with a videogame probably since some decades (I'm absolutely for real here). It's also true that there are some things that are not optimal and need improvement. Among the negatives, there is the camera movement, the slow pace of the game sometimes when you need to go from A to B, and the bad interfaz mechanics when you need to equip gear, change items from character to character, sell something or look at the items you got, or pick them. This is not a noob-friendly game; aside from the little dungeon tutorial at the start, you will find little or no help at all and you will find lost yourself if you are not used to RPGs games. However, asking in the forums will help you; there will be trolls, true, but overall the community will end up answering your questions and solving some of your starting problems, I'm pretty sure.  But if I take all these things together and put them all in a balance, I have to recommend this game to every player in the world. If you are an oldschool gamer you just can't pass on this. And if you are a new player and you didn't play or didn't even know any of the games other guys are mention, you have to give this one a chance and compare it yourself with the new RPGs. I promise you won't be disappointed.   PLUS you have also the Enhanced now, which add more quests, balanced skills, graphics, controller support, camera movement, subtitles in some languages, full voice actor and help with some of the issues the game got before. And even more difficult settings, with a new one with permadeath and only one savegame for massoquist tastes.",
            "review_score": "1"
        },
        {
            "review_text": "I have over 80 hours logged with the original version of this and it is by far one of my most favorite recent RPGS out there. They really added alot of changes. They revamped the crafting, added VO to practically ALL dialogue(and the voice acting is charming, IMO), and spruced up performance and made everything generally better.  If you played the original and loved it...this is complete fan service. Seriously. If all gaming studios treated their products with loving as Larian has done...the gaming industry would be unrecognizable.  I whole-heartedly recommend this. It makes a fantastic game even better.  ++voice acting; great quailty and I am damn sure the opening into narration is the same voice actress as the female british Inquisitor from DA:I ++dual wielding! ++GRENADES! ++more crafting/craftin UI overhaul! Hell...the entire UI has been changed and overhauled and for the better! ++optimized performance! ++better graphics all around than previous version. ++tactical mode for the people out there who love surprised and even greater challenge. They designed it to counter common strategies of players of the original. Seriously. I am seeing the AI do things I havent seen before in the original. Looks like its been upgradd. ++honour mode = one save only. Think of it as Ironman Mode. You die and your save is deleted.  I honestly cannot think of any cons right now. I will update this if I do. I am liking it that much.",
            "review_score": "1"
        },
        {
            "review_text": "By far the new standard in Couch Co-op games.  No longer is Player 2 invisibly bound to Player 1 by some kind of autoscrolling window game of running man simulator.  Quest, loot, fight, flee, craft, and create your own experinces independently, with a dynamic same/split screen interface.   Divide your party and combine again at any time through useful tools, like; Synced log/quest book, synced crafting recipies, magic pockets, send to player inventory, shared map/quest markers, and warp to player.   Use the character classes for Co-op role play, with skills like leadership for example granting bonus's to the characters when they are together.  The world of Rivellon is moulded by both of you, quest outcomes are debatable and roleplay dialogues allow you to express your opinion in game. Disagree with your flat-mate on whether or not those guards should be killed for treachery? Don't like how your girlfriends Cleric has decided to end a conflict peacefully? Oppose them in dialogue and force the issue to the fate of virtual rock, paper, scissors. Win and the desicion is made, lose and have comfort that your characters personality is still affected by your protest.   This game has recieved 9.0 /10 on IGN and 4.5/5 overall on Metacritic.  I persoanlly give it a 10/10 for co-op alone. Works great on steam link/controller.   Dont have a couch mate? the original sin comes with online co-op which plays out with the same flexibility.   ",
            "review_score": "1"
        },
        {
            "review_text": "I don't post much on Steam, and can't remember the last review I've written, but this game warrants one. Larian Studios has produced a masterpiece here. I love it. The co-op experience is amazing, and there are so many wonderful little quality components to this game, that I keep finding myself amazed! Just a few moments I loved:  1. The first time the buddy I am playing with interrupted my conversation and challenged the answer I gave the NPC, resulting in a rock/paper/scissors match. Very cool, and how these answers influence your tendencies, kudos!  2. The first battle I really experience environmental effects. Got frozen, then slipped on the ice, followed by 2 enemies falling beside me...  3. Learning how the crafting system actually works and then being floored by just how detailed it is. Holy crap, what a wonderful addition. Did my buddy really just break a bottle with a hammer and then put the shards of glass in an empty grenade to make an armor-piercing grenade. Cool!  4. When the enhanced edition came out and I got it for free. Thank you Larian Studios, love to see a studio that cares about the customer. Take note State of Decay. Additionally, what an improvement the enhanced edition actually is! Tactician mode is awesome.  I could go on, but I hope you get the point. If you enjoy computer RPGs, play this game. Even better if you can play with a buddy. Such an epic experience!",
            "review_score": "1"
        },
        {
            "review_text": "I know a lot of reviews say this game has no 'handholding' and is not for casual players, but don't let that neccessarily turn you away. I've never played one of those old-school CRPGs this game hearkens back to, so I entered the game pretty blind. It was very challenging at first, but once you get the hang of things and your characters have access to more tools and lower cooldowns, the combat aspect at least becomes much, much easier. And more fun. Every turn is like a puzzle. You don't just spam attacks (although I have two pure fighters who largely do... my two control mages support that.)   If you enjoy exploring every nook and cranny of a mysterious world, leaving no stone unturned, you will adore this game. While there is no quest tracker or markers or such modern amentities, the game actually does a good job of planting hints in the world (as well as updating your journal) so you're never left completely lost and confused. You get a great sense of satisfaction from figuring something out, putting the pieces together, following hints and clues, but nothing is completely obtuse. I've had to Google a couple times, but it's always been a 'DUH' moment. Never a 'how the hell would anyone ever figure that out' moment. Google isn't neccessary though... the answer is always in your inventory, in an NPC's dialogue, or hidden somewhere nearby!  I also like how I don't feel punished on normal difficulty for not building characters optimally. You have total freedom to build your characters as you choose, and it seems as long as you have a basic idea of what you want that character to do, you'll be fine. It seems like all the skill schools are pretty OP in their own ways. And you have a lot to play with when it comes to environmental effects, scrolls, grenades, etc. There's no battle you can't win, you just may have to try different approaches. There's a respec option available eventually, but I never thought, 'oh, I really ♥♥♥♥ed up and I NEED to respec.' I've been tempted to do it just because there are so many possibilities and things I want to try...  It's really difficult for me to feel compelled to finish a game these days, and I just can't get enough of this one. If you're a fan of RPGs of any sort and familiar with the basics, don't pass on this game. It's immersive, fun, rewarding, and best of all, you can play it with one hand. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Engrossing RPG with many elements from older top-down, turn-based, games. Does not go easy on the player and the mechanics need to be discovered, but once they are you get a valid sense of achievement when you complete puzzles and defeat challenging bosses. Inventory is bit of a pain as nearly everything is craftable into something else, so you don't want to get rid of much and the interface doesn't give you a search option (just sort by, which can be helpful). I recommend long time TBRPG players to play the Tactician mode as it makes combat difficult (and sometimes frustrating), but it really makes you play the game. I've enjoyed many hours so far exploring, trying to work out crafting, completing as many quests as I can, and doing a lot of saving and reloading--especially the saving and reloading. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Enhanced Edition with all the polish and improvements... it was great before, but the update put this over the top as one of the best turn based fantasy RPG's ever... if you enjoy fantasy rpg's... you need this game.",
            "review_score": "1"
        },
        {
            "review_text": "This crowdfunded RPG shouldn't be missed. Larian deserves a lot of praise for this. What stands out the most is how well designed, coded, and implemented the gameplay mechanics are. Lots of attention to detail here, and so much interactivity, such as the use of the elements (heat, water, air), being able to pick up and throw any reasonably sized object with ease, all of the different statuses. The UI is also good, although the hotbar should be expandable as it's annoying to have to cycle through them. This game has many different classes and a fairly complex leveling system, so that every character build will at least feel somewhat unique (although not quite as much as say the Neverwinter Nights games).  With all that being said, I can't help but feel this game is somewhat overrated by the press. It doesn't have the most role-playing in the world, and not even close. Yes, it has considerably more role-playing than the very limited Witcher franchise (they are based on novels after all), but compared to the all time greats it can be found lacking. Compared to Pillars of Eternity, it is also lacking in role-playing. There isn't much freedom in defining your characters' personalities, less than more recent BioWare games even. You are always a pair of Source Hunters out to save the world from evil, and there is only one dialogue 'skill' which is Charisma; however Charisma itself leads to three different dialogue options (each drawing from your Charisma score) which are Intimidate, Charm, and Reason. What you choose, and what you do throughout the game will alter the effective of these, putting points into traits such as Individualistic, Pragmatism, and more, but all these do is give you boosts to either Intimidate, Charm, or Reason, as well as a boost to certain other stats like Willpower (which is used only for resisting mind-affecting abilities).  At the end of the day, the dialogue is quite restrictive compared to games like Fallout, Fallout 2, Fallout: New Vegas, Neverwinter Nights 2, and Pillars of Eternity. Also, the game has two protagonists which you make at character creation, yet it lacks a party dialogue system found in games such as Neverwinter Nights 2: Storm of Zehir and Wasteland 2. This means, only one of your characters can be in a conversation and the other cannot freely intervene.  The quests are quite restricting compared to great RPGs. In order to beat this game I had to do things I didn't want to do, things that my character in my mind would not do. This game, despite the open level design, forces you down a specific path. Disappointing for an RPG.  Level design is very open. You are rarely limited in where you can go. However, enemies do not scale down to your level so many places will be utterly inaccessible just for this reason. Balance is a bit of an issue in this game, as generic human enemies of the same level have far more AP than you can ever have at that level, and wield weapons that are much higher level yet used with no penalty (and usually have more initiative too). In combat, enemies can open doors with no AP cost despite being nowhere near them. Then there are things such as one human enemy who is able to cast a master level spell with no cooldown. The imbalance is so obvious when (SPOILER ALERT) Bairdotr turns on you; one second she is part of your party, the next she levels up, has top tier equipment, and has far more AP than she should (unless her build changed to have most attribute points spent in Speed).   A shame, a mistake, and serious design flaws that don't affect smarter turn-based games. And then some enemies just have essentially no real weakness (not even talking about Source demons obviously since they do have a weakness and that's plot related). So there is some synthetic difficulty in this game, but not game breaking. A general balance issue is that archers are overpowered on both sides, enemy and player.  But many of these imbalances are somewhat offset by how stupid the AI is. The AI is nowhere near as smart as XCOM 2 and Enemy Unknown. Not that this is consolation mind you, this is just another flaw.   Furthermore, leveling up in this game is an extremely slow process. Far slower than any other RPG I've played. Too slow even, as it can slow down the pace a bit and it restricts the amount of combat abilities you get.   Speaking of combat abilities, I'd say there is less than Dragon Age: Origins and Pillars of Eternity. I'm used to Neverwinter Nights 2 so I'm spoiled and wish for more, but at least all of the abilities in this game are well designed and none seem useless. Some classes will have far more than others, naturally.  Writing and character development are not a focus of this game. Its tone is lighthearted, the real focus is on gameplay and exploration. Art design is pretty good, locations stand out a bit but nothing blows my mind and environments can seem more repetitive than some other games. The scale is large; locations are big and have a decent amount of detail and hidden places, but again nothing mind blowing.  Enhanced Edition contains many incremental improvements over the original, and they really add up. This game was crafted with a lot of care and programming skill. Now if only it had industry leading writers and directors. The second game has Chris Avellone on board, so I can't wait for that!",
            "review_score": "1"
        },
        {
            "review_text": "Just the fact that they gave this to existing owners of D:OS for free is enough to merit a 10/10 from me. With improved visuals, more gameplay, controller support, and fully voiced NPCs. this improves on an already amazing game in almost every aspect. Definitely one of my favorite RPGs I've played on Steam, if not number one. I cannot wait for D:OS 2! Just watched a video for the character creation and now they have races implemented and the graphics look insanely good! December 2016 can't get here fast enough.",
            "review_score": "1"
        },
        {
            "review_text": "I've played through this game twice so far, once when it came out and again in Enhanced Edition, both times in 100% co-op.  I have to say that the second playthrough was pretty fun. Knowing how to game the system, craft really powerful items and create a well balanced party that can smash through obstacles is pretty fun. The last boss just completely folded like a wet noodle in just over one turn of combat (it would've been less than a turn, but alas we cast some buffs that we didn't need). I had a particular amount of fun carrying a stack of oil and poison barrels in my characters inventory and throwing them out at bosses before/at the start of fights so that my ally could blow them up with meteors. KABOOM.   The 'Enhanced Edition' doesn't change much for most of the game, but does spruce up the ending quite a bit. And it's free anyhow, so what are you even complaining about? Unfortunately however, the game's approach to making puzzles is not enhanced. It's still 'go find this stupid switch that we hid between six levers' or whatever. Ugh. No thanks.   In any case, I'm quite looking forward to the sequel with it's competitive questing business. That will take a bit stronger storytelling than what they've been doing though. The story is already hard to follow with two people plugging along at different rates. I can't imagine how confusing it'd get when everyone's trying to kill each other or what have you.   But well, that's something for the future. For now, this is a good game that people should play.",
            "review_score": "1"
        },
        {
            "review_text": "Pros + Beautiful graphics + Open world which feels alive + Fully interactable environment + Interesting, nonlinear story + Ability to make decisions with different outcomes + Hilarious and clever narrative/dialogue + Challenging, rewarding combat + Lots of loot, items, and equipment to discover + Highly customizable character builds + High replayability  Cons - Some puzzles can be frustrating (for me, at least) - Limited character appearance options  Notes 1. Has the classic 'RPG' feel to it 2. Has online co-op 3. Does not hold your hand through quests, but has a useful journal to keep track of things  If you have any specific questions about the game, let me know!",
            "review_score": "1"
        },
        {
            "review_text": "I didn't realize it from the reviews, but this game is pretty much the closest you'll get to D&amp;D: The Videogame while still having nice visuals and production value. It gives you so many options for everything because everything has interactions with everything else. You can light oil on fire, carry an entire loot-filled chest in your inventory until you can find lockpicks, spend hours talking to NPCs in town, or kill literally everyone you see. It's also one of the few turn-based games in which multiplayer is actually enjoyable. If you like having a lot of freedom, give this game a look.",
            "review_score": "1"
        },
        {
            "review_text": "After 18 hours i finally reached lvl 2.",
            "review_score": "1"
        },
        {
            "review_text": "“One of the deepest and most unforgettable games I've played all year.”",
            "review_score": "1"
        },
        {
            "review_text": "D:OS is a classic isomorphic-style CRPG in the vein of Baldur's Gate, Icewind Dale, and before that the 'gold box' games like Pool of Radiance and Curse of the Azure Bonds (For you older C64 gamers!!). The emphasis is on story, exploration, and complex turn-based combat.  Pros: &gt; You can save at any time, including in the middle of combat &gt; Compelling, complex narrative with many sub-plots and deep characters &gt; Voice acting is excellent with only a few annoying performances &gt; Beautifully rendered game world with the ability to zoom in close &gt; No hand holding! You must often take your time and read objectives and notes carefully  &gt; Exploring and fighting, the meat of the game, is an absolute blast. &gt; Complex battles filled with elemental effects... like chess on a shifting, burning game board. &gt; Role playing through dialog choices can reward you with relevant bonuses &gt; Deep, complex crafting system &gt; Very cool weapons, armor and items to find and equip.  &gt; Interesting character upgrade system that seems to borrow the best parts of many different games. &gt; Co-op support... although I did not make use of it.  Cons: &gt; Some may find the lack of handholding frustrating... objectives are not always clear. &gt; Bugs... game crashed hourly. &gt; Crafting system seemed too complex to use without google help... although I was able to complete the game without using it much &gt; Limited replayability. Although I like the idea of trying different builds, unlike Skyrim this is not an open world game and you must follow a prescribed path. &gt; There are some game breaking problems that you may encounter. Fortunately you can save at any time... I would definitely suggest it.  It has been a while since there has been a game in this genre as good as this one. If you are a CRPG fan you MUST play this. If you are casual fan, get it on sale and try it out. Prepare to get sucked in for several months.",
            "review_score": "1"
        },
        {
            "review_text": "This is easily one of the best games I have ever played. Let's go over pro's and cons  1. Co-op. As a man that searches for games to play with his wife I love this idea. Couch co-op or online it is great. It's seemless going from sharing the same screen splitscreen gameplay between you and another co-op player. I love playing an RPG with my life and she loved it to. It also makes it easy to share dialogue options with two players and to quest together. We had so much fun together. 2. Visually beautiful. This game has a wonderfully colorful pallette. 3. Amount of gameplay time. The amount of content makes this game easily worth $100 and yet it goes for something like $40. A great value. 4. Storyline- Wow. Just wow. A multi- layered story with many stories interweaving in one another. Fantastic. I loved the stories. 5. Voice Acting and Music- Beautiful music and great voice overs. 6. Combat- fun turn based combat that uses the elements well. 7. Beautiful and varied enviroments. 8. Great controller support  Cons 1. The monster designs wtih a few exceptions (Bracchus Rex, Trife, the undeead mini bosses), were uninspired trope fantasy stock. 2. Puzzles- Some of them I just hated. I had to actually find a stupid switch I missed and I spent a long time looking for it! ugh! 3. Broken quest system- It's easy to miss a switch, accidently drop or lose an item, etc. Be careful not to sell or drop an item, key, or book unless you know for sure you don't need it or you can be screwed.  4. The Mapping system makes orienting and finding your position difficult for the direction challenged such as myself. There is no waypoint systems and the way the map moves makes finding east, west, north, south tricky. It could have been done better. They should have maintained it orienting north.  All that said. This game is so much fun, and playing hours upon hours with my wife was a great experience we both loved. I waited for the steam sale, but when they release a sequel we don't plan on waiting this time!",
            "review_score": "1"
        },
        {
            "review_text": "The Enhanced Edition of Divinity: Original Sin makes an amazing game more amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! A great throwback to old school RPG pc. This Game does NOT hold your hand... You need to read everything incase you miss something important, and check all the corners. I lost count of how many times i was well and truly stumped at what to do next.. Until i spoke to a damn rat that gave me a clue or something like that. It reminded me of being a kid again really enjoying games because of this reason (thankfully we have the internet for help now when desperate).  The gameplay is fun, you have so many ways to go about doing anything that even the most simple of solutions seem sometimes way too obvious to do.   Slow turnbased combat isn't for everyone, So if you don't like it don't bother getting this game. Every single person/creature is brilliantly voice acted too, it really draws you in and is very addicting... Only downside is i wish there was a way to cause a delay on the background chatter.. It's nonstop repetition with no wait time (Highly annoying!)",
            "review_score": "1"
        },
        {
            "review_text": "After throwing 130+ hours in the Classic edition, i thought i'd 'speedrun' the Enhanced edition just for the achievements. Well, i ended up spending another 56 hours with this masterpiece. Not exactly a speedrun! Oh, and when Larian says 'enhanced', they mean it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "'ridiculous amount of content' - this is simply the best rpg out there on so many ways. The little stories for nearly every NPCs, every follower, your charakter - even enemies and animals. A completely free skill system, nice crafting and character development makes it pretty much more overwhelming.  You like Neverwinter Night's and Baldur's Gate? Then you will love this one!",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to buy this game earlier, but decided to wait because I was intrigued by the Enhanced Edition and all the overhauling they have done. This game is not really a regular enhanced edition or remaster, it is a massively overhauled version of the award-winning 2014 RPG and Gamespot's PC Game of the Year 2014. What I loved about this is the fact that it's a publicly funded game by an indie dev, which means that it literally has no limits in terms of content. No crappy publisher-restrictions are there to hold them back like EA, Ubisoft or other Triple A devs/publishers. This reminds me of what CD Projekt did. Keep it up guys, looking forward to DOS 2.",
            "review_score": "1"
        },
        {
            "review_text": "Enhanced Edition as a title fails for what Larian did this to game. These aren't just new textures, or models. It plays like a whole new game. I think that Divinity: Original Sin - Enhanced Edition should be an example of how other RPG games should work. If you are looking for a fun co-op game to play online, or in your living room look no further. Co-op gameplay is seamless and fun. They have really built co-op into the story mechanics, as much as they have the gameplay. If you are looking for a long game, this is supposedly 100 hours of content. I don't believe that, because I've spent almost 50 hours and I am not even halfway. (No, I haven't been dying constantly.) Between the sidequests, puzzles, combat, the main story, and the crafting you will spend well over 100 hours on this game. I commend Larian studios for their incredible attention to detail, and their love for the game is shown in the work they put into it. Looking forward to Divinity 2.",
            "review_score": "1"
        },
        {
            "review_text": "PURE ART , JUST PLAY IT , NO NEED LONG SENTENCES, YOU WILL LOVE THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Great combat and character systems, bright and colourful world, and fantastically designed co-op mechanics make this the perfect game to the play with a friend. The one area where it falls down is pacing; walking around Cyseal and going through 5000 dialogues one after another isn't my idea of a good time. Other than that, though, amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "This game did so many things that were amazing.   1. It provided content on top of content. It seems crazy to expect so very much from a game without it requiring tons of DLC. To say I got the full value of what I paid is an understatement.   2. I am a big fan of RPG's and DnD. This game seemed to marry the two so well. That is a hard mark to hit.  3. It was so fun and SO HARD! I played on normal difficulty and while most of the time it was fine, but if you didn't stay vigilante you would die. It didn't hold your hand...which flirted with a bit obtuse sometimes but most of the time it was perfect.   4. The X factor of a well made game that you just want to keep coming back to.   All in all, the game had a few minor issues. But they seem to inconsequatial to mention. The story was good, perhaps a bit too stretched out in 100 hours of game play to be totally compelled by it. But it was still quite good.   Wow such a good game. If you don't mind putting a slower than average game than this one is for you. Remember that doesn't mean boring. Its just takes its time and has good pacing.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with a great number of tactical choices, using the environment and mixing right elements to aid you in battle. The two new difficulty settings seems like a great addition, going through tactician mode now. Enemies actually seems to work more with logic, using things better to their advantage.  There is some puzzles here and there also, some of them not so straightforward and requires some thinking. Dialogues are all spoken, even the animals.  Crafting is also quite good, with it you can experiment different combinations and might just craft someting nice. Skillbooks and scrolls are also craftable if you find them blank. There are also recipes that you learn from books.  If you like turnbased combat, saving throws, rpg's then this game is absolutely worth looking into.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best cRPG of all time.  But wait I'm not even finished with the above statement, mot only this is one of the best cRPG of all time, this game can also be clasified as one of the best turn based game of all time when you entered the combat part of this game.  Wait there is more, after playing this game, I can't help playing other western medieval fantasy game without thinking why can't I simply cast a poison spell on my enemies and then explode them with fire combo? Or make them slip on their feet while trying to chase me across an ice surface I laid down before them on the battlefield? Those environmental/elemental effects during battle in this game is nothing short of revolutionary especially in cRPG and TBS genre and should make us wonder why something like that hasn't been done before?  Aside from that the RPG mechanics on this game is quite simple and addicting, things like leveling, crafting or quests are good enough although not stellar  2 main downsides are the lack of in depth guidance in this game regarding those mechanics and the quests; number two is that the writing and story telling are just mediocre",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the better RPGs I've played in a long time. I give it a 7/10; this number would be even higher if it were not for the one flaw I find with the game - too many puzzles. Now that the one and only con has been stated (which can be mitigated should you decide to use walkthroughs), here is a list of a bunch of pros:  --Combat 10/10: One of the best turn based combat systems yet. It mixes an old familiar feel from early RPGs like Fall Out and Arcanum (using turn points) with an original take on using attributes to effect your turn points. Of course the usual things like constitution still gives hit points and things like that, but I feel the entire stat system as it pertains to combat is perfectly balanced.  --Story 6/10: Ok so the story isn't the best, but it isn't bad either. It certainly keeps you involved. It has two draw backs - its slow to start, and the other I won't say for minor spoiler sake.  --Graphics 8/10: I mean, its a turn based rpg.... so don't expect anything like skyrim. But compared to everything else in its game-group, its at least as good.  Overall, its well polished and worth playing. Would teleport a rabit into a lava pit again.",
            "review_score": "1"
        },
        {
            "review_text": "Letting me play that with controller was the last thing missing. Just incredible",
            "review_score": "1"
        },
        {
            "review_text": "One of best graphically wise game on Linux. Interesting so far story, well thought battle system(i find it way better than Xcom2 for example, where random does screw you over).  FPS is rather high on maxed out settings, wich is rather unusual for Linux port. First time I saw effects in this game, my jaw dropped. It's this good.  Some interesting mechanics is also present. Rather unusual for this kind of games. Fire arrow + oil barrel = mininuke.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic blend of turn-based RPG gameplay and dungeon crawler. Character and map interactions draw you in, but the diverse attributes and XP system make you stay. The game does a great job of rewarding exploration and side quests, but the leveling up process is honest enough that you don't become too overpowered as you progress. Serious fun playing with friends online, or amassing multiple bots to fight for you. Definitely one of the best dungeon crawlers I've ever played. Can't wait for the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. The enchanced edition smoothed out a ton of rough edges from the original release. Great game for the old school CRPG veterans.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I'm not a massive turn-based RPG fan but this game really did deliver in every way.  It is difficult at the start (for a short while) if you are a bit of a noob like me but only because I didn't realise quite how tactical you need to be! Once you discover that you'll need to think about using the environment, sight lines and structures to aid you against difficult enemies, it suddenly clicks! The game is very well balanced (in normal mode - which is all I've played), and each fight could go either way if you recklessly run into a situation. It is very enjoyable and the world, characters and quests are all expertly constructed.   What I very much appreciate also is that it isn't pandering to the direction of most mainstream titles by making the combat etc a bit of a chore, rather than a challenge (e.g. Diablo 3, which did not do Diablo 2 justice in my opinion). It also actually requires you to think a bit in the puzzles and quests and gives you mutltiple options.  Divinity - Awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Turn based strategic gameplay on a different sense. Unlike tiles, each move you make uses a certain action points, each turn you can either use the available action points or keep them for the next, or even use some and use the rest later.  You can create 2 characters for your gameplay and recruit more chars along your way. Traits and skills make customizing your chars a totally interesting experience, like a hero that heals from poison.  Just fun! Do try it.",
            "review_score": "1"
        },
        {
            "review_text": "What. A. Game.  Could spend days if not weeks playing it. Me and a friend have sunk over 30 hours into it and it barely feels like we've made a dent.  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've played in the last few years, Divinity: Original Sin may not have the most innovative combat or the original story, but it oozes charm and is freakin' delightful to play. The Enhanced Edition upgrades are really nice, though I'm not sure that some of the new voices are better than what was there before. I was skeptical about controller support but it felt natural almost immediately. I'm looking forward to seeing what else is new in this version!",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing RPGs for around 17 years now. This is one of the best. If you have the chance play it with a friend for a one of a kind experience.    supreme/excellent/one of a kind:  -amazing combat system -unique unprecedented local or online co-op of the full main campaign including roleplay choices -awesome character creation/leveling/skills/character progression -quests and all the different ways you can discover and complete them -graphics/optimization  good:  -story/plot -writing -music    no idea how it works lol:  -crafting system   cons:  -music can stop randomly mid combat -NPCs can turn hostile fast if you missclick; can be annoying in cities etc -if you know what you're doing you will be overpowered at the final third of the game and there is a lack of difficulty options -no 4 player support (there is a mod but not for the enchanced edition)",
            "review_score": "1"
        },
        {
            "review_text": "An enhanced edition that actually adds something to the existing game. Kuddos to the developers for giving this enhanced edition for free to owners of the original edition.   Pros:",
            "review_score": "1"
        },
        {
            "review_text": "This game is totally engrossing. It is consuming my every waking thought. Usually in these types of games I don't care what every NPC has to say, but in Divinity, I'm curious as to what is going to happen next. The environment is beautiful, the story is witty and fun. The combat is entertaining.   I wouldn't consider myself a hardcore gamer and I have racked up over 50 hours in this game in just over a week. That's insane. The only issues I have are minor, like quest direction can be somewhat vague at times and targeting in combat can sometimes change when the target moves right when you click making you move to the target instead of attacking, thereby losing your AP. Inventory management could be a little bit better laid out, but these are all minor and don't take away from the overall experience. Definately worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "Very good RPG. 2 Person Co-op. Got a few bugs, frustrating but not deal breaking.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly difficult game, playing this with a friend, online co-op on hardest difficulty with 2 Characters, all I can say is:  Tears of Joy, whenever a enemy misses.  We both are playing with controllers and I am enjoying it much more than with mouse and keyboard.  I didn't like the 'dont leave town until level 3' - aspect of the game too much, but I thinks pretty much neccessary for new players to get going.  Overall it has been an amazing, friendship-testing expierence so far :D, played it both single player and co-op, and i strongly recommend asking a friend too play with you!  cya",
            "review_score": "1"
        },
        {
            "review_text": "I loved it! If you like RPGs and enjoy being challenged, this is the game for you. Only thing that I could pinpoint as being bad is that there is not a way to forward it or speed up the battle animations, so it can take up to 15~25 minutes when facing difficult enemies.",
            "review_score": "1"
        },
        {
            "review_text": "Old School Cool RPG. Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game of tactical, turn-based commbat (akin to XCOM). Takes a start-point of a familiar fantasy setting and game paradigm, and adds some creative and novel approaches to cooperative play. The coop play, through combat, puzzles, and character interactions, is innovative and rewarding. Well worth a play, whether playing from a couch with a friend, or over the web.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this has thrown me back to old Baldur's Gate Neverwinter Nights 2! This game is awesome.  +Good graphics +Great Voice Acting +Great Combat Mechanics +Interactive Environment  -Slower Paced between fights  Only knock I see is the fact there is so much dialogue which really you can skip through most of it if you're not into lore, etc. Other than that, totally worth the sale price, can see soaking hundreds of hours into this. ",
            "review_score": "1"
        },
        {
            "review_text": "Divinity: Original Sin - Enhanced Edition and Liam Neesons is my ♥♥♥♥!!",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable game. Since it is a turn based combat game you can easily continue playing while multitasking ;) ",
            "review_score": "1"
        },
        {
            "review_text": "Tried to dig up some graves, got punished with 80k damage on all party members.  10/10 will never be a grave digger again.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not quite sure why, but i really like this game. Maybe it's the mix of RPG and Strategy, The way the worlds looks and feels but i don't know.  Join the Fabulous Five and don't forget to tell your friends!",
            "review_score": "1"
        },
        {
            "review_text": "What can I say that the RPG fans don't already know. Great game. Old school like Baldur's Gate but with new gen flash, Lots of interactivity with the environment makes it fairly tactical too, I really like it :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is sick.",
            "review_score": "1"
        },
        {
            "review_text": "This Enhanced Edition is worth your money and your time. Play this first before you start with Divinity: Original Sin 2. (Duuh :D)",
            "review_score": "1"
        },
        {
            "review_text": "This game takes the old-school CRPG system and just does it right. Complete freedom to customize your characters, not restrained to specific classes. Any character can learn any skill, so you can create hybrid classes just the way you want them. Conversation and interaction play a huge role, so it's worthwhile to pay some attention to personality skills too. Combat is much more similar to the original Fallout games - turn-based tactical, although it's not restrained to a grid. Flanking, backstab bonuses, line of sight (including whether you have an ally between your archer and your target), and lots more make combat deep and rewarding.  And don't forget about the element interactions - environment and spell effects interact to a major degree. Enemies standing in a puddle of oil are much more vulnerable to burn damage. Throw a water balloon at an enemy to wet them, and follow up with a lightning attack for bonus damage. Toss a poison gas grenade at a group of enemies and then hit the volatile gas cloud with a fire arrow for some major explosion damage. Tons of interactive environmental things - room decorations like crates, barrels, chairs, etc. can be moved and aren't just decoration - in fact, moving these things is sometimes key to solving puzzles or progressing.  Even more mundane things like equipment repair, rare object identification, crafting, and all of that are handled very well.  I highly recommend this game to anyone who was a fan of games like Baldur's Gate, Planescape Torment, or the old-school Fallout games.",
            "review_score": "1"
        },
        {
            "review_text": "A well crafted and immersive world where the players interactions serve to only increase their immersion. A thoroughly enjoyable plot with little or no hand-holding.   A game that rewards choice and tactics, without hampering imagination.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This easily became one of my favorite games. Great to play alone, even more fun to play with a friend.  The one reason I love this game so much is because of the great combat system. If you find the game too easy, there's always ways to challenge yourself, such as playing without companions or as a glass cannon build, with less health.  Skill and build possibilities are endless, I love making new characters to try out new builds. A little sad I lost my playthrough of my earth spells-archer hybrid due to a savegame bug, but this will simply motivate me to start another playthrough! Will definitely play this game over and over again, with friends or alone. Can't wait to play the sequel! Ofcourse there are a few downsides to this game, such as the forced stealth sections, the lack of tips or a helpful journal, the constant reloading, but I can list the game's downsides on one hand while I would need twenty hands to list all the things I love about this game!   Do you love a tactical rpg with a funny story that doesn't take itself too seriously? Are you prepared to yell and cheer whenever luck shines your way, or when the game mercilessly beats you down? Are you eager to throw yourself into a big world with countless of monsters that all require a different approach to beat them? Are you ready to experiment with dozens of builds and party combinations? Then play this game as soon as you can, what are you waiting for?!",
            "review_score": "1"
        },
        {
            "review_text": "This is the first 'PC Fantasy RPG' I've ever played. I spent my first 10 hours figuring out the systems. I still don't know exactly what all the mechanics are but I'm really impressed by this game. The scope and scale are jaw dropping. This is most definitely a showcase of an engine that has use far beyond this game. If you are into how game engines and development work, you're going to enjoy this. Amazing engineering, especially considering it's from a small developer.",
            "review_score": "1"
        },
        {
            "review_text": "This has re-established my faith in the RPG genre. Thank you Larian for your constant efforts on this and making such a great game.",
            "review_score": "1"
        },
        {
            "review_text": "BIG Thank You to Larian Studios for not being an aholes and reselling us the enchanced edition as a DLC.Bouth the game its 10/10 whould buy again.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game in addition to the previous game.  I didn't finish the previous game, but having the whole game voice acted makes me wish I waited to play this version, and I hope the next DS has fully voice acted.  The degree of freedom is almost unparrallel to what you can do.  The real fun the of the game is the challanging fights. Since the game is turned based, combat is slow, but challanging.  Enemies often start first, and are sometimes invulerable unelss you have a magic spell to unturn them.  EE has a few more perks, a very clean and satsifying ending.  Don't underestimate perception, it can help show many things you missed as there are TONS of easter eggs in the game (something I regret since I was combat focused). I don't know how anyone could play this game on heroic mode unless they knew 1000% what they were doing. One thing that is annoying is the game should be almost renamed quicksave, as there are TONS of things (simple opening a door, digging up a whole) can lead to a massive explosion and a whole party wipe. So you quicksave and load often to reset fights/encounters/conversations often limiting the challange of the game.  Since dialogue paths are often linear, there is not a problem to just quickload.  Puzzles and quests can be overly complex, and since there is NO HAND HOLDING in the game, it is made for pretty smart players imo. Often you need the IGN walkthrough guide to help you out. Even near the end where the stuff is new, you have to solve the puzzle by moving the statues on the 3 stone tabs and flipping the switch to reveal a mirror to flip a switch to a door (a puzzle in a puzzle in puzzle) lol.  Yes you might rage out a few times on tactician for those die hard for a challange, but the ending, and winning is more satsifying.  I personally played this game for the immense challange of the combat it offers, and the bauldur's gate, pillars of eternity, D&amp;D feel. I still like Dragon Age Orgins more, but this is more of an indie route, and is reflected as such in the price.  Looking forward to a sequel. Game takes about 40-80 hours to complete, so well worth the price point if party strategy and extreme problem solving are your thing.  What are you waiting for? :)  9 orc axes out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's ive played. Did co-op full clear with my GF playing two of the four companions. Very nice game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic co-op RPG. It's pretty buggy at times, but there are way too many things to love to let that get in the way.",
            "review_score": "1"
        },
        {
            "review_text": "I was skeptical when I first bought this. I saw the high review scores and the rave reviews here on Steam, but I also was very aware of the criticisms of this game. I was afriad I was going to be one of the rare few who were bored to death, but I have was delightfully surprised when I came away extremely hooked on this game. It is truely an 'old school' RPG, and I enjoy being able to DnD w/o a DM.   I have been playing co-op with a friend on hard for our entire playthough.",
            "review_score": "1"
        },
        {
            "review_text": "Best RPG since Baldurs Gate 2 and Fallout 2.",
            "review_score": "1"
        },
        {
            "review_text": "A modern classic; best of its kind is now even better. It hasn't been done this well since the old school.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best rpgs I ever played, this game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 found some silky underware, still wearing",
            "review_score": "1"
        },
        {
            "review_text": "I really tried to get into this. It starts off real slow and there's hardly any way to know how it is within the 2 hour limit that steam allows for a refund. I kept playing for short intervals really trying to like it because I felt that it SHOULD be good. As a result, I got denied for a refund because I had played 5 hours.   The story started off OK enough but quickly veered off into the absurd and boring. There is no feel for a direction you should be going. There seems to be a lot of content in a small area but it is all so detatched and unrelated to what you should be doing. Considering the massive importance of your main quest, (simultaneously important and yet boring), if you want to role play at all, everything not essential should be ignored unless your characters are morons.   Really the only good things I can say about this game is the controls are decent, the graphics are nice enough and the combat while a bit shallow does have potential to be fun. Unfortunately, I barely had any fun combat in 5 hours because I keep stumbling into random encounters that are far beyond my characters level... again because this game has no direction and just leaves you wandering aimlessly.  ",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best rps i've played since swtor",
            "review_score": "1"
        },
        {
            "review_text": "played hardest difficulty, killed bosses, did quests, finished hard fights hardly, but survived, died digging grave.  10/10 would die again.",
            "review_score": "1"
        },
        {
            "review_text": "Not recommend, my wife left me because I play this game",
            "review_score": "1"
        },
        {
            "review_text": "Original game, very much so in the style of old rpg's. Has ultima esk flair in that you can ♥♥♥♥ around with 90% of objects.  When I first played, I had an emomancy build. In which, whenever you stood in blood you healed. So i stood there cutting myself for max healingggggggg.",
            "review_score": "1"
        },
        {
            "review_text": "Runs great on Linux!",
            "review_score": "1"
        },
        {
            "review_text": "Great massive game, amazing developers.  (I played the original one extensively.)",
            "review_score": "1"
        },
        {
            "review_text": "Great old school game. I wish there was an expansion before the second game comes.",
            "review_score": "1"
        },
        {
            "review_text": "Well worth whatever the cost. This game has brought me countless hours of hatred form myself because I cannot stop playing!",
            "review_score": "1"
        },
        {
            "review_text": "Simply TEH best co-op you'll ever find (seriously, I've looked...) Also funny.",
            "review_score": "1"
        },
        {
            "review_text": "I played the classic version of the game for around 10 hours and thought it wasn't very good, the camera was clunky, the dialogue was lacking, many aspects of the game needed polishing.. then this come out, i played for another 10 hours and it was much better, lost my companion who i was playing with due to work and things so i come away from the game. Recently Divinity original sin 2 was released and i purchased it but then realised i hadn't played this game that much! So i posted on steam and got playing with a new friend and i must say, it has become a game i will never forget, I'm playing in tactician mode and there are a fair few fights you must plan and prepare for, Larian Studios are a company i will back my money into any day, they have created a godly game and worthy of some god damn credit!",
            "review_score": "1"
        },
        {
            "review_text": "Greatest Game",
            "review_score": "1"
        },
        {
            "review_text": "Really fun!",
            "review_score": "1"
        },
        {
            "review_text": "writing this review for the nominee thing. dont judge",
            "review_score": "1"
        },
        {
            "review_text": "I never imagined myself liking a game like this (CRPG)! It's a gem!  Fun!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a great price.",
            "review_score": "1"
        },
        {
            "review_text": "Must have game. If you like turn based RPG I couldn't recommend this more.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games in the genre. Enhanced Edition fixing many of the tiny issues from the classic version. The new, more difficult game modes are a welcome addition and add some nice replay value.",
            "review_score": "1"
        },
        {
            "review_text": "its even better than the original edition just play it already",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great old style rpg for the modern day. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This games combat and class system is amazingly well thought out,   It's abilities are well balanced,   It's fights are difficult and require careful thought and planning.  But.  This games writing is among the worst in all of RPG history - Containing every tired trope you can remember from a lifetime of RPGs. Even it's original thoughts are executed in such a broad, heavyhanded manner that you are left feeling that this game could have been great if they had put as much thought into a story as they did into the rest of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game brings 'enchanced edition' to a whole new level.",
            "review_score": "1"
        },
        {
            "review_text": "Slaughtered an entire town minus all the merchants just because we were bored  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is Great, I've bought it late, after the Divinity 2 released, But I'm really pleased About it, And I'll buy the Second Part soon &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "The original game was already quite good, one of the best combat systems around. They've polished some quirks in the UI, rewrote a better story, added more skills, better itemization, and a new tier of difficulty. And all for free if you own the base game.",
            "review_score": "1"
        },
        {
            "review_text": "a surrender feature should be implemented for when you commit a crime. and an autosave should happen everytime you load a new area as remembering to save is tedious. other than that good game.",
            "review_score": "1"
        },
        {
            "review_text": "really great game with huge variety",
            "review_score": "1"
        },
        {
            "review_text": "Hey, that's pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer is really only Co-Op unless you mod your game files. Great game either way",
            "review_score": "1"
        },
        {
            "review_text": "Tried to talk to someone, accidentally stole a haunch of meat. Guards killed me.   10/10 would steal again.",
            "review_score": "1"
        },
        {
            "review_text": "6/5 stars!! love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Found and wore smelly panties. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I jumped into a poison cloud. My friend blows it up. 20/10 would play with friend again.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game for any RPG lover. Nearly every hour spend playing this game have been in co-op campaign with a friend, 70h+, and still we have a long journey ahead of us until we reach any kind of closeur or end game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I love the freedom and combat system.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game made even better in the enhanced edition - thumbs up to the devs, highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best RPG-COOP. 8/10 Would craft love granade again.",
            "review_score": "1"
        },
        {
            "review_text": "This enhanced edition is a straight improvement in so many ways over the original game. Voiced NPCs, improved mechanics, more information on those mechanics, bug fixes, everything.   If you miss classic style RPGs where you are only limited by your imagination, this game will fill that gap pretty damn well. It's unforgiving with its challenges, but all of them can be overcome in ways that feel fair and rewarding. Traps will kill you, you will make mistakes, but if you love being able to put your mind to developing new ways to defeat enemies and achieve goals, this game will be a fulfilling experience.",
            "review_score": "1"
        },
        {
            "review_text": "he is back!",
            "review_score": "1"
        },
        {
            "review_text": "Played 2 hours, killed by Dave, last save is an hour back, Alt+F4.  Story's quite interesting, combat is decent and challenging, but autosave is useless. Quick-save OFTEN unless you want to rush through hours of story to get back to where you were.  I'm sure I'll get back to playing it again, although that's what I said when the same ♥♥♥♥ happened to me in the classic version of the game...",
            "review_score": "1"
        },
        {
            "review_text": "In my early 20s I vowed to stay away from hardcore RPGs due to the amount of time I find myself losing when I play them. Enter Divinity Original Sin EE. My life is now officially over especially since part two is due out end of the year.   10/10 for getting your girlfriend to breakup with you when you don't have the balls to do it yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Writing seems naive, but the engine appears to be flexible and fun.",
            "review_score": "1"
        },
        {
            "review_text": "WHERE DID THE ♥♥♥♥IN STEAM WORKSHOP GO!? (still a pretty good game though)",
            "review_score": "1"
        },
        {
            "review_text": "136 hours into the game, finally done ... Would recommend if you have a friend.. even if you dont",
            "review_score": "1"
        },
        {
            "review_text": "Good game,  great combat system, split-screen co-op, 100h+ campaign",
            "review_score": "1"
        },
        {
            "review_text": "Good game,  great combat system, split-screen co-op, 100h+ campaign",
            "review_score": "1"
        },
        {
            "review_text": "That moment you teamkill your ally by accident, not really :D",
            "review_score": "1"
        },
        {
            "review_text": "If you play RPG's and you do not own this...THE RPG GODS WILL SLAP YOU IN THE FACE UNTILL YOU PURCHASE IT!",
            "review_score": "1"
        },
        {
            "review_text": "Only drawback is I dont know what to do with my life now that I've finished it.",
            "review_score": "1"
        },
        {
            "review_text": "First of all this is my opinion   while the first 20 hours or so where generaly pleasing the game became dull over time    1 boring game over all   2 exhausting preparations for everithing , separating items on every character makes it even worse especially while selling stuff  3 dialouge is terrible, they just talk and drag simple and unnecessary topics making you frequently skipping conversations   4 crafting is a mess . youll get various recipes but 90% of it you will have to go online to find out, the game doesent show you. i guess it expexts for you to just spend counless hours guessing ???  5 the verry worst is that the game expects you to guess many missions and quests not telling where certain things are yet again going online for answers, this happens alot so when you are out an about you and you see tuff you dont know if you are afecting some daam side quest so it ruins the experience even more",
            "review_score": "-1"
        },
        {
            "review_text": "Beneath the shiny surface of this co-op friendly, humorous game is a twisted mess of an engine, including, but not limited to, the following failings:  Area of effect tooltips so imprecise you'll be hitting your guys when the highlight or radius says you won't, and missing enemies when they indicate you'll hit  A turn order display that consistently bugs out. Incapacitated (stunned/knocked down) allies hover indefinitely as the next actor in line, making intelligent choices as to when they should be cured of their debuff confusing. Expect de-syncs in the turn order in co-op from time to time, and,  Imprecise click to move mechanics, exacerbated by 'fuzzy' terrain hazard borders (that darn engine again) make the task of simply walking around puddles of lava a tedious, point by point affair that'll have you reloading your save dozens of times, just because your characters didn't move how you wanted them to,  Compounding that are enemy models that wiggle around like they were in Street Fighter 2, so you'd better watch that elbow you're clicking - it'll be somewhere else in a quarter of a second, and you'll be clicking through your enemy at some sand!  ...  It's a shame, because everything else is so darn cool. The design of the game is fun, but the combat is torture to play on the higher difficulty settings because of how overwhelming the 'that's not what i wanted to do' factor is with this game's steaming wreck of a combat engine.  Do not buy if you're looking for a clean, rewarding tactical challenge. Do buy if you're looking for a fun fantasy co-op romp.  Voted No for how frustrated I was by the engine. (Enough to abandon my co-op campaign.)",
            "review_score": "-1"
        },
        {
            "review_text": "Sold all the paintings to the painter in the first market. 10/10 would rob him blind again.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would get poisoned to death again",
            "review_score": "1"
        },
        {
            "review_text": "In this review I will compare DOS EE and DOS classic.  I was happy that most of skills was modified and that applying some of skills was modified. Story was modified only in final and it was ambiguous change. Of Course, was add some dialog and quests.  Adding recipes in craft system did game more comfortable. In game was added grenade and wand, it were very helpful. Now you can't change the difficult of combat in any time game, it will constant when you choose difficulty in start game. Honour mode give you only one slot for save, it's mean that if you died your game is over. And, I don't shure, but hero move slower than in DOS Classic...  Conclusion, if you play DOS Classic you will not see something new, only small enjoyable and comfortable change, but if you didn't play to DOS Classic, I recommend you to play in DOS EE.",
            "review_score": "1"
        },
        {
            "review_text": "'Don't stand in ♥♥♥♥ on the ground'-Simulator  8/10",
            "review_score": "1"
        },
        {
            "review_text": "!",
            "review_score": "1"
        },
        {
            "review_text": "Ermagherd! This game is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I could write out all the pros and cons but so many other reviews have already done that so... I like this game. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "BEST rock, paper, sissors simulator of all time  69/69",
            "review_score": "1"
        },
        {
            "review_text": "Game was amazingly fun, still is. It's probably one of the only true RPG games still out there today, and it demolishes the competition at what it tries to do. Unfortunately as of the latest patch, my friends and I can no longer play comfortably. After multiple check integrity's, multiple redownloads, it still crashes about every 2 hours, complete crashes. More so, I'll have weapons and gear that won't link up on his end. For instance: I buy this awesome sword for him (knight), he gets it and it's a crossbow that requires dexterity. These things make no sense and after complete reinstalls and time frames, it can only be attributed to the most recent patch. Please fix this, it's an awesome game.",
            "review_score": "-1"
        },
        {
            "review_text": "Possessed Divinity Original Sin. Larian OFFERED me the Enhanced Edition for free. That alone shows how great that studio is...  The Original Original Sin had really fun gameplay... Fun combat, multiple ways to approach different situations... Really nice...",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to play this game but it seems my i7, 16G RAM, 16G dual Nvidia 880m cards just cant seem to handle this game ... but i run ark on ultra at 70 fps lol ... constant crashing every 3-4 min , tried every solution online ... unfortunately refunded :( But the game looks great and played great for what i could do ( all of about 12 min game time ) oh well on to the next game .....",
            "review_score": "1"
        },
        {
            "review_text": "I'm 7 hours in. I've already solved a murder, broken into a bathhouse, died due to digging up a grave rigged with explosives, died by digging up a grave and summoning a ghost named dave, and died because I lost rock paper siccors.  10/10 would graverob again.",
            "review_score": "1"
        },
        {
            "review_text": "I played for 5 hours and tried to leave the starting city in every direction and got my ♥♥♥ handed to me because I hadn't finished solving a murder mystery and helping a cat get laid.",
            "review_score": "-1"
        },
        {
            "review_text": "  This review refers to this game and the original classic version.  The game itself does look and sound incredible which sets a good first impression on me right from the main menu.  The biggest issue I have with this game is it's extremely unintuitive and overly complex looking. All those options to customise my character at the beginning, every time I played (and especially the first time), was very overwhelming.  This game also isn't streamlined or flexible. I dislike how I cannot complete battles with a fast and aggressive playstyle. I often feel forced to take things extremely slow and feel overly paranoid about whether the next decision will end my game in a defeat.  Speaking of defeats it's very annoying when dying often, combined with the unintuitive nature of this game, that I felt I couldn't have won if I tried again. It's difficult to understand which strategies or approaches work best.  All these things combined with an extremely long campaign which takes so many hours to reach the end and I've lost so much interest in playing or replaying.  I wanted to have fun with things like making interesting decisions on character abilities, shopping, and creating my own combat style but it often looks too overwhelming and restricting. It's not I dislike the depth of decisions I could make but I felt I was presented with too many at once. I would've much preferred better pacing where content was unlocked gradually and predictably as I played.  This game just isn't for me and it would've been nice to be able to play it my own ways.",
            "review_score": "-1"
        },
        {
            "review_text": "First 2 areas were excellent, the rest dragged on and on and felt rushed. By the end even though I enjoyed the story it was a chore to play through.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing Game! Epic Old School RPG fun!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game based on the positive reviews and many awards. I have played all the classic isometric turn-based RPGs, but this game does not compare to them. In fact, it is garbage and I want my money back. The story makes no sense. You start out as a Source Hunter, a specialist, investigating a death and quickly end up being some Chosen One, whom does not register with immortal beings. The game forces you to run around the city for the first few hours, something extremely boring. The UI is crap, I particularly dislike not being able to change the pitch of the camera. For such a recent game this is really poor. Character creation and advancement is equally boring and the inventory interface is - as has been written by others too - disastrous. The crafting system is nothing to write home about either. Where is the 'Pen and Paper-like freedom'? The one thing that is supposed to be outstanding with this game, the combat system is also sub-par. I really cannot understand the positive reviews. When I play a turn-based game, I want to be able to plan my turns in detail. Instead - again, as others have written as well - it is enough to pass by a puddle of poison/fire/whatever to become affected, the cursor jumps between actions (cast spell or walk to a point nearby) causing death through no fault of the player and other such inaccuracies (or for example terrain actually blocking necessary view). Also, as other have said, the amount of CC is ridiculous, enabling you to stunlock enemies and dispatch them easily. Boring and tedious. Where is the 'feeling as if playing D&amp;D with your friends'? I really wish I had read the negative reviews before buying this. 0/10 utter fail.",
            "review_score": "-1"
        },
        {
            "review_text": "After the fourth time my cursor swung around to do something completely different than click on the thing I wanted it to do, my entire party proceeded to run themselves through a patch of burning ground, thus suiciding themselves. The last party member, I forced to walk back through the fire patch, checked how long ago my last save was, then uninstalled the game.  One cannot even be absolutely certain what one is clicking on, because just holding completely still may cause your target to change to the ground tile besides what you were trying to hit, making you walk all the way over there to stand next to an enemy instead of hitting them with your bow and arrow.  And clicking on rats is an exercise in frustration in and of itself.  A lot of this frustration could be rectified by having a 'are you sure' dialog box, as is common with many turn-based combat games. This one does not.",
            "review_score": "-1"
        },
        {
            "review_text": "I started a co-op game. Loved the turn-based combat, blasted through the tutorial. Then, reach the first city. Hours of boring dialogue follow with no character development or reason combined with flat voice acting. Get re-interested because it's a murder mystery we're following! Suddenly, we get told by Dobby the House Elf that we're Jesus McGuffin BuddhaChrist, and that the storyline is *actually* much more trite and bland than the game's intro could have led us to believe!  Both of us were so annoyed we put the game down, and I promptly got a refund, knowing we'd never pick it up again.  Great combat system, though.",
            "review_score": "-1"
        },
        {
            "review_text": "i tried to play alone and it was too boring then i tried playing with a friend and it was still too boring",
            "review_score": "-1"
        },
        {
            "review_text": "Divinity: Original Sin is like being cornered by the really boring boss at work who proceeds to talk at you for the next four hours. Anything you say doesn't really seem to matter, because this is about them. You wish you could get back to work, you'd even welcome it, but they won't let you. This is just part of a really long and boring job. You can't simply avoid it, because they're your boss; a lot of people admire Divinity, who you can only assume are just as boring. You're stuck thinking to yourself 'If I wasn't obligated to work, I wouldn't.' This is when I quit Divinity.  The game starts promising enough, giving you lore, about five battles to fight, and dialogue options. Then, you reach a port city, and your role-playing game turns into hours upon hours of exposition, point-and-click mysteries, and fetch quests. It's been three hours since I've done anything beside listen to NPCs, and there's still a lot more of it before I get to any sort of gameplay.   This isn't pulitzer prize stuff, either. Orcs, dragons, and fiendish macguffins are all the characters seem to talk about, and they talk about them more than you ever see them. Is this a game or a live storyboard proposal? Why am I being told about the world instead of seeing it and experiencing it? This game has good ideas and a great battle system, but wastes a home run chance with a overly long and dramatic wind-up swing. Now, with that out of place baseball reference with potential irony, I'm off to play better games.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot believe how many fundamental issues this game has that are blocking its actual content.  -Clickbox for enemies is FAR too narrowly defined, meaning instead of attacking your character will walk around them like a moron. On hard mode, this often means you'll have to redo an entire fight as every action matters -Fire and poison. Where do I even start on this? Not only do both do an absolutely ABSURD amount of damage, but walking even one or two steps through a fire/poisonous area will both afflict them AND do additonal immediate damage for traversing the area. -Utterly baffling mechanics. Zombies become poisoned when I attack them? This corpse randomly blows up for 85% of my health when I walk over it? This trap instantly vaporizes my guy, with no way to disable it or get around it? This person is healed by magic? -Horrible skill system. Combat skills mixed with magic skills mixed with crafting skills, with at least half of them being useless. The same can be said for the 'talents'. -Utterly pointless 'sheath/unsheath' player states which exist for NO reason other than to punish the player. Accidentally have your weapons drawn and activate a dialogue option with an NPC, and then misclick the dialogue option? Hurray, they've now attacked you, and unless you can reload you can kiss any sidequests they are involved in goodbye. What awesome immersion.   The pacing is slow, the questlines are dull and obtuse, and are usually solved by accident rather than on purpose, as the game eschews any waypoint system. I can understand not putting waypoints for some kinds of quests, or leaving an option to turn them off, but forcing the player to wander needlessly? Stinks of lazy development.  Another game I wanted to like so badly, and when the combat works, it's great. But I don't want to play a game of 'click the right pixel' and be more stressed about misclicking during a fight than the actual battle itself.  Overall, this game feels like a beta in severe need of interface polishing and game balancing. I can tell that there's some great stuff buried underneath these issues, but the fact that the game is in this state means I find it nearly unplayable.   6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Frankly, a little disappointing.  It's priced like an AAA game, but doesn't reach that level, also with the enhanced edition.  Also, the today market is literally filled with good RPG (of any style and price) and this only reach a 7, maybe a 7,5 on 10.  So, it's not a bad game, only an overpriced one.  Also, keep in mind that the game is... a little strange: the combat system is very simplified, but the combats itselfs are very difficult (or very easy, if you choose the easy difficulty level).  And the world environment and the general setting are nice, but the plot of the game is also strange, and the game seems to fail to decide where to bring you.  At the end, it's overall a nice game, with some poor design choices, and for the same price you can get better RPG.",
            "review_score": "-1"
        },
        {
            "review_text": "I just couldn't get into this game. it wasn't as much fun as Torchlight or Dungeon Seige. Maybe I need to play more but after 2 hours I have no interest in returning.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are die hard into RPG's then go for it, but it's not for me.  The almost complete lack of quest markers meant that I would have to take substantial visits to wiki pages just to progress, which slowed the already slow game to an almost complete halt.",
            "review_score": "-1"
        },
        {
            "review_text": "I was super excited to see a classic isometric RPG (Baldur's Gate) with depth (alternate paths to quest completion), but it turns out this is a heaping pile of garbage not worth your time or money and let me explain why -   Poisoned undead will heal each turn. No big deal, right? Just don't use the core skill for one of the default characters that summons a poison creature and you're early enough in the game to have no other options. Also, too bad for you ending up with a sword with a poison chance-on-hit.  Oh, did I mention this was on the easiest difficulty? Did it never occur to anyone to limit hostile healing as a difficulty modifier?  ... this is my third save game to re-start because I've ended up making sub-optimal choices and a complete re-start was the best path... that's after reading guides online to not-ruin my characters at creation.  Save your money, go buy a deck of cards, and pick one card out. If it's the ace of spaces, congrats! You win! Imagine you just played through some heroic fantasy story. If it's any other card, go bang your head into a wall for your choice of 2 to 15 hours before shuffling the cards and trying again. There you go. That's the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is aweful. You watch guys move really really slowly for 90 percent of the game time. It's like watching a 3 hour movie in slow mo.",
            "review_score": "-1"
        },
        {
            "review_text": "Hours of tedium followed by a instant death.",
            "review_score": "-1"
        },
        {
            "review_text": "After 41 hours, I have had to restart the game three times, can't craft what I am supposed to be able to craft, broken quest lines, a wonky unreliable autosave system, zizzax attacking me for no reason, I cannot recommend this game. Devs; get you act together.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game, but the amount of combat and UI related bugs really pushes it over the deep end...  Do you like reloading several times and missing turns or missing shots with a 100% chance a clear line? This might be for you!",
            "review_score": "-1"
        },
        {
            "review_text": "hi everybody  i am only writing this review out of frustration of this game i love RPGs and love tactical and hardcore gaming i have completed dark souls in 2 hrs 15 mins yet i am sad to say that this game is freakishly difficult . difficulty spikes exponentially in initial area of this game when you are learning the ropes this game frustrates you a lot you have a party of four yet 6 to 7 enemies ambush you out of nowhere and hit with AOE attacks your whole party is defeated in no time. and worst of all your health wont regenrate in between combats even dark soul has estus flasks which replenishes at each bonfires. so you will find yourself backtracking to town after most of ambushes so i give up after initial part of the game and you should also avoid all the heartburn of playing it  hope i made myself clear  ",
            "review_score": "-1"
        },
        {
            "review_text": "Unbalanced and boring combat system but has a great story and the dialogue is the best I have seen in probably any game. But the combat system is just so awful it just stops me from playing it. ''Oh you don't have a water scroll? Well too bad, you're dead! Better reload that save for the 25th time so you can find a way to get past this part!''.",
            "review_score": "-1"
        },
        {
            "review_text": "Not 4 playered. Well played",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe it's just me, but I don't like the new voice actors. The aerothurge / hydrosophist vendor in Cyseal sounds terrible. Some of the nerfs seem unnecessary and the AI can be stupid at times. I'd say just play the unenhanced edition if anything.",
            "review_score": "-1"
        },
        {
            "review_text": "It is apprears barely playable on OS X El Capitan, all ojects on loading screen are drawn in black... slowness is painful..",
            "review_score": "-1"
        },
        {
            "review_text": "Poor writing ruins the experience.",
            "review_score": "-1"
        },
        {
            "review_text": "The male character model is way too blocky and puffy and looks like a neaderthal. I don't know what the deal is with devs making characters look big and blocky with larger puffy torsos and long burly arms and short, stocky, legs but I can't abide it. looks like they used shaved orangutans as an inspiration for pro[portions and the armor is to big an bulky looking too. Booo times 100,000,000. No, make that infinite boos.",
            "review_score": "-1"
        },
        {
            "review_text": "The first town is incoherently designed. The game offers no investment potential since there is no proper quest guide or marker. I love the graphics and the combat, but there is literally no hand-holding initially and that's really detrimental to the enjoyment.",
            "review_score": "-1"
        },
        {
            "review_text": "hate turn by turn games",
            "review_score": "-1"
        },
        {
            "review_text": "Just like the original version, this is a game that has the potential to be great but suffers from a slew of severe UI/gameplay errors that completely ruin my ability to take it seriously. Larian made so many wonderful improvements to the game for the enhanced edition, yet seemingly ignored consistent, severe complaints like sloppy controls and issues with units' idle animations playing during targeting, causing players to misclick and waste their turn. For a game that prides itself on 'tactical, turn-based combat' you'd think that ensuring the controls are tight and responsive and not prone to potentially game-ending errors would be rule number one.  Apparently not. If Larian Studios ever gets off their ♥♥♥ and fixes these complaints that have been around since the first week of the original version, this game will easily be in the A+ category of games and especially with the new 'explorer' difficulty, a game I'd heartily recommend to anyone, even people who aren't a big fan of turn-based RPGs.  tl;dr: Divinity: Original Sin Enhanced Edition is the most highly-polished turd I've ever seen. But it's still a turd.",
            "review_score": "-1"
        },
        {
            "review_text": "What a hot pile of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Lazy changes. This is not enhanced. This is boring. It is a great game dumbed down to fit on consoles. This is the Mobile phone version of D:OS. 0/10",
            "review_score": "-1"
        },
        {
            "review_text": "A truly amazing crpg.",
            "review_score": "1"
        },
        {
            "review_text": "Original Sin is a bold entry in the CRPG world, no doubt about it. Is there a big group of enemies standing in the rain? Why don't you cast a lightning spell and stun all of them. You think zombies have an advantage because they get healed in the poison gas? Light the gas on fire and watch them explode! It's amazing how versitile the engine is. But once you get to act 2 the polish wears off. In a single turn, enemies will be able to cast a gas cloud on your whole party and then ignite it before you can start your turn. Annoying. By the end of the game, there is no strategy to the combat. Instead, everything will be blowing up all the time and you'll be praying there's some way to contain it. There isn't. It's kind of fun how hectic it is, but the combat is very unforgiving and laughs to to groans after one or two deaths. The levels are big and sprawling, and a single playthrough can last 80 hours. The music is forgetable, the graphics and art style are nice if a little uninspired, and the story is really quite boring. Get it on sale, play through the first act, and only proceed if you absolutely love what you see.",
            "review_score": "1"
        },
        {
            "review_text": "What year is this?",
            "review_score": "1"
        },
        {
            "review_text": "This is a must play for all the fans of the tactical and classic  Baldur's Gate  style RPGs. Great story, great dialogs, interesting battles, funny, the whole package.  I fully recommend this game, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Has great PS4 controler Suport.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games. Pretty good plot, very well made rpg part of it, and the strategy part of it is great as well.   Bottom line: buy.  Rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "DOSEE has stopped working! Any fix for the game for not starting up? Ver. 2.0.99.113",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! Problem is... not enough of my friends own it so I'm looking for a co-op partner. Send me a message or friend request if you want to co-op.",
            "review_score": "1"
        },
        {
            "review_text": "If you've never played this game and you like RPG's even a tiny bit, stop reading right now and buy this game! It has:  -- Great graphics -- Very tactical turn-based combat -- A world that responds to you realistically -- Great story -- A wide variety of character builds and difficulty levels for replayability  And I could go on and on. What are you waiting for?",
            "review_score": "1"
        },
        {
            "review_text": "This verson of divinity original sin is more fun (grenades go boom!) but I warn you now, it doesnt not nor will it ever work on vista!",
            "review_score": "1"
        },
        {
            "review_text": "[Review for the Enhanced Edition]  My wife and I played co-op on the original for 100 or so hours. I played the original solo with dual lone-wolf/glass cannon combo by myself for another hundred or so hours. I did not realize there was an enhanced edition let alone added to my library for free by owning the original until a couple weeks ago. Kudos to the devs for making that happen.  The enhanced edition makes some fundamemtal changes to the story arc, streamlining things and making it all seem more fluent. Story-wise, it makes more sense and flows better. Many gameplay changes also take place in this enhanced edition, and there are some good and bad points to that.  There are fewer 'line-of-sight' issues with the integrity of the game system to incorporate real-world effects with environmental interaction. Not as 'Omg, not again,' moments as in the original. Environmental effects, which is part of what makes this game so great, are not as devestatingly annoying.  On the other hand, as others have said, the 'line of sight' issues such as uphill battles and 'firing from your knees' is a concern. You can work with it, but you have to really understand the combat 'pixel point' system to really get a good feeling from it. Frustrating to mis-click and your character 'moves' to a new location instead of casting that ice bolt, or whatever, but if you understand and respect the beauty of the pixel-point environment then it makes sense and is cool. 'I can land a fireball on that troll's nose because it's JUST poking out from behind that boulder,' becomes a thing of glory instead of a frustration.  Inventory system is still somewhat cumbersome - getting things back and forth between characters but otherwise the whole system is brilliant and efficient. Vendors are no longer starved for gold, and the skill books are there aplenty instead of hoping that in a single playthrough you miss something. The changes to the skill system (adept, master, etc.) while limiting you to choose but while basically giving you every option to define your abilities is a welcome change. I.e., 'I can have mass-heal, once per combat, or hail attack as often as I want if I have the action points for it,' makes for an innovative strategy choice.  The balancing is a new feature and one that I appreciate. No more 'Lone wolf/Glass Cannon,' combinations. You can have one or the other. Many people I see complaining about this, but I for one welcome it. The difficulty is still weak enough that even without that powerhouse combo you can still feel like a god, but there is enough challenge that you have to pay attention even on the harder difficulties. If anything, the overall challenge is weak if you know the game, its effects, and combat environment effects because you can take advantage of everything -- but in games like this combat is generally the weak point.  Story-wise? Amusing, amazing, and, while not original (is anything possibly original anymore?) is fitting. The additions and editing of the Enhanced Edition streamline things in a way that has made playing through it again feel like a whole new game. Even my wife, who generally only plays games once, is planning on playing this again just based on the laughter she heard from me whilst playing as a result of the full voice-overs.  To owners of the original game, play it again with this edition. To those that haven't played it at all, give it a shot. For the price, it's hard to beat the entertainment dollar and even if you're a newb to classic RPG's you will laugh a few times while dying or finding new ways to steal a painting off the wall. Excellent addition to the genre and the full voice-overs, very well acted, just make it that much better. They even got rid of the screeching annoying voice-overs that drove many of us to tears (Cyseal Market, for those that don't know....)",
            "review_score": "1"
        },
        {
            "review_text": "The best RPG is years...",
            "review_score": "1"
        },
        {
            "review_text": " Not in the mood for cheese?",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "is fun, better than original, excited for 2",
            "review_score": "1"
        },
        {
            "review_text": "What a fantastic RPG! So immersive, great story, decent NPCs ... This game went all the way to 11 for me. Many hours of fun playing with a friend. A few bugs here and there, but the good far outweighs the minor annoyances. Cannot wait for DOS 2!!",
            "review_score": "1"
        },
        {
            "review_text": "Very excited to see what perils and pitfalls await my adventuring duo, and what insightful tidbits i can find.   Will update l8r with review.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful game, very fun to play and no bugs found on my linux machine.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend to people who enjoy turn based rpg! I have been looking for a game like this for a long time.   Looking forward for the next games of Larian Studios. Keep up the good work!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game for anyone looking for a classic, old-school RPG. One of the best true turn-based RPGs with multiplayer support I've ever played.  10/10, looking forward to the next game!",
            "review_score": "1"
        },
        {
            "review_text": "This game as a lot of potential, but everything is overpowered. Im playing on normal and I cant find a single place where I can go with out being one shoted, AT THE BEGING OF THE ♥♥♥♥ING GAME! What kind of ensentive do I have to play an rpg when i can't even leave the first ♥♥♥♥ing town.  That being said, I finally figured out the right path and started digging my way threw the story, and i have to say it is worth the pain.  10/10 would get face ♥♥♥♥ed my trolls again.",
            "review_score": "1"
        },
        {
            "review_text": "Not your average RPG. You actually have to figure stuff out for quests, it's not just follow-the-waypoint. The turn based combat is awesome and challenging.  Highly Recommend the co-op.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, very challenging, tactically nuanced, great writing, great mechanics and characters. Interstign and funny quests. Buy this RPC.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would press F8 again",
            "review_score": "1"
        },
        {
            "review_text": "i really enjoy this game. love that turn based rpg's are still alive",
            "review_score": "1"
        },
        {
            "review_text": "DOS:EE is love DOS:EE is life",
            "review_score": "1"
        },
        {
            "review_text": "I'm about 70 hours into the game with my wife and this game is perfectly suited for coop play. 2 controller couch coop on a 60' tv is great. Being able to play over the internet with a video chat running while I'm travelling is great too.  Good story, great voice acting, great visuals, amazing soundtrack, good combat, and a surprisingly well good controller implementation.  If you enjoy RPGs, definitely worth getting. If you play coop with a good friend or significant other, this is an excellent pickup.",
            "review_score": "1"
        },
        {
            "review_text": "This is a god of a GAME! Steap learning curve, punishing combat. It's dungeons and dragons but the computer is the game master. It's amazing. Buy it. Play it. Recommend Coop",
            "review_score": "1"
        },
        {
            "review_text": "Honestly one of the best RPG's i've ever played, already logged 315+ hours into the original version, and backed the sequel on Kickstarter.",
            "review_score": "1"
        },
        {
            "review_text": "Preety good!",
            "review_score": "1"
        },
        {
            "review_text": "great turned based rpg",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I have ever played. The game is actually challenging, it harkens back to the old RPGs of yore. You will frequently lose fights and you have to figure out which way to go based on which enemies won't curb stomp you. There's no grinding -- better than that, there's nothing to grind. The environment can be manipulated in many ways to turn a fight in your favor; the direction and tactics of the fights you take give the fights a very dynamic quality.   The storyline is deep and engaging; it forks in different ways and it feels like your decisions have weight. It doesn't rely on stale fantasy RPG cliches. The environment is well-crafted with a lot of good set pieces and interesting stuff scattered around. The map isn't even that big but a ton of stuff is crammed into it, making use of every space. The only slightly annoying thing is that some of the voice actors are bad and some of the lines get really repetitive (merchants in Cyseal advertising cheese, fish, and greens).   10/10 GOTY",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic RPG with genuinely interesting tactics and strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Just started playing, still in the early hours, but I am loving. Great humor and amazing gameplay and graphics.  Loving. Well worth it, even for people that don't like this type of game, this one is so fresh and enjoyable.  Better than neverwinter ever was, leaves bioware to eat dust.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Baldur's Gate, but far more tactical. I approve!",
            "review_score": "1"
        },
        {
            "review_text": "A great RPG just got so much better 100% recommend this game to any true RPG fan",
            "review_score": "1"
        },
        {
            "review_text": "Absloute fantastic game! throwbacks to all kinds of older RPG's the combat is quick and satisfying always finding myself enjoying the heck out of it get lost for hours just doing things that other games make seem like meanial tasks, I did run into an issue that corrupted my most recent save however i was able to contact support and get it solved in a very short time span (1-2hours) wich is shocking with how most companies seem to deal with support these days. overall a great game and a great company reccomending everyone who likes rpg's to give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "Divinity: Original Sin and more. Lots of updated features along with the long list of bug fixes. You may need a roadmap to get through this game as it can get pretty hard even during Act 1, Act 2 really stepped up the difficulty for me but that made it all the better. I cannot wait until D:OS2 comes out as I've tried the Beta and its even better than its predecessor. If you have no tried this out yet and are a RPG/Group RPG fan it is worth getting, full price or on sale it is worth every penny. Tons of customization, crafting, exploration, varied class skills and talents. This team really knew what they wanted to accomplish and they did in great success.",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 would badge review again",
            "review_score": "1"
        },
        {
            "review_text": "Great story rich game with good mechanics... but you already know that.  What I learned was the best thing about this game is, that I got a friend to try it with me via local-coop.  This friend normally does not play slow game or games with story or roleplaying games. But now we are many hours into the game and enjoy doing quests, searching for new stuff..... and breaking the game (being able to break doors is op ;P )",
            "review_score": "1"
        },
        {
            "review_text": "I've spend a ton of hours with this game and the enhanced edition. Don't regret a second though",
            "review_score": "1"
        },
        {
            "review_text": "Interesting characters, vibrant locales, beautiful soundtrack and detailed beyond belief encounters with everything from forest witches to helpful rodents! A whimsical and layered RPG with great co-operative support that allows you and a friend to argue over certain plot decisions (in character.) It's also explosively fun, often literally.",
            "review_score": "1"
        },
        {
            "review_text": "There arent many turn based combat rpgs out there, they are dying out because technical advances allows for more intricate real time action combat. And even fewer of those turn based games that are left, thrive to make a combat system that is deep and complex like it is in divinity orginal sin. That and the old school rpg feeling and open and free world are what make this genre still breathing. I hope there comes a time where turn based tactical game developers stop using the old pokemon style system and draw in some inspiration from this one.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best Isometric RPG's made in the past decade.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best roleplaying games out there. Interesting storytelling. Great crafting possibility. Great multiplayer co-op. It's tons of fun playing! Now even better!",
            "review_score": "1"
        },
        {
            "review_text": "If i had internet connection all the times i played this game, 100 hours would ve been a minute",
            "review_score": "1"
        },
        {
            "review_text": "How many days has it been since I've slept??  Did I eat today?? or Yesterday??  What time is it?  ...  What month is it??    all questions you could easily be asking yourself once you start playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the best games I have played in a very long time. It's worth more than 40$. I cannot wait for the second one to release!  Great job Larian =D",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It has classic RPG elements in both combat and story. It's awesome to encounter characters that have such clear and interesting personalities. And many of them are a complete surprise (talking, riddle-asking mushrooms, anyone?) ! The co-op experience makes it all that much better, and it's always fun to play a virtual game of rock, paper scissors when you disagree on something.   10/10, can't wait for Divinity 2 to be fully released.",
            "review_score": "1"
        },
        {
            "review_text": "I love turned based strategy games. After putting almost 200 hours into XCom I was looking for a new game. In my searching I came across Divinity more than once. It had turn based combat but I wasn't sure about dealing with the inventory management, stats, storyline and all the other RPG elements. I finally saw it on sale one day and gave it a try. 80 hours later it turned out to be a GREAT game. The combat is challenging right up to the end of the game. Inventory management didn't take much time, I found I settled into a set of gear about 1/3 of the way through the game and didn't change much after that. The storyline was ok. I skipped a lot of the dialog so I could get to more combat. This is just my playstyle though. If you like those elements, you can spend more time with them.  TLDR: If you like turned based combat, this will be a great game for you. Lots of variety and not a lot of puzzles, story or items to get in the way (if you want).",
            "review_score": "1"
        },
        {
            "review_text": " Disclaimer:  I have not finished a playthrough of this game yet, so the following information may be subject to change in the future.  =-= =-= =-= =-= =-= =-= =-=  Since my first and only participation in a Dungeons &amp; Dragons campaign with a few friends eight years ago, I have been looking for a video game that attempts to mimic the style and freedom that D&amp;D offers. When I saw that this game had such freedom advertised, I knew that I had to give it a try. To put it simply, I was not disappointed.  As an RPG, this title puts the vast majority of similar games on the market to shame. If you're looking for an in-depth role-playing experience with challenging encounters, combat or otherwise, then Divinity: Original Sin is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fantastic revival of the old school CRPG. With a robust dialogue system, interconnecting side quests, and very free-form character customization, this game gives me the same joy of playing Baldur's Gate back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "Having great fun with all the typical adventuring activities.. stealing all the things. Oh, and throwing grenades.",
            "review_score": "1"
        },
        {
            "review_text": "Very good. Very hard. But very good. Innovative ideas in terms of party management. Tons of customization options, but intelligent planning is needed to avoid becoming too weak to continue. Overall highly recommend if you're looking for a modern take on the CRPG formula.",
            "review_score": "1"
        },
        {
            "review_text": "8/10, D:OS is an amazing game solo, but really shines in co-op. Played it through twice, here are some impressions  + Flexible character development + Fun and challenging combat + Long, and for the most part entertaining, main story + Engine is suprisingly versatile, just trying things out and discovering new interactions is fun  - Gets more unbalanced (too easy) towards the endgame - Inventory system is less than stellar - First 3-4 hours are really slow  All in all definately worth it, especiall if your playing together with someone",
            "review_score": "1"
        },
        {
            "review_text": "An astonishing improvement to the original game, the addition of grenades, and wands are of particular note. Play either by yourself, or with a friend, it works either way.     ",
            "review_score": "1"
        },
        {
            "review_text": "An addicting DnD-style game that draws players in and leaves them wanting for more!",
            "review_score": "1"
        },
        {
            "review_text": "Great RPG, designed from the ground up for co-op. Enhanced edition features are all excellent, and the pen-and-paper feel to the game is something sorely lacking in modern RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "I bonded with my fiancee a great deal playing this game, now we're married.",
            "review_score": "1"
        },
        {
            "review_text": "Built from the ground up for great co-op. More games should be made this way.",
            "review_score": "1"
        },
        {
            "review_text": "Hella fun and interesting. Feels much more polished and interesting than the original game, which was also fantastic. There's so much to do, the game progresses nicely and has a captivating story. If you zoom out and just take a look it's a really simple map with differently laid out areas, and not much else to it. But, you don't feel that way when you play, do the quests, read through the story, and fight the challenging monsters. Definitely worth a buy and a playthrough with a friend...or 4!",
            "review_score": "1"
        },
        {
            "review_text": "I helped a guy steal, got caught, blamed it on someone else, they got mad, then turned original guy in, he got caught. ♥♥♥♥ed 3 ppl over in one decision",
            "review_score": "1"
        },
        {
            "review_text": "I was afraid to try out this EE after playing (edit: trying to play) the director's cut of WL2 (see my review for that). I feared bugs, not-so-good controller support and such. Instead, Larian has done an amazing job in taking the masterpiece that Original Sin was and pushing it to the next level.  What I love so far: - it's FREE for everyone who owns D:OS. Nice! - playing with a controller feels as good as with k+m, if not better - UI has massively improved, everything is more coherent, really easy to manage with controller - performance has improved too: I had to keep settings to medium-highish before, and still game wasn't so fluid. Now I can run it on Ultra on the same machine and it runs super smooth... not bad! - every line is voice acted, and well acted I'd say! - dual wielding! yess!  What I don't like so far: - some minor translation errors in the Italian localisation (nothing gamebreaking, but reading that 'Dai a' instead of 'go to' or something like this is disturbing) - not able to zoom (or I didn't find how to) during character creation  In the end, I wouldn't see a reason not to upgrade to EE and have a fresh start (old saves aren't compatible) if you already own D:OS. If you don't, just get it now and see for yourself",
            "review_score": "1"
        },
        {
            "review_text": "Take two hardcore gamers who have never played this game. Set the game on hard mode. Prepare a 100+ hour laugh, fail, argue, fail, laugh cycle. Don't miss this game if you are looking for two player coop. Turn based combat gives you plenty of time to try to micro manage your friends while they're under pressure!   10/10 Would force my a friend to reroll characters 4 times in one night again.",
            "review_score": "1"
        },
        {
            "review_text": "Just awesome !",
            "review_score": "1"
        },
        {
            "review_text": "It's a fantastic game already, then they added a hard mode, crafting UI with recipies, and 360 degree rotation. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "im lost for words just wow...10/10 would buy divinity 2 :D",
            "review_score": "1"
        },
        {
            "review_text": "Same great game made even better. Worth it if you're looking for a fun rpg to play.",
            "review_score": "1"
        },
        {
            "review_text": "Love it so far! If you buy - get the enhanced edition! It's worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Great",
            "review_score": "1"
        },
        {
            "review_text": "Even if this game is hard, I'm still having a huge amount of fun on it. I've only just started, but I highly doubt my opinion will change.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, this is what a real modern RPG should feel like. All the tools, and options given to you for combat, and out of combat are truly wonderful. It doesn't hold your hand, and gives you multiple solutions to problems and quests you encounter. The size, variety, and amount of content really makes you feel that you got your money's worth, and I am most certainly looking forward to the sequel, and hoping it improves on the very few things I found underwhelming.",
            "review_score": "1"
        },
        {
            "review_text": "Hrm... Let's see. One of the best turn-based games I have ever played? One of the more awesome stories I have played? Some of the most awesome character development? Character customization? Crafting? Tactics? Check yes to all of these.  This is one of the best games I have ever played, and with the addition of the enchanced edition I once again will be going through two or three times trying to see all of the different results. I love this game, I can play it for an hour, I can play it all day.   Now, if you don't like dying/losing because your tactics aren't up to par don't play this game. I like to think that I am pretty good that these types of games and I still die quite a bit.",
            "review_score": "1"
        },
        {
            "review_text": "1 Hour into this game. Already cant get out. The world is dynamic, the graphic is beautiful. The dialoge is interesting. You can do so many stuff in this game. Really a great role-playing game. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "PROS: Amazing game play, great mechanics, tons of interesting bosses and side quests, good amount of customization with loot and skills.  CONS: Journal/Quest Log is kind of funky at times, dialogue can be a bit chatty",
            "review_score": "1"
        },
        {
            "review_text": "In this day of DLC-happy games, (unfinished in my eyes), it's refreshing to see a game so complete, the details so well thoughtout. This game is made and executed the way games like the Baldur's Gate series and the Elder Scrolls series are with an open world, a solid storyline and plenty of side quests to complete along the way. I'm playing the single-player game in Adventuring mode which is the easiest one. Some pluses I especially like:  1. My two main characters affect each other through the choices they make which add or subtract to their abilities and to those of the rest of their team. 2. Rift travel. These are portals that are activated when approached. Once activated you can step into any portal and travel to any other you've activated. (There are more features but it would borderline on a spoiler to talk about it.) 3. Teleportation: You acquire 2 teleporter pyramids through a quest. They are linked to each other. You drop one somewhere you would like to return to, go on about your business, click on the pyramid in your pack and your team is transported back to the one you dropped.  4. Lots and lots, and lots, and lots, and lots of armor, weapons and items to choose from. 5. A great crafting/recipe system that allows you to make useful things without the grinding! You discover the Recipes by placing items in the slots on your Experiment page or acquire a recipe book that teaches it to you when you read the book. (The crafting system includes cooking, blacksmithing, potion-making, tailoring and spell-making and others, all on one character).  6. Dynamic and well-thoughtout dialogue. (example: My main character had purchased very expensive armor for her fighter. After he put it on he commented how expensive it was and thanked her for it.) It's little details like that that let you know how much the developers loved what they were making. 7. You are not tied to the skill-set you chose for your character at character creation. (example: My Wayfarer has her archery skills but now also has the ability to use wands and staves, as well as decent rogue skills.) 8. Lots of companions to chose from to complete your 4-person team anyway you like, (single-player). Some you can 'rent', (one-time fee), others you meet along the way and invite them to join. You can tell a team member to take a hike so you can switch him out for someone else and then put him back on the team when you need him again. He is sent to a warm and fuzzy 'rest area' with the other 'Island of Misfit Toys' you've temporarily retired. You can adventure alone or with 2, 3 or 4 companions.  9. Using tools for crafting, mining, repairing, cooking and others weigh very little and, no matter how big, take up only one block each in your inventory. As well, all other items, armor and weapons take up only one block. A backpack is included in your inventory to give you even more space.  10. Inventor: It's easy to switch between characters.  11. For all new players there is a cave/dungeon you are given a choice to enter to before you reach the first town. It's a very clever and useful way to introduce you to the dynamics of the game and some of the trickier traps you will come across later on. Obvious things like water-beats-fire but it shows you a possible way to do it you may not have thought of, (Like one area where I was instructed to drag a candle over to a pool of oil under some skels to set the oil and the skels on fire). In other words...use your environment, look around you, there are different ways to accomplish the same task.  Minus: 1. I can't play this game 24-7...I've tried. But my husband and my two dogs keep bugging me to be fed and paid attention to. Isn't that what tv dinners and canned dog food are made for?...geesh!",
            "review_score": "1"
        },
        {
            "review_text": "If you like awesome turn based combat, Roleplaying heavy games (which I do), then this is the game for you. Best of all, it runs on pretty much every platform currently in existence that has reasonable computing power :)",
            "review_score": "1"
        },
        {
            "review_text": "I totally understand the need for complex RPGs to take time and teach the players the finer points of dialogue and such before actually opening the game, but 98% of my time in this game has been talking and the other 2% went to the 9very short combat tutorial at the very beginning. While it seems like the game can be fun and rewarding, I just don't have the time or patience to walk around a town trying to solve a murder for 9 hours (because Im STILL not done) before I do any combat.  Edit: After restarting my game and looking up a few guides, the beginning became substantially more bearable. If you can stomach through the starter city (which actually can be pretty fun if you know where to look), youll be rewarded with the deepest and most interesting rpg I've played in years. Solid 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A great RPG... And it takes me back to the (my) golden age of PC gaming where devs would include tools with the game at no extra cost becaus they want you to have fun! To top that the enhanced edition came free of charge on release... That is how you generate lifelong fans...   Original edition I didn't play for too long despite my admiration, the text dialouge and sometimes ambiguous quests were too much for we to devote to what with having a job. Now with dialouge and a refined quest system I feel like I can drop in and out and not lose momentum. And this isnt one of those sterilising jobs that bethesda and bioware have done to their games... This is still deep, and complex but in just the right doses.   If you're wondering which to buy, you don't miss anything by going straight to enhanced. Word of advice, give the game some time, as you will get the most ou tof it by getting stuck in.. as the devs have done.   THANK YOU!",
            "review_score": "1"
        },
        {
            "review_text": "Just like in real life, here I like cats better than people.",
            "review_score": "1"
        },
        {
            "review_text": "When I tried the classic edition, I liked the game but had a hard time getting into it because voice acting is very important to me. Now the developers added voice acting for free, and this game is simply amazing. I can't wait to get through this game and look forward to the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic RPG, even greater if you have a friend to coop with. Many ways to play, many speccs to choose from. Pretty big world with tons of sidequests, or you can ignore it and rush for the end if that's more your thing.  Gave me 62 hours of playtime for my first playtrough with a friend, doing all of the sidequests. You get your moneys worth.  Fantastic game, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "1.- Went to the graveyard in Cyseal 2.- Saw an old lady crying in a place, the old lady said that they were their relatives. 3.- Took the shovel, dug the place, took the bones from the tomb. 4.- Old lady attacked me, I kill her. 5.- Analysis : 'I dont know what i expected'.  Truly, I dont know what I expected. Great game, what a great combat mechanics. I would like the progression from monster wouldnt be so linear, if I grind, There should be a difference in levels. Anyway ... what a great game.  11/10 would dug all the graveyard again, search the loot and try not to kill the old lady.",
            "review_score": "1"
        },
        {
            "review_text": "A strong attempt at ruining my life. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's I have ever played. The combat system is great and progression is fun and natural. The many ways you can approach things such as quests and combat is refreshing and the environmental effects are fun to play with and the community is great.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs I have played in years.",
            "review_score": "1"
        },
        {
            "review_text": "This is the GREAT great great game. It's a gem and if only little you care about RPGs, you have to play it, there's no other option. Almost everything in the game is superbly done. I'm not a genius but I managed to finish it without help on moderate difficulty, which is not too hard, but neither easy. It's one of the BEST games in history, certainly and definitely one of the best RPG. I backed it on Kickstarter (as many other games), and it absolutely repaid back with grandiosity. I backed Divinity Original Sin 2, cause it can't go wrong... and I can't wait to play that sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing RPG with so much detail; really fun adventure w/ a friend",
            "review_score": "1"
        },
        {
            "review_text": "Best game i have ever played in my life, buy it now :)",
            "review_score": "1"
        },
        {
            "review_text": "Loved it, althought the story is a bit shorter than expected and size of the open world as well (hence, I played Baldur's Gate, neverwinter, skyrim and witcher ...before)....   in general I like it, especially the freedom in Hero development",
            "review_score": "1"
        },
        {
            "review_text": "As of this review I have 51 hours in the game and haven't finished it, yet. I have started a few different games, with my friend, by myself, etc. The game is quite fun. It has the old Balder's gate and Icewind Dale fighting style. The real difference I would say is this game actually has some comedy and doesn't take itself too seriously. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I had never played any of the other Divinity games...so this title has been quite a 'trial by fire'.   And, what i can say..wow. What a breath of fresh air this game is. Complex without being overly so, excellent story (humour included), great sound and graphics, great replay value, truly open world with great crafting, loot, character customisation etc. The game can be quite difficult but the puzzles, traps and challenges are well thought-out. It does feel truly like a game made by gamers, for gamers. Larian deserve full praise for a wonderful (and mostly bug-free!) release and I will keep a close eye on their future titles.",
            "review_score": "1"
        },
        {
            "review_text": "Like D&amp;D but with talking cats and cheese.",
            "review_score": "1"
        },
        {
            "review_text": "I can't get enough of this game. I've been playing co-op with my girlfriend and an RPG has not engrossed me like this one has in many many years. I couldn't recommend this enough.",
            "review_score": "1"
        },
        {
            "review_text": "The best coop rpg game ever created imo with amazing polish, fluid mechanics, incredible player freedom, and runs beautifully. This game is worth everyones time and more, one of my favorite games of all time!",
            "review_score": "1"
        },
        {
            "review_text": "What do I have to say about this game....it is very nicely made for sure. Has some of the old school basics blended in with the new tech creating an original masterpiece. Got this as a gift from a good friend and have played through twice so far, getting ready to try on #3 shortly when I got the 2nd Divinity (was going to play that, but decided to write this first). If you like RPG's this game is certainly for you. The team did very well on seeing to detains. Graphics and gameplay are great. This this to be one of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game. However, as a completionist, this game was TOUGH! I beat it on tactician mode and had to micromanage every aspect to do well. But that's what I loved about this game. Every little detail was my choice. I find it very similar to Pillars of Eternity and I mean that in a very good way. Just look at my time played, it's definitely worth it. But be warned, it will eat your life!",
            "review_score": "1"
        },
        {
            "review_text": "One of the few games i have pulled an 'All Nighter' on in the past few years. Super addicting RPG gameplay, and immersive story line.The soundtrack is also amazing. Play with a friend if you can, makes it 100x better.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely Impressed with this game.  Its hard, really hard, even with pre-reading before starting my adventure i find some fights quite challenging on normal, but then it makes it more of an achievement when you beat the encounter.  If you like turn based strategy games with a random loot system you will most likely enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "(Note: I have 40 hours on the base game.)  If you like turn-based cRPGs, stop reading and buy this. Love Larian and the amount of effort they put into games post-release.  Enhanced edition features: wands, skills, dual-wielding, full voice-acting, tactician mode, honour mode, 64-bit and DX11 support (required as well) Improved from base edition: quests, dialogues, visuals, performance, art, UI, loading times,   Lots of small, meaningful improvements. You can get the changelog with over 1300 changes if you Google.",
            "review_score": "1"
        },
        {
            "review_text": "For now, it's like The Sims in a fantasy and well written world. 10/10 Oh and it's perfect for people like me loves roleplay with characters. I'll update this review as soon as i beat the game.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME GAME! I played it with my girlfriend in co-op at first. Then I found out there is a slit screen option!! So then we both played it on the TV from my PC (we both have xbox controllers). The voice acting in this game is really amazing, EVERYTHING has voice acting... These developers where really devoted to this game. I cant wait for number 2!! It was really nice playing this with my girlfriend as she played 2 mages and I played with 2 worriers. :P  I would play it alone, but the game really shines when you have a partner to play with. :P There is a reason the 2 characters in the game poster is holding hands :P  10/10!!",
            "review_score": "1"
        },
        {
            "review_text": "Halfway through my playthrough (completed the original edition and came back with the same friend for the enhanced version). We're playing on tactician to get a real challange and we have died a lot, but still making good progress - just killed braccus. We're playing much the same classes as before but taking advantage of the tweaks that have been made such as dual wielding and genades. At first I wasn't a fan; the voice acting I loved was gone, and no longer was my beloved rogue a killing machine. Yet as we played more, that perfection I felt before shone through. Rogues are still powerful it just requires more commitment into particular abilities and the grenades have shown their worth in many moment - still can't bring myself to take the grenade talent though :p.  Overall, we again are having a blast with the game. It has the borderlands feel with the loot mechanics, tactical turn based combat, fantastic music, consistent voice acting, even more content and soem story tweaks as compared with the first game and hasn't lost any of its charm. Easily a 9/10.  P.s. If you're playing this after finishing the original edition. I recommend going on tactician, it changes even more of the game to make it feel like an even newer experience. It adds new enemies, different status effects and makes the game a lot more 'think before you act', rather than being able to plough through any fight relatively easily.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. there's a lot of strategy and depth in the combat and its well designed and well executed. It's an old style game, with a new polish. however if you're not into strategical combat (which I'm not particularly fond of) it may be a bit jarring as first. none the less, the game is great and is defiitely a good experience for anyone with the patience to learn it's ins and outs.",
            "review_score": "1"
        },
        {
            "review_text": "Love the fully voiced characters. Locations are great looking. The turn based combat is what stands out to me. The interaction between elements, use of the map to inspire tactics, and the ability to use 4 very unique characters simultaneously keeps it all fresh. Worth paying full price for this but if you can get it on sale....even better.",
            "review_score": "1"
        },
        {
            "review_text": "Dirty panties, Zombies walking through fields of oil fueled flames, dropping your companions around like rag dolls, and all the paintings you can steal. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like RPGs, especially 'tactical' RPGs, just buy it. It's probably the best RPG I've played this decade. It's a semi-open-world, with lots of side quests but still more linear than, e.g., Bethesda RPGs. Great story, interesting characters, a nice combination of 'serious' and humorous story elements.  Normally, I'm not a fan of turned-based strategy, but the magic/terrain system in this game is so well done. Environmental effects mean many spells/abilities affect one another. My only real complaint is that there isn't more to do (and there's already 60-80 hrs...).",
            "review_score": "1"
        },
        {
            "review_text": "Make no mistake; no one has as many friends as the man ith many cheeses.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "This game is complex. It's almost overwhelmingly detailed in its role playing elements - crafting, character customization, branching dialogue, world design, and non-existant hand-holding. If you are veteran or classic-RPG and looking for a phenominally well done RPG, this is THE RPG to play.   I give my highest regards to DOS.",
            "review_score": "1"
        },
        {
            "review_text": "Positive review out of courtesy to developer.  Bought this relatively cheap, but still refunded it. Felt it was too much like other games I had, even if it has stunning graphics, and the negative reviews scared me. Afraid it might become repetitive quickly.  Did not play very much.",
            "review_score": "1"
        },
        {
            "review_text": "best money I spent on a game in a while, lots of options to take... hard as ♥♥♥♥ some times.... Archer/ fire/ice wiz OP end game can clear packs of mobs without engaging",
            "review_score": "1"
        },
        {
            "review_text": "  RPG with the most stats, skills and a world that constantly makes you to think of everything on your character page. You can find RPGs that have better graphics, are easier to get, or not so time consuming, but very few are as dedicated to the true spirit of role-playing as this one is. There’s nothing else quite like Divinity: Original Sin Enhanced Edition.   Pros:  Split-screen co-op Fully voiced NPCs Unmatched RPG depth Gamepad controls mapping   Cons:  Too much inventory management   pejoluck's rating:  9.2 / 10",
            "review_score": "1"
        },
        {
            "review_text": "I don't remember when this game came out but I had it same day back then.. Don't worry about why it only says so much time on steam. Point is the game WAS amazing back then and dear god had it finally hit a niche the world was waiting for, for so long.   It has only gotten better, the rerelease was amazing, the game has improved on what was almost perfection in the first place AND the studio left both versions up for die hard fans. Still to this day this is the single best steam purchase I ever had and the best game possible to play with your gf/wife or any one who can't dedicate time to learning fast pace mechanics and what not... My gf loves to craft on this game... I mean, nerds out, pulls up charts, writes down combos and shops around for ingredients type of loves it. I love the larger strategy aspects so I usually end up letting her pick her role and then playing the other 3 characters around whatever she happens to be. When we enter fights I tell her what my overall plan of attack will be and we fall into it with very little more coaching.   It is great fun and as long as you remember to F5 on the host pc before fights a little misstep here and there is no biggie lol. The one thing I will say about it in negative light is this, on harder modes and upper difficulty settings the game is very difficult to play multiplayer. Not because it is 'harder with two people' per say, more because it requires a lot more syncronized effort to win and that ultimatley means one person will end up just playing 'for' the other person indirectly.  If you have someone who can sync their strategy to yours and control half the team in perfect harmony, thats ♥♥♥♥ing amazing... but realize it is not the norm.. so most people will need to play on classic if you want to team up. (really with any one but specifically with non hardcores)",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful game for co-op play! Both players can choose their own paths in most discussions with NPCs and have the option to develop their characters' personality as the game advances.  Lovely, large world with enough to do and many choices along the way! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is mostly great and if you enjoy a good RPG with interesting turn based combat, then you should give this game a try. For me, the combat was the highlight of the game as the classes and related abilities make each battle unique. Furthermore, the synergies between spells, abilities, and environmental elements make combat highly unpredictable, constantly keeping you on your toes. That being said, this game has some flaws that I need to mention so that potential buyers aren't caught unaware. If you can look past these flaws, then you'll enjoy this game.  First and foremost are the bugs. I find myself constantly annoyed by something that doesn't work right. Whether it's a crafting recipe, a combination of spells interacting erratically or not at all, or some random effect that happens inexplicably (i.e. dealing poison damage by shooting a silver arrow). The turn order indicator at the top of the screen will sometimes get stuck and you'll have no idea whose turn it is.   Knowing the type of surface you're standing on is extremely important, however, many times I found that the surface texture wasn't showing correctly so I end up standing in an electrified puddle, or poison, or fire, when there's nothing showing under my character. What makes this even more problematic is that your characters will happily run right into these hazards instead of pathing around them. There are further annoyances, however these are a few examples of what to expect. I've also had some crashes on rare occasions but it's mostly the in game bugs that are the most problematic. The key is to save often. Thankfully the game lets you save at almost any time, even during combat.  The reason that the above issues are more than minor nuisances is that the game can be very hard. There's nothing wrong with a difficult game, but when you have to constantly contend with the problems mentioned above, it takes away from the fun and makes the experience more aggravating.   Finally, the difficulty curve is all over the place. One moment you'll be ripping through a group of enemies with ease, and the next you get destroyed before you've had your first turn. It just feels completely random. This appears to be done purposefully as there are some events\\encounters that just outright kill you, and you have to reload, so prepare to quicksave\\quickload often. ",
            "review_score": "1"
        },
        {
            "review_text": "There is a ton to like about this game but there are also some huge negatives:  + Fun story + Good voice acting + Quality animation/visuals throughout + Tons of character development + Battles actually involve strategy  - Difficult, even on easiest setting. Hard to finish as a casual gamer. Check the steam achievements... only 4% of players finished the game - Needs a fast forward button in battle, NPCs and enemies take forever to act at times - Inventory management is a nightmare - Quests are often non-sensical and involve using the terrible inventory system",
            "review_score": "1"
        },
        {
            "review_text": "I'm a bit conflicted about the game. Overall, I enjoyed the combat system and the difficulty. It's refreshing to play a game that doesn't nerf everything to avoid player frustration. This game definitely makes you 'get good' otherwise you get dead. Save early and save often. Pros: Combat is fun in Divinity. The elemental magic system was cool and I like that if you mix elements (like electricity and water or poison and fire) there's a reaction. The abilities and character creation are simple, but they work well within the game. The graphics, specifically the effects and the glossy nature of the images, are on point. The soundtrack fits the game well. Cons: The story didn't pull me in at all. I did like the idea of time and how it the characters worked within that, but otherwise it just didn't interest me. Group members will actively run into lava or traps, even when there is a simple route around, that set them on fire or blow them up with pie-eyed glee (killing an entire party). UI is super clunky and involves a lot of tedious dragging and clicking (with the exception of the recipe crafting). Several character attributes (like blacksmithing) are mostly pointless. Technically they have a purpose, but they are really just a waste. By the time you get good enough to craft a decent blade, bow, etc. you can find something much, much better. Actually, due to the linear nature of the game you WILL find weapons much better than anything you can make. The only reason crafting is useful is to make arrows or potions. Potions alone will save a ton of money. Dinners are helpful in a pinch too. Beyond that, I found the skill to be pointless. Same went for lockpicking (just set the safes and doors on fire). Trying to talk to animals was fun, but chasing rats was a pain.  All in all it's a fun game, with some novel mechanics, but I have no real desire to finish it. So, if you are itching for a group-style RPG ala Baldur's Gate (sans epic story), then this is a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "Man, this game... I checked it out because I wanted to play some turn-based RPG game and when I found this one, oh boy. The attention to detail in this game is beyond great, everything since the character creation to the enemies and combat mechanics is in complete armony to deliver an awesome experience.  Needless to say that for sure it's an awesome co-op game, however I only played it in single-player.",
            "review_score": "1"
        },
        {
            "review_text": "Good game I hope to increase the Chinese version   please!!! ",
            "review_score": "1"
        },
        {
            "review_text": "You can play this game over and over... that is if you finish it first. It has such a good story, there are so many side quests too and its super long. They really improved in the enhanced version as well. I am so excited for the second Original Sin game :-)",
            "review_score": "1"
        },
        {
            "review_text": "This game was really awesome. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Great writing, fun gameplay, beautiful music. If you like RPGs, get this game because it's one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay. The storyline could have been better, but a 9/10 regardless.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game ever on steam, seriously.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a title that will keep you craving just one more dungeon, just one more quest.  It almost feels like one of the older D&amp;D games; a rich, beautifully designed world with a great deal of detail, full of secrets, colorful characters and interesting places to discover. The same can be said about its turn-based combat system where, in order to succeed, you'll have to rely mainly on your wit and creativity.  If you're looking for something fresh and innovative, but also with a pinch of old school - this game is a must-have.",
            "review_score": "1"
        },
        {
            "review_text": "Did not get into this the first time round, but on the second attempt to play this i dropped crafting altogether. This small change improved the game 100% and allowed me to concentrate on the story, which is excellent. Ended up getting my moneys worth and more from this title. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A friend convinced me to get this for the co-op play, The combination of turn based combat with an open top-down world was a surprise and fairly enjoyable. The rather extensive class customization allows you to really mix things up and the game has a sense of humor to boot.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's I have played so far, and that's saying something. The combat system, the story, the gameplay, the characters, the humor and the voice-acting are all amazing. It's one of those rare games that have a truly great co-op system as well - no player 2 being player 1's follower, et cetera.  Very highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This must be one of the best if not THE best Co-op RPG i ever played. Being a fan of D&amp;D, i really love the combat system. The turn based combat system lets you plan out your moves carefully. The character design and customization really lets you get in to the role you like to fill in the party. This is just a 'Must play' if you like to co-op with a buddy.",
            "review_score": "1"
        },
        {
            "review_text": "Only gonna point out my highlights  Love how there are so many hidden areas, riddles, and other secrets sprinkled throughout the world. It's good to have  gameplay that is non-combat yet engaging. Kinda like adventure elements overlaying the turn-based RPG foundation. There are a few annoying riddles or puzzles but they are a minority.   The other highlight is being able to complete quests in 'unorthodox' ways by creative use of spells or going out of your way for exploration or stealthing through filler combat to have easier ways to get xp, such as non-combat quests in town. Or you may go down an unknown tunnel only to find out you're in the back entrance to an area that you're supposed to visit many quests later, and your party is strong enough to basically skip the other content until now. Or you can even backtrack through your skipped areas after the end-area, with advantage of initiative and xp and drops.",
            "review_score": "1"
        },
        {
            "review_text": "One of Best RPG I ever play",
            "review_score": "1"
        },
        {
            "review_text": "Played Divinity: Original Sin - Completed it and absolutely loved it. Played 5hrs into enhanced edition and im still loving it, but im also loving how they made it harder and finished a lot of the quests. Would recommend this game at a solid 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Really injoyed playing this game it is a lot of fun and would recomend getting it!",
            "review_score": "1"
        },
        {
            "review_text": "Really in depth game, cool mechanics and fun skills and attributes to choose from. Barey sratched the surface so far but am loving the co-op shenanigans!",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game to play with a friend. Haven't seen a game like this incorporate Co-Op so well before. Comparing this to Pillars of Eternity I'd say this is lighter on the overwhelming lore/story, has better combat (If you like turn based that is), and mixes in a decent amount of humor. PoE was a bit too dark for my tastes and the sometimes goofy humor in this can be especially fun with a friend. It's still very good as a single player experience too",
            "review_score": "1"
        },
        {
            "review_text": "Look at your wallet and say I'm buying this. You're wallet will smile and understand. *High-five* You just bought an amazing game G.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I had no ideia this game even existed. Originally, I was going for Tyranny, ended up being really expensive so I decided to either buy this or Pillars Of Eternity. A lot of reviews online said that between PoE and DOS:EE, PoE would be the better game. Having decided to purchase this game, I concluded that those who were saying this game wasn't good mustn't have played the same thing as I was playing. DOS:EE is fantastic! At the end of my first day playing this I was already hooked to the story and couldn't stop for 5 minutes, don't get me wrong I'm not trashing PoE or Tyranny, but the amount of immersion and quality on DOS is ridiculous. Overall, I would recommend this game to any of my friends who like RPG or anyone else in general (9/10 due to some tough boss fights hahaha ;D).",
            "review_score": "1"
        },
        {
            "review_text": "Really loved the turn-based aspect of the game. Having the one character talk to an NPC while using the others to move explosive barrels all around them and then blowing them up is very satisfying!",
            "review_score": "1"
        },
        {
            "review_text": "If you like submersive, indepth and life destroying RPGs then you will love this title. Severeal types of charactyer which you can buiold and cross over as much as you like. The story is good and although the main story is pretty linear the sub plots, quests and companion stories all add dimension to this game.   The game is playe din real time accept for combat which is turn based, with action points in which you use to fight, cast spells, move, drink points etc. and this part is very tactical and will have you saving and reloading on numerous occasions.  For me this is the best RPG since Neverwinter Nights and plays similar but the story is totally different and grips you, driving you to find out more about what is going on in the world around you. Even when completed it draws you back with the chances to take different character classes and choices and has comedic moments to raise smiels and eyebrows alike.  This is a thinking person's RPG, so if you like to plan or do crazy things and see the concequences then this is an RPG for you. In my top ten all time games and I am still playing it! :)  ",
            "review_score": "1"
        },
        {
            "review_text": "This game was the best me and my girlfriend have played this last year - both storywise and humor wise. Definately a game to try !",
            "review_score": "1"
        },
        {
            "review_text": "Best Turned-Based RPG",
            "review_score": "1"
        },
        {
            "review_text": "Always have fun coming back to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Almost 40 hours of my sleepy time spent on this game. Verdict: WORTH IT!! :)",
            "review_score": "1"
        },
        {
            "review_text": "A good story. Excellent combat mechanics. Interesting and well fleshed out companions. You can't go wrong this game, there is a reason why it has brought home so many awards.",
            "review_score": "1"
        },
        {
            "review_text": "  One of the better remasters this year. Tons of new and reworked content and a huge amount of replayability. The fact that if you owned the base game you got this one for free was also a nice touch.",
            "review_score": "1"
        },
        {
            "review_text": "It's like if Monty Python played DnD. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love this game. It is extremely fun to play co-op with a friend. Combat mechanics are learned quickly and is as strategic as you make it. The use of elemental damage is key. The storyline is okay, but there are a bunch of side quests as well. Can't wait for D:OS2.",
            "review_score": "1"
        },
        {
            "review_text": "If you like D&amp;D but all of your friends are shitbag DMs, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I threw a talking shell in the ocean and he gave me a gold ring. Good thing I didn't pick him up and sell him to a drunk guy guarding a bridge.  10/10 would throw things in the ocean again.",
            "review_score": "1"
        },
        {
            "review_text": "Basically a great game for a specific audience, but one that I have a hard time enjoying myself. So thumbs up en general, well worth it's money, but not my kind of thing.  My major 'problems' with this game? 1] I have a party where only one member has a healing skill ... for just 10%. This results in after a (tough) fight; healing spell, wait for (relative long) cooldown =&gt; repeat 10 times or (much) more. I have spend way more time waiting on the damn cooldown after combat than in combat itself. Maybe with a different characte/party setup things would be better, but I fear I'd end up with a party that is great at healing but sucks at other things. In essence I do not trust the balancing of this game.  2] The elemental subsystems. Nice idea, but it breaks down too easily and too often and is used way too much. For example you WILL end up in situations where you have no way to counter/negate a certain element ... so you're 'stuck', or muddle through hoping for enough luck with the randomised damage. For example the party AI is such that party members walk through harmful substances when there is an easy way around it. So to me, instead of an interesting tactical component in combat, it ends up as an irritating subsystem.",
            "review_score": "1"
        }
    ]
}