{
    "app_id": 373480,
    "name": "1993 Space Machine",
    "release_date": "2016-03-28",
    "developer": [
        "Modesty"
    ],
    "publisher": [
        "Modesty"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Shoot 'Em Up",
        "Action",
        "Indie"
    ],
    "achievements": 11,
    "positive_ratings": 97,
    "negative_ratings": 60,
    "price": 9.29,
    "description": "Space shooters never die. 1993 is a testament to that. 1993 is a classic shoot em up celebrating games like Gradius, R-Type and Life Force.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/373480/header.jpg?t=1490694080",
    "minimum_requirements": "OS: Windows Vista Processor: Pentium Dual core 2GHz Memory: 1 GB RAM Graphics: DirectX 9 capable graphics card. DirectX: Version 9.0 Storage: 200 MB available space Sound Card: Sound Blaster Live Additional Notes: Gamepad and a comfy couch is recommended!",
    "recommended_requirements": "OS: Windows Vista Processor: Pentium Dual core 2GHz Memory: 1 GB RAM Graphics: DirectX 9 capable graphics card. DirectX: Version 9.0 Storage: 200 MB available space Sound Card: Sound Blaster Live Additional Notes: Gamepad and a comfy couch is recommended!",
    "reviews": [
        {
            "review_text": "+Stellar music bringing me back at least 23 years. +Simple but challenging gameplay with multiple upgradeable ships and weapons. +Co-op with up to 5 friend. +Potatoboss.  - Depending of your generation you might find this price a bit steep  7+ / 10   'Space shooters never die, but you will, many many times...'",
            "review_score": "1"
        },
        {
            "review_text": "Keyboard can't be remapped. I get this game is old, but try to think about what this does to people with keyboard layouts that don't have Z close to X.  Not really motivating me to keep going.  I'd rather play Xenon 2 Megablast. Better background music too. And that's from 1989.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved Gradius and R-Type and this game, if you enjoyed those you will enjoy this. Has 4 player co-op, a neat upgrade system. The game can be tough and sometimes very frustrating due to how often you will die. For example, I died over 40 times on one level which was kind of annoying. I would not buy it for the asking price, I would wait for it to go on sale, otherwise it's a good game to play to pass some time.",
            "review_score": "1"
        },
        {
            "review_text": "Action scroller with spacecraft shooting infinite amount of stuff. If you enjoyed similar games 20 or more years ago, this is exactly the same so it might be for you. But otherwise it doesnt provide anything new or especially interesting.",
            "review_score": "1"
        },
        {
            "review_text": "1993 Space Machine, as the name implies, is a retro vertical-scrolling shmup. The kind where you control a spaceship and shoot a ton of weird looking creatures and machines hell-bent on destroying your fragile vehicle. I can't say I have played very many shmups in my time, a genre that has always been more popular in the arcades and on consoles. If there are any clever references to genre classics then I can't say I have gotten any.  At its core it's a fairly standard shmup. Instead of weapon power-ups, you collect cash from destroyed enemies and upgrade your ship between levels. There's actually a number of basic ship models to choose from but as far as I can tell they all behave identically. You get two special weapon slots to fill aside from your standard blaster and there's a large variety of weapon types to choose which resemble typical shmup power-ups: vertical shot, diagonal shot, continuous laser, etc.. Additionally there are three advanced ships which have four special weapon slots and they can equip an even greater variety of weapon types. However, these ships are considerably slower than the standard ships and I did not find that to be a worthwhile trade.   A big problem with the upgrade system is that you don't really know what you get when you buy something. Most of the weapon descriptions are vague and you only see the spray pattern and effectiveness once you start a new level. I think it would have been good to see a short animation of the pattern or at least some numbers. Nothing like going into a level and figuring out the weapon you just bought is useless. Even though you can sell your gear again (at a loss), you don't get that much money that you can really experiment.  Otherwise there is not much to say about 1993 Space Machine. The level design is solid, the story is not much more than an excuse plot and the music is rather unremarkable. The controls are a bit too sensitive when using a 360 controller. It's also very short at about two hours (13 levels)but I suppose this type of game is more about skillful play than sightseeing - there is a hard mode. Overall I would recommend 1993 Space Machine but only to people who already like shmups. I don't believe it would convert anyone who doesn't.",
            "review_score": "1"
        },
        {
            "review_text": "Worth the price? No. Perhaps for 0.99USD it would be worth purchasing.  Too many reviews saying the game is difficult, but I found it to be entertaining. Many other games are much more challenging. Rogue Legacy for example.  Completed in two hours with 48 deaths.  The use of a gamepad is highly recommended(even though I prefer keyboard for most games) as the sensitivity of the joystick movements are reflected well in the game, something the keyboard simply cannot currently accomplish. Master the joystick instead of mashing it around, and you will be able to crush this game and many more.  Lastly, the story is quite poor. The weapon upgrade system and ship upgrade system is a play and learn system, not spoon fed about what is best or what is worst. Knowing the best weapons and the worst makes most games far too easy. This is just a short fun retro space sidescrolling shooter with a very weak draw to want to re-play.",
            "review_score": "1"
        },
        {
            "review_text": "Difficult but fair and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "If you like old school space shooters then you will enjoy 1993 Space Machine. Quick but fun.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Steredenn. Has an upgrade system for guns, but no feedback on which ones are useful. Fiendishly hard, not because of good design, but because of oversensitive controls. Very unforgiving, but not in a good way.",
            "review_score": "-1"
        },
        {
            "review_text": "Game from 1993 not not polished for today's tech well true that, there is almont no options menu, it doesn't even allow you to remap every button on you controller only some are recognized so you can't really make controls work most convenient for you and this alone can ruin this game :/ Looks oldschool, feel oldschool because it is old :) could be designed little better like to few and far between checkpoints, mouse support could be cool also, ships are not that different as you can initial think",
            "review_score": "-1"
        },
        {
            "review_text": "There are lots of trashy quasi-oldschool type games on Steam, but just few of them deserve a mention.  1993 Space Machine is made from steel and going straight from the heart. It's old school, R-Type like shoot'em up with very strong Amiga era reminiscence. This game is difficult, unforgiving and has beautiful, classic graphics taken straight from Agony, Blood Money, or Atomic Boy games. If you remember Psygnosis, i'm sure you know what i mean.  If you still love those museal games - don't think - just buy it! If you hesitate, or don't give a crap about this hipster eyesore, just forget about it and move along:-)",
            "review_score": "1"
        }
    ]
}