{
    "app_id": 373880,
    "name": "Fleeting Ages",
    "release_date": "2016-05-02",
    "developer": [
        "R&G Software"
    ],
    "publisher": [
        "R&G Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Survival"
    ],
    "achievements": 20,
    "positive_ratings": 9,
    "negative_ratings": 18,
    "price": 1.59,
    "description": "Fleeting Ages is an open world game with strong survival elements and with a constantly changing world and ages. The game features a huge open island and seven time periods that change as the player progresses.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/373880/header.jpg?t=1478078155",
    "minimum_requirements": "OS: Windows 7/8/8.1 Processor: Intel Core i3 or better and equivalent AMD processor Memory: 4 GB RAM Graphics: Nvidia GTX 460 or better, AMD HD 5800 series or better DirectX: Version 11 Storage: 1500 MB available space Sound Card: Directx compatible sound card.",
    "recommended_requirements": "OS: Windows 7/8/8.1 Processor: Intel Core i5 or better and equivalent AMD processor Memory: 6 GB RAM Graphics: Nvidia GTX 660 or better, AMD HD 7800 series or better DirectX: Version 11 Storage: 1500 MB available space Sound Card: Directx compatible sound card.",
    "reviews": [
        {
            "review_text": "Sorry, but I can't recommend this 'game'. Looks like its made by kids and its just horrible. Everything looks like it was made in 2001 and it is so hard to stay alive for more than a few minutes before you get eaten by some animal. You feel like you are running a marathon just to get some logs because it is so far between the trees. Trying to hit some animal with your basic tool is a waste of time, so you need to stick to getting apples to survive.  Developers: Sorry if you get negative reviews, but game is not ready to release to public in a very long time.  Evilworm, May 25th 2016",
            "review_score": "-1"
        }
    ]
}