{
    "app_id": 374010,
    "name": "Sherlock Holmes Consulting Detective: The Case of the Mummy's Curse",
    "release_date": "2015-06-08",
    "developer": [
        "Zojoi"
    ],
    "publisher": [
        "Zojoi"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "FMV",
        "Detective"
    ],
    "achievements": 0,
    "positive_ratings": 31,
    "negative_ratings": 13,
    "price": 1.99,
    "description": "The London Times started it all – calling the murders the work of an ancient Egyptian curse. I accused the tabloid of capitalizing on the superstitions of the populace. Yet, three men were dead, with the wrappings of a 4000-year old mummy binding their fates together.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/374010/header.jpg?t=1531144305",
    "minimum_requirements": "OS: Windows 7 and up Processor: 2.33ghz or better Memory: 512 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you are a fan of Retro games, sure this is one to add to your library, don't expect something like Night Trap or Double Switch though. I originally owned this game on Sega CD. This game is short. Given that it was originally bundled with 2 other cases when it first came out. This game is alot better than I expected it to be given that I played the original version, either concerning video or the interface itself I came in expecting my experience on Sega CD and was suprised that it was better. Hopefully they might release Volume II or III. I did not hate the game and found it interesting. It's probably not for everybody and there are really better Sherlock games out there. I bought it for Nostalgia purposes. If you want to step into FMV history this is a good example of it. Would I reccomend buying it? Yes. But depending on what you want to buy it for. I bought it for nostalgia purposes. The game is decent, has it aged? Maybe a little....",
            "review_score": "1"
        },
        {
            "review_text": "Short game, not much to do. Just need to go to several places to gain knowledge about the case and after visiting enough places you can solve the case by going to the judge. Simple and neat.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fine but the length of the game is a bit short. I have completed the game in 1 hour.",
            "review_score": "-1"
        }
    ]
}