{
    "app_id": 374240,
    "name": "Eternal Step",
    "release_date": "2015-10-16",
    "developer": [
        "Once More With Gusto"
    ],
    "publisher": [
        "Green Man Gaming Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 30,
    "negative_ratings": 12,
    "price": 6.99,
    "description": "Eternal Step is a deviously difficult, rogue-like action adventure game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/374240/header.jpg?t=1499097124",
    "minimum_requirements": "OS: Windows 7 Processor: Core i3 / AMD A6 1.9Ghz Memory: 4 GB RAM Graphics: Intel HD 4400 graphics or similar Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Core i5 / AMD FX 2.4Ghz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 480 / AMD Radeon HD 7850. Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": " An incredibly fun and challenging rogue-like that you can play for hours. Currently having some issues but the devs are working on it.",
            "review_score": "1"
        },
        {
            "review_text": "Disclosure: I was given a copy to review.  Eternal Step takes the brutal nature of roguelike games, and holds it upside down shaking it for its lunch money. The base combat and card system are easy to learn, but one mistake can lead to a chunk of health disappearing before your eyes, or just straight up death.   Eternal Step isn't cheap at all! Almost every enemy attack will mark a path before it happens, even when the enemy is offscreen giving you plenty of time to move out of the way. Bosses on the other hand are terrifying, requiring faster reaction and almost pinpoint accuracy to hit them and move before getting diced into hero cubes.  All-in-all, if you want to put your ego to the test, climb the 100 floors in Eternal Step!          YouTube™ Video:  Eternal Step Quickie - Roguelike, Ragequit, Both Start With R&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A really fun little arcade game, new content is still being added (perhaps the eternal nature) you'll love it and keep coming back for more. I know I keep coming back to it, thats why I curated it  store.steampowered.com/curator/6860437/  (seems that doesn't automatically count as a positive review so posting this)",
            "review_score": "1"
        },
        {
            "review_text": "Eternal Step I believe is in reference to the amount of time it will take you to cut through all that invisible sand you are hitting when you swing your sword. Or maybe it's all the weights that must be weighing down your boots and causing your character to slog in slo-mo through the dungeon. That would also account for the reason your rolls are athletically on par with a truffle shuffle. If there is an in-game explanation for the name of this title I will not be finding it because the combat in this game is like trying to catch wind in a sail to steer a dump truck.  I would say this game is probably best described as free flash game quality usually reserved for kongregate and newgrounds and kept off of steam.  I bought on sale for $2.49 US and at that price point I am disappointed. Needless to say I would advise avoiding this at full price....possibly it's a push if you were to get this game for free along with a cookie for your trouble.",
            "review_score": "-1"
        }
    ]
}