{
    "app_id": 374380,
    "name": "Revolution Under Siege Gold",
    "release_date": "2015-07-02",
    "developer": [
        "Sep Reds",
        "Ageod"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Wargame"
    ],
    "achievements": 0,
    "positive_ratings": 58,
    "negative_ratings": 22,
    "price": 18.99,
    "description": "Make the Reds side triumph to save the Soviet Proletarian revolution, or, on the other side, lead the Whites side to victory in order to place the old regime back in power and protect the countries of Europe from the perils of the revolution. This is the biggest civil war game you will ever play!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/374380/header.jpg?t=1517305666",
    "minimum_requirements": "OS: Windows XP/Vista/ Windows 7 / Windows 8 / Windows 10 Processor: Pentium IV 1800+ MHz Memory: 2 GB RAM Graphics: 512 Mb V-RAM or better DirectX: Version 9.0c Storage: 3 GB available space Sound Card: 9.0c compatible sound card -",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am old time fan of AGEOD and their games are not too easy to learn, but when you do, then you are rewarded for it greatly.  This game ( I will call it RUS Gold) is a standard type of AGEOD games that is using the a simultaneous turn-based engine (WEGO system). This means that both sides are giving orders and they are executed together when you hit next turn. You get a lot of playtime in this one as it has Grand Russian Civil War scenario (1918) the Russian-Polish war (1920) and a what if scenario set in an alternative post-WW1 world in 1921 called Drang Nach Osten where the victorious Central Powers are attacking Soviet Russia. Along with these, you also get some smaller scenarios that are great for beginners or a fast game when you are short on time. Such are a 1917 early Revolution scenario and Finnish civil war one. The later is really recommended for beginners as it is pretty easy to play as the Whites and it is not too complex. But playing tutorial scenarios and reading the manual is a MUST for absolute newbies to any AGEOD game! Grand scenarios are really HUGE and you are in total control there. You create new armies, you lead them to glory or defeat and you have tactical and strategic choices. Here you can win a lot of smaller battles and still lose the war if you are not careful. Every action has its re-action and not two games will play the same. Your nights will be short and mornings will come too early :)  All and all I simply love this game as a lot of attention to details and revisions and changes/fixes of the old version was put into it. There are not many (if all) games with this topic and if you want something different, are not afraid to sink a lot of hours learning things and love history ... then you will also like this game like I do.  A personal note: Great work Mr. Chopin and the crew!",
            "review_score": "1"
        },
        {
            "review_text": "Maybe it's a bit hard to learn but at the same time it's very deep and historical. Just pass the tutorial, read the Manual and you will like it. Even though it's a turn-based game that could be an obstacle for paradox fans don't be afraid to check this out. You won't be disappointed. I've been playing this game for years and i still enjoy it. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty surprised at how much I've enjoyed this game, after getting it and a bunch of other AGEOD games in a bundle. This is apparently one of their more complex games but I was able to get the game working and, while I still wouldn't say I've mastered the interface, I've probably picked it up faster than I picked up the EU4 or CK2 interfaces (which I think are the closest comparisons). The diplomacy, decisions, etc systems are cool and add a lot of flavor to the game that sets it apart from some other games like this. Army recruitment/organization was confusing at first but I'm starting to get a better grasp on how to set up my armies, and you have a ton of options for how to set up your troops.   The scenarios are interesting, with the Finnish scenario being a very good introduction scenario. Based off of the time I've put into this, just one playthrough of the main campaign will take 50-100 hours, so if you like this you can certainly get your money's worth. The music is great, though I eventually turned it off because the music is so bombastic I would get distracted by it at times!  The game isn't perfect. I get crashes when trying to open Steam Overlay, or really anything other than alt-tabbing out of the game if I want to do anything else. The load times are definitely long, though each of my turns takes me 15 minutes to an hour so the loading times are always shorter than my turn times. Overall I don't mind it that much (I can usually find something to do for a minute after being focused on the game for my turn) but I could see it turning some people off. But this game takes a while in general, so I don't see someone who really enjoys the gameplay/time period deciding they won't play the game because of the turn loading times.  I'm amazed that I got this as cheaply as I did! I'm looking forward to putting even more time into this and getting into the other AGEOD games that I now have!",
            "review_score": "1"
        },
        {
            "review_text": "Poorly optimised as usual. Youre fighting the interface as much as you are the in game opposition. Standard fare, same standard grognard mess.  Okay on a rare humble deal. Barely.  And please would you correct the Georgian flag, Laughing Boy? Thanks so much!",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks it barely loads to the main menu WTF 0/5",
            "review_score": "-1"
        }
    ]
}