{
    "app_id": 375180,
    "name": "Lunch Truck Tycoon",
    "release_date": "2015-05-28",
    "developer": [
        "Diggidy.net, LLC"
    ],
    "publisher": [
        "Diggidy.net, LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Simulation",
        "Management"
    ],
    "achievements": 0,
    "positive_ratings": 165,
    "negative_ratings": 91,
    "price": 0.79,
    "description": "Welcome to Lunch Island! Where the sun always shines, everything comes in perfect individual servings and the only meal served is, LUNCH! Head to the beach and finish the Ice Cream Sandwich event or head to the City and supply Comic Con with pretzels and coffee? Compete in Competitions! Who has the best Hot Dog on Lunch Island?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375180/header.jpg?t=1478090796",
    "minimum_requirements": "OS: Windows 8 Processor: 2GHz Memory: 1 GB RAM Graphics: 512MB DirectX: Version 9.0 Storage: 50 MB available space Additional Notes: May work on previous versions of windows but it has only been tested on Windows 8",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I don't recommend this game.  The premise of this game is simple, a tycoon game. But as with many other tycoon games, most of them fails to deliver what is the 'tycoon' itself, or what is resource management itself.  Here is why the game still need to improve :     No competition . There is no competition at all, it looks like you are the only one selling lunch in the island.     No long term business model . In tycoon games, the primary income of us should be the profit of selling goods or services. Or from re-selling other person's product or services. In this game, your primary income is awards from events, such as 'Best Lemonade' or something like that.     Wrong micromanagement . In this game, we must adjust how much sugar, water, and lemonade in each glass of lemonade. While this seems fun, it is not. It is not fun because it is not related to the economic model. If you add some sugar, there is no increase of your 'cost of goods sold', while it should be. If you reduce the amount of lemonade, your cost of goods sold should decrease, but it is not. Furthermore, this wrong micro-management only applies when you are going to enter to an event. People on the street still don't care whether you use excessive sugar or you use not enough water.    No satisfaction model . Yes, if you increase the price people will refuses to purchase the product, but it is not clear enough. The above micro-management (managing the ingredients of the lunch item) is fun only if it is tied to the satisfaction of the customer. For example, if you use only few lemonades, the customer should refuses to buy your product. Or the customer would still buy if price is low enough. But that kind of thing does not happen in this game.    Not enough data on nearly everything . You get a data on your profit each day. How profit is calculated? Unclear. Do you pay wages or something? Tax? No information at all. How much lemon is sold that day? How much candy is sold that day? Unclear. How to level-up and gain access to more expensive items? No information. How 'high' is the traffic if I purchase a better food truck? Unclear.    It have  boring music and boring animation . I don't mind this, actually. But considering the above points failure, this game is not recommended.   What is right on this game :    It is  cheap .    It have  interesting concepts , food truck is something fun to think about.    It is  easy, casual game . Note that some people (including me) will not be happy if the game is too easy.   This game is not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Thought that I couldn't go wrong at such a cheap price.. How wrong was I? I love tycoon type games but this is badly put together, progression is very very slow and I'm bored already.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty simple, level grind too long, but kinda fun.",
            "review_score": "1"
        },
        {
            "review_text": "'click here to purchase in-game money and disable ads'",
            "review_score": "-1"
        },
        {
            "review_text": "Even though it's just a buck, don't waste your time and money.   The good:    The bad:  The game has no option to change resolution or at least make it go into windowed mode (games like this should always have options like that). Bonus objectives are very poorly thought out. And sometimes are impossible to complete. It looks as though it was made by a child who wanted to make a mobile game but changed his/her mind halway through.",
            "review_score": "-1"
        },
        {
            "review_text": "i got this game as a joke  i will literally never ever play this again",
            "review_score": "1"
        },
        {
            "review_text": "Extremely unpolished game. The only thing going for it is the low price.",
            "review_score": "-1"
        },
        {
            "review_text": "This game wasnt all too bad. At first I was hesitant to buy it. But I decided to give it a go anyway. The game isnt too bad. Its kind of slow but its still a game I wouldnt mind playing if I had some time to kill.  I give it a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "it is a cute little game and is exactly what you pay for it. if you buy this expecting some amazing experience then you will be very much mistaken, id recommend buying this if you need to kill like an hour and have a spare 1$",
            "review_score": "-1"
        },
        {
            "review_text": "Gets very boring after a while, otherwise it's a cute game. If you don't care about spending 99 cents, then go for it. :)",
            "review_score": "1"
        },
        {
            "review_text": "Gets very boring after a while, otherwise it's a cute game. If you don't care about spending 99 cents, then go for it. :)",
            "review_score": "1"
        },
        {
            "review_text": "It plays the same song over and over, luckily it's the greatest song of all time. Seriously, I like it.   It's a surprisingly fun mngt. sim, much better than the average mobile port, and no you can't have my award-winning lemonade recipe.",
            "review_score": "1"
        },
        {
            "review_text": "Lunch Truck Tycoon -- Recommended with some reservations. Casual Fun --- yes, the game is engaging on the premise of the lunchtime catering truck that is struggling to establish itself and grow. The graphics are...average for this sort of game, not bad, but not impressive enough to elicit a nod of approval at first glance. The figures of the customers are a bit below standard actually, looking more like the inhabitants of the streets of the 'PAPERBOY' Franchise, i.e.... blocky and non-descript. Most of the gameplay is easy to learn, I was able to grasp the basics in less than 3 minutes. The Text Instructions that popup at the very beginning of a game make a very direct connection to each area of info on the screen. No long explanations, but most functions become apparent very quickly. Overall, an enjoyable title. Kudos to the designer for a fairly clean, uncluttered game that does what its made to do. ....now here comes my ..HOWEVER  However (see I told you it was coming), Lunch Truck Tycoon loses some of its allure from being perhaps 'too' clingy to the idea of providing a somewhat 'reaslistic' simulation of the Lunch Truck Catering business. After 6 hours of playtime, my Lunch Truck Persona is still struggling to get to the first lunch truck upgrade. I have been able to afford three equpment upgrades, bhut the costs of those pieces of equipment keep placing me further and further away from upgrading my truck ( and I am only putting into consideration that I am attempting to purchase the FIRST of 6 truck upgrades --- the ultimate Lunch Truck being the 'Lunchinator' at a staggering $195K). Now... Considering that I am selling chips, slices of pizza...cans of soft drinks, and candy canes, I am sure that you start to see the problem. After six hours of playtime, I only have $8623.00 saved... If Lunch Truck Tycoon suffers from a major flaw, it is certainly that it attempts to be much too economically accurate.  When I considered submitting this review, I went back to the Store page and noticed something .... interesting. On the sample pages of In-Game visuals is a 'sample' of the Inventory Page within the game. This Invenotry Page is where the player can order more items to re-stock their Lunch Truck, and set prices for the items to be sold. However on closer inspection at the upper right hand corner of that sample page, I noticed..... the Designer has obviously been 'doctoring' his/her own game, since the screen shows that He/or She has amassed more than $249,000 before reaching Level 12.  Now, I played for 6 hours... reached level 23, and have less than $10K. So, here is a little 'Shame on You' to the game designer for being a bit deceptive about the actual gameplay. But, the game is entertaining, but so frustrating in not being able to advance, that its playability is extremely limited right now. It seems very 'fixable' however, and I certainly hope that the Designer reads this and works to come up with an active solution to this dilemna.  One other negative to the game is that I am playing on a PC .. using a mouse/keyboard option, and on the MENU Inventory Screen I am unable to scroll, page down, arrow down, jump down turn around, pick a bale of cotton...... until, I got advice from a 12 year old relative that plays Android games a lot, they advised me to treat the screen as if it was a tablet or cellphone needing a 'flick'.   So by flicking upwards with my mouse I am able to finally see the lower section of higher priced menu items to purchase/resupply. This made a lot of difference in my gameplay, so I am now editing my review to a positve.. and hoping the Designer can add some other features to spiceup the sluggish gameplay experience. RATING: 6 out of 10 katanas !!!",
            "review_score": "1"
        },
        {
            "review_text": "Was fun for the first hour.",
            "review_score": "-1"
        },
        {
            "review_text": "I was searching for a game under 1 euro and this was the best I could find.  10/10 wouldn't serve clowns again",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting game of the Tycoon genre. You start from scratch with this modest truck and just a few recipes to work with. Throughout the game you can get to unlock more possibilities and even compete against others to see who's the best cook around. There're some different areas around the city that you may get to visit in order to diversify your income (you can even play with the prices to see how people will react to them). That title doesn't have really a story, the graphics are simple and the same goes for the sound effects / music but that's not really a problem when they're compared with the entertainment value. The only thing that I find a shame about it, is that there's no ending for the game and, at least for now, there're not achievements nor trading cards available. Either way, it'd be really cool if there'd be some in the future. Overall, it's a casual tycoon experience and the price is really affordable, if you pick it up for playing, I hope that you may enjoy it as much as I did.",
            "review_score": "1"
        },
        {
            "review_text": "It worths that 0,89eur I paid for it. You absolutely get what you pay for. The gameplay is easy and pretty understandable. There are many foods, trucks, upgrades, locations and contests in what you have to make your own recipes, many levels for leveling up,there are many things to unlock,like more storage etc.... The game is a little bit repetitive so eventually it can get boring,but I think,that tycoon game players may know this thing. So I can say,that I liked this game and that I totally recommend it to gamers,who wants to play a simple yet funny tycoon game!",
            "review_score": "1"
        }
    ]
}