{
    "app_id": 375220,
    "name": "Bitweb",
    "release_date": "2015-06-03",
    "developer": [
        "practicing01"
    ],
    "publisher": [
        "practicing01"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Free to Play"
    ],
    "tags": [
        "Free to Play",
        "Casual",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 46,
    "negative_ratings": 90,
    "price": 0.0,
    "description": "Addictive, simple gameplay about xoring your way through a maze. You can xor the inner and outer gates surrouding your character with the ones from a cell of your choosing. Hounds will follow you, being bitten will cost points. Use arrows and the invincibility potion to defend yourself.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375220/header.jpg?t=1447375552",
    "minimum_requirements": "OS: XP+ Processor: SSE Memory: 1 GB RAM Graphics: OpenGL 2.0 EXT_framebuffer_object EXT_packed_depth_stencil Shader Model 3.0 Storage: 30 MB available space Additional Notes: Required install: Visual C++ Redistributable Packages for Visual Studio 2013 @ <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"noopener\"  >https://www.microsoft.com/en-us/download/details.aspx?id=40784",
    "recommended_requirements": "OS: XP+ Processor: SSE Memory: 1 GB RAM Graphics: OpenGL 2.0 EXT_framebuffer_object EXT_packed_depth_stencil Shader Model 3.0 Storage: 30 MB available space Additional Notes: Required install: Visual C++ Redistributable Packages for Visual Studio 2013 @ <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.microsoft.com/en-us/download/details.aspx?id=40784\" target=\"_blank\" rel=\"noopener\"  >https://www.microsoft.com/en-us/download/details.aspx?id=40784",
    "reviews": [
        {
            "review_text": "Best. Game. Ever.  We play with friends and we wager money for whom gets the most point in a discussed time.",
            "review_score": "1"
        },
        {
            "review_text": "Hi. You may not know me, but I am skyarex. Recently, I had the pleasure of playing this masterpiece. Okay?  I am really disappointed that the steam community at large doesn't even seem to get how amazing this game is, and understand that under its obviously broken exterior, lies pure gaming genius.  I get it though. I really do. At first, even I was like 'what the hell is this', but soon, the pieces started coming together. I understood now why it is that the seemly poorly rendered enemies did nothing after finally catching up with me; it wasn't a bug. It is a metaphor for the gaming industry at large. Why is it that every mouse click effect is seemingly random and unpredictable? Well, that is a metaphor for life, how random it can be. How a small change can have dire consequences, or even none at all. Why is it that this game seemingly has no end? It is a metaphor for society as a whole, and our emphasis on work. It never ends. From the time you're popped out from your mothers womb, to your death, you work. It may seem endless, and that is the point.  You see, the game isn't broken. The people here, just don't seem to understand it. It is an untanable beast of a game, that seemingly breaks all convention. Which is why i 100% recommend it.  Also, the main character was female.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like this is some sort of torture device in some third world country.",
            "review_score": "1"
        },
        {
            "review_text": "what am i supposed to do?",
            "review_score": "1"
        },
        {
            "review_text": "why",
            "review_score": "-1"
        },
        {
            "review_text": "  [tl;dr] Piece of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "After tons of research, years of knowledge and infinite amounts of philosophy, I have come to a conclusion. Bitweb is not a bad P2W. Actually, it's not even a bad F2P. It's a horrible Flash game, that's what it is.  Don't let the kawaii graphics in the screenshots fool you. The view is forced to the first and second screenshot's place, and most of the time, people don't play this in 5K, so you won't even notice. The graphics are okay...but they don't wanna show it off. Now, the lighting is another thing. It makes me wanna PUKE. It's dim everywhere, like wtf. Where's this even supposed to be? What's the story? The main character kind of resembles a female Link from the Legend of Zelda, so I'd assume you're a hero of sorts. There's a princess, too, apparently. And hounds. Hounds don't even kill you. Technically, you can't even lose at this game, only decrease your score. Let's at least thank that they didn't make it so score went below 0. Which means no game over, though...  It's not over...it's never over... Female Link is love, female Link is life...  Please, when you're gonna apply some tags to this product, include anime, Post-apocalyptic and Dark Fantasy.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me set up my turret... Ok. Bitweb? Could be better... Pros: - Especially easy gameplay. Cons: - No main menu. - No tutorial. - Interface from the arcade. - No pausing. Conclusion: Gameplay should be modified, but several interface element losses doesn't make this game count as a game!",
            "review_score": "-1"
        },
        {
            "review_text": "Game makes no sense, feels incomplete, and carries the approximate quality of a game developed for a smartphone 4 years ago.. Definitely not for PC. Could have been made into an addicting game if the concept had been done right. Are those supposed to rats? Can you use that bow?",
            "review_score": "-1"
        },
        {
            "review_text": "the only thing that makes this game a horror game is how horrifyingly bad this ♥♥♥♥ game is. Don't even download it, it has no control instructions and in general it's just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't know steam sold Atari games.",
            "review_score": "-1"
        }
    ]
}