{
    "app_id": 375250,
    "name": "Pizza Express",
    "release_date": "2015-06-25",
    "developer": [
        "Onni Interactive"
    ],
    "publisher": [
        "Black Shell Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Strategy"
    ],
    "achievements": 160,
    "positive_ratings": 159,
    "negative_ratings": 27,
    "price": 5.19,
    "description": "Pizza Express is a fast-paced restaurant simulation where you'll join the laborious Gastone and his wreckless friend Lucky in a tasty adventure which will bring you from zero to hero. Manage every aspect of your pizzeria and turn it into the best eatery in town!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375250/header.jpg?t=1478109459",
    "minimum_requirements": "OS: Windows 2000, XP, Vista, 7, 8 Processor: Pentium or equivalent Memory: 256 MB RAM Graphics: 64 MB of video memory compatible with DirectX 8 or above DirectX: Version 8.0 Storage: 75 MB available space Sound Card: Compatible with DirectX 8 or above",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well what could I say about Pizza Express? At first sight you may think that it is a short game with some limitations, but in reality it's a full-fledged experience. It's a simple. yet effective and challenging managerial game where you run an 8-bit restaurant and make delicious 8-bit Pizza for the hungry 8-bit people!   PROS",
            "review_score": "1"
        },
        {
            "review_text": "They should use this to train pizzeria employee's. I'm putting this down on my CV.  But in all seriousness It's a Brilliant little game that has kept me occupied for hours.   There is plenty to do, a story line and lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game!  The game is alot more in-depth than I expected. Various management functions (such as advertising, and price management). The creativity is great too, allowing you to make your own pizzas and name them! Buying various types of ingredients needed etc.  Its endless too once you get past a milestone! Can't fault it. And its difficulty settings make it great if your a casual gamer and dont want it to be too hectic. Or if your a mad clicker in need of something that keeps you wired.  Suprised by the low amount of reviews, this game is like a hidden gem, and needs more players to write how great it is! (this is why im writing this)  I grabbed it on sale for a quid, it was worth me buying it an extra few times for gifts!!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this simply because it was less than $1. Did not expect more than a few brief playtimes of it before consigning it to the virtual dust gathering pile as often my cheap impulse buys (and indeed some of my expensive impulse buys) end up. Especially with this art style that while holding nostaligic value should have been consigned to the flames long ago. However this game ended up surprising me.  It is really fun, and the amount of play input needed between the main feature of cooking up pizza pies as quick as possible is really fantastic. You have to tailor most things to ensure the business does not sink. Which means carefully deciding whether you need to stock more from the start or whether you will chance the long wait for additional supplies. Can you afford that extra quality on your toppings. Is your brain able to deal with a lot on your menu or is a small menu more for you. All of these affect the end result when it comes to cooking time.  While it may not be the most asthetically pleasing game to some (art styles are a subjective issue after all). I would say the level of detail in the gameplay really turns this game into an absolute gem.  Full Price: A little costly $5: You will probably get enough to say it was worth it. $3: Certain sweet spot of value to gameplay. $1: An absolute steal.  arbitrary subjective number/ 10 ",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive and fun game, but has a few major flaws...  I am a fan of nice pixel graphics, but this one is not nice about that... Text is sometimes hard to read, and overall visibility is usually low, especially before you get used to it... Other problem is Lucky, who is JarJar of Pizza Express... Very, very, very irritating character that you want to punch in the face all the time... You can skip the story parts, ofc, but that's not fun... And the last, but not the least; when you need to spread the dough you use the same click as for sending the pizza into the oven... So, when you accidentally double click, you make a mistake... And it happens a lot, when you are in a rush... Though, I never bothered to look if this can be changed in the options menu xD  Anyway, taking aside these problems; the game is really great, fun and fast! :)",
            "review_score": "1"
        },
        {
            "review_text": "Frequent crashes sometimes random crashes on Windows 10. If your wireless 360 controller goes to sleep it'll crash. If you blink sometimes it will crash.   Stupid pixel art that forgets how pixel art was shown 'back in the day'. I like pixel art and enjoy it in most presentations but this is just a bad looking MSpaint game with no charm. More importantly it's a pain to read the text because 'back in the day' monitors interlaced with scanlines. Even CRT computer monitors had CRT phosphors and created a high resolution scanline effect.  In short, scanlines helped smooth the pixel art so you could freaking read the game, in full screen, without issues.  All that notwithstanding, this game might be purely adequate but it doesn't want me to play long enough to know for sure and honestly the controls may not make me care either way since you have a bunch of short, jerking motions with mouse controls it's a RSI nightmare.",
            "review_score": "-1"
        },
        {
            "review_text": "Pizza Express is an exceptionally brilliant game / simulation that should be required for every business / MBA student. Balance costs with expenses; manage orders with FIFO and learn the value of just-in-time ordering. Above all, have a blast baking breathtaking pizzas and crushing your competition!",
            "review_score": "1"
        },
        {
            "review_text": "Endless dialogues are so ♥♥♥♥ing annoying",
            "review_score": "-1"
        }
    ]
}