{
    "app_id": 375230,
    "name": "Warhammer 40,000: Eternal Crusade",
    "release_date": "2017-03-16",
    "developer": [
        "Behaviour Interactive Inc."
    ],
    "publisher": [
        "Behaviour Interactive Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "MMO",
        "Co-op",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Violent",
        "Action",
        "Adventure",
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Warhammer 40K",
        "Third-Person Shooter",
        "Action"
    ],
    "achievements": 67,
    "positive_ratings": 5439,
    "negative_ratings": 5580,
    "price": 0.0,
    "description": "Eldar, Orks, Chaos or Space Marines, in the fiercest battles for universal peace, through any means. Try the Free Demo - or buy the Full Premium Game below. We will not give up.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375230/header.jpg?t=1550788890",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: 64-bit Operating Systems (Windows 7, Windows 8, Windows 10) Processor: Intel Core i5 2300 or AMD FX 8300 or higher Memory: 8 GB RAM Graphics: NVIDIA 780GTX or AMD Radeon 7850 3GB DirectX: Version 11 Storage: 40 GB available space Additional Notes: <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.systemrequirementslab.com/cyri/requirements/warhammer-40000-eternal-crusade/13067\" target=\"_blank\" rel=\"noopener\"  >Click here to test requirements",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: 64-bit Operating Systems (Windows 7, Windows 8, Windows 10) Processor: Intel Core i7 4790 or AMD FX 9590 or higher Memory: 16 GB RAM Graphics: NVIDIA 970 or AMD R9 290 3GB+ DirectX: Version 11 Storage: 40 GB available space Additional Notes: <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.systemrequirementslab.com/cyri/requirements/warhammer-40000-eternal-crusade/13067\" target=\"_blank\" rel=\"noopener\"  >Click here to test requirements",
    "reviews": [
        {
            "review_text": "I try coming back to this game every once in a while, but it is clear that the promises made by the creators will never be delivered. I expected a 40k version of Planetside 2, with characters and events from the lore, but instead was gifted with another arena shooter. The game says that it's a full release, but it's clear that the game looks and feels as if it's still in the alpha stages. The design team has promised to continue working on the game and improving it with patches, but I don't think that this will be enough to keep the game alive. We've seen these actions before with games like Evolve Stage 2 (which recently stopped development I might add) and Final Fantasy a Realm Reborn, and only in the case of Final Fantasy was the project able to be salvaged. However, this was only possible because the original design team of Final Fantasy was removed and the game taken back to the drawing board before it was re-released into the game we know today. If Warhammer 40k Eternal Crusade has any hope of longevity, it needs to follow this model. The player base has dwindled to almost nothing and at this point it is very unlikely that so many people who were promised and payed for a complete game only to be given a unfinished product will be willing to return. My advice to those thinking about buying this game is to avoid it for now and see if they are able to come up with a miracle. I love the 40k series, and I had high hopes that this title would have brought the spirit of the universe to the computer, but it is clear that this isn't the game we were hoping for.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a little bit like the 40k universe, its slowly dying until its a husk of its former self, I have to wait ages to play in an actual game and the player count seems to diminish every time I log in. After playing this for 60 hours I actually long for the Tyranid Hive Fleets to just hurry up and end it all.  Gameplay is clunky, which to start of I found charming as I was playing a space marine and therefore thought that the large bulky power armour might have been developed in the game to act like it was heavy. However I've now realised that the gameplay itself is just a bit rubbish.  The Advancements thing, like levelling up, turns out to be dissapppointing too, give more buffs for players to keep them interested. At present I am not interested at all, I'm a flipping space marine in power armour, I should be powerful enough to crush an Eldar guardian with my little pinky, I should be able to soak up shuriken rounds like nobody's business and in the fluff around the universe and the tabetop game I can, however neither of these things are the case in game.   Classic Games Workshop game basically, could be good, you end up paying 40 odd quid for it because you like 40K and you come away with dissapointment.   It's too late to ask for a refund I guess, so this game will just sit in my library gathering dust.  Don't buy this game, you will be sorely, sorely dissapointed. And its such a shame because the concept of it was really good.",
            "review_score": "-1"
        },
        {
            "review_text": "Preface:   Terrible Game. Buy Warhammer 40k Space Marines instead, it's older and cheaper but it has: Tons of customization, a campaign, it plays well and does so on older machines. It looks better than Eternal Crusade and it's multiplayer is balanced and refined.   Review:  A game that had a kickstarter and Early Access had no right to be this bad for its release. It's filled with bugs, it's poorly optimized, the models and weapons look like plastic toys. The game is unbalanced and has pretty poor sound design. It's gameplay is utterly attrocious, with rubberbanding, low ticket rates and ultimately stupid design decisions for every faction.   This is, at the best, worth 5 dollars. Not the 50 dollars they're currently asking for at the time of this review. It's poor and its spiritual predecessor, Warhammer 40k: Space Marine did everything this game does and does it better. It also has a campaign! So, go buy that. This game?   It's utter trash. Beyond trash. It's actually a scam.   The developers should be ashamed for this easy cash grab. Well, you managed to steal my money. I hope you steal no other people's money in the future.   Kindly, go ♥♥♥♥ yourselves.",
            "review_score": "-1"
        },
        {
            "review_text": "It pains me to submit a negative review of this game. So many good qualities if only it was promised from the beginning. This game has gone from an MMO Shooter (See Planetside) to an arena brawl which lacks so much. So many promises for founders and yet we have nothing. a 50 dollar price tag is simply not worth what this game offers in the slightest. On top of this toxic devs makes player outreach impossible.",
            "review_score": "-1"
        },
        {
            "review_text": "This is not the game that I was expecting to get when I backed this project. Thank you for showing everyone again why backing early access games is bull-♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not get this game.  1. Game went from Early Access 'Alpha version' to release. It skipped beta phase completely and went directly from alpha to release...  2. The game costs $50 and it has an in-game cash shop. So not only do you have to grind gear, but if you want you can just spend money too. People compare this to Overwatch, but with Overwatch it's typically VERY EASY to get stuff. Like, one loot crate in Overwatch gets you 5 cosmetic items for sprays, skins, sounds, etc. With this game, theres nothing like that.  3. The game itself is -very- janky. Performance may be spotty, but the main issue is that it basically feels like a third-person alpha version of a Battlefield game. Unfinished, glitchy issues (like the game cuts out sound effects/sounds overlap eachother), and its just...it's a mess. An absolutely mess.  There are more issues, but these are it. Notice how I didn't really talk about things like faction balance or gameplay? Yeah, its because all of that is very shallow at the moment. There is absolutely no reason why you should buy this game at all considering there are absolutely -way- better alternatives out there.  Want a third-persion action game? Play Warframe.  Want a massive battle game? Play Planetside 2.  Want a really awesome Warhammer 40K game? Play Dawn of War 2.  Really, just...not even once.",
            "review_score": "-1"
        },
        {
            "review_text": "Absoulte sellouts. Unbalanced beyond playable.",
            "review_score": "-1"
        },
        {
            "review_text": "Warhammer 40,000 Eternal Crusade is an Early-Access game that has launched, from what i can only assume, a drunken mistake at the office party from accidently leaning on the big 'ol 'Launch on Steam' button, because i'm sure no manager would actually release their product in this state.  The Framerate is wildly tempermental (980ti, 5930k, 16gb of RAM) Barely holding 60 frames in some scenes, with an all-low of 28FPS on some maps where most of the scenery is present in the players view, though how they have managed this is impressive, considering the game looks considerably dated as is.  Animations in the game are wildly different on quality, you can tell for example, that the focus of the work done to the Marines seems to be considerably more that was spend on the Orks and Eldar, also another insight into this being a reason is they have considerably less cosmetics that you can buy with your hard-earned money, because after spending your money to buy the game, you can ofcourse, choose to spend more.  Physics are janky, Robes on the Eldar for example often just flap wildly everywhere, and sometimes through itself, Animations don't always line up, for example while crouching and turning the model's hands did not move with the rest of the body, resulting in a hovering gun and an odd pose.  Sound effects are also wildly different, while selecting different Psyker powers, you get a 1980's tv 'Woosh' sound that feels like it was probably procured from a stock sound website, while some sounds feel considerably more beefy. On the subject of sounds, Pity the headphone user, for when a sound effect goes off on an execution it is significantly louder than the rest of the game.  Shooting mechanics felt reasonably tight, though the feedback of if you were hitting a target or not was non-present and sometimes left you wondering if the server was lagging, as TTK felt like a dice roll at every encounter, this problem may possibly get stronger as the game progresses, as unlocks can help facilitate extra survivability.  All in all, this could be a good game at some point if they focus on making the game more responsive and having a quality thats much more consistant accross the game, as for right now i'd reccomend you save your money but keep an eye on it, as for me, i'm refunding this and putting the money towards more minatures, as in it's current state i don't think it's of a quality that should be expected of a final product.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunatly I had taken a ride on the hype train by being a founder. Been playing it off and on in alpha up until now. I so wish this thing was great, but it has just been a dissapointment overal.  The IP is solid and they do a great job of making it very 40K. A big thumbs up on that point, but past that the game is just chocked full of performance issues and glitches. They might have been rushed or had some other technical problems they faced, the end result is a mostly unplayable experience. The control is cumbersom and clunky and refresh rate looke like it is being drawn by an etch-a-sketch. Very unoptimized to say the least.  I should have just saved my money and bought more 40K tabletop stuff instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Ashamed to have convinced my friends to purchase this game.",
            "review_score": "-1"
        },
        {
            "review_text": "broken promises extremly slow dev....   bad optimalisation balance - whats that?  shoter? - nope at all ... melee spam + plazma spam maps few are oke, other unbalanced.... extremly unbalanced.... are devs doing something about it? well they say so... but no reasults... at all...since long time this game is beta... for full price... with expensive microtransactions in it???!!!  this game is same disapointed as 'no mans sky' but WH 40k edition...   but if you have 'to much money' and bored for one - max two days... and you are extreme fan of warhammer 40k then but only then you coudl buy it...  so sad... big expectation - total disapointment  ",
            "review_score": "-1"
        },
        {
            "review_text": "Clunky game mechanics, not very fun. Overall feels botched.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is good. Very good, even.  With that said, the game is absolutely not finished - as of the time of this review, I'd guess it needed to stay in Early Access for between 6 and 9 more months.  The game works, has fun (very team based) mechanics split between ranged, melee, and vehicle combat. There are a variety of different classes with varying playstyles that can be changed up by changing out equipment/wargear.  Yet it needs a lot of optimization - some maps run pretty well, with one or two spots with unexplained performance drops, but other maps run awfully even on my fairly beefy rig (i7 4820k and a Fury X).  Significant balance changes are required, and thankfully being worked on rapidly by the devs. The Eldar race is pretty blatantly OP, the ranged/melee balance probably needs some tweaking, and a few random weapons are overtuned (plasma cannon).   It also needs just general polish, like improved animations, more ui functionality and the like.  Overall, I would still recommend the game even in its currently unfished state. I've had lots of fun with it since I got it, and don't see myself putting it down any time soon.  Right now Warhammer 40,000: Eternal Crusade is a good, but incomplete title. If you're looking for a pretty unique team based Third Person Shooter - or are just a big Warhammer 40k fan - and are okay with the fact it's still technically an Early Access game, I would suggest picking it up.  Just be sure you know what you're buying before hand, and if the incompleteness is a turn off for you, then avoid it.",
            "review_score": "1"
        },
        {
            "review_text": "Im a direhard 40k fan, i have been for about 8-10 years, i used to live and breathe 40k, ive played most of the video games and most of them are pretty good, but this ... is god(emperor) bad, its not finished, not even close. I cannot believe the balls they have, releasing it at the stage it is at, i wish i couldnt relate it to warhammer and i certainly wish i could get my money back.  I played the alpha and beta alot, and believe me when i say , they have changed next to nothing. Do not waste your money on this garbage, save it for DoW3 , at least that has a chance of being decent.  How the holy hell did they take all the patter away from orks? ... thats an achievement, they made orks boring ... ffs",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. If you are a die-hard Warhammer 40k fan, keep an eye on it, and  maybe  it might be worth buying someday. I would not hold out any real hope though.  There is enough information in other reviews about the state of the game and the actions of the developers but I figured I might as well add to the pile. Regardless of their shady actions the developers have not shown any indication that they can truly make this game good. Every (often delayed) patch brings nearly as many problems as fixes, and they have seemingly been outright ignoring glaring and easily fixed issues that have been around since alpha. It might get somewhat  better , but it will never get  great . Their idea of a 'MAJOR Content Update' basically boiled down to fixing (take the word 'fix' lightly) a few things that should have been fixed months ago, and giving the  Salt  Space Marines a weapon specifically designed to combat Eldar speed instead of actually fixing their netcode which would have solved the main problem (hit detection) itself. I do not honestly believe they have the skills (interest, perhaps?) to fix the issues that plague this game.  For what it is worth I have had fun with this game. However, it is the kind of fun you have to suffer for; you will spend more time fighting the clunky controls, mechanics, sticky scenery, and poorly thought-out map design than you will the enemy.  Assuming you get to fight at all, since the player population is so low and so skewed towards LSM that if you play any other faction you will only fight LSM 90% of the time, and most players on LSM seem happy enough to stay there and complain about long queues as they join up in 10+ player warparties to pubstomp other factions. Such is simply the state of playing the game as it is now.  I cannot recommend paying the price this game asks for (even at 50% off) in its current condition. Give it a year or 2 (assuming it survives) and if the Ruinous Powers smile upon you it might be FTP or actually worth spending something on.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is far from finished. The melee is extreamly clunky, the progression is slow, and the weapons and factions are extreamly unbalanced. If you are a fan of warhammer do not buy this game. It has been released as a full game but, it is not even close to being the game they sead it would be. They labled the game as an 'ever evolving game' but that is just a way to say they don't care that the game is unfinished they will just say it is finished.",
            "review_score": "-1"
        },
        {
            "review_text": "For me this is the worst game ever. Balancing is ♥♥♥♥. There aint no content (actually alot less than is THQ Space Marine) There aint no story There aint no gameflow There aint no World.  For a lobby shooter its much too expensive &amp; styleitems like a shoulder or a chest costs ~10€.  That EvE Guy should have stuck to eve, he aint competent leading an 3D-MMO-Studio at all... Nathan doesnt stand for QC at all, there aint no polish, there aint no NOTHING.  Nathan Richardsson = very low quality &amp; money ripping games.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the captains pack the moment it was available and before there was any possibility to know what would come. They announced great things to be the core of the game and I was already quite sceptical from the beginning. But I thought: Okay, give them a chance to create a game that finally lives up to the great franchise and does not suck like many other WH40k games made before. During development they announced that more and more of the really nice features announced would not make it because of different reasons. I was disappointed but that was okay, because they explained why that was not possible. Early Access for founders came and I wanted to jump right in. Well, look at my playtime on record? Not even 3 hours. Why is that the case?  First of all: Performance. The performance during early access was already bad. Thats okay, it was early access. But even when I tried the game after release it was horrible - event though my PC is able to play all new top titles on high details and so on. Nonetheless: The performance is lacking and I am having great problems to play this game without regular frame drops, lags and so on.  Secondly: Controls and camera. The controls are sluggish and feel absolutely off during play. In addition the camera makes a lot even worse. You are fighting with controls and in addition the camera doesn't help at all. Keeping an overview of the battle around you seems to be nearly impossible. And even if you know what you want to do the controls don't want to let you do it. Best thing to do for me was to take a window facing an important doorway or the likes and camping there. Something a lot of people were doing.  Thirdly: Factions. Okay, Chaos and normal Space Marines being alike is a thing I was expection quite a bit. They have their differences but are still quite similar. But when fighting the eldar or orks the feeling was... the same. They have different models but fighting them feels very simmilar. Okay, Eldar seem to be faster but hey, might also be my imagination. When playing them myself I felt like playing just anothe Space Marine with Eldar Skin and different sounds...  Fourthly: Balance. In combination with the factions you might think this small eldar might just explode when hit by a bolter shell? Or that maybe a few bolter rounds should down a space marine? Nope. Ranged combat always was quite horrible because the weapon damage seems to be that low, that you have to shoot at an enemy with three to four allies to get him down before he reaches cover. Meele combat in comparison downs you that fast that there is nearly no possibility to react if someone comes into close proximity. In combination with the bad controlls the rock-paper-scissor component of meele combat feels like hell. But this system rarely is important because you are killed before you can react. Another thing was just an impression and I was not able to play enough to get a better look at it but things like chaos sourcerers just do funny things and seem to be quite overkill at the moment. But: I didn't play enough to see if it is a real problem. We could talk about vehicles but I really don't want to, because they are a pain in many ways...  Looking at the game at its current state and ignoring the fact, that there were much more features announced: Warhammer 40.000: Eternal Crusade is an below-average shooter with Warhammer 40k skins. The shooter part does not work very well because the controls, performance and balancing have a lot of problems. Warhammer 40k seems to be only there when you look at the name, models and the surroundings. I neither get the feeling of playing a Space Marine, an eldar or an ork when playing those factions. Even though the game Space Marine had its own flaws the feeling of being a Space Marine was much better there.  As already was said in many other reviews: They promised much and delivered a game that, even when you look at it in an 'arena-shooter' kind of way, is not a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the first game I've ever permanently removed from my account.   Un-balanced, Un-finished, and Un-worthy.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is broke. Yet to get on a server that isnt lagging like all hell, are there even eu servers?",
            "review_score": "-1"
        },
        {
            "review_text": "one of the worst games i have ever played, and thats sad considering how much i like 40k. i bought it at 50% off and feel like they owe me 100% back for wasting my time. terrible controls/optimization, lousy (or non existent in some cases) customization, very few weapons, guns feel useless...on and on, too much to put. I would be at it all day.",
            "review_score": "-1"
        },
        {
            "review_text": "Simply unfinished. I don't think it ever will be, it's a damn shame. Save you moneys for deathwing",
            "review_score": "-1"
        },
        {
            "review_text": "TLDR version : Decent game lots of potential cannot recommend, in game premium currency currently sketch , major balancing needs to happen, still needs polish for a release. Get it on sale  ------------------------------------------------------------------------------------------------------------------------------------------  I like this game it is a decent game that being said I cannot recommend until certain key issues are fixed .   1. huge issue right now is that steam purchases for premium currency aren't translating correctly and support cannot seem to fix it. Players have also been told. 'We have credited everyone's accounts with 10,000 RTC as an apology for the wait.' This to has not happened. So until either the currency is translated or money is refunded well you can see how this is an issue &gt;_&lt;.   2. Balancing issues it seems as if most races were made but then certain classes / racial traits were just left half hazard as the game still has more content to be put out . the game is in release with out balancing for example all of the eldar ... just eldar . the other races are decenty ballanced with only certain weapons needing a lil tweaking ( not even a big issue really ) , but as many have said Eldar didn't have enough participation so they got the flavor of the month buff stick , but one of the devs just kept beating it.   3 players may expierence some derp. its a release game that is still being worked on give it a some time for some hard updates to come out .   For these reasons as of now I like this game, I enjoy supporting the release ... if it was supportable, and I will continue playing it because i have hope but i just cannot tell any one else to buy it at this time due to the bugs for full price. If you can get it on sale heavy discount rock it out.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is BS",
            "review_score": "-1"
        },
        {
            "review_text": "a released game looking and feeling like a beta test is unacceptable, Why warhammer seems to be cursed to mostly bad video games is a mystery to me, but this game feels like they gave up near the finish line. Plays like garry's mod with some very nice warhammer sweps.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is trash. It is just a buggy arena brawl. Not worth $50 and I highly doubt it ever will. I have been following it for quite a while now and I really didn't have too high hopes for it. Here we are now. The game is still trash.",
            "review_score": "-1"
        },
        {
            "review_text": "This game need more content, much more. This is ordinary shooter, not MMORPG. Dislike, for now. Pathes and content, we are waiting for you !!!",
            "review_score": "-1"
        },
        {
            "review_text": "As a founder I've been with this game pretty much from the beginning. I finally saw potential for a good 40k game. I defended it, saying it was still alpha, so we couldn't expect it to be perfect yet. And now it's suddenly released. this is Beta stage at best, and the biggest waste of money that I remember committing to any project.  It's buggy, imbalanced and incomplete, even for a run of the mill arena shooter it's pretty lousy, if you were hoping for a good WH40k game, I recommend you move aliong and wait for Deathwing, hope for the best...  Pro: - Visual style is pretty grimdark, as it should be but still needs alot of work - There is potential for this to become a great game, but it's merely the foundation  Con: - Buggy - Imbalanced - Incomplete - Little variety - PVE is pretty much redundant at the moment",
            "review_score": "-1"
        },
        {
            "review_text": "I became a Founder in July of 2014. What a mistake. The game is made up of broken races, broken weapons and broken game mechanics. I will not go into what those things are as there are more than enough reviews explaining them , in detail. The developers of this game have shown their complete disconnect, not only from their own game, but also from this genre of game time and again. I wish I had bought this game on Steam because I would now be getting a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "In this condition its a pure insult to WH40k!",
            "review_score": "-1"
        },
        {
            "review_text": "I don't post many reviews, but here goes... Considering this game is in alpha, and has a long, long way to go, it is excellent. At the moment you either play as marines or chaos rather than the variety of four armies. No perks for your characters yet, but you can see where they are going to put that in. Also there are only 3 maps, with very similar game types. Then again it is Alpha testing, and is pure chaotic fun. The game is less glitchy then most shooters out there in full mode.   If this really does sell on, it could be massive, more game modes, more armies added as dlc's (tau and nercothingys etc). I cant wait to see the tyranid part. They could even add to the current armies, terminators and dreadnoughts etc. Can really see huge potential.   I lost my interest in gw stuff long ago, but this brings pure joy, havent enjoyed a shootout this good since cod mw2. Bravo and keep up the good work! I look forward to seeing more and more of this :D  For now, I will enjoy killing a few heretics or fight for chaos :D  Edit review: this is borderline no. If anything it has got worse since my original review. The game seems rushed, and the melee is now far too op. I have to say I have turned from enjoying this game to almost no emotion at all. Will keep with it, but if it stays in its current state. A bad review will be coming.",
            "review_score": "1"
        },
        {
            "review_text": "  Initially its fun but the game doesnt deliver anything beyond the basic combat. Weapons and wargear is unbalanced and there still are alot of bugs that ruin your enjoyment of the game. If this game survives a year from now It might be a really great game but for now its frustrating to play.  If you do play this game play it with a group of friends or with a guild. Solo this game is a horrible frustrating experience.",
            "review_score": "-1"
        },
        {
            "review_text": "As it stands, I don't recommend this game. It has a lot of potential, and hopefully in time it will be as great as it deserves to be. Hoping for the best.",
            "review_score": "-1"
        },
        {
            "review_text": "No, sorry. Maybe Later.",
            "review_score": "-1"
        },
        {
            "review_text": "i originally wrote a rather *rough* review of this game. i deleted that since the game has been released.  my original review however was entailing how the community was painfully naive thinking that a game that was being taken from Alpha to release in a matter of months would be anywhere near a complete or bug free experience. I am happy to say however I have been pleasantly surprised by the developers progress despite announcing they were fast tracking the game to 'release'. MY claim still holds true however, the game is incomplete, unbalanced and unoptimized on nearly every level, but there is good potential at its core.   However, between the prototypical fanboyish naive players that make up a good chunk of the community, the developers questionable decisions and communication regarding the progress, development plan and future of the game and the very high asking price of what is still completely an unfinished early access game i would be dishonest if i was to say i recommend investing in this game in anyway.   We shall see what the future holds but I would not hold my breath on this game living up to its potential or even promised features due to it being 'released' and still being an utter shell of a game. Sad, I would love a proper large scale WH40k PVP game. Back to space marine it is for now!",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who has played this game for quite a while i've got to say that right now this games is NOT worth the current price. I've played it since it first hit steam in it's early access state and let me tell you, back then was waaaaaaaaaaaay preferable to what they have now. over time it's really become a mess. melee is OP as hell and guns don't really feel statisfying. You can be easily be taken out by melee even after empting half of your MINITURE ROCKETS into their face. There is a HUGE list of things wrong with this game but you can read other reviews for those lists. All in all to save yourself the money and trouble and come back to check on it in about half a year to a year. Maybe then it'll be in a state of quality of a decent beta.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother. Another failed MMP combat fiasco. There is no seperation between new players and old. I followed around an orc shooting it in the back with the default bolter for a good 10 seconds and his health bar didn't move because he was fully geared with a lot of advancements. He turned, clubed me once and I was dead. These games that do not have Point Caps are just masochistic and LAZY or incompetent developers. Also the graphics are really sub-par for a modern game. I mean like really sub-par.",
            "review_score": "-1"
        },
        {
            "review_text": "Updated-See Below  You are most likely reading this as a fan of Warhammer 40k. You also know that online games of the franchise are few and far between. Keep that in mind as you continue reading.  I bought the game in Early Access, and at first, was tempted to give a scathing review. Bugs everywhere, serious balance issues, lag that was game breaking, and lackluster customization options were just some of the points I was going to cover. I decided it really wasn't fair to review a game which (in it's own words) wasn't even finished. So I decided to wait until the launch.  In that almost 3 weeks, I have seen multiple patches that not only addressed the above mentioned issues, but others I didn't mention. The developer, BeHavior, was working as fast as possible to meet the deadline set by Bandai Namco. And the speed at which it was done is a credit to them. So much so, that I believe an exorcism may be needed for whatever infernal blood contract they signed.  But this isn't a Dev review. It's a game review.  You came here because of Warhammer 40k. So we will judge it using that.  From the start, there is a LOT missing from the franchise. Less than half the factions are represented, weapons are missing, the maps are all urban based, and your favorite sub-faction may not be included. But it has been stated that (over the course of time), these may be addressed also. Which is good news, but doesn't help you right now.  When we strip away everything that is 40k, and replace it with obligatory WW2 themes, weapons, vehicles and maps, we are left with a lackluster lobby shooter that couldn't compete with others of the same type.  So Warhammer 40k is the only element that will keep this game alive. Which is good for the fans. Like you.  In my almost three weeks of playing, there have been many changes and advancements in development. If that momentum and drive continues, BeHavior has the opportunity to make this into a GREAT addition to any 40k library.  Warhammer 40k online games are not in great abundance. But I would rather have a few great games than a horde of horrible ones. And this one has the potential to be great. It will take time, work, and perhaps even renewing that blood contract- but I do think it will happen.  UPDATE-  It has been over a month since the launch, with several patches going back and forth with 'balance' changes. Unfortunately, the MAJOR issues aren't being addressed, or even commented upon. As such, I have to change my review. The premise was great, but the holes in the foundation are making this game fall apart. It isn't a lobby shooter, it's a lobby meleer. The significant balance gap between ranged and melee can be demonstrated in the following-  1) Melee Lock-On This allows melee players to lock-on to a target, basically allowing them to strafe around the target and spam melee attacks. They generally move faster around you than you can turn, and unless you are melee, you have no ability to lock onto them.  2) Unlimited Jump Packs Basically, if you have a Jump Pack equipped, you can soar into the air and cover a great deal of real estate or get past a defended position. It is difficult to shoot someone mid flight, and they can end the usage once the first bullet hits. The 'fuel' for the pack replenishes quickly, allowing them to practically go anywhere they want.  3) No resource usage for melee attacks If I shoot at you, I expend ammunition. Eventually, I run out and have to resupply somehow. Melee has no 'stamina' gauge that limits the amount of attacks they can do. They can literally wail on a tank all day long and never get tired.  4) Melee doesn't appear on radar If you sprint, use a jump pack, or fire a gun, you appear on enemy radar. However, you can kill an entire capture point worth of enemies with your power fist and never show up on radar. Ever. You can literally go the entire match not even showing up on enemy radar.  5) Capture points are inside rooms Almost every capture point is inside a structure, making close quarters combat not only needed, but extremely powerful. Generally, ranged weapons are fairly useless at these points, because once the melee enemy is at the area, you are dead.  6) Transports Transports are used for instant deployment to wherever the transport is. While I understand the need for them, it allows players to circumvent massive areas of the maps, covering miles of terrain in some maps. While I understand the need for the 'feature' (which anyone familiar with tabletop would recognize as every unit having Deep Strike), it contributes to the next issue-  7) Maps have FAR too much cover While there are areas on maps that have wide open areas to fill people full of holes, these are generally bypassed due to transports (see above). All other areas have far too much cover, allowing enemies to simply ignore the fact you want to shoot them. You can move to a new area, but so can they.  The general responses to the above issues are the obligatory 'git gud', coupled with the chants of melee-centric premades of 'use teamwork!'. Those responses, however, are from the dwindling, but diehard, 40K fans who refuse to give in into the fact that the game will never be what they envisioned or paid for. Their blind fanaticism forces them to clutch onto the 'future', as they are watching a loved one die in a hospital bed.  Numerous negative game reviews- (just look for yourselves). Developers who refuse to change what 'they' think the game should be. Absolutely no endgame- At rank 5 for every faction, you win! Increasing queue timers, because people are quitting the game. No actual game direction, outside of getting a turd polished for console release.  Still want to buy it?  Spend that money elsewhere, because you are only paying for life support for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this game so much, but it's absolutely horrible - there's no other way to describe it. I've been playing real Warhammer 40k for 23 years now, so I was super excited to play a 40k MMO, but this was just a rushed, poorly made and badly executed attempt. It's just atrocious. I have an ASUS ROG laptop that can play almost anything, yet this game is choppy/clunky. Melee combat is a clickfest and killing something with a ranged weapon is basically a fluke. Furthermore, Space Marines can be downed by almost every weapon with ease, and are able to bleed out (in 40k lore, Space Marine wounds instantly auto clot...yet Marines bleed out in seconds in this game). In real 40k, Space Marine power armour can stop an autocannon round 66% of the time, with zero damage to the wearer...yet in this game, a couple chainsword swipes or a burst of bolter rounds can instantly drop one of the Emperor's Finest. It's ridiculous. It feels like Paper Armour, not Power Armour, and it certainly does not feel like WH40k. I tried so hard to like the game, but I can't justify wasting precious time playing this disaster anymore. And mark my words: it is a disaster. Actually it's even worse - it's Heresy. We were betrayed. If I could get a refund I would.",
            "review_score": "-1"
        },
        {
            "review_text": "Made by a company that seems like they are trying to make the best game they can got a pretty unfair timeframe to do it. Its coming out soon and while it is fun and functional alot of elements are still missing, they seem to be striving towards those elements though as fast as they can with the game getting a 3 gig update every few days. Give this game your investment it will be great!  Edit: After its release I DO still reccommend it, I find it incredibly fun even though still not being finished. The latest patch fixed alot and added in alot. If you like online action games, games with friends or a huge fan of the Warhammer 40K universe like me you will get 50 dollars worth out of this game. If not now then when they keep adding more.",
            "review_score": "1"
        },
        {
            "review_text": "eyyy i bought this game for a hope of something similar to warhammer online from mythic's amazing hands, instead i got warhammer space marine multiplayer on persistant maps. garbage. oh wait come to find out, they didnt even deliever persistance, do not buy this is a jape game",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, this game is not worth 40$, not with how much the Devs promised, then up and went and backpeddaled on nearly all of them.  At best, this would be the kind of purchase you make when its on sale and they really need the cash, and by that I mean its not worth more than 10$ at best. I really wish this couldve been the game they had the vision and dreams for, but with how much they are overbuffing 1 faction, and letting the other 3 fall behind, the blantant unprofessionalism from the devs(one takes it upon himself to bring his personal life into discussion quite often, and if he isnt doing that, hes insulting the community on the forums.), and quite frankly, they continue to SNAFU the game with every patch, claiming bug fixes, people get in game and said bug fixes are worse than before.  This is all I feel about the game after having gotten it back in july, and playing up until now.  Do not waste your time with this game, Deathwing, Dawn of War (any of them), Space Marine, hell, even that chess one, are all better purchases than this steaming pile of warp spawn.",
            "review_score": "-1"
        },
        {
            "review_text": "I wish I could recomend this game. However the developers pulled a scam here that even makes Overkill look reasonable. Half the promised content is missing and Items backers bought are still missing. And I dont talk abount 'Didn't get this fdancy sword!' but 'There aren't even bikes or heroes!'  Unless a miracle happens I realy recomend to avoid this like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "Being an early supporter with one of the founder packs, I am vastly disappointed that in the end, they decided to just 'give up' and just release the game as is; barely providing anything promised.  I have finally learnt my lesson (along with those who bought No Man's Sky) to just not pre-order from small developers or maybe just not pre-order at all. Developers just get away with it too often without being transparent.  TRANSPARENCY is the key people.",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not support native resolution of my monitor (1280x1024). It has only 1280x720 and 1280x800 options. And it can not properly scale. So it is pretty much unplayable for me. This issue was in early alpha and is still here. Asked tech.support for help 3 weeks ago and did not received any answer.",
            "review_score": "-1"
        },
        {
            "review_text": "Keep the hell away from this giant cesspool of ineptitude. These devs need to stay designing Hello Kitty and stay the HELL away from anything resembling a warhammer game. That includes the modes. Holy crap at a pile of garbage that I cannot geet a refund from. 50Euro + Microtransactions AND 2.7k highest peak on launch? Gonna die within the year.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy: yes Netcode: not amazing Imbalanced: slightly yes Fun: HELL YES! Deep Strategy: Yes, IF you can get past the learning curve My Credentials: 1100+ freakin hours  The game we have is good, the game we will get later will probably be epic. Get past the 'Give it to me now' mentality of not having all the features, see the game for what it is, and you will enjoy yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This game's PvP is basically one map. Each side takes turns attacking and defending and that's it. There are no random maps (like figthing in a forest, on an ice planet), and there is no reason to level up except for gear. I don't think that there is any way that a newbie will be able to jump in and have a good experience. The experienced people will literally chop you up into pieces.The balancing issues are impossible to ignore, there are obvious problems everywhere ( like being unable to fire around some types of barriers and the shaky crosshairs thing), to bugs and glitches being rampant. I bought this game as soon as it launched because I figuered that the Alhastage would have fixed most of the issues but it didn't. This game is in no way ready for launch. I honestly don't see this game surviving longer that 180 days. I just don't....",
            "review_score": "-1"
        },
        {
            "review_text": "Small update: I am now aware that the Store page currently appears to advertise features that are not yet in the game in a way that grossly misrepresents the product as it is currently available. I still stand by my reccommendation and everything within it, but I vehemently agree that the Store page needs to be changed to better contrast what is currently available content versus what is merely planned for future updates.  Version reviewed: 1.0  I strongly recommend giving this game a chance and some patience. The four factions - Space Marines, Chaos Space Marines, Eldar, and Orks - are beautifully, faithfully represented in such a way that the transition from tabletop wargame to third-person shooter looks and sounds both satisfying and natural. The fundamental gameplay has gone through a few iterations but is now in a state where it is more fun than ever before - annoying bugs have often been fixed within a few days of appearing. 1.0 has its share of balance problems, too, not the least of which being Orks suffering from a severe lack of power, but again the company has given me a lot of confidence that they are working overtime to get it right - and that they will sooner rather than later.  That's part of why I advise patience. The game at launch will in all likelihood lack content and polish that everyone wanted it to have. The game is transitioning from Closed Alpha to release this week - no beta whatsoever. However, I was impressed with the amount of things that the devs crammed into Patch #'s 23 and 24, and their News updates convey a level of honesty and openness that few companies dare. (I suspect the dishonest Storefront is an unrelated but still important issue.)  So is this the game you've been waiting for? Maybe not yet. However, in the past couple weeks the game has been vastly more fun than it once was and I've never felt more driven to play (and play a LOT); all but five of my hours played have been within a couple weeks of release. I feel completely confident that if the game's current state isn't already worth playing to you, then rapid content deployments will make it so soon.  P.S. Players have an entertaining tendency to talk or act like their characters, particularly the Orks who consistently ham it up with unrivaled fervor. I've seen a surprising number of messages from people who couldn't help but smile after losing to Orks because of our enthusiastic victory spam (probably doesn't hurt that Orks have had to work ridiculously hard for those wins most of the time).",
            "review_score": "1"
        },
        {
            "review_text": "A poor excuse for a cash grab. Given time and funds with early access, yet now it's been launched with missing content and a promise of a better optimised and extended experience for the later (console) versions. Unless you are a huge fan of the 40k setting, then wait for some significant updates until wasting your money on this unpolished turd.  TL;DR Wait for updates or the console versions.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like it, but it's just not fun. Not open world, only partial controller support. I can't believe I paid full price for this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game F&amp;%*ing sucks and basically... I want my money back. 3rd person shooter... PFFFFFT Yeah right!!! Sword mother F@$#ers all over the place ♥♥♥♥♥♥. Then oh boy I feel like i am actually doing okay this round... 'connection to server lost.' The graphics aren't pretty good they are not deserving of anyhting like pretty good. They are okay and super demanding of the most advanced GPU's for seemingly no reason. I couldn't figure out how to play... There is a short tutorial similar to dark souls where you walk around finding random signs to tell you how to play. Figuring out how to progress in this game was confusing too. The skill tree is short and super lame. All the weapons suck. If you dont have a good melee weapon you are screwed most times. This game was over-advertised and I bought into the hype. If you are a fan of shooters... dont waste your money. Especially when this P.O.S. is a whopping 50-60 bucks. And furthermore, I haven't regretted buying a game this much in a good long while.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game before the recent big changes of adding orks etc and bit more customization and I thought . Wow orks finally my favorite race to play. I love the direction the game is heading but .... It maybe just me and if so than fair enough but the gameplay is just far from fluent, its just a big pile of mess of people teleporting and swining melee weapons like crack heads on redbull and being hit from people you cannot even see. Seeing as I love playing the heavy weapons class the most, its pretty much impossible to hit or target anyone.  If it was less teleporty and glitchy I would love this game. Hopefully in time they will fix this.",
            "review_score": "-1"
        },
        {
            "review_text": "There is nothing to say. Other then its buggy, full of microtransactions that are way to costly, and not what was advertised. don't waste your money. I did learn something though. never buy into a game that hasn't released yet because it will most likely devolve into something else entirely. I wanted so badly to like this game. I even load it up sometimes to see if there is something redeaming about it in the patches...nothing redeaming just the same false hope. its sad really.",
            "review_score": "-1"
        },
        {
            "review_text": "In my mind this is still Early Access. Its an unfinished game. Not what was promised and buggy as hell. Better to wait until they complete the game to buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Alot of people love this game for what it could be.   Alot of people hate this game for not being what it was promised to be.   Personally? I'd be happy with just a good Warhammer Lobby Shooter. Even a middling Lobby Shooter with a 40k skin (though certainly not at the current price).   But this game fails at being even that. It's a slog of unbalanced classes, factions, and weapons that culminates in a chaotic mess of a product. Sometimes that chaos briefly coalesces into an enjoyable style of mayhem, but more often than not - and with more regularity as you play – it's just a frustrating mess. It'd take more than a few weeks or perhaps even months of polishing what is already here to fix this game let alone expect new content of decent quality.  As a fan, its heart breaking to think how good this game could be, that it SHOULD be after all this time in development. As a customer, I can only wish there was something more in here so it wouldn't sit in the dark crevices of my Steam Library, but Eternal Crusade isn't worth your money, your time, or your hope.",
            "review_score": "-1"
        },
        {
            "review_text": "Any semblance of balance has been ruined. I used to like Eternal Crusade a lot. Now, not so much.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game, i tried i really did but jesus is it Pay to Win, Unbalaced Factions, going into a game with new players on your team and seasoned veterans on the oppisition, ive never even won a game yet, not only that its advertised as a Planetside type game but all it is, is an 3rd person arcade shooter with mediocre gunplay and stupid melee, that you que for matches for like any other FPS. theres only 2 types of vehicles A transport or a regular tank (no customisation, eldar grav tanks cant even 'fly' like in the artwork) No terminators or any type of elite unit, Veteran players will shred you due to not only experience but having the better gear... graphics are very meh same with the sound effects, phycics and collisions are terrible. so in the end this game in its current state feels like a Pre Pre alpha with years to go until a actual release but in reality its already out.",
            "review_score": "-1"
        },
        {
            "review_text": "No ultrawide support, choppy performance and random stutterings even on the lowest settings (I have a gtx 980ti). Gameplay feels clunky as hell To sum up this is an unfinished game with a lot of missing features....maybe in a few years they will iron out all the bugs...",
            "review_score": "-1"
        },
        {
            "review_text": "Just don't, at least not yet. The store page is a flagrant lie. Half the stuff listed under the 'About This Game' is not even included yet. How this game got out of early access and shipped out like this is beyond me, and in my opinion is just a slap to the face of both WH40K fans and third person shooters alike. The game is buggy, poorly optimized, the customization is minimal at best, and the maps, for the most part, are rather uninspired and boring.   If you feel like buying a game whose store page is a big fat false advertisement then feel free to purchase this, otherwise just don't even bother giving this game a second glance until it's actually had all the features it was SUPPOSED to have added with it at launch. Just terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game, avoid. No sense of direction from developers, bizarrely ugly models in many cases which can't be carried by the overdone visual filters. Only marginally improved since early days, little to no progress made in many areas. Extremely clumsy character customization with limited options. Not worth it even on sale - you will most likely struggle to draw enjoyment from this mess, spend your money elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "First am a huge 40k Fan and been waiting for a good 40K game to play, I was looking forward for this but after I played it here's my issues with it:  1. ingame shop that sell everything that looks good in this game  2. broken combat, you get stunned all the time, you get killed in 2 hits   3. bugs all over the place   4. I spent all my matches getting killed in a funny way bam bam dead   5. the shooting is not fun at all, in accurate guns, and small jumpy Eldar   I don't recomend this game or supporting such developers, even if it goes F2P it feels like a huge wast of time",
            "review_score": "-1"
        },
        {
            "review_text": "I've been dipping in and out since the Early Access Alpha.  This game isn't launch ready, not even close. It needs at least another 6 months in the oven, probably more. It's buggy, ugly, lacking basic features. Basically, it's still in early access, they just slapped 'launch version' on it.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this but I cannot recommend it.  Every match lags because all the servers are based in the US. So when they bring out EU servers, maybe the rest of the world can enjoy the game.  At the moment you die behind corners, get out shot, get lag battles and lose and the only time it feels fair is when EVERYONE is lagging. Which is no great excuse.  Game does feel good and has some ideal goals an I hope to see them come to fruition.  Wait if in US and get in sales.  Don't buy if you are in the EU until EU support is given.",
            "review_score": "-1"
        },
        {
            "review_text": "dislike becasue i payed like 50 quid for planetside style warthammer, got this, cant get money back, if they make it decent ill change my review till then i wouldnt waste ya money on it, tis a shame",
            "review_score": "-1"
        },
        {
            "review_text": "Got it's fun moments, but really belongs to early acces.  ",
            "review_score": "-1"
        },
        {
            "review_text": "___________________________________________ Edit: Was going to go back and redo the review after I put some real hours into it and talk about gameplay, but the Devs seem to have forgot too.   Just know: the loot isnt ballanced the weapons arn't ballanced the classes aren't ballanced  the races arn't ballanced the teams arn't ballanced ___________________________________________   One word: Unfinished.   -The textures and units look like they were made for when it was supposed to be an open world mmo type game. clipping is everywhere, texture are stretched on the ground almost as as much as it isn't. the lack of detail for the units is also weirdly limited, especially sense its its warhammer, ie: super over the top ornate Gothic make your own guy the way you want name brand warhammer 40k  -The animations are extremely clunky and very basic for Xenos, it wouldn't be so bad if it wasn't 3rd person and your looking at your guy wave is arms around like a spaz. also you feel like your gliding on ice, you have no weight. remember when you sprinted in Space Marine? how you crunched real hard on each foot showing how heavy and armored you are? yeah nah, its your arms and legs just go faster.  -The sounds are almost like place holders, there is no depth to them. its very out dated feeling. If there is ambient sounds, I don't notice them at all. Your supposed to be in a huge battlefield but all you hear is the 2-3 sound of your gun shooting. And zero voice over guy or squad yelling semi relevant things, like GRANADE! or THEY ARE TAKING BASE A!  -The FPS and sceen tearing is a huge problem. trying to shoot at a guying running at you with an axe is greatly effected. not to mention there is friendly fire so pick out the baddy in a melee is a real test. or when you are trying to not get run over by a tank. you can very easily miss what killed you.  -the advancement and weapon unlocks are kinda clunky and unintuitive, not sure if this is what they wanted it to be, but it sure isn't what I want.   -also another not sure if this is what they wanted, but no lobby or sever list, its just click here to fight GOODLUCK! you dont get to chose who you fight either, so you will be mostly fighting off the EMRAHS CHOSEN over and over again.   When this game was announced WAAAAY long ago, I was into it, but I personally never pre-order or early access games. out of a sense of loyalty to the IP but contempt for the pushed up release, I got it off a key selling site for 30 dollars. get Vermantide instead. its a real game unlike this.  Fast and dirty review, I just couldn't let it go, the devs are asking for positive reviews because its at 68% and thus mixed. The fact that they think 70% is good enough is extremely telling.",
            "review_score": "-1"
        },
        {
            "review_text": "why did i buy this game  why",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a founder and I paid for a MMO. I got a buggy and unoptimized lobby shooter instead.  Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "whatever you do DONT BUY THIS GAME my reasons: 1. It feels like a free2play game (including the obligatory real world currency) despite costing 50 bucks 2. they betrayed their own community by claiming the game to be an MMO and giving them a generic lobby shooter 3. (my weakast point) the game is a buggy mess as of now. yes they did promise to fix that but they promised a lot of things... 4.There are better free2play options to this. yes the ip might be tempting but the game Heroes &amp; Generals does a lot of the things this game does only far better",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game its nothing that is has promised!",
            "review_score": "-1"
        },
        {
            "review_text": "There are only so many times you can be killed by a melee attack from 30 feet away by a Russian before it stops being fun.   Why games with very lethal melee systems seem to insist on not region locking people based on ping I will never understand. Well, I lie. I understand; it is less expensive on the devs end and gives them more audience to which to sell their product. But it ruins this kind of game, and that is a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "What a dissapointment and a waste of money... a lot of players defended this game in the beta state because they had hope that this game would deliver what it promised. Instead what was delivered was a dissapointing unfinished game, guess this is not the Warhammer 40000 that I was looking for. Anyway strap on for some buggy, unbalanced call of duty like arena matches cause basicaly that is all this game is... sad for those that still have hope but I just want to say one more thing 'I freakin' told you so!'  PS: What was even a surprise for me, they inluded pay to win content, like those scoped op real money paid bolters, Chaos be damned that even made me sad... do not even bother with this game",
            "review_score": "-1"
        },
        {
            "review_text": "Broken and unfinished.",
            "review_score": "-1"
        },
        {
            "review_text": "Same repetitive gameplay, game runs way better but bland gameplay in 60fps is still bland.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this on the premise that they were making a Open World MMORPG.   What we got was COD with a WH 40K skin. Oh and there is a there is a territorial map that changes nothing about the game.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is no bad, not close to good either, it is half-♥♥♥♥♥, ♥♥♥♥ing basic, like a lot of warhammer games when putting the 40K seal looks like enough or something.   This is not the game we were promised and even what we have is clunky, like the melee combat (that by the way has auto aim for dummies), the MMO tag in this steam page is a big fat lie, it is just like a battlefield game in third person but with small maps, no air vehicles, 3 land vehicles no customizables, almost no interaction with the map. Overalll has some good moments and some terrible ones (It is ♥♥♥♥ing poorly optimized and buggy), It is like they are selling us a lamborghini and we recieved a fiat multipla,   It gets the job done but it is not what they were telling us, so i can´t reward liying when this is like 25% of what we were promised.",
            "review_score": "-1"
        },
        {
            "review_text": "Half finished game missing most of the promises made to backers.   It's a unifinished arena shooter.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is bad, and it will make you feel bad when you play it. Much like bouts of diarrhea, you'll get washed over with nostalgia of the Warhammer 40k world. You'll get to do things like run around as a Space Marine, doing Space Marine things on giant, terribly difficult to navigate levels which feel like they were designed by a blind person.  You're a genetically engineered super human with three lungs, two hearts and have the emperor's blood pumping through your veins. You drop in with your team, (4 bad asses much like yourself) and run across the battlefield and you start shooting at the enemy with your trusty Bolter, from what would easily be 18' to 24' on the table top. All of a sudden, the [other race, especially Eldar] close the gap in less than 2 seconds and start bashing your head in. You die. Then get executed, cause you can add insult to injury in this game.  You think alright, well, maybe I got unlucky, I'll try being a Hand to Hand guy. Then you get spanked time over time over time by the same guy, who killed and executed you before.   You switch back to your bolter, cause F that noise, and finally, you encounter a target you should beat no problem. An Ork shooting a rifle from the distance. You raise your trusty bolter, and exchange fire. You quickly find out that an Ork wearing leather tidbits, is more accurate, takes more damage, deals more damage than you, and you get cut down where you stand.   I thought I was a Space Marine. Humanities finest, strongest, greatest creation. I'm one of the Emperor's Finest, and I got spanked by some ork shooting some 'dakka' gun from the distance? I turned off the game and uninstalled it. I've been playing since alpha, and if you're a WH40k fan like me, don't play this game.  Please don't give Games Workshop anymore money. Buying this game gives GW an excuse to pump out more trash onto the market, like that Mordheim game. The Bloodbowl franchise. All those Space Hulk games. Don't forget that Total War game. God knows, if they actually get desperate enough they might release a decent game that actually represents the table top accurately. I'm waiting Games Workshop. You can even sell me 10 imaginary Space Marines for a buck and I'll pay for it. Sell me an imaginary land raider for like $3.50.  Remember having fun playing Monopoly on a computer? Imagine how much fun it'd be playing a Table Top version of Warhammer 40k on a computer. Well, this game isn't that. Please do yourself, me, and other fans a favor, and don't buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible Customer Support!  Game wont even load when it hits 100%.  Gave the devs the error code twice and no feedback... Poor Poor Poor",
            "review_score": "-1"
        },
        {
            "review_text": "This game needs alot of work. Developer is great, always updating the game and trying to polish it. But the developer i feel like pressured them to get it out too early. Still alot of balance issues with races or weapons. I have a feeling once they add everything that was promised over time it will be a great game. At the current price and for the content included at the moment there is no way i could recommend this game to even my greatest enemy. If you love WH40k and want to support what will end up being a great game in the future, then by all means. But you should know what you're getting yourself into from the start.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is in a decent Beta-state. But, frankly, I'm amazed they're 'releasing' it in this state, not to mention a full $60 price tag. Caveat Emptor.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible, pathetic, inexcusable. Not an ounce of fun in this no matter how much you enjoy WH40K. Optimisation practically not to be found, so terrible performance while still looking and sounding outdated. Shooter and cover mechanics are years behind of even PC third person shooters. A terrible waste of a license and a huge disservice to the franchise.  Stay away from this.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't believe I spent $60 on this garbage game.  How did they ever get a Games Workshop license? They just patched and it's still a horrible game. I keep trying to play it, and every time I log out ♥♥♥♥♥♥. How is this even a shooter in 2016? Vehicles are completely undriveable. Netcode is a laggy mess. Nothing like the planetside2 which was a comparison selling point for me. As expected, everyone is playing Space Marine so get used to getting decapitated by them. Non-random gameplay modes look like this: Players in Queue: Space Marines 33, Chaos Marines 1, Orks 0, Eldar 0 Dated graphics even on max settings. Chaos marines get a flamethrower that demolishes vehicles in 4 seconds flat... Not sure there is a balance team behind this. Just don't buy it. Don't do it. Save yourself the trouble. The netcode is terrible.  I don't write reviews, but every time I play this piece of ♥♥♥♥, I want to come here and expand on my vitriol. No Man's Sky is a better multi-player game than this...  Update -- still a wreck. Still bad netcode where you get instagibbed by dudes with chainswords.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is still in alpha. There is no persistent world. Orks aren't free to play. The UI feels like a place holder as does the advancement screen. Eldar can currently kill anything with 1-2 hits. The graphics aren't optimized leaving it unplayable to anyone that doesn't have a high end machine. Latency is horrible and causes rubber banding. The over the shoulder third person view is horrible and forces you do play from the right so if you are attacked from the left you can't see anything because your character takes up a third of the screen. Weapons and armor in the in-game store are only for looks and most factions only have a small handful of these available. It's also obvious that this game was made for consoles and not the PC. If I wasn't a die hard 40k fan I wouldn't touch this game with a 40 foot pole :(",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game, if you can help it. I was a founding member, and I regret offering any iota of finance or support to this doomed venture. To offer some credibility, I have been playing 40K as a miniature game since 1998, and playing video games since at least Dawn of War. I would rather play that game, which came out 12 years ago, thank this piece of garbage I got duped into funding. I am sorry to the universe, for the part I played in this tragedy. I actually bought a PC, in order to both further my education, and play this game. I have edited several films, rendered video, played other, better games, but this game I have only played a few, terrible times. Experimentations in seeing if there was any improvement. Seeking out the rewards that were always offered, but never fulfilled. I am done, with that. Beyond the many features that are lacking from the proposed game, progressive worlds, destructible environments, massive battles, there is also, and fundamentally, a total absense of fun. I cannot control my character, let alone care about them, let alone care about the game itself. It is symbolic of the larger decay infecting the gaming industry, that of prefunded mediocrity. For more on that, see my review of Space Hulk: Deathwing. Bottom line? All thumbs down. 0 out of 10, or 5, or whatever rating, or scale. A festering pile of digital dung that wastes both time and energy in the pursuit of failure, itself the only tangible success that can be found among the steaming piles.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this as a founder but what happened to the game being basically a 'Planetside 2 but Warhammer' and Free to Play? Its just an overpriced Lobby shooter, it took me 15 minutes to install the game. but I can literally get qued for a match, walk away, come back 30minutes later and be in the same que. no matter what race. Ive switched races to the ones with the lowest ques and still takes too damn long. This game is Unfinished, the combat is still crap. Except now if you want to play it, you need to spend $50 and if you want that new shiny weapon that looks cool and maybe does more damage then anything you can buy by playing, Go buy some Credit packs and spend even more money. This game is a waste of time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game, not updated, unbalanced and the devs don't care, don't buy this if you value your money.",
            "review_score": "-1"
        },
        {
            "review_text": " Warhammer 40.000: Eternal Crusade is finally launched. Officially incompleted.",
            "review_score": "1"
        },
        {
            "review_text": "Initial Review: As great as I want this game to be, it is not in any state to be enjoyed at the moment. From poor optimization to the unbalanced factions, it's far from being in good condition and could benefit greatly by refurbishing and refining the many game-injuring flaws before putting it up, even for alpha. This game is quite the hive of bugs at the moment. I will continue checking up on the game occasionally and will update my review accordingly, but don't expect it to become a positive reccomendation for some time. Years possibly.  Update 1 (6/17/2016): Despite the Eldar balancing in the latest hotfix, the Eldar are still matched to the Space Marines in all fields of melee combat, and they don't even have Howling Banshees yet. That's kind of a scary thought. It's also a little disgusting that this game already has Steam Cards with all of the work it still has to go on the game itself.  Update 2 (6/19/2016): Melee is still without question the most spammed form of combat, as hitboxes and weapon effectiveness drown drastically in the other areas of combat (aside from grenades). Without a better defense to a melee charge, the game is a smart-targeting melee fest of gladiatorial proportions. Are you not entertained? Well, hopefully they'll fix it so you can be.  Update 3 (9/29/2016): Well, they did it! Full release is out and they even put in the last core race of Orks! They have guilds now, war parties, some appearance options and even additional classes for each individual race, even a co-op mode for non competitive players like myself to enjoy! Cool, right? If only. The one thing they still haven't managed to get right (which has been a pre-existing issue from when it was only Space Marines and Chaos) is a proper melee system. Just as before, this is the form of combat that everyone relies on due to it's arbitration and overpowered demeanor. I tried giving it a saving grace, hoping it's co-op was not as terrible as it's competitive mode, but to no avail. They offer two difficulties for this Tyrannid swarm objective game mode, normal and hard. Only, not once has even normal been achievable by any of my teams. And it's not because my team was too small or unvaried, trust me they make sure you have the maximum and minimum number of 5 players before you are even allowed to get into a lobby. You know, because this game is just flooded with active players and it won't take 5+ minutes for a chance to get into a match. One that you will be evidently doomed to fail anyways. Ironically, the only thing that stems this co-op from being impossibly difficult even on normal, is the heavy number of AI bugs that keep the Tyrannids from attacking you every so often, most prominently the Tyrannid warriors that have GODLY amounts of health for no damned reason. One was glitched and stuck in place and it took a heavy gunner and three rifleman about 2 minutes of full frontal fire with landing every shot to take it down. AND YOU FIGHT THREE OF THEM. Now how much more difficult would that be if it wasn't glitched and instead was mobile, and able to hit you with it's insanely powerful melee strikes and chest rifle? Yeah. Even despite that glitch, the round was still unsuccessful. I stand by my previous updates and statement that this game could greatly benefit from some more time in development. I think NOW it is in proper condition for an alpha release. It's such a shame that they expect it's current state to represent a complete release for $50 no less.",
            "review_score": "-1"
        },
        {
            "review_text": "Don´t buy it if you spect a finished game. This has a lot of potential but is laggy and twitchy. Is really fun tho and I like to put some dollars on a proyect of one of my favorite lores, helping with the bug reports and balance stuff. Hope when is launched we can all offer our best and you can enjoy a good warhammer 40k game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm an early backer. It's a fun game. It's not the game I purchased though.  I also don't feel like the game is in a proper state for a $40 fully released title.  Honestly, unless you are a 40k fiend, skip this. At least until they fix the game and flesh it out.",
            "review_score": "-1"
        },
        {
            "review_text": "I remember when I first found Eternal Crusade - Came quite a long way, great job guys, love the game.   I look forward to seeing how this game develops. Thank you again for doing justice to one of my all time favorite game series.   AND IT RELEASED!  Honestly I thoroughly enjoy this game, while it's still rather unpolished in certain areas, and unbalanced in others. The love the game developers have for Warhammer 40k is obvious, I am always having fun with this and I always look forward to anything new regarding it.  They work very hard, and already this is far better (personal opinion) than a fair few fully released games, and it will only get better I'm sure.    I love this game, love the community, and love the atmosphere - and it's awesome when people speak like Orks, or Chaos in voice chat. It's fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "I was disappointed when they changed this game to instanced battles. I was very excited for an open worked mass combat. Thats not what this is.",
            "review_score": "-1"
        },
        {
            "review_text": "The moment these guys fired Miguel and brought on Nathan. The hardcore fans of the title already knew that the game was gonna go to ♥♥♥♥. But people remained hopeful and were in complete denial. Well, boys and girls. Here it is. The game you've all been waiting for. I can't believe I paid for a $120 founder's pack from the start.",
            "review_score": "-1"
        },
        {
            "review_text": "What a letdown, I was so pumped for this to be THE warhammer game that did it right. They had everything going for them, good open discussions, weekly newsletters while game development happened then it turned to ♥♥♥♥. They have none of the features they advertised and released the game as a lackluster Space Marine clone with less features LOL  Just wow. Don't waste your time and money and steer clear.",
            "review_score": "-1"
        },
        {
            "review_text": "not wherth £31  £15 yes not £31+ i see a pattern of over promising then coming up with excuses makes it look like you're going to pump it for money then drop it in a year or so",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing 'Massive' about this game. Unbalanced as hell. Not fun enough to justify spending this amount of money on it. Move along brother.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is in a harsh unpolished state. It got pushed out early and I have a feeling it wasnt the developers intention to do so. However for having a playerbase of people who ♥♥♥♥♥ and whine about every little thing, they still play the game for hours and hours of intense combat enjoyment!  It needs alot of polishing, but I have no doubt it will get there and beyond, it is not an open world, but it is a massive instance 3rd person shooter with one of the best themes of all time. You wont care about open world when your clanging chainsword with powerclaw trying to rip the head of the damn ork. Or chasing down that pansy Eldar wondering just what they do to get their tuchus in such a good shape. I mean is it Pilates? OH WELL! Bolter round to the back!  Overall: Great concept, FUN game, released waay too early.  Tips for New Players: Play the objectives, not the kills. Dont snipe, the games about push. Find a guild, this game relies heavily upon teamwork to hit objectives, hold objectives, and cosntantly flank. You can change squads, if everyone is running around with their head cut off, but you notice one group sticking together, join that squad, move with them and learn what it is they are doing.",
            "review_score": "1"
        },
        {
            "review_text": "Tought its ♥♥♥♥♥♥♥T buy now when you have a CLAN its GOOD but still no enought content for this game overall price is a HIGH for what is offering need more updates",
            "review_score": "1"
        },
        {
            "review_text": "Ill state first that I am a die hard 40k fan, like many who enjoy this game. I do find it fun, but this is huge but, this is not what was promised it is as totalbiscuit once said, an ocean with the depth of a puddle. I mean to say that yes this game has that lovely 40k paintjob and all the cool customisation that comes with that, but the game itself is awful!  I bought one of the founders packs I followed this game when it was first annouced and the poor state this is in right now hurts my soul as not only a gamer but a 40k fan. THe game is broken, flat out broken. Obviously right now orks and eldar have just a flat advantage with higher rates of fire and better melee, whilst marines of both factions struggle to keep up. When your looking at games where the eldar have in excess of 10 times the kills your team does then theres something wrong here! Where we out played, possibly but nothing justifies that kind of kill difference it doesnt. The fort mode is a grind fest, it really is, killing vehicles takes forever and I have never seen defenders win, ever, its so hard to kill any vehicle especially the rhino which just parks there and act as spawn points I mean when a rhino takes like 5 lascannon blasts to kill...why bother? yet you need to kill them or the enemy can spawn right on top of you. But again getting anti tank weapons requires another grind!? why!?   Ive never written a review before that might be evident in the jumbled mess above, but anyone who wants this game right now, do not buy it, it is not worth £40 its not. This is coming from a die hard fan of the lore, I enjoy the game but i cannot even begin to think about saying to my friends buy it. I havent even mentioned the broken servers and terrible performance, I think ive been lucky as I rarely run into these problems, but I know it makes the game impossible for some.  Ill also add this game has robbed me, it has I have purchased rogue trader points through steam that I have not recieved, how can any company take money and give you nothing? I have reported this to both steam and the devs I hope it gets fixed, but when I cant even support the game without being gut punched why would anyone buy this?",
            "review_score": "-1"
        },
        {
            "review_text": "FOR THOSE WHO ARE WORRIED ABOUT A $40 PRICETAG AT LAUNCH AND A LACK OF CONTENT READ THIS!  I was part of the founders program before it even launched to early access and has been with the game through most of its developement. In all the livestreams the devs do every week for the past year, they have spoken of releasing FREE EXPANSIONS EVERY 3 MONTHS after launch.  In a recent news email and news post, the lead game designer detailed how CONTENT THAT HAS NOT BEEN ADDED AT LAUNCH WILL BE ADDED IN A FREE EXPANSION after launch. Nothing has been cut, there will be no paid dlc's that add a scrap of value, just maybe a cosmetic dlc if the publisher wants one.  I hope this gives you an idea of what content will still be added.  P.S. STEAM LEAVE MY REVIEW THE F*** ALONE",
            "review_score": "1"
        },
        {
            "review_text": "It recently became apparent that this game will never be what it was originally pitched to be. What a coincidence, I bought long before steam release and now I'm not able to refund. Almost 35 hours of running around thinking 'I hope this gets better'. It won't.  5/10 for a shooter",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a buggy, laggy mess.  The discription says 1000's of weapons and an MMO. Nope, none of that is in here.  The game is clunky and not represented in the trailers.  I was going to stick with it, but this morning I logged on and all my character data was gone, as well as the in-game currency I spent for the character.   I was supplied the currency for free for buying the 50$ game. But the page fails to mention that NEARLY EVERY GUN and item is locked behind a paywall of some sort.   So when my data was deleted and they wanted me to buy more in-game currency to replace my lost items. No. In fact steam should open an inquiry into the game and force them to change their steam page to represent to product accurately.",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine you are abroad needing to have your car repaired.   They charge you up front. You don't haggle, because you've been raised in another culture. In the workshop it turns out more parts need ordering - so you need to pay more (otherwise, they can't put your car back together). Once paid, the parts arrive 'instantly' and the engine's running, however some things inside are still not fixed. The owner just shrugs [insert chosen accent]: - 'It's working, where problem?'. You'd like to complain exactly what's wrong but it seems they don't understand your language.   Well this experience is like that. If you want to buy it: wait for the price which is right for you, ask up front if features you want are there yet, the netcode, servers... and don't accept an evasive answer.    (* To be completely fair, in any shop there will be the guy who prefers sticking to the wrench than talking, knows what to fix and how long it should take to be good. This is not the guy you will be doing business with.)",
            "review_score": "-1"
        },
        {
            "review_text": "Before I start this review, I wouldn't call myself a hardcore Warhammer fan, mostly because people are trying to get 'hardcore' fans to leave positive reviews whether the game is good or not. Because I'm not one of these fans, I will review this game on if its actually good or not.   It isn't, for a few key reasons.   For the record I'm also a founder.   Also note my time played, this game is more of the same, in that you wouldn't need 200 hours in Team Fortress 2 to write a well-informed review, just a few matches. Either way, feel free to take this review with a grain of salt.   I bought this game because it was initially advertised to be essentially Planetside 2 but Warhammer 40k themed. The arena shooter bit was supposed to test the engine and gameplay itself while the larger 'warzones' would be constructed. The idea seemed pretty good to me, and I liked WH40k Space Marine so if it was going to be ANYTHING like that it'd be a pretty good buy for me.   The thing is, it wasn't. I played a couple short games in the early alpha thought it was ok, and shelved it for when the full release came out.   Between then and now, the devs changd their minds and said the game was going to stay an arena shooter and the races would fight over territory like you would find in certain MMOs (Like world of tanks) except you don't really get anything if your race wins as far as I know (Please correct me if I'm wrong). Also according to community members who did more research than myself, say the whole Planetside thing wasn't the only major component that got scrapped, like the free to play aspect that only includes Orks (because they're Orks).   So lets say you don't care for the past or future of this game, you want to know if you bought this game that you'd have fun or not, I'd say not really mainly because th community for this game is pretty much dead even after its 'release' and because of that some maps seem too big to play without any kind of communication or with a low player count and the people you'd play with would more likely be the people that have played for a while that has stronger weapons then you do, actual equipment as opposed to a new player's empty slots, and knows the game a lot better then you.   Oh, and theres a premium currency that not only can buy early unlocks of weapons, but the premium versions are better than the standard ones (Even if its a slight boost) some weapons have unlockable versions with different boosts, but those weapons are very few.   People want this game to get positive reviews because both Warhammer and its 40k counterpart don't see many (good) games, however the success of the franchise depends on good games, not people supporting bad games so good ones get made.    tl;dr, This game has an enormous amount of potential, but wasted it by turning it into a dime-a-dozen arena shooter thats also dead on arrival. Also has small pay-to-win elements for a $50 game.",
            "review_score": "-1"
        },
        {
            "review_text": "They said the game was already fully funded 3 years ago when they announce the diffrent packs people could buy. The New sponcership says otherwise. They are removing items and features that they promised 3 years ago and with the original Dev team jumping ship I don't see anything they was originally promised ever happening. This is a Planetside 2 reskin not this new amazing MMO they we where all promised.  *Launch Edit* HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA who in their right mind would call this a finished game?",
            "review_score": "-1"
        },
        {
            "review_text": "pacman, alien invader and tetris is more fun then this",
            "review_score": "-1"
        },
        {
            "review_text": "Is this game worth your buy? in my opinion yes, it is a very fun very cool warhammer 40k shooter, with combat based upon that of warhammer 40k Space marine.  Now if you look at all these angry and dissapointed steam reviews, about not getting what is promised, you are probably seeing people being dissapointed, because they did not get what was promised, now here is the thing, I became a founder about a year ago, the devs have been very clear in what they are developing and were very clear when the release date was announced.   They stated why the game is released in this state and also stated why this would be better.  simply said, by releasing it now, instead of over 2 years when everything is implemented, the game can live on, with a greater community and more feedback. I can agree with this, releasing the game now isn't the most stable of choices, but then again 2 years of development hell isn't either.  The game is supposed to be supported for a long long time, improving and adding along the way, they even had a flowchart for this.  The devs stated that this was their idea, free updates and new stuff along the way. I like that deal a lot better.  The game itself in it's state is fun, it feels like warhammer 40K and it looks amazing, combat like I said is based upon that of Warhammer 40K spacemarine and added upon, making it a rock paper scissors kind off melee combat.  4 factions add a lot of different battles, but there still needs to be some balancing done, orcs are very squishy and eldar while squishy are intense in melee combat, space marines at the moment are the weakest faction.  This game had a lot of potential a year ago and a lot of potential has been achieved and a lot of the promised made are fullfilled and some are yet to be fullfilled.  This games is in my opinion the closest thing to full on war in the 40K universe and I recommend it to all the 40K fans out there.",
            "review_score": "1"
        },
        {
            "review_text": "WE TOOK IT FOR DA ORKZ!! ORKZ ORKZ ORKZ!  Edit: This game is great, needs some gud ironin' that's all. Maybe give less spikey bitz to dem humiez. (Haven't played against eldar as Orkz, but I'm going to assume it's just 20 minutes of head ache and then a loss)",
            "review_score": "1"
        },
        {
            "review_text": "EC had bumpy release, but the last couple of patches, hotfixes and content patches have the game going in the Right Direction.   The campaign in being flesh out more and more. There is going to be a motive for fighting for Arkhona other than killing Mon-keigh and Knife ears.  For those Still on the Fence Wait till end of this year or around 2017. That's when Elite Units and Mission will be dropped.  If you are one of those that can't wait any longer just use Steam refund policy (Play less than 2 hours / 14 days in library), Although 2 hours is not enough to judge a game you'll get the general feel about it.   I hope to see you on Arkhona soon™!",
            "review_score": "1"
        },
        {
            "review_text": "It is an enjoyable game if you like the over the shoulder kind of shooter/melee style. The game has been balanced alot since release and it still needs some more tweaks imo. Melee classes are currently quite powerful so if you prefer to be at range make sure to have someone guard your back or you will probably be jumped by a melee character.   The character progression system where you can levelup and make customizations to your wargear is very nice but even here there are issues. For instance there is no check that make sure that when you get to max level that you have enough points to buy the last skill so make sure to select all the veteran classes before finnishing the skill tree or you might miss out on the veteran gear slot. (still missing 2 points for my first lvl6 char)  The devs seems to be good at fixing exploits rather quickly though, only once did I start a match where there was 14 ppl on my side and 56 orcs on the other...  The maps are well made and very warhammer 40k there is usually more than one way to get to most places and several avenues of attack.  If you don't like to win skip this part: Like most games learn to play your role and stick with your group goes a long way but you will not win the battle unless you also play to the objectives. Most obvious is that attackers get 'extra' time when an objective is captured for the first time. So defending a point that hasn't fallen yet has higher prio than defending one that has been recaptured. Also taking out transports (mobile spawnpoints) is always a good thing.  Pros' No game is longer than 30min so perfect while doing laundry! Lots of different ways to play (melee, support, ranged, heavy, mobile/flying). Play all factions with same account Wargear Customization  Cons' To many instant kill weapons, and there is little you can do when that ball of plasma hits or you get a poison chainsaw in your back. Only one game mode vs computer. No story, only war No zone progression yet (but seems to be in planning).  I would recommend the game to those that like Warhammer 40k and especially if threre is a group of you that play together.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, let's get two things out of the way:  1. Is it what they said it was going to be on launch?  No, it isn't.  2. Well if they lied, why the dickens are you giving it a good review?  Because it's a fun game.  It plays like Space Marine multiplayer should have, with 4 distinct races that all have their own balance and feel, with 5 sub-races that all add flavor to those existing factions. I found everything that this game is to be excellent. With the continued support of the community and devs, I still think it can reach those lofty goals it set so long ago in pre-alpha.  They really should change their game description though, it's really innaccurate as to the current state.",
            "review_score": "1"
        },
        {
            "review_text": "I will be honest, this game had a terrible Early Access period. Things were rushed and half-♥♥♥♥♥. The game looked like ♥♥♥♥♥♥♥♥s. Balance was out the window. It only achieved 'Feature Complete' a week ago. I really thought this game was going to crash and burn. It just wasn't worth the $40 throughout that entire time. It was a $20 game with delusions of grandeur.  But after all that struggle and hardship...it kinda became a good game, out of nowhere. It feels like a $40 game now. The mix between ranged combat, melee, and vehicle combat is getting just right. The graphics between last patch and this one are literally night and day. The battles can be pretty damn epic at times.   There are still flaws. Balance is just a tad bit off, but it's about 90% right (don't listen to the forums, they think the sky is falling every patch). There are some minor UI bugs/loading hitches. One or two weapons need some bugs fixed. I would say that all the bugs and balance problems are the kind of thing that can be solved in that 'Post-release 30 day honeymoon period'. The kinds of bugs where it shows that they rushed release, but don't break the game. So if you're really on the fence, give it 30 days after launch.   The best way to describe the game is a 40k Gears of War clone on crack. If you like 40k, or if you Gears of War, or if you like crack, you will like this game. If you've played Space Marine, there are a lot of similarities, but much more depth and much bigger scale.",
            "review_score": "1"
        },
        {
            "review_text": "  The 'tutorial' was a giant area with no direction. They didn't teach you anything unless you went and FOUND the floating skull with the information you wanted, and even then it had about as much information you could fit into a twitter post.  Although your characters are persistant, the world is not. This is a Third Person Arena Shooter. A bad ripoff of Gears of War with a Warhammer 40k skin on it. This is not an MMO. This is not worth the asking price.  I died a lot from teamates shooting at someone I was engaged with, Grenades that have no marker on where they land, and people with better loadouts and higher levels just kicking the crap out of me. I did not enjoy this.  I was lucky enough to get this game as a gift, But after only 21 minutes, I told my friend to get his refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game and there is more to come in the future. People want to hate on it because it isnt planetside 2. ♥♥♥♥ those people. Probably the same people who ♥♥♥♥♥ about every early access that doesnt cater to their every needs. The game is a lot like Space Marine and thats a good thing. If people cant handle the type of game it is then they should just get a refund and move on. We dont need your toxicity in Eternal Crusade. The community is great as it is, dont poison it with your hateful posts on the boards, forums or reviews.  P.S. Im sure im going to get downvoted to oblivion for liking something other people dont.",
            "review_score": "1"
        },
        {
            "review_text": "This game is made of lag and broken physics. I really had high hopes but this is just terrible. It's not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "other reviews tell why this is bad",
            "review_score": "-1"
        },
        {
            "review_text": "Its fun, flat and simple. I've had a great deal of fun playing as different types of characters from the WH40K universe and will continue to do so for some time to come.",
            "review_score": "1"
        },
        {
            "review_text": "Do I like this game? Yes. Do I think this game was pushed to 'Launch' Far, Far, Far too soon? Yes. Does this game lag, have bugs, have optimisation issues, and clunky controls that take some getting used to? Yes. Does the game have balancing issues? Yes. God yes. The World Map is a pretty good indicator of which factions are the strongest overall. Does this game still provide a fun, super-fast-paced, lore-rich pretty immersive experience third person MMO shooter? In my opinion, yes.  Don't get me wrong, this game is nowhere NEAR a 'Launch' stage. Much like other games that have 'Early Access' slapped on them, this game gets pushed out of EA too soon and the game's reputation suffers. At the same time, if it stays in EA too long, its reputation will also suffer. This is Steam.   Firstly, the slogan 'Thousands of Weapons' Is a bit off. I'm going to give them the benefit of the doubt and assume they mean thousands of weapon combinations. Weapon customisation is a big thing in this game; nearly every weapon has slots where you can put things into, from scopes to muzzle breaks to bigger magazines to chainsword blades, etc. There are two types of currency; Rogue Trader Credits and Requisition. Requsition is locked to individual characters and is how you unlock the majority of new weapons and supply boxes, which is how you get everything from weapon upgrade pieces to master-crafted weapons. Rogue Trader Credits is simply the premium currency; it's how you buy shiny cosmetic things. And pretty weapons. Yes, you CAN buy weapons such as a power sword or a plasma gun for RTC.  BUT.  These weapons can  NOT  be customised; they have no modification slots. For the large part, they're mostly just pretty versions of normal weapons, with a few exceptions.   The Four Factions thing is pretty self-explanatory; there's four playable factions, Orks, Space Marines, Chaos Space Marines and Eldar. All of them have five sub-factions (Chapters for Space Marines/Chaos Space Marines, Craftworlds for Eldar and Clans for Orks), with most of the big players sub-factions represented. All of them have Infantry, the only class that can capture objectives (Tactical Marine, Traitor Marine, Dire Avenger and Shoota Boy), Heavy Weapons, that lug about anti-infantry or anti-tank weapons (Devastators, Havocs, Dark Reapers and Lootaz), Jump Assault, which have jump packs and are a barrel of fun. Eldar have a slightly different 'Jump' unit, that can glide around instead of bounce around (Jump Assault Marine, Raptor, Stormboy and Swooping Hawk), the Support Class, divided up into two types who apply potion vials to heal/buff their allies (Apothecaries and Painboyz), and the other two who can use proper magic both offensively and defensively (Warlock and Aspiring Sorceror), and the Melee asssault classes, of which Eldar get two (Ground Assault Marine, Traitor Assault, Choppa Boy, Howling Banshees and Striking Scorpions. These classes all get a pretty decent variety of weapons and skills, allowing pretty much any of them to do anything.  There are three vehicle types, divided up into Transports, Tanks and Ordnance. Transports are pretty self-explanatory, Space Marines and Chaos Space Marines get their respective  METAL BAWKSES  Rhinos, Eldar get Wave Serpents and Orks get Trukks, all of which get anti-infantry weapons. Tanks are tanks, Space Marines and Chaos Space Marines get their Predators, Eldar get Falcons and Orks get.. err.. Gunwagons. All but the Falcon are practically the same; the Falcon gets a stronger weapon that one-hits infantry, but has a charge up. Also, the sound of Autocannon gunfire is as terrifying as it is lethal. Finally, Ordnance is the anti-fortification classes that are only available on certain maps. Space Marines and Chaos Space Marines get their Vindicators, Orks get... I forget what they're called but they're ♥♥♥♥♥♥♥ised Vindicators and Eldar get Warp Hunters. A fully-manned predator is terrifying, when the autocannon, pintle-mounted storm bolter and both sponsoon-mounted heavy bolters are firing away.  In terms of game types, there's various map types that are all different types of capturing bases on a variety of different maps for PvP, and the PvE is Tyranid Lairs, where you assemble five players to go clear out a sector of Tyranids in a Warframe/Destiny sort of style. The slogan of 'Free Expansions' Is something I hope they'll stick to.  Overall, would I recommend this game? For $50, maybe not, but if you see this on sale and you love Warhammer 40k, give this game a shot. Hopefully, it should only get better.",
            "review_score": "1"
        },
        {
            "review_text": "Just won't run....",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not what it claims to be.  It is not finished and lies about most of its features. Back off for now and wait for when they actually complete it.",
            "review_score": "-1"
        },
        {
            "review_text": "Short and sweet review. Played for quite a while now, had my doubts about the launch but it is a solid game that will fill your 40k shooter itch. Need some polish but the core game itself is fun to keep me coming back.",
            "review_score": "1"
        },
        {
            "review_text": "Too many hours to count, had very early Alpha before it transitioned to Steam:   This game was laid out with some VERY ambitious goals, while it hasn't met them yet, looking back at what this game was in Alpha and where it is now is very imrpessive. So here we go:   Chances are you're likely a Warhammer fan if you're looking into this game, and if you aren't that is OK too, but you're wrong and I hate you. As far as Warhammer games available this is hands down my favorite and does a better job of making me feel like I'm playing a Warhammer universe than Warhammer Online ever did. That said, it is not an MMO and it isn't a Call of Duty shooter. I would liken it more to The Division, with Power Armor....and tanks.  -The combat mechanics have come a long way and the developers have continued to tweak and improve. Sometimes they take a step backwards and the community lets them know in which case they usually take two steps forward.   -The graphics really are incredible (I recently bumped up to a GTX980 after playing this during Alpha on a 780, this made my eyes happy).  The price is a little high, I honestly think it should have been aimed at $39 for what is currently available, however they have a LOT of planned free content, so if that all gets delivered I feel it would be well worth it. (I mean ♥♥♥♥, I did completely waste $60 on that steaming pile No Man's Sky, this game is WAY more enjoyable and has developers who actually interact with you and don't blatantly lie while acting clueless on twitter.....so that's a Pro).   All in all, Eternal Crusade is a fairly decent shooter, if you're a Warhammer fan, it's a gift from the Dark Gods shooter.  It's fun, I threw in $250 for a founders pack at it's inception because the vision of this game was the game I've always wanted. So do I think you should buy it at $49? Yeah, but that's just my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Camera is fixed to the right. So strafing left around a corner leaves you blind. Also couldn't use the mouse any keyboard and I don't feel like spending hours troubleshooting. Refund.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has had its fair share of bumps and bruises but the dev team seems to actually care about the product theyre relleasing and are planning on making it better and better. I look foward to playing this game for a long while and recommend everyone to try it out.",
            "review_score": "1"
        },
        {
            "review_text": "This is not an MMO, this is not open world, however, this is an extremely fun game. The battle is the main thing in this game and it is pretty damn fun. The devs are working to bring more functionality to it, so I guess the MMO open world parts will be there later.",
            "review_score": "1"
        },
        {
            "review_text": "-BETA-  If the game ever runs better then 10 FPS this will be one of the best games on Steam and THE best 40k game for sure. For now trying to move your char at 10FPS is just funny, though I still got a few kills! I killed a tank then it blew up and killed me to :(  I am waiting for the Eldar to unlock then you shall all fear the power of the great Lato! But for real only get this game if you want to support the devs cause it runs like dogshit now. I still had a lot of fun playing it but Space Marine beats this game on EVERYTHING! So I hope they keep adding to it and make it great. Worth the money.  Eldar update - The game crashes alot lol. Just WAIT to buy...  -Finished Game-  Ok so people are mad.... The score went from liked to $%^ it seems people thought this game would be open world? The dev teams work history should have told you better then that.  The game has about half the content promised, however I was not here from the start. I just wanted a game where I could play a sexy Eldar chick and run around killing ppl. That is what I wanted, that is what I got!  The game runs a bit better then on Beta, the sound cuts out every 5 min for some reason, ppl say Eldar OP but I play only Eldar and win 50/50 games so I don't really know about that.  Its a good game but looking at the people Qed for the matches the numbers are so low it has me worried....  Still I like the game, was worth the money to me.",
            "review_score": "1"
        },
        {
            "review_text": "If you are even on this page chances are you are a fan of the warhammer 40,000 universe. And as a fan, there is a lot you will see in this game you will like. The classes, weapons and vehicles are faithfully represented from a lore perspective. If you want to play an Eldar Swooping Hawk, flying around the battlefield and harassing opponents with your lasblaster, you can do that. If you want to play a Chaos Aspiring Scorcer flinging warp magic and swinging around a force sword, you can do that. If you want to play a big burly ork with a power klaw tearing through infantry, you can do that. There is a lot to like here....for fans of the franchise.  If you are not a fan of this franchise, I'd say there are better games you can spend your 50$ on. Because without the familiarity of the characters and setting and the desire to have this kind of game for 40k, you will not be willing to put up with the unfinished features, the bugs, and the balancing problems. It's obvious this game was released a bit prematurely, as several core features are not in place or seriously lacking polish. But I've been active on the forums and watching the Dev Live streams for nearly a year and they are very passionate and capable people. And I'm confident they will get this game to a better state.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, so this is my post-release updated review.  As you can see 200+ hours. Both prior to launch and after.  At launch, the game was a disappointment, it was nothing like it should have been, after years of development, all we've gotten is more and more disappointments, one after the other, a constant downgrade of the original concepts, plans and ideas. Even after developer changes the game kept going down hill, only with very vague explanations as to why and what they're planning to do. Eventually the game was announced to release within a month... during its alpha build where not even half of the content that was actually in was final. Animations, visuals, effects, UI and so many other things half-finished or even less than that, with a month to go until launch. We all kept our hopes up and waited, assuming the devs would overhaul the game at launch, as if all this time they were tricking us and had something up their sleeves... they didn't.  So the game launched and it was terrible. It was bad on every level. There were older builds of the game that were more stable and fun to play. It was a mess..  The devs assured us it'll get better....  So whats changed? So what has improved? What is better now?  Well... not much... and thats the reason why I cant recommend this game.  I am a huge 40k fan, I followed this game from announcement, I've spent hours on the forms  and still do. And contrary to popular belief, I'm not just a 'hater' or 'troll', I dont want to ♥♥♥♥ on this game, I dont want to call this a disappointment, but I'm not going to lie to people about what EC is.  Its a bad game that isn't getting any better. Content updates bring little, with minor changes that bring more bugs and issues, fixing very little, whenever something good happens, something worse comes with it. Its now 2+ months after launch. And it still hasn't changed much compared to launch.  The lagg is a tad better. The frames aren't as bad. Some weapons are slightly more balanced.  But thats really it. And that isn't much.  Gameplay as a whole still feels terrible. Shooting mechanics feel bad. Melee feels terrible. Melee mechanics are terrible. Melee barely even works half the time. Vehicles are still terrible. Weapon balancing is still terrible. Visuals are still terrible. Character models are still terrible. The store and progression system is terrrible. UI is ok... but thats all it is, its ok, it functions, its not good, its not bad, it just functions. Lighting is bad. Map design is bad. Objectives are boring. The new 'campaign system 1.0' is terrible, I dont think anyone actually knows what to do with it, its basically just a secondary way to quick join a match.  Honestly, I feel the only reason people still play EC is simply because its a 40k game, currently the only 40k game where you can play as Eldar and Orks, the only 40k game of this genre, but thats really the only reason, a few people might be having fun with it, but from what I've heard from them, they haven't played any game romotely like it, this is their first melee heavy game, their first 3rd person shooter, their first vehicle combat game. So the very people who are praising this game, have nothing to compare it to.  Regardless of how many awkwardly bad jokes producer Nathan makes, nor how vaguely he explains the development plan, nor how much fanboys try to white knight the game because they cant stand people not liking it. EC isn't getting any better, not for a very long time, currently it has around 300 average players and fanboys are acting like thats healthy... no it isnt you fools.   I wish EC was something more... but it isn't, it wont be, it cant be at this point.  There are better games out there, soon there are going to be even more 40k games, just wait for them EC isn't the game you wanted, nor is it the game you should bother yourself with.",
            "review_score": "-1"
        },
        {
            "review_text": "▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄  ████▌▄▌▄▐▐▌█████  ████▌▄▌▄▐▐▌▀████  ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! Been playing it for about a month now. Most of the bugs I have seen in this game get patched quite quickly, and I have been loving the devs :D Visuals are very good, gameplay/combat is ♥♥♥♥♥ awesome. Vehicles are pretty meh right now, and the game is pretty much an instanced 3rd person planet side-like, with capture points and defending/attacking. I think you should definately give it a try, good luck out there hop this helped!",
            "review_score": "1"
        },
        {
            "review_text": "this game has improved a lot since it first appeared here on early access. it still needs work but it's actually pretty good now. $50 is steep IMO (it was discounted if you bought early on) but it's definitely worth buying when on sale if you like warhammer and have a good enough PC to run it or at full price once they polish it a little more",
            "review_score": "1"
        },
        {
            "review_text": "Disregard most of the negative reviews Except for the ones complaining about optimization which is a major problem. Many of the negative reviews are based on what the game was originally pitched as to what the game is now. And while it is disappointing it isn't at the stage we originally thought it would be at, giving it a negative review solely on that when founders were informed multiple times that this would be the case is rather dishonest.   Pros 1. All the guns feel fun and and responsive.  2. Every race feels unique and has it own ups and downs. 3. The classes feel different and unique. 4. Maps are huge and each battle feels like a war.  Cons 1. The lag can ruin melee completely. And know one seems to know what causes it. I've seen people with 400 ms hit every single attack while someone in the 30s and 40s hits an eldar 4 times with a power first and none of the hits were read. 2. Eldar are over tuned right now making them unstopable in melee and their small hit boxes make them hard to hit with ranged. (Which they are also quite strong in as well. 3.Alot of the coolest skins and cosmetics were limited availablility and were only available when the game wasn't even playable. So yes while they actually do have over 1000 weapons AND upgrades half of the weapons are owned by less than 200 players.  This is just a nit pick and it doesnt happen often. But the plasma cannons sometimes shoot invisible shots. Considering a fully charged shot is a 1hit ko when it does happen you are prone to scream.",
            "review_score": "1"
        },
        {
            "review_text": "I implore you to wait for Deathwing, or hope this game pulls a BF4 and saves it's own ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "still runs poorly, still looks ugly, still about $35 too expensive",
            "review_score": "-1"
        },
        {
            "review_text": "A cautious recommendation to buy when on sale if you like team shooters and Warhammer 40K.  I enjoy this game but it is a pretty odd combination of relatively slow movement and fast kills.  Graphically it looks the part, sporting all the visuals you would expect from a Warhammer 40k game. Gameplay is not as fast paced as the Multiplayer mode of the Space Marine game, although the maps are larger and more open. This gives it a good sense scale.  Currently there are two game modes. PVP and PVE.  PVP is where you will find most of the players and all the action. Maps are either capture and hold or sequential capture points. The second of these does a really good job concentrating a lot of players in the same area. Expect to see epic carnage worthy of the 40K brand.  PVE is a rather woeful take on Space Hulk. The problem comes from not being very exciting combined with the problem of friendly fire. Put 5 players in a tight space and then throw Tyrannids at them and it's a recipe for disaster, at best you get a lot of team damage, at worst you get team kills.  Combat is a bit of a mixed bag. You won't be sniping people at great distance because of shot dispersal. Considering how quick you can die it's perhaps not a bad thing, many shooter games are tedious sniperfests. Melee attacks are downright annoying, in my opinion at least, due to the stuns. With friendly fire on (it's on by default with no choice to opt out) you will often end up damaging or being damaged by teammates. Vehicle weaponry is basic but functional and quite easy to use.  Performance wise I wasn't getting great ping from the UK. However the speed the game is played at means it's not always a problem.  In the end this game is neither the greatest shooter of all time nor is it as dreadful as some folks are making it out to be.  If you are prepared to give it a chance, get it on sale and you may enjoy it. Not every battle will be epic, but the ones that are will make it worth your while.  6/10 a some of the time  40K/10 when you get a good battle",
            "review_score": "1"
        },
        {
            "review_text": "I have spent a lot of time enjoying this game .Though I don't think anyone who is not a diehard 40k fan would,at this stage anyway.The main con about this game at the time of writing this review is performance. I have moved from a gtx 760 to gtx 1070 and I don't see any major improvement!!!! Other than that the servers are behaving wierdly players seem to be teleporting around in close range combat.  edit:patch 24 fixed most of the performance issues for me.Im getting stable 45fps at 1440p ultra settings.Melee still seems to be prone to spamming though ,im getting spammed fast attack even through the parrying blow.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR:  If you want a fully featured and polished game with the bulk of it's content done then don't buy, the game is not finished but if it continues then it should be a great experience for new players.  If you would have bought this in early access and are ok with waiting for things to be developed you could buy it, but still £40 is steep maybe wait for a sale or more content.  If you are skeptic about the issues people keep talking about but think the games looks cool then check if my review addresses any of those issues, also check the dev twitch streams and hit follow to keep up with the state of the game.  I do think some of the statements in other reviews are completely false or things people should have known if they researched the game at all, I had no surprises going in and I still had fun and plan to keep up with how the game is getting on.  Is it the future and the issues I address are ever present and chaos has won? Don't buy, it will make you a heretic.  REVIEW  I am recommending this based on my personal experience, I have had some problems but overall the games is fun and I think in time will only get better.  I bought the game about a week or so before the full launch. Before I bought it I followed some of the live streams that the devs do every friday and watched gameplay and had a friend tell me what he thought.   At first I was very skeptic as I could tell that this was not a polished product and one of those come along for the ride with the people behind the game sort of deals.   One of the things that pushed me over into buying it was the dev twitch streams, they are a very good insight into what the people behind the game are thinking and planning.  Personally I enjoy the combat, the melee system is a cool idea and it's really fun to start shooting someone to then be able to go into a knife and pistol fight, I have had some really cool moments with this.  The teamplay is great the guilds are trying to get people organised and you can really tell that squad play is the focus.  If you are skeptic about the game I will try and address some of the problems.  Server issues: I live in the UK and haven't seen a game where I have had more than 90 ping, do I still see lag? yep. Does this break the game? Not for me. The lag can get bad but most of the time you will be able to play it like any other game. This has been addressed by the devs as load on the server which either means something with the game has to change or the way they host the games has to change.  Micro-Transactions in a full priced game: Yeah you can spend money on Rogue Trader Credits (RTC) and buy some guns that come with attachments and nice skins but they still have the same stats as what you can get by customising your loadout which you do by getting new items from opening crates with requisition(The free in-game money), the crates cost from 1000, 5000, 12000 and 30000 when I'm writing this and you can easily gain a few thousand in a single match and items come easily, I got 7k from one match in my recent playtime. As for the full price of the game, it's basically you purchasing the game and a season pass to all major content in the future, this is how they plan to provide free expansions with the micro-transactions helping but not getting in the way of gameplay if you want to act like the store doesn't exist then do so and it will not affect your gameplay apart from how you and your weapons look.  Balance: Yeah this is true there are things that need ironed out but the reason this doesn't put me off the game is because I read the patch notes and I see what the devs are saying and balance is still very much being tweaked right now.  Broken Promises: I remember hearing about the game in early stages and thinking, nope they will never do this ♥♥♥♥ it's another huge promise that will never get fulfilled, turns out I was right but this is another thing that was addressed in the dev streams I watched, they said that they were suppose to be able to do it but whatever platform or tech that was suppose to allow it didn't work, can't imagine what that spanner done to the works but either way anyone who bought this would have known that it was not planetside 40k after looking into it for a small amount of time.  Performance: Not sure on this one I have ok performance on a high end machine and a guy in my garrison said he was playing on a laptop and that the recent patch had made it much better for him so I think that stuff will get sorted but the devs have mentioned that because the game is on the newest unreal engine that old computers are gonna feel the hurt.  No Mans Sky 2.0 and Little Content: .....It had to come at some stage, no this is not a No Mans Sky situation, the devs have literally streamed the game and plans for weeks now, it's all sitting on the internet you could have looked at the state of the game before purchasing the game isn't hiding anything on you. Content wise, yeah there aren't thousands of items I can see but most are in the crates you unlock with the free in-game money you get for playing and there is more to be added, it's really just cosmetic stuff and isn't affecting gameplay. Weapons variety isn't massive but I don't know what weapon variety is like in the 40k universe there are your standard rifles, ones that fire faster with less damage, ones that fire slower with more damage and anti-vehicle weapons. I am of the opinion that some games put in plenty of weapons and then you get the few that people will actually use, the weapons in this are situational and thats enough for me. I haven't notice the maps so I think there are a few per game mode I haven't noticed much copy paste on them usually each objective has a different structure but yep the maps are barren, super simple terrain with ruins and objective buildings, exactly what's needed and no more, I think this fits well for this game. I am using a negative review below to help me address some points that are completely wrong, the next one being paid armor upgrades... nope they meant paid armour appearances, yeah that cosmetic ♥♥♥♥ you can get if you wanna throw a few of your revelant currency at the game, otherwise not needed.  I will update this review if anything major changes or issues like server lag or balance has not changed in a while but for now I recommend it because I am enjoying it.",
            "review_score": "1"
        },
        {
            "review_text": "It looks promising but it plays like space marine only not as fun because the melee attack combos are non existent. I went in trying out my old moves and it wasn't an option so it boiled down to very basic melee attacks and shooting with very little accuracy. I'd say wait until it's updated a little more. Wait a month or two and it'll be great :3",
            "review_score": "1"
        },
        {
            "review_text": "I am really enjoying the game, involves team work and tactics to be successful. Enjoy the content and the builds also.",
            "review_score": "1"
        },
        {
            "review_text": "Its not terrible, but its also not amazing. However I still find myself coming back to it. Only 20hours in but still enjoying the style and hopefully its only going to improve. Plenty of class choices to try on each race, personally favour one of the melee variants atm as its fun going toe to toe only to win and end your foe with an execution... :) But then its also fun laying suppresion fire down as the enemy try to rush the waypoint, or soaring above to flank them with jetpack or wings... If you like 40k themed games and have a little patience to get used to the game mechanics, it is worth it (not at £40 though wait for next sale). If not, dont bother. ",
            "review_score": "1"
        },
        {
            "review_text": "Game seems good, little but of balance needs, lag fixing, and frame spikes. But all in all I have got a good experience gameplay wise, been really fun for me.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game religiously for about three weeks now. I've gone through wipe after wipe, and am happy to have had the chance to play this game. I am bummed that there is so little PvE and Quing for it is just a horribly long wait. I know that this game is supposed to be a MMO shooter, but I heard that it promised more in the beginning. I wanted to say thank you to the DEV's and people who made this game a reality, and I also want to shame the group that pushed it out in it's current state. Eldar are out of control, Marines and Chaos feel balanced, and the poor Ork's are out matched in most areas. With that all said. I play ork as my primary race and will continue to. I do not know what was promised to players in the past, but for a shooter, this game works for me. I enjoy the 40K Universe as a player, today and a PnP player and model painter in the past. I am overall satisfied, but I do feel that Larger mpas that utilize vehicles and cover will help the melee spam. When you put groups in such close proximity, melee becomes the only option. Thank you and I hope the review helps counter the undeserved negativity. People felt let down by the release as it is, but I think that with time and hard work the developers will hash out the game everyone expects. Thank you again. Hope the review helps folks see the other side of the coin.",
            "review_score": "1"
        },
        {
            "review_text": "Greetings Brothers.  As you know, the tatical simulation of the Arkhona Crusade is newly arrived to our local Cogitators. As with all new things, intergration into our existing systems is a complicated task for the techpriests to preform. There are a great many systems on the Battle Barge 'Steam' and makeing this simulation compatible with all of them is only possible through tireless ritual and the blessings of the Emperor.  I have served as a captain from the inital launch of the crusade and at that time the touch of Chaos was apparent on this world. Beachheads had to be carved from a single map, transport was unreliable, &amp; the very ground under your feet could fall away from you. Despite all of this, the simulation proved engageing, rewarding smart decisions at the squad level and teamwork. We fought our way though months of battle, changes in wheapons, foes, and our equipment. New locations arrived as the work of chaos was undone.   Now there are multiple fortresses to contest, and the Greenskin and the Eldar have enter the fray. New wargear is being brought up from the armory daily, Tanks and transports are now relible, and the Tyranids have appeared on the edges of the war, strikeing isolated outposts and giveing rise to squad level missions and challenges. The Simulation is provides excelent lessons on the importance of cover &amp; firesupport while not penalizeing new warrors for their inexperience unduly.  Although my trusty Cogitator has proven stalwart against many foes of the galexy, it felt the strain of the crusade. With a thuban 1100 processer at 3.3ghz and an R9 290x I found it was dropping to 15frames at times at 2k resoultion. Adding a second 290 to the cogitator if anything lowered frames, as Crossfire support is badly optimized or non-existant. I have found I needed to disable crossfire and run a single card at 1080 to get a consistant 60 FPS. I hear users of the Forge world Nvidia recieve better frames, but have no first hand proof to colaborate that claim.   My conclusion: This simulation is a work in progress, and is far from a product up to Codex standerd for quality and reliability in the field. However, even at this half done state, this game provides the fun and experience that I find myself drawn back into over and over again. The roar of Chainswords, the crump of bolter fire, the swirl of melee, the tension of a sniper fight, the sight of my squad securing an objective with good team work, the feeling of satisfaction as you destroy an enemy tank in your own, these things this simulation has, and it does them well. I look forward to the changes I expect in the next six months.   The Emporer Protects. See you on the battlefield Brothers.",
            "review_score": "1"
        },
        {
            "review_text": "Giving this game a good review because it has so much potential. Currently there are some flaws but you do feel like a Space Marine on a battlefield, the devastator feels the heaviest, I haven't played the other races yet but I'm having fun when I do play. Bandai Namco who's the publisher pushed the games release, not the developer. LIke I said though the game still has alot of potential I'll probably continue to spend and play it as it gets developed.",
            "review_score": "1"
        },
        {
            "review_text": "I have watched this game grow and develop over two years and can say thats its only going to get better and better. Its had its hiccups but each update is better and better.",
            "review_score": "1"
        },
        {
            "review_text": "Regret purchase, bought it in hopes that it was going to be somewhat fun, not really, its like 10 percent done.    Should have just bought a tactical marine squad or a rhino and some paint from games workshop, would have had a lot more fun.",
            "review_score": "-1"
        },
        {
            "review_text": " 40K Fan boi &gt; buy it, you'ill get your money's worth Non 40K Fan boi &gt; 50 is a tad too expensive, you probably going to end up being disappointed",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I don't see why everyone is giving Eternal Crusade so much flak...  Positive ----------- -It's a Warhammer 40k shooter -Very similar to Planetside 2 in combat and vehicluar combat -Very very fun to play in a group -Excellent attention to ambience by the devs -Excellent detail with regards to characters and weapons -Eldar, Orks, Space Marines, and Chaos Marines are all playable  Neutral/Meh ------------- -Kind of clunky with the cover mechanics. They could also use expanding -Servers are generally stable, but can get really bad sometimes -Vehicle physics could use refining. A tank that weighs 60 tons or more shouldn't bounce like a car with hyraulics when it goves over a bump -Clan mechanics are good, but need definate refining -PvE... Great idea, but it needs refining in regards to objectives and the whole '5 minutes to activate the objective AND survive against increasingly difficult enemies' mechanic  Bad ------- -There is a definite feeling of a power gap between factions. Eldar and Orks feel more powerful than Space Marines/Chaos Marines. Unsure if this is just a 'Release week' feeling, or if something is actually unbalanced.... -Meele combat is very clunky. Aiming is hard and certain weapons seem to do more damage than others, especially between factions   Overall, a very decent game. It's a solid 7/10 and I believe it's worth the money. Just don't go for the in-game RTC currency...",
            "review_score": "1"
        },
        {
            "review_text": "  Put simply, there is no better Warhammer experience to be had as of this date.",
            "review_score": "1"
        },
        {
            "review_text": "Its a lot of fun for what it is and the Devs are always striving to make it better. It feels very Warhammery.",
            "review_score": "1"
        },
        {
            "review_text": "This game is solid and a lot of fun. There are a few bugs that need to be ironed out but this game is no where near as bad as people make it out to be.   The main concern a lot of people have with this game, is the developers were unable to fufill their promises they made when they started development. These are valid concerns and are important when people choose to invest in a game, no doubt about it. However the game itself is actually really fun and enjoyable. If you are a fan of the franchise it is definetly worth playing.   As with any game on release the price is pretty expensive, if you can't afford the price tag right now then it's definetly worth waiting to pick up in a future sale. Don't break bank trying to buy this game because it isn't THAT special and it has a lot of development left ahead of it even after release.",
            "review_score": "1"
        },
        {
            "review_text": "a good game not what they promised, but I believe they are working on it. Now if they could add bots quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Those of you who played WH40K: Space Marine will love this game. The multiplayer PvP is similar to that, but combat has been way more optimized, and battles are a lot bigger. Also it has it's own 'horde' mode similar to Space Marine, except instead of Orks/Chaos the enemy is Tyrannids. Still needs some work, but overall it is a great game, and I am looking forward to what the devs do with it down the road.",
            "review_score": "1"
        },
        {
            "review_text": "Needs some work in optimization and polish in terms of gunplay/melee. Very fun game overall though. Good Coop, PvP, and factions.",
            "review_score": "1"
        },
        {
            "review_text": "Why is this not labeled Early Access? Cause I've played alphas with less ♥♥♥♥ than this.",
            "review_score": "1"
        },
        {
            "review_text": "Is there a lot of butt-sore, irrational hate for this game? Yes. Is the hatred warranted? No.  Do I love 40K? Yes. Do I like executing people with various melee weapons? Yes. Do I like re-living my childhood playing tabletop but in pc game format? Yes. Is it hard on new players? Yes. Are the devs working hard to tweak and improve things? Yes. Do I enjoy it? Yes. Do I recommend it? Yes.  If you like anything 40k just get this game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand all the negative reviews, they really made a good foundation of a game here and it keeps getting better with more customization. The melee is very enjoyable and the ranged weapons are great.  The factions are very different, i'm not sure why people are saying they are the same. Each race has very different classes with strengths and weaknesses. It's almost like the negative reviewers are playing a different game.   Keep going devs, continue to improve this game and it will stand out among WH40k games as a gem!",
            "review_score": "1"
        },
        {
            "review_text": "Sure, it's a little..... budget - but this game is actually a bit of fun. Think it has a lot of potential, keen to see where it goes. Probably wouldn't recommend unless you're a decent fan of 40K though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. The game has change that is a fact. However if you play it now and embrace it it will not disapoint any 40k fans. From running around as a Ork Chappa cutting Space Maries to bits,To Chaos Nurgle Sorcerers dueling eldar. The game has 4 factions,then each one has sub-factions to find your game style and each one are unique and fun. Each faction plays differently and trust me,ork players play like ork,mass numbers rushing in and just being orks. Try it,watch the youtube if you must but choose for your self. Most people are writing bad reviews because they are upset how the game  changed,me?  I embraced it because its a game in the end. I get to play in the Warhammer 40k world and make memoris. Bloody,death fueld memories.",
            "review_score": "1"
        },
        {
            "review_text": "If you think of it as an Early Access (95% finished) lobby shooter then its good.  Some balancing issues but overall really fun to play.  Hard for new comers as you have to make due with standard layouts because you do not have enough xp to unlock all the upgrades to customize your loadout properly. So it is a bit grindy and can be frustrating untill you rank up. For example you don't have a single default loadout that has something against enemy tanks. So you are pretty much reliant on other players for the first 3 out of 5 ranks to take care of those.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the sea of negative reviews this game has currenty received, I think it deserves a recommend. It's fun and quite cool and pretty much a planetside 2 clone but with a W40k skin on it.  Granted it isnt the most polished of releases, but I do believe that it was probably forced out by the publishers to make budgets balance rather than the developers lack of attention.  If you like third person shooter with melee aspects and the W40k universe then this is a game for you.  10/10 would stick my chain sword into a Space Marines body again.  ",
            "review_score": "1"
        },
        {
            "review_text": "I waited to do a review after it left early access. The game feels like its in beta. I've played since alpha and have to say it's come a long way and It's addicting for sure. I'm looking forward to updates and whatnot in the future too. Definantly has lots of potential to be even better. Still needs to work out the kinks though.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay and game flow really came together after it launched. 10/10 would kill loyalists again,",
            "review_score": "1"
        },
        {
            "review_text": "This is a game I have enjoyed immensely for several months. It offers challenging gameplay with a variety of ways to tackle those challenges. The game has a unique feel in all aspects of play both in aesthetics and game mechanics. Most of the mechanics are solid. Ranged gunfights feel dynamic and offer a variety of ways of murdering the other team. Regardless of whether you would prefer to stay back and take out your enemies at a distance or charge in and clear buildings in CQB you have the tools to be exceptional at either. Melee happens over an intense burst spanning any where from a couple seconds to nearly half a minute where an experienced player playing an unoptimized class can overcome a melee optimized class with skill and timing. Each class feels unique, plays differently and best of all is essential on the battlefield. Eternal Crusade offers plenty of customization for each of these classes, pairing both an experience system and an earnable ingame currency that never feels difficult attain.  Of course not everything is peachy in Eternal Crusade. To start from the title page you'll find a menu system that lags and offers little information. The game offers a lot in customizability but fails to provide effective tooltips. These tooltips are either unfinished or don't provide relevant information or a way of understanding the information provided. A lot of the items that you'd like to have tooltips for are reskins. The majority of these reskins are purchased through a random crate system. This would be fine except for the fact that these crates also contain items that are arguably essential to progress in the game. Coupled with extensive balancing issues these problems can be overwhelming.  Overall I think that the game is fantastic and improvements are continuing to be made. The gameplay mechanics are solid though a steep learning curve may make this game inaccessable to some(I've seen a lot of complaints from players with 100+ hours that seemingly still struggle with the melee mechanics). The environments and customizable options are varied, unique and on a whole well assembled. That said this game is not a finished product many things are still being implemented that you would expect to be finished in game at this price point. If you purchase this game and treat it like the early access title it was a month ago you'll be pleasantly surprised.  TLDR;  A fun 3rd Person Shooter with a unique melee system that makes for engaging gameplay. Suffers from balancing issues and an unfinished menu system.   Pros: Unique Feel Customizable Classes Easily Earned Ingame Currency Engaging Gameplay Mechanics  Cons: Poorly Balanced Inaccurate/Unfinished Tooltips Random Crates Tied to Progression Poor Menu System  #WOLFPACK",
            "review_score": "1"
        },
        {
            "review_text": "Are you a fan of warhammer 40k? If yes - grab this game! Also play with friends or clan, it amplifies the fun tenfold.",
            "review_score": "1"
        },
        {
            "review_text": "Started few days before launch. Game have its issues, too quick launch and balancing problems but its a lot of fun to play already and will get better with each patch. Me and my team already have over 100 hours of good fights playtime. Definetelly worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Going to open up and say this game is far from perfect, it's got a long way to go still. If you're expecting a WH40K version of Planetside or an MMO, this is not that game as that design plan was set down a long time ago. Perhaps some aspects of that will be included down the road, but it will be a long while until then. For now, the game is a lobby shooter, but it's the most fun I've had in a LONG time in gaming and I just can't stop playing.  Best description I can think of is somewhat of a mashup of Warhammer 40,000: Space Marine's multiplayer, with a bit of Battlefield or Battlefront thrown into the mix, and perhaps a little bit of Gears of War with the evasion and parts of the cover system. If you liked these types of games, you very well could love this title as well, but if they weren't your cup of tea then you may want to look past the title. The best advice I can give you is to watch gameplay, do research, and decide for yourself. There are a lot of regular streamers that play this game throughout the day that can give you a first hand experience of gameplay, though admittedly some of them can be mildly jaded.  I was apprehensive of the game when I saw the initial concept and scope, feeling that it might be a bit of a pipe dream, but February of this year I saw the game added to Steam and it piqued my interest, so I went out and did research, watched streams, and made my own decisions. I knew the open world aspect was gone, I saw that it was a lobby shooter, but I also saw the makings of a really fun game in there and I took the plunge. I regret nothing. Even if this game shut down tomorrow (it won't) I more than got my money's worth out of it as I'm up to nearly 800 hours. As of this point it's been narrowed in scope a bit and the devs are biting off manageable chunks at a time, albeit slowly.  It's buggy, some have performance issues with it, but these are being worked on all the time, and it's slowly improving. It can be frustrating dealing with these problems at the moment, but when everything is working properly it's one of the most satisfying and gratifying gaming experiences I've had in a long time. When you master the melee system, you can get some pretty epic duels or fights with good opponents or even larger groups. When you get a rhythm for how the game flows and work with your team towards a common goal, ranged covering melee, melee flanking and/or screening for ranged, to push objectives and win hardfought matches, it's one of the best feelings.  Do not go into this thinking current balance is the end all be all; the game is contantly changing and problems are being addressed one at a time. You will get frustrated, you will be elated. There will be highs and lows, but as time goes on the highs get better and the lows get less severe. Patience.  THE GOD FARSEER OF MANKIND DEMANDS TRIBUTE TO CHAOS! WAAAAAAAAAAAAAAAAAAAAAGH!",
            "review_score": "1"
        },
        {
            "review_text": "Well I been playing this game for a while now. I think it's good for what it's . I never really gave much into the big promises, and hyped it to the sky like so many do with games these days.  Always good to just try it and see if it enjoy it or not. For me it given me hours of fun and still do. I guess alot of people just play the typical Space Marines. Which is meh.  Cause me and the boyz always have fun. For the WAAAAGHH!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing on and off since release and i must say if the current version of the game was released on day 1, tons more 40k fans would have stayed playing.  But i really recommend this game to fans. Or ask for fans who were disapointed initially to give it a second chance.",
            "review_score": "1"
        },
        {
            "review_text": "I get the same feeling of being a Space Marine as I did from, well, Space Marine. The weight, the general awesomeness but the game suffers a little of the combat side. Close combat is broken a little but feels right at the same time... weapons are not super accurate, except that when they are shooting you from across the map. Still, fun game",
            "review_score": "1"
        },
        {
            "review_text": "So it's more like a battlefield game than planetside. I don't reccomend you pay $50 for it but 50% off is worth it if you enjoy everything 40k.  I just love Orkz and this is the only game where I get to dakka dakka dakka.",
            "review_score": "1"
        },
        {
            "review_text": "I'll write a review once I get more hours in.   Quick Review  -Orks feel Orky -Eldar are elvish ♥♥♥♥♥♥♥s that are hard to hit. -Chaos look like chaos.  -Space Marines feel like space marines.   Con:  -Glitchy, Movement can be finicky.  -New assets look better then older ones.  -Only a handful of maps with some minor logistical changes. Ever map is capture and hold.   Wouldn't mind an 'Ecort the Titan' mode or somthing.  Get it on sale. I've had some great fun for $20.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game with lots of potential! FOR THE EMPEROR!",
            "review_score": "1"
        },
        {
            "review_text": "The best way to explain is to have you look through the development since 2013. Several of the important lead developers have been let go including the massive shill, creative director, David Ghozland, promising massive planetside 2 scale maps and large battles.   With the new team, they're scavenging whats left. And they're definantly doing their best as of now. Due to prevoius setbacks with the old team and publisher pressure to release the game, yes, i can agree they game is NOT ready to be released at this time. If you're a fan of the universe and know how investment work and want to support this game, get it.  But there's no harm in waiting, the game will more likely be here next year, bigger and better, waiting for you to add more bodies to the meat grinder. BLOOD FOR THE BLOOD GOD!",
            "review_score": "1"
        },
        {
            "review_text": "Sooo... about this game. Eternal Crusade didn't quite turn out to be what we expected and what was said, but that's not necessarily a bad thing.  This game still has a long way to go before being able to justify the price tag, but by no means is it a bad game.  The store page advertisement about the game's features is deceiving since there's still a lot of stuff missing, but with a little bit of patience i'm confident that the devs will deliver, they're very active and bring out new patches and updates all the time.   In conclusion: If you're looking for finished product with the features that are being advertised; don't buy it. But if you're a WH40K fan, keep an eye out for this game. Give it a few months and check it out again, one day it'll be great.",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr version: This is essentially an early access game labelled as released - but a very good one, so if you are fine with it being not yet finished, there is tons of fun to be had.  Long version:  I've been in the Founder's program way back when the game was announced as 'Planetside Warhammer40k'. I understand a lot of people are disappointed that the scope was reduced, but I've always wished for a 'Battlefield Warhammer 40k', and that is precisely what we got, so I am happy with that. I wish the devs would have handled requests for refunds better, but personally I have not regretted backing this game.  Be aware that it was released rather early, probably due to publisher pressure, and is as of this writing in a state that would usually be called a beta. As someone who has played a lot of betas and early access games, I am comfortable with the unfinished state of the game, but you should be aware of it and if you expect a finished product, I suggest you check back later in half a year.  So why do I still recommend the game? It is tons of fun, it captures that 'grimdark future' atmosphere and the WH40K setting very well, and and the choice of factions this time around is pretty good. Whereas in (the otherwise excellent) Space Marine you could play either humans - Chaos Space Marines being essentially just a reskin of Space Marines - in Eternal Crusade there are also the Orks and Eldar to play. I am an Eldar player myself and I must say I am generally very happy with how they turned out, both their handling and feeling as well as their aesthetics.  As a final word - this is a PvP shooter first and foremost. There is a coop PvE mode, but that is just a single and rather unrewarding dungeon (against Tyranids - good choice for the opponents), so if you are looking for coop PvE, this is not the game for you before the devs add a lot more to the PvE mode.",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably the best 40K game to date (which may also say something about 40K computer games in general)   If you are a fan of 40K and dreamed of burning xenos and purging heretics this game is for you. it has recieved alot of bad press in the past and i think this stems from a few root causes:  1. the people that backed it from the start, they did not recieve the game they were promised, it currently is not an open world MMO as it was originally marketed 2. Players comming from COD and Battlefield wanting heroic solo actions on the battlefield.   This game takes some patience to learn and is based around squad level tactics, it is focussed on teamwork to complete objectives and win matches, if you run arund on your own trying to get kills and XP you will be dissapointed   There are several issues with the game such as balancing issues and requires some more content but at its heart is a great game, the devs are still working with the community of players and releasing new content on a regular basis aswell as patching faults and balancing the game.   more content to come includes terminators and special characters, campaign system, more maps and more weapons.   In summary it is a game unlike other third person shooters and crosses over into an RPG genre, it will not appeal to all but if you are a 40K fan this is for you, it keeps you saying 'just one more game'  Update @200 hours: the latest patches have made a much more stable and fluid game, few balancing issues now remain, most of the issues people have with so called 'over powered' weapons comes down to knowing how best to deal with them on the battlefield. sometimes his can be frustrating but a challenge is welcome. 200 hours in and i am still loving this game and with a new fortress to be released soon and the campaigns starting this week its up up up. once more unto the breach brothers, once more.",
            "review_score": "1"
        },
        {
            "review_text": "Yes they fumbled the early access and release. Why do you play games.....because they are FUN and you get ENJOYMENT out of them.  the game for me IS FUN and i get ENJOYMENT out of it. Just let the devs do their thing and get it up to speed.",
            "review_score": "1"
        },
        {
            "review_text": "hi,  this game is realy amazing but there is some issues somtime time very long loding when i inter the battle like 5min or more.   there is some faction realy need to balance like: 1- chaose space marine and ork there fire power and mele weapon more powerfull than space marine it's not normal i hope you chick this and balance.  2- there is weapon space marine must have it like (AUTOCANNON) like chaose space marine have as this two faction have semelarty,  ac you can see space marine is weak faction in the game i hope you balance it.  thank you,",
            "review_score": "1"
        },
        {
            "review_text": "Maddness and maleficarium, Green Gitz , Pointy ears and the Lap Dogs of the corpse emperor . I am enjoying this game alot, despite some bugs and NA servers. There are issues with the game, it can be a rough ride at times , but i think personally it is worth putting in the effort to play.   For me when buying a game , it is about entertainment, cost/hours of play, i have had more than my £45 worth of entertainment , so i would recommend this game.   The game is in a basic state ,there is much more content to be added and balance will tip back and forth as it is added. so if you played eve online with its constant developement you will understand the developement process at work here.  ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. It gets better every patch and closer to the product that the devs what to make. 40K / 10 Will play till I'm incased in my own Dreadnought",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Space Wolves get their own voice set and howl as they charge into battle.",
            "review_score": "1"
        },
        {
            "review_text": "Is it perfect, and all that was initially promised? No, but it is a good game with great potential. I do think they should have kept EA going for longer, untill the campaign elements are implemented. The Devs kept us updated on changing goals etc, and I love going out and slaughtering Heretic and Xenos filth. There is steady progress in updates and given time it can be great, as it, it's a solid 40K shooter(well, I usually use a sword) that makes for some truly epic matches if you fight with a coordinated deam, Awesomme victories against overwhelming odds, Unbrokeken defences against powerfull foes or turning the tide in single combat. TLDR: Solid game, truly awesomme at times, with it's share of balancing issues and shortcommings, with great potential and what I believe is a dedicated devteam. For Russ and the Allfather!",
            "review_score": "1"
        },
        {
            "review_text": "Game has issues. It's fun and if you enjoy tactical shooters, it's one of the best on PC.",
            "review_score": "1"
        },
        {
            "review_text": "EXTREMELY FUN GAME! If you're a WH40k fan this is your dream coming to reality. Most of the haters are just mad that they can't play EC well :D   If you love blowing ♥♥♥♥ up, punching people with a power fist of doom and watching them go flying, or chopping people in half with a chainsword then you want this in your collection! The Dev's actually listen to the players, the minority will complain they do not hear them because they want thunderhawks, melee nerfed and many more common complaints that kids have, ignore those peasants and get this game! What you're looking at is a diamond in the rough, it is being shaped as we watch it, as an early founder who put quite a bit of start up money in this I had a gamble, but to me that gamble has paid off already and with that said this truly is a unique experience.",
            "review_score": "1"
        },
        {
            "review_text": "Is A aye right good game it is. good ol shoot em up with plenty of choices and teamwork",
            "review_score": "1"
        },
        {
            "review_text": "very nice game",
            "review_score": "1"
        },
        {
            "review_text": "I don't write many reviews but I had to for this game. I found out about Eternal Crusade about 6 months back and have followed the development progress up through release (a couple months ago at the time of writing this). I was still hesitant to buy it because I'd heard that the game wasn't near finished and the development had struggled. But I started watching their Friday streams on development progress and they seemed to be very committed and making progress quickly. Then came a steam sale and I couldn't resist any longer.  So on to the review. The 40k atomsphere in the game is thick and really spot on. Exactly what I was looking for. The races (space marines, chaos, eldar, and orks) are well presented with great animations and voice lines that fit well. The gameplay is a lot of fun. The combat is well thought out, and although the melee system needs some tweaking it is still alot of fun in it's current form. The weapons I have seen so far are distinct and fun to play with. The maps are large and well designed in my opinion. They give off the 40k vibe really well. You can play in games of up to 30v30 at the time of this writing, so those matches really give off a good sense of scale. There are also vehicles which add to the atmosphere and give tactical, defensive, and offensive benefits. The character progression is pretty good and you can earn requisition and experience to unlock new traits, weapons, and items. They do have a real money system (called RTC in the game) as well where you can buy weapons or customization stuff for your character, but at least at the time of this writing they are supposed to be visual only. They are also starting a campaign mode where you can earn RTC by playing which is nice. There are multiple modes to play in, including hold the line, an assault type, capture and hold, a coop mode for 2 - 5 players against tyranids, and others I can't remember. They have a squad system, with squad leaders which helps with in game communication, and the design of the game encourages teamwork, although you can still be a lone wolf if you want to.   Graphically the game looks pretty good. It isn't anything astounding, but it holds its own well enough. The character animations look great, the maps look good. There are cool ambient weather effects, weapons effects look great. There are player executions too which add to the atmosphere. Although, one thing that does need to be added, in my opinion, is more gore. There are blood splatters etc... but no dismemberment or 'gibbing'. Not a big deal, but it would be nice to have I think and would better represent 40k. Audio is pretty good as well.   Overall, this is one of my favorite games in a long time. Yes, I am a 40k fan it's true, and that is part of why I like it so much. The game gets a lot of flak because it went through some development struggles early on, but in my view they are back on track and really committed to making this a great game. What is there right now is more than worth the price I paid. It's a lot of fun and keeps me coming back for more. Here's hoping this game continues to get fan support so that they can continue to add cool stuff. **Hoping to see a Dreadnought someday.   TLDR: If you're a 40k fan, this is a must have in my opinion. It does have some rough edges but the dev team is committed and the game is coming along nicely and is worth the price to play right now. Come join the eternal war!",
            "review_score": "1"
        },
        {
            "review_text": "Despite all of its many flaws it it's still a great and fun third person shooter",
            "review_score": "1"
        },
        {
            "review_text": "It's good. It's not perfect. Basically a better Space Marine.  You should buy it if you like 40k, liked Space Marine, or want a team based shooter where skill trumps 'I Win' buttons.  You shouldn't buy it if you like Call of Duty, League of Legends, or Overwatch because there are not enough shiny keychains to distract from the bugs and growing pains for you. Really, you won't like it more than you dislike that previous sentence.  Warbros #1.",
            "review_score": "1"
        },
        {
            "review_text": "Just want to tick up that positive marker, people who complain about the long waiting time should instead just make positive reviews, just saying.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not bad, but it's quite 'broken' for now with bugs and some imbalance between factins.  Once those hurdle hve been fixed, it'll be a good game. Not great, but enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I am new to the game, but already love it. I have lightly followed the development of the game for the past year and some change. Now I wasnt that involved so I dont feel so torn on this game like others.  If you like 40k or even just want a fun shooter in an interesting universe, this is a definite WIN.  It could use some work, dont get me wrong, but they are patching/updating it fairly often, but for the $25 currently just pull the trigger. ITs NOT worth the $50 price tag in its current state (11/27/16).   I have waited a long time for an MMO set around warhammer (moment of silence for warhammer online), but now this shooter style verison set using 40k is just dope. 4 factions, 4-7 classes per depending on the faction, plenty of weapons and gear to customize. The maps are detailed and widely open, the character models have factional styling (even taunts).   Now we were promised true open world and some added content to go with that, but it is a work in progress. Right now the developers need a stronger player base and a positively active community for feedback. This is on the right track, it might be a long road, but when its there it'll be worth it.  In its current state you will have fun and laughs , I guarentee you, just be patient, try all the factions and classes and decide what your fit is.   PS - Space Marines are overcrowded a bit (like in the tabletop), so queues will be longer there, topping 3 mins but usually around 30 - 1 minute . If you want to party up with friends I wouldnt recommend playing space marine, queues are very lengthy for parties, you will find more luck in any of the other 3 factions in regards to grouping (For now).  My advice, make a character in each faction, or at least 2 (you get 4 character slots) and just jump sides if a particular queue is taking longer.",
            "review_score": "1"
        },
        {
            "review_text": "Ok its not a bad game wish it would be a team based thing and not run everywhere no milatry workings no team work just a frenzy but thing its not pay to win thank god but if your new like me your starter suff will have you killed in secand and thos have been playing for a long time you caint scrach them your fire power just bounces off them GAME THAT IS UNFINISHED other then that its good",
            "review_score": "1"
        },
        {
            "review_text": "Without the Dark, there can be no Light, We have purpose Without the Lie, there can be no Truth, We have purpose Without the War, there can be no Victory, We have purpose Without the Death, there can be no sacrifice, We have purpose Without the Hope there can be no Future, We have purpose Without the Loyalty there can be no one chapter, We have purpose Without the Emperor, there is nothing,... And we would have no purpose",
            "review_score": "1"
        },
        {
            "review_text": "Honestly i love this game yeah its wonky and needs a lot of time to rewrite what its done wrong but the wave of negativity will just push the game further into the deep end past the rough corners is a genuinely fun game personally however its the guild that make this great for me if you go to the forums youll find some really awesome people in the community anyways though its a good game just when buying it expect some issues but also expect the issues to be gone at some point",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, its still a work in progress but it just keeps getting better and better.",
            "review_score": "1"
        },
        {
            "review_text": "well worth the money should give it a go =) with the promise of so much more to come! My recruit a Friend code EC-EYOS695Z1WI0J for a free 4,000 RTC",
            "review_score": "1"
        },
        {
            "review_text": "Better value for money than No Man's Sky ;)",
            "review_score": "1"
        },
        {
            "review_text": "I usually don't write comments about games, but this game deserves it.  This is the best game ever !!!!  The main problem with the game is that is complicated at the beginning, and you will se a lot of new players writing bad comments about this, just because they have not idea how to kill anyone (a lot of noob haters).  The current state of this game is fantastic. I've got 55 fps average (gtx 670x)  100% recommended if you love warhammer universe and if you love shooters that are not so easy.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true masterpiece of Warhammer.  Dawn of War Wishes it could be this cool.  I am so glad something like this exists!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The ones who dislike this game voted for Trump",
            "review_score": "1"
        },
        {
            "review_text": "Thought this game would turn out good. Nope. Maybe it'll get better, let's hope but I don't have my fingers crossed.",
            "review_score": "-1"
        },
        {
            "review_text": "Be a Space Marine Pick Melee Be terrible, die several times with no kills Switch to healer Continualy die as you franticly try to heal a teammate rather than yourself Switch to Tactical (basic ranged) Die less, but still get 0 kills Chaos Marines win  7/10 in current state, some of the score granted for anticipated features.  EDIT: Review has been changed to No. I could rant for a while, instead Ill keep it short. This was an open world 40k mmo shooter when I paid to be a founder. It is now an instanced arena shooter....thats all. It is far less balanced than Space Marine was, and is very generic, plain experiance. RIP  This game made the same mistakes as No Mans Sky. BOLD GLORIOUS BEAUTIFUL GREAT features promised. Simple, linear and dissappointing reality on delivery.  4/10 gracious score for the maps looking VERY 40k. The art is the only thing that was not part of the over promise under deliver.  FINAL REVIEW AND EDIT: People. Stop buying this game. Let it die so we can move on.",
            "review_score": "-1"
        },
        {
            "review_text": " *Initial Thoughts*",
            "review_score": "-1"
        },
        {
            "review_text": "This game has potential and a lot of fixes since early access",
            "review_score": "1"
        },
        {
            "review_text": "There's a basic progression system implemented, the maps feel relatively solid, vehicles are fine. It's cool that you have 4 factions, although they play fairly similarly. Graphics are okay for a 50vs50 shooter, difficult to do much more if you want to scale upwards.   The game is primarily multiplayer-based. There's a PVE mission mode where you go up against tyranids, however it is very forgettable (and another game called Deathwing will do that much better).   Overall, there's a sense of fun to be had while playing the game.  Edit: The following paragraph is no longer accurate, I now feel the lag/delay is small enough to enjoy the game.  Unfortunately, everything lags all the time on multiplayer servers. Actions which we are used to taking &lt;0.5 seconds in games like Overwatch, CS:GO, Dota 2 (and 1 second in Planetside 2 and Star Wars Battlefront) end up taking 3-5 seconds in this game to register on the server. Meanwhile the game will happily proclaim that you have some 40 ms latency. The end result is that it feels like you are playing an MMO on an asian server. It also has direct influence on gameplay, you can empty a whole clip into enemies and they will just walk up and kill you anyway in melee because your shots didn't register in time. The netcode is bad, or the server is bad, or the client's way of displaying it is bad. It doesn't matter. THe final verdict is that this constant delay makes the game completely unplayable in any way. ",
            "review_score": "1"
        },
        {
            "review_text": "Blood was needed for the Blood God. He got blood and this game is why.",
            "review_score": "1"
        },
        {
            "review_text": "Ranged combat needs some serious updating. Currently the game is pretty poorly balanced.  Update: At the core this game can be fun... quite often it's incredibly frustrating. I changed my review to a thumbs up because I do want this game to succeed and I like what's possible from here. The dev's have to work overtime to be adding features and polish or this game will die, which would be a huge loss.",
            "review_score": "1"
        },
        {
            "review_text": "50€ for a still broken game ??? Are you kidding me ? Really now? AAA price for this? wow. Biggest scam since 'No mans sky'...  The trailers are total BS. You will see nothing in the actual game that you will see in the trailers...Or even some 'screenshots'...  This game is not for AMD people...Totaly not for people with AMD cpus...",
            "review_score": "-1"
        },
        {
            "review_text": "Feels unfinished and just overall lacking.",
            "review_score": "-1"
        },
        {
            "review_text": "Update: so the game has changed a lot, and the devs are still working on it with great vigor. Several issues are still to be solved, mostly the melee fighting, but this game should surpass space marine easily, and might be actually playable. Mostly. Yes, once you get past the 3rd-person bogus and sometimes silly movement and getting one-shot/slashed, one can tell this is probably the best wh40k game there is, and one day, hopefully, they finish this product. Lots of gameplay hours await, to reach legend level as space marine, chaos space marine, eldar and ork. Huge variety of weapons, gear and armor pieces for your ranged/assault/heavy/support loadouts, or you can just seat yourself as a rhino driver or predator/vindicator crew if the map supports them. but dont buy those rogue trader coins :/ i ended up with a visually different weapon, that had almost same stats as the regular one... and i am still waiting for some freedom on coloring the characters, there are a very few options available.",
            "review_score": "1"
        },
        {
            "review_text": "Ok its getting better and better, althou still buggy. If you NEED a WH40K lobby shooter with some sort of world domination going, then sure, why not, buy it. At a discout.",
            "review_score": "1"
        },
        {
            "review_text": "Pushed out of EA too early. Needs a lot more work before I give it another look. Drop the cash shop too, since Orks arent going to be F2P, this is a full-price game like cmon",
            "review_score": "-1"
        }
    ]
}