{
    "app_id": 375680,
    "name": "Apartment 666",
    "release_date": "2016-08-03",
    "developer": [
        "I Need Play"
    ],
    "publisher": [
        "I Need Play"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 2,
    "positive_ratings": 103,
    "negative_ratings": 227,
    "price": 0.79,
    "description": "One day you wake up and realise that nobody is home. You try to exit the apartment only to wake up again in your room.You are stuck in an endless cycle of loops with only one way out.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375680/header.jpg?t=1495360523",
    "minimum_requirements": "Mínimos: Sistema Operativo: 7.0 Processador: 1.8 GHz or better Memória: 4 GB de RAM Placa gráfica: 2 GB Graphics Card or better. 2013+ DirectX: Versão 9.0 Espaço no disco: Requer 1200 MB de espaço livre",
    "recommended_requirements": "Recomendados: Sistema Operativo: 8.1 Processador: 2.0 GHz or better Memória: 8 GB de RAM Placa gráfica: 4 GB Graphics Card or better. 2014+ DirectX: Versão 10 Espaço no disco: Requer 1500 MB de espaço livre",
    "reviews": [
        {
            "review_text": "got stuck in the room, whacked it a lot so that was cool",
            "review_score": "1"
        },
        {
            "review_text": "The games not bad, considering the developer is only 17! Check out my full, live reaction and playthrough of Apartment 666 for more details, and a better overview of the game:)           YouTube™ Video:  Apartment 666: Playthrough - Commentary! - Worth a Buy?&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "One day you wake up and realise that nobody is home. You try to exit the apartment only to wake up again in your room.You are stuck in an endless cycle of loops with only one way out.         YouTube™ Video:  &nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game. Don't bother comparing it to financed versions of pac-man. This game is an experience. Buy it, play it, have some scoobie snacks.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game at 3,34 euro so I walked into the game without high expectations. It's hard to put an exact score on this game because of its price point, and from my understanding, the dev is only 17 years old. The game is very mediocre and the quality and gameplay can be compared to much of what you find on Gamejolt for free. The game wasn't bad, but it didn't pull me into the atmosphere that is needed for a horror game to be succesfull and scary. On a side note, my game time after finishing it is 0.2 hours so it isn't a lengthy game either.  The story is typical for an indie horror game and nothing special that I hadn't seen before. Minor spoiler...   The ending was rather abrupt and heppened right after the 'scarier' parts finally started happening.   One REALLY positive note about the short story is that it is well paced which you don't see often on indie horror games.  There is definitely potential behind the young developer of this game, but I think a bit more research on how other succesfull horror games are done could do a lot here to give it that extra push it needs. I would gladly give future projects another change.",
            "review_score": "-1"
        },
        {
            "review_text": "Tries to be PT, fails, controles delayed by nearly 2 seconds, got stuck after 5 minutes in the only corridor there is in this game...",
            "review_score": "-1"
        },
        {
            "review_text": "Hey everyone and this is my review about the game!  This is a walking simulator game.    Interface/Menu/Settings",
            "review_score": "-1"
        },
        {
            "review_text": "I've played free games that were better than this. I'll give the developer credit for trying, but couldn't quite pull it off. I realize it doesn't cost that much, but it really should be free honestly.",
            "review_score": "-1"
        },
        {
            "review_text": "        YouTube™ Video:  Happy Halloween.. Apartment 666 Horror game&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game for 20 cents, not worth it.",
            "review_score": "-1"
        }
    ]
}