{
    "app_id": 375760,
    "name": "Volstead",
    "release_date": "2015-06-25",
    "developer": [
        "Carlos Vázquez Ordóñez"
    ],
    "publisher": [
        "VoidMain Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 18,
    "negative_ratings": 25,
    "price": 1.99,
    "description": "Strategic turn-based game ambiented in USA 1920 when the Volstead act was declared. From 1 to 5 players in hot-seat mode. Fully replayable with lots of possible strategies. Game mechanics easy to understand. Around 20-60 minutes per game. Texts in English and Spanish.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375760/header.jpg?t=1478126025",
    "minimum_requirements": "OS: Windows Processor: 1.6 Ghz Memory: 2 GB RAM Graphics: 256MB Storage: 200 MB MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game caught my eye, due to intrest of theme and obviously PRICE... As for what i got well to be quite frank, its not a good game. Firstly i would like to point out that i only logged 27mins in game, but for good reason the game is simple boring no strategy. The reason for such little game play is cause i beat the game 4 times in a row in 27mins, never challanged. Secondly there is no game here you just build you city up and be the first to level 5 for all your buildings, it is so simple if you just save your money for city upgrades and skip the shares,politics, and police raids=Game Over you win. In summary sorry i bought this game, but if i can stop any others from making this poor choice then i guess it will be worth it, unless your the type of person who likes boring no challange level rusheing types of games then this is your game. If you like fun and emersive games then NO!!! pls do not purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "the game even run so ... waste of time writing this review",
            "review_score": "-1"
        }
    ]
}