{
    "app_id": 375770,
    "name": "Quantum Conscience",
    "release_date": "2015-06-09",
    "developer": [
        "Woodsy Studio"
    ],
    "publisher": [
        "Woodsy Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Visual Novel"
    ],
    "achievements": 4,
    "positive_ratings": 30,
    "negative_ratings": 12,
    "price": 3.99,
    "description": "In this unconventional visual novel, the player controls the story by choosing whether to use the main character's ability to read people's minds. As an agent of an intergalactic society of freedom fighters, Blaire's telepathic skills can be used in the name of freedom, or to manipulate others for power.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375770/header.jpg?t=1484431679",
    "minimum_requirements": "最低: OS: Windows XP プロセッサー: 1Ghz メモリー: 512 MB RAM グラフィック: DirectX or OpenGL compatible card ストレージ: 500 MB 利用可能",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "8.6/10 - A Sifi Visual Novel with a Twist!  This visual novel really did it for me for the most part. The setting was very dystopian and the story provides enough length and intrigue to keep you reading until the end.  This isn't your typical visual novel which I really appreciate. It's extremely long and provides you with hours of content and some unique features. It took me 6 hours to complete the story, and I wasn't disappointed! My only complaints are that the music can get quite monotonous and I got ending #3 which didn't come with an achievement so that sucks.   The interesting element to this game is 'The Void'. Essentially, you use the void to read other people’s minds and gather enough secrets and intelligence to determine the outcome. Although there aren't many actual choices; if you decide not to read someone's thoughts the story will go in an entirely different direction.  Worth the full $5!    Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Quantum Conscience is an interesting game, in that unlike most visual novels that rely on a series of choices to reach a specific ending, this game only has one button that you can press throughout the game. The choices you make and the ending you receive all depend on when and how often you press it. This is a really cool idea because unlike other visual novels where you can just immediately go back if you make a bad choice, in this game you have to think more carefully about when you press the button as information you may find out accidently can really affect future events and your relationship with the other characters. The story and the mystery are both complex and enjoyable which is really important as the game defintely leans more towards being a kinetic novel. The art is quite good especially the cgs and the characters are all very different and interesting.  In regard to the more disappointing sides of the game, the lack of choices while a unique idea can be really frustrating at times. I ended up on two different romantic paths on the same playthrough when I wasn't attempting to romance either character. The lack of choices also takes away the feel of danger during some of the more intense scenes and makes the game less replayable, at least in my opinion.  All in all though, I would recommend this game as I really enjoyed the complex story and for the price I think it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Recommanded so far",
            "review_score": "1"
        }
    ]
}