{
    "app_id": 375840,
    "name": "Rytmik Ultimate",
    "release_date": "2015-12-10",
    "developer": [
        "CINEMAX, s.r.o."
    ],
    "publisher": [
        "CINEMAX, s.r.o."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Audio Production",
        "Utilities"
    ],
    "tags": [
        "Audio Production",
        "Utilities",
        "Music"
    ],
    "achievements": 11,
    "positive_ratings": 210,
    "negative_ratings": 33,
    "price": 13.59,
    "description": "Rytmik is a powerful music station allowing you not only to play with samples and musical instruments but also to mix them together, shape them and create music clips or whole songs for your Friday night set-list.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/375840/header.jpg?t=1551455332",
    "minimum_requirements": "OS: Windows Vista/7/8/10 Processor: Single Core 1.6 GHz Memory: 1024 MB RAM Graphics: 3D graphics card supporting DirectX with 64 MB of memory Storage: 350 MB available space Sound Card: A compatible sound card",
    "recommended_requirements": "OS: Windows Vista/7/8/10 Processor: Dual Core 2.0 GHz Memory: 2048 MB RAM Graphics: 3D graphics card supporting DirectX with 64 MB of memory Network: Broadband Internet connection Storage: 350 MB available space Sound Card: A compatible sound card",
    "reviews": [
        {
            "review_text": "It's written in Unity and that has certain effects, like for example if you move the window while your track is playing it will stutter until you stop moving the window.  I went into this knowing it was obviously way more limited than a full DAW and was prepared to accept that: It is after all a lot cheaper. I did expect more functionality than there was though.   Basically you have a load of samples. There are quite a lot but you can't add your own. You have one instrument type which lets you draw a waveform with 24 bars and you can adjust the volume envelope and a few other things for all instruments.   In terms of effects though there is only a delay. I expected there would be the usual flanger, phaser, reverb, filter with resonance and so on, but there isn't. Instead some of the instruments have effects on them already so you just have to use those if you want an effect and then you can't tweak it or vary it as the track plays of course. You can tweak the waveform of the drawable instrument as the track plays, in a basic way, by automating the height of each bar, but it's hard to get meaningful results.  Unity actually has a built in low pass filter, high pass filter, delay, reverb, chorus and distortion so I'm not sure why they didn't add these.   In fact because of the limitations of this software I went away and tried to knock up a quick prototype myself in unity. I managed to make a beatbox which would allow me to apply effects to the samples as they played, and allowed the user to load their own samples from disk. It's therefore really baffling why this software doesn't have custom sample ability or effects.",
            "review_score": "-1"
        },
        {
            "review_text": "Pro: Cheap Good looking Easy to learn Alt-Enter full screen  Con: you can't for now add your own sample/wav, this for me is a big CON It be nice if I could export to .ogg, but that is not really a problem",
            "review_score": "1"
        },
        {
            "review_text": "Have been looking for an easy to use software package to make music for my games. This is fantastic. I imagine pro musicians would outgrow it pretty quickly but for someone like me it's more than enough. Easy to use, great sounds and lots of stuff to tweak. Amazed it was made with Unity too. Very very cool package!!! Oh and how can you beat that price? The only thing I found that did a similar thing for a 'reasonable' price was FL Studio Pro for $99.",
            "review_score": "1"
        },
        {
            "review_text": "Great software for making loops or even soundtracks. It is really easy to learn and it has allot of tweaks you can do to sounds. ",
            "review_score": "1"
        },
        {
            "review_text": "Fun and simple software for both beginners and experienced music makers.",
            "review_score": "1"
        },
        {
            "review_text": "Not awful I suppose, it is very limited as it should be for a port. HOWEVER, I do believe a couple more tracks are in order, and also a setting to make instead of one note, and droning of that note to carry. I found it very difficult without proper instruction to figure out how to make some things work. There are little tutorials I realize it just came out, but I think they should release some tips and guides on where to start with say... Simple tones, effect basics. ETC.  All in all for 15 bucks it is worth being able to create music with a casual program, however you are limited heavily and it gets somewhat easier but the UI is a tad off.  I don't want to thumbs down but I don't want to thumbs up either. I am a little neutral, if you like casual 'games' that you can just mess around in and 15$ isn't out of your price range for things that could potentially be a waste. Then go for it.",
            "review_score": "-1"
        },
        {
            "review_text": ". ",
            "review_score": "1"
        },
        {
            "review_text": "I love it it does amazing 8-bit music. Plusyou can just use premade notes if you don't have to to make you own.",
            "review_score": "1"
        }
    ]
}