{
    "app_id": 376310,
    "name": "Otherland MMO",
    "release_date": "2016-09-12",
    "developer": [
        "Drago Entertainment"
    ],
    "publisher": [
        "Game OL GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "MMO",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Massively Multiplayer",
        "RPG",
        "MMORPG"
    ],
    "achievements": 4,
    "positive_ratings": 195,
    "negative_ratings": 357,
    "price": 0.0,
    "description": "The fascinating multiverse of Tad Williams’ critically acclaimed Otherland novels transformed into a full scale MMORPG with a new storyline. New game worlds and improvements, better performance and a revamped UI (soon), Otherland: Next is the next step in the game’s evolution.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/376310/header.jpg?t=1544011325",
    "minimum_requirements": "OS: Windows 7 SP1 Processor: Intel Core 2 Duo 2.4 GHz Memory: 4 GB RAM Graphics: Intel HD4000 DirectX: Version 9.0 Network: Broadband Internet connection Storage: 25 GB available space Sound Card: DirectX compatible audio Additional Notes: Otherland does not support connection over VPN if split tunnelling is disabled and does not support IPv6 connections.",
    "recommended_requirements": "OS: Windows 7 SP1 Processor: Intel i5 or equivalent Memory: 8 GB RAM Graphics: Nvidia 750Ti or equivalent DirectX: Version 9.0 Network: Broadband Internet connection Storage: 25 GB available space Sound Card: DirectX compatible audio Additional Notes: Otherland does not support connection over VPN if split tunnelling is disabled and does not support IPv6 connections.",
    "reviews": [
        {
            "review_text": "This game has no business being available to the public at this moment. The sheer amount of glaring gameplay faults found in the first 30 minutes of gameplay make this disgustingly obvious:  1) I am well aware that this title is supposed to be based off of a novel or series of novels. Despite this, MMOs are generally designed for mass consumption. Not everyone playing this title is going to have read the novels it is based from. As such the game should ease you into it's setting, a brief introduction at minimum and a coherent tutorial would help this immensely. Despite this, I entered the game (admittedly EA, but unacceptable all the less) entirely ignorant of what was going on. The plot behind what I was doing made no sense, why I was here let alone who I was supposed to be made less sense.  2) This may well be the most uninteresting combat system I've ever come up against. While I don't play MMOs regularly (I play for a few weeks/months at a time), I have been trying them since as far back as Asheron's Call (the original). Combat in this game is so sluggish I literally felt like I could gain more entertainment from watching paint dry, I'm not being sarcastic either. There was at least a 3-5 second lag between when I would activate an ability and when it would actually fire in some cases.   3) The UI is INCREDIBLY clunky, the character creation system is even worse. I spent perhaps 5 minutes (of the 28 or so I spent playing) making a character and choosing between classes...the problem however came from having absolutely 0 context on what class I want to play. There are 4 classes to choose from, and while it lets you 'test' each class (a nice idea in itself), the User Interface was not active here however, and wasn't visible until AFTER I chose a class. I was given a single weapon (of the 3 available to my class), the UI wasn't visible so I had no idea what my skills were for that class let alone their effects aside from guesswork.  4) I honestly couldn't even finish the tutorial. For starts, they didn't even have descriptors for the quests IN THE TUTORIAL, the most bare-bones section of the game. On top of this, I had no idea what I was supposed to be doing once I got past my first combat (which, as I mentioned above, was remarkably dull and clunky in itself). Even once I figured out what I was supposed to be doing, I couldn't finish my objective because mobs respawned so rapidly that I couldn't interact with the required objects fast enough before they attacked me again and interrupted.  In short, Otherland MMO is a ♥♥♥♥ing mess.",
            "review_score": "-1"
        },
        {
            "review_text": "So I've gotten bored of the MMO I've been recently playing, and had for awhile, and tried this. At first it is really bland 'At first you say?' Yeah, at first, and beyond. I can't even log in after the first time. I'm stuck at 'Loggin in', and no matter how long I wait, which I've tried three times and each up to thirty minutes.(I'm trying to log in a fourth time as i write all of this out of frustration.) The game is not fit to be out to the public, and I'm surprised it isn't considered in 'Early Access' like other games. Overall just a bad game, like I can't even fully review it because I can't log in to play more.",
            "review_score": "-1"
        },
        {
            "review_text": "Just, no. Nowhere close to being fit for a release. Go home and try again.  In spite of having a computer that exceeds recommended hardware by at least a generation, if not two or three, a computer that I usually need to try to make the FPS stutter on most games, this one puts out, at best, 30fps. Averages are likely below 20, with segments that dropped as low as 3.  The combat, from what little of it I could see before I decided I was wasting my time, was long and drawn out, not unlike two cartoon characters beating on each other with rubber mallets: it's the fight that just won't end.   Usually when I have something bad to say about a game, I can point out some nice things, but, there's just, nothing that I've seen in this that's nice. Not the combat, the UI, the performance.. ..on top of all that, it's a whallopping 18 gigs for a game that looks old already.  It is free, so there's little reason not to try it.. ..but I can't find any reason to try it twice.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't even play it :( Hanging on the 'In Queue' screen and tried to be patient. There are no progress information so I don't know how long it'll be. Gave up eventually. Can't really say I recommend this game when I can't even play it :(",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not let you start after charter creation. Dont get this game...Sad",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is cool, the tutorial is COMPLETELY useless. controls are stiff, they say action combat but they really mean is normal MMoRPG combat eg, world of warcraft style. Sure you can move and 'TRY' to dodge but, no. You can stand there and take the hits. You want a real Action combat games, play Guild Wars 2 or Elder Scrolls Online.  Want to play a game like this, play Phantasy Star Online. I got through the intro levels and got into the game a little bit (got more exciting) but over all the intro levels can tell you what kind of game play your going to be looking at. If you want an exciting game to play I'll say again play the three games I've listed above.  Over all from a quick play through I'll say dont play this game. The videos of the game made me get SUPER excited to play the game, but once I did. The feel changed dramatically. It's an okay MMo but not one I can see people playing avidly. The game HUB was so dead, I didnt see ANY other players so that right there tells me the game is dead.   The in-game options were a joke, just your standard Video, audio and keybinding options. The H.U.D elements you can resize but cant disable (got annoying after a while) you can however hide the chat so that was at least nice but pointless considering.  So I'll end this like this: dont play the game, try it out to see if YOU will like it, but in all honestly the game was bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh boy, where to begin?  First of all, I could not rebind any keys or mouseoptions before entering the game. And speaking of mouseoptions there's just one, invert mouse. No sensitivity or anything, but luckely the camera speed fit me well. Keybinds were ok but you could not bind combinations of keys, for example ALT-1, CTRL-F etc. Every bind had to be set to a unique physical key. But I could work with that.  Graphics? They're bad. Last gen console bad with very very few options for you to set. With everything on Ultra and 1080p it's a blurry, and yet pixeled mess. There's a fog infront of you all the time cutting down visual range a lot, and then there's the animations, oh my. Add the fact that it also perfoms bad. I almost got nauseous because of the visuals just trying to get through the tutorial/Intro.  And then there's gameplay. It's as exciting as any flashbased clickergame. You actually have to shut down your brain to get through the tutorial/Intro, which is unnecessary long and really don't teach you anything. Combat is boring. Aim at a red colored foe, hold down left mousebutton for a minute, kill foe. Repeat a dozen times untill your quest is complete. Repeat. Avoid AoE because that will just swarm foes on you and you'll die. If you die you can just spawn where you died and continue. Attacks have a delay that makes it feel even slower than it is. Pew Pew, wait .... Pew Pew, wait.   Lag spikes were common, and I have a feeling that the servers are run on potatoes.   Classes are your base stuff you see everywhere, non exciting at all. Melee Tank, Melee assasin sneak guy, Ranged dps, and a ranged buffer. The RPG system is simple and uninspiring and the same old *beep* that's been the standard the last decade. Four stats, where's two are important for each class. You level up, but have no choices to do. You just get some stats automatically.  Though I had no fun I still managed to go through that messy Intro just to be able to see the 'real' game. See if my impressions were skewed just because I didn't like the beginning. Got into a new map, boom, FPS dropped from 60 to 40, got swarmed by enemies and the only objective I had was 'Survive'. I did not and woke up in a prison, which I seem to be stuck in. I cannot get out, there's nothing I seem to be able to do here, and noone to talk to.   That's when I ALT-Tabbed and had the urge to write this.   The End",
            "review_score": "-1"
        },
        {
            "review_text": "THIS ENTIRE GAME IS JUST 18G OF BS! wanted report bug but i guess this entire bullcrap is a bug =/ NOTHING GOOD ABOUT THIS",
            "review_score": "-1"
        }
    ]
}