{
    "app_id": 376300,
    "name": "GUILTY GEAR Xrd -SIGN-",
    "release_date": "2015-12-09",
    "developer": [
        "Arc System Works"
    ],
    "publisher": [
        "Arc System Works"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Fighting",
        "Anime",
        "2D Fighter"
    ],
    "achievements": 48,
    "positive_ratings": 1900,
    "negative_ratings": 153,
    "price": 22.99,
    "description": "Kept you waitin'. GUILTY GEAR Xrd -SIGN- is finally here on Steam!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/376300/header.jpg?t=1478671351",
    "minimum_requirements": "OS: Windows 7 / 8 / 8.1 Processor: Intel Core i5, 2.0 GHz Memory: 2 GB RAM Graphics: Nvidia GeForce GTX 560 / Radeon HD 7770 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 12 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "First off I just want to say that ASW really knocked it out of the park with this port. Game looks fantastic and plays great online.  One thing that I'm amazed at is how awesome the training mode is for this game. They really teach you the VERY basics of how to go about playing this game. It's something that will ease beginning players in without having them feel overwhelmed by everything right from the get go. From there you've got a mode that teaches you combos and another mode that puts you in typical situations that you'll find yourself in from time to time while playing against opponents. Along with the is a very fleshed out freestyle training mode that they been offering us since 1998.  Online play seems pretty smooth right off the bat, although there are some who seem to be having issues with lobbies at the moment. Aside from that, playing in game is smooth. If there was lag then I'm oblivious to it. The few matches that I had so far felt great... Aside from me getting stomped into oblivion.   While some people will scoff at the number of characters in this game, I see nothing wrong with it as you can see ASW seems to have gone with quality before quantity. Every character has been animated in a way to replicate the animation frames from the older games. It's a joy just to sit back and just watch the characters, attacks, specials, instant kills, and intros/outros.   I haven't had the chance to try out Story, Arcade, or any other of the modes so far due to trying to learn Ramlethal at the moment, But as soon as I do, I'll make sure to update this review. But from what I've experienced you shouldn't even hesitate at spending your hard earned money on this. It even comes with a slew of goodies. Including an awesome soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Guilty Gear Xrd -SIGN- is the Best game of my life!  Here we go with my fast Review:  * Game looks fantastic!, run smoothly with my middle computer specs features. * Have Coop local player, so, you can Kick some friends as you wish, xD ! * Have great Anime Art and great scenes when you are playing ( 2D like 3D ) * Great movements and Fight System! * and the most Important!: Have the Best Music that i hear ever! I love it all the songs!    So, i can only say: 'Thanks for the Music! Thanks for the Game, Thank you and Thank you a lot! '   Well, what are you waiting for?, go go go! buy it now! You will feel amazing with the Art and the Beautiful Music for this game, have a fun game and enjoy the Guilty World Fights!",
            "review_score": "1"
        },
        {
            "review_text": "Just as much effort went into -  1) the convoluted plot that puts most anime to shame 2) the wall-scroll tier art that puts most anime to shame 3) the best metal soundtrack in a game ever   - as the actual combat engine.   So that's four times I have to give this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Guilty Gear was probably the first fighting game I played together with Street Fighter, and it remained my favorite fighting game through most of the games in the series. Guilty Gear XRD -Sign- is a fastpaced fightinggame with the same feeling that the old GG games delivers.  The port is good from what I've experienced sofar, I'm happy to see Guilty Gear XRD on Steam  Probably one of the most overlooked / asked questions is 'How is the netcode?' Imo the Netcode is good, still delay system and not ggpo but its working just as good. Altough some occasional disconnects 'Opponent has left the game' not sure if it is ragequits, or some kind of issue. Anyhow if its an issue, its most likely gonna get fixed.  * Things that I'd like to see in the game thats not making it a 10/10 * UI Upscaling makes the UI looks less beautiful than the rest of the game. However, once you play you dont notice it much. * The occasional Disconnects online (Doesn't happen very often to me though) * Some Characters are missing from Original Series * There's some issues with Ranked play atm for me atleast but Lobby / Player matches works like a charm  Aside from that I'm loving Guilty Gear Xrd -Sign- on Steam, cant say much about how its compared to ps3/ps4 but I've heard its better than ps3 atleast.  Graphics: 8.5/10 Music: 10/10 Who doesnt love Guilty Gear music? ^_^ Characters Uniqueness: 9/10 I still miss some classic characters, Zappa, Jam, Johnny, Dizzy but its great! Gameplay: 10/10 Always loved how Guilty Gear played compared to other fighting games Netcode: 9/10 GGPO / rollback could of been more nice but I'm happy with what the game has. Difficulty: 9.5/10  My Total Score: 9.5 / 10  Is it worth a buy? Definately, its at a sale atm and it includes DLC characters  Is it worth a buy after sale ends? Definately, its still Guilty Gear ;)  Add me on Steam if you want to play or need help!",
            "review_score": "1"
        },
        {
            "review_text": "Guilty Gear Xrd is the most beautiful 2D fighting game utitlizing 3D graphics I've ever seen. Nothing can even compare to it. Street Fighter? Mortal Kombat? They can't even compare to the vibrant style of Guilty Gear. Much like how Guilty Gear X was a huge graphical achivement for 2D fighters back in 2000, Guilty Gear Xrd has set a new achivement for next gen fighting games.  Once you get past how mind blowing this game looks and get into the gameplay, it's very familiar. This game very much feels alot like classic Guilty Gear, they did a great job keeping the feel of the game very much the same. Utlizing Roman Cancels has been eased a great deal and are easier than ever to use, although some people may not apperciate the changes, particularly the slowdown during them, as well as how simple and even derp they can be this time around. I wasn't a fan of FRC's in the older Guilty Gear XX games, I felt they were just too hard to use and the new Roman Cancel system is alot easier to use, but maybe a bit too easy. It's not hard to really abuse this system and it can be quite obnoxious. It's hard to please both crowds though. Really the only new mechanic that I think really raises an eyebrow is Danger Time, which is just really silly and shouldn't of been in the game.   You can't discuss Guilty Gear without mentioning the audio. Most of the classic Guilty Gear sound effects are back, and the cast of characters sound great (In Japanese). I'm still not really used to most of the new character themes in the game yet, I liked alot of the original Guilty Gear X/XX soundtrack, but given time it'll probably grow on me.  Online Play can be either hit or miss as with most fighting games, but it's a good system allowing several games in one lobby to go on at the same time.  I'm looking forward to watching Xrd grow and bring back many classic Guilty Gear characters over the next few years.",
            "review_score": "1"
        },
        {
            "review_text": "This game is excellent. Can't wait for -REVELATOR- on PC.  ",
            "review_score": "1"
        },
        {
            "review_text": "I have never seen, heard, or played Guilty Gear before so I had no idea what I was in for. I got conquered by a pirate girl weilding an anchor with a lot of moxie. I got 1000 years of death punctured up my rear by a mad man wearing a paper bag. I got vanquished by a voluptuous woman who then proceeded to proclaim her undying love for me. This all happened while glorious heavy metal was piercing my eardrums. 10/10 I would definitley Guilty Gear again.",
            "review_score": "1"
        },
        {
            "review_text": "It's the same great game as it is on consoles, with better graphics in-game, and some welcome changes for a PC port. The lack of in-depth options is dissapointing, and the game has quite a few minor issues that hurt this port. That being said, this port has fantastic netcode! I had 2F delay to somebody in Seattle! That's insane if you consider the before this I've only ever had 2F to a person living near me. For that reason alone, this PC port is a big step up for Arc System Works. It's not rollback, but it's pretty damn good. I recommend this game to anybody interested in fighting games (so long as you don't gush over Elphelt :^) )  I'll now list the issues I've discovered.     You can not change your resolution in full screen mode. Full screen is a seperate resolution option.    The games UI is from the PS3 port. The in game graphics are not, and neither is the hud. Unfortunately, this makes the menus look awful when upscaled to 1080p. They don't look very good at 720p either.    Anti-aliasing seems to have no effect. I can clearly see jaggy lines no matter which option I set my AA to.    There are no (obviously) usable configs within the games files. I can not change the settings to optimize it's performance on my system. (This is somewhat alleviated now thanks to a community guide showing me how to downsample from 4K resolution. Game looks pretty great and runs well.)    The game seems to be having memory issues for me. If I play the game for quite a while, the framerate will slow down between 30-50 and run extremely poorly.     The music may be of slightly lower quality than the music in the PS4 version. As well as this, the character attack sounds are kind of bad. Especially on Axl, I hear awful audio crackle. It's very obnoxious.    Player matches are very buggy at the moment, if a lot is going in in public lobbies there seem to be many issues causing players to vanish, be fighting no opponent, or just get kicked out of the lobby. It's a little tricky to play online right now. Ranked matches aren't fairing too well either, I can't play ranked right now due to a bug. The game will claim they declined the match almost instantly, but this happens with all players in ranked mode right now.  This issues aren't the end of the world, but I'm sure we'd all appreciate it if these problems were fixed.  Also, Elphelt should be removed from the game. Not really, but she just doesn't fit in with the cast if you ask me. Who won a competition to get their waifu OC in the game?  ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent port of Guilty Gear Xrd -Sign-! Everything works perfectly!",
            "review_score": "1"
        },
        {
            "review_text": "Guilty Gear is my favorite fighting game franchise since the early 2000's and all I have to say about Xrd is that it is a masterpiece. Both in terms of gameplay mechanics and visual fidelity this game has exceeded my expectations. That is why I bought it on PC and PS3. The most striking thing about the game is how convincingly the art team managed to mask 3D models as 2D sprites. Nobody else has acheved such perfection in this type of art direction so far. The game is worth the price only to experience the beautiful animations and artwork. ",
            "review_score": "1"
        },
        {
            "review_text": "Some of the most fun I've had in a long time. Highly recomended if you want to get into a 2D fighter. It has a great totourial to get you going, and comboes are not nearly as hard as they are in some other fighting games. Loads of single player content if you wanna take the time to do it.  The online is very good, I have not experienced many bad connections during the time I've played, so you don't have to rage at connections alot :)  A minus to the game might be the non interactive story, but I found myself enjoying it alot, as it built up the world of GG for me. For the best enjoyment of it, just sit down and watch like it's a free movie you got with the game. Preferably you start with the arcade first, as it provides some backstory to why characthers are where they are!",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced fighting game. Lots of fun. Amazing story. Love it !",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Worth the money! I wish it had more graphics settings though. Its not running all that well on my macbook pro with the intel iris 5100 graphics card",
            "review_score": "1"
        },
        {
            "review_text": "Great port of a really great game, if you like fighting games then you are going to love this one but don't expect an easy game because it's not. Nothing much else to say about it, works fine and plays fine, no netcode issues so far, optimization is great, graphics are great, the price is even cheaper than the console version and it comes with all the dlcs for free for the first month.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved it. no issues. net code feel better than console overall. Glad it is released on steam",
            "review_score": "1"
        },
        {
            "review_text": "Great game, runs on my toaster and still looks great. If you like 2D fighters, you'll probably like this.",
            "review_score": "1"
        },
        {
            "review_text": "Get up to rock! Get up to burn! Stand up with pride! I’ll be the ways to maker! You must have heard it! Grasp the truth! Hold it high! Raise your fists! That’s why it’s made to start with! You haven’t heard it go! ♪ ♪ ♪ ♪ ♪",
            "review_score": "1"
        },
        {
            "review_text": "I like the characters and for the price it isn't awful. The ranked matchmaking is broken, so you will mostly be using lobby play.  The big problem is that Arc System Works will kill the series again after a few years by re-releasing the game with minor changes every few years charging full price + dlc. If they offered us a way of upgrading by buying incrimental patches like SFIV to USIV it would be fine, but just know what you are getting into.",
            "review_score": "1"
        },
        {
            "review_text": "Never expected this to come to PC, this is a suberb port. The fighting system is very fluid and the input buffer makes it friendly for more casual players. Netcode works very well. If you've every enjoyed a Guilty Gear game, or are a fan or fighting games in general, this is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Good port (better than the PS3 version). Online works well againt people who are geographically close enough. Good price. What more can you ask? If you like fighting games, get this.",
            "review_score": "1"
        },
        {
            "review_text": "Thank you ArcSys! 本当にありがとうございました。  This game runs perfectly on an MSI Dominator Pro GT72 1920 x 1080  Intel i7-4980HQ 2.8GHz 32 GB Ram  Nvidia GTX980M  Win 10 Home 64 bit   BTW: Anyone having trouble with jump cancels: try inputting the direction plus the attack button  at the same time, just after the attack you want to cancel connects. (instead of inputting the jump and then the attack button.)  Plays and looks better than the PS3 Version. Virtually no input lag with MadCatz Arcade Versus SH or anything with a compatible xbox360 pcb. Doesn't like the RAP4 Silent as much: button map is off and the usual ps3 pcb lag.",
            "review_score": "1"
        },
        {
            "review_text": "BGM/sound: 1000/10 Game play: 2000000/10 Stroy: 50000000/10 Graphics/2D/3D/anime: 10000000000/10 Elphelt: infinity/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Do not, I repeat DO NOT.... trust Faust as your proctoligist.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun. Great character, probably the best PC port of a fighting game on steam to date. The best. No acception.",
            "review_score": "1"
        },
        {
            "review_text": "This is possibly one of the most enteratining fighting games on the market now. The learning curve isn't as steep as previous Guilty Gear titles, but the mechanics are still rewarding. If you have experience with fighting games this is an excellent title that will challenge and reward you for taking some time to learn your characters.",
            "review_score": "1"
        },
        {
            "review_text": "Guilty Gear series seems to be never tired of getting quality bar rised. This game is a tsunami of awesomness breaking in your face. The music, animations, graphics and game mechanics is top notch, I find myself smiling while playing it because of enjoyment.  Refined network multiplayer lobby system deserves special mention and dithyramb to developer team, since it reflects their attitude to community needs.  The only questionable solution about this game I could find is Unreal Engine 4. No doubts that the game look gorgeous, you can find details (on polycount) about how dev team operates game engine - obviously a huge job and thinking out of the box all the way, but still UE4 is being greedy for harware resources. My resolution is 10\\10, even despite the fact I am unable to have 60fps on my hardware atm.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great addition to your collection of fighting games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic but I want Jam miss you Jam...",
            "review_score": "1"
        },
        {
            "review_text": "One of the best PC fighters of 2015 that released nearly to perfection only minor bugs upon release (primarily online bugs). Great optimization settings; works like a charm and doesn't even cause stress performance even on High optimization settings.",
            "review_score": "1"
        },
        {
            "review_text": "After a long wait GGXrd sign finally is on steam. The game runs great maxed out on my system @ 1080p (FX 8350 @4.6 ghz, Gtx 670, 5gb ram Windows 7 64 bit) Stable 60fps online and offline. My qanba q1 xbox 360 stick works flawlessly so im sure any xbox 360 compatible stick will also work well.",
            "review_score": "1"
        },
        {
            "review_text": "The game Runs on toasters its decently optimized for Intel and Nvidia cards. I have a dual core 8800 GT and 3 gb of ram and the game runs at constant 60 fps. Just read a bit about how to configure it and set up nvidia control panel anc chances are you wil be able to play it. Netplay is also decent not GGPO level but id compare it to SFIVs netplay. Its delay based and does its job.  Only girpe i have is how configuring keybord controls while posible is kinda annoying to do the first time and regardles of the ingame controls the menu navigation controls stay the same.  Keap in mind even if yu get 60 fps SP online neads slitly more power to run flavlesly.",
            "review_score": "1"
        },
        {
            "review_text": "Great port from from the console version (or arcade not really sure). The netcode works just as well as in consoles and although there's a few issues here and there with the lobbies right now, they'll probably fix it soon. Graphics look amazing and the action is really smooth. Greatly recommended for people who want a good fighting game on PC",
            "review_score": "1"
        },
        {
            "review_text": "Performance: Great console/arcade port. I am not talking about the niceness of the anime style, but the overall graphic is simply flawless and stutterless,  anti-aliasing made it as if this game is especially made for PC. You'll notice the moment you play it, compared to 'other' simple console ported games, this one is alot well done.  Gameplay: Relative to many players. Unlike SF4 with extravaganza super moves that attract new players and then drop them off in the endless cliff of frame-specific combo, this game is quite linient in term of learning. This game might be fast paced, but it is still rhythmically (word?) easy to follow through. While this game offers 'instant destroy' moves, and this is the unique feature, it is not actually useful in real game, but it sure eye candies to see. Finally, the anime style cutscene within games is just a beautiful concept and also original!!  What make this game preferrable than other fighting game?: GG series have great seiyu (voice acting) since the very first game, I have yet to see other fighting game with that comparable aspect. GG series also have one of the greatest JRock soundtrack which somewhat suitable with the style. Thanks to Daisuke Ishiwatari (searchable from itunes/xbox). This game doesnt punish players for having their own playstyle, from button mashing, spamming fireballs (lol), to high speed cancel moves. So yeah, dont go to Vesper Arcade youtube channel, and then try to immitate what they do into your playstile.... just play with your own. (however, online battle might be so tough for some players)  I would recommend this game I might be biased, because I have been playing this series since PS1 and coin ops arcades, so yeah...",
            "review_score": "1"
        },
        {
            "review_text": "Great port of a very good fighting game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most complete fighting games right now. Both single and multiplayer are great, Capcom should learn from Arc System.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, so I first saw this game on Friday Night Fisticuffs (a semi-weekly YouTube show on good fighting games, along with Saturday Morning Scrublords which covers the other side of the spectrum), and thought: -Well damn, that looks pretty awesome, I just might get that! While googling around I found a fascinating video from GDC (Game Developer Conference), where a developer (whose name I can't remember of the top of my head, sorry) talked about and showed the creation process behind the graphical style, which was the game's main selling point. The graphical style being anime with 3D models, which as far as I know is the first time it has been done in a game like this. Note that they even reduced the frames in the animations so it would look more like 'regular anime'. (I also found a price tag somewhere:59.99, whoa!)  Well then, as for the game itself. I'm just going to throw this out there, I have never played a Guilty Gear game before, and I've proven myself time and time again to be horrible at fighting games, so I am not really the best person to give this game a fair review.  What can I say, the game is fun, looks awesome, it's colorful, the soundtrack is pretty good and I guess it kinda' helps building the style of the game. The characters look awesome and the voice actors fit (admittedly, I have only played with the japanese voices 'cause I was recommended to do so, my inner weeaboo approves)  Like I said, awful at fighting games, so the first thing I go to is the tutorial, which just covers the basics, then goes WAY deep with the Roman cancels (which I forgot about, until I got the achievment by accident).  To conclude, as a game, neat. Probably wouldn't work as your first fighting game, barely worked as my second. Still, don't take it from me, I'm just over here semi-mashing my way through the arcade mode.",
            "review_score": "1"
        },
        {
            "review_text": "it's ok if ur bad at the game there's boob at least 3 boob just for u.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, if you like fighting games or want to get into them this is a good pick.",
            "review_score": "1"
        },
        {
            "review_text": "This is gud 2d fightan.",
            "review_score": "1"
        },
        {
            "review_text": "I've bought this game three times now and I'd do it a fourth.",
            "review_score": "1"
        },
        {
            "review_text": "Very good port. Online was good from what I've tried. Really enjoying M.O.M mode. Controller support works perfectly for me.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone is saying 'Buy Revelator instead', but at the time im writting this Sign is only 13€, so buy this and if you like it play it until Revelator goes on sale for under 30€. If you have a Ps4 you should buy Revelator on that, its only 20€ at most game retailers now and the community is bigger since it's console.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning,.. There's a long long life ahead for Xrd.  Thank you arksys. just.... Thank you.",
            "review_score": "1"
        },
        {
            "review_text": "Strongly, strongly recommend this game after the multiplayer input bug gets fixed. Spent extensive time with this game on PS4.  Easily my favorite current-gen fighting game.  The Good:  Gorgeous graphics, incredibly fluid movement, mechanical depth, and good character playstyle variety.  Beautiful 2D sprite aesthetic (despite using 3D models).  Gameplay: Fun neutral game. Good input buffering for combos. No touch of death ♥♥♥♥♥♥♥t like MvC. Combos aren't boringly long like in Skullgirls/MvC. Less awful input correction than SF4.  The Bad:  Bug: game client starts getting frame lag and sound stuttering after about half an hour of multiplayer. Doesn't affect everyone, though. May want to wait for this to get fixed. UI Oversight: Using 720p assets for the in-game menus, instead of 1080. Makes the least important section of the game look grainy, but it's still sloppy.  Both issues are specific to the PC port. The PS4 version didn't have them.",
            "review_score": "1"
        },
        {
            "review_text": "Never thought I would enjoy these sort of game as much as I did here. Really well made and enternaining piece of work. Story too adds to experience.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this on PS3. It did not look or feel as good. I never thought it would come to PC, at least this soon of course. I'm glad it came out sooner than expected. It has slightly more content as well. Very happy to be playing it on my powerful rig.  I just don't play on consoles anymore. I rather be on PC. Hopefully they release things on PC day 1.  Anyhow what people want to know: As usual GG always has solid fighting mechanics. The controls are sleek and responsive. You never feel totally cheated or walled in like other fighting games. Beautifully animated and use of cell shade, and engine. Most of all story mode... Its true men can cry. Perfect music score characters. The voicing is very good as well, not great but does the job. All I cared about was Sol's voice since he is my fav character.  I wish they would have added more characters. Oh and another thing I love about this game. You know how some games you do double quit not here they were actually smart enough to use one when you go to title screen and press select to go back to desktop. Finally a game genious enough to do this.   I advise any hardcore fighter play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Elphelt too cute",
            "review_score": "1"
        },
        {
            "review_text": "Elphelt too cute",
            "review_score": "1"
        },
        {
            "review_text": " When's Revelator?   Fast-paced and fun, Guilty Gear Xrd -SIGN- is a phenomenal 2D fighting game, featuring a cast of unique characters, a plethora of fun moves, and smooth gameplay perfectly complimented by fantastic music and great graphics. The game's art style uses 3D models, but deliberately makes everything look 2D in order to channel the feel of the older Guilty Gear games, even going as far as to make several of the attack animations intentionally choppy. Strangely enough, that choppiness actually makes this game look better. I don't understand it either.  Of course, by the time this game came out on PC, people were already clamoring for the second Xrd game, -REVELATOR-, and by the time  that  game releases on Steam we'll probably already have a third game in the works. This is still a very fun game, though. If there's one criticism I do have, it's that Arc System Works' games tend to not have the greatest netcode out there. The game's online functions well enough, but suffers from delay at times and doesn't seem to cooperate very well with streaming software, or at least it didn't for me.  Also the game has Elphelt Valentine and she is 150% cute so play this game okay",
            "review_score": "1"
        },
        {
            "review_text": "Where the ♥♥♥♥ is Revelator, Arcsys?  I'll first day buy that ♥♥♥♥ just ♥♥♥♥ing release already.  I guess since I do reviews of stuff in a serious manner I might as well make this half-serious: game is good. The tiers are really, really close and tight to the point where no tier list is agreed upon, as opposed to SFV or KOF2002 whereby the tiers are pretty much set in stone. In other words: all the characters in this game are viable and no one is truly bottom tier (other than Potemkin and Slayer). This game is incredibly well-balanced, which it should be since these characters (minus the new ones) have been getting honed and worked on for close to a decade. Which makes me wonder why the SF characters that have been there since II aren't as balanced and close in terms of tier strength and viability.  There are no clone characters. Every character is unique and your skills with that person doesn't carry over to the other, precisely because they are so unique. The point is better accentuated through contrast: Gouken, Dee Jay, Ryu, Sakura, Dan, Akuma, and Sean are all different characters (with different placement on tier lists). But in many ways they are simply different takes on the same formula: they all have roughly the same inputs for specials and their differences are just that their Dp's and Tatsus are different takes on the same move. It's variations of the same principle; they are all shotos.   GG on the other hand has much more variety in characters and your skills with one won't carry over to another. Some characters have their own unique ''gimmicks'', like Sin's hunger gauge that depletes with every special used but, conversely powers up specials the fuller it is. Venom has pool balls he sets on stage he can teleport to, and all his moves launch them in different trajectories, angles hit also matter. Or Johnnys limited coins for a bout that-oh wait that's in Revelator WHERE THE FU*K IS REVELATOR ARCSYS.  The point is that because the characters are much more varied and different than SF's roster you have to dedicate yourself more to each individual character to truly master them. It took me 70 hours to get a grip on Axl and all the matchups he has; in 100 hours I mained around 8 different characters in SFIV. Granted I'm also much better at GG than SFIV so take that however you wish.  Because each character has their own unique playstyle that doesn't really carry over to any other character your matchup in GG matters more and the manner in which you approach people may drastically change. Against a Venom I know he has projectiles all over the map that hit my hurtboxes, so I rushdown and use my long range normals much more carefully and less frequently (which is REALLY FUC*ING WEIRD FOR AXL); against a KY I make use of my Rensen a lot more just as a pressure tool and don't follow up; against Sol I mind the flames on the floor and am careful with my chains since they have hurtboxes his DP can stuff. Like any fighter your general technique is the same but because there's more variety here in the roster and playstyles you'll find yourself playing much differently depending on the matchup.  I'll end the SF comparison by saying this: ♥♥♥♥ 50/50's. There's none of that bullsh*t ''will he grab or dp on my wakeup'' that some characters in SF have, and thank GOD cause if it's a literal guessing game then eff that.  What there IS here is an EXTREME emphasis on okizeme and mixups/rushdown. This might as well be called, ''okizeme: The Fighting Game''. For those unfamiliar: oki just means your tactics on the enemies wakeup. So after a hard knockdown, what comes next? That's when your pressure game and your mixups come into play; your oki game. This game has a larger emphasis on hard knockdowns and pressure than any other. What this means is that if you're new at this you're gonna get perfected 10 times over; if this game teaches ANYTHING it's how to EFFIN BLOCK.  But if you think turtling all game is great; it's not. Your super gauge (called tension in this game) is completed depleted if you're just holding back all the time. You're penalized for turtling by having your entire gauge erased and by taking even MORE damage from the next hit that connects and isn't blocked.   So not only does this game want you to learn how to block, but it also wants you to do as little of that as possible and to look for holes in offense and counter attack. This makes for fights as hype as MvsC3 fights, except without the touch of death combos due to perforation (reduced damage as the combo continues) and the myriad of defensive options this game has.  You can parry for 1/4'th your tension gauge. You can have your tension gauge slowly deplete if you activate Just Defense, which negates all chip damage. You have Dead Angle Attack, which is essentially a dp for half your gauge (usefulness varies by character). And you can Instant Defend, which builds up tension as you block, by blocking at the proper timing (think of it as SFIII parries, except you press back). There's also Burst, which can be used offensively or defensively. It builds slowly over a match; faster if you're taking damage, but you start with it full at each fights start. Your character jumps up negating all hit or block stun and lets our a burst, hitting your opponent. This can be used to get out of pressure or offensively to gain 100% tension. Whether you need tension more than the defensive option it provides depends on matchup and how confident you feel.  Finally there's roman cancels. You have three roman cancels, which use different amounts of tension but all do the same thing: cancel what you're doing right away. It's SFIV's FADC; only more intuitive and much more central to play. You can do X and roman cancel; you can stand still and roman cancel; you can roman cancel the recovery, but it all costs tension. Depending on the matchup and your character you may need to roman cancel your approach with a projectile of some sort, or you may do a mixup and roman cancel for a continuation. Axl, for example, has a command grab that has range; you can roman cancel it on the enemie's wakeup when they jump to use your anti air chains, so you're essentially doing an unblockable if timed right. But the enemy can jump and roman cancel in the air (roman cancels slow down time slightly), and dash forward with the extra time gained.  So roman cancels are central and can lead to mind games, as well as the creation of space and some cheeky cheeky cheeky plays. In many cases your tension is better put to use with roman cancels rather than supers, although some characters have really good supers that can be used as reversals and are useful in particular matchups (ramlethal can use hers to close the gap with Axl and get up close for a hard knockdown, but she doesn't need it against, say, a Sol).   it's a fantastic anime fighter with a lot of depth to it that makes it fast, hype, but also deep and tactical. It's like MvsC3 or Skullgirls but fast and with a lot of tools and complexity. The online is still alive; albeit GG is nowhere near as popular as the mainstream fighter (since there's really only one) Street Fighter. Mainly because it's much harder to get into any individual character and generally more complex in...everything.   Oh and it brings a 6 hour movie. GG has an assload of lore and story to it that I keep telling myself I'm gonna get into but never do. The music is also incredible, the presentation is fantastic, the designs and art are great. It's pretty much the best anime fighter and, in my opinion, 2D fighter on the market at the moment. Now WHERE THE FUC* IS REVELATOR I WANNA PLAY JOHNNY ALREADY.",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome, every character is a piece of art itself, the engine is the best to my liking, easy to take up and hard to master, online works great . 10/10 no doubt",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome, every character is a piece of art itself, the engine is the best to my liking, easy to take up and hard to master, online works great . 10/10 no doubt",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: You can't rebind controls outside of 360 gamepads or the keyboard, so if you have a fightstick hooked up to your computer, you'll have to use JoyToKey, AntiMacro or some other program to bind keys to your buttons.  And other than that, it's a pretty great port. The performance is great, and Voice Language select is a more than welcome addition. There are some minor issues like a pixelated HUD that you need to dink around in the game files to fix (It's Unreal Engine, so it's fairly easy to find what you need to futz with to fix it. I'll be attempting to downscale from 4k in the game soon, so I'll update when I do that.",
            "review_score": "1"
        },
        {
            "review_text": "You gotta loop it    Good game. Has a memory leak issue in the current version where it'll dip in frames after 1-2 hours. Just gotta restart.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beatiful and pure art 2D. Worth the money imo. The only bad thing is the online battle, don't expect to encounter an opponent ever. Let's wait for Revelator and hope for the best. Peace!",
            "review_score": "1"
        },
        {
            "review_text": "Prettiest game ever and it runs perfectly on my run-of-the-mill laptop. I think there were keyboard binding issues on launch, but they already fixed most of it. Works with arcade sticks without a hitch. Netplay is solid. Godlike mechanics and gameplay style (RushThatShitDown all the way).  As long as you can get behind the anime-aesthetics... Please drop Sleep Fighter 4 if you haven't yet. Cancel your SFV too while you're at it.",
            "review_score": "1"
        },
        {
            "review_text": "Slightly akward controls in my opinion. Great graphics, great game-modes, great story so far, very unique characters... A rare 9/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "Well, given my username and profile picture, I can't be trusted to give an unbiased review. So, with that said.......  BACK TO BAAAAACK! DEATH COMES A RIDIN ON A MIDNIGHT TRAIN!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best PC fighting game ! Absolutely amazing gameplay ! Wonderfull graphic and music ! I can not wait Revelator !  10 / 10 !",
            "review_score": "1"
        },
        {
            "review_text": "awesome must-have fighter, super fluid, worth every penny. :3 :foxy:",
            "review_score": "1"
        },
        {
            "review_text": "hahah what are you doing man thats a really bad connection get out my lobby dude.",
            "review_score": "1"
        },
        {
            "review_text": "Made a contract with a clown. Had a high old time.  Roman/Cancel would make a contract with a clown again.",
            "review_score": "1"
        },
        {
            "review_text": "its like skyrim with fighting",
            "review_score": "1"
        },
        {
            "review_text": "desperately need to plant my disgusting seed inside elphelt",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, but its dead; the only ones who play are high ranked people, If you want to play you better have a group of +8 friends since that way you can make an Inhouse tournament or something, otherwise just buy it for the ♥♥♥♥ of buying GG games, since they're great.  Great anime graphics though, Liked those.",
            "review_score": "-1"
        },
        {
            "review_text": "Region lock needs to go. Can't find a single game on ranked.",
            "review_score": "-1"
        },
        {
            "review_text": "Guilty Gear Xrd is great fun if you can ever play it. Probably, you can't connect to anyone. If you can connect to someone, the connection will be terrible. If you try to talk to them, literally everything you type will be in reverse. I want a refund. This game is borked.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible controls on the controller that i'm using.",
            "review_score": "-1"
        },
        {
            "review_text": "Delay based netcode.  The online was completely unplayable with someone I can play Lethal League and SFIV with fine. Don't buy expecting it to have acceptable netplay outside of your own county.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game verry much!!  I recommend this game because: 1.Nice Graphic! 2.Nice Story *but the story it's a movie,u can't play the story* 3.The Players.. 4.The ragers. :&gt;  Please add tag team multiplayer like ggx ac Or team like in isuka :&gt; because i wanna be in team with a friend to play :V pleaseee,Onegaiii ",
            "review_score": "1"
        },
        {
            "review_text": "Definitely my favorite 2D Fighter to date. This game looks beautiful and runs wonderfully. The roster is moderately sized, and each character feels very unique. The game has a fantastic soundtrack, and the english voice acting is top notch, save for one character. The tutorials, missions, and challenges are great for getting newer players into the game, as getting into fighters can be somewhat intimidating.  Definitely worth $30, give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Overall, amazing game. Extremely deep and quite well balanced fighting game. Quite a few characters have gone MIA in the transition from the XX series, but what is in the game is pretty nice, a good amount of characters for a first installment in the Xrd series, most of them reworked or slightly tweaked for ease of use (except Zato-1 lol).  Graphics are out of this world, and the game ends up beeing pretty demanding due to that, and graphics options in game are quite limited, but messing up with the .ini file lets you tweak it until it works. I'm running it in a notebook lol. There is some info on what to disable on the game Forum, works as a charm.  The messy lobby system from the console versions have been streamlined, and is way easier to use on PC, still retaining every feature from the console version. Netplay itself is also pretty damn good, even shows you the frames of delay in real time, making it easier to account for it in execution.  Overall, no complaints from me, amazing game, solid port, great netplay. Do yourself a favour and stop playing that sluggish broken mess that is Ultra Elena Land IV and join us in the good stuff =)",
            "review_score": "1"
        },
        {
            "review_text": "I get to see Ramlethal eat a burger. Money well spent.  And Elphelt is waifu.",
            "review_score": "1"
        },
        {
            "review_text": "Upon intensive testing after the recent patch, somehow things improvise drastically (Also after reinstalling the game via a steam restore operation due to a need of reformatting, which yielded a reset system settings file for GGXRD). Also tested on another computer with an Asus R7 250X 1GB which performs exactly like the HD 7770 recommended at the store page &amp; it does run like butter on it. Also seems to perform fine on a HD 6850, but there appears to be problems still with some systems, especially laptops for some reason.  To continue, I now get a smooth 60fps across all circumstances in an extended hours of play &amp; the fight pacing is so fast it's like a different game at all. But of course, that's the GG we all knew &amp; love. Thank you Arksys. With this, I wholeheartedly turn the direction of my thumb for this game.  Where to start, okay. Graphics. I'm never for one to care much about it but this game is glorious. 3D which are made to imitate handdrawn drawings can usually still appear 3D, but this game is a game changer in that field. For most of the time you'll be playing this, I bet your ♥♥♥ your mind would think you're playing a 2D fighting game though that's not the case. It doesn't only look like one, but is animated like one too! The devs sure knows how 2D animation techniques works &amp; implemented it flawlessly with the 3D models (suffice to say, that's a damn hard feat).  Next comes the rule book. Basically, the tutorial. Older GG fans know the stuff, but even then this is the first time that there's an actual tutorial explaining what are stuffs like Roman Cancel, Gattling Combination &amp; Dead Angle, their mechanicsm &amp; how to pull them off &amp; in what situation. There is also a challenge mode which is basically where you learn combos &amp; what probable combo chains you can create with them. This also gives newcomers an opportunity to edge up to veteran GG players quicker.  The fighting in GG is also known to be very fast, as in this one &amp; perhaps the fastest in the genre of fighting games, yet it can also get very technical &amp; requires precise input if you're really thinking of beating people. As hardcore as it is, GG is also surprisingly easy to get into. Any beginner can pick it up &amp; could play it pretty well after sometime. Yet it's of those kind which is hard to master. Real mean gattling combos can get very tricky to pull off but the payoff is tremendous as you could juggle or pin down your opponent given they're clueless on how to get out of your mean pushes, but of course- if your opponent knows what he's doing, he can also save himself in many different way, so no unfair edge there.  Characters are also very diversified in terms of gameplay. Characters range from melee to ranged attackers to other weird shenanigans &amp; none plays the same. The only downside to this however it'd take a really long time if you want to master them all as GG is the kind of game where it pays to main a character of your own choosing &amp; play using him/her almost all the time. So take your pick &amp; train hard. And if you play with too many too much, others will surpass you in any given character.  I'd rant longer. But I need to go to sleep but including this &amp; what everyone's saying, it's a great game, simply put. Some of us are luck to not/no longer face bugs with the game, but hopefully continued support is provided &amp; they can fix the problem.",
            "review_score": "1"
        },
        {
            "review_text": "More Guilty Gear goodness, please!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely deserving of the title of Guilty Gear. It's the first game in the franchise in ages but it's so stylish, looks gorgeous, has great music, and plays very fluidly. The story is also pretty interesting though different from some of the older games. I do kinda miss Bridget but there are a variety of other characters to choose from, some old and familair and some new ones. My personal favourite so far is Ramlethal because she's sexy as f-*Cough*I mean unique and interesting to play as and it's always nice to see a non-OP playable boss character. Got this game on sale but I would've paid full price for it even if it wasn't.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics now that the UI has been upscaled (thanks to Dec 17th's update) This game is pretty much the best port in terms of graphics for Xrd.  Controller Support I use three controllers, a wired 360 controller, an SFIV saturn pad for the 360, and a Hori HRAP 2 with an inpin adaptor for the PS3 and PC. All are read by the game. There are some people that play with controllers unsopported but considering that a lot of PC games are totally fine with just 360 pad support and nothing else, I wanna say controller support for this game is actually pretty good.  If your controller is usopported for this game but works fine with your pc for other games, just get xpadder or something, map the controllers buttons to keyboard keys.  Netplay The connections at 1 bar are not as bad as I thought, I have no problem playing most 1 bar opponents, I can deal with a little delay, its fine for me. Sometimes it stutters, and sometimes it feels like fighting in a fishtank filled with pudding, but that's just how it is when you try to play 1 bar players, it's not suppesed to be good. 2 bar usualy has pretty negligible delay for me so I welcome 2 bar players to fight me. It may just be because this is the slowest guilty gear to date, but 3 and 4 bar matches feel prety much perfect.  bugs? Over long netplay sessions the client starts slowing down, I hope this will get fixed soon. Just restart the game and it corrects itself, but expect it to happen again later. If you're hosting a room, you might as wel host a new room and re-invite everyone.   Buy Melty, and UNIEL.",
            "review_score": "1"
        },
        {
            "review_text": "personally i like this game, i feel that they A. should have just waited to release the new console release instead of this version because in the fighting games most of the time the pc gamers tend to lose out but it's still always will and will always be m,y favorite fighting game franchise.  now on to the game play, if you have never played a guilty gear game before in your life this game is a real treat . its as the advertisements say high paced crazy japanese style 2-D copmbat with an imense amount of depth. Each character has a unique play style that you can tether to your own style to create new and fun combos. now unfortunately i live in an area where there arent many players so i suffer from long distancxe network issues but all in all its still a fun experience and it will definately test your metal as a gamer to excell at this game. the graphics are exceptional for a fighting game and i love the new look from the classic style of this series.  my only real complaint that is the reason i am less fond of this game is that in other installments the characters that were provided before had truly unique weapons and abilities that arent seen in this installment take example bridget or dizzy they did not return in this installment and i felt that the devs decided againtst that for unknown reasons but with the addition to the new characters that have been added they are intresting and fun to play and still as i stated earlier this game is a treat.  now im going to gush okay coming from old installments this game in particular has made you sit infront of your TV for hours mastering and perfecting rediculus and demanding combos it has been a staple oin this series since the dawn of the original guilty gear, only one thing about that has changed in this and that is the YRC or yellow roman cancels system. this allows ytou to burn a 1/4 of your tension meter to cancel anything and everything that you are doing on that exacT frame and this allows you to come up with never before seen combos and for those of you who are advanced mix-ups and mind games. will this was a staple in earlier installments you had to be dead on the money sometimes fram perfect and even then it was a mild advantage if you were able to utilize it through hours maybe days of practice. all anmd all i loive this series and they have breathed a starter of life backing into it and they made my blood boil like it did when i was younger im excited to get back into the swing of playing competeitively again",
            "review_score": "1"
        },
        {
            "review_text": "incredibly fun, fast paced fighter. A bit tough to get into at first but well worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "If Street Fighter &amp; Killer Instinct had a kid, it would be called Guilty Gear Xrd. Very nice tutorials too, great game for beginners.",
            "review_score": "1"
        },
        {
            "review_text": "Capcom could take quite a few pages from the book of Guilty Gear. There is so much more in this game than any other Capcom game. I am talking about features, modes, training, and information. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best fighting game right now and also one of the easiest to get into, this game is very newbie-friendly since the basic tutorial and single player missions will guide you through the basics of the game, basic combos that is easily applicable in real matches and even the advanced techniques, mechanics, and even frame reading. The spikes in difficulty everytime you change it on the settings is also not that steep, players who're new to fighting games can just set it to the lowest difficulty, and start climbing up the difficulty levels as time goes by.  Visual and Story Presentation-wise, this game is absolutely ＭＡＤ!! When you start up the story mode, it's like reading a 3D visual novel with huge ships flying everywhere, explosions, Sol punching Justice in the face, and Rammy eating a burger while playing with a cute little pupper.  Also with the announcement of -REVELATOR-'s release, I do hope that it will also make its way into Steam, I can wait 2 years and more for it ArcSys, just bring it to PC as soon as possible because Kuradoberi Jam's there, and Reichama's voicing her..  My rating might be biased but it's a 10/10. 'Dragon Install' this game and play it until your fingers bleed and your heart's all rusty!  ps: Rammy is legit waifu material.  pps: #StillNoBaiken #RevelatorPls #GiveMeBaiken",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't have the one true robot husbando (Robo Ky) 10/10 still would play.",
            "review_score": "1"
        },
        {
            "review_text": "this is a decent port and it has hardwired controlls which is very annoying for keyboard users but if you use anything else it should be fine.wother than that the game can not go any higher than 1080p and only windowed or fullscreen. the game runs well on my 970 and i have no other problems with it the game has amazing animation with fun gameplay and great metal music",
            "review_score": "1"
        },
        {
            "review_text": "If you like good music this is gold.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game and play it with me.",
            "review_score": "1"
        },
        {
            "review_text": "I think it is second time for me to write a recommendation, I usually dont bother. But for this, I will. This game is awesome, Fast paced combat, a lot of ways to fight with each character. It might be a bit merciless for a beginner though, but game offers various ways to learn how to fight with each character. But again it will be challanging for a new person to duel with another people, as most of us has previous experience, i.e. I did play GGXX Reload for about 10 years. But it is worth it. It is ton of fun to play it with another people, even your friends. For negative parts, I agree ranked is broken for now, but I bet it gonna be repaired soon enough. For me personally there is also matter of number of characters, but it is only as I am used to huge variety that GGXX Reload offered. Buy it, and join our ranks.",
            "review_score": "1"
        },
        {
            "review_text": "the game is amazing, the combos are fun and the graphics are beautiful also the music is excellent and the online play is good you can create a lobby of 8 players, i recommend the game to any fighting game fan",
            "review_score": "1"
        },
        {
            "review_text": "You wanna be crazy! You wanna go freak out! You don't wanna break down in a rusty harp!",
            "review_score": "1"
        },
        {
            "review_text": "ASW actually releases a port at a time that it isn't obsolete.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you've played the old Guilty Gears for the PS1 and PS2, you'll feel right at home with this game. Game still runs smooth as butter despite my system specs being slightly below requirement.",
            "review_score": "1"
        },
        {
            "review_text": "Very good optimization, solid online (at least with people in your country) and cheap. Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "PROS:   -So far the online is fantastic. It is basically as good as Killer Instinct on the Xbox One  -The music hype!  -Very deep gameplay and great tutorial  Cons:  -When there is a lot of crazy ♥♥♥♥ happening, the game can briefly stutter  -Newcomers may have a hard time understanding the mechanics. The tutorial is fantastic, but there is just so much stuff to learn.  Basically it works and its good. Satisfied purchase!   9/10",
            "review_score": "1"
        },
        {
            "review_text": "Thank you Arc System Works! :) I hope Revelator comes to PC as well!",
            "review_score": "1"
        },
        {
            "review_text": "Well optimized compared to other fighting ports, free dlc, good soundtrack, arcade mode with anime cutscenes and story mode which plays like a anime movie, gets good fps, It’s got extensive tutorials. The game have problems but it does not stop you from enjoying it..    ",
            "review_score": "1"
        },
        {
            "review_text": "Best fighting game until GG Revelator comes out!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, just recently got it on steam now that Arc is releasing titles on Steam officially but I have clocked hundred of hours on this on consule.  I regard this series as the king of fighting games because it's so good. Owned every game in the series since the first game on the original Play Station. The skill cap is incredibly high and you can so so much cool ♥♥♥♥. There's so many levels of depth to combat I still feel like im learning from it. On top of that it's a beauty too look at and is much fun to play as it is to watch. On top of that, the soundtrack is metal which is a plus in my book (and it's damn good metal too) and characters are all fun and interesting in their own ways. Super easy to find someone you like.  Though I could praise this game for everything that it is. I have one issue....arc, for the love of god PUT YOUR SOUNDTRACKS ON STEAM! TAKE MY MONEY PLEASE!!! carry on.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent fighting game. Intense and fast gameplay, incredible visual design, and the kick-♥♥♥ soundtrack you would expect from the Guilty Gear series.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good. Pretty ♥♥♥♥in good. Not paid to say this. Why would I be? I'm not a famous person. Just take my word and buy the game. No nippled neanderthal.",
            "review_score": "1"
        },
        {
            "review_text": "  I'll keep this review short, as I lack the technical competence to properly judge a fighting game. While I have enjoyed them (and keep enjoying them) since my childhood (Street Fighter 2 being my first entry in the genre), I am definitely just a casual to this day.  With this being said, I believe this is the kind of game that both casuals and more hardcore players can enjoy. The combat is responsive, fluid and enjoyable, the cast of characters is well known by now, but even after all these years it remains a varied and interesting group, and the new entries here and there are enough to freshen things up.  The graphics are marvelous, I can't believe these are 3d models, and the style remains faithful to previous entries in the series. The soundtrack is also amazing, and deserves praise. The story is... Let's say anime ♥♥♥♥♥♥♥t? It's kind of fun, as long as you don't think too hard about it (the anime movie that is essentially the story mode is well coreographed and has good direction, though, even if the plot is what it is).   I got this game as a gift, and it has been one of the best gifts ever so far! ^_^ Definitely worth it if you are interested into fighting games (maybe avoid the online scene if you aren't truly dedicated, though, as I assume the players are going to be very competitive, and this is definitely faster and less forgiving than, say, Street Fighter 4, for the uninitiated, and the smaller user base probably makes it even harder to find people of lower skill level).",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Fighting games out there. Every character is different and has its own personality.",
            "review_score": "1"
        },
        {
            "review_text": "Came for the Metal, stayed for the rest",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT!!! Been a fan of the Guilty Gear series for a LONG TIME, and this one does not fail to deliver. Responds much better on PC than I hoped and actually fair enough for newcomers to pick up. If you haven't kept up with the series, you'll be fairly lost trying to get into the story. My only other complaint is the new art direction they went with in this one. A bit too cartoony compared to the others. Other than that, if you're a fan of the series you won't be disappointed. The story is FAR more fleshed out than in previous installments and leaves you with a good understanding of events that are taking place, if you've been a dedicated follower of the franchise. Absolutly worth a buy",
            "review_score": "1"
        },
        {
            "review_text": "Plays great. I'm running it on an A10-5800 with 8 gigs of 2133 and a GTX 660 and it runs at a solid 60. I'm running it at 1600x1050 (my ancient monitor's native resolution) and it actually runs full screen (most modern games can't make heads or tails of a 16:10 monitor).",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for Elphelt stayed for Elphelt. 10/10 would marry.",
            "review_score": "1"
        },
        {
            "review_text": "After being somewhat disappointed by another recent fighting game purchase, Guilty Gear Xrd was a pleasant surprise. I never played any of the guilty gear series other than in passing before so I am not a long time fan of the series. That said, I love the graphics and the game runs smoothly on my Asus Zenbook (with the 960M). This game is worth the money, and if you pick it up during one of the steam sales, its an even better bargain.   I can tell I am going to be logging a tonne of hours in this as there is quite a bit to learn. If you are a fighting game fan, you will definitely want to check it out.",
            "review_score": "1"
        }
    ]
}