{
    "app_id": 376480,
    "name": "Ohr: אור",
    "release_date": "2016-12-02",
    "developer": [
        "Rail Slave Games"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 14,
    "negative_ratings": 7,
    "price": 4.79,
    "description": "The people's cries have activated ancient Ohr deposits and woken you from your slumber. Now you must help them to find their frequencies, their souls ... your heaven.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/376480/header.jpg?t=1541391258",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: win 7 + (64 bit) Processor: 2 ghz Memory: 2 GB RAM Graphics: 512 MB of dedicated video memory/ latest directxweb drivers (included) Additional Notes: Please make sure you have the latest DXWEB (included)",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "  yup! its another chapter of Barry in the feverland!  at first - some info i found:  Ohr  means ' Light ' in Hebrew (אור‎‎) or ' Divine influence ' and used in Kabalistic tradition as concept in which light is used as a way of describing divine attributes. Also it means ' ear ' or ' audio ' in German. and its not an accident.  in this 198x nes-styled game u'r playing as Princess (or Angel), traveling thru the strange world, enters destroyed post-apocalypse cities and tunnels in seraching of soul frequencies (!) so then u can bring 'em back to bereaved nps's after what they can Sing a Song and Praise  the Sun  You!  i don't finish the game yet 'couse its hardcore style as any of Dylan's game! trying and trying, searching new ways and stuff, shopping, failing again and again 'till u succeed.. as in real life! game is filled with melancholy, has sad atmosphere piano score by developer himself and noises from experimental musician F. Tyler, has a lots of mysticism and esoteric influences. i guess it reflects the mind of its creator and has deep thought base despite low budget production.  so I recommend to try this psychic journey to the depths of inner mind and outer divine presence. cheers and thx to developer for creating such psychdelic stuff.  p.s.:   cows is also present.  ",
            "review_score": "1"
        }
    ]
}