{
    "app_id": 376520,
    "name": "Kelvin and the Infamous Machine",
    "release_date": "2016-07-21",
    "developer": [
        "Blyts"
    ],
    "publisher": [
        "Blyts"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 20,
    "positive_ratings": 372,
    "negative_ratings": 48,
    "price": 7.19,
    "description": "Kelvin and the Infamous Machine is a hilarious point-and-click adventure in which you stumble irresponsibly through history to help legendary geniuses complete their masterworks!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/376520/header.jpg?t=1484590533",
    "minimum_requirements": "OS: Windows 7 Processor: 1.7 GHz Dual Core Memory: 2 GB RAM Graphics: NVIDIA GeForce GTX 260, ATI Radeon 4870 HD, or equivalent card with at least 512 MB VRAM Storage: 500 MB available space Additional Notes: Must have OpenGL",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wish there was a meh rating.  OK! So I do recommend this game in the end, but that doesn't mean there isn't 1 big flaw, but the pros first  Pro: 1. The voice acting is pretty decent. 2. The art and character design is good 3. There are funny jokes and deliveries in this game, reminds me of LucasArts in a way Cons: 1. Its short. I'm not sure why it's not a tag but it is, see my playtime? (It's 2.8 hours at time of writing) that's how long it took to beat the game and I was away from my computer for part of it. 2. The puzzles are difficult. Even the walk through I used was talking about how they understand why a person would need one for this. 3. The price tag is ridiculously high to be worth it. 4. There is replay value but it's honestly really only for the achievements But like I said I do recommend it. Get it on sale if you can or just get it now it's up to you",
            "review_score": "1"
        },
        {
            "review_text": "this is a genuinely funny, often hilarious traditional 2D point-and-click adventure game that looks and sounds great. If you’re a fan of the genre, this is the perfect game to play through in an evening and it’s pretty family friendly too.",
            "review_score": "1"
        },
        {
            "review_text": "It is a pretty fun game with beatiful graphics and overall good production values. The pop culture references are occationally funny, the puzzles are fair and it is reasonably priced for its ~4 hours of playtime. The characters are paper thin though, you will play though the game without growing any emotional attachments or even caring how it pans out, so it wont be a timeless classic. But it is still recommended for adventurefans.",
            "review_score": "1"
        },
        {
            "review_text": "I really had a lot of fun playing this game.Solving puzzles was simple but It was really beautifully prepared. And Doctor Who scene... it was best :D",
            "review_score": "1"
        }
    ]
}