{
    "app_id": 376560,
    "name": "Big Fish Legend",
    "release_date": "2015-07-20",
    "developer": [
        "Igry.ru"
    ],
    "publisher": [
        "Igry.ru"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Adventure"
    ],
    "achievements": 12,
    "positive_ratings": 85,
    "negative_ratings": 16,
    "price": 0.0,
    "description": "One summer day the old friend Rat tells the kitten legend about Big Fish. The kitten has a desire to get the fish and starts its journey.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/376560/header.jpg?t=1548013918",
    "minimum_requirements": "OS: Windows XP, Vista, 7 Processor: 1.6 GHz Memory: 1024 MB RAM Graphics: 128 Mb 3D video card DirectX: Version 8.1 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Firstly, I got this game for free, because I voted on their Steam Greenlight and joined their group. In order to get the key you have to add the dev of the game, and ask him for the key. Without hesitating he will give you the key, if you are in the group. (The group is no more open for invite, since the Greenlight thing is over). Nobody lied in here, and promises weren't broken.  But I'd rather talk about the game in general. So the game is a 2D platformer. You are a kitten, that has to master many diffrent levels while collecting gems and killing enemies (similar to Super Mario). The ambient music is great. However, you really need to get used to the controls. You can either use your mouse, or your WASD keys. I prefer the mouse though. The game is really cute, and I definitely recommend it for children. Many people claim, this game is overpriced. But I think 7 Euros is just fine. Considering, in a store you don't get children games cheaper. And if you still don't have this small amount of money left, then wait for a steam sale or look out for giveaways.",
            "review_score": "1"
        },
        {
            "review_text": "I have just played this game for 5 minutes - and I just wanted to say that this a great game for kids or people with limited use of their hands.  It's a casual platformer {not hardcore at all}, the main character (a cat) can be controlled by the use of the mouse only, very simple, and the aim is to find the exit and collect some gems along the way.  It's easy to look at, understand and play, and is quite cute!",
            "review_score": "1"
        }
    ]
}