{
    "app_id": 377070,
    "name": "Noctropolis",
    "release_date": "2015-09-03",
    "developer": [
        "Flashpoint Studios",
        "Nightdive Studios"
    ],
    "publisher": [
        "Nightdive Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "FMV",
        "Point & Click"
    ],
    "achievements": 15,
    "positive_ratings": 24,
    "negative_ratings": 6,
    "price": 6.99,
    "description": "In a world where comic books are real - The final issue is Evil!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377070/header.jpg?t=1509057863",
    "minimum_requirements": "OS: Windows Vista / 7 / 10 Processor: 1.0 GHz Processor Memory: 512 MB RAM Graphics: 100% DirectX compatible graphics Storage: 800 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "recommended_requirements": "OS: Windows 10 Processor: 1.5 GHz Processor Memory: 1 GB RAM Graphics: 100% DirectX compatible graphics Storage: 800 MB available space Sound Card: 100% DirectX compatible card or onboard sound",
    "reviews": [
        {
            "review_text": "They were the worst of times, they were the blurst of times. The 90's were an interesting time for comics. The speculator market had been decimating them for the most part. Nothing was dumber than thinking comic books were get rich quick schemes (well, other than baseball cards). Issue #1's - crap like Ultraforce - sold by the truck load, making companies think 'well, if 1 million was sold, then we'll have to print 1 million more for issue #2!'. Except that never turned out to be the case. Nobody was actually reading the damn things, so thus, nobody was returning for further issues, but who could blame them? Much like the video game crash, there was too little good and too much bad. The 90's are considered the most creatively bankrupt era of comics ('edgy', 'grimdark', etc), and while I think that might be a little overstated (cause comics are edgier and grimdarkier than ever), it's hard not to see it that way when companies spent more time creating really dumb variant covers than actually worrying about what was inside  And what was inside wasn't pretty. Two words: Rob Liefeld  You know everyones eyes were off the ball when he was getting consistent work. So much so that Marvel later filed for bankruptcy.  Obviously I am setting the stage here, as Noctropolis is a really interesting relic because it speaks so vividly of the time it was released in and what was considered 'cool'. The comic art speaks for itself in what little there is: Buff but dark heroes with gritted teeth, angular manjawed women and a gratuitous use of pouches. Yup, it's the 90's alright. Combine that with something even more 90's en vogue: Point 'n click adventures and FMVs and you've got a game that was made for me. It's a shame that the best I can say is that it's average with glimmers of an above average game. The devs of this game aimed low and they hit low and made a consisent game - but I'm not after consistency. Give me abject failure with ambition or give me death.  The game starts simply enough, introduced to Peter Grey, a down on his luck loser who had recently won a contest to be his favorite comic book super hero: Darksheer. At the time, artists and writers were leaving major companies to start up their own artist run/artist made studios where they had 100% ownership, resulting in a lot of cheap knock offs of even their own work. Darksheer is very much in that same vein, being a complete shameless Batman knock off. What makes Darksheer TOTALLY different is that he straight up murder his villains. At his side is his faithful sidekick from the school of Frank Miller characters, Stiletto. When Darksheer goes missing, she's left to do all the brooding and you're charged with taking his place.  When the game actually starts, I was impressed by what I saw. Great looking backgrounds and eternal night time skies. Noctropolis was a place I wanted to explore. It was like being given the opportunity to see Gotham City up close. I thought I would meet a ton of unique characters and see more of the great looking backgrounds. Well, I did see more great backgrounds, but I never got to see the true face of Noctrop, the populace. It felt like the game was teasing me with stuff in the background, and no matter what I did, I could never reach them. Two of the worst examples are a tower and hotel that are locked at the start. These places seemed very important, but at no point in the entire game do you ever go into them.   The game is filled with a lot of red herrings like this. Early on, you can pick up a bunch of bills and notices that do absolutely nothing and clog up your inventory for the rest of the game. At one point I had a rat in a bag, and I just... had it. There are also three inconsequential areas that don't contribute to the narrative or even 'lore' in anyway. These areas are triggered by accident, so you might miss them entirely, the problem is that if you do trigger them, they'll just leave you confused, as you desperately pixel hunt or try to use items that don't actually work there.  I don't want to talk too much about the story, but let's just say it doesn't make any sense, with a twist you can see a mile away. In fact, it's like that steam roller from Austin Powers and you're standing in its way. To be fair, this is very par for the course. Comics can be very stupid and this games final act is no exception.   Most of the game sees you 'dealing' with a league of villains. The biggest problem with this roundtable of ne'er-do-wells is that you never truly defeat them. You're never given that necessary closure despite them being a constant threat. Regardless, all the villains are fun and you can mentally sort how they relate to popular DC/Marvel characters.  I do have a bone to pick though, and it relates to an ignorant review I read calling Peter Grey (the character you play) a 'mary sue' (you know who you are). Peter Grey like a variety of other game characters - like Isaac from Dead Space 1 - are just audience stand ins with little in the way of personality, which is the whole point of them. So get off your high horse and stop throwing around terms you found out about on meme websites. (I also don't see how someone can be a Mary Sue and be absolutely treated like a chump by every villain in the game)  As far as presentation goes its... limited. A few mediocre midis play in most areas and as this is an FMV game, there is a bit of video, and I do mean a bit. Characters have a few opening statements, and it's like they disappear afterwards, never to return outside of a grainy still. You don't even get audio clips. You can try to ask them about specific things, but you're just given stiffly written dialogue that isn't very interesting. Much like comic books, this doesn't have a writers hand guiding it and relies a lot on cool visuals and quips.  Gameplay is standard. An issue with point 'n clicks is that you have to understand illogical designer thinking with your logical brain. This game is not one of the worst offenders, but it has a problem with items. Grim Fandango is a great adventure game because of its item conservation. If they think you can reuse it, you damn well are gonna. Noctrop rarely has multi purpose items, choosing to throw most of them away after one use. This presented a lot of early frustration for me, but once I understood, it was smooth sailing from then. The true problem comes in the form of the terrible scripting/triggers. I'd wander around for half an hour, knowing for sure what I had to do, but with no way to do it. Then I'd resort to a guide, but I was already doing what the guide was saying, but for some reason the light hadn't turned on in the games head to acknowledge this.  Like any good adventure game however, I felt on top of the world after figuring out something complicated.  This remaster is impeccable. Playing at 1080p and not having to deal with DOS, I kept forgetting I was playing a game from  1994 . Better games have received worse treatment, so it's strange that such an unknown received a Blu-Ray quality remaster. It'd be like Freejack or Streets of Fire getting 4k remasters and Lawrence of Arabia being relegated to VHS quality. Playing at a higher resolution however can make items smaller and more pixel-y on screen, thus harder to find.  Is this game a failure? No. Is this game a success? No. Like a lot of mediocre media, I wouldn't have checked this out if I had to install it and use Dosbox. I did however have a good time despite its short length. If you're a fan of that era of games, I'd hesitate a little before I could recommend it, but if you think you've played everything else, then check it out.  The Pro's:  +Cool setting  +Sometimes fun to explore  +Serviceable point and click stuff  The Con's:  -Story is stupid and has no pay offs  -Not enough FMVs, voice clips or characters  -Not good enough to be a classic, not bad enough to be kitschy ",
            "review_score": "1"
        },
        {
            "review_text": "Lumisheer is the first homosexual in video game history.",
            "review_score": "1"
        }
    ]
}