{
    "app_id": 377330,
    "name": "Close Your Eyes [Old Version]",
    "release_date": "2015-08-31",
    "developer": [
        "Yai Gameworks"
    ],
    "publisher": [
        "Yai Gameworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Sexual Content",
        "Violent",
        "Gore",
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Horror",
        "Indie"
    ],
    "achievements": 8,
    "positive_ratings": 622,
    "negative_ratings": 82,
    "price": 0.0,
    "description": "THIS IS AN OLD VERSION, THE GAME HAS BEEN REMADE. You can still play the original freeware version here, but the remake can be found on Steam as &quot;Close Your Eyes -Anniversary Remake-&quot;.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377330/header.jpg?t=1531201393",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 (32-bit/64-bit) Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 512 MB RAM Graphics: 1024 x 768 pixels or higher desktop resolution Storage: 600 MB available space",
    "recommended_requirements": "OS: Microsoft® Windows® XP / Vista / 7 (32-bit/64-bit) Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 512 MB RAM Graphics: 1024 x 768 pixels or higher desktop resolution Storage: 600 MB available space",
    "reviews": [
        {
            "review_text": "Dear [Insert horror game developer],  THIS is how I like my horror.  I received a good deal of flak for my (I admit) petty review of the Amnesia series of games, and while I understand that they were useless reviews, Close Your Eyes showed me exactly what I wanted to say about them but never knew I was looking for.  I wanted to love the amnesia series so much; I think a lot of horror games have some beautiful narratives hidden inside them, but they are all unplayable. You can call me a chicken or whatever you like, but jump scares are NOT fun. They are NOT horror. All they are is an involuntary reflex forced upon us by extreme stimuli. True horror makes you uncomfortable, afraid, uneasy and anxious. Sure you may jump sometimes but it’s because you did it to yourself. The game didn’t flash a light in your eyes and accompany it with a blood curdling snarl, no, the atmosphere puts you into a very unsafe place mentally and you begin to see and anticipate things on your own. This is what Close Your Eyes nails; I want so much more of this on the market that I don’t even know how to express myself. From the very beginning I was uneasy, the world was dark and simplistic, my mind filled in details that may or may not have even been there. The sound design and voice acting was chilling and spot on, causing countless chills and rushing adrenaline. Everything done in this game felt deliberate and calculated, not once did the developer cash in and sacrifice atmosphere and narrative for a PewDieBait jump scare. Nor did it need to. Much like the outstanding Point and Click game “The Cat Lady”, Close Your Eyes masterfully brings you into a very dark place and lets your mind take care of the rest - cruelly prodding it along with snippets of story and hints of progression.  Close Your Eyes is one of the best horror experiences I’ve had in recent memory. And as if I can’t praise it enough, it’s FREE. There is no reason (outside of mature content concerns) that anyone should pass up on a chance to experience this game. Bravo, Developers, bravo.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It starts off a little slow but good enough to get you interested. There's actually mutiple endings which is great. Puzzles are somewhat confusing but if you're smart you'll figure them out. To me it's a decent amount of scary. It's more creepy.",
            "review_score": "1"
        },
        {
            "review_text": "Very good story line! I honestly didn't think it would be very good, due to the grapics, but I turned out to be very wrong. This game was also very strange, and I will say, this game is not suited for children. It was very ♥♥♥♥ed up, I wont, lie, but it was very enjoyable. It has strong sexual innuendo's, and very inapropriate dialogue that was.. Descriptive. If any of you are triggered by death, blood, sitophilia, murder, hanging, ♥♥♥♥, seven deadly sins for all those religious folks out there, paranormal beings, gore, creepy music, jumpscares, close-to necrophilia, and mass-murder or sacrifice, you probably shouldn't play this game.  The puzzles in this game were surely difficult, and had your mind running. The characters in this game were a lot of fun to see develop as the game went along. The music that went along with this game surely did a great job of keeping you on the edge. It created a very nice ambience.  I thoroughly enjoyed this game, and I suggest you play it, as well! I suggest you do put a age-lock on this game though, seeing as it is not suited for non-mature audiences.  TL;DR: 11/10 great gameplay. 12/10 would replay for foxy host. 69/10 would not recommend letting children play. 5 many triggers 9 me.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;be me &gt;11am &gt;be very f*cking bored of all the f2p games there are &gt;search time &gt;'horror' &gt;see little indie 8bit &gt;thatsmyfetish.avi &gt;download &gt;f*ck yeah it takes like 12 minutes &gt;start game &gt;gotta make it fullscreen &gt;gettin hella into the story so far and puzzles &gt;got stuck in some f*cking room with doorways thing i gotta search through looking for keys to the other locked doors &gt;after like 3 hours i finally get through what i think is all the doorways &gt;coming down from the bathroom up a pathway through circle door &gt;f*cking glitchy white wolverine ghost monster chases me &gt;somehow in different room &gt;hide in corner &gt;wolverine f*cking sonics over to me &gt;jimmies status: MAXIMUM RUSTLE &gt;death screen with me hung in the background &gt;mfw i forgot to save the entire time   12/10 would get anally molested by wolverine ghost monster again",
            "review_score": "1"
        },
        {
            "review_text": "I loved it. It was good for both the horror and the story. The screenshots make it look like it couldn't be scary at all, but it does a lot with little. Also make no mistake, while much of the stuff in the screenshots looks like it could have been scribbled by an 8-year old the art is good and is a part of the atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "small game with an interresting storyline, would recommend :)",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric, surreal, creepy horror game. Doesn't rely solely on jumpscares and is fairly subtle in the way it scares you. The story isn't told in a very straightforward way and as such it's kind of confusing to tell what is happening, but this is truly interesting and has a lot of cool puzzles and storytelling elements in play.",
            "review_score": "1"
        },
        {
            "review_text": "Great Horror game! the visuals might not be remotely impressive but Close Your Eyes has good story, great audio, and amazing voice acting. The puzzles however range in difficult from really easy to convoluted and bothersome, so there is something there for everyone. Most importantly of all is the game is of decent length. it has multiple endings (I have only played through once) and it is really truly free!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, wished that the main story had a sequel, though! I was confused throughout the whole game, yet the story seemed so enjoyable. Thanks for this free and amazing game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Play alone in the dark or else you will ruin the game for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "A free game that is worth your time. You should play this at least once, no matter who you are",
            "review_score": "1"
        },
        {
            "review_text": "The game does a fantastic job of bringing on the scares with the graphics it has. Surprised me how well it does it. Now there are some parts where it can drag, and depending on your scare-resistance, it might feel long - I varied. Still, the whole thing together is worth finishing it.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would maze again.",
            "review_score": "1"
        },
        {
            "review_text": "I genuinely loved this game, and my only complaint is that I wanted more. Particularly the Host and Simon -- they both made me feel so dang unsettled. But if you like horror rpgs and surreal moments, then definitely give it a go. One of the best free games on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game is GREAT. I LOVE IT Simons's voice omg... I can't 10/10 would nightmare again.",
            "review_score": "1"
        },
        {
            "review_text": "More games like this &lt;3 Good story, amazing atmosphere and it's freeee.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't expecting very much, but this game was VERY WELL MADE! I was so surprized by the voice acting and the atmosphere actually did have my heart racing. It was short, but not too short, and with multiple endings you can discover new things again. I did wish I could run faster but eh, whatcha gonna do? I really loved the simple details and lonely spaces. All and all, give this little game a try, I'm sure the programmer has much more in store.",
            "review_score": "1"
        },
        {
            "review_text": "Damn. I know I don't swear; but let me explain, a word like that can only describe the simplistic excellence this game achieves in my opinion. I have been waiting for a longer multi-ending storyline game since I finished the Stanley Parable. This game has restored my faith in video game storylines; I have been aching for a story like this. I loved this game so much it prompted me to write a review (which I haven't done in ages). It was perfect; it has a great story, puzzles, 7 different endings, a slight horror aspect, YET RETAINS THE ABILITY TO HAVE A SUFFICIENT AMOUNT OF GAMEPLAY (Which lately storyline games have LOST the ability to keep). All of the endings take at least 3 hours to complete, however so far I have only found one. Another great aspect: its price, absolutely free (but honestly I would pay money for it if it improved its art)(and its DLC), speaking of art for you graphics buffs: LAY OFF for god’s sake there hasn't been a game like this in AGES so disregard the art. I loved this title, and would love to see a soundtrack released. Not to mention provided me with sufficient nostalgia; memories of bouncing around in an overhead third person game in black and white are thrust back to mind. Still an amazing game 1 year later",
            "review_score": "1"
        },
        {
            "review_text": "Greatly recommend it! It is very fun, and pretty spooky. I find that I absolutely adore the music to it as well!! Good game. Just would like SOME stuff expanded upon more, but that's really my only critique.",
            "review_score": "1"
        },
        {
            "review_text": "This game is creepy.",
            "review_score": "1"
        },
        {
            "review_text": "Close Youre Eyes is an indie horror game.Briliant voice acting and exelent soundtrack.It has the attmosphere similar to Yume Nikki(an erie,mysterious,crepy world that is very unerving,yet very intrguing),the soundtrack similar to Resident Evil and the graphic style similar to.....an RPG maker game. The game's length is perfect.Not too short to disapoint you,not to long to bore you.Evry room is filled with with something to discover or something to interact with. The only little thing that i disliked about the game was the car puzzel(anoying,yet suprisingly smart). My score for this game is an eye/10.This game is very good.  And could you just close your eyes?    *sry for bad english",
            "review_score": "1"
        },
        {
            "review_text": "Creepy music, a unique art style and an interesting storyline. Overall, an amazing game :D",
            "review_score": "1"
        },
        {
            "review_text": "Well i've got the ending #5. In this game, there are 7 endings, 7 ♥♥♥♥ing endings that won't explain the game's history as well as it could. I mean, you will understand the history that's happening NOW in the game but, not all the history about the protagonist, which is called 'little mushroom' (nickname), though he really looks like a mushroom, doesn't he? So, the game is nice and it's free to play. Just play it and look this bizarre game by yourself. By the way i recommend (this game has good jumpscares). OBS: this game is based on seven deadly sins. That's why it has 7 endings...",
            "review_score": "1"
        },
        {
            "review_text": "this game was uh... something special. good and creepy psychological/psychedelic horror with a few jump scares here and there. pretty decent riddles throughout the whole game (albeit, one was a direct ripoff of a silent hill puzzle) even made me put my old school crystalis dungeon-mapping skills to good use at one point. 7 different endings, (that aren't too difficult to achieve. never needed a walkthrough) to keep you intrigued for roughly 4-5 hours of gameplay. just a heads up though, this game is quite graphic in its descriptions. my only complaint is the gut-wrenchingly bad grammar in the dialog, the voice acting is great though. examples such as: could of/must of/should of; defaultly; seaped and buldging, jesus christ, some proof reading would have been nice. it seems to me like they're trying too hard to be David Lynch at times, but it's forgiveable given how good the rest of the game is, and come on, 5 hours of gameplay? from a freebie??? DO IT... FEEL AROUND INSIDE OF HER... THAT'S IT... GOOD BOY... GOOD BOY...",
            "review_score": "1"
        },
        {
            "review_text": "First off, this game is very well designed. It feels like inspiration was taken from Silent Hill in the enviroment sounds that give the creep factor. The story seems interesting, but, personally I was lost, as I really found it hard to actually realise who was who and what was going on. The Puzzles are well designed, but some were a little too hard or weren't clear, which did let it down slightly. Voice overs were done well, and really captured the character. However, as great as this game is, there are faults. The game starts off well, but soon becomes a crawl through dark corridoors searching for keys to more keys that unlock doors to MORE keys. This could have worked well, but, between these points, it seemed empty. As the game progresses, it just seemed to become more and more tangled. The story stopped making much sense, and I soon wondered why I was wandering so many surreal areas. Now, I did quit the game at the Valerie Maze, but, deciding I wouldn't be beaten, I went back, and I have to say, I was impressed. The game still doesn't make a whole lot of sense to me, but I think I have a vauge idea of what happened/is happening. The multiple endings to be found are a nice touch, but again, they just confused me slightly. I certainly hope there will be a sequel to this game!",
            "review_score": "1"
        },
        {
            "review_text": "Close your eyes little marshmellow, I only want to mess you up gently.. Just close your eyes... Cmon.... Close them... CLOSE YOUR EYES... What do you see...? I SAID CLOSE THEM.   Overall, this is a game and a pretty fancy smangled one at that. However you cant even take screenshots D=&lt;",
            "review_score": "1"
        },
        {
            "review_text": "Close your eyes is an rpg maker horror game that has the puzzeling side and the horror side. Made from rpg maker vx ace to be the next generation of rpg horror games so i would highly recommend this amazing horror game. Again check out the amazing textures and visuals. This game was only made in 38 - 72 hours. The creepy story is fantastic, If you loved the trailers then the game will be a legend too you. So Get it remember its free!",
            "review_score": "1"
        },
        {
            "review_text": "It didn't scare me with things trying to eat my screen, thank goodness, but just gradually creeped me out. The sounds and the atmpsphere combined... I wanted to close my eyes, but I couldn't. I needed to solve the puzzle...",
            "review_score": "1"
        },
        {
            "review_text": "Nice little indie horror games that is deep and obscure. Has some geniunely great moments and some that, I feel, could have been left out to make a shorter, more succinct experience.  This is a free game so if you have even a vague interest in (psychological) horror games, you definitely should play it.",
            "review_score": "1"
        },
        {
            "review_text": "Really good, crazy story with a mysterious set of endings to force you to imagine what really happenned. The puzzles were also challening but not so hard it wasn't fun. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "its a great horror for a free game its better then overcast waldan and the wherewolf sry for mistakes",
            "review_score": "1"
        },
        {
            "review_text": "It didn't scare me with things trying to eat my screen, thank goodness, but just gradually creeped me out. The sounds and the atmpsphere combined... I wanted to close my eyes, but I couldn't. I needed to solve the puzzle...",
            "review_score": "1"
        },
        {
            "review_text": "Greatly recommend it! It is very fun, and pretty spooky. I find that I absolutely adore the music to it as well!! Good game. Just would like SOME stuff expanded upon more, but that's really my only critique.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply excellent. It is a horror game that focuses more on horror as opposed to ♥♥♥♥♥♥ jump scares. There are jump scares, of course, but they are not major, not many, and add to the game. Going in to the game, you know little about your character besides that you are a criminal that has just escaped death row. The plot is very dark, and will keep you wondering what the ♥♥♥♥ the plot even is. The game has seven endings, all of which I've completed and written a guide to. All seven endings took me around eight hours, but only since I had to find all (except for one) myself; a quick playthrough when you know exactly what you are doing to get one ending only takes about 30-40 minutes. Still, there is more to the game then that, of course; through the experience, you'll be left on the edge of your seat in anticipation of what is to come, and in the back of your seat, afraid of what is to come. The game is, of course, free, and I would personally have paid money to play this game. It does feature a cheap DLC that I have yet to play.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most creative and engaging games I've played in a long time. It's not so much a 'scary' game as it is a though-provoking way of telling a story. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "  Did not help my depression. Still an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Creepy game. Very well put together considering the developers created it in 3 days. Highly recommend playing.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed those old visual novels with branching paths all leading to your death or non-standard game-overs, well, this one here is free!  If you don't mind not being able to skip a cutscene into a trial-and-error section which kills you should you not react in half a second or make a wrong decision, this game won't bug you.  If not, your time will be better spent elsewhere. May I recommend you Ib, if you really need to play an indie horror made in RPG Maker?",
            "review_score": "-1"
        },
        {
            "review_text": "The ending is satisfying. got ending 6/8 machine",
            "review_score": "1"
        },
        {
            "review_text": "A Very puzzling horror game that gets you hooked to its challenges.",
            "review_score": "1"
        },
        {
            "review_text": "I actually had pretty high expectations of this game, since it was so good rated and looked really interesting, but to be honest, for me the game was a big disappointment. The graphics were messy and the plot really confusing, and most of the time you just had no idea what to do, which made the gaming experiment pretty fast boring and frustrating. Also the game music was pretty much just a really short part of singing (or a simple short melody) looping all over again, quickly getting really annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "The narration was WAY TOO LOUD considering I generally keep volume low. Then, 'must of', seriously?  I'm assuming this singing is bad on purpose. Speaking of which, if you swap casettes the song should stop immediately, not fade out.  I just tried to talk to a character and went right through it, I'm going to assume that's intentional for now.  The egg question is unfair, as it depends on the situation. Devilled eggs are awesome, but not for breakfast, and the GOAT egg option, basted, wasn't even there.  The skull puzzle is missing something. 'Maybe there's a clue' but I examined everything and found nothing for clues. Eventually randomly found the correct way by trying every direction.  I understand going to the TV is supposed to be game over, but whatever flashes on-screen is too quick to see. Why?  Ugh, the manor keyhunt got boring fast. Maybe I'll finish it another day but for now I'm done.",
            "review_score": "-1"
        },
        {
            "review_text": "There are sevn endings, supposedly, so you can play this multiple times.. although I don't know why you would want to. It's actually a decent game, but it moves too slow. The last thing you want from an atmospheric horror is to get bored. Close my eyes? Only because these repetitive puzzles are putting me to sleep! Ahaha!  Pros: Storyline Sound Atmosphere General creepiness  Cons: Repetive Poor pacing  Meh: Graphics BGM",
            "review_score": "-1"
        },
        {
            "review_text": "hated it",
            "review_score": "-1"
        },
        {
            "review_text": "How do i pass the road with the crashed car?",
            "review_score": "1"
        },
        {
            "review_text": "Since it's free and if you don't mind going through some silly disturbing imagery, sure, give it a try.",
            "review_score": "1"
        }
    ]
}