{
    "app_id": 377430,
    "name": "Who Is Mike - A Visual Novel",
    "release_date": "2015-09-29",
    "developer": [
        "Fervent"
    ],
    "publisher": [
        "Afterthought Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Visual Novel",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 315,
    "negative_ratings": 33,
    "price": 0.0,
    "description": "You wake up with an aching head and the world out of focus. In front of you is a man accusing you of being “fake”. He looks exactly like you, down to the last scar and pimple, has the same memories, the same voice and the same personality. But who is lying and who is telling the truth? Who is fake and who is real?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377430/header.jpg?t=1447375979",
    "minimum_requirements": "OS: XP Processor: 1Ghz Memory: 512 MB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "First off, the music REALLY helps with the mood. The characters are nicely drawn too. I've layed a few times and got 3 endings I got one of them 3 times in a row. I enjoy the skip mechanic too. It makes it easier to get to the choice once you've read the dialouge. Overall it's a nice quick game to play when you have down time. Just wish it were a bit longer. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "While the game itself is short, what is presented speaks volumes of careful story crafting. The game is complex on an emotional scale, ranging from rather funny situations to some deep, sorrowful moments. And all for free. If you are a fan of visual novels, and you are ready for a pretty good story, then look no further.",
            "review_score": "1"
        },
        {
            "review_text": "I've managed to get all but one ending for Who is Mike so there are spoilers ahead.  You play as Mike, an ordinary guy who suddenly wakes up in his living room with a bit of amnesia from possibly a few hours ago. The only other person in the room with you is none other than yourself. The question is are you the real Mike?  First of all, the story line is intriguing: the tension between both Mikes and Sarah (depending on one of the choices you make) works really well. One of the reasons why it succeeds in this is the music. It's disonant yet simplistic sound creates great tension in it's darkened setting. The characters are interesting and their dialogue is enough to gauge their personalities. The artwork is absolutely beautiful and matches the grittiness to this tale.  However, the story itself is very short (but it can be shorter depending on your choices) and for a visual novel, you don't get to interact that much in terms of choosing how to answer or make your decision. Speaking of decisions, it lets itself down a little when you make some important choices.    The fake in the story is some kind of life draining demon, who can shape-shift into their victims and pretty much steal their identity. Depending on how you play the game, you could either die by leaving the house and inadvertedly let the demon drain your soul/life force, get shot by Sarah (Mike's girlfriend) when attacking the 'Fake Mike' or get stabbed by the demon when they transform into Sarah (only if you decide not shoot her). Focusing on the first two deaths, you as the player would either be the real Mike or the fake Mike, but it depends on how you respond to the questions Sarah asks both Mikes. You wonder who's persective you were playing from in the first place once you obtain the endings, where both Mikes end up in a fist fight. I was certinly confused when I played through again.     Saying that, if you're looking for a visual novel with a good storyline where you can discuss your theories, and what's going on and you want to feel a lot of tension between characters, this game will satisfy those needs. Just over look what I said in the spoiler part and you should be fine.  I give this game 7/10 .",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Yes it does it a little repetitive, however the game is short enough  so it's not a major deal.  Some of the ending I really didn't see coming.  And the main ending/story had my full attention.  I would knock points off for it being so short, but all in all it's pretty original, the art and music are great.   Definitly worth checking out",
            "review_score": "1"
        },
        {
            "review_text": "Wow didnt expect such a good plot, i played every ending now and i must say iam amazed by the quality of the game.  I enjoyed it every minute i played this title and i dont know what could have been better so i give it an  10/10 because free ^^  I would recommend it to every one who likes mystery storys or etc.",
            "review_score": "1"
        },
        {
            "review_text": "This game made my weenie feel....good 10/10 Would Mike again",
            "review_score": "1"
        },
        {
            "review_text": "Really interesting game i really enjoyed it",
            "review_score": "1"
        },
        {
            "review_text": "  This game is kinda unique in it's own way except for that ending of 'Come clean.' After that ending, the mysterious vibe kind of melted away. I'd just think 'Oh, it's just like the normal horror story.' I still like it nonetheless and for a very short gameplay, it sure have quite a lot of endings. I like that. Love the music, it's a great mood-setter. The humor, the little details in the characters, it's great.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's free and it's short. The story's decently interesting even if there's not a lot really explained in the end. Can't say much else without spoiling stuff, though, but there were some interesting surprises.",
            "review_score": "1"
        },
        {
            "review_text": "Its a bit short, but there are a bunch of different endings to find.  Its free, and it will entertain you for about an hour (if you go for all endings), so I can't complain.  The art and music are nice, for sure, but what I really liked was the writing. I got a sense of the characters and felt connected to them in a very short time, which really made some of the decisions heavy. Sure, it isn't long, but I think it is very well executed for something so short.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting Visual Novel that any fan of the genre should play. A bit dissapointed at the length and that it took a lot of trial and error to get all endings but i can't whine too much when it's free for anyone to play. Overall it's great though and anyone should give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly short with atleast 1 hour of gameplay if you intend to get all 9 endings. The CG for the game is well done and the music used fits the atmosphere pretty damn well. The dialogue is great, when it's funny it's funny, when it's serious it's it's serious, when its threatening it's threatening. You get the point.  The endings are not all related and (Idk whether this is a spoiler or not)    there is not really any fixed imposter    which gives quite abit of replayability to view the other endings. Most of them involve death or are just plain depressing, either that or they pull a M Night Shamalan grade plot twist. I think there was probably only one ending where everything was 'settled peacefully'.  Overall 8/10 No issues with the game, short and sweet and completely free.  Wish they had some kind of secret ending though",
            "review_score": "1"
        },
        {
            "review_text": "So, you're Mike, and you wake up to a Mike #2. Something has happened and you've lost that part of your memory.  Fun read, with multiple endings. If you've got an hour or 2, definitely a recommended read.",
            "review_score": "1"
        },
        {
            "review_text": "I had myself go back a couple times trying to get all the endings. So far I only have 9, 5, 4, 6, 3, and 2. It's a little hard to understand how to get 1, which I'm guessing is the good ending",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would let their weenie feel good again",
            "review_score": "1"
        },
        {
            "review_text": "A compelling horror/mystery visual novel. Your protagonist and his double with almost his same memories, confront each other in his living room, accusing each other of invading his house. Like the 'who's the imposter?' TV trope turned into a mystery thriller.  Getting all nine endings took me under two hours, but they were well spent. And it's free, too!",
            "review_score": "1"
        },
        {
            "review_text": "Very well done! Like any good horror it was pretty short and didn't give a lot of details about itself. Though if there is anything I have to praise here is the originality of the story. Sure doppligangers and bodysnatchers have been done before but not in this why, and not with this kind of story twist. There where a couple of game mechanics that could have been greatly improved, such as making the choices more obvious and actually meaningful. But I have to say with an awesome story like that I can over look that. I hope the people that made this game make more because with a little more refining they could make some really good content.",
            "review_score": "1"
        },
        {
            "review_text": "This game... To properly explain my emotions would spoil this. Ive only got one ending and I want to play more and answer more questions, but I also want to theorize and think about this until I have figured out whats going on. To repeat. THIS GAME 11/10 would Mike again.",
            "review_score": "1"
        },
        {
            "review_text": "This is sincerely one of THE best games I have ever played. I've been going through a lot of terrible demos and free games lately and I am SO glad I've found this one. It's deep, it makes you think, it knows exactly when and how to throw in humor. The writing and concept are superb and the art is gorgeous. There is literally NOTHING I can think of that is bad about this game. As of this very moment, I've only played through to one ending. And I'm about to willing spend the time when I should be sleeping finding and playing through to all the others. Fervent, you are quite probably a god among Indie developers.",
            "review_score": "1"
        },
        {
            "review_text": "Nice and short visual novel fun to play, not to nit pick about every detail.",
            "review_score": "1"
        },
        {
            "review_text": "I like it when your decisions change the outcome. But those changes have to make sense.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10 still don't know who Mike is.",
            "review_score": "-1"
        }
    ]
}