{
    "app_id": 377450,
    "name": "Lost Lands: Dark Overlord",
    "release_date": "2015-06-26",
    "developer": [
        "FIVE-BN GAMES"
    ],
    "publisher": [
        "FIVE-BN GAMES"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Hidden Object"
    ],
    "achievements": 24,
    "positive_ratings": 88,
    "negative_ratings": 2,
    "price": 4.99,
    "description": "Susan had just stepped away to answer the phone, but when she returned she saw something pulling her son Jimmy through a shimmering portal. It closed before she could pull him back. To save him, she must find a way to this other world. Before Susan lies a world that no one else has ever seen before...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377450/header.jpg?t=1478178230",
    "minimum_requirements": "OS: XP/Vista/7/8/10 Processor: 1.6 GHz Memory: 512 MB RAM DirectX: Version 9.0 Storage: 900 MB available space Sound Card: yes",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a very well presented casual adventure game. It has the right amount of hidden object scenes, puzzles and mini-games without getting either too lengthy or having too much of one of the three. The difficulty level is not too hard, but some of the mini-games and puzzles aren't that easy.  The graphics and music are really great. Every location has its own style while not becoming random and it's fun to explore the game. The pre-rendered 3D graphics look very detailed and colorful. While the voice acting is okay, the music fits the game very well and never gets on your nerves.  There are three different kinds of hidden object scenes and two of them require you to really think about the scene rather than just searching for the objects. I really enjoyed this change and it certainly adds to the adventure aspect. The puzzle elements range from 'find the right shape' to almost old school point and click ones. Again the more challenging puzzles keep the game interesting.  This is a real gem if you like casual adventure games and I was surprised how well designed (in both gameplay and presentation) the game is.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game! Great story line, fun mini-games and hidden object scenes that are more interactive than just clicking on an object. It took me almost 4 hours to complete, making it well worth the money I paid. I highly recommend the whole series.",
            "review_score": "1"
        },
        {
            "review_text": "Lost Lands: Dark Overlord is a better-than-average HOG. There's no repetition of the HO scenes, plenty of other puzzles and minigames in the mix and the type of HO scene (list, silhoutte, association) varies to keep it feeling fresh. The story's the usual fluff about a loved one being abducted into a fantastic world, and the voice acting is just barely tolerable, but the cut-scenes are very nice-looking.  I found this game a bit less challenging than average for the genre, but note that attempting to get every achievement in a single playthrough would add a steep challenge factor for those who are so inclined.",
            "review_score": "1"
        }
    ]
}