{
    "app_id": 377660,
    "name": "Blockwick 2",
    "release_date": "2015-06-25",
    "developer": [
        "Kieffer Bros."
    ],
    "publisher": [
        "Kieffer Bros."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 14,
    "positive_ratings": 119,
    "negative_ratings": 2,
    "price": 2.09,
    "description": "Welcome to Blockwick 2 – a world of jumbled blocks and colorful shapes. It’s up to you to unscramble the blocks and connect the colors. The game introduces a slew of new block types – entangled blocks, sticky blocks, caterpillar blocks, and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377660/header.jpg?t=1461620074",
    "minimum_requirements": "OS: Windows XP+ Processor: Intel or AMD DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "9/10 TL;DR Impressive. The puzzles were very challenging; yet I never had to look up a LetsPlay cheater walkthrough, even though I played for the 'Illuminated' achievement for perfect final configuration.  Spacial movement game. Obviously, the basic strategy is to open up degrees of freedom to allow manipulation and throughput. The solutions are tight, VERY TIGHT--the avenue is often mandatory, but there is some freedom for the less important tiles. Several times, I got one step away from the final solution, only to realize that I must reverse half my moves to get one last piece on the other side where I had not expected the solution. Yet, the solutions can be visualized and executed with wonderful ah-ha insightful moments. 'Wait! This is impossible without moving that piece around and under and through...It will NOT fit. Oh! It just may be possible.' Brutal and brilliant.  (Not a spoiler): One feature is the sticky tile. The instructions do not quite make it clear that they are sticky like peanut butter not like glue; you CAN scrape the tile off on an edge.  9 chapters of 16 levels. 2 games in 1. The Original Blockwick 'Basics' has just as many levels.  This is a well-done mobile port. Full screen. Alt-Tab works. No options, except to turn off sound and/or effects. Music very soothing, non abrasive. Drag and drop with the mouse, No control problems.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of the time it consists of moving the blocks around, concluding that the level is impossible, then trying a huge range of combinations of moves by trial and error and finding a solution. So a lot of the time it is just frustrating, but some of the time it is satisfying and some of the time it is clever. Since I did actually complete all the puzzles I guess I must have liked it enough to deserve a thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Well designed, straightforward puzzle game. Lots of variety in concepts and each of them presented in a clear manner in order. Slick and simple style, good variety of puzzles and two tiers of solution allow a player to progress or challenge themselves in each puzzle as they desire.",
            "review_score": "1"
        },
        {
            "review_text": "This is really cool puzzle game! If you like puzzle games then you must buy this!",
            "review_score": "1"
        }
    ]
}