{
    "app_id": 377710,
    "name": "Idol Magical Girl Chiru Chiru Michiru Part 1",
    "release_date": "2015-07-29",
    "developer": [
        "Frontwing"
    ],
    "publisher": [
        "Frontwing USA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Visual Novel",
        "Casual",
        "Anime"
    ],
    "achievements": 0,
    "positive_ratings": 129,
    "negative_ratings": 8,
    "price": 14.99,
    "description": "Matsushima Michiru is a loved, respected, nationally-famous idol, worthy of singing on the same stage as the legendary Kazami Kazuki... in her own dreams, at least. In reality, she's a complete nobody, only able to perform in a dingy basement bar on the weekends for crowds numbering in the single digits.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377710/header.jpg?t=1543976333",
    "minimum_requirements": "OS: Vista Processor: 1Ghz Memory: 1 GB RAM Graphics: 1280x720 DirectX: Version 9.0c Storage: 4 GB available space Sound Card: Any audio output",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Even if it's a good visual novel, 20€ for this is a way too much. If it's on sale, you'll get a kinetic visual novel with a fun story. If it's not on sale, dont buy it. It's too short(5h30 min~) to be worth that much and on top of that you'll have to buy part 2.  Would have been ok if part 2 was included.",
            "review_score": "-1"
        },
        {
            "review_text": "I really love Michiru! She IS CUTE.",
            "review_score": "1"
        },
        {
            "review_text": "Michiru will get you irritated as a bumbling fool who never learns. But despite my impatience, this was still strangely watchable. I gave up hunting Pokemon to watch this.",
            "review_score": "1"
        },
        {
            "review_text": "I've played a chunk of this offline, thus the little amount of time you see on record. So far very fun, comedic, and light hearted! It's just brilliant! Haha... xD",
            "review_score": "1"
        },
        {
            "review_text": "I will admit that I have played Idol Girl Michiru before Fruit of Grisaia, and many people are upset because of the AU (alternate universe) setting that this title has. My review is not about the correlation of the leading character, but this spin-off, in which she becomes a magical girl who must save the world in the first set of episodes in the series.  The artwork is very charming and is the quality expected for the price. For a lover of visual novels, this was really spot on for me as well as the JPN vocal work. It moves very kinetic and is engaging. It is not like watching or a movie, and does involve reading or simply listening and following along and the humor is very worth it. There are some tropes and light fan-service but it is never condescending towards its audience. I am looking forward to playing the second part. Bonus points for not taking itself too seriously.",
            "review_score": "1"
        }
    ]
}