{
    "app_id": 377720,
    "name": "Idol Magical Girl Chiru Chiru Michiru Part 2",
    "release_date": "2015-07-29",
    "developer": [
        "Frontwing"
    ],
    "publisher": [
        "Frontwing USA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Casual",
        "Visual Novel"
    ],
    "achievements": 0,
    "positive_ratings": 55,
    "negative_ratings": 3,
    "price": 14.99,
    "description": "Michiru's quest to save the world by sealing the Chaos that threatens it is progressing flawlessly... except for the fact that her fellow Magical Girl and rival, Kazuki, is beating her at every turn!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377720/header.jpg?t=1543976460",
    "minimum_requirements": "OS: Vista Processor: 1Ghz Memory: 1 GB RAM Graphics: 1280x720 DirectX: Version 9.0c Storage: 4 GB available space Sound Card: Any audio output",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Part 2 is definitely worth picking up as a continuation of part 1.   Part 2 sees a shift in tone towards more serious events, as you'd expect from a story that needs to wrap itself up in six more episodes, but it's all still interspersed with the series' trademark humour. Better still, despite the shift in tone, it manages to find the right balance between more heartfelt, serious moments and the odd shot of (relevant) humour, switching between both with near-perfect timing.  Overall, Chiru Chiru Michiru is also a great spin on the magical girl genre. You can certainly feel the energy and enthusiasm that went into making this spinoff work on the many levels it's based on. It's set up cleverly too.   Sure, it takes a rather easygoing approach to things by nature, which results in a quickly-shifting narrative where anything can happen. But despite this it ties itself together rather well, especially in its conclusion, and most importantly, remains hugely entertaining and endearing throughout.",
            "review_score": "1"
        },
        {
            "review_text": "It's got Michiru.",
            "review_score": "1"
        }
    ]
}