{
    "app_id": 377970,
    "name": "Void And Meddler",
    "release_date": "2015-10-28",
    "developer": [
        "no CVT",
        "BlackMuffin"
    ],
    "publisher": [
        "Mi-Clos Studio"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Cyberpunk",
        "Point & Click"
    ],
    "achievements": 41,
    "positive_ratings": 146,
    "negative_ratings": 64,
    "price": 2.79,
    "description": "Fragments and details, rainy nights and blurry lights are all VOID&amp;MEDDLER focuses on. A non-linear cyberpunk adventure where genders and species melt into each other.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/377970/header.jpg?t=1545561320",
    "minimum_requirements": "Mínimo: SO: Windows 7/8/10 Procesador: Dual Core 2Ghz Memoria: 2 GB de RAM DirectX: Versión 9.0c Almacenamiento: 600 MB de espacio disponible",
    "recommended_requirements": "Recomendado: SO: Windows 7/8/10 Procesador: Dual Core 4Ghz Memoria: 4 GB de RAM DirectX: Versión 9.0c Almacenamiento: 600 MB de espacio disponible",
    "reviews": [
        {
            "review_text": " Void &amp; Meddler is a cautionary tale to any who might choose to meddle with the void: style is no substitute for substance, and a story cannot survive a central vacuum.   Mechanically, the game is unremarkable, a fairly linear point and click adventure. The puzzles are simple, though sometimes nonsensical. Aesthetically, there is a lot to praise - a strong visual style with rich use of light and shadow, a simple yet flavourful soundtrack, crisp details - the cyberpunk setting really comes together. Unfortunately, the powerful setting and solid mechanics are in the service of a game which is not enjoyable.  Fyn, the protagonist, lacks both empathy and any measure of self-awareness, which renders play somewhat unpleasant. The dialog is disjointed, repetitive, and at times painfully derivative, unintentionally reflecting the shallowness of the protagonist in musical references and nihilistic cliches. The plot itself, already hampered by Fyn and the dialog, is uneven and underdeveloped. Void &amp; Meddler touches upon well-established cyberpunk tropes and themes, but in an exploitative manner, without any discussion or - in some cases - reason.  It is hard to pan a game at all, let alone one which clearly has so much earnest effort behind it, but I would counsel most to avoid Void &amp; Meddler. You  may  like it if you are a fan of cyberpunk and neo-noir from a stylistic perspective, particularly if the sociopathy of the protagonist is no barrier.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I got a game on steam, it was a cyberpunk adventure game with a female protagonist that had a premise about messing with memories, by this point I felt like I'd heard this one before. Twenty minutes later, I'd bullied a nerd, flirted with a robot, romanced Ewan McGregor and made a guy shoot himself like twelve times, which never stops being funny.  I love Cyberpunk, colourful, asian-american-cross, all sorts of interesting characters and a moderate, sensible quantity of sex and drugs and stuff.  This game follows Fynn, your run of the mill Cyberpunk punk who also happens to be a complete ♥♥♥♥♥, good, too many characters are supposed to be nice and relateable, I personally love playing as jerks. I have enough being nice in my normal life, in video games, I want to be a total jerk to everyone.  As well as relatively engaging (if somewhat unchallenging) puzzles, and a main character that's incredibly well written (to the point where I would click every option on every interactible to hear what she had to say), the game can also be a bit unsettling. The post-sex conversation with this weird woman (or whatever it is for you), all your options are weird symbols, I liked that. The bullying of the nerd was so longlasting that it just makes you feel uncomfortable without feeling too forced. The repeated suicide was super creepy the first few times.  I feel like I'd love to keep talking, but this game needs to be first-hand. Buy it, play it, done.",
            "review_score": "1"
        },
        {
            "review_text": "(7.7 hrs on record on my bf's steam acc, so don't let the little playtime fool you.)  I LOVED this (ep.1). So much I bought the whole game plus the soundtrack on Humblestore for myself too. Can't wait for the second episode!!!  *super pretty *great soundtrack *very atmospheric and interesting characters (robots, animal/human 'merged' people, etc.). *different way to deal with puzzles that lead to different endings  10/10, would recommend! &lt;3   EDIT: the release of Episode 2 is unfortunatly overdue. The dev says they had a fire and they're ofc working on it and will deliver as soon as they can. If you want to be save, just buy ep. 1 for now, or show some love and trust and get the full game and be patient! &lt;3  EDIT2: EP2 is finally here! Dev delivered! yay!",
            "review_score": "1"
        },
        {
            "review_text": "Void and Meddler has an amazing Cyber Punk feel that I haven’t seen done that well for a long time, at least as an adventure game. There is a big Bladerunner heart pumping all over! Therefore, I highly enjoyed it! The graphics are pure sweet burning eye candy, creating goose bumps in combination with the music. So make sure you get the soundtrack, as well!  Though be aware that the game isn't that long. I'm about 100 minutes into the game and the episode already ended. But!!! You have three different paths you can choose – unfortunately that wasn't really visible to me. I only recognized the possibility after I checked the achievements and did some research. They should at least give you a hint about that, after you finished the game.  Sadly, the same goes for the puzzles: They didn't feel neither fun nor new. I mostly hated them, solving them by trial and error. I also did a lot of unnecessary walking. There are not much puzzles, though, but I got stuck several times and walking made it really hard to keep patient.  For me the game felt good enough to wait for the next episode, because it has a really amazing, tight atmosphere. Nonetheless, I hope the next episode might have more to offer, like more interesting characters (that actually talk to me) or that the story is more focused. The character can sometimes feel a bit too 'Whatever', which makes it a bit hard to really feel for her and not dump her and explore the city on your own ;)  But fans of adventure games and cyber punk will find a friend in the game, come what may!",
            "review_score": "1"
        },
        {
            "review_text": "Great aesthetic, but very short.  I got the season pass and the soundtrack, and loved everything I got out of it so far. It's the waiting for the rest of the episodes that's the downside. However, that's the only outstanding downside I can find with it at this point in time. The gameplay doesn't hold your hand, nor is it so frustrating that you want to give up. I almost always buy soundtracks with games if available and this is one that I listen to on its own. I expect the story to go great places as more is released.  Really hope this gains more attention; it deserves it.",
            "review_score": "1"
        },
        {
            "review_text": "I was pleasantly surprised by Void &amp; Meddler after some of the middling reviews. There's no question, the puzzle design here is atrocious. The game drops you into the middle of a world that is very familiar if you are a cyberpunk fan, but it's not really clear what your character's motivation is besides getting high, and it's not at all clear where to go or how to do that. Be prepared to slowly and painfully try using everything with everything, to no entertaining result. Fortunately, the game is rescued by its aesthetic. It reminds me a lot of Sinless in that regard, except instead of being a flip screen adventure it's a point and click. Like Sinless, the music is great and the graphics are delightful. Like Sinless, the writing leaves a little to be desired. But the atmosphere is so thick! There are much better adventure games being released these days if you just want a good story, but this game gets a thumbs up from me on the strength of its ambience. If you're not a cyberpunk nut you might want to wait to see if future episodes improve the puzzles and narrative a little bit, but if you are a cyberpunk nut then it pushes all the right buttons.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very Short Episode. Not really many puzzles to be solved. But characters and design are beautiful. I would have loved voice acting in it. worth a playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "A bit too much pixel hunting and nonsense inventory puzzles for my taste. Great aesthetic, just lacking a bit everywhere else.",
            "review_score": "-1"
        },
        {
            "review_text": "Where to start? Soundtrack? Ridiculously good, and very fitting for the mood of the game. Visually the game is incredible. Some difficult puzzles. Would love to see the next episode. Edgy plotlines at times, but it is a dark cyberpunk.",
            "review_score": "1"
        },
        {
            "review_text": "Beat the first episode in 83 minutes, very quick first episode. HOWEVER, those 83 minutes were filled with amazing visuals and nice music. I am a bit disappointed in the lack of things to do, I thought I would be able to do a bit more instead of it being very straightforward with the things you have to do. But besides that I had an amazing time playing the game and very glad that I bought the first episode, I am definetely buying episode 2.",
            "review_score": "1"
        },
        {
            "review_text": "Needed to actually USE A WALKTHROUGH to get through this game. An hour walking around not know what the hell I was suppose to do. Made a kid commit suicide from teasing him about his break up with a lover. wth. Cool art style, like the atmosphere and anthro characters. Wouldn't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing episode 1 I'm intrigued. The story is good, but it is a bit confusing sometimes and not everything has made sense (I'm guessing it will be explained). I did have to consult a walkthrough several times; it's hard, but maybe I just suck at Point and Clicks.  The best thing is the setting. The game has a powerful atmosphere that really sets the scene, and it's somehow completely alien but so believable. And it looks good! One thing I think would improve this game is a clearer goal. Like, obviously finding the memories, but the game seems to want you to wander around clicking everything and using everything with everything until something happens. Which frustrates me, especially with how long it takes to travel anywhere. Then again, maybe that's just PaCs in general. But I think it has promise, and I'm going to continue playing.",
            "review_score": "1"
        }
    ]
}