{
    "app_id": 378080,
    "name": "Rack N Ruin",
    "release_date": "2015-09-01",
    "developer": [
        "LifeSpark Entertainment"
    ],
    "publisher": [
        "LifeSpark Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "achievements": 31,
    "positive_ratings": 57,
    "negative_ratings": 15,
    "price": 6.99,
    "description": "Chaos reigns in this top down action adventure game starring Rack, a demon with an appetite for destruction. Pave a path of mayhem as you guide Rack on his quest to jump start the Apocalypse. Wield powerful magic, decimate your foes, unravel mind bending puzzles, and smite titanic bosses all while corrupting a vast open world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/378080/header.jpg?t=1447377024",
    "minimum_requirements": "OS: Windows XP+ Processor: Pentium 4 or greater CPU with SSE2 instruction set support. Memory: 2 GB RAM Graphics: DX9 Supported Video card. DirectX: Version 9.0 Storage: 2 GB available space Sound Card: DX Supported Sound card.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a great game. I'm not a huge fan of the writing, but from a strictly gameplay perspective, you've got all the elements here that make games like ALTTP great. A massive open world to explore, really great and tough combat. Plenty of hours of gameplay, interesting and unique enemies and bosses! Thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "This game seems influenced by two things. Zelda and Invader Zim. I've read all the main characters lines in the voice of Richard Horvitz (voice actor, did voice of Zim) thus far and it fits rather well.  Beyond that the art style is fantastic.  The game itself plays pretty decent. The levels do get reused but similar to how areas are reused in 'A link between worlds'. The boss fights, oh the boss fights are amazing.  The game rewards exploration and while the 'you should go here' you don't exatcly have too. You can roam around freely.",
            "review_score": "1"
        },
        {
            "review_text": "Old school Zelda meets Binding of Isaac.  + Solid gameplay + Wonderful art style + Music is great  - Writing is hit or miss  The game controls like a twinstick shooter, but plays much like the old Zelda games. Has some great humour, but some of it is meh. The gameplay however is solid and the soundtrack is absolutely amazing. The game has a definite Snes vibe to it.  Would recommend in a heart beat, already shaping up to be one of my favorite games in years.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Indie Game!  Graphics: 10/10 Controls: 9/10 Inventory/HUD: 9/10 Combat/RPG: 10/10 Story/Atmosphere: 10/10  Overall: 9.5 / 10",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful and a lot of fun.",
            "review_score": "1"
        }
    ]
}