{
    "app_id": 378100,
    "name": "Nyctophobia",
    "release_date": "2015-08-25",
    "developer": [
        "Lightning Man Media"
    ],
    "publisher": [
        "Lightning Man Media "
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 11,
    "positive_ratings": 264,
    "negative_ratings": 308,
    "price": 1.59,
    "description": "Your truck is wrecked, your flashlight is dimming and darkness surrounds you. Your fears come alive. Get to the generator and bring back the light before “The Keeper” finds you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/378100/header.jpg?t=1469507647",
    "minimum_requirements": "OS: Windows 7 Processor: 2GHz Intel Duo Core Memory: 1 GB RAM Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I knew from the trailer that the graphics weren't exactly next gen but this is really bad. It looks like a game for windows 95. I could look past that if it had good atmosphere or gameplay or was actually scary. So far none of these are the case. I've only played the game a little bit but I have a pretty good idea of the game's overall potential. I'll update my review if the game gets better but I dont' think i'll be able to tolerate too much more of this.",
            "review_score": "-1"
        },
        {
            "review_text": "a boring game made by a dev that has no idea how long flashlight batteries actually last in real life.  yes I get it's a game but the main mechanic revolves around feeding your flash light like pack man eats dots.  it's borin and not a fun mechanic.",
            "review_score": "-1"
        },
        {
            "review_text": "Nyctophobia is a game that I can't recommend because: - the price is too much for it's quality - it is boring - it has issues - it is more a walking simulator than a horror game - the soundtrack is really bad - the game is too short - the concept is inappropriate - the only good reason to install this game is for the trading cards ",
            "review_score": "-1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and great game mechanics, the overall sound is good. Keeps you entertained and satisfied.",
            "review_score": "1"
        },
        {
            "review_text": "- Buy the game - Install the game - play 30 min - die in the game - restart - Finish the game - close the game - uninstall the game - go on my bed - CRY !!!  R.I.P. my 1,99€",
            "review_score": "-1"
        },
        {
            "review_text": "+looks good in store page -waste of money -unrealistic -prbly made in few hrs  - its impossibru to have hundreds of batteries scattered around the forest in small area, like wtf -u cant change sensitivity -makes u puke when u play it -and its not scary at all",
            "review_score": "-1"
        },
        {
            "review_text": "cheap really bad slender clone, but hey, it's got trading cards!",
            "review_score": "1"
        },
        {
            "review_text": " Please stop complaingng that game is bad!",
            "review_score": "1"
        },
        {
            "review_text": "║████║░░║████║████╠═══╦═════╗ ╚╗██╔╝░░╚╗██╔╩╗██╠╝███║█████║  ░║██║░░░░║██║╔╝██║███╔╣██══╦╝ ░║██║╔══╗║██║║██████═╣║████║  ╔╝██╚╝██╠╝██╚╬═██║███╚╣██══╩╗ ║███████║████║████║███║█████║﻿",
            "review_score": "1"
        },
        {
            "review_text": "  This game is horrible. Get the cards and delete it.",
            "review_score": "-1"
        }
    ]
}