{
    "app_id": 378260,
    "name": "Fortify",
    "release_date": "2016-04-08",
    "developer": [
        "Holgersson Entertainment"
    ],
    "publisher": [
        "Holgersson Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Action"
    ],
    "achievements": 27,
    "positive_ratings": 64,
    "negative_ratings": 21,
    "price": 3.99,
    "description": "Fortify is a real-time strategy game with a tower defense twist. Defend your castle from attacking monsters and siege weapons by using ranged and melee defenders, catapults, cannons, oil fields and more. You start at the iron age, advancing to the medieval age, and later, the imperial age.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/378260/header.jpg?t=1490811022",
    "minimum_requirements": "OS: Vista, 7, 8, 10 Processor: 2GHz Memory: 2 GB RAM Graphics: 1GB of dedicated video memory DirectX: Version 9.0c Storage: 300 MB available space Additional Notes: Mouse, Keyboard",
    "recommended_requirements": "OS: Vista, 7, 8, 10 Processor: 2.5GHz Memory: 4 GB RAM Graphics: Sapphire AMD Radeon R9 270X or equivalent DirectX: Version 9.0c Network: Broadband Internet connection Storage: 350 MB available space Additional Notes: Mouse, Keyboard",
    "reviews": [
        {
            "review_text": "TL;DR: Really nice game to fair price. If you like RTS/Tower Defense and have someone to play it with in multiplayer buy it immediatly!  I followed the development of this game for a while and bought it on release and I wouldn't say I'm disappointed, no it's definitely a really nice game. I'm a huge fan of indie games and also of RTS games, so this game was an easy buy-choice for me. And I don't regret the purchase, but this game is still not perfect. There are many small things that bug me and some of them are easily fixable. And I hope this game gets more content in future updates.   The biggest thing everyone who buys this game will notice immediatly is that this game has no resolution option at all, which would be no problem if it was in HD anyway or would have pixelart style, but its more in a flash-game kind of style, i.e. it has sort of high resolution textures and tries to look 'realistic'. I like the design and it fits the game perfectly but because there is no resolution option the game will be noticable blurry (at least in the main menu) when played in fullscreen. But I can live with that.  Then there is the 30 fps lock, which really is no problem at all because of the gameplay. But I noticed that when you advance time at night the fps lock will switch to 60, 90 and 120 fps, which then speeds up the game. That's not really professional, but it works...I guess.....nice workaround...but this probably explains why it has a 30 fps lock instead of 60 fps. Since 4x60fps = 240fps which would probably cause some problems on less powerful systems.  Next thing that I noticed are some AI problems here and there. The AI really has no AI at all except maybe some kind of pathfinding. This kinda sucks because you'll always have to rotate your troops so that they attack the enemy. You can't set something like patrol paths or auto-rotation. And everytime you change the direction of your ranged units you'll have to change it back, because the position-saving only saves their position, and not their rotation, so when you say them to go back to their default position but you rotated them earliert they will then look in the wrong direction. Dev, pls fix this!  Then there is the problem that most of the times you won't find someone to play with, and I doubt this will change in the future, probably it will become even harder. But yea, that's because not enough people play this game, that's not the games fault :D  ̶A̶̶n̶̶o̶̶t̶̶h̶̶e̶̶r̶̶ ̶̶m̶̶i̶̶n̶̶o̶̶r̶̶ ̶̶t̶̶h̶̶i̶̶n̶̶g̶̶ ̶̶i̶̶s̶̶ ̶̶t̶̶h̶̶a̶̶t̶̶ ̶̶s̶̶o̶̶ ̶̶f̶̶a̶̶r̶̶ ̶̶y̶̶o̶̶u̶̶ ̶̶c̶̶a̶̶n̶̶ ̶̶m̶̶o̶̶v̶̶e̶̶ ̶̶t̶̶h̶̶e̶̶ ̶̶c̶̶a̶̶m̶̶e̶̶r̶̶a̶̶ ̶̶o̶̶n̶̶l̶̶y̶̶ ̶̶u̶̶s̶̶i̶̶n̶̶g̶̶ ̶̶W̶̶A̶̶S̶̶D̶̶/̶̶A̶̶r̶̶r̶̶o̶̶w̶̶ ̶̶K̶̶e̶̶y̶̶s̶̶,̶̶ ̶̶b̶̶u̶̶t̶̶ ̶̶n̶̶o̶̶t̶̶ ̶̶m̶̶y̶̶ ̶̶c̶̶l̶̶i̶̶c̶̶k̶̶i̶̶n̶̶g̶̶ ̶̶a̶̶n̶̶d̶̶ ̶̶d̶̶r̶̶a̶̶g̶̶g̶̶i̶̶g̶̶.̶̶ ̶̶B̶̶u̶̶t̶̶ ̶̶t̶̶h̶̶e̶̶ ̶̶d̶̶e̶̶v̶̶ ̶̶s̶̶a̶̶i̶̶d̶̶ ̶̶h̶̶e̶̶ ̶̶w̶̶i̶̶l̶̶l̶̶ ̶̶a̶̶d̶̶d̶̶ ̶̶t̶̶h̶̶i̶̶s̶̶,̶̶ ̶̶s̶̶o̶̶.̶̶.̶̶.̶  The particle effects look okay, sometimes nice, sometimes not so nice. Animations look good. Textures are sometimes really good, sometimes blurry. All sprites look pretty good. All in all the game looks good.  The tutorial is very good (but sadly only explains the singleplayer) and you understand the game within minutes.  Even some classic RTS shortcuts work like Ctrl+123....  I couldn't find any really bad bugs and the game only crashed when there was a 1v1 tournament, organized by the dev. And when this was fixed I didn't experience any bugs anymore.   Btw the dev is really nice and helps where he can.  The balance of the game is okay I guess, I didn't notice any too powerful/underpowered units so far.   I would love to see some more options for defensive structures like actual towers that you can place wherever you want, or turrets or barricades. I mean there is the catapult and the tar field, but you always have to place it new when it burns down and you have to fire the catapult manually.   Of course I would also like to see more gamemodes/maps, especially for multiplayer. Maybe a coop mode or more than 2 player mode? Unlikely, but I would love it.  So yea, a pretty good game that could be even better after some updates, but since it was just released I'm looking forward to future updates.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little old school TD game, taking inspiration from older flash TD games its well paced and quite fun with just the right ammount of micro to not become boring or tedious. The only real downside i believe is replay value linked to difficulty increase on limited maps, that being said at this price its still a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid game. Graphics are so-so, but the core gameplay is solid. Multiplayer is really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and fast paced tower defense game. A bit short though, and the graphics qaulity could use some work.",
            "review_score": "1"
        },
        {
            "review_text": "An hour or so of fairly good gamplay, gets repetitive very fast, even within the timeframe of one game. There's very little content, I could definitely dig this if there was some building to it.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a fun game but vey short and flat gameplay. You beat the game very quickly. I like these kinds of games but it was to small for me. In my opinion it should have more ages, units, story etc...  On the other hand this game was not expensive so my expectations were low. You can find simmalar online java style games but better (more advanced) then this game.  Verdict: Do Not Buy.",
            "review_score": "-1"
        }
    ]
}