{
    "app_id": 378300,
    "name": "The Knobbly Crook",
    "release_date": "2015-06-09",
    "developer": [
        "Gnarled Scar Manipulations"
    ],
    "publisher": [
        "Gnarled Scar Manipulations"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 155,
    "negative_ratings": 16,
    "price": 0.0,
    "description": "Enter the surreal, disturbing, and ridiculous world of the Knobbly Crook in this old-school style point-and-click adventure. Completely free. No ads, no tricks.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/378300/header.jpg?t=1545680867",
    "minimum_requirements": "OS: Windows 98, ME, 2000, XP or Vista with DirectX 5 or above Processor: Pentium or higher processor Memory: 64 MB RAM Graphics: Supports all DirectX-compatible sound and video cards DirectX: Version 5.2 Storage: 2 GB available space Sound Card: Supports all DirectX-compatible sound and video cards",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Excellent point n click adventure game! I thouroughly enjoyed the story, the interactions, and that feeling of not knowing WTF I'm supposed to do the entire time until I just click stuff randomly and succeed.  Can't wait for Chapter 2!  The game isn't very difficult, I got 'stuck' a few times for 10 minutes or so at a time but was able to figure out everything without the use of a guide.",
            "review_score": "1"
        },
        {
            "review_text": "Great art, enjoyable off-beat humor, definitely not a cookie-cutter fantasy or SF world, and I'm enjoying it so far. A bargain at twice the price!",
            "review_score": "1"
        },
        {
            "review_text": "Fairly short game, easy to dip in and out of. Played with the Mrs who loves this sort of game.  We had a good laugh and lots of fun playing. Finished it in one sitting and was left wanting more.  Can't wait for the next chapter.  I would have been happy paying a small price for this game. If the next chapter is longer then I would have no problems paying for that.",
            "review_score": "1"
        },
        {
            "review_text": "This is game is so interesting, hilarious, AND FREE! no reason to not check it out. I WANT THE NEXT CHAPTER, PLEASE :'D",
            "review_score": "1"
        },
        {
            "review_text": "Great chapter. I honestly don’t mind that the game has been made by people with opinions about things, which is dangerous in this genderless - offended by everything society. The lines most character speak are godly :D Only the clicking system might be a bit annoying with having to change action icon A LOT of times (I used right click and clicked so many useless and unnecessary clicks). But I seriously enjoyed this little gem.",
            "review_score": "1"
        },
        {
            "review_text": "Nice point-and-click game for those who like them. It's free so if you don't like it no need to complain about it.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason the characters's voices annoy me and I personally don't like the fact of having to scroll the mouse wheel to select the different actions possible (like look at, talk, pick up, use ....).  Also the artwork feels kinda strange in the eyes.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: the setting is weird- but good weird the story is interesting (definitely looking forward to the next chapters) point and click, so your pc probably won't be as likely to hang free  Cons: if you're like me, you'll need the help of a guide/walktrhough a couple of times gotta wait for the next chapters, so you might lose interest",
            "review_score": "1"
        },
        {
            "review_text": "It has a good sense of dark humor and a nice art. The music feels chilling. It won't require anything. I personally dislike the game for some reason, but i will recommend it because of the gameplay and the art it was done.",
            "review_score": "1"
        },
        {
            "review_text": "++Great writing. +Good music. +Weird art. ++It's free! -- You will get stuck. It's a generic/classic point and click that has some charm.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible creative and artistic game. Oh and it's funny as well, a rare combination which works excellent. Looking forward to future parts! Hats off.",
            "review_score": "1"
        },
        {
            "review_text": "Very very funny, unusual and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Funny and charmingly demented. I enjoyed this little romp; it only takes about an hour to get through, and it's entertaining. For free, hell yeah!",
            "review_score": "1"
        }
    ]
}