{
    "app_id": 379320,
    "name": "Clandestinity of Elsie",
    "release_date": "2015-07-08",
    "developer": [
        "Cole Neumann",
        "Albin Bernhardsson"
    ],
    "publisher": [
        "Cole Neumann"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "RPGMaker"
    ],
    "achievements": 16,
    "positive_ratings": 74,
    "negative_ratings": 18,
    "price": 3.99,
    "description": "World War Two veteran and mentally-damaged alcoholic Hayden Warrick awakens from a night of drinking to find that his wife Elsie has mysteriously disappeared.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/379320/header.jpg?t=1447376416",
    "minimum_requirements": "OS: Microsoft速 Windows速 XP / Vista / 7 / 8 (32-bit/64-bit) Processor: Intel速 Pentium速 4 2.0 GHz equivalent or faster processor Memory: 512 MB RAM Storage: 133 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Clandestinity of Elsie is a tough game to recommend. It is not terrible, but it is not terribly remarkable either.   The plot is fairly heavy handed and predictable early on. Which is a shame because other reviews and forum posts had led me to expect something more than something so obvious. Over the few hours it takes to complete the game there is very little story in general, and I don't just mean the direct narration. There are a handful of cutscenes that may have been meant to offer exposition, but they either come across as redundant (the mentally unstable protagonist Warrick is mentally unstable) or pointless (to avoid spoilers, the game details some event far in the past that doesn't really add anything). Despite all of the constant text provided by Warrick, he actually shares very little, often just stating generic thoughts like 'what luck, a medkit!' or 'There is nothing in the trash, but what was I expecting?' Or '6 bullets, that's great!' (not actual quotes, but similar texts popped up throughout). There is also an extremely small cast of characters here, and that are not so much mysterious as they are underdeveloped. I kept my eye out hoping to find some kind of indirect narration hidden in item descriptions, locations, and so on, but nothing came from it. Even the use of a Nagant seems like a missed opportunity.   The game also boasts a 'psychological story with mind-bending qualities,' but I did not really see any thing psychological besides the fact that someone mentions they are not wedding counselor (to which Warrick replies 'you sure sound like one,' the intrigue! Mysteries abound!). The mind-bending aspect does not really work because we have no relative sense of what's normal or strange in the game, and there is never much believeablitiy on any surface of the game. That is to say, the player has no sense of something mind-bending going on (besides Warrick stating how strange and nightmarish this is, and yet he seems to be fine scrounging around for bloodbags and ammo). No mechanic or element of the story really warps the players perception of the game's story or world. This could be a limit of engine, but even Hotline MIami (through some strange text and dates) and Super Mario Bros 3 (through small visual elements) prod the player to question the game world they inhabit.  Mechanics wise, it is nice to see an RPGmaker that is not form of RPG or turn based combat. However, combat feels too limited to be intense. Making the revolver fire slow so that the enemy can hurt the player was a good choice, but that's unfortunately all the game can offer. Again, this might just be due to the engine or something, but your character aims in four directions and enemies run on a grid, so those are two elements that mar the aforementioned solid mechanic of slow fire rate. To add on to this, there are quite a few sections of the game where you are confined to tight hallways so combat turns into you hearing the monsters cue, and then just firing forward. Because the game seems to really reach for a psychological aspect, the lack of some sort of fear mechanic was a bit strange (think Call of Cthluhu: Darkest Corners of the Earth, or Amnesia). There are some areas that do allow you to simply sneak past or run by enemies rather than engage, which, again, is refreshing for an RPGmaker game.  Normally I wouldn't comment on graphics (though I will praise style), but I do feel like the graphics affect the gameplay in this case. The lighting and coloring make it very hard to see. It is understandable for a game that is trying to be spooky to have low lighting and darker colors, but making a game with all the all browns and greys in the crayon box under dim lighting can strain the players' eyes.  Though it is definitely playable, and at parts enjoyable, I do not find myself easily recommending this. It is a farily short game that gets talked up a bit too much, and offered a decent experience. At the same time, it does not do anything particuarly well or different. I would much rather give this game a lukewarm 'might recommend,' but Steam only gives me two options so for now I cannot see myself recommending this game. If you plan on enjoying it, you really should go in with low expectations.",
            "review_score": "-1"
        },
        {
            "review_text": "Clandestinity of Elsie is a good survival horror game, built in the RPG Maker engine, no less. The author's ingenuity and skill at creating a 2D game in a very similar vein to Silent Hill is to be commended.  The trouble I had is the same that I had with Resident Evil: there is an emphasis on fighting enemies when that is the weakest aspect of the gameplay. Silent Hill 2 had a really excellent setting whereby you could adjust the difficulty of the puzzles and difficulty of the action sequences independently. I wish this game had that.  I'd give this a recommendation, easily, if there was a god mode. Or perhaps more med kits.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an RPG maker survival horror game. The game is about some alocholic ww2 vet looking for his wife. The game constantly throws the whole alcholic PTSD thing in your face with him randomly waking up drunk for no apparent reason. The game follows the classic horror trope where it purposefully makes no sense. There are zombies then there's not, there's people then there's not, there's random flashbacks, you randomly wake up drunk in different spots, somehow having teleported. It's supposed to be 'mysterious' and 'artistic' but its really just annoying, boring, and nonsensical for the sake of being so. There's barely any story here. The game just suddenly wraps up at the end and its over.   Then there's inventory. All you do all game is use a pistol, pick up bullets and medkits, and that's it. You fight the same 3-4 enemies. Combat is terrible. You can only shoot straight forward, but enemies can zigzag up and down. Your gun fires once every 3 seconds or so, but enemies can run at you 100 mph. I would shoot a guy 4 squares away, and even with kickback he'd get to me before i could shoot again, which makes no sense. Sometimes guys suddenly know where you are from across the room when its dark and they aren't looking at you, and either times they don't, making no sense and stealth not viable. Sometimes in dark areas you will turn a corner, and a guy will already be right there, leading to cheap damage and hit's, since you can't do anything. The controls are finnicky and super unresponsive. With a gamepad I would constantly turn to shoot, and my guy either wouldn't or would turn then turn back immediately, and this was with analog and direction keys. You would try to navigate in a narrow path and your guy wouldn't turn to turn run down it, or he would turn but he would't run even though you pressed the direction. In a game requiring running, fast movement and turning, the poor responsiveness lead to many of my deaths. Also in many rooms theres only a specific spot you can go to next area that isn't marked, or on streets you can only go to new area by going to one square on the top right, instead of any part on that side of the screen. Many of the environments are recycled. The game gets super repetitive and boring. And the ending has no real bearing on the story and seems to just be thrown in there.   5.5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a survival horror game created with RPGMaker. It works better than you'd think it would, and while short, it was worth the play. Very much influenced by Silent Hill - it even has reference to a specific quote from Silent Hill 2 (you could probably guess it, but I still won't spoil it).",
            "review_score": "1"
        },
        {
            "review_text": "This game felt so tedious to play. I read the reviews that it is a short game so I decided to finish it. The background music is so generic and I really only notice 2 kinds of music the whole game: the regular background one or the one when the monsters noticed you. I'm probably really dumb or something but even when I finished, I had no idea who Hat man, alice or what the zombies/monsters were (or meant). I only understood what happened with the wife because that was literally the ending. The game tries to do something interesting by constantly flashing some scenes but I didn't understand what it was trying to say.  The idea was really cool, to make a zombie fighting game. However, the slow response time of this game (maybe because it is rpgmaker) makes it very difficult. If you watch the gameplay of the fighting sequence in the video, I think some of the fighting they make it 2x faster. When I was playing, it is very difficult to shoot, kite, and then shoot without getting hit because of the response time. Basically, there is no mechanics to this game. On top of that, for a zombie/survival horror (not really that genre), it is hard to be scared if you can't kite without getting dumped on by zombies.   Everything about this game was just mediocre and tedious. I got it from a bundle so it costed me 0.36. I know people are really into retro and all that old school gaming stuff, but modern games should not confine themselves and suffer from those problems that snes had.  I straight up didn't enjoy the game, but I don't want to ruin someone's career by leaving a thumb's down since a lot of people don't read reviews.",
            "review_score": "1"
        },
        {
            "review_text": "The story was okay for me, didn't feel like anything overly special. The little cutscenes did keep me interested in where the story went, even if it was pretty predictable. Some of the areas were pretty tricky to get through, and you had great incentives to explore everything. Game has easy to grab achievements, which is always nice.   The combat was not my favorite. I definitely found it tricky to get used to. The gun only shooting once every 2-3 seconds added a little extra challenge. I will admit I had some trouble with certain sections. This was mostly due to the only light source being your flashlight, so enemies can surprise you. Then you have to shoot then run, shoot then run too. It's not a bad thing for most, but I wasn't a fan.   Grabbed it for only $0.50 so I'd say I got my money's worth. I don't think it's a bad game, just not something I would replay or recommend. If there was a neutral option for reviews, I would choose neutral.",
            "review_score": "-1"
        }
    ]
}