{
    "app_id": 379530,
    "name": "Fate Tectonics",
    "release_date": "2015-09-09",
    "developer": [
        "Golden Gear Games"
    ],
    "publisher": [
        "Toy Temp"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Simulation"
    ],
    "achievements": 54,
    "positive_ratings": 96,
    "negative_ratings": 31,
    "price": 7.19,
    "description": "Build up a world piece-by-piece using the power of the god-like Fates, while keeping them happy enough to avoid world-shattering temper tantrums!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/379530/header.jpg?t=1492972981",
    "minimum_requirements": "OS: Windows XP or better Processor: 2.33GHz or faster x86-compatible processor, or Intel Atom™ 1.6GHz or faster processor for netbook class devices Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows XP  or better",
    "reviews": [
        {
            "review_text": "The reviewer who said, 'Populous meets Carcassonne' nailed it in one. Balancing the gods' needs and preferences is fun and addictive, and piece placement zen really scratches the OCD itch. The music changes with the situation and adds to the intensity. Please support this game and its excellent execution!",
            "review_score": "1"
        },
        {
            "review_text": "So far I really enjoy this puzzle game. Artstyle is pixely and to my liking. In the 'serenity' mode it's very meditative and feels like oldschool endless puzzles with some nice 'god-game' twists. And for those who want action there's always timed mode with all sorts of achievements.  If you liked Fate Tectonics, I think you may also like boardgame puzzle citybuilder Concrete Jungle.",
            "review_score": "1"
        },
        {
            "review_text": "It was love at first tile. I can't stop playing. The gods need me and I need them. There's just so much to build and things keep happening. IT WON'T STOP. I JUST NEED TO BUILD ONE MORE CITY. ONE MORE OCEAN.  THE GODS WILL NEVER BE PLEASED BUT I'M TRYING ANYWAY.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and fun but *really* not worth the price. This is a $5 game IMO",
            "review_score": "1"
        },
        {
            "review_text": "Fate Tectonics is pretty compelling. Some bullet points...  -Interesting roguelite conventions - building a world can take time and if you fail it the whole thing's gone. Plus there's an in-game time limit so you can't just endlessly work through a single world. -As of the time of this review, I find that the game has a problem in that some of the intricacies of the mechanics can be very opaque. This is because, as a realtime game, you may not have the time to study how a disaster unfolds - not only do they happen reasonably quickly, but you generally are trying to do things simultaneously to manage them, not simply studying them. it is of course reasonable for a trial-and-error game to involve trial-and-error situations; unless you try to game a save, however, it may potentially take you some time to figure out certain mechanics without this (again, I haven't tried to do this yet, but I probably will today.) -Endearing sprite art; that sounds like a basic commendation for indie games, but the art really is quite charming and well-done. -The dev team is committed to rolling out updates over time, including attempting to address gameplay issues as well as bugs/et cetera. The price point may seem pretty hefty but there is long-term support in mind here.  Overall I recommend it. I generally play shooters and other action games; Fate Tectonics has been a very welcome change of pace, and enjoyable to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Super fun. Doesn't require deep investment in rules and strategy to start with, but has the ability to grow over time. Do yourself a favor and get this game.",
            "review_score": "1"
        }
    ]
}