{
    "app_id": 379870,
    "name": "Alteil: Horizons",
    "release_date": "2016-10-27",
    "developer": [
        "Apocoplay LLC",
        "Ludeme Games",
        "Coreedge Inc"
    ],
    "publisher": [
        "Apocoplay LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 48,
    "price": 0.0,
    "description": "Alteil Horizons combines Tactical RPGs (like Final Fantasy Tactics) with the deck-building and collecting elements of card dueling games.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/379870/header.jpg?t=1482262032",
    "minimum_requirements": "OS: Windows XP or higher Processor: 586 Memory: 2 GB RAM Graphics: SVGA Network: Broadband Internet connection Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I want to like this game, and I want to recommend it. I really do. The game mechanics do seem like they would provide some great strategy, and it doesn't look like you need to gather a huge number of cards or go out of your way to build a workable 'deck'. But in the game's current state I just can't do it. The bugs, connection issues and other technical problems just cripple this game too much. I know that the devs are working on the issues, and in more ways than just telling us they're working on them; the game's performance has slowly been improving day by day, so I will give the game some credit here too, that the devs do care about the game and the player experience and are putting effort into it. But it's just not quite there yet, and I do also take off credit for the devs releasing the game in the state it was in rather than ensuring that the game was in a solidly playable state before Steam launch.  So I will say this: put the game on your wishlist and wait it out until the bugs are cleared up, as I am confident they will eventually be, perhaps even soon, as it is clear the devs are working hard to fix them. But I vote this game down for now, because as it is currently it's only barely playable.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to try the game but i guess it had day 1 issues, said i would try it again later. An hour later I found out it was somehow running in the background of my computer and had to go to task manager to close it....... what game does that???",
            "review_score": "-1"
        },
        {
            "review_text": "game hase issues with bugs, they fixing them! so i guess they working on the problem  thumbs up couse:  unique card game own concept I dont know if i like it or not, but im tierd of MTG and hearthstone clones.  might have its place in a non-random card game. since you have access to full deck.  if you mixed chess with mtg you got something like this. i think it has some pontencial. games apear to be long! 30 mins one game at least. its for thinkers.  The most of game mechanics i see for the first time, therefore everything felt strange, but i was realy happy that i did not download any copy of idea.  i am glad (even if buged game) that i checked it out.  changed positive review to negative due to ower-greed paywall. 5 random cards = 1$. torunament price is 5$ kinda pay to win!  im not that kind of person that would spend hundrets on digital cards. could be more user friendly.  For 2 days of play i got 300 FM (idk what that means) but its good enough so i can get 1 random card for 120 fm. and like you can use 3 same cards in fact, in this game you need 3 same cards becouse of review mechanic.  so in two days of play i could buy 2x random cards. practicaly 2x bosters each containing 1 card.  this game is for one that wants to grind as horse and on top of that pay tonnes of money to actualy start playing normaly. yep kind of not actualy free to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Just play the web version.",
            "review_score": "1"
        },
        {
            "review_text": "Why does steam let people upload games that dont even work, runs terribly and crashes constantly.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm passing on a game review written by a friend of mine who has played alteil heavily and on an occasion I jump in to play as well. We played on the website long before it got shut down, revived again and introduced to steam. I present to you, my friend's review:  These are the Pros and Cons I've found about this game  Pros: The mechanics of the game were easy to understand (although I would have preferred a video rather than tutorial quests) The card art is amazing Looking at the cards and player battles it's easy to notice there's a wide variety of strategies to use, and while there seem to exist deck structures that can be seen more often than others, the way each player aranges their deck or make little changes to the cards can change the outcome Looking arround and asking older palyers I found that there are several options for new players to get new cards, not taking into account events, players can:  Buy cards with currency earned during battles  Random treasure at the end of a battle regardless if you won or lost the battle  You get a card the first few times you level up, past that you get a card every 5 levels, once you reach a certain level it's guaranteed to be a high rarity card  Finishing the single player mode quests  Using special cards earned during events or a mode called 'Draft Tourney' to redeem specific cards  You get to keep several cards you used during the Draft Tourney   At level 10 you are gifted 3 starting decks The rate at which players earn experience and level up seems to be friendly to new users, high level players (over lv200) might take a bit longer but they still don't feel it like grinding Like, seriously, the art in the cards is awesome   Con: They seems to be having some trouble handling the steam client, what with it being either laggy or taking too many resources to run The browser version has come with a few hiccups too Some old players are too competitive   Conclusion: Although the Cons on the game make an impact on the playability of the game, I can feel the devs are constantly working to fix and solve whatever problem comes up while also looking for ways to improve the game. It's definitely worth giving a try   Thank you for reading my friend's review and I hope it helps you to give this game a try!",
            "review_score": "1"
        },
        {
            "review_text": "Give developers time to fix this game it have unique gameplay and it didn't copy other tcg games like shadowverse copied hearthstone. 8/10",
            "review_score": "1"
        }
    ]
}