{
    "app_id": 379980,
    "name": "Panzermadels: Tank Dating Simulator",
    "release_date": "2016-03-09",
    "developer": [
        "DEVGRU-P"
    ],
    "publisher": [
        "DEVGRU-P"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Memes",
        "Anime",
        "Dating Sim"
    ],
    "achievements": 0,
    "positive_ratings": 1157,
    "negative_ratings": 107,
    "price": 6.99,
    "description": "Panzermadels! The first dating simulator to deliver a thoughtful look at tanks, and the men who date them!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/379980/header.jpg?t=1511280295",
    "minimum_requirements": "OS: Microsoft Windows Vista Processor: 1.5 Ghz Processor Memory: 4 GB RAM Graphics: Integrated Graphics Chip Storage: 2 GB available space Additional Notes: If your PC can't run this how are you running Steam?",
    "recommended_requirements": "OS: Microsoft Windows 7 Processor: Anything better than a 1.5Ghz Processor Memory: 8 GB RAM Graphics: Integrated Graphics Chip Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "This game gives you the choice of riding a variety of tanks. You have to choose your tank wisely, as each one has their strengths and weaknesses depending on the terrain and situation.   For example, the M4 is a very versatile medium tank with a 75mm gun, and although it's armour isn't particularly strong, a skilled commander can utilize it's sloped surfaces and rounded turret for maximum effect. Meanwhile, the T34 has great sloped armour and wide tracks for effective traverse in rough terrain, but lacks the more sophisticated equipment and reliability of the Pz.IV. Of course, choosing the legendary Tiger I might be tempting with it's great 88mm and thick front armour, but you have to be mindful of it's unreliable engine.  I have to admit though, that the selection of tanks could, and should have been greater. There are several other NPC tanks that you will meet through the game, like the Maus and the B1, but unfortunately you don't get to drive them. The areas in the game are also not as varied as they could have been, but includes a beach, a mountain and several urban areas.  However, despite it's shortcomings, this is a very charming tank simulator.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best game since Hatoful Boyfriend. Also, this is the best way to disappoint your parents.      Now, if you want boats... KanColle is your answer.",
            "review_score": "1"
        },
        {
            "review_text": "My former friend bought me this game and I got my ♥♥♥♥ sucked by two different tanks before being court-martialed and executed. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "You can date tanks in this weird dating simulator, it a mix of the plot from Sakura games where most of the girls like you for completly odd reasons, looking at you Tiger I, but on the other hand you can date a small range of the main battle tanks from WWII, which are, in order of meeting: M4 Sherman, T-34, Panzer IV, Tiger I and IS-2. Other tanks are introduced as the game 'progresses', depending on how fast you hit the spacebar, which are: Char-B1, Type 3 Chu No, Polish 7-TP, Bob, and Maus. The size of the tank, for example, The Tiger I Super Heavy Tank and the Panzer VIII Maus Super Heavy Tank are judged by the size of the 'Ammunition Racks' basically thier chest size, while the Char B1 is smaller. There are some tank jokes in there for the people that know about that stuff, 'Whats happening with this girl crying?', 'Oh Tiger I breaks down alot, its a design flaw' which mock the tanks designs.  Id give this game a 10/10 for the sole reason of being able to somehow illustrate a Tiger I Super Heavy Tank in human form so you can date it.",
            "review_score": "1"
        },
        {
            "review_text": "Tanks/10  Also the ending was more rushed than a Liam Neeson movie.",
            "review_score": "1"
        },
        {
            "review_text": "In Panzermadels you play as a guy named Erwin, who is enlisted into tank school. You must search around trying to find the place, but when you do find the place things aren’t as you imagined. From there the game turns wild. The developer supplied a review copy for me.  I spent around 3 hours playing the game. There are 5 romance routes, but depending on your choice early then you may have an early ending. Each playthrough takes around 2 hours-2 hours 30 mins. I don't want to talk too deeply about the story but it's pretty wacky (in a bizarre sense) and there were always new surprises around each corner.   Positives  Choices – A lot of VN’s miss out on this part, they forget to let the reader have choices and gladly this game has an array of choices to choose from. Music – The music is well chosen and goes well with the game. Pretty creative and confusing – The game is highly creative, somehow associating vehicles with humans and managing to combine them.  Funny and didnt stop suprising me – Right from the start the ‘wackiness’ of the game had me laughing, especially the crazy drill sergeant. The game didn’t stop surprising me and the scenarios I encountered kept me laughing for a while. Art style is pretty good considering it's an indie game – Most indie VN’s I have played have had a more rougher art style but this game has pretty nice art and an abundance of backdrops keeping the game fresh. “Ammo Racks, Armored Plating and Amphibious attachments” – The game is completely riddled with Innuendos and most of the times I could not help but facepalm and laugh at what I was reading.   Negatives  Spelling errors – At the beginning there were a few spelling errors but nothing that major.  Only 5 save slots – This limits you to how many saves you can have. This can be a minor for most who love to save often. story crossing – This may be wrong but t34 give me number on hill then next day in class she had to give me her number again apparently and was reluctant about it. Lack of audio options and customisation – There are no real settings in options like audio sliders or font text.    Overall, I had a lot of fun with this game. Mostly due to the innuendos and randomness that the game is. It made me laugh quite often and I could easily recommend it to gamers who are looking for a game which is a bit more extraordinaire and bizarre. The price is a tad high but if you feel it’s not that much of a dent on your wallet then go for it.   The only qualm I have with this game is that sometimes I felt like my choices were not really remembered at all. I did have a fun time though and again, this was a real funny game. ",
            "review_score": "1"
        },
        {
            "review_text": "  Experience a game that will make you feel shame upon launching it. A game with awe-inspiring design, a game with a plot so strange that you will give up on trying to decipher it and just roll with the flow, a game with communist tanks who look like girls. Bear witness to nazi tank occult rituals, a haphazard ending, historically comic writing and much, much more.   You are Erwin Lemmor, a student who just started going to tank school. Imagine his surprise as all the tanks are actually girls! The teacher is a perverted and angry drillsergeant, who teaches Erwin right from wrong in this strange and surreal world.  I don't think I would have played this if it hadn't been gifted to me.",
            "review_score": "1"
        },
        {
            "review_text": "I shunned all the slav tanks, ♥♥♥♥ed a Panzer IV and went to prison. 10/10, my entire life has led up to this.",
            "review_score": "1"
        },
        {
            "review_text": "This game has the following: -Comedy -Royalty Free Ukulele -Anime -Tanks Oh and also, you can actually, physically, ♥♥♥♥ a tank. 10/10, I do recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "If I ever need that EXTRA little smidge of courage to drop the toaster in the bathtub, I'll fire this one up again.",
            "review_score": "1"
        },
        {
            "review_text": "What All I Can Say :  ✔ I Can Ride Various Tanks ✔ Best Sergeant EVER ✔ The Jokes, I Laughed All The Times  But Hell, I Take T-34 Home, And In The Next Day I'm Dragged To The Court - IT ENDS HERE 8/10 I Want A Better Ending",
            "review_score": "1"
        },
        {
            "review_text": "Never has a piece of art felt so real and immersive.  Plus you get to date a tank 9/10 would invade austria again",
            "review_score": "1"
        },
        {
            "review_text": "This game... Where do I start... I'll start at the end I think. Thanks to this game, I want to buy a wedding ring and place it within a T-34 as a sign of devotion to my panzer waifu. And annex Crimea, that too.",
            "review_score": "1"
        },
        {
            "review_text": "This gaame taught me the most vaulable lesson I have ever learned; it is never impossible to have sexual intercourse with a tank.  Over all, this game was a life changing experience that I recommend to anybody who can count their A-B-C's. ( ͡° ͜ʖ ͡°)  My favourite waifu was Freddy Fazbear.",
            "review_score": "1"
        },
        {
            "review_text": "Was this a good game? Panzer Madels is an average dating sim, the ending is a bit too quick and ruins the story, but, the humor, the chracters and the story (Minus the ending) are well done, and as a WW2 buff, had me smiling a few times, at a cute moment and jokes. It's worth it if you have the money, but i wouldn't sell everything for it. But if you have the cash, buy the game and gain some smiles:)",
            "review_score": "1"
        },
        {
            "review_text": "A half hour in, and my drill sergent gave me free porn.  GOTY 11/10  worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game, prepared for a run of the mill dating sim, what I got instead was a lot of laughs over the characters and the jokes. 1,000,000/NEIN. Would purchase again.",
            "review_score": "1"
        },
        {
            "review_text": "I'm so sorry that we coudln't be together forever T-34. Don't blame the Plane Girls...",
            "review_score": "1"
        },
        {
            "review_text": "Fun VN with charm and humor if you have 10$ burning a whole in your pocket its definitly worth a buy",
            "review_score": "1"
        },
        {
            "review_text": "&gt;had sex with a hot russian model &gt;court-martialed the next day &gt;shot by firing squad for desertion &gt;mfw  10/10 would go inside a tank again",
            "review_score": "1"
        },
        {
            "review_text": "Not gonna lie, This game had some really cheeky, funny, cringy and historically accurarte Jokes that made me keep playing for more xD Panzer IV Is best nazi waifu, Fight me if you disagree. Ending was terrible, soo ♥♥♥♥ing terrible it just got the character development and ♥♥♥♥ed it, making the characters you grew development with useless in the end. But would recommend playing because the base game is actually got some great humour, you can learn a thing or 2 about tanks or world wars and you will want to killyourself after playing this game because the dense main protagoniast wants to shag these tank girls and probably was born autistic. All around stupid but great parody game on tanks to play because you hate yourself or if it is for the meme",
            "review_score": "1"
        },
        {
            "review_text": "  Background is stock photos blurred to avoid copyright infringement   Characters are drawn with paint   Music is royalty free ukulele   T34 has ♥♥♥♥ing pink hairs   This game is just an huge pun An horrendously big one  GOTY",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good humor wrapped up in the nightmare that is Anime...",
            "review_score": "1"
        },
        {
            "review_text": "You can say many things about this game  But one thing is certain      Panzer IV knows nothing about the krieg!",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "I now have a tank fetish 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's like Hatoful if the birds were girls and the girls were tanks, and the writing was good  honestly I feel like that should, kinda, make you wanna buy it?",
            "review_score": "1"
        },
        {
            "review_text": "It's like Hatoful if the birds were girls and the girls were tanks, and the writing was good  honestly I feel like that should, kinda, make you wanna buy it?",
            "review_score": "1"
        },
        {
            "review_text": "WARNING SPOILERS!                  Captain Fwiffo: Wot Captain Fwiffo: I was arrested by the MP Plasmic: For ♥♥♥♥ing tanks? Captain Fwiffo: No Captain Fwiffo: For dessertion Captain Fwiffo: :/ Captain Fwiffo: Dessert Plasmic: Are you a tank yourself Plasmic: or are you just Captain Fwiffo: No I am not Plasmic: some Plasmic: nerd Captain Fwiffo: I am a human Captain Fwiffo: My quest Captain Fwiffo: Is to be inside Captain Fwiffo: Of a tank Plasmic: Imagine if Plasmic: Tanks were chicks Captain Fwiffo: I'd date them Captain Fwiffo: I'd especially date the IS-2's Plasmic: Sounds like a tank racist to me Captain Fwiffo: It was all a dream xD Captain Fwiffo: Wait... Captain Fwiffo: Oh. Captain Fwiffo: He was shot in the courtyard Captain Fwiffo: Umm Plasmic: What is going on Captain Fwiffo: Wait Captain Fwiffo: Was that legit the ending Captain Fwiffo: OH MY GOD Plasmic: lol Captain Fwiffo: I GET PUNISHED FOR HAVING SEX WITH THE SOVIET TANK? Captain Fwiffo: BUT BUT Plasmic: HAAAAAAAA Captain Fwiffo: I LOVE HER Captain Fwiffo: PLASMIC Captain Fwiffo: I'M LEGIT CRYING Captain Fwiffo: I FEEL BETRAYED Plasmic: Cry harder Captain Fwiffo: I AM Plasmic: You're a communist Captain Fwiffo: I AM Captain Fwiffo: I'M Captain Fwiffo: LEGIT Captain Fwiffo: CRYING Captain Fwiffo: RIGH Captain Fwiffo: NOT Captain Fwiffo: W Captain Fwiffo: OHMY GOD Captain Fwiffo: WHY Captain Fwiffo: I JUST Captain Fwiffo: WANTED TO LIVE THE REST OF MY DAYS Captain Fwiffo: WITH THE IS-2 Captain Fwiffo: *SOBS Plasmic: no Captain Fwiffo: OH MY GOD Captain Fwiffo: WHY! Plasmic: Be the IS-2 instead Captain Fwiffo: NO Captain Fwiffo: I NEED Captain Fwiffo: TO LIVE WITH THE IS-2 Captain Fwiffo: I AM NOT WORTHY TO BE THE IS-2 Captain Fwiffo: Please tell me that was Captain Fwiffo: IT WAS THE ACTUALLY ENDING Captain Fwiffo: OH MY GOD Captain Fwiffo: REALLY? Plasmic: lol Captain Fwiffo: WHAT THE ♥♥♥♥ DID I DO? Captain Fwiffo: I JUST WANTED TO... Plasmic: Side with the enemy Captain Fwiffo: I JUST WANTED TO BE WITH IS-2 Captain Fwiffo: I FEEL Captain Fwiffo: SO Captain Fwiffo: BAD   That's pretty much how I felt after completing the game",
            "review_score": "1"
        },
        {
            "review_text": "12/10  would ♥♥♥♥ a tank again ",
            "review_score": "1"
        },
        {
            "review_text": "Panzer IV is best girl. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Now I wanna date a Panzer IV or M4 Sherman myself!",
            "review_score": "1"
        },
        {
            "review_text": "This was more than a one off joke game I'd only play once and never do so again, this was a blessing and an experience.  10/10 would ram T-34 like a she were fascist again.",
            "review_score": "1"
        },
        {
            "review_text": "This was more than a one off joke game I'd only play once and never do so again, this was a blessing and an experience.  10/10 would ram T-34 like a she were fascist again.",
            "review_score": "1"
        },
        {
            "review_text": "There are those moments when you sit down and think to yourself, I just spent two hours of my lift trying to Penetrate the rear of a tank with my bore, Looking at Ammo racks and laughing about how Poland is a Soviet Puppet..",
            "review_score": "1"
        },
        {
            "review_text": "Do you like tanks? Do you like cute anime girls? What about both, AT THE SAME TIME? Panzermadels: Tank Dating Simulator is the epitome of the Tank Romance genre, with  STUNNING  fixed SD resolution,  BREATHTAKING  royalty-free music, and  AWE-INSPIRING  tank puns! With  6  different  waifus   TANKS  to choose from, and mutiple endings, AND A BEACH EPISODE. Without a doubt, Panzermadels: Tank Dating Simulator will make the  COOLEST  dude in the armor division. Pick up a copy... TODAY .  P.S. Best  Waifu  [i.imgur.com]  1940-FOREVER",
            "review_score": "1"
        },
        {
            "review_text": "It is quite a good VN, but some points definitely need to be improved. I had a text stuck in some moments, interface lacks some useful features, a little more music and sound effects will be great. But it's all not so important. The main thing is that this game has SO MANY funny moments, so I laughed about 70 percent of the game time. And yes, beautiful tank girls (lots of them). An 18+ patch is required. 8/10 DRINK VODKA AND HAIL SOVIETS, TOVARISCH",
            "review_score": "1"
        },
        {
            "review_text": "Made love to an IS-2. I was then arrested, court-martialed and executed. NO REGRETS. 122/10 IS OF MANY PATRIOTISMS  p.s. IS-2 best tankovy, would presumably sodomize again.",
            "review_score": "1"
        },
        {
            "review_text": "Super enjoyable has you laughing basically all the way through and only had one error where it kept looping and required a restart. Only played through once and the ending for mine was super abrupt and left me wondering what the f*** just happend. Still I give it a good review espicially if you have some basis in tank knowledge and like anime styled dating sims",
            "review_score": "1"
        },
        {
            "review_text": "I dated a Tiger tank Got laid Promptly got court masrsheled for 'fornication of military equipment worth more than 25,000 penance'",
            "review_score": "1"
        },
        {
            "review_text": "I got to screw a tank. All said and done. PANZER WAS THE BEST!!",
            "review_score": "1"
        },
        {
            "review_text": "I streamed this overnight to my friend who bought it for me and holy ♥♥♥♥ its funny as hell. this game is pretty clever with its jokes and it was kek worthy",
            "review_score": "1"
        },
        {
            "review_text": "Not my proudest fap but definetly not the worst.",
            "review_score": "1"
        },
        {
            "review_text": "Cracked brought me here and I just went on a downward spiral that ended in banging an occultist Nazi weeb tank  10/10 would follow Cracked link again",
            "review_score": "1"
        },
        {
            "review_text": "Girls, Tanks what's not to like :)  One of the most weird games I've played in years.  When you're in to this kind of games it's a 10 out of 10. If you think wtf it's not for you so don't buy.",
            "review_score": "1"
        },
        {
            "review_text": "i have the weirdest tank boner right now.      did you find tog II? ;)",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game, I discovered a hate for shermans.",
            "review_score": "1"
        },
        {
            "review_text": "Would Fap to",
            "review_score": "1"
        },
        {
            "review_text": "love it my fav game ever!!! i just love sticking my long hard rod inside a barrel of a panzer IV 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I want to be a fascist tonight.",
            "review_score": "1"
        },
        {
            "review_text": "I was able to work a Tiger tank better than Whitmann. I have accomplished enough in my life to call it completed now.",
            "review_score": "1"
        },
        {
            "review_text": "In a world where HEAT shells reigned supreme, a man playing World of Tanks gets one ♥♥♥♥ed by artillery for n-th time and decides to do madlibs on the toilet while taking a dump using only tank related words. The result is Panzermadels.   What you get for $10 is roughly 2 hours of hilarious tank related puns, dark inappropriate jokes (RIP Poland), and tasteless historical references. Not mention WoT players can get handy insights as to where to penetrate tanks such as the Panzer IV and the T34, as well as the ammo rack locations of the Maus and the TOG II. I probably gained about 400 WN8 after finishing Panzermadels, but I dunno for sure since Im a red.  Buy it, love it. and damn...the ammo racks on the TOG be huge!",
            "review_score": "1"
        },
        {
            "review_text": "DIS GAME IS GREAT 5 out of 7",
            "review_score": "1"
        },
        {
            "review_text": "I can't even describe how good this game is, nothing better than picking your favorite tank and then having sex with it! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "peeling potatoes  doing the sex  going to court  being shot  10/10 Game",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game that's absolutely worth the money and has some great tank humor. Don't expect a Muv-Luv tier story, but enjoy the humor and have a comfy evening with some tank girls.",
            "review_score": "1"
        },
        {
            "review_text": "Hi this is my first review  Pros- Great writing  Nice art  fun story  cons- would like the girls story to be more different  would like like more cg ",
            "review_score": "1"
        },
        {
            "review_text": "peeling potatoes  doing the sex  going to court  being shot  10/10 Game",
            "review_score": "1"
        },
        {
            "review_text": "9/11 IGN God is dead I am dead My ♥♥♥♥ is sore, this game is the gift that god intented to give us. Will play again. Replay value 100%  MLG game play",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would reccomend. ",
            "review_score": "1"
        },
        {
            "review_text": "It was great other than the fact that the game didn't want to launch",
            "review_score": "1"
        },
        {
            "review_text": "Other than some text errors in the dialogue, I found this to be an enjoyable tank dating simulator. Though, so far the endings I've gotten leave me feeling unfulfilled/unsatisfied. Not sure if I messed up somewhere, but if not, I feel that the they should be improved or otherwise edited.",
            "review_score": "1"
        },
        {
            "review_text": "Great and funny game, many WWII and WWI jokes, and other kind of jokes.   Weird ending though, could've been better.",
            "review_score": "1"
        },
        {
            "review_text": "DIS GAME IS GREAT 5 out of 7",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would fap again",
            "review_score": "1"
        },
        {
            "review_text": "i hate this i hate my life",
            "review_score": "1"
        },
        {
            "review_text": "Bob Semple I wish you had your own game, heck your own show, you adorably fugly corrigated iron nugget. T-34 is undeniably best tank, Sherman likes to combust into flames and Tiger likes to break down a lot, but the glorious T-34 just keeps going.   к а т ю ш а  I just wish there were more endings, I otherwise liked the game, it was a funny and ridcilous game that makes me wish there was an anime based on moe tanks or something more.    К Р Ы М Р О С С И И  If you ever looked a Panzer or a T-90 and thought 'I want to stick my ♥♥♥♥ in that' then this is the game for you, I know I thought that when I saw a T-90 rolling into Crimea ( ͡° ͜ʖ ͡°)  ",
            "review_score": "1"
        },
        {
            "review_text": "I have a tank...I have a girl.... UH!!! Tank Girl. Seriously, this game is just something else. There is literally nothing I can say about this game. If someone actually takes it seriously then I don't know what they were thinking.",
            "review_score": "1"
        },
        {
            "review_text": "My dad was a tank commander in the Army when I was born (true story), and as such I feel like I now have a certain attachment to tanks, despite joining the Air Force. This game helped me see how much I loved tanks in bikinis.  10/10 would date Sherman again",
            "review_score": "1"
        },
        {
            "review_text": "This game was strange at first but still enjoyable...The ending is not what you would expect ;-;",
            "review_score": "1"
        },
        {
            "review_text": "Well this certainly is a game that exists. It's quite silly and shouldn't be taken seriously. There seems to be inspiration from Kancolle and Girls und Panzer as well, with the mention of tankery. I think this game is an in between for me, I like it but I feel there is a lot to be worked on or just plain missing. The options menu is pretty lacking, only featuring an option to hide the message or skip. I would have liked to see a text speed option. A severe lack of music, a lot of the game didn't even have a soundtrack in the background, only some parts of the game did. Not that great of writing, seeing the characters start their sentences multiple times with 'haha,' was just kind of weird. While that is something you see in text conversations, it's not really something that belongs when characters are talking face to face. There is also no gallery where you can view the CG's after you get them, which I feel is a big feature of VN's and it's not good that it isn't there. Personally I was expecting something a bit more in depth. Perhaps that is my own fault, but after playing other VN's that are silly, such as Hatoful Boyfriend, I feel that this VN is lacking and needed a bit more work. For what it is I also feel that the price is a bit much. $5 would be more reasonable for this game.  All in all, the game is silly and has plenty of history jokes, but it lacks in actual depth and never seems to tred beyond its silliness into something that is actually enjoyable and not boring after a while. I was actually excited for this when I heard of it. I love tanks and anything WW2 related but I also enjoy VN's. So to be a bit disappointed by it is a bit of a shame. For the person who just wants a good laugh this might work, but if you're coming for something that actually stays interesting then I'd look somewhere else.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't really explain this game just like most other dating simulators on Steam. It is a rather interesting concept that Amercian developer DEVGRU-P had added to the proliferating genre. I'm not going to be bias in the review, but I'm going to list the gameplay and mechanics of the game.   The Good :  + There are usually chocies you can make during dialouge which affects what happens next. + Quirky characters with well-written dialouge.",
            "review_score": "-1"
        },
        {
            "review_text": "this game has made me contimplate my life and want to kill myself. if i had ever been more disapointed in my life, i would already be dead :(",
            "review_score": "-1"
        },
        {
            "review_text": "Calling it a game, or a simulator or dating seem a bit wrong as it feels like reading a book making a few decisions on the way. Point for the history aspect which is fun as with the ammoracking. Unfortanly as someone that loves tanks I dont feel the need to play this again. Would I had checked it out before buying it I would´nt have bought it",
            "review_score": "-1"
        },
        {
            "review_text": "End my pain and suffering  Please.  ",
            "review_score": "-1"
        },
        {
            "review_text": "its a meme game, and not a very good one",
            "review_score": "-1"
        },
        {
            "review_text": "What.",
            "review_score": "-1"
        }
    ]
}