{
    "app_id": 380,
    "name": "Half-Life 2: Episode One",
    "release_date": "2006-06-01",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Includes Source SDK",
        "Commentary available"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Sci-fi"
    ],
    "achievements": 13,
    "positive_ratings": 7908,
    "negative_ratings": 517,
    "price": 5.79,
    "description": "Half-Life 2 has sold over 4 million copies worldwide, and earned over 35 Game of the Year Awards. Episode One is the first in a series of games that reveal the aftermath of Half-Life 2 and launch a journey beyond City 17. Also features two multiplayer games. Half-Life 2 not required.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/380/header.jpg?t=1530046506",
    "minimum_requirements": "1.7 GHz Processor, 512MB RAM, DirectX&reg; 8.1 level Graphics Card (Requires support for SSE), Windows&reg; 7 (32/64-bit)/Vista/XP, Mouse, Keyboard, Internet Connection Recommended: Pentium 4 processor (3.0GHz, or better), 1GB RAM, DirectX&reg; 9 level Graphics Card, Windows&reg; 7 (32/64-bit)/Vista/XP, Mouse, Keyboard, Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Some more Half-Life 2.   Continues right where Half-Life 2 left off. A short, yet amazing journey, which involves you, playing as Gordon Freeman, well, er, yeah. I would rather not spoil anything.  It is definitely not going to take you any longer than 5 hours to complete, so I would say it is more than worth dedicating an afternoon to it. The gunplay still feels simply great, exactly like the original game, though I think it is also good to mention that this time, guns are not even required - you can finish the entire game firing only a single bullet. It will not make things any easier, rather obviously the other way around, but if you think you can do it, you can choose to do it.  A must-play for everyone who has played Half-Life 2 before.",
            "review_score": "1"
        },
        {
            "review_text": "ever since playing through Ravenholm in HL2, i thought, 'I'd really like a game where i have to use the gravity gun the ENTIRE TIME'. and behold, HL2E1 was brought down from the heavens upon me, and a task was bestowed: to fire one single boat through the whole game",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it.    (Sponsored by Nike)",
            "review_score": "1"
        },
        {
            "review_text": "Way ahead of it's time. way way ahead. Classic. What more can I say?",
            "review_score": "1"
        },
        {
            "review_text": " The Aftermath of Half-Life 2 / Expansion",
            "review_score": "1"
        },
        {
            "review_text": "half _life=life",
            "review_score": "1"
        },
        {
            "review_text": " It's a short game. Took me less than 3 hours to complete. Still a great game though and continues the story well. ",
            "review_score": "1"
        },
        {
            "review_text": "It may be short but it continues from where HL2 left off.",
            "review_score": "1"
        },
        {
            "review_text": "8 dollars for 3 hours of content. It was worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2 Episode One is the continuation of the Half-Life saga or rather the story of how Gordon Freeman saved the world. While I was a big fan of the single-player campaign in the original Half-Life these new stories that have been unveiling beginning with with Half-Life 2 just haven't been quite as impressive and Episode One feels much the same way.  The story picks up shortly after the end of Half-Life 2 proper. Through the power of being the protagonist you have somehow manged to survive and must now fight your way out of the city before it implodes on you. There is not much new to the storyline or gameplay and the areas feel like they could have been ripped straight out of the regular Half-Life 2 campaign.  Of course there is a certain bias from me because I never bought Half-Life 2 to play Half-Life 2, that was just a nice little bonus, I bought it for the mods and as such I am not nearly as invested as others in the lives of Alyx and her boytoy Gordon.  Get it if you liked the single-player campaign in Half-Life 2 and want a few more hours of it. Otherwise you can safely ignore it as it's an entirely forgettable expansion.",
            "review_score": "1"
        },
        {
            "review_text": "Well its the first of - so far - two sequels to Half-Life 2. Its what you expect, if you loved Half-Life 1-2, youll love this one; Really short but a bit new gameplay mechanics and ideas, nice action and a continuation of the great story cliffhanger! 8,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode One is the continuation of the amazing game Half-Life 2. Starting as soon as you left from Half-Life 2, the game does the same magic. A constant action, yet, shorter version of Half-Life 2 starts off with a new objective in a new area in order to move from place to place in the Half-Life universe. No doubt, still just as great as Half-Life 2 as far as graphics, gameplay, physics, and storyline take you.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode 1 just continues the story from Half-Life 2. It is still an amazing game since it is exactly like Half-Life 2, but is further developing the story of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was fun to climb through the ruins of city 17 trying to evacuate it before time runs out. 7/10. Could have been more fun with the levels though.",
            "review_score": "1"
        },
        {
            "review_text": "this game always impresses ... good game and good story .. must play !",
            "review_score": "1"
        },
        {
            "review_text": "Great followup to Half-Life 2, and has some pretty awesome combat scenes. Alyx is seen getting a personality upgrade, for sure. Would recommend buying the entire Orange Box though, as this is pretty short.",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2: Episode One is a little dissapointing, especially when looking at the magnificence of Half Life 2. It continues where the original Half Life 2 left off. It offers 4-6 hours of gameplay in City 17. This means it has only urban combat and no vehicles. It's not bad and it has some nice ideas to keep the story on.",
            "review_score": "1"
        },
        {
            "review_text": "Starting where half life 2 ended. A very enjoyable game, although half as short as its predecessor. The same engine is used likewise and the same arsenal of weapons, physics and control mechanics. Has a very distinctive reversed chronology kind of style, where as you progress the game you actually go back to the beginning, where half life 2 began. A major reason why i prefer this one over episode two, is because you get to use my favourite weapon in the first chapters, the super gravity gun. One more time to ragdoll physic some more useless combines. That's why i prefer the first one over the second. Overall a great addition in the half life 2 franchise, which is worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "I always thought 'Half-Life 2: Episode 1' was a strange name for the continuation of the plot of Half Life 2 and a little undeserving in my opinion. After the hanging thread in Half Life 2, you progress the plot as Gordon Freeman once more to escape City 17 with Alyx Vance before it's reactor goes critical. The game itself can be beat in a little under 2 hours, but it's a DLC so I'll let it slide. Oh yeah: Cliffhanger ending- Check.  Pretty short review; not much to say here.  I rate Half-Life 2: Episode 1 with a 7/10  Wait for it to go on sale before you buy it; I don't think it's worth $8, but the choice is yours.  Until next review!  Let's form up! ~Stealth 1548",
            "review_score": "1"
        },
        {
            "review_text": "This puts together the story of Half-Life 2 but its very short: approximately 1,5 hours.",
            "review_score": "1"
        },
        {
            "review_text": "If not played half-life you you lose half your life",
            "review_score": "1"
        },
        {
            "review_text": "Boring little add-on that makes up for it in the end. 3/5 lambdas.",
            "review_score": "1"
        },
        {
            "review_text": "An epic continue on the Amazing Half-Life story. Adding a hell load of new things and will keep you begging for more.",
            "review_score": "1"
        },
        {
            "review_text": "Great. Just Like Half Life 2.",
            "review_score": "1"
        },
        {
            "review_text": "Not much to say about this one. Half-Life 2: Episode One is of course a continuation of the story in Half-Life 2. Fundamentally it plays the same as Half-Life 2, though the graphics are slightly better and this time you have Alyx as a partner for most of the game. As an episodic game it's also shorter than Half-Life 2, but if you liked that game, you'll probably like this.",
            "review_score": "1"
        },
        {
            "review_text": "Gabe please make hl3",
            "review_score": "1"
        },
        {
            "review_text": "The sequal to what I consider to be the greatest game of all time, and it is still pretty good. I liked to think of Episode One as the middle child of the Half Life 2 trilogy. It doesnt really do anything that unique, but is still a very interesting and able game. Most of the enviroments are tight, so its a lot less open world compared to Half Life 2. The absolute best part of this game is the realtionship between Gordan and Alyx. Watching her interact with you is simply amazing. Valve actually made me genuinly care about a character, something very few have. This game only lasted about six or seven hours, but is still a worthwhile experience.   Pros: +Everything Half Life +Lighting +Character connectedness  Neutral:  *Narrow enviroments *The 'Middle Child' syndrome  Overall: 9/10 If anything, you basically need to play this just to get the amazing Episode Two. Its still good in its own respect, but forgetable overall comparted to the other parts. Do not buy this on its own, get it bundled in the Orange Box.",
            "review_score": "1"
        },
        {
            "review_text": "Nice intro and just amazing.",
            "review_score": "1"
        },
        {
            "review_text": "As Crab said in his recommendation: 'Nothing happens in this game... I mean really you can skip it.' Of course there is a grain of truth in that statement, when held in the light of Episode 2 or even Half-Life 2, Episode One leaves much to be admired. This can be attributed to the games eco-centric location throughout the ruins of City 17 and the Citadel and the lack of varying companions throughout the game. While doing an excellent job making Alyx seem like a more believable character with well scripted combat sequences and animations you can't help but feel that she's holding your hand through it all. Personally I loved EP1 because the raw urban combat of the final levels of Half-Life 2 were my favorite levels, and Episode One extended on that making for an entire game focused on the best part of HL2. All that being said it's not imperative that you play it, and you can go from HL2 straight to EP2 without worry about missing on vital story points.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Waifu Edition",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - It's more Half Life, what more could you want? (Besides Half Life 3)",
            "review_score": "1"
        },
        {
            "review_text": "A little short but none the less great addition to HL2",
            "review_score": "1"
        },
        {
            "review_text": "Episode One of a legendary game.",
            "review_score": "1"
        },
        {
            "review_text": "As much as I like ALL the Half Life games (and especially HL2 + both episodes), this is THE best game in the series, albeit the shortest. This is the definition of action, immersion and atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "If I managed to complete this in one sitting, you can do anything.",
            "review_score": "1"
        },
        {
            "review_text": "I know that a lot of people were disappointed by this installment, but I had a hoot playing it. It's been a secret fantasy of mine to be part of a mass exodus out of a doomed city my whole life. I think my secret desire to make such an escape started with a Fourth of July celebration my parents took me to when I was three. These visions of hundreds of people and shimmering explosions in an unfamiliar urban setting stuck in my tiny baby brain and have been with me my whole life.   So you can imagine my surprise when over a decade later I'm reliving these memories as I flee City 17 in much the same way I imagined myself all those years ago.  This has left me to assume Valve has access to the Jungian archetypes of my mind.",
            "review_score": "1"
        },
        {
            "review_text": "This game was really week compared to HL2, It's good but has some problems. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet.",
            "review_score": "1"
        },
        {
            "review_text": "Valve is at it again. Good game, though all too SHORT.  ",
            "review_score": "1"
        },
        {
            "review_text": "big hands pulls you from the wreck",
            "review_score": "1"
        },
        {
            "review_text": "I found Half-Life 2: Episode 1 to be a worthy sequel to Half-Life 2. Although the episodic approach to game release obviously shortens the play time, I still find it quite re-playable. Admittedly, it isn't quite as impressive as Half-Life, Half-Life 2, or Episode 2, but it is definitely worth playing whether or not you are a Half-Life fan, and I feel like it is sometimes underrated, as you spend the majority of the story accompanied by Alyx, and builds off of it as the story progresses. I really enjoyed playing it.",
            "review_score": "1"
        },
        {
            "review_text": "gordon's back at it and regrets everything.",
            "review_score": "1"
        },
        {
            "review_text": "Good entertainment when you dont have nothing to do and has that good Retro look.",
            "review_score": "1"
        },
        {
            "review_text": "  Half-Life 2: Episode One  is a first-person shooter video game, the first in a series of episodes that serve as the sequel for the 2004 Half-Life 2.  The game stars immediately after Half-Life 2. Gordon Freeman wakes up near the Citadel after Alyx Vance and Dog find him. Gordon and Alyx travel through the City 17 to find train to escape city...    VERDICT     Pros:",
            "review_score": "1"
        },
        {
            "review_text": "This is an AMAZING game, It's short, but really fun. And I HIGHLY suggest downlooading it",
            "review_score": "1"
        },
        {
            "review_text": "Finishing this game only left me wanting more.  Awesome game loved it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't like Episode model of game development, but it's totally worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody good game, thumbs up from the best mc",
            "review_score": "1"
        },
        {
            "review_text": "The trailer made me think i was gonna play as Alyx xc",
            "review_score": "1"
        },
        {
            "review_text": "CROWBAR TO THE FACE",
            "review_score": "1"
        },
        {
            "review_text": "Good enough",
            "review_score": "1"
        },
        {
            "review_text": "I devoutly recommended my spirit to this maker.",
            "review_score": "1"
        },
        {
            "review_text": "Stuff get's trippy during beginning part of the game, but pretty cool. Introduces new enemies like Stalkers and Zombines, also adds flares, so the whole undergroud area can smell like dead rotting zombies, delicious.",
            "review_score": "1"
        },
        {
            "review_text": "Its good, but its the worst on the franchise only buy this if its incuded on a pack or its in a discount",
            "review_score": "1"
        },
        {
            "review_text": "this game is                          3 HOURS",
            "review_score": "1"
        },
        {
            "review_text": "More of one of the greatest PC games.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Half-Life 2 (so if you've played HL2), you will like this game. It's more Half-Life 2. If you haven't played HL2, then play HL2 first. And then buy HL2:E1. And when you've finished that, buy HL2:E2.  Have fun waiting for Half-Life 3!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, good plot.",
            "review_score": "1"
        },
        {
            "review_text": "half life two episode 1 the prequel to half life 2 and sequel to half life 1 and cousin twice removed of half life 2 episode 2 and distand friend to the half life podcast and in a long distance relationship with half life condition zero  u dont play this game gordon is dead and alyx is dead so u must play as a vortigaunt (boring) (they are stupid) (and have three arms)",
            "review_score": "1"
        },
        {
            "review_text": "Episode One of legendary game with legendary hero, Gordon Freeman. If you have played HL2 you must play this eather. I don't even ask do you have like HL2. Because for sure you have like it.",
            "review_score": "1"
        },
        {
            "review_text": "For some reason, this one is my favorite... ",
            "review_score": "1"
        },
        {
            "review_text": "A nice continuation of the story of half life 2 although at the beginning it is boring, when you finish it the gameplay is awesome. 0/10 no 3 at the end",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever. 10/10 'can now play it through Missing Information 1.6'",
            "review_score": "1"
        },
        {
            "review_text": "if you liked haif life 2 you will like half life 2 e1 but in my opinion halflife 2 is better 8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "awensome game. please more gabe",
            "review_score": "1"
        },
        {
            "review_text": "It's short, but you can ever replay it as you wanna do. Using guns, with the Gravity Gun, throwing stuff... Just like the original one.  Best expansion.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "You should not be here. Instead check the Half-Life 2 review. After all if you've actually played that one than I'm sure your mind is more than set.",
            "review_score": "1"
        },
        {
            "review_text": "Great expansion to the original golden sequel with GREATLY improved a.i and ally contribuation. Yes it's short but it should be looked at as a extension of the game and not a seperate entity. Plenty of new things to do with much of the old still included. Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Best Story",
            "review_score": "1"
        },
        {
            "review_text": "Actual Game: Meh | Price: It's Ok | Value: Pretty Damn Good  While Episode One wasn't the best of the Half Life Series, it's still a great deal. While most people weren't fond of the story and game play of this episode, I thought it was good. Plus you get two more games in this bundle: HL2DM and HLDMS which are both pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "This is Half Life 2, need I say more? :)",
            "review_score": "1"
        },
        {
            "review_text": "continuing from half life 2 this game was just what we needed from that two year wait.",
            "review_score": "1"
        },
        {
            "review_text": "Was great when it was new. I don't know if it holds up today.",
            "review_score": "1"
        },
        {
            "review_text": "Now with more Alyx Vance",
            "review_score": "1"
        },
        {
            "review_text": "hi my name's ryoni and i'm a community leader (check the badge) and i can honestly say that if you want to be more like me you should definitely play this game.   it will help you succeed in life and maybe one day you too can be a leader  edited: language",
            "review_score": "1"
        },
        {
            "review_text": "The story of this game is awesome and graphics brilliant. I rate ★★★★★",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best fps game i have played in my existance,If you are having second thoughts of this game just note you are about to miss out on quite a bit of story and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Thank You Valve",
            "review_score": "1"
        },
        {
            "review_text": "Good follow on game, albeit a little short.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely amazing video game. The ending left me completely shocked, it is every bit as brilliant as all other Half-Lives, my single complaint would be it is quite short (took me 4 hours to complete), but hey, it isn't technically a 'full game' as part 2 makes up the rest. Still very very very highly reccomended.",
            "review_score": "1"
        },
        {
            "review_text": " A long-waited and fantastic sequel to Half-Life 2 continuing the story!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Please bare in mind I literally played this for the first time today (Nov 2016).  I remember everyone saying that this was the game that sculpted modern day games. Particularly FPS games. Now I understand why so many of those tedious stand and waste time moments exist in games. Half Life 2.  So many times in this very short episode do you stand there watching a wheel go round slowly while you open a shutter. For no other reason than to waste our time.  I enjoy the physics puzzles still. They should be used more in gaming.  The AI drove me insane though! Several times I got trapped in a doorway with Alex stood behind me not moving. Where I had to load or kill myself to get free.  I have no real care for anything in this world. To be honest I have almost no idea what the f*** I just did for the last couple of hours. Why does this episode even exist?  You wake up. Lurch from area to area doing 'stuff' and then the credits roll. That's pretty much it. The slimsy bit of story that exists kind of gets forgotten until the last scene.  Maybe back in the day this was excellent but honestly this gameplay no longer stands up. The last few years we've seen the resurfacing of open world games. That is for the best.   Linear ♥♥♥, time wasting shooters are no longer entertaining for me.  Plus since the whole 'Chapter 3' has yet to emerge in any form I guess the second chapter is going to be just as pointless story wise.  Yes I apreciate this is an old game but honestly I'm feeling like you had to be there nearer to its release to understand the appeal. Glad I waited for a sale to play this now.",
            "review_score": "-1"
        },
        {
            "review_text": "'It's so ♥♥♥♥ing ♥♥♥♥s its ♥♥♥♥ing sucks' - M.Twain,1897",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really good game and all, but just not as good as ride to hell: retribution.",
            "review_score": "-1"
        },
        {
            "review_text": "its a pretty good game but it does have its downsides. for example, there isnt alot of battles and most of the time you just walk around. another reason is that it isnt realy expanding the story(isnt realy changing alot of the storyline), and the last thing is that its actually realy short for other half life 2 games., basiclly its a good game but it could have been better",
            "review_score": "-1"
        },
        {
            "review_text": "I'd really love to recommend this game because I really do like it a lot, but I just can't. I encountered 2 game breaking bugs in it and I don't expect such a thing in any game (especially a 3-4 hour game from Valve). I also had quite a few performance issues (freezing, long loading times, muggy textures) with it that may or may not be related to a setting I have or my machine.",
            "review_score": "-1"
        },
        {
            "review_text": "Unless you have purchased HL Complete, Orange Box, or the Valve Complete pack, this is a waste of money. At the beginning of Episode 2, there is a cinematic that pretty much summarizes Episode 1. Save a couple bucks and buy Episode 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. Surprising how new this still feels considering how old it is. I can't recommend it though until Valve finishes the story.",
            "review_score": "-1"
        },
        {
            "review_text": "'In a world where no one seems to give a ♥♥♥♥, neither do I' -My Gordan Freeman  Crowbars still awesome though :D 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "To short less gameplay Half-Life to is better cause longer gameplay. ",
            "review_score": "-1"
        },
        {
            "review_text": "Continues immediately after half life 2, good continuation of the story.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░▐▀█▀▌░░░░▀█▄░░░ ░░░░░▐█▄█▌░░░░░░▀█▄░░ ░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░ ░░░░▄▄▄██▀▀▀▀░░░░░░░ ░░░█▀▄▄▄█░▀▀░░ ░░░▌░▄▄▄▐▌▀▀▀░░ THIS IS BOB ▄░▐░░░▄▄░█░▀▀ ░░ ▀█▌░░░▄░▀█▀░▀ ░░ COPY AND PASTE HIM ░░░░░░░▄▄▐▌▄▄░░░ SO HE CAN TAKE ░░░░░░░▀███▀█░▄░░ OVER STEAM ░░░░░░▐▌▀▄▀▄▀▐▄░░ AND THAT WILL TELL VALVE ░░░░░░▐▀░░░░░░▐▌░░ TO GIVE US HALF LIFE 3 ░░░░░░█░░░░░░░░█",
            "review_score": "1"
        },
        {
            "review_text": "Great expansion",
            "review_score": "1"
        },
        {
            "review_text": "so far, there are THREE parts to half life 2. That tells us nothing. BUT, there is some evidence for those like me. Half Life 2 episode 2 had an ending that was awful. Well, not awful, but it seems like a cliff hanger. That means there should be a Half Life 3 or Half life 2 episode 3. So as everybody says, HALF-LIFE 3 CONFIRMED!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A continuation of an engrosing story, and more of the brilliant gameplay from before.",
            "review_score": "1"
        },
        {
            "review_text": "You need to by this expansion",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the low point of the series, Episode 1 didn't quite deliver on those amazing scripted action sequences that HL2 did. While not a bad entry, it's nothing to get too excited over. Still, the level design and ambience will really immerse you into it. Short, but good enough.",
            "review_score": "1"
        },
        {
            "review_text": "The worst of the Three Games. Doesnt really add anything at all to the story, quite boring to play and very short. Does slightly bridge HL2 to Episode 2 but it couldve been done in a different fashion.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, extension of the story and abilities from the first game into some new directions. Vehicles and driving sections still feel clumsy, but hey, they can't all be Warthogs.",
            "review_score": "1"
        },
        {
            "review_text": "A continuation of Half-Life 2",
            "review_score": "1"
        },
        {
            "review_text": "This sequel to the popular and somewhat required game 'Half-Life 2' although shorter than the previous game, is worthy of becoming part of that franchise as it continues the story of the revolution against the combine in a flawless transition between the base game and episode 1. This game is also required to unlock more possibilities for modding on games such as Garry's Mod. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beat it in 1 day buy it was very much worth it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great addition to the HL2 game, only complaint is I don't get the jesus grav-gun enough, and to be fair that would be stupidly op.",
            "review_score": "1"
        },
        {
            "review_text": "Obviously one of the best FPS games of all time.",
            "review_score": "1"
        },
        {
            "review_text": " This is the first continuation of Half Life 2, released in 2006 tells the story that happen after the final of half life 2, the game does not make great graphics improvements but increases of just the physicality of some items, the weapons are the same and again sadly in Italian dubbing sucks",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, amazing, can't put it down!",
            "review_score": "1"
        },
        {
            "review_text": "This review contains spoilers regarding Half-Life 2.  Riding on the high octane ending of Half-Life 2 and acting as a direct continuation, Half-Life 2: Episode One manages to be a safe, if not fulfilling, addition to the Half-Life series.  Sticking with the known working formula, in Half-Life 2: Episode One you resume control of Gordon Freeman. Throwing the ending of that game to one side, Gordon finds himself back in City 17 with Alyx and a Citadel on the verge of leveling the entire city. Throughout this episode you venture back into the Citadel to contain the core and then proceed to try and escape City 17 before its destruction.  The issue with this game is it brings very little new to the table. The environments are all rehashes of what was seen in HL2 - the Citadel, the streets and buildings of City 17. The only original feeling portion of the game is where you have to fight through a hospital, constantly being assaulted by Combine and Zombies, with an assault ship opening fire through any window you pass by. Amongst the zombie horde is a new creature: the Zombine. This headcrabbed Combine soldier is stronger and faster than the other zombies, possessing the ability to pull grenades out in a kamikaze run. It spices up the variety little, but only a little, for the most aprt they still act like everything else you've encountered so far. The sections with the Citadel are interesting; now a degenerating and highly unstable building that the Combine are fleeing, but ultimately it's not too indifferent from the final stages of HL2.  The final, and largest, criticism is the length. This game can be completed in roughly five hours. For a game that offers little advancement in plot, instead focusing mainly on combat, there's not a lot here to make it an essential play. Don't get me wrong, it's worth playing if not just to have an excuse to dip back into the HL2 world, but this game struggles to have any sort of re-playability value when HL2 does everything this game does - only better.",
            "review_score": "1"
        },
        {
            "review_text": "A little short, but it does a good job of expanding on the character of Alyx Vance, and the gravity gun is more important this time around.",
            "review_score": "1"
        },
        {
            "review_text": "Game of my life!",
            "review_score": "1"
        },
        {
            "review_text": "Introduces new gameplay elements and is more story-driven than HL2. Seems as if they were experimenting a lot with this game and it is really short, but still a great continuation - 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Same gameplay, Still fun as hell.  Nine Gabens out of ten.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but like more company by other characters",
            "review_score": "1"
        },
        {
            "review_text": "There is no point for me to describe it. You should already own it anyway. If you don't, go play some more consoles, you filthy, dirty peasant !",
            "review_score": "1"
        },
        {
            "review_text": "Valve puts Half-Life 2 through another set of interesting settings. It picks up right after HL2 ends and does so with a nice sense of seemlessness.  As part of the HL2 set, I recommend it, but definitely after having acquired/played HL2.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game. 100% recommend",
            "review_score": "1"
        },
        {
            "review_text": "Exactly the same as the base game. Only that you make love with Alyx and this game acts more like a script so bloated with many romantic moments which will eventually arouse her to have sex with you in Episode Three. Eventually. Why no one guessed it.  10/10 Would sex again",
            "review_score": "1"
        },
        {
            "review_text": "This is a good and game the problem is, that this game is a 2 hour game and the price should be $3.99. other then that this game is great and you should get it!",
            "review_score": "1"
        },
        {
            "review_text": "Continue The Half Life Adventure!",
            "review_score": "1"
        },
        {
            "review_text": "Two hours of gameplay. Short, but exciting gameplay and storyline.  I liked every single moment of this Episode.   True Half-Life atmosphere and that unique details...  Recommended (size does not matters).",
            "review_score": "1"
        },
        {
            "review_text": "Episode one is a whirlwind of action, from beginning to end. You wake up from an explosion and a bigger explosion is the last thing you see before the credits roll. The gravity gun figures prominantly, which is great. Lots of interior shots of the Citadel, then a crazy City 17 escape. A must have for anyone with Half-Life 2.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game.I recommend you buy and play it.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. It's pretty short but the beginning is worth it. As always when it comes to Halflife, expect a cliffhanger and some sadness..  Either way,  9.5/10 no halflife 3 :(",
            "review_score": "1"
        },
        {
            "review_text": "Wheres HL3?",
            "review_score": "1"
        },
        {
            "review_text": "Really continues the story perfectly, especially Alyx showing off her emotions towards Gordon. A little short, but it's fun to play. If you want to buy it, you are definetely making a right decision.  10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game is kinda short though but it's gonna be worth it i tell you ...",
            "review_score": "1"
        },
        {
            "review_text": "Great continuation of the Half-Life 2 storyline.  Get it with Episode 2 because that in a nutshell is as close to Half Life 3 as we're gonna get.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode One takes place right after Half-Life 2, and was a begining of an experiment of getting out the Half Life 2 continuations faster... which ended up falling on it's ♥♥♥ when Valve realised that after Portal and TF2, no one cared about Half Life anymore, the final nail on the coffin being when valve discovered they could make more money off of selling virtual items for F2P games and promoting e-sports crap than Half Life could ever hope of doing.  Anyways, Episode One is a huge graphical leap from Half Life 2, adding in pretty HDR effects (even though you're going to see a lot of warm colors in this game) and exploring more of the physics based gameplay. One complaint is that it feels pretty short and does feel like you're essentially doing more of the same you did in the last parts of Half Life 2, only in reverse. You also get commentary, which always a great thing to listen to.  Overall, get this game if you played/own Half Life 2 and haven't played Episode one yet",
            "review_score": "1"
        },
        {
            "review_text": "Why do people not realize that Valve made Half-Life 3? They only made 2/3 of it, though. This is the 1/3 of it.",
            "review_score": "1"
        },
        {
            "review_text": "Sequel of Half-Life 2. Prequel of Half-Life 2: Episode 2",
            "review_score": "1"
        },
        {
            "review_text": "Another episode! I guess I have to play this too",
            "review_score": "1"
        },
        {
            "review_text": "Now that’s what I like to see a proper story expansion where you play was the same character from the first 2 games. Even though it uses the same game engine as Half-Life 2, I would have to say that’s what I find appealing about this add-on. No over the top graphics no stupid fancy weapons a gripping story line and unique game in general, Vale have their customers at the forefront of their priorities list making sure they have the best gaming experience possible. Vale keep up the good work I rate this game 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. That's just it. :D",
            "review_score": "1"
        },
        {
            "review_text": "I though that Ravenholm was scary... You know what ? It wasn't ! In here you will encounter a chapter called Lowlife... This is a chapter in which you are underground whit tons of Zombies ! And its dark. Got a flare ? That will not really help. It can burn'em , but it will last not very long... But i have a flashlight. Of course you do but it has batteries... And they can run out. Oh whats that ? It's something like... a... Zombine. Right ? Haha... Oh god ! It has a grenade ! RUN ! - gets to elevator - No power ? Well turn it on ! Now lets see how long will you survive &gt;:D Oh... You did it ? Well congrats ! Now lets go to chapter Urban Flight. At the end there a Hospital. Oh yes... A hospital &gt;:D And here comes the zombies !!! Again... You did it... Now enjoy the rest of the game whitout zombies... Do i recommend this ? YES ! I DO !",
            "review_score": "1"
        },
        {
            "review_text": "Best Summary and a Awesome Game :D!!!",
            "review_score": "1"
        },
        {
            "review_text": "A great expansion of the story after Half Life 2. Even though this isnt another main game it is still full of key important points and lots of fun gameplay. Plenty of fun, good story, and all in that classical crowbar-style! If you enjoy the Half Life series you are going to have to play this game before they eventually if ever realse the third game.",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunatelly short, it's just a preparation for Episode two.",
            "review_score": "1"
        },
        {
            "review_text": "A solid standalone expansion to HL2. Back then you may have thought it as 'more of the same' but really, I feel that this Episode had enough content to justify it's release. Wish that Valve had continued making more of these.",
            "review_score": "1"
        },
        {
            "review_text": "Episode One continues the adventures of Gordan Freeman (or in my case misadventures) and without any delay starts right off at the citadel at the point of destruction and continues from there. If you are thinking this episode will be as long has Half life 2 then you would be wrong episode 1 is short with about 2-4 hours of gameplay and hardly any replayability unless you want to speed run or get the achievments. However with poor pacing the story just seems like a big advertisement for episode 2 and has the sense of it being  unfinnished and rushed.  The gameplay is exactly the same with half life 2 only featuring the combine zombie (the zombine) which is interesting to say the least, as this zombie is faster than a normal zombie but has an attack of using a grenade to blow you up or you could use the gravity gun to take it out of their hands. The use of the gravity gun in the early chapters is kind of fun where you block the endless swarms of antilions with a car you propelled. Sadly it gets a bit stale and repetetive.  If you hated the strider parts in chapter 11, in episode one there is only one fast paced action packed battle at the end which then turns into an annoying rpg section where you shoot and cover and pray that your rocket hits the strider and not you. That part was so annoying that I ended up cheating to get past it.  Overall Episode one feels rushed and uncomplete however if you did like half life 2 then this would not seem so bad. I would buy this game just so you know what happens in between half life 2 and episode 2. I wished there was more content at the end of the day but I know that all the content missing is going to be in episode 2. 6/10 get it on the next sale.",
            "review_score": "1"
        },
        {
            "review_text": "I like it, altrough it is a lot shorter than original HL2. I finished it in 5 and half hours of gameplay. Still worth it tho.",
            "review_score": "1"
        },
        {
            "review_text": "The adventure continue! the badass in glasses keeps owning everyone with his unreasonable arsenal and nonexsistant combat training. at least we don't have to use the boat again.",
            "review_score": "1"
        },
        {
            "review_text": "I still think that Half-Life 2 is a better game, but this still kept me entertained.  7.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Just one level is hard enough, you only have a gravity gun and going against waves of combine in one level",
            "review_score": "-1"
        },
        {
            "review_text": "Half-Life 2: Episode One is arguably the worst game in the franchise, right next to Blue Shift. But even though it's not the best in the series, it doesn't mean it's not worth playing.   Pros:  + As always, the gameplay is solid and varied (for the most part) + Excellent voice acting, with all the voice actors from Half-Life 2 returning for their roles here + A new enemy type (yay?) + Updated graphics + Fantastic soundtrack by Kelly Bailey  Neutral:  +- Really short, but it's an episodic game (and it's cheap), so what can you expect  Cons:  - Pacing is kinda off compared to the enjoyable flow of the other games - The order in which you get your guns makes no sense, I mean, the crowbar is one of the last weapons you get, why? - Certain sections are really annoying and tedious Spoilers:    - The last boss is a ♥♥♥♥ing strider (a common powerful enemy) mixed with a boring escort mission      Conclusion: Worth playing, but not a fantastic game by any means.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Continued story from Half Life 2. If you liked Half Life 2, buy this.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 3 have to be !!",
            "review_score": "1"
        },
        {
            "review_text": "It's not as good as HL2, I mean it's basically just a couple of extra levels tacked on to the end of the game... BUT... that being said, this, even at around 2-3 hours of length, is still better than the majority of FPS I've played over the last 6 years or so. A fun continuation of HL2. If you like HL2, there's no reason not to buy this one as well.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't bought half life 2. Then don't bother buying this. Although if you have bought half life 2. Go ahead and throw this a buy, it's more of the same but it's still good stuff :).",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode One  Story (8/10):  The story of Half-Life 2: Episode One plays on from the original Half-Life 2. Therefore, in order to fully understand the logic of the story, the original Half-Life 2 should be played. Half-Life 2: Episode One's story spans over five chapters, immersing the player with original characters and enemies. As explained in the Developer's Commentary, there are admittedly some sequences where dialogue is too long and ruins some crucial parts of the story. Although, the story does run well with the five chapters and the ending will possibly leave you wanting the next Episode in the series. Overall, Half-Life 2: Episode One has a good storyline and a few boring non-interactive dialogue moments here and there.  Game play (8/10):  The game play of Half-Life 2: Episode One is fluent and rewarding. Whilst progressing through the storyline, there are pieces of equipment acquired after reaching specific points. These rewards are motivating and is enough to push the player towards the conclusion of the game. Within this game the player will encounter many weapons from the original games, like the iconic crowbar. The combat system in conjunction with weapons is a fluent mix and certain game play mechanics like the flashlight capacity, intensifies certain levels. Also included within the levels is a variety of environmental objects that are interactive and combat effective. These environmental objects are used to create smart solutions to simple problems. In this case, Half-Life 2: Episode One's game play is constructive and destructive, making an enjoyable experience.  Graphics (10/10):  The graphics of Half-Life 2: Episode One is outstanding for it's time. This game has perfect settings for graphic options, from Shader Detail to High Dynamic Range. The lighting and detail of the sprites within the game looks realistic and it immerses the player into the environment. Guns, environmental objects, enemies and everything included looks like real design was incorporated when producing. Explained within the Developer's Commentary, many environment objects were based off real creations and it is reconstructed effectively. In other words, the game developers made the environment look realistic and it is a true accomplishment for the time period for when it was development.  Audio (7/10):  The audio of Half-Life 2: Episode One is realistic but the soundtrack doesn't immerse the player. Whilst playing through the story, combat and exploring situations included music that wasn't exciting enough. Although, the environmental, character, enemy and gun tracks included did give a sense of presence. The sounds when an enemy has acquired a target, a mine has exploded or if a zombie is nearby was executed well. If the player listens closely they can recognise footsteps and the direction of any sound. In conclusion, the games soundtrack is mildly boring but the environmental sounds are good.   Additional Features (8/10):  In Half-Life 2: Episode One there is an additional feature that many previous players of Valve games could recognise, the Developer's Commentary. This feature of the game becomes unlocked once the completion of a desired chapter is registered. The Developer's Commentary provides an inside look on the previous and/or designs, ideas and game play mechanics considered throughout the development of the game. This is encoded using floating speech bubble sprites spread across the five chapters in their appropriate positions. Also, once a commentary is being played, the player becomes invincible to enemy damage and can sometimes freeze the enemies themselves to state an idea. This additional feature is a productive way of expressing the developer's ideas and explaining the nature of the game. After completing the game, it is recommended to try the Developer's Commentary for an in-depth explanation on the games features and aesthetics.   Overall (8.2/10)",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode One continues the story of Gordon Freeman. Great episodic content but not a whole lot that's new except for locations and 2 new enemies added to the roster. Still, if you're a die hard HL2 fan like me you'll enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Alyx Vance is my waifu",
            "review_score": "1"
        },
        {
            "review_text": "Nerd with thick glasses goes on a rampage at the city while attempting to flee from the police after he loses his job. The police blow up the city in an attempt to attract backup.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode One just keeps kicking the adrenaline into your (rotten) gamer-body. Playing Gordon Freeman is just awesome... mute heroes are scary opponents, don't you think?",
            "review_score": "1"
        },
        {
            "review_text": "its good for people who like hl2 and vavel plz do hl3 i whant it soo!!!! bad",
            "review_score": "1"
        },
        {
            "review_text": "too much zombies,it is left4dead?",
            "review_score": "1"
        },
        {
            "review_text": "So I went back and replayed the half life series today, and I was inthralled in how immersive and massive the game felt. It was made in 2004, but it's beautiful by today's standards. The characters all feel so real and genuine. For anyone who hasn't played it, I strongly recommend you do.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite as good as Episode Two, Episode One is still an essential game in the Half Life 2 series, and well worth owning if you're a Gordon Freeman fan.",
            "review_score": "1"
        },
        {
            "review_text": "Though perhaps not the greatest of the Half-Life series (I would rather the very first HL above this episode in terms of playability and narrative), this quick and fast installment is nonetheless one of the better games that Valve has released. Be sure to play HL2 first, or there'll be a great deal of confusion, but otherwise, a decent episode to say the least.",
            "review_score": "1"
        },
        {
            "review_text": "The part between Half-Life 2, and Half-Life 2 Ep:2",
            "review_score": "1"
        },
        {
            "review_text": "so awsome ",
            "review_score": "1"
        },
        {
            "review_text": "why is this not half life 3 oh... thats why... its a good game but short 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Continues the story of Half Life 2, still delivering a quality experience. The majority of this takes place in one type of environment, so it can be a little exhausting. Still, a good title and leads nicely into Episode Two.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful game, great story, challenging gameplay and engaging puzzles. A great pick up if you have not played it yet. I play through this franchise once every year or two",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Good Story and gameplay. Love Valve and this genre, but still waiting the sequence!!! mazing game! Good Story and gameplay. Love Valve and this genre, but still waiting the sequence!!! ",
            "review_score": "1"
        },
        {
            "review_text": "The game is too short, but yet it's still good. Not as good as episode 2, though.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best out of the two Episodes, but necessary to continue to Episode Two which is a must play. It's a great experience nonetheless. Get it!",
            "review_score": "1"
        },
        {
            "review_text": "I felt this was too short. Even for an episodic model this was over quickly.   If you can catch this on sale for a few bucks grab it, otherwise skip it and read up the wiki.  B",
            "review_score": "1"
        },
        {
            "review_text": "again play as gordon freeman and stop the citidel core from overloading. then, try to escape city 17 as you fight the combine. a truely epic game and one of my all time favourites.",
            "review_score": "1"
        },
        {
            "review_text": "A good HL2 Episodes, had a lot of fun playing it :)",
            "review_score": "1"
        },
        {
            "review_text": "A short addition to the main story. More adventures !",
            "review_score": "1"
        },
        {
            "review_text": "If you don't know what HL2 is about, you've been living under a rock.  If you don't own it, buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "This is the next part, of the award-winning Half-Life 2. The gamemplay is very similar, and this is basically, like a new part. However the story is not the same. This takes place much more indoors, and some in the post-apocalyptic warzone of City 17 (The city where HL2 takes place).",
            "review_score": "1"
        },
        {
            "review_text": "Honestly i feel like valve went all out on the HL series valve deserves a cookie",
            "review_score": "1"
        },
        {
            "review_text": "I wish it was longer!",
            "review_score": "1"
        },
        {
            "review_text": "A strong continuation of the Half Life 2 story line, it rightful successes it in every way other then play time. Hence the word 'Episode' it is rather short, but still hold the classic survival horror feel of Half Life. If you didn't buy the orange box and have Half Life 2 and not this, I highly recommend you get it.",
            "review_score": "1"
        },
        {
            "review_text": "A short but great game that follows up nicely on the story Valve wove in Half-Life 2.",
            "review_score": "1"
        },
        {
            "review_text": "Good 'semi-sequel' to one of my favorite games. Almost at the same level, but it is so ♥♥♥♥ing short =( If i buy a game for singleplayer only i want it to last longer than around 5 hours. This ain't COD =)",
            "review_score": "1"
        },
        {
            "review_text": "Recommend playing this before Episode 2.",
            "review_score": "1"
        },
        {
            "review_text": "Alyx, the love story.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Episode 2, but it's still Half-Life 2, which means it's still worth your time and money",
            "review_score": "1"
        },
        {
            "review_text": "What a ♥♥♥♥♥♥ television series that only gets two episodes. CANCELLLED!",
            "review_score": "1"
        },
        {
            "review_text": "Finishing it i wanted more! At 20 minutes of playng it i sayed mysel: 'If this game ends now, i will be happy anyway, it has been a perfect start'. But it continued  The game is short but: 'Lo bueno, si breve, dos veces bueno' Baltasar Gracián (1601-1658)",
            "review_score": "1"
        },
        {
            "review_text": "A completely awesome game that will blow you away!! 10/10 even if it is the shortest in it's series.",
            "review_score": "1"
        },
        {
            "review_text": "Disappointingly short, though getting more Half Life 2 is always welcome. The game ramps up the excitement quite well but the ending feels too abrupt. Could have used another couple of hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "where tha fak is episode 3 I say",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 4 ever!",
            "review_score": "1"
        },
        {
            "review_text": "Even though it is considerably shorter than the first it is still a great addition.",
            "review_score": "1"
        },
        {
            "review_text": " Like-  Continuation on HL2 You have Alyx following, and sort-of helping Challenging achievements  Dislike- Antlion spamming. The nearly impossible giant antlion is the worst. Causes the undeniable urge to shout curses and obscenities at times  It's fun, mostly. I recommend for fans of the franchise, especially if you're finished with HL2, and want more like I did. This game can get even more frustrating, though. It feels like Alyx could be killing more to help more, some places are easy to get stumped on, but it's definitely worth a play. In my opinion, using a walk-through isn't cheating as long as you already feel like giving up after hours of trying to figure out what to do next, if that happens to you. Also, if achievement grinding is your thing, use a guide. I haven't given up on the game yet, but haven't beaten it either. Just taking a breather for a while!",
            "review_score": "1"
        },
        {
            "review_text": "Its half-life 2, only, episode 1ier.",
            "review_score": "1"
        },
        {
            "review_text": "5/5. Continues the story. Excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "HATE THE PUZZLES. This game is good and all BUT it is so Enraging to have to find every little soda can to weigh down a teeter totter to get across some electrified water. I would reccomend it... but be warned.",
            "review_score": "1"
        },
        {
            "review_text": "its part of the half life 2 series END OF STORY",
            "review_score": "1"
        },
        {
            "review_text": "Half Life 2: Episode One (SPOILER WARNING)  (Story) Half Life 2: Epsiode One (HL:EP1) picks up where Half Life 2 left off: with a bang. Upon recovering from the influence of the vortigaunts, Alyx and Gordon find themselves at the base of the Citadel. The reactor core, the Citadel's power source, is going critical and it's up to Alyx and Gordon to slow down the meltdown. What follows is a series of events that put Alyx and Gordon at the top of the Combine's list of priorities. As a result, the two must escape the city with their bought time, all the while helping Barney with resistance related business.   (Gameplay) The game is first person with shooting and puzzle solving dominating. There are no vehicular segments in this Episode. For the first half of HL:EP1, pacing is a little slower to allow you to soak in the atmosphere. The dark, underground segments will get your pulse going, especially with the new suicide zombies that run at you with live grenades. The second Half of Episode 1 is more combat focused as you push through the last of City 17's defenders and fight gunships.  (Design) There are several new textures to look at and things all around look a bit sharper coming from Half Life 2. Sound and visual fidelity remain stellar. Lighting is still excellent. Story is well written and paced appropriately. Alyx has several new animations depending on what enemy she is fighting or what weapons she has equipped.   (Final Comments) As the sequel to Half Life 2, HL:EP1 continues the story of Half Life 2, giving us a better understanding of what is happening in City 17. Gordon and Alyx become a dangerous team and the stage is set for Episode 2 very well. Just remember to keep your flashlight charged.",
            "review_score": "1"
        },
        {
            "review_text": "The first one of these games that I actually kinda liked. How about that ♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "An addition to one of the greatest games of all time, and no less perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Two thumbs up, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Logic - the only thing this game need that I don't have.",
            "review_score": "1"
        },
        {
            "review_text": "Go buy HL2 first and then come back",
            "review_score": "1"
        },
        {
            "review_text": "Remember HL2 ?  Just continue the ride ! Freakin' too short btw...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game 10/10 (Still waiting for half life 3)",
            "review_score": "1"
        },
        {
            "review_text": "  Like half-life 2, Half-Life 2: Episode One is a physics puzzle story based action shooter involving aliens and zombies.",
            "review_score": "-1"
        },
        {
            "review_text": "Half Life 2: Episode one  -plays HL2 -1 AM, school at 8:30 -doesnt matter -starts up HL2: Ep1 -finishes -5AM -time to start HL2: Ep2  10/10 would get C in english again",
            "review_score": "1"
        },
        {
            "review_text": "I didn't like this game for a few reasons, but after playing Episode 2 I realize that playing it is necessary if you want the full effect of the series.  7/10 but PLAY IT",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game. Rate 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, Man I knew hl2 was good, but man, this was better.  I continues on in a similar way. Get weapons over time but you start with the grav gun. I dont want to to spoil it so i will stop right here.  SHOULD YOU GET IT? duh",
            "review_score": "1"
        },
        {
            "review_text": "Although short, this follow-up to the amazing HL2 does not disappoint. Highly enjoyable if you want to know what happens next after HL2.",
            "review_score": "1"
        },
        {
            "review_text": "Epic story and ending!!! Enjoyable gameplay! 10/10 !!! Downloading Episode 2 right now :D",
            "review_score": "1"
        },
        {
            "review_text": "I still need to play the 2nd episode. GG 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun worthwhile expansion to HL2.",
            "review_score": "1"
        },
        {
            "review_text": "Like I said in my review for Half Life 2, this game is perfect especially because of Alyx Vance. Her characterization is OTHERWORLDLY and fantastic. Cute girls make the world go 'round. Except for Dr. Mossman. I dont like her very much. Id give this game a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "PLAY IT UNTIL HL3 COMES!!!",
            "review_score": "1"
        },
        {
            "review_text": "A great sequal. If you liked Half-Life 2, you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "Great 'sequel' i mean in the series :)",
            "review_score": "1"
        },
        {
            "review_text": "A must play for fans of Half-Life2.",
            "review_score": "1"
        },
        {
            "review_text": "bought it for a dollar at Ebgames Australia lol ",
            "review_score": "1"
        },
        {
            "review_text": "7/10. It's certainly no Half-life 2. But it isn't bad either. I just didn't feel any weight behind the combat, and the combat felt like more of the same.",
            "review_score": "1"
        },
        {
            "review_text": "Good series from start to finish very well done.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "The first 'expansion' to Half Life 2 is a very good game, though while I would rate Half Life 2 a 10/10, I wouldn't do the same for Episode One.  The continuation of the story from Half Life 2 is excellent though I feel like the length of this game is one of it's weaknesses. Half Life 2 is a long game, but that doesn't weaken the game at all.   Personally I would have rather had both episodes as one big game then seperate.   If you enjoy the Half Life series, you will definitely enjoy this game.   If I was to give it a rating, I would give it a 7/10.   ",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet, not very heavy on the story though. Extreme cliffhanger ending, in Half Life style of course. About 3 or 4 hours long, mostly consisting of insane bossfights and crawling through darkness frantically shooting at noises. Worth it on sale, for sure. Not as fun as HL2, but if you want some good Half Life style levels/gameplay, this is good for you.",
            "review_score": "1"
        },
        {
            "review_text": "Still holds up. I think it's the low point of the HL2 trio of games, but definitely shouldn't be overlooked.",
            "review_score": "1"
        },
        {
            "review_text": "Half Life is one of my top favorite video games of all time. It has everything: Good story, Intense twists, Action Stages. I love Half Life. I can't wait until Half Life 3",
            "review_score": "1"
        },
        {
            "review_text": "      Gameplay   8       Story   10       Graphics   7       Sound   8       Replay Value   10        My Score    9        My friend showed me the Half Life series, and i liked that different fantasy world and boom, it sucked me in. Then i started to play with Half Life and tried to figure out the story so i finished the HL, HL OF and HL BS, it was in 2002 or 2003. So, in short, if u like fantasy world, worlds, u will like this game. It's easy to fall in love.  About the Series, Developers mainly the Valve (MR. Gaben :D) and Sierra Studios, (Gearbox Software, on HL OF BS) and Electronic Arts(HL2 Ep1 and Ep2)   The Original game Half Life relased in (1998) Half life Opposing Force (1999) Half life Blue Shift (2001) Half life 2 (2004) Half life 2 Episode one (2006) Half life 2 Episode two (2007)  I think that's it, so now i gona write about just HL2-Ep1-Ep2  Postscript: It's not about just shooting, you have to be smart.  Pros:  -Awsome Story, Characters -AI allies and enemies both acting good -Weapons -Antlions(play and u will know) -Few Veliches -Music -Action Packed -Zombies -playable more times -Cool face animations -Dog -Zero Point Energy Field Manipulator (ZPEFM) -Little love story in the game -Fantastic Atmosphere   Cons: -Rag doll physics -Too much waiting for HL3 :(",
            "review_score": "1"
        },
        {
            "review_text": "It was all in that moment when I just sat back and laughed. I couldn t believe it was quite this good. I chuckled in muddled disbelief, expectations utterly defied. My nervous fingers reloaded the level, knowing that I had to see that breathtaking sequence one more time. It was then that I knew for certain: Valve had surpassed not only themselves, but everyone else too. Half-Life 2 is an astounding accomplishment. It is the definitive statement of the last five years of first-person shooters. Everything else was just a stopgap.  Half-Life 2 is a near perfect sequel. It takes almost everything that worked from Half-Life and either improves on it, or keeps it much the same. But that simple summation undersells how the Valve team have approached this task. Half-Life 2 is a linear shooter with most of the refinements one would expect from years of work, but it is also a game of a higher order of magnitude than any of the previous pretenders to the throne. The polish and the stratospheric height of the production values mean that Half-Life 2 is a magnificent, dramatic experience that has few peers.  It would be madness for me to spoil this game by talking about the specific turn of events, so spoilers are going to be kept to a minimum. We re going to talk about general processes and the elements of style and design that make Half-Life 2 such an energising experience. Key to this is the way in which Gordon s tale is told. Once again we never leave his perspective. There are no cutscenes, no moment in which you are anything but utterly embedded in Gordon s view of the world. Everything is told through his eyes. And what a story it is. Gordon arrives at the central station at City 17 a disruptive and chilling dystopia. And from there? Well, that would be telling. This is not the contemporary America that Gordon seemed to be living in during the original Half-Life. The events of Black Mesa have affected the whole world. The crossover with Xen has meant that things have altered radically, with hyper-technology existing alongside eastern bloc dereliction.    The world is infested with head-crab zombies and the aliens that were once your enemies now co exist amongst the oppressed masses. This very European city is populated by frightened and desperate American immigrants, and sits under the shadow of a vast, brutalist skyscraper that is consuming the urban sprawl with crawling walls of blue steel. It s a powerful fiction. City 17 is one of the most inventive and evocative game worlds we ve ever seen. The autocratic and vicious behaviour of the masked Overwatch soldiers immediately places you in a high-pressure environment. People look at you with desperate eyes, just waiting for the end to their pain, an end to the power of the mysterious Combine. Who are they? Why are you here? Who are the masterminds behind this tyranny? The questions pile up alongside the bodies.  Half-Life 2 isn t big on exposition, but the clues are there. You re thrust into this frightening near-future reality and just have to deal with it. Your allies are numerous, but they have their own problems. Your only way forward is to help them. And so you do, battling your way along in this relentless, compelling current of violence and action, gradually building up a picture of what has happened since Black Mesa. The Combine, the military government that controls the city in a boot-stamping-face kind of way, are a clear threat, but quite how they came to be and what their purposes are become aching problems. Once again Gordon remains silent, listening to what he is told so that you can find those answers for yourself.  But even with Gordon s vaguely sinister silence (something that is transformed into a subtle joke by the game s characters) there are reams of dialogue in Half-Life 2. It is spoken by bewilderingly talented actors and animated with almost magical precision. Alyx, Eli, Barney and Dr Kleiner are delightful to behold, but they only tell part of the story. There are dozens of other characters, each with their own role to play. And each one is a wondrous creature. They might be blemished, even scarred, with baggy eyes and greasy hair, but you can t tear your eyes away. People, aliens and even crows, have never seemed quite so convincing in a videogame. Doom 3 s lavish monsters are more impressive, but Half-Life 2 s denizens are imbued with life. More importantly, they offer respite. Half-Life 2 s world is a high-bandwidth assault on the senses that seldom lets up. That moment when you see a friendly face is a palpable relief. A moment of safe harbour in a world of ultraviolence. As Gordon travels he is aided by the citizens of City 17 and the underground organisation that aims to fight the oppressors. Their hidden bases are, like the characters who inhabit them, hugely varied an abandoned farm, a lighthouse, a canyon scrapyard and an underground laboratory each superbly realised.    It is this all-encompassing commitment to flawless design that makes Half-Life 2 so appealing. Even without the cascade of inventiveness that makes up the action side of events, the environments become a breathtaking visual menagerie. Cracked slabs and peeling paint, future-graffiti and mossy slate, tufts of wild grass and flaking barrels, shattered concrete and impenetrable tungsten surfaces City 17 and its surrounding landscape make you want to keep exploring, just to see what might be past the next decaying generator or mangled corpse. Whether you find yourself in open, temperate coastline or mired in terrifying technological hellholes, Half-Life 2 presents a perfect face. The first time you see ribbed glass blurring the ominous shape of a soldier on the other side, or any time that you happen to be moving through water, you will see next-generation visuals implemented in a casual, capable manner. Half-Life 2 doesn t have Doom 3 s groundbreaking lighting effects, but objects and characters still have their own real-time shadows and the level design creates a play of light and dark that diminishes anything we ve seen in other games. The very idea that people have actually created this world by hand seems impossible, ludicrous. The detritus in the back of a van, the rubbish that lies in a stairwell it all seems too natural to have come about artificially. Add to this the split-second perfection of the illustrative music, as well as the luscious general soundscape, and you have genuinely mind-boggling beauty.  But these virtual environments are little more than a stage on which the action will play out. And what jaw-dropping, mind-slamming action that is. What s tough to convey in words, or even screenshots, is just how much impact the events of combat confer. This is a joyous, kinetic, action game. The concussive sound effects, combined with the physical solidity of weapons, objects, enemies and environment, make this a shocking experience. Each encounter is lit up with abrupt and impressively brutal effects. Explosions spray shrapnel and sparks, bullets whack and slam with devastating energy. The exploding barrel has never been such a delight. You think that you ve seen exploding barrels before, but no: these impromptu bombs, like everything else in the game, are transformed by the implementation of revelatory object physics. Unlike previous games, the object physics in Half-Life 2 are no longer a visual gimmick they are integral to the action and, indeed, the very plot.  Gordon can pick up anything that isn t bolted down and place, drop or hurl it anywhere you choose. Initially this consists of little more than shifting boxes so that you can climb out of a window, but gradually tasks increase in complexity. Puzzles, ever intuitive, are well signposted and entertaining. If they re tougher than before they re still just another rung up on what you ve already learned. This is immaculate game design. There are a couple of moments in these twenty hours where something isn t perfect in its pace or placing,",
            "review_score": "1"
        },
        {
            "review_text": "First half was kind of boring, but it get's better.",
            "review_score": "1"
        },
        {
            "review_text": "Take one of the best games ever and make more of it. I'm down!",
            "review_score": "1"
        },
        {
            "review_text": "Want more Half-Life 2? Here yo go.",
            "review_score": "1"
        },
        {
            "review_text": "Short? yes. Brilliant? yes. Half-life 3?     No.",
            "review_score": "1"
        },
        {
            "review_text": "Play it only if you want to see what happens right after half life 2. The tasks are too much repetitive and it lasts 4 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "Just like the first Half life 2 but story and a little bit new prop",
            "review_score": "1"
        },
        {
            "review_text": "love the game i think it is my 2nd most favorite FPS game ever",
            "review_score": "1"
        },
        {
            "review_text": "Episode 2 is better, but need to play to understand the plot of episode 2.   10/10 would kill striders again",
            "review_score": "1"
        },
        {
            "review_text": "That robot is cute . 8/10",
            "review_score": "1"
        },
        {
            "review_text": "+) It has more thrilling battles than Half-Life 2.   -) Mapping is as bad as the first series. No clue or what so ever.  -) Every quick or auto saves it twitches with sound and it is irritating and a freaking buzz kill.  'Dash dash dash dash dash dash dash dash dash dash dash dash dash dash dash.' or  'Twah twah twah twah twah twah twah twah twah twah twah twah twah twah twah twah.' for around 20 seconds.  -) They should load each chapter at once instead of in the middle of the mission.  -) For NPCs, I want to say: Get The F*CK OUT OF MY WAY!!",
            "review_score": "1"
        },
        {
            "review_text": "Greate story and worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Gawd I love this series. Everybody should give this game a chance. Those people who never played it or played it for like 10 minutes don't know what a game needs. Sure many people don't think the same way as I do, but c'mon: -Playing the game 10 minutes doesn't give you the experience of this series -Playing this game without a gamer's heart doesn't give you the feeling of beeing Gordon Freeman.  (Yes this all sounds weird, but it's my opinion.)",
            "review_score": "1"
        },
        {
            "review_text": "Its better than you think. Later on in the game is so fun, but i wish it could of been longer since i completed in like 4 hours.",
            "review_score": "1"
        },
        {
            "review_text": "It'S a good game with replayablity value. It has some epic moments, some puzzles and like every half life game there are challenges that you have to survive. When you finish the game you will most probably want to play again some scenes. Spoiler My memorable ones were fighting against zombie hardo in the darkness, with limited light, while waiting elevator. Trio fight in the hospital and last strider boss fight. İ used only gravity, hand granade, rocket launcher, crowbar and one bullet for the locked door for an achievement. I thought it was not possible but with Alyx's help, it went smoothly. Spoiler",
            "review_score": "1"
        },
        {
            "review_text": "Probably prefer this one to Episode 2 because of the atmosphere. its probably just me but i like the thought of everyone trying to escape the city and the Combine trying to stop them. If your into the whole ubran combat theme with all the factions fighting it out in the city this one will be perfect for you, But if your into the story more you might as well skip this episode and go stright to Episode 2.",
            "review_score": "1"
        },
        {
            "review_text": "Great continuation to half life, even if VERY short. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Episode 1 of 'possibly the best game ever made'. Does NOT dissapoint",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best zombie physics",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining continuation on HL2.",
            "review_score": "1"
        },
        {
            "review_text": "Probably not the best of the HL2 series (Hl2, episode One and Episode Two). A bit short, and the story doesn't get much further than where HL2 left it.  But it's still a fun game to play and it's always nice to go back to City 17 !",
            "review_score": "1"
        },
        {
            "review_text": "A difficult and gritty game (in the best of ways).  Play it.  Watch your battery.  Good luck :)",
            "review_score": "1"
        },
        {
            "review_text": "♥ I WROTE THE SAME REVIEW AT HALF-LIFE 2 ♥  I was playing this only from google and Kickasstorrent, because in 2007/2008 my mom wouldn't let me to buy video games.. so  *DOWN ARROW* This game is my whole childhood. I've been playing this from like 2007/2008 when i updated my pc so i can play newest video games, or with better graphics because , at that time that shi&amp;ty PC that i have, was something great for me. the Half-life Franchise is a part of me and my childhood.  I still don't know why I love this game but is so different from the other games. THIS GAME WAS , IS , AND IS GONNA BE MY FAVOURITE GAME. half-life 1 } half-life 2 }this is my half-life 2 episode one}gaming family &lt;3 half-life 2 episode two} AND YES I'M STILL WAITING FROM 2007 FOR HALF-LIFE 2 EP. 3/HL3 TO COME ON STEAM, SO GABEN PLS.  10000/10 would cry for how beautiful this game is again ♥   daca nu stii engleza e pacat.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  A great DLC for a great game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, but I have one complaint: It's too short! The only way to make up for this (besides updating it) is making Episode 3!!!!!!!!!!!!!!!!! NOW!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It was going to be hard to follow up on the epic story of the original, however I guess it's not bad, just not grate.  They needed to add a new gameplay elliment of atleast a few new weapons, but they did not.  7/10 missed opportunity by the developers to really continue the ground braking work they started.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Episode One is the first episode of Half-Life 2,is it good? YES",
            "review_score": "1"
        },
        {
            "review_text": "Nothing needed here.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent as always.",
            "review_score": "1"
        },
        {
            "review_text": "you know what we want valve",
            "review_score": "1"
        },
        {
            "review_text": "Its got a cool story bro.",
            "review_score": "1"
        },
        {
            "review_text": "This is so great! even after all those years this game looks good and feel great! Even new games doesn't have that great feelings when it comes to guns and destruction like this game have, very, very satisfying to play. Hard to believe it have over 10 years now and still is this great and playable.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of, so called horror games, would learn a lot with this sequel. The atmosphere that this game creates is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Half-Life 2: Part 2?: Life In The Big City. I like it, but it's too dark and cramped for this ol' country boy.",
            "review_score": "1"
        },
        {
            "review_text": "A pleasing addition to the Half Life franchise",
            "review_score": "1"
        }
    ]
}