{
    "app_id": 3800,
    "name": "Advent Rising",
    "release_date": "2006-09-14",
    "developer": [
        "GlyphX Games"
    ],
    "publisher": [
        "Majesco Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Sci-fi",
        "Story Rich"
    ],
    "achievements": 0,
    "positive_ratings": 260,
    "negative_ratings": 71,
    "price": 7.19,
    "description": "A common legend pervades the galaxy-that of a powerful, highly intelligent ancient race that will one day deliver the universe. They are known as Humans. The Advent of Humanity Begins...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3800/header.jpg?t=1525292280",
    "minimum_requirements": "Windows 2000/XP, 2.0 GHz Processor, 256 MB of RAM, 128 MB ATI 9000 or higher or 128 MB GeForce 3 or higher (except GeForce 4 MX), DirectX 8.1 or higher compatible sound card, DirectX 9.0 (included with download), 5.5 GB Minimum Hard Drive Space, NVIDIA nForce or other motherboards / soundcards containing the Dolby Digital Interactive Content Encoder required for Dolby Digital audio, Windows-compatible keyboard and mouse Recommended:Windows 2000/XP, 3.4 GHz Processor, 512 MB of RAM, 256 MB GeForce FX 5600 or higher or ATI Radeon 9600 or higher, Sound Blaster Audigy 2 series sound card or higher, Game Pad",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This was a great game that I looked forward to playing each day. The story (written by Orson Scott Card [Ender's Game]) was compelling and I was looking forward to play the sequels. Unfortunately, they never came.  I played the game years ago (before stats logging). I tried installing it on my Winodws 7 PC, but it didn't quite work so I had to uninstall after only 10 minutes of play. If you have a Windows XP/2000 box give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "[10/10] Seriously, for a game that came out almost a decade ago It's aged pretty well  Pros: The plot is fantastic Fluent mechanics Combat is really fun Great cast Awesome soundtrack Phenomenal piece overall  Cons: Ending suffers because this is the first of an unreleased triology, leaving you with a (beautiful) cliffhanger Cutscenes are fuzzy (Fixable*)  Conclusion: It's underrated. But the game does so well for itsself it is definitely worth the buy  *To make the cutscenes a bit more polished I recommend looking up 'Advent Revising'. The guy did a fantastic fan patch on polishing this game",
            "review_score": "1"
        },
        {
            "review_text": "highly underrated game.",
            "review_score": "1"
        },
        {
            "review_text": "Got the original game back when it was still new on Xbox, played it so much the disc got a chip in it. 11 years later I find it on Steam and it's still as great as I remember it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is a really fun classic, and the story line is awesome. a lot of progression and variety",
            "review_score": "1"
        },
        {
            "review_text": "Epic story. Gameplay and skill developement well ahead of its time. Other than graphics, obviously, it is easily on par with Mass Effect..... dnd then it was shut down before the sequels were done. So sad.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games for the original Xbox. In a lot of ways, it can be seen as a predecessor to Mass Effect: a sci-fi shooter with a deep plot (where decisions made in the first game theoretically would have transferred over to the sequels, had there been any) and some RPG elements (though these are incredibly light RPG elements when compared to those of Mass Effect). It's a bit glitchy at times, but the graphics are pretty good for the era and in no way detract from the experience. Personally, I can't play this without a controller, but I think that's just because that's how I learned it. All in all, a great buy for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Unless I can summon some otherwordly patience within myself to finish this game, I can't recommend it which is a huge shame. I remember hearing about this game when it launched on the Xbox back in the day and when I saw it on Steam, I got excited to try it out after seeing the good reviews.   Unfortunately, I have to disagree with most reviewers. With the understanding that this game is 10 years old, I'm not going to bother talking about the graphics. It's understandable that they're dated and don't hold up well.   The controls are beyond awful and controlling vehicles is a nightmare. The game crashes... a lot. I even installed the Advent Revising fan patch which is supposed to fix a lot of the bugs and crashing issues. Didn't help much. The combat seemed fun at first, but after the 20th encounter with a pack of enemies, you realize that there isn't much in the way of strategy or diversity. Run around, shoot the seemingly endless string of bad guys, repeat. At least the guns are cool.  The game also seems to have a variety of random glitches and errors which I encountered a bunch in my short play time. Some of them are incredibly frustrating and require you to completely restart the level to resolve. Not sure if these problems are prevalent on the console version or if it's a port issue, but it's just one more thing that makes this game a serious test of patience.  The one redeeming quality for me was that the story seemed interesting and well-written. If I do end up finishing this game, it'll be for story alone. That's if I don't go online and just read about it first.  I'd say avoid this game unless you're looking to replay it for nostalgia's sake. It just seems broken in too many ways.",
            "review_score": "-1"
        },
        {
            "review_text": "To describe this game you need one word, dissapointing. It is fun game with an interesting story to back it up, but it has problems. From enemies that spawn beside you, enemies that respawn when you walk 5 meters away just to get healed, checkpoints that don't register and of course falling through the level or being blocked by invisible walls. It's such a shame, because the story looked interesting and the combat was really fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game on the original xbox, horrible PC port.",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable with m+k because of negative mouse acceleration that cannot be disabled.",
            "review_score": "-1"
        },
        {
            "review_text": "playable but requires mods for non 4:3 monitor resolutions also as of this review thing it crashed when i tried to use game capture with open broadcast software it gave me general protection fault! messages good version of the game just suffers from being an older pc game that wasint really designed around alot of todays software for pc recording being used",
            "review_score": "-1"
        },
        {
            "review_text": "This game is tailor-made for teenage boys who think that Ender's Game is the greatest novel ever written. If you fall into that category you'll probably love it. I was just bored.",
            "review_score": "-1"
        },
        {
            "review_text": "Cutscene heavy, stroy rich and linear. Aesthetically similar to Mass Effect.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game!  I liked the many weapons you can use, the powers and the story very much! This game was worth my time! Also the soundtrack was incredible! I recommend playing this game if you have the time.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun third person shooter. It didn't do well enough to continue the rest of the trilogy which is a shame as the story and gunplay are both excellent.",
            "review_score": "1"
        },
        {
            "review_text": "I've tried to like it, but I can't. Bad control. Bad sound. Bad visuals. Bad interface. Everything seems overyly complicated to do very simple tasks. Keyboard control is touchy. Cannot get joypad controls setup correctly.  I will say that some of you will love this game. I do see this game possibly going far with certain gamers. I'm just not one of them. I took a chance on a Minecrap like game and I just do not like anything about it except for the concept alone. This I do like. Maybe in the future I will try again once it's gotten more updates and changes. But for now I will say I will recommend for serious gamers who love these styles of games, but can't recommend to general public. It's still early with it, so we'll see what happens later. It may change and so will I...",
            "review_score": "-1"
        },
        {
            "review_text": "An outstanding but deeply flawed experience. Unique gameplay and a wonderful script are dragged down but not ruined by the mother of all clunky control schemes. Thankfully once throughly rebound (make use of Mouse4 and Mouse5!) the game is very enjoyable. The plot ends on an unfortunate but very well done cliffhanger that will never get it's sequel and the pace of the story is too fast. All that being said, once you get used to the controls fighting becomes great fun, from dual wielding rocket launchers to stealing enemy superguns to things I can't get into without spoilers. It's definitely worth a pickup if you're a fan of space operas, however be prepared to deal with frustrating situations brought on by difficult controls.",
            "review_score": "1"
        },
        {
            "review_text": "awsome game, shame that sequels were not created/cancelled",
            "review_score": "1"
        },
        {
            "review_text": "Cool story, but honestly, the combat killed it for me. I just couldn't keep doing it find out what happened. So I look it up afterward and find that it was originally planned as a series of games and ends on a cliffhanger. Kinda glad I never got there. Watch some vids for this one before buying it. I'm not sorry to have done it, but glad I got it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved the premice, but would have loved if they had ran with a little more.",
            "review_score": "1"
        }
    ]
}