{
    "app_id": 380150,
    "name": "STASIS",
    "release_date": "2015-08-31",
    "developer": [
        "THE BROTHERHOOD"
    ],
    "publisher": [
        "THE BROTHERHOOD",
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Horror",
        "Point & Click"
    ],
    "achievements": 27,
    "positive_ratings": 920,
    "negative_ratings": 209,
    "price": 7.99,
    "description": "STASIS The isometric, point-and-click, sci-fi horror adventure game! In the distant future aboard a seemingly abandoned spacecraft, John Maracheck awakes from stasis. He must push himself to new physical and emotional limits and unravel the mysteries around him.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/380150/header.jpg?t=1498146544",
    "minimum_requirements": "OS: Windows XP 32 bit SP3 Processor: 2 GHz (Dual Core) Memory: 2 GB RAM Graphics: Nvidia GeForce 205, AMD Radeon HD 3400 Series with 256 MB+ VRAM, latest OpenGL driver  (Shared Memory is not supported) DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers Additional Notes: Windows XP may require a few extra drivers. Shared Graphics cards not supported at all. OpenGL 2 + Required.",
    "recommended_requirements": "OS: Windows Vista SP2, Windows 7 SP1, Windows 8 (32/64 bit versions), Windows 10 (32/64 bit versions) Processor: 2.6 GHz (Dual Core) Memory: 4 GB RAM Graphics: Nvidia GeForce 405, AMD Radeon HD 5400 Series or higher DirectX: Version 9.0c Storage: 5 GB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers Additional Notes: Visual C++ Redistributable for Visual Studio required",
    "reviews": [
        {
            "review_text": "I played through STASIS in basically one sitting. It took around seven hours to complete.  What STASIS basically does is pay homage to various movies like Event Horizon, Pandorum, and Aliens(you will find Easter Eggs in the game demonstrating proof of these influences) while crafting it’s own fairly well written story. The dark and foreboding atmosphere in STASIS really sets the tone for what was, at least in my opinion, a stellar gaming experience.   Story",
            "review_score": "1"
        },
        {
            "review_text": " where is everybody?",
            "review_score": "1"
        },
        {
            "review_text": "I was upset because I got stuck on something simple in the begining because I was not familiar with the functions of the puzzles and I was not thinking. I over reacted and gave it a bad review. After I tried again I started to like it, I ended up passing it and changed my thumbs down to a big thumbs UP! This game is actually a really great game. I was scared, good storyline, creepy, I like the puzzles, sound and visual effects were great and the characters and creatures...the way they looked was horrifing and good coding to put it all together. The ship and backgrounds were made nicely! I am glad I purchased and passed this, I recommend this game, 2 thumbs up! Thanks for making this!",
            "review_score": "1"
        },
        {
            "review_text": "What STASIS does well is prove that a horror game doesn't need to rely on action to be scary. It's a triumphant love letter to the classic horror tales of yore, proudly displaying it's inspirations on its sleeve. It made me think of Planescape:Torment, Sanitarium and I Have No Mouth, and I Must Scream (and it appropriately has an achievement inspired by the title).  It is easy to draw parallels to the recently released SOMA, which I played (and reviewed) shortly before this, and while it doesn't quite reach the same heights as it's horror cousin, it doesn't really have to. It's a similar but also completely different experience, one that might be harder to swallow for the main-stream horror enthusiasts but that will definitely prove a worthwhile journey if you are also a fan of the adventure game aspect that it provides.  The only flaw I can really point out is that some of the items required to solve a few puzzles in the game were really hard to find before you got into the mindset of the games design. However, after a while, you learn that EVERYTHING that you can interact with is there for a reason, so keep that small tip in mind if you descide to try this experience.",
            "review_score": "1"
        },
        {
            "review_text": "First of, I'm not a big player of point &amp; click. But I enjoyed Stasis a lot. And that's what is important here :p  Nothing seems really new or ground breaking. The game mecanics were very close of what I experienced with Deponia (inventory, items to combine and to use on the background or on yourself, puzzles to solve) without silly puzzles and jokes. The story begins with a very standard plot : a father wakes up in an empty ship, not knowing why he's here and is looking for his missing wife and child. Nothing fancy here.   But I got sucked into the game very quick.   Why ? - The sci-fi background of the game is very well rendered. - The horrific storyline behind the main plot is very interresting and delivered bits by bits, while giving hints for puzzles to come. - No cheap puzzles, the game will give all the hints you need. - No cheap jumpscare but the horrific mood is really good. - The musics and sounds are very well crafted and give more to the mood. - You can see how most scenes are handcrafted to share different moods : hopelessness, mercy, pain, sadness, disgust, etc... I really loved this point. - I really liked the voice acting of the main character. You really feel his pain and his distress. He's no super hero and he's very well written. Sometimes crying, sometimes praying ... Not to much, just little touch, no overacting.   You'll might get a bit annoyed by the compression quality of the backgrounds (it feels really low Oo). But you'll get used to it and you will be sucked by the atmosphere of the game (at least I did ^^).  Also some walking/running animations are a bit off, and feel like floating on the ground... Some animations are not coherent (the guy is hurt to one leg and keep using this one to stand up for example). But it doesn't affect lots of the animations in the game.  25€ seems a bit high for a point &amp; click (IE: no replayability for 6-8hours depending on how good you are on puzzle solving, and if you are a fast reader or not), but the game is still very good and we should encourage those devs to make more quality games ! And STASIS is a quality game for sure.  TL;DR :  - I ended up playing the game in one strech of 8 hours, and I enjoyed it A LOT. A bad game can't do that ! - Stasis doesn't have all the flaws you can find in a Deponia like game (sorry it's the only game I can compare it to !). - The story is really enjoyable and some stuff will make you cringe behind your screen. - Maybe a price a bit too high, for 8 hours of gameplay and no replayability. But it will be some good quality 8 hours you'll spend for sure ! - If you are looking for a good point &amp; click, you'll find it here !  I will for sure play the game a second time to be sure to grasp every bit of story distilled by the game as it's quite interresting and worth the time put into it :)",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful exercise in Cronenberg-like body horror, this is a narrative whose pacing might be too slow for some, but creates an effective sense of dread and sorrow without resorting to jump scares or other spooooooky tactics. It's a fairly flatfooted commentary on eugenics, gene manipulation, ethics of cloning and human experimentation, but it's executed with steady-handed, thoughtful style.  Though it appears to be a real-time strategic puzzle-solving game, there are actually very few time-sensitive events and could be considered a fluid turn-based adventure. The isometric style reminds of Satellite Reign or Shadowrun, but the textures are more organic and atmospheric, and the cutscenes mesh pretty well with actual gameplay.  As the game progresses, there are longer cinematics/cutscenes that are repeated and unskippable if you happen to die at that checkpoint, so I started saving after every scene.  As an aside, until the *procedure* (don't want to spoil), I was convinced John was running around naked in all sorts of filth and rot. I'm going to just continue to imagine that he's traveling through this subterranean network for hours in the nude.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome atmospheric adventure with very detailed 2.5D scenery. Reminds me most of Sanitarium, but has a dozen of old-school influences and is executed flawlessly. Still, the game manages to be its very own thing, has great pacing and story, mostly good and reasonable puzzles that are all designed with the puirpose of moving you and the story forward, not just loosely-connected obstacles, as theey are in some poin=and=clikc games.  Also be warned - the game is very gory, and has some very bleak scenes, but it all fits with its setting and story and builds up its atmosphere without too much excess,",
            "review_score": "1"
        },
        {
            "review_text": "What a fun story! Mix of modern and some old school style adventuring (had to use a pen and paper a few times). Great spooky, space atmosphere; was actually startled a couple of times. Really nice production values when into this. A good amount of reading of logs and such to add to the back story...sick (in a good way). Music and sound effects were great. Puzzles were relatively fair. It was easy to overlook items if not careful which can lead to a little back-tracking (but not too much). I generally felt the pace was good; one puzzle took me too long due to not quite understanding the concept and having to repeat it too many times (just the point I was getting annoyed, but not beyond...). I highly recommend trying to die when you get a chance (in the game I mean) as the animations are usually cool. For achievement hunters, a few extra hours to rap those up are in order. Highly recommend with a big thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Dead Space, Event Horizon, Alien. If any of these words make you tingle at least a bit, you might enjoy stasis.  In spite of some issues, minor at best, I found Stasis to be a very engaging experience and it definitely left me hungry for more from the developers. Whether you’re a fan of an old-school adventure game with a similar style to that of Sanitarium or simply into the sci-fi thriller genre I’m confident in saying it’s definitely worth your time.   PROS - Excellent atmosphere - Immersive story - Great sound design CONS - 3D models are subpar - Some puzzles tend to be obtuse - Unskippable dialogues and cutscenes",
            "review_score": "1"
        },
        {
            "review_text": "Dead Space, Event Horizon, Alien. If any of these words make you tingle at least a bit, you might enjoy stasis.  In spite of some issues, minor at best, I found Stasis to be a very engaging experience and it definitely left me hungry for more from the developers. Whether you’re a fan of an old-school adventure game with a similar style to that of Sanitarium or simply into the sci-fi thriller genre I’m confident in saying it’s definitely worth your time.   PROS - Excellent atmosphere - Immersive story - Great sound design CONS - 3D models are subpar - Some puzzles tend to be obtuse - Unskippable dialogues and cutscenes",
            "review_score": "1"
        },
        {
            "review_text": "Steam reviews needs this space optional. I don't like writing reviews but still want to give a positive or negative rating. SHUT IT DOWN!",
            "review_score": "1"
        },
        {
            "review_text": "Who made the moonshine?  Good game. I just wish the baddie wasn't cartoon evil. 'I'm God!' *stomp stomp stomp* It almost spoiled the whole game for me.",
            "review_score": "1"
        },
        {
            "review_text": "I won't keep you long and won't post any spoilers. This is one terrific game. The graphic could have been better and some puzzles could have been more transparent, but still - this one is still hell of a game. Atmospheric, with thick plot and nice general story, though the motive is old as humanity itself. I would definitely recommend this game to my friends",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It is a very good mixture of sci-fi and horor genre. It has a dark and disturbing story, would recommend it to all horror fans out there :)   However, there are few things which bothered me:  - dialogues can't be skipped - some puzzles don't make any sense - interractable objects could have been marked better  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Just wow. At first I have been a bit sceptic, I do not like isometric games too much, but that was the last thing I had on mind when I began playing the Stasis. Tha game catches you from the beginning to the end. I actually made only one pause during whole gameplay and that was for night sleep. I loved everyting about this one.   Pros  + Length: It took me quite long to finish the game, 10 hours. That is above average for an adventure game.  + Story: The story is incredibly immersing and I could not wait for to see how it will end. I really enjoyed reading found PDA texts too, they are well written and greatly help to create whole picture of what is happening.   + Atmosphere: You almost feel the isolation and hopelessness of the main character on the seemingly derelict and empty ship. The graphics, sound, music, everything adds to the creepiness and fear in this brilliant horror game.  Cons  - Puzzles seemed too hard and obscure for me sometimes, there were several times I could not figure what to do next.  In general I must say that this is one of the best horror adventures I have played so far and I think that those were very well spent 20 Euros, absolutely no regret.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the biggest surprise games I've ever played. As a 36 year old OG gamer, I don't try a lot of games on a whim these days. But being a big sci-fi fan I decided to give it a whirl. It is very immerive, has very engaging puzzles, and has the best ending of any game I can remember in recent times. Also, speaking as someone who went to school for digital audio production, the sound design is phenomenal. The levels were beautifully painted and after a while you really feel like you know the ship and know your way around it... like it's a real place. The ending was a true shock and I was telling people about it for days. This is the only review I've ever written to date... I felt it needed to be said. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "STASIS provides a beautifully creepy atmosphere for you to explore. The gameplay is fun, the story is interesting, and the suspense is always present.  I was pleasantly surprised by the quality of gameplay. Jump scares are present, but the game does not rely on them. The atmosphere itself is the games' greatest proponent. I easily became immersed into the game, feeling genuinely uneasy as I moved from area to area.  You can catch my first 40 mintues of gameplay on YouTube:         YouTube™ Video:  STASIS - Gameplay and First Impressions with KyleKidd&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "So far its been great, story is creepy, as are the locations in the game. Puzzles are not too difficult and the backstory presented (via PDA logs) is pretty good. I kickstarted this for less than the full game asking price, I'd highly recommend it during the next Steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "STASIS is a dark and disturbing sci-fi point and click adventure and if you do not fear 'some blood' you can't miss it! STASIS won't make you jump screaming like an horror movie, but will keep you awake thorugh the night until the VERY end ... because once you wake up in that spaceship you will want to escape as soon as possible! Absolutely RECOMMENDED!",
            "review_score": "1"
        },
        {
            "review_text": "So after playing and finishing the game I'll throw this out there in 'review land'. Game is exceptional. The curiousity and exploring and discovering, the puzzles, it all had the trademarks of the first Dreamfall game. While not so very far apart in their worlds they are miles apart in storytelling. Stasis, has got to be, hands down , the best point n click adventure game made. It's not very long, long enough though. I clocked it around 8 hours. Some may get it done shorter. There are multiple paths to solving a problem but only 1 one of them will leave you alive. The voice work is, plainly put, phenomenal. There's no cheesy dialogue, just real heartfelt curiosity, pain, and angst. It is EASILY worth the asking price for a fantastic story and game.   I caution you, the ending, the ♥♥♥♥ing ending, will throw you. For real. Damn.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly eerie, graphic, fun, and ultimately unsettling cosmic P&amp;C horror.",
            "review_score": "1"
        },
        {
            "review_text": "Ever play a game that spit in your face at the very end, and you loved every moment of it? I didn't know what to expect when I started playing Stasis when I couldn't get to sleep one night. I played through most of it with one break in the middle and I have to say it left me wondering what was going to happen next. The data logs that tell the backstory are enjoyable to browse through but a few of the puzzles are a bit random to solve. (Here's to you item that I couldn't find for ten minutes!)   If you're just wanting a fun game to spend a day playing that will leave you with an impact reminiscent of Dead Space grab this game.",
            "review_score": "1"
        },
        {
            "review_text": "I tend to buy games randomly on sales and then I dont touch them for like months, I was short on options lately so I just clicked on this one intending to kill time for maybe half an hour...  The next 3 hours I was totally hooked by this, amazing story, puzzle solving is just hard enough to need 2-4 trials max but easy enough to avoid being frustrating, reading the logs of the crew is absolutely fascinating and the scares were perfectly timed without being the cheap jumpscare thing.  Seriously this game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "A nice science fiction horror isometric point and click game. Part fo the fun in the game is to fail and get yourself killed in many funny ways ;) A horro SciFy theme that makes you want to read all the PDAs to get background info on what happened on the ship. Lots of crepy crawlers to keep ya wanting the lights on when you are playing. A good buy, took me 10 hours to run the course of it.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game very much. Perfect horror atmosphere. No jumpscares, just great writing and creepy visuals.  It's a point and click adventure game, so expect to be doing some puzzle solving. I had to look up solutions on the forums a few times, but they aren't horribly difficult.  There's quite a bit of reading, but the writing is very well done and I never found myself bored or skimming. I actually was afraid I'd miss an important clue or tidbit of information.   One of the things I've been missing lately are the kind of adventure games that don't feel like they have to be action packed survival games. If you like to constantly run from stuff, this game isn't for you.  If you like your horror a bit more subtly induced, this is for you. :)",
            "review_score": "1"
        },
        {
            "review_text": "Because I baked this game, I had big expectation. I can say that the game is amazing. I love playing this game. The story is great. It's long enough. The sound is amazing. Beautiful backgrounds. The puzzles are on high level. The End is epic. 10/10, Thanks Chris",
            "review_score": "1"
        },
        {
            "review_text": "I love my space trading/combat simulators, I love my gory first-person shooters, I love my stealth action over-the-shoulder games just like the next guy, but there's something special about a good point-and-click adventure title. I think it's the potential the genre has for narrative.   STASIS really doesn't disappoint in that regard. It does a whole lot with a very barebones start, no less. The story is a bit tired, the voice acting can occasionally be grating, there are three characters in the entire game and they're all pretty trope-heavy. Despite this, it's an excellent game.   The PDA logs were an unusually interesting experience. While I will usually skim these pretty religiously for clues and information, I found that the plentiful PDAs were slightly redundant, offering very colorful and diverse persoectives on what was sometimes overlapping information. Each of the characters' stories were fascinating, which is probably part of why the whole experience was so riveting. Perhaps what was best, was that in the event you missed one, you weren't screwed in the long run. You will not want to miss them, though, because they're half the fun.  The puzzles were not overly difficult. I'm by no means a master at these things, so I had to walk away for a few minutes from time to time, but I was able to negotiate the entire game without ever resorting to a guide, in a pretty reasonable amount of time, about ten hours. None of the puzzles was difficult enough to really break the narrative pacing, I felt.   The imagery was great for such a simple media. THe game does a lot with a little, again, in this regard.   Voice acting was a little bit rough in places. The daughter in the first flashback, for example, was so bad that I was convinced briefly that there was something wrong with my computer or with the game. It worked beautifully whenever it counted, though, and was never really grating.  If you're not the patient sort, you may want to give this one a pass, because it is extremely sluggish, as these games can some times be. If you enjoy a very dark narrative with some very cool puzzles and imaginitive design, you'll want to grab this one in a hurry.",
            "review_score": "1"
        },
        {
            "review_text": "A decent and creepy/atmospheric sci-fi/horror point-and-clicker. Not overly challenging in the way of puzzles, but the writing and voice acting were quite good. The character stories and depraved mad-science of the Cayne corporation were conveyed well I thought, but you really have to read through all of the in-game material in order to appreciate this. Overall, an interesting and worthwhile experience.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good sci-fi horror adventure game filled with dead bodies and every sci-fi prop you can think of. Heavily influenced by alien, event horizon, sunshine and games like system shock. I thouht the puzzles were at times difficult because it is a very dark game and it is hard to see outlines of items and it becomes a pixel hunt in a pitch of black. But the story was nice and the animations and sounds effects were excellent. I liked it and hope for a sequel. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A cool horror adventure game. There are some cliché elements. Took me about 8 hours to complete (looked up the solution for one puzzle because I was stuck).",
            "review_score": "1"
        },
        {
            "review_text": "This game is beatiful and genius, think of it as of that movie Pandorum however with a different story made into a 2D horror athomospheric advanture game.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent point&amp;click game. Great storytelling and graphics. As a point&amp;click adventure, makes me feel like going back to my time in the 90's, although this story is much darker. Recommened.",
            "review_score": "1"
        },
        {
            "review_text": "A very solid point &amp; click adventure that harkens back to the more interesting latter-day examples of the genre, particularly games like Sanitarium. The horror elements are effective, the acting is generally quite good, and I had no real problems with the puzzles outside of a couple of instances of pixelhunting or lacking information about the items in my inventory. My single biggest gripe with the game came at the very end, but the journey still made it worth it.  For such a tiny team they've made a game that fits perfectly in the genre, and if you're up for some cronenbergian body horror blended with severe and constant emotional trauma, you should give Stasis a go.",
            "review_score": "1"
        },
        {
            "review_text": "I wholeheartedly agree with everything Aeon Amadi wrote in his review. But for one point. He says the game does not have much replay value. I wonder if he still feels that way. It has been a while since I did my playthrough and like him I felt one and done was sufficient. I have changed my mind and can't wait to play the game again!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very nice 2D point and click adventure that will kind of take you back in time if you used to play those in the '90s. It focuses on atmosphere, narration and storyline rather than puzzle solving. The inventory is very basic, you will never hold more than 5 or 6 items at once, you can combine them, but as I said it is not really about puzzles, and you have only one type of click with the mouse (the cursor changes based on the action you can perform...like 'watch' or 'use').  The game seems to take many things from other games/movies that we (all?) have already seen, like Dead Space, Pandorum, Alien, Moon, and so on, but not in a bad way, I really liked the atmosphere. About the story: I don't know, it didn't convince me too much, I am not sure if everything can really fit together at the end. This is a game that may need to be played twice, if you want to connect all the little dots (second playthrough keeping the first one in mind). It lasts about 8 hours for the first playthrough. There are no multiple endings (as far as I know) and puzzles have only one solution, I mean playing it twice to understand better the story and little details (up to you).",
            "review_score": "1"
        },
        {
            "review_text": "loved it space horror is always fun!",
            "review_score": "1"
        },
        {
            "review_text": "Most awesome horror adventure game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Brings back memories, enjoyed every minute of it. 10/10 will buy next release!",
            "review_score": "1"
        },
        {
            "review_text": "As somebody who hates horror. I have to admit that this game is excellent.",
            "review_score": "1"
        },
        {
            "review_text": "An trip into a dark, twisted world.  Completed this once. I think I'll go back and play again...",
            "review_score": "1"
        },
        {
            "review_text": "Fair Disclosure: I was a Kickstarter backer of this game.  Remember how games used to look before everything had to be rendered as players went through? No? That's okay, STASIS reminds you how deep and compelling they were. Dismissing this game for it's prerenders and/or it's static viewpoint is a huge mistake, especially if one is into a beautifully crafted story with generous helpings of lore and background to go around.  STASIS starts out much like any other sci-fi horror game: player wakes up in a scene somewhere between the cryogenic thaw scenes of Demolition Man and the gore-tastic parts of Event Horizon (one of which you should watch if you like sci-fi horror, the other if you're a fan of 'did anyone read the script before argreeing to this' horror). From there the game follows some tropes (oh, all these logs mention not going to this place... guess where I'm headed) but manages to keep a steady pace to maintain interest. Some of the puzzles can be a bit of a pain to get through but luckily there are generous hints not only in the logs but 'on' them as well (when you see it for the first time you'll get it). Unfortunately, there are some typical 'oh, those things have to be combined, strange' moments (let's face it, it's a staple of point-and-click adventure games) but aside from those and some story tropes the game is definately worth a few playthroughs (once to get to the end, once to find all the ways to die because achievements, and once to try to figure out what the heck happened at that part).",
            "review_score": "1"
        },
        {
            "review_text": "If you love space horror and adventure games you either already own  STASIS  or you need to buy it. This game was developed  for you , specifically. If you love space horror and are lukewarm about adventure games then this is a sale purchase that will provide at least  some  enjoyment. I'd describe myself as a 'casual' adventure game player - I needed a few hints at first but eventually found myself almost entirely reliant on a walkthrough. That's fine, really, as I bought  STASIS  during the 2016 Summer Sale just to look at it and as eye candy, it delivers.   Cons",
            "review_score": "1"
        },
        {
            "review_text": "Dark, well-acted, well- written with a well developed universe - can't wait to see more in January!",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit to being disappointed by this game. I am a huge fan of both science fiction and adventure games, so this seemed to be made for me, but i just didn't enjoy it. First, the good. The artwork and sound design is incredible. The spaceship is epic sci-fi gothic à la Event Horizon, and the body horror is Cronenberg levels of disturbing. The sounds are razor-sharp and creepy as hell. Unfortunately beautiful art and sound is all it's got, because the story is paper-thin. It's an entirely predictable journey through sci-fi tropes we've seen a hundred times before, without any of the clever twists or storytelling tricks we've come to expect from adventure games these days.  I don't feel like this deserves a thumbs down based on its aesthetic - it truly is beautiful - but adventure games to me are all about the story and characters. Stasis stretches out a B-grade horror yarn into 6-7 hours, and unfortunately overstays its welcome as a result. Maybe it would've worked better in episodic form. All that said, props to the developers for uniquely taking a typical 'action' story and putting it into an adventure game instead of a first-person shooter. Perhaps there is a market for this somewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  •Nailed the environment/setting. Think of a mixture of Alien and Event Horizon. •As I progressed through the ship and the horrors within, I definitely wanted to figure out what had happened.  Cons:   •While the environment was great, interacting with it was not. It was sometimes difficult to figure out what items could be interacted with and what couldn’t. Finding new items was sometimes like a pixel hunt. •Some of the puzzles were a bit obscure, and in some cases picking up objects without context as why you would use them does not make much sense. (i.e. Why would I root around in a toilet to get a soiled towel before understanding the need for such an object?).  •I personally did not find the overarching plot of the main character and his story line that absorbing, and it was also – for the most part –fairly predictable.   By the end, I was glad that the game was over so I could move on to something else. Which is guess is a telling review of the game as a whole. However, if you like dark space horror stories, there still might be enough here to merit a play through.",
            "review_score": "-1"
        },
        {
            "review_text": "Not good. Filled with overused tropes, used so badly I cringed worse from the terrible tropes than I did from any actual 'horror' premise.",
            "review_score": "-1"
        },
        {
            "review_text": "Not that great. Voice acting was so-so, puzzles weren't that great, and plot was really flimsy.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has a great athmosphere and sound, the theme is very dark and partially disgusting. Usually im a sucker for any sort of horror game. In this case i really wanted to like it. But apart from the setting and all it fails in its core gameplay. The control is awful, the protagonist looks even when running like a disabled crashtest dummy. The puzzles- well im certanly not the brightest candidate, but without a walkthrou i would have never finished this at all. Halve the time i had no idea what was expected from me. This is mostly because of massive lack of hints. Hey, its cool if you can actually die in an adventure game, but if you didnt save at certain spots and are forced to repeat halve an hour, wheres the fun there? Later i was actually saving every time i enterd a new room.  Well, to the later end of the game it gets really messy, i wouldnt recommend this game if you dislike splatter or deep psychological terror. There is some really sick ♥♥♥♥~ Like   killing kids.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Numerous bugs, culminating with a game-breaking bug that left me unable to continue at what I estimate to be around 25% completion (judging by the walkthrus). Good writing, excellent atmospherics and scenery (if somewhat miniscule given the fixed isometric perspective), uninspired, not altogether logical puzzles, and poor implementation.",
            "review_score": "-1"
        },
        {
            "review_text": "I never got past the robotic surgeon from the first rooms. As usual there was a series of power switches and I tried every combination. I guess all you can do in a point and click game is line up buttons to turn off and on. No amount of mood music is going to make that imteresting.",
            "review_score": "-1"
        },
        {
            "review_text": "Somehow I'm not impressed at all. This is not scary at all. The graphics are actually very bad. A real disappointment!",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't play much of it.. but i don't see the point. Myabe it gets better at some point - the game forces you away.  maybe the story is good., but i had to force myself to play for one hour and nothing hooked me.  pro: +nice art style  cons: -super low rez, the game was made @ 720p -no settings -Interface is a poor -unable to skip the poor voice acting - hey, i can read faster - let me click through it. -unintuitive - how would i know that i need to turn it 3 times? why does it only work when the power is off? computers need to be clear what is just text or it is, in fact, controls -puzzles are dumb/force/random",
            "review_score": "-1"
        }
    ]
}