{
    "app_id": 380670,
    "name": "Final Approach",
    "release_date": "2016-04-04",
    "developer": [
        "Phaser Lock Interactive"
    ],
    "publisher": [
        "Phaser Lock Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "VR Support",
        "SteamVR Collectibles",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "VR",
        "Casual",
        "Strategy"
    ],
    "achievements": 47,
    "positive_ratings": 319,
    "negative_ratings": 17,
    "price": 10.99,
    "description": "Take control of the skies like never before in a full Virtual Reality world! Airplanes on fire, commuter aircraft low on fuel, mid-air collisions, emergency helicopter rescues, military exercises and so much more!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/380670/header.jpg?t=1510949215",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590 Memory: 5 GB RAM Graphics: NVIDIA GTX 970 Storage: 4 GB available space Additional Notes: VR ONLY",
    "recommended_requirements": "OS: Windows 7 Processor: Intel i7-4770 Memory: 5 GB RAM Graphics: NVIDIA GTX 980ti Storage: 4 GB available space Additional Notes: VR ONLY",
    "reviews": [
        {
            "review_text": "Another example of great VR where the entire game works well within a small space.  The first time I was put down onto the runway to put out a fire, it felt more real than anything else I've played so far.",
            "review_score": "1"
        },
        {
            "review_text": "This plays much like Flight control but in VR. It is much more fun than the iPad version since you can zoom into the ground level and put out fires and scare pidgeons",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. Looks good and has more depth than I expected. Still a bit pricey at $30.",
            "review_score": "1"
        },
        {
            "review_text": "When I was a kid, my friends and I would fly die-cast toy fighters around the house, dogfighting according to a set of rules that were never made explicit but which we followed nonetheless. We would tear around the room, banking to avoid the lamp, calling our shots when they seemed likely to result in a kill. The later stages of Final Approach brought those memories back to me for the first time in thirty years. Trying to get my little F-16s away from pursuing UFOs, banking hard and launching a missle at just the right moment... it makes me feel like a kid again. Thanks, devs.  10/10 Would be an 8-year-old again  P.s. Devs, I would pay for good DLC for this game. New levels, new missions, new models, etc.",
            "review_score": "1"
        },
        {
            "review_text": "More fun that you would thing, works very well in room scale VR.",
            "review_score": "1"
        },
        {
            "review_text": "Very solid offering in VR, one of the most complete games out there. A good value because as of this time (7/15/16) if you buy it, you get the seated Final Approach pilot edition as well, which while similar puts a whole new twist of allowing you to actually pilot the planes. I look at it as a whole package let’s call it Final Approach :Definitive Edition.   I still like the room scale version better though, it’s such a kick to go stomping around the airports like some kind of giant, plucking planes and helos out of the sky to do your bidding.   The game itself is an Air Traffic control sim, but takes a more arcade approach to it, you aren't just staring at a screen spitting out call signs and tail numbers. You are right in the midst of the action, creating flight paths, rescuing planes that need an emergency landing. You will also tackle a variety of other aviation related tasks, from being zoomed down to ground view to put out fires, or scare away birds on the run way with an air horn, and later there’s even more stuff to do, taxing airliners to their terminals, sending others of to get repaired, picking up cargo with a helicopter, ferrying around works to work sites to improve the terminal. There's even more but I haven’t got to it yet.   All in all I'd say 8.5 out of 10 During a time when it seems like most of what you find are overblown tech demos, or repetition of decent idea (Do we really need another Zombie wave fighter?) Final Approach manages to stand out as full bodied product and even if you don't have a special interest in aviation this game is well worth checking out. ",
            "review_score": "1"
        },
        {
            "review_text": "Be a giant flight controller managing his airport from his birdeye view giving flight paths with his giant hand to the small toy like planes and personnel, completing different tasks and minigames.  I have a lot of good things to say about this game. The storyline of the game is really good and well made with a lot of different tasks to complete, as one of the few VR games i have played, this one actually have a story mode that seems to go beyond just 1-2 hours of gameplay and this is for me a very good thing and something i hope to see more off in the future of VR (and looking on upcoming titles it will happen) There is different airports and urban settings you can play in all with their own sets of missions and minigames.  Controls are intuitive. prize contra gameplay, i would say this is worth it. ",
            "review_score": "1"
        },
        {
            "review_text": "One of the top 3 Vive games at the moment. The other 2 are great and all, but are taxing and you need to be in the mood to play it. This game isn't that. While at times it can get hectic, controlling planes, putting out fires, shooting things, etc.. for the most part, it is just a relaxing, enjoyable game.   Controlling planes from above, like a god, to then jump down and putting out fires, like a person on the ground, adds so much to this game. Sometimes, even though you are in the middle of a game, you just stop look around at the minature firemen putting our crashed plane wreckage fires and smile. Or maybe your shooting a UFO into pieces that is right above you.   Did I mention that jumping down onto the runway to scare off birds when a plane lands or takes off has caused many a person I demo this game to, to scream and jump? Anyway.. yes.. a really great game and one I'm very honored to have been able to enjoy and play. I highly recommended it!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Like many others I thought this was simply a 3D version of the tablet game of landing planes. But the amount of detail and care that went into this game is apparent right from the start. It's a simple concept but wonderfully executed and there is a surprising amount of depth. This is one of the must have games of early VR.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best HTC Vive games with perfect used of tracked motion controllers and room-scale. Everything was thinked for the Vive.   Pros: - Very great music - Very good use of motion controllers - Very good use of room-scale - You can move your head to see things closer - Free new game mode (Pilot Approach) - Very good game design - Good variety - First person view for other tasks (like mini-game)  Cons: - You can finish the game (Final Approach) within 3-5 hours  - The number of maps is limited (but change between challenges)",
            "review_score": "1"
        },
        {
            "review_text": "Get to throw baggage on the wrong plane by 'accident' - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun. Its like being a little kid with the best toy in the world.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful visuals, amusing narration and amazingly detailed.   One of my favourite VR titles yet.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome VR Game.  Looks stunning and plays well and is very enjoyable to play.  This is a bit of a benchmark Me thinks on VR. The text is clean and crisp, easy to read.   Good Job Devs",
            "review_score": "1"
        },
        {
            "review_text": "This is not 'Just 'Flight Control' in 3D'.   I thought that too, and even though it's mostly true, such a description is VASTLY underselling this game. For starters, you're underestimating how much depth adds to the experience, now you need to consider where the plane is in 3D space as well as what approach angle you've drawn, as planes can't turn on a dime.  There's also a lot more depth than Flight Control. You're doing far more than simply landing planes, you also need to take them off too, which requires you to pay attention and make sure there's a clear run. Different planes also have different requirements, passenger planes need to be taken to the terminal before they can take off again and military planes need to go to the military hanger before take-off. There's also things like emergencies that require you to personally extinguish a burning plane or simply help out with luggage sorting.   In later stages, you do more than just land planes. You might be piloting a helicopter to catch a criminal and drop them off at the police station or fighting UFOs with fighter jets and turrets (which you can also personally control in first person view.  And finally, the game has a loving level of attention to detail in the visuals. They're not just well-made but despite the zoomed-out view of the game, there's still lots of little details to see if you come in close. The whole game feels like you're looking at a little model railroad! It's a big departure from similar games that cut corners because they figure you probably won't see it.  So yeah, Final Approach is a great game, it's had a lot of attention and polish applied that fits it's 'premium' price. If you're passing on it because you think its quality and depth will be that of a mobile game, you're sorely mistaken!",
            "review_score": "1"
        },
        {
            "review_text": "This is great, you have a fully working toy airport to control around you. As a kid I would have adored this, and as an adult I still do. It's a great challenge to keep on top of all the planes flying around you and manage their demands. Defintely worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best proper game for the vive so far.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, worth the purchase!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most fun and addicting games I have played in VR to date. It was actually one of the games I played on a demo Vive Pre that convinced me to preorder it.  Usually I don't write a whole lot of reviews but after getting further along in this game, I feel that I really need to offer it. This is especially because this game gets a whole lot better as you move along. The progress of the game allows you to learn and pick up skills. Then it gets a lot more intense.  You start by directing slow aircraft on an island. Then you move up to a commercial airport. Then you direct helicopters in the middle of a metropolis.  The last stage I played convinced me to write this review. You get to direct fighter aircraft to land on an aircraft carrier! In every stage you are able to get to the ground level to put out fires. This includes fires on aircraft. So, I actually got to stand on an aircraft carrier as a full-sized naval fighter jet taxied past me. I felt like I could actually touch the sidewinder missiles! I looked to the left to see ground crew prepping or repairing other fighters.  There are some other incredibly fun things you can do in this stage but I think I have already provided enough spoilers!  Get this game. It is beautiful, complete, and intense!",
            "review_score": "1"
        },
        {
            "review_text": "I friggin love this game! The scale is absolutely perfect and the ground missions give it some great perspective to the world.   There are some dropped frame issues in the more complex maps so hopefully that'll eventually get better. Still recommend for all ages!",
            "review_score": "1"
        },
        {
            "review_text": "I'll admit I had low expectations, but this game blew me away. The tiny planes flying around your head are incredibly cute, and the gameplay is surprisingly fun and challenging. I'm only a few missions in, but the variety so far has been quite good, and replayability is very high. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game. I was unsure of buying it for awhile. The store pictures do not do it justice. It feels like you're playing with model toys.",
            "review_score": "1"
        },
        {
            "review_text": "good funny game . waiting for updates",
            "review_score": "1"
        },
        {
            "review_text": "  Final Approach VR gets 5 stars on our Budget PC with the MSI RX-480. It’s smooth, clear and extremely detailed. By far the most detailed and in depth game we’ve played in VR on our HTC Vive. I was pleasantly surprised of the amazing performance of the Budget PC in this game. It had no lost frames and little to no reprojection at all. Moving the install location and save locations of my video files might have illiminated reproject 100% in our video but I felt that this was not needed as it didn’t affect gameplay at all. Final Approach is a must-have for any HTV Vive owner.",
            "review_score": "1"
        },
        {
            "review_text": "absolutley NOT WORTH THE PRICE! after literally 30 secs into the game, youve seen all it has to offer. while visually pleasing, you wont be happy with simply guiding planes down, scaring off birds or putting out fires. this game (and its a strecth to call it that) should be priced at 5$ to encourage people to at least try it. but seriously, this isnt a game.",
            "review_score": "-1"
        }
    ]
}