{
    "app_id": 380750,
    "name": "Anima Gate of Memories",
    "release_date": "2016-06-02",
    "developer": [
        "Anima Project"
    ],
    "publisher": [
        "BadLand Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Adventure"
    ],
    "achievements": 25,
    "positive_ratings": 338,
    "negative_ratings": 151,
    "price": 14.99,
    "description": "Anima Gate of Memories is a third person action RPG that tells the story of two beings bound by an unwilling pact, an ancient monster and a girl who lost her past... Anima is mostly focused on combat and exploration, but it also has deep roleplaying elements.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/380750/header.jpg?t=1527530798",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core processor Memory: 4 GB RAM Graphics: Compatible with DirectX9 with 512 MB RAM or better (NVIDIA GeForce GTX 460 / ATI Radeon HD 5850 ) DirectX: Version 9.0c Storage: 6 GB available space",
    "recommended_requirements": "OS: Windows 7 or newer Processor: Quad core processor Memory: 4 GB RAM DirectX: Version 9.0c Storage: 6 GB available space",
    "reviews": [
        {
            "review_text": "I've played about 5 hours of the game, and here's what I think:  The bad. The Voice acting. It's all over the place and very little of it is good. It's tolerable, sure, but it could have been so much better. The combat is kind of dull. I really dug the idea of switching back and forth between the characters, but untill I have the chance to unlock the later tiers of abilities, I don't know how fun that will actually be.  The good. The music is wonderful and fits the atmosphere of the various areas perfectly. The overall setting and atmosphere of the game is wonderfully presented. The story is familiar enough to ease me into the world of Anima, but unique enough to keep me interested.  Overall, this is a good, if just shy of great, game. There's some slight technical issues that I'd like to see addressed. (Why can't I use the D pad in menus on my 360 controller?) but they are annoyances, and nothing too serious.   I'd say, if you want to try a bizzare cross between and older Devil May Cry game and a traditional JRPG, this is worth $20.",
            "review_score": "1"
        },
        {
            "review_text": "I have a lot of opinions on this game, as you can see I have spent quite sometime with it.  Pros:  Deep story- If you are looking for a game with deep, rich, story this game is no different. Many of the secrets and extras will require you to go through the lore. Original enemies- all of the mobs are great. none of them are too similiar to the others and the bosses are always unique in some way Decisions- This game is very decision based, mostly everything you do will effect you in some way. Side-quests- the side quests are always extremely rewarding, they always give a reason why you should finish it. Puzzles- All the puzzles in this game are truly unique, and leave you with a nice sense of acomplishment.  But with all good things, it'll always have some bad.  Cons: Undodgeable attacks- This game will ♥♥♥♥ with your head. Many times it will leave you shouting, 'how in the ♥♥♥♥ did that hit me.' honestly, it infuriates me sometimes. i even broke my mouse over it. Grinding- The leveling system itself it pretty standard, get XP, lvl up, choose a skill, repeat. But many times through this game, you're gonna have to go back and grind for a while. (this may be a bit nit-picky, but as a guy who likes to just run through all the story, i had trouble with this)  Voice-acting- Now, understandably, this is a Indie game so of course the voice-acting isnt the greatest, but the actors are obviously trying their bests to stay in character.  I'm not a game reviewer, i usually try to find the best in games. But after countless yelled profanities and breaking of my mouse. i felt i had to say somethings. The game is far from perfect, but it has really nice qualities that will keep you invested and always wanting to play more. That is, if you don't rage-quit first.",
            "review_score": "1"
        },
        {
            "review_text": "Despite some bugs, none game breaking, and some occasional balance issues, this is a good game, with a very appealing artistic direction, great soundtrack, and a story which does not start very strong but builds up pretty finely over the course of the game. The game isn't all shiny though. The voice acting, overall, is quite weak, although some character do stand out of the bunch positively, and the gameplay can be a frustrating mess sometimes as you will be ganked a lot, and have to deal with quite a lot of projectile spamming. The moves of the characters are pretty flashy and satisfying to use, although they do feel too similar until you unlocked the more high level skills. There is a certain lack of balance among those skills too, as some skills will be your bread and butter, while others are mostly useless. The final areas of the game are a bit underwhelming in my opinion, however, if you are interested in lore and intrigue, you will want to keep going anyway.  In regard to gameplay, the game is more DMC than Dark Souls, and shares with both games a certain emphasis on boss battles. The game can be challenging at times, although a large part of said challenge depends on whether you managed to identify and unlock the most useful skills or not, You cannot count on invincibility frames a lot, the timing to dodge attacks isn't always intuitive, and bosses can get spammy and usually don't have much in the way of recovery frames, which means that if you are not careful, damage can add up very fast. This does not mean that you can play too defensively either, though, as bosses have a dazzling amount of health points. Fights can drag on and on, which is a good thing since it encourages you to learn patterns rather than to rely on a lucky break, but can be gratting when you finally have have a boss' patterns down, and yet the fight drags on because their health lowers agonizingly slow. A certain boss, who likes to pay you a visit several times with little change to his move set, certainly must have a sore ♥♥♥♥ by now. Another thing that I found disappointing, in regard to bosses, is that most of them, being very quick but also easy to combo, encourage you to throw your wide selection of skills out the window and beat them down with just dashes, dodges, and basic attack combos. Of course, the blame is less on the bosses themselves, and more on the wide range of skills which are just painfully slow, even when comboed. Definitely not a good fit for the 'spammy attitude' of most bosses.  In the end, it is a pretty good game as it does most things decently, and a few things very good. It sure helps that it comes from an already fully developped and complex fantasy universe, that of Anima, the tabletop RPG.  If you come only for the gameplay, you might be disappointed, but if you like the Anima franchise, a good over the top fantasy universe, or, hu... 'anime fantasy'?, you should have a good time!",
            "review_score": "1"
        },
        {
            "review_text": "  If Steam had a rating between a yes and no that is probably what I would give Anima Gate of Memories. I ended up giving the game a recommended rating since the game has a few more positives then negatives. There are a lot of things I like about the game but at the same time there are a lot of things that I think could have been improved. For everything that the game does well, there is an associated negative.    I thought the combat was pretty fun but at times it feels a little clunky and gets repetitive.    The jumping mechanics do fine during combat but really suffer when you actually have to do some platforming. Thankfully the game doesn't have a lot of platforming.   The story is interesting and well developed but is kind of confusing at times since it tends to throw a lot at you all at once.   The idea of having two different characters with special abilities that you can switch between is a cool idea. The two characters are pretty similar though so you pretty much end up turning one into your magic character and the other into your melee character.   The graphics are quite good for the most part. For some reason the cutscenes are only somewhat animated though which includes the character's mouths not moving when they talk.   Overall Anima Gate of Memories is a fun game. The game has quite a few issues though that keep it from being a good to great game. If the theme really interests you it is probably worth picking up right away. Otherwise I would wait for the game to go on sale.  Check out my full review on   Geeky Hobbies  [www.geekyhobbies.com] ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so, so, so pretty. That part alone almost makes up for all the other failures. Almost...  I was a backer of this game, and let me tell you, with a two years delay and the amount of money they got, I was expecting so much more. The story takes a while to get into, the voice acting physically hurts my ears and the combat is meh. It doesn't make you care about the characters at all, and the RPG aspect is pretty weak. And boy, is it pretentious, with it's complicating sounding names and cliche mythology.   Extra complaint: The dialog between characters switches constantly from a fixed 2D portrait of them talking (like a dating sim) to a pseudo animation in 3D that only shows the end frames. Yeah, it's a minor issues, but the inconsistency is driving me up the wall.   I'd give it a 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "A controller is probably recommended over KB and if you rebind anything it will still show the default in the tooltips leaving you pushing random buttons till one advances the game. As a lefty I find this annoying, but it doesn't detract any points.  The combat is pretty fun and you unlock more stuff as you level with a skill tree. About the only thing worth complaining about is the voice acting. Think house of the dead but the games trying to be serious not funny/meta. The second controllable character is also a creep. They way he keeps saying baby to the main character is unsettling but probably due to bad VA/translation, though im also not that far into the story.  Overall the games solid. Nothing to gush about, but it's not bad either. I look forward to finishing this one.  WouldBuyAgain/10",
            "review_score": "1"
        },
        {
            "review_text": "i thought it would be an interesting game and be a little fun, but it isnt. the controls feel clunky and it partly displays the xbox buttons. the voice acting is terrible that you can actually hear the background of the studio and the actors dont sound convincing at all. more like speaking really loudly or bored in to the microphone. the combat is repetitive and the same type and amount of enemies would appear every single time when you reach the same place, without fail. story isnt compelling either that you simply ignore it.  the levels are at times really nice but thats pretty much it.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall nice ARPG althought it could have benefitted from a bit more tutorial information.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this to play on the pc and it seems you cannot play it on the pc with a mouse. It shows things not on the pc or mouse and gets stuck at the first thing you find.",
            "review_score": "-1"
        },
        {
            "review_text": "Found the game lacked focus, and real no clear direction of where to go at any given point. So I was utterly confused, it felt at times like it wanted to be part of the 'Tales' series but unfortunately did a poor job of even emulating that charm of those games.",
            "review_score": "-1"
        },
        {
            "review_text": "Alright so this game looks real good.. it's not though, I'm gonna try to list the most annoying things I found.  -Weird camera antics; ♥♥♥♥. Like, really. The camera is awful, especially when you're locked on to enemies. During the first boss fight you get locked on an overhead view that makes the already bad combat and light-speed projectile dodging even worse.  -Stun-locking; Combat in general is dull and terrible unless you wanna talk about the enemies which can and will stun-lock you if allowed to. They'll often shoot you off ledges and falling off a ledge takes off a chunk of your health.  -Awful 3D platforming with respawning enemies, if you get kicked off a ledge, and you will, because no matter how much you dodge you're not actually invincible. Ever. The character switching doesn't do jack ♥♥♥♥ because they're both exactly the same, by the way.  -Terrible voice acting... I'm not eve- This is worse than PS1 level voice acting. Resident Evil had better voice acting, seriously. The story itself is also pretentious as ♥♥♥♥ and both the main characters are unlikeable as ♥♥♥♥ and stupid angst balls.  -Awful unblockable/undodgeable boss attacks, alright so I played enough to get to the first boss, yeah? And... I quit. Why? You can't dodge her garbage light-speed ♥♥♥♥. Especially when she decides to spawn enemies in and keep shooting at you while the camera hovers above you and ♥♥♥♥s your controls.  -And all in the first half hour. I didn't play that long, I don't care to. A game that is this bad in the first half hour doesn't deserve the benefit of the doubt because all doubts are already extinguished by the time you reach the first boss.  I had this on my wishlist for a while now and this is just disappointing.  No thank you. Refund please.",
            "review_score": "-1"
        },
        {
            "review_text": "  This game is a really good RPG. It has great plot and simple yet awesome gameplay and skill tree,the story it self really blown my mind.The gameplay is pretty casual with simple skill use and not hard game difficulty",
            "review_score": "1"
        }
    ]
}