{
    "app_id": 380840,
    "name": "Teeworlds",
    "release_date": "2015-08-24",
    "developer": [
        "Teeworlds Team"
    ],
    "publisher": [
        "Teeworlds Team"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "Cross-Platform Multiplayer",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Multiplayer",
        "2D"
    ],
    "achievements": 0,
    "positive_ratings": 3104,
    "negative_ratings": 415,
    "price": 0.0,
    "description": "Teeworlds is a free online multiplayer game, available for all major operating systems. Battle with up to 16 players in a variety of game modes, including Team Deathmatch and Capture The Flag. You can even design your own maps!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/380840/header.jpg?t=1479069708",
    "minimum_requirements": "최소: 운영체제: Microsoft® Windows® XP or newer 프로세서: 1.4GHz or faster 메모리: 512 MB RAM 저장공간: 10 MB 사용 가능 공간",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Runs at 100 fps on my toaster. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is game is simple and awesome but god damn.... My Friends and I played this for 1 hour straight with melee only and wew...my right hand(fingers) got a workout better than masturbating i can tell you that. 10/10 would MAYBE play again.",
            "review_score": "1"
        },
        {
            "review_text": "It's the smallest game data-wise (9 MB). And the most fun you can have with such a small game, and to top it off, It's Free to Play, and so far no micro-transactions needed. This game is basically a 2 teamed (Red and Blue) capture the flag game, With the character styles looking like red and blue Kirbies. There are a range of weapons, but i'm sure they'll add more.  So, in conclusion: This game is like what would happen if TF2 and Kirby had sex, and that baby ♥♥♥♥ed capture the flag, YOU'D GET THIS AS THE ABORTED CHILD WHO LIVED.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a gem among gems. Without Teeworlds, I would have nothing left in my frail soul. This game is another one of those 'easy to play, hard to master' kind of games. The competitive side of this game is extreme and forces you to push beyond your limit to win. Teeworlds will be featured at Evo 2016 (at the time I'm writing this, Evo 2016 has not yet begun.) This game is more difficult and challenging than games like 'The Hardest Game' on  coolmathgames.com  . If you're ready to push yourself to the limit, than look no further than the magnificent gem of the gaming industry known as 'Teeworlds.'",
            "review_score": "1"
        },
        {
            "review_text": "A fun, chaotic, and adorable little game. Definitely taking a closer look at the devs!",
            "review_score": "1"
        },
        {
            "review_text": "This is SFMGKS...  Simplistic Fastpaced Multi-weapon Grapple Kirby Simulator  and I approve of this game",
            "review_score": "1"
        },
        {
            "review_text": "...oh my god. i had no idea that it was POSSIBLE for a game to run at 1000 fps but this game does! ON A LAPTOP!",
            "review_score": "1"
        },
        {
            "review_text": "Nice and free game",
            "review_score": "1"
        },
        {
            "review_text": "Yeah my time played is very low. That's because that before the release, I put dozens and dozens of hours into this adorable thing.  This open-source game is basically 2D Q3A with lots of content from the community. Lots of maps, lots of fun. It's very easy to pick up, too. At least give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "It's very simple and good game,you can master it by one month or never :D Depends on you! If you like vanilla or not,try also mods for this game they are awesome! DDrace:Cooperate with team to complete level! OpenFNG : Freeze your emenies and kill then by spikes!(Why?For the gods ofc!) ",
            "review_score": "1"
        },
        {
            "review_text": "2D multiplayer tee mayhem!  I spent many hours on this years ago. If you liked Soldat or Liero, you should like this one as well. Plenty of fun for casuals and multiplayer hardcores alike! Just be ready for plenty of action aimed clicking!  Come and smash some tees with a hammer already!",
            "review_score": "1"
        },
        {
            "review_text": "this game was ♥♥♥♥ing amazing. get this game or your a ♥♥♥♥♥♥. pls get this game. teeto wants u to get this game. this game is betting than playing ranked league of legends any day. who needs plat when u have tee,",
            "review_score": "1"
        },
        {
            "review_text": "Dual monitors, upon startup, it stretched itself across both monitors, and since one monitor is half the size of the other, I couldn't see anything. I managed to scramble to the settings and fix it thankfully.  As for the game, I smashed a bunch of people with a wooden mallet and shot them with a shooty-pistol-thing. This is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games on Steam. And it is free as free speech AND free beer.",
            "review_score": "1"
        },
        {
            "review_text": "a very good quick time game ",
            "review_score": "1"
        },
        {
            "review_text": "The rocket launcher is a BLAST to use! But in all seriousness the game is RELOADS of fun... Ok i'm done this game gets a 9/10 becuase it's really fun but no crafty puns.  ",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best free to play game on steam. Already played years ago when it wasnt on steam and have countless hours put into this. It has a very high skill cap and if you get bored from the vanilla game modes, there are dozens of others which are very fun like DDRace (best imo). Amazingly fun with friends. Go check it out.",
            "review_score": "1"
        },
        {
            "review_text": "(I'm playing since at least 2010 if not even earlier, don't mind Steam playtime.)  I'm not going to write something long here, because there's nothing long to write : Teeworlds may be the only game ever that has little to no flaws.      A simple yet clear and attractive art style     Easy to pick up and understand, hard to master     Fun no matter if you're totally new or a competitive veteran player     Hundreds of different possible playstyles     Heavily moddable     Any toaster can run it and it's super light     And now, it's on Steam !  The only flaw I know of is that it doesn't have music, and you can just put your own when you're playing anyway, so yeah, it's pretty much the perfect game.  ",
            "review_score": "1"
        },
        {
            "review_text": "If anyone wants to have fun, this is your game. Its so addicting. and the fact that it a super quick download, makes it even more incredible. overallthis is the funnest gamer ever",
            "review_score": "1"
        },
        {
            "review_text": "A fast placed F2P skill-based 2D platform shooter game, with no gun modifications (= equality)  You can find Death Match, Team Death Match, Race, and other game modes.  It's an old game, but still a lot of people are playing it, there are some really cool servers and custom maps  Absolutely worth to download that 7 MB (Yes, 7.)",
            "review_score": "1"
        },
        {
            "review_text": "Easy to learn, hard to octopus.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fast paced, fun, entertaining, and REALLY great as a pass-time. 10/10 would suggest to a friend, playing solo listing to music is fun, I haven't tried playing with friends yet, but shouldn't be too hard and it should be fun xD",
            "review_score": "1"
        },
        {
            "review_text": "im glad that this game came to steam a while ago. i was always hoping to see it here one day. this game gives me some good childhood memories. i downloaded the client back then from the official homepage and i always had a copy of it on my USB stick with all my PC drivers and stuff like that, so i played this every time i had to set up my computer  here some things:  - it's free  - it's fun - good time killer  10/10 for good vibes, just download it and try it out...it's just a few MB",
            "review_score": "1"
        },
        {
            "review_text": "i want more games",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game to play!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, I did actually dedicate over 5 hours of my life for this game. Why did I get it? Because it looked kinda fun and is smaller than Jacob Sartorius' ♥♥♥♥. But what I got was not a crappy ftp game, it was the best game, no, the best THING ever created by humankind. 420/690 -sos",
            "review_score": "1"
        },
        {
            "review_text": "if ur a nerd and wanna 'hang out' this is the game for u",
            "review_score": "1"
        },
        {
            "review_text": "I like this game its awesome and you should try it out!  Fun and awesome!  You can change your tee's color so yeah.  I rate 8/10",
            "review_score": "1"
        },
        {
            "review_text": "this was a great subsitute for planet robobot",
            "review_score": "1"
        },
        {
            "review_text": "Very very fun, time killing game. Reminds me a lot of some of the games back in the day on Miniclip if any of you are old enough to remember that website. Fast download, fast install, and was playing it within minutes. It's definitely worth at least trying out!",
            "review_score": "1"
        },
        {
            "review_text": "this game is AMAZING!!! But!...  ONE- too good! make it cost money. TWO- TOO MUCH LAG, ON TOO MUCH SERVERS!!!!!!!!!!!!!!!!!!!!!!!!! THREE-ummmmmmmmmmmmmmmm, i forgot FOUR-i only got to play one server that didn't lag and suck A$$!!!!!!!! FIVE- still love it! &lt;3 ;3 SIX- fix mallet. too OP! DONE F*($#@!!!!!!!!!!!!!!    um can i go now? ok, thanks! ",
            "review_score": "1"
        },
        {
            "review_text": "It's fun for a short amount of time, but after that you don't really find yourself coming back.",
            "review_score": "-1"
        },
        {
            "review_text": "DA LAG!!!!! SO MUCH LAG... it could be a cool game but its unpossible to play because of DA LAG!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "This game should be rated M for Morons. 10/10 Would not rate again ",
            "review_score": "-1"
        },
        {
            "review_text": "  Wasted my disk space for this..",
            "review_score": "-1"
        },
        {
            "review_text": "its ok but i found it a bit ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Ultra simple gameplay that anyone can grasp but the fast pace can keep you entertained. Simple CTF with nearly no harddrive space taken up...but honestly thats it. The game has no depth and the server based play looks and feels like counter strike of old; lots of choices, most of them empty, all of them laggy as the host.  Great game. Deserves to be free.",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad perfomance. Playing games like Metal Gear Solid V smooth but this medium pixel game works really slow, in and out game.   No tutorial.  If you want to waste 10 minutes installing, getting ♥♥♥♥♥♥ and unistalling go for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A bit laggy, and half baked game overall. fun for about thirty minutes. p33s 0f ****ing bol****",
            "review_score": "-1"
        },
        {
            "review_text": "worst kirby i've ever play",
            "review_score": "-1"
        },
        {
            "review_text": "Fun oldschool game, too bad it's full of hackers.",
            "review_score": "-1"
        },
        {
            "review_text": "HORRIBLE GAME I MEAN WHAT THE HECK TERRIBLE OMG DONT GET THIS GAME BAD BAD BAD.................................thats all i have to say.",
            "review_score": "-1"
        },
        {
            "review_text": "Have been playing this game since it's non-Steam release. Weapons didnt change. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "very nice side scroller has no problems runs great",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay, Had a lot of fun. The game is lacking maps gamemodes and weaponds, but the overall game is great.  Great game, 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and the katana is OP!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun, I cant get enough of it. And have 30 Frames per second on a very low-spec PC makes this game so perfect!!",
            "review_score": "1"
        },
        {
            "review_text": "you dont need any skill to play this game thats why I like it(:",
            "review_score": "1"
        },
        {
            "review_text": "This game would have been my jam if I had known about it back in the mid to late 2000's with my crummy old XP computer. Chances are, this game might be my jam now.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game it's easy for starters to get used to. I won in my first game!",
            "review_score": "1"
        },
        {
            "review_text": "What the rest of the Kirby race is doing.",
            "review_score": "1"
        },
        {
            "review_text": "Teeworlds is actually a very fun game to play. The game's graphics is simple, allowing most PCs to run the game without having to install advanced graphic cards (e.g. Nvidia/ATI Radeon). Also, the game file is very small, (about 9 MB), allowing users to download the game for only a short period of time. The game engine is based on game engines used to make online 2D platformer games (e.g. Plazma Burst 2/Raze); so, the game shouldn't be hard to play. What this game is needs right now is more players, more weapons, more maps (maybe?) and of course, what we all love so much, Hats. Lovely, beautiful hats for the characters to wear. But other than that, I HIGHLY recommend this game for others to try out.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game , nice work !",
            "review_score": "1"
        },
        {
            "review_text": "This game is a kirby deathmatch!",
            "review_score": "1"
        },
        {
            "review_text": "This is my first time posting a review... and i have got to say that this game is sooooo fun to play. First you are a kirby kind of who fights to get the highest score and you shoot to kill and all of that stuff. Amazing Game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, I've been playing this game when we all were child... I remember those IT lessons when everyone was playing this and I and my friend was ones of the best.. Yeah, I'm really glad this game came here, I hope there will come more new players so we everyone can train on somebody :D",
            "review_score": "1"
        },
        {
            "review_text": "Playing it before it was mainsteam. Get it mainSTEAM (hehe)",
            "review_score": "1"
        },
        {
            "review_text": "At The Beginning Of This Game 'OH! 7MB Game :D' 'I Think I Can Run It On My 2GB RAM Laptop' Installed The Game Loading Screen glitch reopen the game glitch reopen the game Choose Language Choose A 14/16 Server lOading Run Get Shotgun Shoot Lag Miss The Shoot And Get Shooted By Someone By Rocket Launcher Died Run 'Oh, Left Click Is The ♥♥♥♥ing Rope, I Mean Chain' Pulled Someone Lag Miss It Get Killed Again DIED DIED Died  10/10 Get Killed Again    Meet A Bot Challenge Him The Bot Win Collecting Shield Challenge Him Again Shoot It With Shotgun 3 Stars He Shoot Me With The Blue ♥♥♥♥ing Laser Critical Hit Run Shooted Again By Laser Died Challenge Him He Is On Low Health Shoot Him With Regular Gun Win  10/10 Meet Bot Again",
            "review_score": "1"
        },
        {
            "review_text": "I was swinging like crazy...feeling unstoppable. But I died.  10/10. Even tho I haven't played that much.",
            "review_score": "1"
        },
        {
            "review_text": "Teeworlds is an multiplayer, 2D game that requires some skill. The game has a lot of players on it to fight or have fun. There are many different game types such as DDrace, CTF ( Capture The Flag ), DM ( Deathmatch ), TDM ( Team Death Match ), and many more. You can create your sever and make your own level to share with your friends. The most amazing part is you can download your own skin or someone else and play as a different tee. Overall, this game is amazing and recommend you try it for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to pick up and play and can run well on laptops and netbooks so if your bored on the go its the perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing. it's hard to quantify, but this game will either make you feel like an idiot for dieing, or a ♥♥♥♥♥♥♥ champion for anything else.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is a Super Fun and Adicting Game i Defenitely recomend this game!!!!!!! Beacause its awsome!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Having trouble finding the make a map thing but otherwise a epic game!",
            "review_score": "1"
        },
        {
            "review_text": "good community  i named myself 'a snail'  10 minutes later we started the church of the snail",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game overall but i can't open it anymire because 'Failed to open autoexec.cfg'",
            "review_score": "1"
        },
        {
            "review_text": "Not a complete game just unorganized randomness",
            "review_score": "-1"
        },
        {
            "review_text": "Playing it sice 2010, Plyed atleast 500 hours off steam, ill now play it another 500 more.",
            "review_score": "1"
        },
        {
            "review_text": "this is Perfect 9/10 but i recommend ddnet (Non steam)",
            "review_score": "1"
        },
        {
            "review_text": "im a scrub okami dragonfly is better than me at this game",
            "review_score": "1"
        },
        {
            "review_text": "The best free game on Steam. :) Endless fun, amazing! I rate this a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure, unadulterated, visceral fun. 'Tis probably best to play over a LAN with your friends, as this will allow for the most pleasurable experience. If you do this, you'll know fun like you've never known before. 11/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Better than most games",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game for co-op with friends, it will test you to see if ur friends are good friends or best friends XD.",
            "review_score": "1"
        },
        {
            "review_text": "knockoff kirby deathmatch simulator ft. skorpion from mortal kombat",
            "review_score": "1"
        },
        {
            "review_text": "Very Good Game !!!",
            "review_score": "1"
        },
        {
            "review_text": "Cool , its on Steam now. Played years ago. To badly that there are no instagib servers atm",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun fastpaced 2d shooter,the creator is quite difficult to learn how to use but once you find out how you can make some pretty cool levels",
            "review_score": "1"
        },
        {
            "review_text": "Great game a mix of a cartoon shooter and mmo and funny at the same time",
            "review_score": "1"
        },
        {
            "review_text": "Used it for LAN gaming yearss ago and I find it again years later here on steam still being worked on. Free to play, as fast paced as you want it, runs on even the cheapest toaster with excellent linux support. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "teeketa 1 deathmatch is banning me for no reason",
            "review_score": "1"
        },
        {
            "review_text": "This game can be fun if the sever you enter has an OK ping so my preference on this game is no I do not particularly like this game",
            "review_score": "-1"
        },
        {
            "review_text": "Dragging my friends to their deaths via grappling hook       10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. 420/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game Once you get throught all the ♥♥♥♥ers that think they're pro by throwing you into the water in parkour maps, It's just ♥♥♥♥ing annoying how they try and say they're pro when you can't even play the game because of them. 'You gotta get better than me then you won't have a problem with this map'",
            "review_score": "-1"
        },
        {
            "review_text": "Glitched out, I can't see my mouse and its zoomed in so I can't change settings resolution, plz fix, I also saw when I pressed windows key to get out, I saw the commands that said 'settings=failed to load' or something like that, so plz I would love it if you fixed it, I used to play this game btw, and I like it, so plz fix...",
            "review_score": "1"
        },
        {
            "review_text": " YOU CAN GRAB PEOPLE  Rate it 9/10  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually fun to play with friends, Specially completing racing levels, I liked that game thought I played only 5.5 Hours. Then I deleted it, And im getting it once again, I recommend this game if you'd like to have FUN! :D",
            "review_score": "1"
        },
        {
            "review_text": "Played this game before it avaliable on steam. (It's an open source game :) ) Fast pact shooter + 2d side scroller =&gt; Awesome~ . ps. (Can handle low end PC)",
            "review_score": "1"
        },
        {
            "review_text": "Better than No Man's Sky.",
            "review_score": "1"
        },
        {
            "review_text": "This game: ( ͡☉ ͜ʖ ͡☉)  Good games: ( ͡° ͜ʖ ͡°)  Other games: ( ͡° ʖ̯ ͡°) 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Great but dosnt last long time. Great for free do!!!",
            "review_score": "1"
        },
        {
            "review_text": "interesting idea for a game I like it that you can play it online with others old fashioned platform game made into an mmo",
            "review_score": "1"
        },
        {
            "review_text": "This game is giving my computer a virus. I am currently in the process of being hackeded. If someone pulls up to my house with a black lambo and puts one in my head, do not download this game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting to play this game for 5 minutes and leave.   I have over 250 hours on this game. I haven't seen the light of day in a few years.",
            "review_score": "1"
        },
        {
            "review_text": "10/10   Play it with your friends, and you will get the point of 'Happy'.  First I see this game i just said 'What is this?'  And i play it with my friends and i just feels 'wow, it's great!'  Damn I will play somemore with my friends.",
            "review_score": "1"
        },
        {
            "review_text": "so fun for just wanting to play a small game instead of triple a titles ",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Fast paced and fun",
            "review_score": "1"
        },
        {
            "review_text": "First saw this game back in 2012, played it with one of my friends for a really long time. We also made some videos, but that's another thing. You can find loads of different game modes in it, but my most favourite ones are DDRace and zCatch. These can be quite entertaining with several other ones as well. The community is (mostly) great, and you can also customize your ,,Tee' in the game, the game has a custom map editor, so you can have fun creating your own. Definitely worth checking out, especially because it is free to play!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game i love it !",
            "review_score": "1"
        },
        {
            "review_text": "it is a little bit like quake  I like it but it feels unfinished so it is fun but still could use more things.",
            "review_score": "1"
        }
    ]
}