{
    "app_id": 3810,
    "name": "BloodRayne",
    "release_date": "2006-09-14",
    "developer": [
        "Terminal Reality"
    ],
    "publisher": [
        "Majesco Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Vampire",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 369,
    "negative_ratings": 110,
    "price": 6.99,
    "description": "In the years between the World Wars, Agent BloodRayne works as a killing machine for The Brimstone Society--a top secret fraternity that hunts down and destroys supernatural threats. Starring heroine Rayne, this original action horror game unleashed the red headed dhampir on the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3810/header.jpg?t=1525292343",
    "minimum_requirements": "Windows 98/2000/XP, 733 MHz processor, 128MB RAM, 200MB virtual memory,  2 GB free hard disc space, DirectX 8.1 or higher (included with game), DirectX compatible sound card, 100% DirectX 8.1 compatible video card, ATI Radeon, GeForce 2 or higher, with Hardware T&amp;L (Transform &amp; Lighting). Excludes GeForce MX and Go series cards. See full list below. Excluded cards: - TnT/TnT 2 - ATI Rage (any kind)  - ATI Radeon VE and Radeon 7000  - ATI Mobility Radeon (original, laptop)  - Kyro 1 &amp; 2 (example, Hercules 3D Prophet 4000/4500)  - any Voodoo card  - any Intel card  - any Matrox card (except the Parhelia)  - any kind of integrated graphics (except the nForce)   Recommended: Windows XP, Pentium 4 2.53 GHz or AMD equivalent, 512 MB RAM, 200MB virtual memory, 2 GB free hard disc space, 64MB nVidia GeForce 3, GeForce 4 Ti or ATI Radeon 8500 video card, DirectX 8.1 or higher (included with game), Sound Blaster Audigy sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Bloodrayne is a third-person, action, hack and slash game that originally came out on October 15, 2002. It's been 11 years since i last played it on the original XBOX. Exploring the levels and meeting all the antagonist and monsters again is really nostalgic. Rayne is the main protagonist in the game. She is a dhampir who is in search of her father; Kaegan. She is later recruited into the Brimstone Society and that is where the game begins.   Story: The story in Bloodrayne is not complex at all. You and your mentor Mynce from the Brimstone Society are sent to Mortton, Lousiana to investigate a disease that is turning humans into mutates. The unique enemy in this act are called Maraisreqs. Not much happens in this act apart from your first boss fight the Queen of the Underworld and your first meet with Jurgen Wulf (The main antagonist) who is the founder of the G.G.G and is trying to become immortal by acquiring powerful relics scattered across the world. The next act takes place 5 years later in Argentina, Rayne is assigned to eliminate several high ranking G.G.G.(Gegengeist Gruppe) officers before they can get ahold of one of the powerful relics. These officers serve as the mini-boss and bosses of the game. Midway through the act a new enemy type is introduced called Daemites. Act III takes place in Germany. Rayne is assinged a new list of G.G.G targets to eliminate. This act also introduces another enemy type called Feral Vampires. I can't put the rest of this act in words without spoiling major parts of the story.  Gameplay: The combat system is plain and repetitive but enjoyable; Rayne's primary weapons are her blades which can do up to a 5 meele combo as long as she makes contact with an enemy. Her secondary weapons are guns. There are about 33 different weapons including Pistols, Rifles, Shotguns, SMGs, Assault Rifles, Dynamite and Grenade Launchers) in the game. She has 8 slots for weapons, 3 for light weapons, 3 for heavy weapons, 1 for grenades and 1 for special weapons. Rayne has 3 unique abilities that she can use, one from the start of the game and two you unlock in Argentina. Aura Sense: Targets and destinations will shine bright blue, Dilated Perception: Slow motion, and Extruded View: Allows you to zoom. The game will take you anywhere from 6-8 hours to complete.  Pros: + Basic but enjoyable combat. + Decent amount of variety. + Great level progression. + Immersing experience. + Rayne's dialogue.  Cons: - Checkpoint system can be an annoyance at times. - Graphics are outdated. - The last few words of all dialogue in cutscenes cuts out. (Fixed by turning V-Sync ON = 30 FPS)  Notes: 'Another man falling to pieces over me.' ― Rayne",
            "review_score": "1"
        },
        {
            "review_text": "Be an agile sexy Vampire girl, suck blood to regenerate health, jump around on killing spree, pounce on nazis &amp; zombies, you will love to shred them to pieces!",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game back in the day. The Steam version is unplayable. It doesn't lock the mouse, so every time you try to attack you actually click outside the game, making the game minimize. Very annoying. Playing with a controller might help. Or I could install additional software to force lock the cursor. But why would I go out of my way when this should be a non-issue for a newly purchased game?",
            "review_score": "-1"
        },
        {
            "review_text": "'It's a mess. It's kind of crappy. It's tacky as all hell. It's the closest I have to a 'guilty pleasure' game. Suck on some Nazis, why don't you?'  Good Sites: +Great climate. +Awesome (redhead) main character!. +ZOMBIES, NAZI and NAZI ZOMBIES!. +Some effective weapons. +AI are good. +Good story for at least 5 hours.  Bad Sites: -Not much weapons. -Some bugs. -Only 3 campaigns and the first one is best.",
            "review_score": "1"
        },
        {
            "review_text": "Good old classic. 8 hours of fun. (A controller highly recommended.) Works almost perfect with Windows 10 and it's surprised me. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Be prepared to spend about an hour trying to get it to work.  When I was able to play it, however, I was really surprised at just how good it looks. Comparable to modern-day MMO graphics, BloodRayne is a brutal hack and slasher that is surprisingly more like a dungeon crawler than you would expect. The gameplay is very repetative, but that doesnt stop it being fun, and I was very impressed with the real-time removal of limbs. The writing and voice acting so far is supurb, really nailing the genre without cheesing it up, and I'm eager to play more.  This game is difficult, however, so you'll need to take certain situations very seriously, namely water. That's right, the only major source of my death so far has been environmental hazards - there are point where you're forced to make your way through flooded areas, which steadily drains your health, and if you're indoors then jumping doesn't help much. This game also features old-school style saving - no quicksaves, only saving at area transitions, which can be quite a chunk of gameplay, especially if you die after a boss. Enemies are generally inconsiquential, unless you're forced to fight an extended number than you can't drain life from, or you encounter a bug that makes them invunerable.  All in all, this is a surprisingly good game. Don't let its age or 'sexiness' fool you, Rayne is a take-control badass that I'd like to see more of in the games industry.",
            "review_score": "1"
        },
        {
            "review_text": "this game brings back so many memories :') &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A little bid dated visuals but still some fun gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Despite some technical issues the game is still great. The price right now is great. Get the other two games.",
            "review_score": "1"
        },
        {
            "review_text": "Good game from its era.",
            "review_score": "1"
        },
        {
            "review_text": "Game did not age well, everything feels floaty, idle animations and active too are hilarious. It does have something, but really hard to play it these days.  If steam allowed neutral this would be neutral.",
            "review_score": "-1"
        },
        {
            "review_text": "Crash on startup.",
            "review_score": "-1"
        },
        {
            "review_text": "Redhead half vampire, killing nazis, zombie/mutants and other monsters... And Rayne's voice actress is the same as Serana from Skyrim... Pretty much everything you need from a vampire game :p",
            "review_score": "1"
        },
        {
            "review_text": "This is a piece of garbage. When I start the game I get four pop-up windows will different error messages and then the game crashes.  The developers might like to take some pride in their work. The people responsible for creating and distributing this game should be ashamed of themselves. In fact, I've discovered that this is a known issue. Continuing to sell the game without fixing the huge problems it has (this game is unplayable, totally) is something pretty close to a sham.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is sucks with Xbox 360 controller so you must play with keyboard and i don't like to play with keyboard so i will give this 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "Let's list some buzz words to get your attention: Blood, violence, vampires, Nazis, mechs and monsters! What more could you ask for? (Oh an a rather sexy female protagonist [or so everyone keeps saying])  Blood Rayne is a third person hack and slash with panache! Featuring large open maps and a (rather annoying) checkpoint save system.   Work for the Brimstone Society; with your shopping list of Nazi officers go off and fill your larders! Using blades, guns, explosives to hunt your prey with vampiric abilities; aura vision, slow motion and fang.  The dialogue is very humourous with Rayne's sarcastic quips, though there is an issue with the last few words often getting cut off.   This is a personal favourite of mine I enjoyed playing years back, I'm glad to be able to experience it all over again. ",
            "review_score": "1"
        },
        {
            "review_text": "Annoyed that I payed for a game that is clearly broken. Crashes on launch, zero help provided for it. Been an issue for years, still no fix. If someone knows how to fix this, please respond!  UPDATE: 1. When you start the game you open taskmanager then go to details tab. 2. Find rayne.exe right-click and set affinity. 3. Deselect all except CPU 0. [/quote]  Works fine now, completly fine now. This game rocks!",
            "review_score": "1"
        },
        {
            "review_text": "CLASSIC GAME WORTH A PLAYTHROUGH.  NOTE: GRENADES ARE BASICALLY KEYS TO CERTAIN DOORS. IF YOU ARE HAVING TROUBLE MOVING FORWARD BREAK SOME BOXES GET SOME GRENADES AND THROW THEM AT DOORS THAT DONT  HAVE THE THIS DOOR IS LOCKED MESSAGE. I HAD TO ROAM A LEVEL FOR 30 MIN DOING RANDOM ♥♥♥♥ TO FIGURE IT OUT!  a very cheesy game full of provocative one lines and short levels about killing nazis (so original lol). its that very cheesy-ness that makes it so enjoyable. its fast paced,blood sucking,nazi killing action. i very much enjoyed the cutscenes. they were very well made and looked awesome, especially the  ending one! i can definitley see this game getting a second playthrough. only complaint would be  the game does not support 1080p even though pc games dated around its time. like half life, do and  opening doors with grenades was never mentioned in the game (unless i missed it). i had to randomly  do that ♥♥♥♥ to figure it out.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of many games of the realy 2000's that was just truly astonishing. This game is a classic hack n slash, which brings you to the 1930's, in the shoes of a Dhampir named Rayne, the sexy heroine in the game, who travels from Louisiana, Argentina and Germany, eliminating bizzare vampires and monsters for the Brimstone Society. Under all this, she is searching for her father, which more unfolds about that in the sequel.  This game brings brilliant, fast paced and accurate gameplay with lots of gore, guns and different attacks. Each act (three all up) bring you different strains of monsters with their own back story, each act holds their own little story, everything begins to unfold by end Act II and all Act III.  I have read that a lot of people dislike this game, what ever reason that is, I think that is bogus, because this game just bring so many cool things to the table. One of the many cool things is a boss battle, in giant, armored robots firing rockets and grenades. For me I have to say that this game has aged well, and somewhat has a cult following. The games alone spawned a trilogy of movies (terrible) and comic books. This game has a lot of back story behind it, on the surface there may not be much, but some research later and its got it's own whole universe!  Now to the only bad thing: Windows backwards compatibility is truely amazing, sure it may come with some prices on some titles and this game has one. The game runs at a full 60 fps despite the games' cutscenes were designed to render at 30 frames, so them running at 60 frames, they go too quick and dialogue is cut off, its a famous issue for the game, so what you would need to do is get a program to cap the frame rate. Some people get random crashes and stuff like that, but I never got any. A simple google search and you will find alot of solved threads regarding making Bloodrayne run as good as possible on newer systems.  So, SUMMARY: This game is a true classic, worth the cheap price, a game that has aged well, has fast paced action, a decent story along with a sexy heroine. The game does require some tinkering in order to make it run properly on newer windows machines, but once done you're in for a real nostalgic experience.  Hope my review has helped.  Cheers.",
            "review_score": "1"
        },
        {
            "review_text": "  We're in the 1930's, a edgy, foul-mouthed (&amp; awfully trendy for these years) half-human/half-vampire is looking for her father for the only purpose to end him but instead gets caught up with a secret society who's looking for a badass (who's out of gum and wants to kickass) to eradicate all vampires. But f%@k that! The Nazis been acting all ''Paranormal stuff is awsome'' again and we got to stop them!",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game on sale along with bloodrayne 2.  I liked the series, seen full gameplay of it and all at the time when i couldn't afford to play it or buy it back then.  now the important part, i tried to play it today, twice crashed, and then everytime i try to play it, i crash, can't even last more than 5mins maximum without it crashing for no reason. it is not an issue with my laptop requirement, can run AAA games on max settings without an issue at all, so i do not see why this game keeps crashing.  overall if you're lucky to have it running on your pc, then get it, if not after you bought it, i would refund it asap.",
            "review_score": "-1"
        },
        {
            "review_text": "I came here for the b00bies and stayed for some weird guilty pleasures",
            "review_score": "1"
        },
        {
            "review_text": "Old game but gold &lt;3 :D I love this game , I played BloodRayne for the first time , long time ago , the story of the game is very exciting!! Good play for everyone!",
            "review_score": "1"
        },
        {
            "review_text": "breast physics",
            "review_score": "1"
        },
        {
            "review_text": "If you found this game, its probably what you were looking for. Scary, bloody carnage game with a very sexy content. There's no way not to like this game.",
            "review_score": "1"
        }
    ]
}