{
    "app_id": 381260,
    "name": "Orion Trail",
    "release_date": "2015-10-12",
    "developer": [
        "Schell Games"
    ],
    "publisher": [
        "Schell Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Great Soundtrack"
    ],
    "achievements": 30,
    "positive_ratings": 109,
    "negative_ratings": 50,
    "price": 5.59,
    "description": "Dare to travel the absurd and dangerous Orion Trail, where only the luckiest, bravest, and most stubborn captains will make it all the way to the end. Become famously incredible or incredibly dead in this single player choose-your-own-space-adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/381260/header.jpg?t=1447376741",
    "minimum_requirements": "OS: Windows 7 Processor: Core 2 Duo 2.66Ghz Memory: 512 MB RAM Graphics: 256 MB Graphics Memory and Directx 9.0c Compatible gpu DirectX: Version 9.0 Storage: 300 MB available space Sound Card: Onboard sound card Additional Notes: Mouse Required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'm glad I bought this game on sale, because I've seen everything it had to offer right at the two-hour mark aside from some crew members; I've played through all the galaxies in three-and-a-half hours. Planetary missions consist of four different missions so get ready for those to get stale quickly. In fact, all the events repeat very often.  Good animations, but unfortunately they're constrained to a tiny window at the bottom of the screen. There were some funny moments, but they don't stay funny after the first time you've seen them. Get ready to feel burnt out on reading. Maybe if they flesh out the game in the future I'll change my opinion, but just not feeling it's worth the money at this time.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of the reviews on here made legitimate points, but desperately need to be updated.  For instance, the current most helpful rated review complains that there are no upgrades. That has already been addressed and changed; you can now stop at trade hubs and trade for supplies, for upgrades, or rest to regain some HP (but at the expense of losing some food - nothing comes free!).  Other updates include changing up the difficulty a bit. Now when you're on the trail, you can see the difficulty of each point, ranging from one to three skulls. Plus the trail gets progressively more difficult as you reach the end. So there's some added variation in the gameplay now.  Another thing they've added since the early access days is that when you start your mission, you can now spend credits to stock up on fuel, food, crew, or hull points.   I was a backer for this game and have been playing it since the day it came out. I initially wrote a negative review, but I have been consistently impressed and pleased with the updates and how responsive the makers are. This is one of the few games I own that I genuinely think is worth purchasing at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Not a very complex game, but a very amusing one! Sort of like FTL if you didn't have to worry about controlling any of the fights or guys running around in your ship and with more text-based options. The music is retro and has a Maniac Mansion feel to it. Quick, easy, and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Well, nothing to do with choose-your-won, it was just pure luck, and luck will against you most cases. Make the result more in our control or tilt the chance toward us a bit will get you better reviews.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, I'm not a gamer at all, apart from watching the odd playthrough on YouTube. I had to install Steam specifically for this game. I am, however, a big Star Trek fan.   I played the demo of this game several times and watched a short (incomplete) playthrough and then decided to buy the game myself. To be honest, I don't feel like I gained much from doing so.   Here are my main issues:  - As others have said, the game is too random. You can make it less random by picking a crew that all excel in one area (e.g. diplomacy) but then you end up picking diplomacy options only as you know you will succeed, leaving you more like a trained monkey than a person making choices. I would have preferred the game to have a in-game 'guidebook' (e.g. Fabulons like compliments on their outfits) which would also weigh on the choices. Protocol might say to do X, but you are more skilled in Y and you need to decide which will give better odds. Like the game 'Papers, Please', the guidebook could also change during the game.  - No over arcing plot. The demo gave you the choice of trying to finish with either the most food or fuel which could easier have been converted into plotlines (e.g. take as much food to the X planet as possible, you need to pass through 3 systems to get there). Your crew also changes from system to system which could have remained the same, leading to more growth, and also have been integrating into the plot.  - The same issues occur over and over. While I don't mind each system throwing up the same set of issues each time you play, some of the issues occur in more than one system (and perhaps more than once within the same system, though I am not completely sure as it all blurs together). I would have preferred in each system had different problems.  - Part of the store needs coins but there does not seem to be anyway to get coins. Perhaps I have missed something in the game, but this is not mentioned in the manual.  If you've not played the demo or seen it on YouTube, this game is worth a play. If you have done either of those before, there is no need to download to play but only to support the game designers.",
            "review_score": "-1"
        },
        {
            "review_text": "RNG heavy game, if you do not like a lot of 'rolling the dice' weighted with how many levels/points you have in a certain skill, you might not like this game.  It plays much like another game called Faster than Light 'FTL', in that you explore space by travelling from point to point, and managing your ressources - If you're into FTL, try checking this game out on youtube, twitch, or maybe test it for the 2 hour you have before you refund it :)?  That being said, I liked the humor, the gameplay 'especially the away missions', and the randomness added by the RNG. solid game for me :)",
            "review_score": "1"
        },
        {
            "review_text": "I love this Game because it reminds me a buit of ftl/startrek/star wars mashup into a single game",
            "review_score": "1"
        },
        {
            "review_text": "Reviewing the game is a bit difficult because it lends itself to two different theories on what playing it actually is.   If you consider the game to be about getting from point A to point B for each stage (which is true), then it's INSANELY difficult. A sensible player would choose never to interact with ANYTHING, because doing anything except choosing the shortest path and refusing to do anything optional saps resources you can't afford to lose. Trouble is, you don't have enough of those resources in the first place. Not even close. So you HAVE to gamble to win. But this works out about as well as it would in real life: buying lottery tickets to make rent rarely ends well. So the game is HARD.  On the other hand, a perfectly sensible take on what makes this a game is that you're watching the comic misadventures of a Star Trek homage/parody. Viewed that way, watching endless abusive-but-funny terrible things happen to your crew is the whole point. You want the ♥♥♥♥ to hit the fan just to see exactly how it'll splatter. Casually sailing through all the levels would be silly and boring.  This makes for an odd mix. You die constantly, which is... not ideal. But if you get into the spirit of that, it's fun again.  It's hard to say if this is intentional or not, but the sweet spot is easily hit by rampant cheating using a memory editor. You can usually find two of the resources in just two scans, and the other two aren't much harder, should they ever pose a real threat of running out. Once you have the power to simply undo the game's savage punishments for exploring, you're free to relax and goof off. Which, honestly, feels like exactly what the game was designed to be about in the first place.  It's also important to note that I'm reviewing an early version of this game. There's already talk of updating it to be easier coming from the developers. One way I'd personally like to see them do this is by opening up your character stats to casual mods in config files, like how the 'Political Machine' games do it. That way, players could have fun by tailoring difficulty to their own taste. Want to make it easy to heroically breeze through all the scenarios? Ramp up those stats! Want to laugh at pathetic foibles? Use, uh, well, just use the original settings.  In short, the game is fun! And the references are solid! But you should be prepared to cheat like you have never cheated before if the idea of constant, near-inevitable failure stresses you out.",
            "review_score": "1"
        },
        {
            "review_text": "A space based Oregon Trail, not much else to say! It's not very deep or varied, but the flavor text is humorous enough to make it worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "Orion trail is cute but a little too mindless slot machine. Was hoping for something more FTL like but with more character. It definitely has the character just not enough game for my tastes. There are decisions but the decisions are no more difficult than the decisions in tic-tac-toe",
            "review_score": "-1"
        },
        {
            "review_text": "Essentially a cross between 'The Oregon Trail', 'FTL', and a dice and card game, Orion Trail is a fun, easy to play game of making decisions. Parody of existing science fiction tropes and series is constant, making the game a more light-hearted tale of survival - or horrible death - in space. Orion Trail plays as a series of decisions, the outcome of which is determined by what amounts to the roll of electric dice the odds of which are affected by the stats of crew, ship, and circumstance.   The decisions the player makes affect the stats that the random component works upon, and results in turn affect not only those same stats, but the resources that define the mission as a whole: crew, food, fuel, bravado, and science. The goal of any game is to survive a trip through a region of the universe. Each path has many alternate routes within it, each possessed of differing levels of danger and problems to solve. The game is different every time, making each adventure unique.  Orion Trail could best be described as a digital board game, though it does draw on early edutainment software for inspiration as well. The entire process of gameplay is decision based - there is no 'action' as such beyond player choice. Although humorous, the choices can have serious consequences. Survival is not guaranteed. The first galaxy is relatively tame, later missions become quite challenging indeed.  It is clear a lot of love went into Orion Trail, and the developers add more content to it from time to time as well.",
            "review_score": "1"
        }
    ]
}