{
    "app_id": 381560,
    "name": "Epic Cards Battle(TCG)",
    "release_date": "2015-07-09",
    "developer": [
        "momoStorm Entertainment"
    ],
    "publisher": [
        "momoStorm Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Nudity",
        "Anime"
    ],
    "achievements": 50,
    "positive_ratings": 359,
    "negative_ratings": 349,
    "price": 0.0,
    "description": "Abandon the brainless card games and play the real strategic cards game, 3 kinds of card types: Unit, Spell, Trigger. Next-Generation Revolutionary cards battle game in 3D with hundreds of stunning battle visual effects. Experience real-time match making and battle with players around the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/381560/header.jpg?t=1537499694",
    "minimum_requirements": "OS: Windows XP SP3 Processor: 2 GHz Memory: 512 MB RAM Graphics: 256 VRAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Mobile game port with alot of microtransactions and with 'action points' probably pay to win/progress",
            "review_score": "-1"
        },
        {
            "review_text": "Pro:  - 2D Boobies  Cons:  -P2W -Everything Else",
            "review_score": "-1"
        },
        {
            "review_text": "This game is almost like a facebook game. 1. Pay to play (There is energy needed in order to play the game) 2. Lots of Microtransactions, just like from phone games or Facebook. 3. The game itself is boring, you click a button and watch animated cards fight....  The only good thing I can say about the game is the artwork on the cards to be honest. This game is not worth anyones time, unless you pretty much want to pay to play the game.  Edit: There are some bugs that affect the game play or your cards. Along with my comment of pay to play, no this is 100% pay to win or it is really hard and frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game in a fashion. The gameplay is well thought out and te card art is outstanding. There are some problems with translation (It's ANGEL A-N-G-E-L not angle, that is driving me nuts). There is a gameplay glitch that people should be aware of that is extremely INFURIATING. WHen one sacrifices cards, even though one has multiples and you tell it to only sacrifice one, it WILL sacrifice every card of that kind. Sort of a deal breaker there.",
            "review_score": "-1"
        },
        {
            "review_text": "Play Hearthstone instead...........",
            "review_score": "-1"
        },
        {
            "review_text": "Wouldn't recommend playing this game you're better off just playing something like magic the gathering if you want to play a good digital card game. The visuals for this game aren't bad and the audio is ok nothing to write home about though, but if you really want to treat it like a FREE TO PLAY GAME then it will get boring quick at least in my opinion. The gameplay isn't all that great if you want a digital card game pay a few dollars to buy 1 of the magic the gathering games and I'm pretty sure they have online communities to and they aren't pay to win games just got to have enough skill and have spent enough time to unlock certain things and have fun.",
            "review_score": "-1"
        },
        {
            "review_text": "It's LOW originality! It's NOT durable! It's really IDIOT!  Most is PAY, stupid everything such as you need to buy the cards, and you need to buy the REPLAY, and you need to buy name CHANGE! I make sure this is a poor game than the others similar. We can never condone this S.H.I.T !  This unhealth is gamble, obscenity, and miserly, the sick may be buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Tldr version:  You don’t need money to win in this game. It is possible to finish in the top 20 each season without spending money but it takes some time and experience. The more you play, the better you will be because your cards will be getting stronger. The game doesn’t require “skill” but “strategy”. You will choose your cards based on how they compliment yours and how to counter your opponent’s but you won’t be “active” in the battle taking more of a spectator role. The single player it’s short. The multiplayer it’s where everyone is. It’s fun, it’s free, you should check it out.  Now for a more extensive review:  P2W or not P2W?  Ignore the people whining about being impossible for a free player to win often in this game, as you can see by the time they spent on the game, they simply didn’t give the game a chance and judged it in a superficial way. I am a free player. I have never spent a single cent on this game. And I have an 85% win ratio on Pro Matches, I have finished on TOP 20 to get the legendary card twice and I expect to do it again in the future.  With all that said, there is a clear advantage for whoever “farm” the missions day by day and have played the game for a long time or for people that “pay” money to get the gems the easy way at the beginning of the game.  The good news is that if someone pays anything less than 50 dollars then they are just getting exactly the same thing you can get by simply playing the game for a few weeks or months. So after a few months your account will be strong enough that you won’t even care about people spending 50 or even 100 dollars to become stronger.   The problem comes with the people that spend over 100 dollars in the game and not just that but over 400 or 500. There are cards that cost 180 dollars and are the strongest in the game, whoever get those cards will have a definitive advantage against pretty much 99% of the players. But then again, those guys spent 500 dollars on a free to play card game. It sounds that the problem here it’s not the game but those people that can’t control themselves.  The truth is, if they couldn’t sell you gems for you to buy cards faster, then they wouldn’t have any means to earn money in the game and would have to make it a pay to play game. Nobody it’s going to buy “skins” or other “items” on a card game. The design of these card games it’s so basic that it has to affect the gameplay in order to interest people into buying.  So, in the end, the P2W aspect in the game exist. But at the same time it doesn’t affect you from performing well if you are a free player, you can have an 80% win ratio like me without spending money and you can also get the legendary card reward by finishing top 20 on ladder which is pretty much the most valuable reward to achieve in the game.  Multiplayer  It’s a different kind of game. It’s designed for mobiles and thus it doesn’t ask for a lot of activity on your part. It’s not a game about skill, it’s a game about strategy.   You have missions to do every day. They all consist on win or play several matches pretty much in all the modes and then collect the reward. You can play for coins or ladder. Coins are used to buy packs to get cards and in ladder your results will end up on a leaderboard and at the end of each season you will get rewards based on your position.   You can also join guilds. Guilds compete against each other in a special season. At the end of this season all the guilds get rewards based on the position they finished on the leaderboard. There is a special chat for guilds member whom you can talk with but that's the only real special thing they have. There it’s nothing special you do in a guild beside this, the guild points are all based on activity. So as long as you play, you are helping your guild and at season end, your guild will help you with those rewards.  All modes consist pretty much on picking cards from you collection and then watching the battle take place against your opponent cards. You cannot participate in the battle which is something that some people complain about. But again, this isn’t a game of skill but strategy. With experience it’s very easy to see how the battle it’s going to turn out just by looking at your cards and your opponents before the battle actually takes place.  There are 3 modes in multiplayer:   Quick Mode: You pick a deck of 6 cards from you collection and you are paired randomly against another player. It’s basically a complex rock, paper and scissor type of game. But it’s not all about luck, I have an 80% win ratio there instead of just 50%. Because you shouldn’t simply pick cards randomly. You need to look for an efficient deck or create your own deck if you think it could be effective. There is a matchmaking system based on cards rarities and levels to avoid “expensive” cards to dominate the mode, so your strongest cards may no guarantee better results. This mode it’s usually played to “farm” coins and matches played for the missions.  Pro Mode: This it’s the most interesting mode in the game in my opinion. It’s a 6 card battle like Quick mode but this time you will only pick 2 and you will get paired with someone. Then in the second turn you can pick another 2 but the smart thing to do, it’s to choose those cards based not only on your first 2 cards but also on your opponents first 2. You need to counter and sometimes you can see where he is going and how his deck will look like just by seeing his first 2 cards. Finally on the third turn you will choose your last 2 cards, this time already knowing 4 of your opponent 6 cards. After this, the battle begins.  Hardcore Mode: This mode it’s basically 3 quick modes all put together one after the other. There is strategy here also but there not too much countering and a lot more “risky blind betting” or simply trying to anticipate which kind of deck your opponent will use next. When your first deck wins, it will stay and fight (wounded as it is) your opponent next deck, that’s why knowing how to counter decks it’s important and anticipating your opponent can be the difference of the fight in this mode more than the other.   In the end, I do not recommend Hardcore Mode for free players because I feel that the mode is too unbalanced in favor of people that spends above 100 dollars in this game. I only play quick mode because the matchmaking makes my deck be very efficient and Pro Mode where I feel that the game gives me a fair chance to beat almost everyone if I play my cards right.  Single Player:  There is a campaign in the game. They reward you with coins, rubies diamonds and some valuable cards. But it’s not too extensive and it’s mostly a stepping stone to prepare you for multiplayer.  Problems:  The biggest problem it has right now it’s the lack of updates. The game it’s fun and if you haven’t played it I suggest you  to try it out but after a while the game starts to feel repetitive because the devs haven’t released new cards in a very long time. ",
            "review_score": "1"
        },
        {
            "review_text": "Go play Hearthstone instead of this ♥♥♥♥ ...",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game, cant get 5 stars cards without $$ and no gameplay",
            "review_score": "-1"
        },
        {
            "review_text": "I don't have much playtime on this game, mostly because I feel like this would have made a much better mobile game than a PC DTCG. I think that there is a lack of interaction that is acceptable on devices that can fit in your pocket, but if I'm booting up my computer, I want to be able to directly affect the game state, not set a line-up then watch a timer.  That being said, if you enjoy pre-game strategy more than in-game strategy, this is the game for you. It is a bit of a deck building exercise, but it's not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "What do you mean that women aren't just boobies on a beanstick?",
            "review_score": "-1"
        },
        {
            "review_text": "Do not join the game. You cannot catch up, send cash and you will be better than the ones that don't, but the ones that have been playing for longer have been able to strenthen the cards that you can buy so you will still lose to them, even if you spend a lot.",
            "review_score": "-1"
        },
        {
            "review_text": "its a fun strategic game but also geared towards taking your money",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for a bit and this is what I think  1) it feels like a huge grind if you wish to get cards without paying real money.  2) the battle set up is interesting but I would of liked to control the battle a bit more rather than watch it go down and hope for the best.  3) Leveling the cards up is a neat idea but once again it makes it feel like a lot of work for very little pay off... I'm not into grinding.  4) I like the art on a lot of the cards, but some of it seems rather pervy to me.  So would i recommend this game... for myself no, but if your into TGC games with strategic battles that you set up and watch... the whole grinding or spending real world money for digital cards isn't my thing.",
            "review_score": "-1"
        },
        {
            "review_text": "I have seen darkness and lots of anime breasts",
            "review_score": "-1"
        },
        {
            "review_text": "Just downloaded this game to write DEM TATAS DOE.",
            "review_score": "-1"
        },
        {
            "review_text": "As a girl... i hate girls with bigger boobs than mine xD",
            "review_score": "1"
        },
        {
            "review_text": "Spent 5 minutes looking for settings, turned off the awful music. Got 4 achievements. Game crashed afterwards. Convenient",
            "review_score": "1"
        },
        {
            "review_text": "Let me preface this really quickly. IF YOU ARE LOOKING FOR AN ACTIVE CARD GAME, THIS IS NOT THE GAME FOR YOU.  ECB is a passive card game where you construct a field and, based on the traits of the cards you use, automatically fight other decks.  There is an obvious PayToWin path, but seeing past negative reviews, most issues coming from here stem from players not seeing other option or have been changed for the better, which is good in my book.  From what I've experienced so far, there is definitely a grind to get a free experience from this game. And that's perfectly acceptable compared to other free online TCG/CCG games where there is an equivalent grind. And ECB compensates heavily for that early on with a very extensive campain mode that treats it as a somewhat strategic puzzler.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing card hentai,recomend :D",
            "review_score": "1"
        },
        {
            "review_text": "OK, this game is ADDICTIING! but yes, it is p2w but the thing is, YOU DONT NEED TO BUY ANYTHING TO BE GOOD AT THE GAME!!!!!!! everybody in the comments is freaking out about the p2w stuff, and most people you battle online wont even use their money to buy cards.",
            "review_score": "1"
        },
        {
            "review_text": "If you want lots of WOMEN'S Jiggly Puffs then this is for you ",
            "review_score": "1"
        },
        {
            "review_text": "Good way to waste time. It's free so even if I dislike some aspects I'll recommend this because it's kinda interesting and worth the price. I doesn’t have a very long download either.",
            "review_score": "1"
        },
        {
            "review_text": "All say this is Pay to Win game but for me this game is good with daily log in reward, draw and more. If you like card game with complex but not confusing rule try this game and use my CODE[b/] when making id :D =  (d586)",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually fun and not pay to win if you read and have patience. Most Americans are lazy, don't read and want things to be easy. At first I was losing because I was just spamming random cards with the most stars. After losing a PVP match to someone who used all 1 star cards, I knew there had to be some strategy invovled. Which there is, actually TONS of strategy but a decent amount of reading invovled since there are so many options to counter other players cards.   It's really not pay to win if you know what you are doing. Like I said, you have to read the cards to see what they counter. I learned enhancing Ice Elementals to level 30 is amazing in PVP. Which is a 1 star card but owns and can control an entire game.  The game has been around since 2013, so other players have a card advantage and obviously have been getting the day 30 card rewards, which are 4 star cards. If you keep playing you will eventually get free cards that are really good. Just don't expect to be pro in 2 hours like most of these reviews.   The playerbase averages at about 350ish playing at all times. So you will always have someone to fight in PVP. READ your opponents cards to see why they are chosing them. This game is NOT just about hit points and health points. The daily mission rewards are good, the packs for free currency helps build your collection and login rewards are good.  Tips: -Buy the 998 coin packs first. (about 5 or 6) -Then start to buy the 2498 coin packs. -Enhance Ice Elementals to level 30. -READ the cards and do the tutorial because there are A LOT of rules in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Hy! I've been playing ECB for almost two years and I love it. It's really great game and you can't stop playing it. The game is very exciting and there's no better thing than beating top players. It's really fun to relax after a long day and escape to imaginary world where you are powerful with lots of different abilities and throwing some amazing traps and magic on your sworn enemies. Well...have to say, beating your guild fellows is very exciting too..when you see on chat room his comment to battle 'good game' with smiley face after you beat him to death but you actually know he has a red angry face and can't wait your match again on battlefield to have his revenge.   Friends, join us :)  ingame nick: smoki1vu server: Archangel  ID: 210663",
            "review_score": "1"
        },
        {
            "review_text": "I'm rather astounded by the negative reviews for this game. Personally I found it to be one of the few TCGs on Steam that have kept my attention for a decent amount of time. It's got great content as far as I'm concerned, it's very unlike the other titles.  Noteable features over other~   * Great linear progression - Introduction to different features isn't shown until unlocked, but core content is covered. You can enhance cards, level your character, etc.   * Superior strategy and planning - Each campaign level requires you to analyze the enemy's deck, sort through your own, and then cross your fingers that the monsters, abilities, and supporting spells you've chosen are a working strategy against your opponent.   * Quality over quantity - Each match is fairly fast-paced and the number of cards used per battle is 6 [unless I'm mistaken]  * The individual card's abilties are ridiculously unique, and each card in your deck is useful for a different situation  based on its specific capabilities and stats.   * Unique and quality artwork - None of the artwork or UI is reused or stolen from other games. The style is particularly detailed and gorgeous in my opinion. It's a great moderation between some of the other examples that are too cartoonish or hardcore. There is great variety, and another aspect of note is that portraits of women characters are anatomically correct. Fan servicing is tastefully so, and it's realistic anatomically correct and variable.   * Fast load, solid UI, stable framerate, no noteable bugs, stable build.  --- Overall I think it's a great side-game that's fun to play for decent periods of time. It's a solid competitor against the alternatives, and I highly recommend at least trying it. I can only hope y'all enjoy as it as much as I have!",
            "review_score": "1"
        },
        {
            "review_text": "this games is a very fun game to get into, i have been looking for a good trading card game to play for a while now and i have found it, the basis of this game is to build a 6 card deck that contains a mix of unit cards (monsters) and spell and trap cards,there are also 6 different leigions of cards and also different styles of attack depending on the type of card such as being able to attack the monster with the weakest attack or attckaing the moster on feild who is the most threat on the feild there is also a type of monter that deal area of affect which can be really useful, the general gameplay is really smooth and there is a tutorial to get you started, the card designs are absolutely stunning. i have only just started playing this game but look forward to putting some time into building the ultimate deck",
            "review_score": "1"
        },
        {
            "review_text": "'The best card game in its genre, 10/10' -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Pretty damn fun, enjoying this so far and I hope to play more.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun and addictive. Takes a bit to get used to, but well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "a 5/10 not bad not good just mhe but free ",
            "review_score": "1"
        },
        {
            "review_text": "BOOBS HALF NAKED LOLIS AND MOAR YYYYYYYYYYYAAAAAAAAAAAAAAAAYYYYYYYYYYYYYYYY.....but HELL WHY DO they need to be so evil in the best cards, cant enhance 3 star cards into 4 star ones and the drop rate is miserable, BUT WAIT u can evade this matter by giving MONEY for diamonds and buy packs that 'DONT' give lesser the 4 stars per pack, games is good for the perverted phantasy star cards LOVED IT but hell no not giving money for the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's funny to joke around with and make comments about, but in it's entirety it's pretty ♥♥♥♥. You select some cards, and then sit back and do nothing with the controls and let the game play the game. All you do is click the numbers and click the cards.  I'm mainly doing this for a Steam badge, but whatever :D",
            "review_score": "-1"
        },
        {
            "review_text": "Okay game, but rather simple concept, and from what a lot of other reviews read, P2W. Certainly won't fill the void left by another incomplete MTG Release, nor will it feed your strategic desire if you're looking for something to take you away from Hearthstone. I, for one, would not even touch that if I could just get a decent MTG Release with a functional deck builder that includes more than that year's assortment of cards, or ridiculous boundaries on your creativity. Going back to OCTGN~~~  Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "To me looks like a complete mess, all your control is to select party then it auto-resolves with some shiny animation. As player is not involved the deciding factor will be the cards you bought...",
            "review_score": "-1"
        },
        {
            "review_text": "Well somehow I start to like this cute little card game :)It's really nice one,compared with decent equivalents and whit card games for that you have to pay.Well done game mechanic,design and visual appearance/artwork as well.If the underlying ideology is based on the idea that the basic form of mood is a lot of fun well then I think that this game can provide to you excellent entertainment.Always is questionable because of the different mentality of the people and because of the way how others will individually experienced this game but if you ask me....you should try this game,you never know.Perhaps you will find enough enjoy and decide to stay.   8/10",
            "review_score": "1"
        }
    ]
}