{
    "app_id": 381870,
    "name": "Koala Kids",
    "release_date": "2015-06-22",
    "developer": [
        "Doomster Entertainment"
    ],
    "publisher": [
        "Doomster Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Retro",
        "Puzzle-Platformer"
    ],
    "achievements": 17,
    "positive_ratings": 101,
    "negative_ratings": 14,
    "price": 1.69,
    "description": "Koala Kids is a puzzle-platformer game, in the style of retro games like Lode Runner. Includes Hot-seat Coop and Level Editor.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/381870/header.jpg?t=1507839270",
    "minimum_requirements": "OS: Win 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sister bought it for me because koalas are my favorite animal. On sale for $0.75, expected it to be worth $0.75 or less. Gameplay was actually very entertaining, and IT HAD KOALAS TOO OMG!  A short game (1.5hr and I'm probably 50% through). Worth $3 full price. I bought it for many of my friends.  Thank you, dear developer(s), for giving me an entertaining puzzle/platform game where I get to be a koala and dress him up and build a whimsical, musical koala citadel and drag my friends into kool koala ko-op (locally, but still worth it)!  EDIT: Yup, short game. 2.7hr and 100% completed solo. But I can easily see myself playing this through again in the future. Not to mention local co-op and level editor to burn some more time! Very worth $3 imo. Oh, and also, KOALA HATS!!!",
            "review_score": "1"
        },
        {
            "review_text": "Boring, because way too much childish. It is pretty easy to figure out where to go like in first few seconds of each round started. And the difficulty simply dosnt ramps up. The ugrades between levels would be much better with actual choise of parts to build (or decorate) rather then full autoplacement. Also there are few bugs which making it annoying to play. Like, if you trap an opponent but then get killed - that opponent (inside trap) will get killed as well. Or sometimes my enemies getting out of traps for no reason (there is no other enemies on same floor).  This is braindead game which requires nothing at all to play. It does not have any unique possibilities, art or music - its just a common flash game.",
            "review_score": "-1"
        }
    ]
}