{
    "app_id": 381940,
    "name": "Trials on Tatooine",
    "release_date": "2016-07-18",
    "developer": [
        "ILMxLAB"
    ],
    "publisher": [
        "ILMxLAB"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "VR",
        "Star Wars"
    ],
    "achievements": 0,
    "positive_ratings": 949,
    "negative_ratings": 227,
    "price": 0.0,
    "description": "Commence your Jedi training in this Star Wars virtual reality demo experience. Repair the Millennium Falcon, defend it from attack by Imperial Stormtroopers, and wield a LIGHTSABER.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/381940/header.jpg?t=1478026229",
    "minimum_requirements": "OS: Windows 7 SP1 or newer (64-bit OS required) Processor: Intel i5-4590 or equivalent Memory: 8 GB RAM Graphics: NVIDIA GTX 970 DirectX: Version 11 Storage: 5 GB available space Sound Card: Stereo or 5.1 Surround",
    "recommended_requirements": "OS: Windows 7 SP1 or newer (64-bit OS required) Processor: Intel i7-4790K or greater Memory: 16 GB RAM Graphics: NVIDIA GTX TITAN X DirectX: Version 11 Storage: 5 GB available space Sound Card: Stereo or 5.1 Surround",
    "reviews": [
        {
            "review_text": "really nice short game, very detailed in the short time it takes to play, love the lightsaber fx",
            "review_score": "1"
        },
        {
            "review_text": "Free, short amazing Star Wars demo that wasn't even slated to come to consumer VR. I'm glad the developers let us give it a shot, it is a very memorable experience.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a game, its like a small part of a Disney ride that hasn't been created yet. Perhaps 3-4 minutes with very limited interaction. From a graphics and audio perspective, its extremely well done. Perhaps this will be the goto app for quick VR demos going forward.   Don't go into this with expectations of it being a Lucasarts game. Its a very short and simple demo.",
            "review_score": "1"
        },
        {
            "review_text": "I like it, it's just not long enough. For Star Wars fans, this is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "Brought me back to the ol' feeling when I sat in the theater for Star Wars (4, 5, and 6) and felt that wonder and awe. And this is just a small, tiny taste of what it'll feel like to star in your own movie.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a star wars kinda guy but this... this was awesome. This kinda stuff is perfect for VR and damn... do you feel like your there :-)",
            "review_score": "1"
        },
        {
            "review_text": "Short display of what VR can really do. Totally impressed!",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand all the people giving thumbs down. If it were 5$+ I could understand it since it is very, very short... but it is FREE! COMON!  Even though it is short, it is well made and I greatly enjoyed it. I've always wanted to immerse myself into the Star Wars universe in VR, and this did exactly that.  If ILM LAB made a longer, several hour Star Wars VR game for $30+... I would buy it in a heartbeat! Do it please!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely epic. Come on. The Millennium Falcon lands next to you? I have to admit, I was a little anxious as the Falcon lowered and did take a few steps away so as not to get squished. If you are a Star Wars fan as I am, then this is a must have. Using the Lightsaber to send blaster shots back at the storm troopers? Amazing. Yes, it's short. Yes it could be more. But it's free and it is a teaser for the future of VR. Thanks for ILM for bringing back those fond memories of the first Star Wars.",
            "review_score": "1"
        },
        {
            "review_text": "My new go-to for showing people VR. I wish it would let you stay on Tatooine after the credits roll.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing little demo, exciting, engaging, and a real fun Star Wars Experience. I can't wait for the full immersive game.",
            "review_score": "1"
        },
        {
            "review_text": "Go into it knowing that it's short. The sounds are great.",
            "review_score": "1"
        },
        {
            "review_text": "I just returned from Tatooine where I helped repair the Millenium Falcon, and defended myself from Imperial Troopers with a lightsaber brought to me by Han Solo and R2D2...  What did you do this morning?  Seriously though... the lightsaber was amazing, and deflecting the bolts in that was way more intense experience than lightblade vr was when I played it...  Performance... I ran this with and amd 8350, 16gb ram, and two 2gb gtx 960s in sli... it will work, sorta... but i dont suggest it unless you have no other option. It was a little choppy sometimes even with the graphics set on low. Game ran super smooth in the space part after, where you can play with the lightsaber.   Thanks devs... amazing...  Please make more Star Wars stuff  VR is like a dream come true...",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I want so much more. When will this level of quality be the baseline for VR?   Hopefully at some point get we get more of this, and yes I would be willing to donate my first born to the Sythe cuase...  I would highly recommend this experience for new Vive users and anyone that is demoing your Vive.",
            "review_score": "1"
        },
        {
            "review_text": "For me this is the defenetive VR experience.  When I want to show anyone why VR is so special: just let them walk on Tatooine.   ",
            "review_score": "1"
        },
        {
            "review_text": "Content: Absolutely magical. Of all of the VR free demos out there, this one sets the geek rating off the scales. No other game or experience lets you stand on Tattooine, touch the Millenium Falcon, or wield a lightsaber and deflect incoming blaster rifle lasers.  Length: While it is a short demo, it's a demo and not a full featured game. It lasts maybe four minutes, but it has great replay value. One can only hope they create a full game.  Immersion: Great. I recommend room scale, however. I am limited to a minimum size room scale experience, and I would have loved to have been able to wander around the falcon a little bit more.  TLDR: This is a great demo. Enjoy it for what it is. Show your friends.",
            "review_score": "1"
        },
        {
            "review_text": "More please! &lt;/waves wallet at the monitor&gt;",
            "review_score": "1"
        },
        {
            "review_text": "For people being upset about it being incredibly short, if you read closely it says it's an 'Experiment' not to mention it's 'Free'. I loved the experience and having a lightsaber was tons of fun, however I could barely reach the buttons since there's no teleport function in the game.",
            "review_score": "1"
        },
        {
            "review_text": "That was awesome! I was smiling the entire time. Really looking forward to what VR is going to do and more importantly make you feel when big AAA companies get involved. Loved it. THANK-YOU for making this a free experience! Will be demoing it all the time!",
            "review_score": "1"
        },
        {
            "review_text": "So, is it short? Yes.  Are the intro and credits a bit long? Yes.  Is it a glorified demo? Yes.  Is it Star Wars?  YOU BET THAT ANSWER IS YES.   I'm still freaking out over how genuine that lightsaber (and no, it's not a light blade, or a flash blade, I'm calling it what it is because that is what it is) handles while the credits are rolling. Remember all those kids you see outside holding those plastic tubes that they call a lightsaber, pretending that it's the real thing?  Well I didn't have to pretend.  I have the real thing.",
            "review_score": "1"
        },
        {
            "review_text": "Short, yet very fun",
            "review_score": "1"
        },
        {
            "review_text": "Many thanks",
            "review_score": "1"
        },
        {
            "review_text": "No clue why people are downvoting this. One of my better experiences on the Vive and for free.",
            "review_score": "1"
        },
        {
            "review_text": "not bad at all needs more leavels and fighting it was way to short",
            "review_score": "1"
        },
        {
            "review_text": "Nice, specially since it's free!",
            "review_score": "1"
        },
        {
            "review_text": "Just awesome. Out of the handful of experiences I've tried on the Vive so far this is the first that made me like I was really there and had to act. Don't expect much, it's a very short experience, but still worth a play. I think it gives a taste of what big companies will soon do with such platforms.",
            "review_score": "1"
        },
        {
            "review_text": "Short but very sweet. I'd call this a successful experiment, demonstrating that this idea fully developed would be mind blowing.",
            "review_score": "1"
        },
        {
            "review_text": "It is awesome but. I think its too short. I mean you get the light saber and then is over. But it is a great experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but ridiculously short",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet",
            "review_score": "1"
        },
        {
            "review_text": "It's free, what's not to recommend?  But beware, it short. It took longer for me to download than it took to play it twice. It takes 5 minutes to complete and it's not the best experience. For starters, it doesn't look really good. The props look great, but the renderer used makes it all very blurry. Then there's the problem with the play area. You'll definitely need a 2mx2m or maybe even a 2,5mx2,5m play area or you can't reach the buttons. I have 2,5mx1,7m and had to wait it out. Luckily it does continue. And then there's the problem with the controller swap. I let my girlfriend play first and she had a light-saber in her right hand. When I played, the controller suddenly swapped to the left hand.  All in all, it's a cute experience. You download it, play it for 5 minutes and then delete it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm giving this a good review because it was free, but I feel this was overall a very half-hearted attempt at giving a mindblowing VR demo. It feels as if they outsourced it to some company that just wanted to 'get it done' and there was no love put into it.  If it did not have the Star Wars name on it, it would be forgotten and get little attention. There are sp,e amazing VR experiences out there that I like to demo to family and friend, and this one does not make the list.  Also, whoever optimized this in UE4 did a pretty terrible job as it is extremely blurry by default even on a GTX 1080. It seems like they likely left temporal AA on while leaving a low default screen percentage in the post processing volume with no ability to increase the scaling. Mistakes people that aren't heavily invested in this would make.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun little Star Wars demo. Puts you right into the Star Wars universe. Must have demo to show friends and family.",
            "review_score": "1"
        },
        {
            "review_text": "It's a short tech demo, but it's more than you can expect for free in this franchise",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it's short. Yes, it's a long download for 5 minutes. But it was still awesome, especially for free -- and it's a legitimate, high quality Star Wars experience.",
            "review_score": "1"
        },
        {
            "review_text": "Its very difficult to not recommend A FREE GODAMN game.  Yes, its incredibly short. But holy ♥♥♥♥ is it cool as hell.  Download it, enjoy it. MAYBE play it again later. What have you got to lose?",
            "review_score": "1"
        },
        {
            "review_text": " Very short but nice proof of concept.   Got bit of a stutter with 980 and high settings in some parts of the scene.   In the end this sounds and looks like Star Wars (especially the ligthsaber) and that is a big plus for me.",
            "review_score": "1"
        },
        {
            "review_text": "Very recommended as a short intro into VR, but that's all it is: A short demo (akin to theBlu)",
            "review_score": "1"
        },
        {
            "review_text": "Very cool Star Wars demo! It was awesome seeing the Millenium Falcone, Tie Fighters, R2D2, storm troopers and hearing Han and Chewie argue. Can't wait for the full game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun short Solo's VA is pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Cool little experience, great light sabre sound/feel. Worth a download.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it's five minutes long.  Yes, you are right to want more from it.  NO, you are not right to give it a thumbs down.  I spent every second of those five minutes gawking like a giddy child at the idea that I get to do something like this in my lifetime. It's Star Wars in VR, from ILM themselves. And it's wonderful!  I'm officially beyond hyped to see David Goyer's Darth Vader VR experience when it comes out. Bottom line: Trials on Tatooine is an AMAZING experience. And let's not forget, it's free! If you have a Vive, you have no reason not to make the space for this on your hard drive.",
            "review_score": "1"
        },
        {
            "review_text": "Short but very fun and impressive. Please make more!",
            "review_score": "1"
        },
        {
            "review_text": "Very short Star Wars game, but maybe there is coming more from the developers.  Pros: - Experience the amazing Star Wars Intro in VR! - Beautiful graphics - Millenium falcon and R2D2 - Real Lightsaber! - Free!  Con: - play area is quite small and can't be moved, I was lucky that I could reach the buttons - no movement - only 1 controller is used - 'gameplay' is only 2 minutes. Press some buttons and then deflect 10 or so blaster shots from stormtroopers. That's it  As a free game, you can experience it and have a real lightsaber in your hand for rougly 1 minute. But there is now way that one should pay for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Ok it's really short but it's nice and free, ffs",
            "review_score": "1"
        },
        {
            "review_text": "It's short but hey it's free and it's Star Wars.",
            "review_score": "1"
        },
        {
            "review_text": "Short but I liked it. Nothing like reflecting blaster bolts back to the troopers. Played on 'high quality' the second time through it ran smooth on my 980TI VR. Still the Unreal engine and I wonder why since Disney has deep pockets. Has to be the limitations of GPU and the 1st gen VR gear.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely short, free experience for Star Wars fans. I'm only recommending it because it's free and allows you to use a lightsaber against droid gunfire, but for me, it didn't have any audio and R2 looked weird.",
            "review_score": "1"
        },
        {
            "review_text": "Very short and I had perfomance issues on AMD Fury X",
            "review_score": "1"
        },
        {
            "review_text": "Amazing little demo. If you're a Star Wars fan or not, this free cinematic experience is worth downloading.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Saber sound effect needs to be louder like Lightblade VR, but this one feels more natural and authentic. Need full game...",
            "review_score": "1"
        },
        {
            "review_text": "it misses some COOKIE file and i cant open it :( that means i cant launch game :( and i cant launch it even if i restart my computer... please do something with it, so for now i click that i dont recomend this game because i dont... if you will fix it, we'll see! :)",
            "review_score": "1"
        },
        {
            "review_text": "The game has great potential, but it is way to short !",
            "review_score": "1"
        },
        {
            "review_text": "it misses some COOKIE file and i cant open it :( that means i cant launch game :( and i cant launch it even if i restart my computer... please do something with it, so for now i click that i dont recomend this game because i dont... if you will fix it, we'll see! :)",
            "review_score": "1"
        },
        {
            "review_text": "Good, Free, and Short. That's all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "Don't be fooled by other reviews, this is a great game. Harrison Ford got ♥♥♥♥♥♥ off when asked to do Hans voice, and demanded 50,000 dollars. When asked about VR and his opinion on the project he stated 'F*** Off! I'm done with this Star Wars s***! I don't care about whatever VR is!'",
            "review_score": "1"
        },
        {
            "review_text": "The game has great potential, but it is way to short !",
            "review_score": "1"
        },
        {
            "review_text": "A bit disappointed about the quality of this one. The graphics aren't that good (except R2D2 who looks amazing!) and the little gameplay doesn't really do anything as far as I could tell. But still, it's Star Wars and you get to wield a lightsaber, deflect lasers and see the millennium falcon for the great price of Free so I can't really complain to much. I really hope that they do more of these in the future though because VR and Star Wars could be the best thing ever!",
            "review_score": "1"
        },
        {
            "review_text": "This was a cool short experience that gave a great feeling of being in a star wars scene. It's a demo that s free to try and it conveyed the feeling of being in the world of star wars. Ran good enough on my GTX970, low quality, but it ran smooth and got the whole vibe it was going for. Great feeling turning on a lightsaber and seeing the Millenium Falcon landing right next to you. Definite must try for any star wars fan and would love to see longer game of this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Star Wars and have a Vive this is a must, but there is no mention of a minimum play space needed. I am at Vive's minimum and that was too small as I couldn't reach some controls for the experience. It is a shame as it really took away from the overall immersion, but this was still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its a FREE star wars experience that was never intended to be released to the public until everyone requested it. Be greatful to have a chance to experience it. Its super short but well worth the download,",
            "review_score": "1"
        },
        {
            "review_text": "This was a pretty cool experience. I did feel a bit weird in this particular game as the view seemed a bit jumpy, however, the interactions were pretty cool",
            "review_score": "1"
        },
        {
            "review_text": "Yes it's short; it's a quick demo on what's to come. I enjoyed it and cant wait for more!",
            "review_score": "1"
        },
        {
            "review_text": "A truly brilliant VR experience, not even joking it's extremely well made and has great graphic fidelity, i'm only annoyed that the buttons on the ship were just beyond my physical wall but fortunately the experience can go on automatically even though I couldn't press them when it told me to.   Overall I give it 8 'Han Solo Dies' out of 10, bloody brilliant m8s :^)",
            "review_score": "1"
        },
        {
            "review_text": "10 minute VR showcase. Feels like a 'first-gen' VR demo, as it requires quite a lot of room space and is not very well optimizted.  Works decently as a way to demo VR for your friends (that's why I'm recommending it), but that's about it.   4/10-ish, no replay value whatsoever and hardly any gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Not much here push a few buttons wave your lightsaber around and pretend to block some stormtrooper blasters. I'd heard great things about it but after the lab and waltz of the wizzard this was just a let down.",
            "review_score": "-1"
        },
        {
            "review_text": "dropped frames and stuttering bad graphics very very short (3min gameplay?) very dissapointed...  if youre a star wars fan, check out lightblade VR, way more fun than this",
            "review_score": "-1"
        },
        {
            "review_text": "well that was a fun 1.5 min",
            "review_score": "-1"
        },
        {
            "review_text": "Even as a free game I wouldn't recommend it. It's basically just a commercial for the Star Wars franchise. With watching the beginning intro (Scrolling text) and credits, the total time spent was only about 7 minutes.  All you do is kind of look around a bit, you get to see the millenium falcon and I guess if you're a die-hard fan you might like that, but there is almost nothing to this.   Yes, I know it's free, but that doesn't mean it's good just because it's free.",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously, a 600mb+ patch to add so we can press ctrl+h ON OUR KEYBOARDS!!! Are they really that incompetent?  Please stay with movies, and NEVER make another VR game, beucause this is a ♥♥♥♥ing joke!",
            "review_score": "-1"
        },
        {
            "review_text": "Look, people are giving it thumbs up for 2 reasons: - it's free - it's star wars  I hardly consider this a demo. The whole experience lasts 5 minutes, of which, half are just listening to talking. You push like, 3 buttons to 'fix' the falcon, and then spend about 1:30 deflecting (or not, because you don't actually take damage) blasters with a lightsaber.   Not worth the time or hard drive space, IMO.",
            "review_score": "-1"
        },
        {
            "review_text": "Misread the title and thought it was a trial for a tattooing VR game, very disappointed .",
            "review_score": "-1"
        },
        {
            "review_text": "This is a short Star Wars demo. I am using a GTX 970 and FX 8320 16 gigs of RAM system. The visuals were nice but blurry. Meaning: not clear at far distances at all so I had to guess at the last minute where the phaser fire was going to travel. I think the demo is brokern becaue after I had to press the red button the game was stopping going black and starting and repeating several times. Therefore, I missed some of it. It still finished but was broken in the middle of the presentation. I hope they fix the problem because that kind of ruined it for me. I am going to give it a thumbs down (because there is no caution button) until I hear something about the stop and start issue and blurry textures. It is worth at least watching and playing through but may be poorly optimized for some people. I did try all 3 graphical settings and it seems the High Level graphics worked the best but there was still breaks in the game play with it phasing in and out. I'll have some video up soon.  The video will show when ready and be in HD after YouTube processes it fully. Enjoy.         YouTube™ Video:  Star Wars VR Trials on Tatooine Demo With My Niece Ariel&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Held a lightsaber in my hand for 3 minutes with rolling credits.  10/10 would join the dark side to strangle the devs for this pathetic excuse of a demo!",
            "review_score": "-1"
        },
        {
            "review_text": "What a joke is this game. I can't even call it a game. Graphics are ok, gameplay is 0. Why do big websites even metion this. Sorry ILM is a special effects company that could do a whole lot better. ",
            "review_score": "-1"
        },
        {
            "review_text": "tldr: Millenium Falcon was smaller than i thought it would be. 4/10  It's a free proof of concept so I shouldn't be annoyed but I am mildly. Probably due to my own misguided expectations. Press a few buttons. Bash back some incredibly slow blaster fire. Try and drag that bit out and Han (excellent voice acting btw) will nuke them and kill the fun. Extend and retract your lightsaber 50 times during the overally triumphant closing credits that seem longer than the game. Thats about it.  Taking apart the individual components and extrapolating to a full game/experience for some reason doesnt make me particularly excited but in time I could be grateful for the lowered expectations.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of time",
            "review_score": "-1"
        }
    ]
}