{
    "app_id": 381910,
    "name": "Xenocide",
    "release_date": "2015-08-28",
    "developer": [
        "Confused Genius"
    ],
    "publisher": [
        "Spawn Point OSK"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Survival"
    ],
    "achievements": 26,
    "positive_ratings": 20,
    "negative_ratings": 5,
    "price": 1.99,
    "description": "Xenocide, the savage struggle to survive against an endless horde of enemies intent on tearing you a new one.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/381910/header.jpg?t=1519648289",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: Intel / AMD 2.0 GHz CPU Memory: 2 GB RAM Graphics: Nvidia 8800GT or equivalent DirectX: Version 10 Storage: 400 MB available space",
    "recommended_requirements": "OS: Vista, Windows 7, Windows 8 Processor: Intel / AMD 2.0 GHz or higher CPU Memory: 8 GB RAM Graphics: NVidia or ATI-based graphics card DirectX: Version 11 Network: Broadband Internet connection Storage: 400 MB available space",
    "reviews": [
        {
            "review_text": "It's okay, but it feels very unpolished. How the controller settings don't use the D-pad is beyond me. The game is as simple of a top-down shooter as you can get. There are no upgrades, but you can choose from a selected set of power-ups. There isn't much incentive to keep playing this game since there are only 6 levels, all of which are pretty similar (but have different goals). There are very few variety of enemies, guns, and grenades. It just feels like an unfinished game that is probably best suited as a 99 cent mobile game.",
            "review_score": "-1"
        },
        {
            "review_text": "Being a tester of this game and friend of those who made it, I can't say this review it's unbiased, but I'm being honest as I can when I say the overall deserves a positive outcome:  Good points: -Fun co-op game, specially if you try to beat highscores with friends. -Enough variety of weapons and power-ups to keep you interested for a decent amount of hours. -The tasks set by every map are quite different for every one.  Bad points: -Needs more long-term fun or re-playability. -No single player mode. -High price.  Almost the only thing that anyone can complain about this game is the 'price vs hours of fun' issue. If you obvious that, Xenocide is what it is: a top-down shooter with zombies, waves and tons of bullets. It could totally fit as an arcade machine game.   It's true that with a little bit more of graphical polish it could look way better and with some hours of a single-player mode, it could be a 6€ game. Despite so, being a game from a rookie indie developer team, it's fair enough, they made it.  So, to sum up: take it if you get it cheap or with a friend, because that's the way you'll take the most of Xenocide, by playing with games. If not, let it be and wait for the next game of these guys, pretty sure it'll be way better.  Peace. ",
            "review_score": "1"
        }
    ]
}