{
    "app_id": 382050,
    "name": "Eon Altar",
    "release_date": "2016-06-22",
    "developer": [
        "Flying Helmet Games"
    ],
    "publisher": [
        "Flying Helmet Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Local Multi-Player",
        "Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Action"
    ],
    "achievements": 41,
    "positive_ratings": 550,
    "negative_ratings": 72,
    "price": 3.99,
    "description": "Your smartphone is your character! Eon Altar brings modern technology to the social experience of couch co-op gaming. Voice your character, choose which secrets to keep and what lies to tell. Gather your friends, order the pizza and descend to the depths of the Eon Altar!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/382050/header.jpg?t=1496379785",
    "minimum_requirements": "OS: Windows 7 Processor: 2.4 GHz Dual Core Memory: 4 GB RAM Graphics: 512 MB NVIDIA GeForce 9800 / ATI Radeon HD 2600 XT DirectX: Version 9.0 Storage: 4 GB available space Sound Card: Direct X compatible Additional Notes: Local WiFi Connection",
    "recommended_requirements": "OS: Windows 10 Processor: 3.1 GHz Quad Core Memory: 8 GB RAM Graphics: 512 MB NVIDIA GeForce 9800 / ATI Radeon HD 2600 XT DirectX: Version 11 Storage: 4 GB available space Sound Card: Direct X compatible Additional Notes: Local WiFi Connection",
    "reviews": [
        {
            "review_text": "This game turned my girlfriend, a dungeons and dragons / pen and paper / rpg skeptic, into a fan. Who sat through the whole first episode in one go, and by the end was well into acting out our characters speach, and being a sly wee bint with the 'secret thoughts'.   I could leave it there, but I won't.  This game is a pen and paper RPG come to life. Your phone is your character sheet, and it tracks all the usual statistic you'd expect from a pen and paper rpg, as well as modern role playing games. Each class comes with a set of predetermined skills, abilities, and proficiencies. You use the phone to control your character, and take all your actions so as not to disturn the gameplay of the other players.  Dialogue for your character appears on your phone screen for you to act out, as do the choices you get to make. These are not shown to the other players, and allow you to make choices that you they can't see, and allows for some good crossed motivations and party interactions. As well as the dialogue being on your screen only, some of the npc interact secretly with your character by whispering to them, and these interactions are played out on your screen only and its at your discretion whether you share this with your party or not. The rest of the interactions are fully voice acted, and displayed to everyone on the main screen.  This game is tactically difficult at lower levels, and the random combat arena is fantastic. The different mixes of classes can make for so many strange encounter. There's a lot of synergy between the class abilities and affords good oportunities for teamwork.  The combat in the game is tense. With the relatively high power enemies vs hit point of your party, every encounter feels vested. In the higher levels of the combat arena we found ourselves actually cheering a Pyrrhic victory, much like my pen and paper group would.  The player character design is chunky. Your tank character feels like a tank, with exaggerated bulk and huge shield. Your sneaky rogues are sleak, with short curt attack animations. The aestetic is perfect for the games style, and I really enjoyed it.  In truth, I can't speak highly enough of this game. As a dungeon master, as a player, as a video game player. They have created a great wee experience that emulates the pen and paper investment, tension and group dynamics that's been missing for games recently.  Here's hoping they can keep up the good work.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun. Now I only need some friends to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "This game is about the closest you can get to a video game equivolent to a pen and paper RPG session as you can get. I say that as a person who runs tabletop RPG sessions. It's a 1-4 couch co-op game over the same wi-fi connection.  The game starts off with 5 characters, having their own background, meet up to go into an underground fortress. Each of these characters have their own playstyle, along with their own agenda. This is where actual role playing is involved. Each of your characters dialog is spoken out loud by you for the other players to hear (or in some cases to not hear). Interactions between the spellcaster and the cleric are downright fun.  Control is handled by a phone or tablet each person connects to the game through the same wi-fi connection. Your phone/tablet contains all of your characters information and is your control device. Controls handle very well, you can do either point and move style, or joystick like control by touching the outer section of the control ring. Your device will make a notification sound when your character has something to say or think. Some options are entirely up to you to share with the group or to keep them secret.  Combat in the game is turn based, much alike a tabletop RPG. Your character has a range of movement they can move per turn, followed by an action if they are in range to do so. Communication is key when you are playing with friends, turns can be wasted if someone who could have hit a target further out kills one where a close range couldn't.  This leads to character development. In your options menu is where you can upgrade your character. There's two ways to do so. Abilities give your character new skills such as making items, or bonuses to stats. The other is upgrades, this option inceases your abilities of your weapon and armor. New physical attacks, and defensive capabilities to use in combat are learned here. Both of these upgrade types require resources and are tiered by godstones. You earn them at checkpoint like spots throughout the game. The resources you get are common (found on most humans and some smashable items), Remnant (found on monsters, and in food like barrels), and Precious (money like resource found in chests).  This leads to my only gripe with the game is the resources themselves. The person who picks up resources is the one who gets them. Whereas most games have a shared mechanic this one doesn't. Understandably it's a role-playing game and there is a trading interaction, however upgrades are the same across the board for each character and they don't come cheap either, so if you have a friend who likes to hoard every resource, your game can come to a quick stop.   All in all it's a very great game, one i cannot wait for all 9 episodes to come out.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of the greatest RPG experiences I have ever played. I am in the middle of writing a full review for my website, but I need to get the love out there for this NOW! Seriously, download the app on your phone, get the game, get some friends and be ready for an awesome time. The joy of a tabletop RPG with the simplicity of an video game RPG. And there is no need for a GM!",
            "review_score": "1"
        },
        {
            "review_text": "I've always wanted to try them pen and paper RPGs, but lack of experienced dungeon masters, players and further lack of material (tabletop gaming stuff is hard to come by in my part of the world) meant I never got around to it.  Until now. Managed to rope in my brother for a few hours worth of Eon Altar and it was pretty amazing. Probably no substitute for the real thing, and we're only 2.5 hours in but we liked what we saw.  Would love love love a map view though, few times we did get lost looking for objectives. Of course, if we were really pen and paper RPGers we would draw our own, but would still love the option of an in-game map.",
            "review_score": "1"
        },
        {
            "review_text": "but i wasn't done..  great game so far. easy to jump right in. would recommend.  my suggestions:  - loot should be grabbable for a while longer after cutscenes - on-screen subtitles would be great to go along with mobile - give me episode 2 now ",
            "review_score": "1"
        },
        {
            "review_text": "Had a great time playing the first episode with friends! Excited for episode 2 and maybe by that time we will have figured out how sneaking works.",
            "review_score": "1"
        },
        {
            "review_text": "The whole smart phone as a controller thing is neat. Neat starting off point I hope to see more games that use your phone as an input.",
            "review_score": "1"
        },
        {
            "review_text": "The idea of role playing using your mobile phone as a controller is a great idea.",
            "review_score": "1"
        },
        {
            "review_text": "  Loved the game, enjoyed the free steam-card that was given out. Might find a friend who could use the 2nd one :D It's a fantastic mobile control game with the point of playing in a party with others by a lan-connection. #DreamHackAustin #EonAltarGreatness",
            "review_score": "1"
        },
        {
            "review_text": "very fun game just wish i didnt have to buy the other episodes",
            "review_score": "1"
        },
        {
            "review_text": "Roses are red, war is near, we would all be safe, if Harambe was here.",
            "review_score": "1"
        },
        {
            "review_text": "At this moment and to be quite honest any past moment i can't recommend this game at all. The controller app just doesn't detect the game and before anyone says anyhting, I've tried various fixes from the makers and various other people to no avail. F this!",
            "review_score": "-1"
        }
    ]
}