{
    "app_id": 382130,
    "name": "Exile's End",
    "release_date": "2015-08-31",
    "developer": [
        "Magnetic Realms"
    ],
    "publisher": [
        "Marvelous"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Metroidvania",
        "Platformer"
    ],
    "achievements": 11,
    "positive_ratings": 30,
    "negative_ratings": 13,
    "price": 6.15,
    "description": "Japan's take on classic Commodore 64/Amiga action-adventure games. NOT a Metroidvania. Use your wits and your weapons to discover an ancient secret and gain your redemption. Art and music by Japanese legends of console gaming.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/382130/header.jpg?t=1478856024",
    "minimum_requirements": "OS: Win XP SP2 64-bit Professional Processor: Intel Core 2 Duo, 3.00 GHz or equivalent Memory: 2 GB RAM Graphics: GeForce 8800GTS 256 MB RAM or equivalent Storage: 300 MB available space Additional Notes: Requires OpenGL support",
    "recommended_requirements": "OS: Win 7 32-bit Home Basic Processor: Intel Core i5-2300, 2.80 GHz Memory: 4 GB RAM Graphics: GeForce GTX 280 1 GB RAM or equivalent Storage: 500 MB available space Additional Notes: Requires OpenGL support",
    "reviews": [
        {
            "review_text": "I finished this in 4 hours, 27 minutes, but that is a bit deceptive. There was a major bug at release and I lost the first 6 hours or so of play and had to start over. I knew what to do then and repeated that 6 hours worth in like 2 hours. That 4:27 apparently doesn't count loading a saved game either (which I didn't have to do very often). Steam shows 12.7 hours total. I'm guessing it would take a new player about 6-8 hours.  The graphics, sound and music are all fine. Nothing sepectacular, but adequate and even fairly good for the most part.  The game has a few flaws, but I found it quite fun and worth the asking price.  My biggest problems with the game were:  1) The beginning area (forest) is not really very fun. You start with nothing and you take fall damage. It is very easy to die by stepping off the wrong ledge. They did add a way to look down (hold 'down' for a few secs) so this part should be a little better now.  2) Most of the bosses are too easy. At least two of them have a 'safe spot' where you can stand with almost no danger and kill them with your infinite ammo default handgun.   As to whether it's a a Metroidvania or not, I would say 'yes'. At first it feels a little more like 'Out of This World', but as you progress and start finding power-ups and new weapons, it defintely starts feeling more like a Metroidvania.   When you die, you restart on the screen you are on, from an auto-save so your hp, ammo, etc. are all restored to when you first entered the screen. There are no checkpoints and you can save anywhere. When you re-enter a screen, all the enemies have respawned, making it easy to farm hp or ammo.   I wish there was a hard mode.   Edit: I also should point out that at the end of the game I got a message saying I had found only 46.7% of the items, so there was a lot more exploring and discovery that could have been done.",
            "review_score": "1"
        },
        {
            "review_text": "I've only played 3 hours, but this game gives me twinges of Out of this World, Flashback, Super Metroid, a Boy &amp; His blob, the cutscenes are straight up Wing commander or Ninja Gaiden and the music? The music is a perfect fit for the late 80s early 90s aesthetic the game is going for. Pretty much nailed everything! The ONLY negative I've found so far is the default CRT shader is a bit overpower with the bloom effect, but the subtle setting nails it. If you like side scroller action adventures, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is an okay game if you're looking for some retro metroidvania game....But it has one major flaw that no one can overlook. IT HAS NO F*****G QUEST INDICATOR. So you spend 5/7 of playtime just going to and fro every corner of the map searching how to use the last item you got..... It really frustrating.   Furthermore, I happen to have skipped the cutescene were they tell you what you'Re doing in the game, so now, I have not a single clue.",
            "review_score": "-1"
        },
        {
            "review_text": "Really great game with old school aesthetic. Once you get rolling and have some gear under your belt you start to feel like a bad ♥♥♥.  The music is really cool and the game is pretty addictive and fun to play!",
            "review_score": "1"
        }
    ]
}