{
    "app_id": 382120,
    "name": "Journey To The Center Of The Earth",
    "release_date": "2015-09-25",
    "developer": [
        "InSayn"
    ],
    "publisher": [
        "InSayn"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 425,
    "negative_ratings": 213,
    "price": 0.79,
    "description": "You love riddles and to combine logically? You love Jump 'n' Runs? You don't want to fight but you still want a challenge? Then you will love this Journey to the Center of the Earth! Control three adventurers with unique powers at the same time, or guide them individually in this narrative 2D puzzle platformer...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/382120/header.jpg?t=1551204062",
    "minimum_requirements": "OS: windows XP Processor: 2 GHZ Memory: 1 GB RAM DirectX: Version 9.0c Storage: 128 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Review Written on Saturday, March 19th, 2016    Review",
            "review_score": "1"
        },
        {
            "review_text": "  Got this for free from someone randomly posting keys on facebook, and judging from the fact that out of 307 reviews, 302 are key activations, that's probably how most of the people got it. It's not completely bad...it's like a poor man's Trine. But then again, you can get Trine for about 2$ during steam sales. Is there any reason to get this instead? No, there isn't.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a scam. There's no Linux version (missing executable). Steam was notified, the Linux OS icon is still on the store page...",
            "review_score": "-1"
        },
        {
            "review_text": "+++",
            "review_score": "1"
        },
        {
            "review_text": "Really good cancer. 2000/1",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad if you like platformers!",
            "review_score": "1"
        },
        {
            "review_text": "  + Game Have trading cards  - Hello from 1992 year",
            "review_score": "1"
        },
        {
            "review_text": "So I guess it's 'Journey to the Mysterious Island' that has The Rock in it? This game is about three skinny white guys dicking about in a cave and not at all about Dwayne Johnson. Don't fund this obvious bait-and-switch, avoid this game like the plague.  Honestly, if you wanted more of The Rock just watch that movie where he's the cop and he shoots up that Indian reservation. Now THAT'S something they should make a game out of.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it to win the contest  Tapped out by level 7.  avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "  as i got it for free from a promo(can't remember where ) fully enjoyed it",
            "review_score": "1"
        },
        {
            "review_text": "    Introduction",
            "review_score": "-1"
        }
    ]
}