{
    "app_id": 382180,
    "name": "Devilry",
    "release_date": "2015-06-30",
    "developer": [
        "New State"
    ],
    "publisher": [
        "New State"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Horror"
    ],
    "achievements": 13,
    "positive_ratings": 40,
    "negative_ratings": 19,
    "price": 2.89,
    "description": "Survive the night in your rural home as a sinister apparition wreaks havoc in the stately manor. Protect your family from the ghost using a variety of tools and weapons found around the estate.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/382180/header.jpg?t=1468063214",
    "minimum_requirements": "OS: Windows 7, Windows 8 Processor: Intel Core i5-750 or AMD Phenom II X4 955 Memory: 6 GB RAM Graphics: 1 GB DirectX: Version 11 Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "In Devilry, you play an irresponsible, paranoid, quite possibly alcoholic father (well, I assume it's a dude) whose chosen method of 'protecting' his family against a marauding ghost is to run directionlessly about a house with very few working light switches, scary pictures on the walls, terrifyingly huge teddy bears, 'broken' cameras which emit UV signals by sheer accident and radios which only seem to emit a signal from the very depths of Hell itself...while said family members attempt to sleep in separate rooms with THEIR EYES WIDE OPEN IN ABJECT TERROR. Maybe I beat on them during the daytime or something, and frankly, I'm not sure the encounters with the 'ghost' aren't just in my own booze-addled head.     Perhaps this was influenced by the Kubrick version of The Shining? Only set in a 'regular' suburban house with epic fountains out in the garden and what-not (like we all have). Perhaps this is intended as a biting social commentary on the peculiar, first world-y madness which only upper middle-class families can generate for themselves, in a world where status creates stresses we neither need nor benefit from? Or perhaps it's just another example of a horror 'game' which serves as little more than an admittedly impressive 'showcase' for the programming - if not exactly STORYTELLING - talents of its alleged 'developers'?! I mean, it's atmospheric and spooky and ♥♥♥♥♥, but WHAT EXACTLY AM I SUPPOSED TO BE DOING?!?     Let me put it another way: Have a look at all the 'positive' reviews for this game on the Store page - including mine! - and see how short all the playing times actually are. If you find it on super-sale and fancy a quick, creepy ♥♥♥♥-around inside a small-but-spooky map, then go for it. Just don't expect a proper 'game' for your hard-earned cash. Oh, what ambivalent times we live in: So many horror games for those of us who covet such things, yet so few with anything one could describe as quality 'gameplay'. Still, it is a great feckin' era for SHOWCASES, ennit? Here's to the next generation of horror game designers progressing past the 'tech demo' stage...character, story and gameplay, anyone? Ooh, I'm so old-fashioned...   Verdict: 6.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Very good little horror game. Good graphics, terrifying ambiance. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The ghost game you've been waiting for! I've only played a few minutes of this game. And it's terrifying. From doors flying open by themselves to random bangs and scratching sounds. Every room, your visibilty is very limited and this game is guaranteed to make you play with a light on.",
            "review_score": "1"
        },
        {
            "review_text": "Can't recommend this game at the current price. This is a $2.00 game at best. Here's why:  Horrible control scheme: 1 button to toggle your weapons, 1 button to toggle items, and both from the same inventory list. Should've just hotkeyed the 5 inventory slots, but the clumsy inventory scheme is possibly the only thing to make the game challenging.  Horrible sound design. Awkwardly clumsy/loud footsteps, wildly varient levels if you simply turn in place. Stupidly loud security alarms. Bad choices for radios and televisions.  Horrible level design: 1 bathroom, no shower, 3 bedroom, oversized-basement, open attic, thoughtless layout based on no home that exists in reality, sparcely and horribly furnished with little effort to make each room make sense or unique for its purpose.  Horrible concept: you're supposed to run all over your house making guerrilla warfare against a ghost while leaving your vulnerable family to sleep defenselessly in 3 separate rooms, and the design is so lazy that your sleeping wife and daughter don't even sleep with their eyes closed.  Horrible ghost: once you've encountered this ghost 2-3 times it becomes boring and predictable, and the only challenge is navigating the silly inventory scheme while said ghost smacks you around.   Horrible menus: not enough options on graphics and the motion blur is overdone by default, and when your scenario ends it's hard to be sure what the outcome was, did you win, or did the ghost win? One second you're fighting the ghost, the next you're restarting from the beginning. I assume that means 'you lose', but for all I know I've won the game half a dozen times.  This game provides a short-lived bit of mild jump scares...then it's just tedious and boring. Don't bother. These lazy devs got my money. I recommend you keep yours.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is one hot bag of complete and utter failure.",
            "review_score": "-1"
        }
    ]
}