{
    "app_id": 382160,
    "name": "Dark Years",
    "release_date": "2015-10-16",
    "developer": [
        "RSK Entertainment"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 24,
    "negative_ratings": 68,
    "price": 9.99,
    "description": "Tehran is in the grip of fear following a series of grisly murders. Major Afshar has been tasked with finding those responsible.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/382160/header.jpg?t=1447376780",
    "minimum_requirements": "OS: Windows XP, Windows 7, Vista, 8.1, Windows 10 Processor: Intel Dual Core or Core 2 duo 2.6 GHz Memory: 2 GB RAM Graphics: GT640 or ATI 6750",
    "recommended_requirements": "OS: Windows 7, Vista 8.1, Windows 10 Processor: Intel Core i3 3.0 GHz Memory: 4 GB RAM Graphics: GT 760 or ATI 7770",
    "reviews": [
        {
            "review_text": "Remember  Guise of the Wolf?  This is the 2015 equivalent.  Dark Years comes 'complete' with horribly outdated textures, unrealistic character models, and some of the worst voice acting I have ever heard in a game.  The devs had to post a walkthrough (written in broken English) on the Steam forums because without it, you would never complete even the first level.   Click here to watch the first 20-ish minutes of gameplay of Dark Years. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bad, it is really bad. Even one of the worst games I've ever played. It is so laughingliy bad at some moments that is is funny again. You have to watch the youtube walkthrough of 'someguy' while playing through it, it is tooo funny :P. I would not recommend this game for it's full price, only recommend getting it in a bundle veery cheap. And then only to see what bad games do exist. You shouldn't take it to seriously, you should play it while laughing over the bad game design, story telling etc. If you are searching for a game which is funny and you can laugh while playing, take it. But it is not funny because it is trying to be funny, no it wants to be serious, but you can't hold back and laugh. So if you want to have a experience with a reeeeally bad game which is again good because it is done sooo bad, take it watch the youtube video in which the game analyses the game which is veeery funny, almost like watching a comedy show ;) Hope I could help you with your decision of playing this game:D",
            "review_score": "1"
        }
    ]
}