{
    "app_id": 382110,
    "name": "Virtual Desktop",
    "release_date": "2016-03-31",
    "developer": [
        "Guy Godin"
    ],
    "publisher": [
        "Guy Godin"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "VR Support",
        "Steam Workshop"
    ],
    "genres": [
        "Utilities"
    ],
    "tags": [
        "Utilities",
        "VR",
        "VR Only"
    ],
    "achievements": 0,
    "positive_ratings": 723,
    "negative_ratings": 316,
    "price": 10.99,
    "description": "Virtual Desktop is an application developed for the Oculus Rift, HTC Vive and WMR headsets that lets you use your computer in VR. You can browse the web, watch movies, Netflix or even play games on a giant virtual screen.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/382110/header.jpg?t=1513728802",
    "minimum_requirements": "OS: Windows 7 SP1, Windows 8.1 or Windows 10 Processor: i5-2500k Memory: 4 GB RAM Graphics: NVidia GTX 640 or 980M or ATI HD 7000/Rx 200 DirectX: Version 11 Storage: 700 MB available space Additional Notes: Disabling Aero can improve performance on Windows 7. If you are using a Windows 'N' edition, you will need to install the Media Feature Pack.",
    "recommended_requirements": "OS: Windows 10 Processor: i5-2500k Memory: 4 GB RAM Graphics: NVidia GTX 760 or 980M or ATI Rx 200 DirectX: Version 11 Storage: 700 MB available space Additional Notes: Windows 10 is highly recommended as it provides better performance. The Anniversary and Creators Update add 8K video and some H.265 support.",
    "reviews": [
        {
            "review_text": "Best stereoscopic porn viewer out there right now.",
            "review_score": "1"
        },
        {
            "review_text": "Description says tracked motion controller support, but you can't use them for input natively in the application. This is a bit misleading. This is the one feature I think that would make this a lot easier to use in the room space environment.",
            "review_score": "-1"
        },
        {
            "review_text": "Only way to watch VR porn on the Vive 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Extremely useable - no lag or resolution issues and very customisable. Makes using your desktop in VR a comfortable reality.  There's a few small bugs (milkdrop background clipped off the sides of my taskbar, had a few crashes) but that's to be expected this close to launch.  Looking forward to seeing how this improves over time - it'd be nice to see the video player get increased functionality and for the Millkdrop background to use Milkdrops 3D stereo functionality.",
            "review_score": "1"
        },
        {
            "review_text": "Using this on Oculus CV1.  Looks great, awesome tool. Voice support was unexpected, but very cool. Hopefully it adds more commands in time.  Biggest complaint is that 3D SBS videos need to be pushed in or out and fov experimented with (when played back with VLC). The built in 360/180 video player doesn't work well with a lot of high resolution (4k) content actually. I'm not sure if 4k is the actual cause of the issue (might be codec/fps etc), but it seems to be the issue. This is why I'm using fullscreen in VLC as a workaround. The direct to headset feature of the SBS looks like it could be the best option for this, but never lines up correctly for me. It definitely needs some sort of horizontal eye spacing adjustment or something because its close but not quite there.  My Wishlist: *SBS 3D direct to headset - pupilary distance adjustment options *Built in 360/180 video player - support more content (4k,60fps seems to be the issue mainly) *Game support so any game can be rendered in stereoscopic 3D *Hopefully in the future it can allow virtual monitors so we can have more virtual monitors than real monitors.",
            "review_score": "1"
        },
        {
            "review_text": "28 hours in and havent had any major problems.  The program it self is nearily worthless to have as a result of free soft ware that does the same thing. The only advantage that this program has is 360 videos. If they do not add new features fast enough it will soon be out matched by free programs such as big screen.",
            "review_score": "1"
        },
        {
            "review_text": "Great but could be even better.  My one big gripe is that even though you have an 'infinite' virtual space, you're limited by the amount of desktop space of your physical monitor (even if you're not using it). So, if you (like me) have 1 monitor at 1080p, then you're limited to 1 virtual screen at 1080p. There's no real reason this should be the case (except perhaps technical challenges). I've been searching for ways to trick Windows into thinking I have a second monitor even though I don't, just to get more screen space. That's a little silly.  I also think it would be awesome if you could move windows around independently of the virtual 'screen'. Perhaps move them around in the z-axis or just away from the screen. Again, this is probably not easy, but I would love it if it was possible.  This is a great, solid product. My favorite feature is that you can have the screen 'floating' so that you can center the screen not just horizontally but also vertically. This means I can put the screens on my ceiling and lay flat in bed! Every VR app should have this feature!!!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Must have for any HMD. Works great! Love the voice control options.",
            "review_score": "1"
        },
        {
            "review_text": "VIVE review. I have tried just about every game I play on Virtual Desktop. As of now, I give it a 7/10 completion score. The difference between this and BigScreen Beta is the transparent desktop and customization features. In games, you may run into...  THE problem: black screen flickering during menus but (often) not in gameplay -- so before you start messing with your graphics settings, actually try playing the game to see if the black strobing exists. If it strobes during gameplay, try turning on or off VSync, which almost always fixes it. If that does not fix your problem, ensure you're not using MSAA in the VIRTUAL DESKTOP settings (as it does nto play nice with AA in games), and possibly consider tweaking your AA in game (I keep Virtual Desktop's MSAA turned off by default, I see no difference with it on anyway). Still, some games just will not lose the strobe, and it is quite an unplayable experience. Fix the strobe, and this will the major contender for best premium VR desktop viewer.",
            "review_score": "1"
        },
        {
            "review_text": "  I really enjoy using it but I do have 3 things suggestions. 1. Please add Leap motion support so that I can use my hands to click things or so when I start it up I could draw where my keyboard is/an area where my mouse is so that when I look there it could 'turn on the camera' and show where the/my keyboard/mouse are, 2. Please Add/Have an option to change touch pad mouse(of the vive controllers) to be a laser pointer since its faster and maybe have it be the laser pointer but you could change it so if you touch the touch pad you could use it for more precision and then when you let go it would go back to where your actually pointing with the laser, 3. Maybe being able to move the desktop without having to 'Reset Orientation' maybe using the grip buttons like TiltBrush",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it. Its totally awesome. Highly recommend blowing up the FOV to 150+ and browsing the web. You will love it, so customisable and really polished.",
            "review_score": "1"
        },
        {
            "review_text": "I found Virtual Desktop to be really good for what it intends to be. It isn't perfect, but it provides a lot of great functionality.  My setup: Rift running VD from Steam. I borrowed a Rift while I wait for a Vive. So, I did not use VD through Oculus Home.  Purpose: I saw VD on Rift DK1 a while ago and it seemed like a good utility. There are times when I need my desktop in VR. Later I was impressed with the added tools for using your PC in VR. Finally, I was very interested in how well playing regular PC games through VD.  In general, I was very pleased. The general effect was that my monitor was closer to my face. With the curved option (recommended), it worked really well. I found myself making the desktop larger rather than smaller to get me closer. With my screen filling my vision, I could see everything easily. If the screen gets small (so you don't have to move your head as much), the text quality suffers because of the resolution of the headset.  I watched some video, but I was really focused on gaming. I feared that one could only play in Cinema mode, but I found that to NOT be the case. I was pleased to see the full screen display, and I was excited to see what it looked like. I played ESO, Fallout 4, and WoW.  The World of Warcraft I am a long-time WoW player. Entering the world with the VR headset changed the whole world. All I saw was the game world. With the curved view, there was an illusion of being surrounded. The display was 2D, but my vision almost made it 3D. I went to first person and it was the first time I felt like being in that location. Your sense of scale changes.  Elder Scrolls Online ESO was amazing and really looked great. For some reason, and I really don't know why, but the size of everything around me in ESO seemed correct. Once again, I really felt a new level of immersion and almost as if I was there.  Fallout 4 I had some difficulties getting this one to work at first. In general, I found that if you had problems, make sure to start the game from it's original launcher (to fix the load error message), and put the game in Windowed (Fullscreen) mode. Fullscreen didn't always show in the headset. Fallout 4 did not seem quite the right size. Making the screen smaller in the VD settings helped some, but then the top and bottom edges show more and that detracts from the effect. Fallout 4 just seemed too big. This may be subjected, but it seemed somehow my brain started comparing sizes and things just seemed too big (unlike ESO, which just seemed right).  I like having the games list in the VD app, but some games worked from there while others didn't. However, if I launched titles normally, they worked.  I did have some issues. The biggest is that if there was some kind of Windows Security warning (UAC), it didn't show on the headset monitor. There was no dimming either. I had no idea that there was a message until I took the headset off and looked at the real monitor.  Keyboard use was awkward. I am a touch typist, so I could do it, but if someone is not, the keyboard is useless. However, for a desktop replacement, I require a keyboard. The Vive may solve that with its web cam, but with the Rift, I struggled some.  Because the desktop displays a view from a physical monitor, the utility is reduced some. However, for me, having my nose practically to the screen made it worth it. With a physically smaller monitor, a headset user could enlarge the view to see a much better picture. The game screens blow away normal views right out of the water. That reason alone makes this a good purchase for me.  Some folks may be put-off by an apparent roughness to the image; however, that is a quality of the headset and NOT Virtual Desktop.  In the future, I would like to see the following: 1. Show all message on the Virtual Deskop instead of only on the physical screen (probably the primary display). 2. Integrate something to mimic the keyboard, even if it is a gamepad keyboard.  I really like Virtual Desktop. I can't replace every day use yet, but I will play my games with it as much as I can.",
            "review_score": "1"
        },
        {
            "review_text": "Great Product, everything implemented works as it should. One feature I don't often see mentioned is the ability to play normal pc games in front facing 3d (sbs). You need to have another peice of software to make it work as far as I know, but it works! It would be great if the devlopers could implement the ability to watch videos overUnder with on screen Anamorphic display.",
            "review_score": "1"
        },
        {
            "review_text": "This app was the reason I bought an Oculus Rift (and pre-ordered a Vive!)   It could use a little bit more polish, but it's already mind blowing and surprisingly feature rich. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best app you wanna get for your VR if you want to watch some VRporn :) 8========D~~~",
            "review_score": "1"
        },
        {
            "review_text": "Horrible UX for the vive.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good app for working with your desktop in VR!",
            "review_score": "1"
        },
        {
            "review_text": "This is my go to app for any desktop work, with SS on I really don't need my monitor anymore.",
            "review_score": "1"
        },
        {
            "review_text": "So after having tried this software i would not recommend it. First of all it does not shutdown properly, even preventing steam from shutting down. Then while in the virtual desktop the text is near impossible to read on your desktop, it's impossible to know what is the title of film your trying to watch. Lastly even though you do can listen to ANY VR video on the web the quality on a normal screen is way better than in the Vive. The screen distance does not help much when all that is needed is a zoom function. As a side note, the new 'touchscreen feature' is far from efficent compared to the laser beam every other software use...",
            "review_score": "-1"
        },
        {
            "review_text": "This product does not support Vive motion controls. That is a critical omission in a product that supposedly supports the Vive. Using a keyboard and mouse in VR is both uncomfortable and impractical. Video playback UI is spartan and poorly designed. There isn’t even a time indicator, so skipping to a particular time is a guessing game.",
            "review_score": "-1"
        },
        {
            "review_text": "Well ... of course you can find out that this app doesn't support the Vive's controller but has to be controlled via mouse/keyboard befor you buy it, but would you really expect that? Anyway ... without the option to use the Vive motion controller it's not much fun to use. If I want to use it for watching movies I'd expect to be able to start them from within the VR (ie sitting on the couch) regardless if it's in the movie theater mode or from the video tab in the app. For controlling the VRized Windows desktop this might be hard/not possible, but at least for controlling the features of the app this should be added shortly.",
            "review_score": "-1"
        },
        {
            "review_text": "Says it works with netflix but just a black screen for me :(",
            "review_score": "-1"
        },
        {
            "review_text": "Its okay I guess, but no worth the money sadly, keep working guys, I will gladly change my view if I see something better in it.",
            "review_score": "1"
        },
        {
            "review_text": "This product did what I hoped for it to do. It works very well.",
            "review_score": "1"
        },
        {
            "review_text": "love it on my CV1, essential software. rocket league is a blast through virtual desktop",
            "review_score": "1"
        },
        {
            "review_text": "It works really well. It's by far the most polished of the VR desktop options at the moment, I've been playing Command: Modern Air Naval Operations with it, using a Logitech Trackball I can play the game standing up (using the Windows touch keyboard for entering the odd number etc).  It's not as fast as sitting down, but after a long day of sitting down using a normal mouse it's great to stand up and walk around playing a game.   I can definitely recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Of course you need this. Best way how to watch the adult movies :).",
            "review_score": "1"
        },
        {
            "review_text": "Without SLI support making this work for many users will be a nightmare of turning surround on and off. Why ruin your opportunities with those most likely to use VR and pay for a product like this?  Sadly, even asking for support you are more likely to get ignored or insulted than getting any help.  I simply can't recommend this app with the current state of development or the developer.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad at all,",
            "review_score": "1"
        },
        {
            "review_text": "It disappeared from my library. When I search for it in the store, it says it's in my library already, and it won't open. It says it does not support the HTC Vive. Steam won't give me a refund either. What a ripoff.",
            "review_score": "-1"
        },
        {
            "review_text": "I will recap my refund request here to show what the shortcomings of the application are:  No multi-monitor support for virtual monitors. After testing 4-5 different multimonitor emulating programs, I was not able to get it to detect a display, although windows was definitely doing so with several different configurations, and this was my real goal for getting this, to have multiple workspaces.  This one was my bad, as I did not read/trust enough reviews thoroughly to avoid this product. That's on me, for that I wouldn't request a refund.   Key features the store page advertises, though, did cause me to seek one. I would have bit the bullet and only been slightly disappointed if the other features worked fine, since I was the one who screwed up, not the dev. Unfortunately, that was not the case.  After playing around with troubleshooting/reconfiguring/begging google for a forum with some magic voodoo fix for the bugs, I was not able to use the features as follows: Youtube/Saved video support in its video viewer. All would return an error message, despite attempting several workarounds even.   Then, the background inexplicably left the screen and all I had was a desktop floating in void. This seems to be the most basic draw of the program, yet it was unsuccessful  Some of the other features either had limited effect on the experience, if any, and since most of the core components were broken, I decided the product was pointless so I decided to seek a refund at that time.   I still love the idea and may re-purchase in the future if I can get confirmation of the application working as described and with those added benefits, but as of now it is not worth the money it asks, and I tend to be fairly skeptical of negative reviews on VR, considering many of my preferred games on the Vive have mixed or lower end positive ratings.  I will list the positives as well, as I have seen reviews comment on the pixelation. It isn't that distracting, and there are some nice touches. When it worked, the milkdrop settings and the backgrounds were indeed impressive and would have nearly sold me on it if they had worked past the first 10 minutes. Tracked motion controls for me were not a big problem, I'm familiar enough with my keyboard to use it comfortably.  Cons that also wouldn't make me request a refund or even leave negative feedback would include: no 'drag and drop' functionality for the virtual monitor, limited size configuration(it's good, but still left some to be desired)  HMD: HTC vive",
            "review_score": "-1"
        },
        {
            "review_text": "I think it might be useful to highlight : this software doesn't work on laptop !",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great app for doing desktop stuff. I really don't have a problem reading text in it and the videos look pretty good. They look HD to me. Obviously you can't expect it to look like a desktop monitor so I don't know why people complain about pixels. When I look at the 360 videos it reminds me of being in a IMAX theater except 10x better because I control my view and visual experience. The only thing I DO NOT care for in this app is that it has mouse and keypad controls and not my moton controller support. To be frank I do not want to play any sit down console controller VR games nor keypad and mouse VR games. That is not why I spent hundreds of dollars to do. If that was the case I would have just opted for a cheap VR headset or use on for my smart phone. 3D is easy to get but immersion is not. 3D = RIFT and Smart Phone VR. 3D +Immersion = HTC VIVE. Hands down. If the dev is reading this then please add support for VIVE motion controllers like yo ucan use with the VIVE deasktop and the Steam Desktop. I will be putting up a Youtube video of my experience with the Virtual Desktop but looking on a flat screen is not going to do justice to the VR experience. People who do not have VR don't the right to comment before actually trying it out. Most people change their minds after they try, VIVE esspecially, about how cool VR is. There are many LATE youtube videos and blogs and forums saying just that. Enjoy teh Virtual Desktop.",
            "review_score": "1"
        },
        {
            "review_text": "Innovative app that I've followed since the early betas for the Oculus dev kit. Never ceases to amaze.",
            "review_score": "1"
        },
        {
            "review_text": "This is useful for watching videos, netflix, youtube, playing old video games, and general websurfing in a novel way. It truly is a must-buy. I enjoy working in various environments ('workshops') as well. The library is my favorite.  If this software keeps improving over the next year or two, when a 4k headset comes out, productivity will be revolutionized. I would never use my dual monitor setup if this program existed along side a high resolution HMD.  I'd love to see multiple place-able desktops/screens. Let me click and drag my monitors around, resizing them and adjusting their distance using a mouse and scroll wheel. I want a monitor above me streaming netflix, while a small monitor on my left holds the excel file I'm copying and pasting from, and a larger monitor directly center my fov is my main monitor that I'm using. Below me is a small rectangular monitor that's very close, one I'm using for googling as needed.  It's a great, finished program as it is. I simply hope it keeps getting better so it can be the go-to productivity application when high resolution HMD's are publicly available.",
            "review_score": "1"
        },
        {
            "review_text": "Does not support windows 7. I upgraded to 10, because this program crashed under windows 7. Now that I have 10 installed, virtual deskop is AMAZING! The copy paste youtube , or anywhere is a great feature. A must have for a VR user!",
            "review_score": "1"
        },
        {
            "review_text": "Nothing can match the perverse thrill of sitting at your desk with your VR headset on, viewing your desktop on a virtual screen sitting on a simulated version of your desk in a simulated version of your room.",
            "review_score": "1"
        },
        {
            "review_text": "The best virtual desktop thus far. The movie theater is great. The game room feels like you are playing on a wall sized display; much better than the VorpX cinema mode. The curved display option makes all the difference for reading text; if you set windows font scaling to 125% you can clearly read everything. Big Screen allows curved displays but it doesn't improve readability. There are loads of other features I haven't used yet. This software is impressive to say the least. The desktop was unbearable before using Virtual Desktop. I would say the definitive virtual desktop experience!  Note: I am requesting a refund only because I am returning my Vive. The screen resolution is too low for me to really enjoy it. Virtual Desktop however is excellent.",
            "review_score": "1"
        },
        {
            "review_text": "I love this program and its perfect for watching 3D streams from youtube and other online streaming providers. You can also download (from within the app) 360 videos. I watch 3D content in cinema mode (be sure to select full screen via youtube and then hit the hotkey for 3d) the 3D effects are amazing :) oh its also got your desktop in a virtual world :)  An easy 10/10 just for the 360 / 3D video experience.",
            "review_score": "1"
        },
        {
            "review_text": "I recomend this app for CV1 users. It wont replace monitors for writing or reading things but it will allow you to access system settings while playing a game, watching a 3D video, etc without needing to remove the headset.  Also, bravo developer! Allowing me/us to buy it here and redeem a code so I/we can install it for free through the oculus store. I had just assumed it would be like all the phone apps (repurchase for each platform.)  Oculus Rift CV1, i5-2500k@4.5Ghz, AMD 290",
            "review_score": "1"
        },
        {
            "review_text": "I have not been able to use this for two days. The updated will not start and when I try to launch it it says update is still encrypted.",
            "review_score": "1"
        },
        {
            "review_text": "Works great, not compatible with all games and some minor software bugs but in general great",
            "review_score": "1"
        },
        {
            "review_text": "It's worth it. Watching regular vids and pics in a virtual screen you can customize is amazing. It also has 360 vids/pics viewer which can be configured to fit different types. You can also paste urls to the 360 viewer. 8 different environments to choose from and games can be launched from the app.",
            "review_score": "1"
        },
        {
            "review_text": "Almost I satisfied, but how can I change the screen ratio in movie? It looks so long vertically.  I want to see the 3d videos at normal ratio.",
            "review_score": "1"
        },
        {
            "review_text": "Virtual Desktop brings the power of the PC to VR. Amazing software with great features and options. I highly recommend this to both Oculus and Vive owners.",
            "review_score": "1"
        },
        {
            "review_text": "It's good for an interesting experience that everyone with a VR Headset should experience. Price wise it's alright, I can live with 14.99 EUR. Stability wise it leaves much to be desired. I discovered a lot of problems when trying to view 360* movies with the software.",
            "review_score": "1"
        },
        {
            "review_text": "Great app! By far my most used program for VR. It still needs a lot of polish and controller support, but it does it's job pretty well as is.  Absolutely love the big screen to watch movies or just use as a monitor. With the large screen, resolution isn't an issue and everything is readable. Also, being able to place the large screen anywhere means I can lie down in bed and watch my movies on the roof.",
            "review_score": "1"
        },
        {
            "review_text": "hi i want know what is the limit resolution picture of Photos 360.  I have tried lot of 360 x 180 pictures ex (15 000 x 7500)  But i have tried 20 000 x 10 000 and the soft doesnt want open my file.   If you can tell me what is the limit resolution of the headset(HTC vive). Maybe 20 000 x 10 000 is so much / or not ?   Thx for your answer.  the software is very good.   If you can add a section for increase the resolution of the headset (renderTargetMultiplier) it's will be great Benjamin",
            "review_score": "1"
        },
        {
            "review_text": "got this refunded, the laser pointer didn't work. you could only move the mouse with your thumbs",
            "review_score": "-1"
        },
        {
            "review_text": "Best player for VRPorn!.. ermmm. I meant... best player for watching home movies!",
            "review_score": "1"
        }
    ]
}