{
    "app_id": 382250,
    "name": "Lightrise™",
    "release_date": "2015-12-21",
    "developer": [
        "Bulkhead Studios Corporation"
    ],
    "publisher": [
        "Bulkhead Studios Corporation"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 22,
    "negative_ratings": 18,
    "price": 0.79,
    "description": "Lightrise is a skill-based, player vs. player combat game which at the core is focused on fun, fluent and fast-paced combat. Lightrise gives players a combat experience not quite like anything else available out there.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/382250/header.jpg?t=1450743607",
    "minimum_requirements": "OS: Windows 8.1 64 Bit, Windows 8 64 Bit, Windows 7 64 Bit Service Pack 1, Windows Vista 64 Bit Service Pack 2* (*NVIDIA video card recommended if running Vista OS) Processor: 2.0+ GHz processor Memory: 2 GB RAM Graphics: SM3-compatible video card DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space Sound Card: Any",
    "recommended_requirements": "OS: Windows 8.1 64 Bit, Windows 8 64 Bit, Windows 7 64 Bit Service Pack 1 Processor: 2.0+ GHz processor Memory: 4 GB RAM Graphics: SM3-compatible video card DirectX: Version 9.0 Storage: 2 MB available space Sound Card: Any",
    "reviews": [
        {
            "review_text": "Okay, so this is my review:  PROS: -A large amount of spells and skills -Tons of fun with friends -Unique combat -Only 0,99  CONS: -No community -No singleplayer mode  Overall it's a fun game, and i can't wait to see how it does in the future! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I think this is a very nice game which has a whole lot of potential. So here we go:  + skill-based + everything is customizable (controls, GUI/HUD, character, weapons, etc.) + nicely designed maps + many skills/spells + low price for nice product  - only multiplayer - outdated graphics (personally I think this doesn`t matter, been playing Mount and Blade for ages, one of my favorites) - a bit more fps would be nice - small community (this really is an issue)  BUT WE can actively increase the online community by sharing this nice game to others, I mean its 0,99, it runs on low PCs and it`s really fun, what more do you want? We should give this game the chance it deserves.",
            "review_score": "1"
        }
    ]
}