{
    "app_id": 3830,
    "name": "Psychonauts",
    "release_date": "2006-10-11",
    "developer": [
        "Double Fine Productions"
    ],
    "publisher": [
        "Double Fine Productions"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Platformer",
        "Comedy",
        "Adventure"
    ],
    "achievements": 37,
    "positive_ratings": 8204,
    "negative_ratings": 456,
    "price": 6.99,
    "description": "A Psychic Odyssey Through the Minds of Misfits, Monsters, and Madmen. This classic action/adventure platformer from acclaimed developers Double Fine Productions follows the story of a young psychic named Razputin.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3830/header.jpg?t=1489611408",
    "minimum_requirements": "OS: Windows 98 SE/2000/XP Processor: 1.0 GHz Pentium(R) III and AMD Athlon(tm) Memory: 256 MB of RAM Graphics: 64 MB GeForce (tm) 3 or higher or ATI(R) Radeon 8500 or higher (except GeForce 4 MX and Go series) DirectX®: version 9.0 or higher (included with game) Hard Drive: 3.75 GB minimum hard drive space Sound: DirectX&amp;reg 9.0 or higher compatible sound card Controls: Windows-compatible keyboard and mouse",
    "recommended_requirements": "OS: Windows 2000/XP Processor: 2.0 GHz Pentium(R) IV and AMD Athlon(tm) Memory: 512 MB of RAM Graphics: , 128 MB GeForce FX 5600 or higher or ATI(R) Radeon 9600 or higher DirectX®: version 9.0 or higher (included with game) Hard Drive: 6.0 GB minimum hard drive space Sound: DirectX&amp;reg 9.0 or higher and Sound Blaster Audigy 2 series sound card Controls: Game Pad (optional)",
    "reviews": [
        {
            "review_text": "If you think the graphics suck, then: 1) You're wrong. 2) Buy the game. 3) Obsess over the characters and plot. 4) Buy all the merch. 5) Cry until Psychonauts 2 comes out.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is like a book with a weird cover. It's a game worth getting into though, even if your eyes might not agree with the art design. Once I got past my nitpicking, I finally gave it the shot it so very deserved. Psychonauts is a 3D platformer meets an adventure game and honestly, I had no idea about the former. As with all platformers, you'll die plenty from falling, which is partly due to a fixed camera and partly cos you suck. Then there are a couple of areas that just aren't very forgiving, but it's nothing you can't overcome. I'd say the difficulty level is just right for this sort of game, apart from the initally daunting and almost sadistic Meat Circus.  It's funny, charming and fun to explore. Finding collectibles is made enjoyable, but you'll have to look out for a Point of No Return, otherwise you won't get 100%. The music from Milla's Dance Party is still in my head, a level that reminded me of the club mission in DmC Devil May Cry. I doubt Ninja Theory were influenced by Psychonauts, these games being such opposites, nevertheless I found it amusing.  First Double Fine/Tim Schafer game now under my belt and I'll be checking out more from them. If it weren't for the massive development budgets we have right now, we'd see more cool games like these. Games like No One Lives Forever 3, which I'm still rooting for.",
            "review_score": "1"
        },
        {
            "review_text": "There is not much to say about Psychonauts that have not already been said time and time again. It is an excellent game that is has a timeless art style combined with great characters.  Pros + Awesome art design + Great characters with superb voice acting + Fun platforming gameplay with new moves unlocking as the game progresses + Good humor throughout  Cons - The entire game was a bit too easy on the whole until the final level, where the difficulty skyrockets - Like many games in the genre, the camera isn't always your friend and might cause some frustrations  Overall a great game and gets my full recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is one of the most challenging platformers I've ever played. Finding and collecting secrets completely changes the game, so take the time to explore the environment and really enjoy the picture that Psychonauts paints. Overall, the experience is rewarding and you simply won't find another game quite like it.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously one of the best games I have ever played.  The characters are memorable, the levels are unique and interesting, the writing is hilarious and sometimes even deep and emotional. Once I started playing this game I couldn't stop. I beat the whole thing and 100% completed all the levels in under a week. I can't even come up with a single flaw in this game, except for maybe the fact that there isn't a sequel.  Play this game. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "One of my absolute favorite games from when I was younger. Wish they would make a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun platformer!  Graphics still hold up due to a cartoony look and every level is a different and fun experience. The writing is fantastic and has many laugh out loud moments. The game will keep you busy and interested for at least 10+ hours. My only gripes are the collecto-thon type gameplay did wear a little bit thin by the end. I have always been a big fan of games that have you collecting items, such as Banjo Kazooie, but collecting all of the items in this game is a chore, especially the holograms. Some items, such as the collectable brains, yield different story elements and are interesting. Completing the game will probably add on at least another 5-10 hours of gameplay, all be it repititive and mundane gameplay.  TL;DR Very good writing and creative level. Collecting items grows repetitive, especially if trying to attain 100%. Very good game to pick up on sale. 8/10",
            "review_score": "1"
        },
        {
            "review_text": " TL;DR",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games! Great art, story and mechanics. All aspects of the game have aged beautifully, and it looks better than ever.  I've played it on the Playstation2, Xbox 360, and now on Steam with a synched controller. Works great with the controller, but there are some minor issues navigating the options menu. Easily solved if you have your keyboard handy. The only problem I've found is that the game frequently crashing when loading levels from fast travel locations. While inconvienent, the quick load times keep the delay to a minimum.  This is the third time I've bought this game, and I'll do it again to put this on as many systems as I own.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is one of those games that you overlook because of it's age. I heard nothing but good things about it but I still was not convinced. One day I decided, why not? and I never looked back... ok I looked back like 30 hours later and a few times inbetween asking myself what I'm doing with my life but that's not relevant to this review.  So first off, this is a 3d action-adventure platformer with a light, fun and whacky art direction, everything about this game gives of a facade of humorus dialogue and ridiculous characters, but the underlying tale has a much darker theme going, telling the sad story of dissapointment and faliure, manifesting in insane and unstable human-beings given the shortest straw in life, this is a story about untangeling and getting to the core issue of one's mind and finding ways to overcome those issues. This game shows empathy and heart, it's funny, selfaware and it feels like every nook and crany in this game holds some sort of meaning, it's packed with collectibles and there is always something to do, I pretty much binged this game untill I had collected everything, not something I normally find compelling but this game somehow manages to keep my monkey-mind on track and for that it's easily one of the best games I've played so far, can't wait for the second Psychonauts.",
            "review_score": "1"
        },
        {
            "review_text": "I am the Milkman, Get this game or I'll set you on fire",
            "review_score": "1"
        },
        {
            "review_text": "With the new Psychonauts game on the way, I felt I needed to make a review for the first one. Let me start off by saying that if you have not already played this game, you are missing out. It is an absolute classic from one of my favorite developers, Double Fine. (And the man behind it all: Tim Schafer)  The game itself is filled with great humor, amazing level design, eccentric characters, a villain's ridiculous plot to take over the world, and a mysterious milkman. (Play the game to see what I am talking about) The creativity of the developers is astounding and I found myself actually wanting to come back to all the levels to collect every little thing the developers put in there. All the levels have their own charm to them and the premise of the game really allows for some of the most memorable levels I have ever had the joy to play through.   And honestly, I am extremely excited now that we are finally going to get a continuation of the story in the new game they are developing. I really hope it will be good, but even if it isn't, I still think people should pick this game up and play through it. In my opinion, it is well worth the $10 asking price, but if you still don't want to pay that much, then make a note to pick it up during a sale.    Pros",
            "review_score": "1"
        },
        {
            "review_text": "There's a reason why Psychonauts is in my top 10 favorite games of all time Positives -Unique presentation -Fantastic controls -Brilliant level design  -Well written characters, I only wish some were given more spotlight, like Boyd Cooper and Sasha Nine. -An engaging story Negitives -There was a lot of noticeable pace breaks during a play though,    namely when you get to the Insane Asylum and you have to go though 4 different minds without any real story going on. Also when you are in Rasputin's mind and you have to go to the top of the tower and then all of a sudin you need to get your levitation power.   -Near the end of the game, there's no way to go back to the hub world, so if you wanted to go back and get everything to get rank 101, you'll have to start the game all over again. Overall Psychonauts is a fantastic game  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Doing this for the badge, but a really great platformer. If you're a fan of games like Banjo Kazooie and Super Mario 64, then you might like to give Psychonauts a try. Definitely very unique in its story and characters, lot of fun to just explore and get immersed in. Double Fine did a damn good job putting together a great game. It's usually on sale a lot/part of humble indie bundle deals, so don't let the price be the reason you don't play.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun! Any word you can thing of, BOOM, there it is. Amazing. Think of any situation you can, and you can make it happen. Get this game. The difficulty naturally scales based on intelligence; the words you know are probably right for your skill level. Genius concept. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Behold the power of bacon!",
            "review_score": "1"
        },
        {
            "review_text": "Ahh yes, back when double-fine was good you got to play a trippy game with a banjo-kazooie feel as a main character voiced by Rodney Squirrel.  While I did enjoy this game, and suggest it. 1: I suggest you have a gamepad and 2: I suggest you do better than I did. I gave up when I had to play cleanup around the camp to buy an item to help me finish the next level.",
            "review_score": "1"
        },
        {
            "review_text": "While I've only played for such a short time, I feel like there's an overwhelming amount of collectables and epic platforming in this game. Totally recommending if you're the type of person who likes to gather every single collectable when playing a game with a lot of them.",
            "review_score": "1"
        },
        {
            "review_text": "Great game because its feels like an old school nostalgic game. Also the characters are pretty likable, something that is very cool since it's becoming hard to find this type of characters in videogames. It remembered me a lot to Rayman 2, even when both games are kinda different, it made me feel the same good sensation.  Artistically the game is beautiful and imaginative, and the majority of the levels are pretty good original and well designed.  The OST is also nice, I liked to go around the camp listening to the same tune again and again. It never bored me.  It took me 21 hours to get 100%, including all achievements, so probably the average would be like 15 hours.  It plays fine on modern PCs, so don't worry for compatibility problems. Still, I remeber I had two crashes.",
            "review_score": "1"
        },
        {
            "review_text": "'And then we took a U-turn, and then we got attacked by bees.' 'And then I bent down to tie my shoe, and then we fell in a manhole and I had to reset my own arm back to the socket.' Wow, what a life.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing story, very fun, lots of puzzles and bits to collect. One of my favourite games. Really great, huge variety of things to do.  The first PONR is fine and can be reversed but there is a second less well-known one that drove me mad at the end of the Meat Circus, which stops me from playing the last level again so I'm stuck super close to 100%. This enraged me as a completionist. But if you don't plan on 100%ing, play it, it's great fun.",
            "review_score": "1"
        },
        {
            "review_text": "I am a game reviewer.  This is my review.",
            "review_score": "1"
        },
        {
            "review_text": "Tim Schafer really made a masterpiece here. The characters, world, and humor make for a fun ride. The only downside is the ending teased a sequel that we've yet to hear word of. April 2015 is the 10 year anniversary of this title. Maybe we'll see something special then.",
            "review_score": "1"
        },
        {
            "review_text": "the milkman delivers my milk, and i will deliver all the brains!  in all seriousness though, this brings me back to the good old days of playing this on ps2. 11/10 get this game, it's trippy and great.",
            "review_score": "1"
        },
        {
            "review_text": "It may seem like a childrens game by the look at first, but psychonauts has everything! Strange and interesting characters, a really weird and original story. Besides that, gameplay wise it may be the most divers games I every played.  I would warmly recommend to anyone to buy this game, hide your phone and order enough food for a few days. Tell your boss he'll see you in a while, because you'll be playing Psychonauts",
            "review_score": "1"
        },
        {
            "review_text": "Let me just start off with saying, that i LOVE this game. I have played it through 4 times now and i recently picked it up on steam and 100% completed the game. The story is very interesting and somewhat original. A lot of people say, that the game hasn't aged well, but the cartoony and sometimes dodgy graphics somehow appeal to me more than modern games. I do agree, that the controls are a bit akward without a contoler, but you can get used to them.   The most important aspect about this game to me is that it scratches an itch... The countles collectibles are not obligatory to collect, but the ranking sistem makes them very rewarding. The feeling that you get after collecting every figment in a level is great and you feel like you have achieved something. (figments are one of the collectible and often hard to notice 2D models that make levels look full and colorfull)  Lastly i want to talk about the music. In my oppinion it is very well made and fits in the rather bizzare world of the game very well. I was very happy when i had the chance to get the official sountracks from the Humble Bundle.  This game is a lovely little gem from the 2005 and it's well worth its price. I can't recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time! A must own for anyone, anywhere, anytime!",
            "review_score": "1"
        },
        {
            "review_text": "Everyone who as ever played this game says how great it is...And I am one one them. First, the strongest part of this game is how it is written. Every character has their own unique way of talking and even if they are just repeating the same diologue over and over you can't help but enjoy. Next, the controls....Not going to lie, I would use an Xbox controler for this, I have beaten it on the PC using the keyboard and mouse, but it is suited best for a controler.  The story is great too, it keeps evolving with a great mystery that if you didn't figure out on your own you can look back and see the little clues and hints to it.   I cannot say enough good things about this game just.... I am a house wife, I enjoy making pies",
            "review_score": "1"
        },
        {
            "review_text": "I just recently finished Psychonauts. Sadly, I did not do it well enough to have gotten all the achievements -- I'm debating a second playthrough to get those I'm missing.   Nevertheless, it's a truly fun game. Yes, it's a platformer, so you will spend some time just trying to make certain jump sequences, or hunting for a missing thing when you thought you already checked the whole level, or replaying a boss fight because the camera angles are often terrible. But yes, despite that it's funny and fun and it made me laugh out loud quite a bit at the ridiculousness of it all.  You play Raz, a young boy who has run away from the circus to join in at Whispering Rock Psychic Summer Camp and hopefully to become a Psychonaut -- an international mental agent. The levels are insane -- your slightly abnormal summer camp (filled with other psychic children) soon becomes an exploration of the other minds around you, in all their whacky weirdness.  Now ... back to debating whether to finish all the achievements...",
            "review_score": "1"
        },
        {
            "review_text": "I am the milkman. My milk is delicious.",
            "review_score": "1"
        },
        {
            "review_text": "This game has to be counted as a classic. Perfect scenario, fun gameplay experience and lots of awesome stuff.   I'm not just recommending it, I'm saying 'You must play this!'",
            "review_score": "1"
        },
        {
            "review_text": "Very heartwarming story. Highly suggest playing!",
            "review_score": "1"
        },
        {
            "review_text": "Collectathon game done right. Of course every Double Fine game takes a little getting used to.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously people, it's a cult classic for a reason. If you're planning on buying this wait until it's on crazy sale (Bought my copy when it was going for practically 1.75$ CAN ) because around the halfway point when there's not much left to learn the game gets MAD difficult, and if you buy it for the 9.99$ current full price, you might feel like you have wasted your money.   Besides that, who honestly doesn't want to fool (Without spoiling anything) agents into thinking you're one of them? Or become Godzilla? Of hell, simply light things on fire? This game really has it all in lue of imagenation (Here's looking at you Godzilla level that took me forever). Plus you get to play as a kid from the circus that decided to run away from it (Rather than TO it as many children must have planned to do at some point in childhood before they were allowed to cross the streets by themselves... I know I did... Sat on the curb for three hours huffing that my plans had been foiled by the road, what can I say, I was -and still am- adventerous)   All in all, it's a darn good game. You'd be hard pressed to find another Tim Schafer gem like this one...   Critisizm would be that darn difficulty curve... Oh and like, four of the kids in the game are aggrivatingly annoying as ♥♥♥♥, but at least there's only one 'Escort' thing that's totally optional, but nets you some sweet, sweet arrowheads (Money in this game) if you do it (And it's simple as hell if you're quick to reassure the character that they can make it). Other than that, it's a really good game.",
            "review_score": "1"
        },
        {
            "review_text": "Not only a great 3D platformer game but an excellent adventure game as well.  Pros PERFECT controls Great visuals Great levels (each is different) Gameplay variety  Cons None",
            "review_score": "1"
        },
        {
            "review_text": "for 0.99€ one of the best games ever made",
            "review_score": "1"
        },
        {
            "review_text": " Inside Someone's Mind",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game. Unique artwork and gameplay style.",
            "review_score": "1"
        },
        {
            "review_text": "Very mind, such art, much platforms, amaze.",
            "review_score": "1"
        },
        {
            "review_text": "Stop reading this. Seriously, Stop it. See that 'BUY' button? Click it. Buy it. Now. Thats it. Enjoy, You've just taken the steps to becoming a beter gamer and human being. Ok, still not convinced? How about Pysconaughts, Meat Circus and those roofs in Waterloo withstanding, is one of the best gaming experiences EVER. Brilliant, yes brilliant, in design, levels, charcters, story, voice work. How has this not gotten a sequel, how has Pixar not approached DF for the rights, or DF seek out Pixar? Dont worry those will be just some of the questions you ponder along with how underrated is Tim Schaffer and DF?  There is a saying, especially as you grow older, they just dont make em like that anymore. Its not really the case for games however, but for Pysconughts as with other herealded classics like HL2 and Portal there never was anything like them before or has there been anything like them sense. Truly lightning in a bottle moment for the developers and magic for those who get to enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer with great visuals, funny laughs throughout and wonderfully written. For anyone who enjoys a great story within their game and are not scared of challenging your mind. Goodluck future Psychonauts!",
            "review_score": "1"
        },
        {
            "review_text": "Can't go wrong with this classic, it's so odd it's beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "This is THE game of the early 2000s.",
            "review_score": "1"
        },
        {
            "review_text": "I have reached level 101, beaten the Circus of Meat, become a true Psychonaut, and yet I *STILL* need to play this game even more! 10/10 amazing game!  One of the few downsides though, is the use of the word 'gypsy' when Raz talked about his life... a shame that Tim Schafer used such a racial slur when he made this game back in the day...",
            "review_score": "1"
        },
        {
            "review_text": "Tim Surely knows how to make a good story. And even at the end, you really want to play more",
            "review_score": "1"
        },
        {
            "review_text": "You like unforgettable, insanely unique characters, down to the most trivial NPC? You like games that make you feel like you're playing a really good cartoon? You like platformers that are unlike any other platformer? You like games with enough charm and wit to make your head explode?  It's time to give Tim Schafer your money.",
            "review_score": "1"
        },
        {
            "review_text": "Classic, classic, classic.  Heaps of memorable characters, CRAZY creative levels, excellent platforming, awesome story. Some parts could have been cut yes, the meat circus is a ♥♥♥♥-show, but the fact that you can bounce around most of the level at double speed on a bubble makes up for everything. The graphic style means this has aged better than most 3D games. Controller recommended, but plays ok on a keyboard and mouse setup as well.  &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Just buy this game you dont need an explanation why just buy this ♥♥♥♥ing game its amazing",
            "review_score": "1"
        },
        {
            "review_text": "Played it on PS2. An absolute masterpiece. Who doesn't want to spend 10 bucks on this game, just wait for steam sale and get it 80% off.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely wonderful. If I had to give it a score it would be a 5/7.",
            "review_score": "1"
        },
        {
            "review_text": "There's enough good reviews here to convince you this game is totally worth buying; and it most certainly is but I feel like there's one thing I have to mention... this game crashed on me after an hour of playing. I can't be mad though, it came up with 'The Most Excellent Game Psychonauts has stopped working' so even when it crashes it's a joy. Also going by other reviews this crashing malarkey doesn't seem to be a common occurrence and my pc is hardly top of the line so don't let that deter you. It really is a great game, more so if you're a fan of platformer/adventure games which I'm not.  Edit; I take back what I said, the crashes have rendered it near unplayable. Annoying because it's otherwise a great game.  Another Edit: I've since upgraded from my hunk o' junk and it works flawlessly. I love this game and you should too. There just isn't a real flaw I can find.",
            "review_score": "1"
        },
        {
            "review_text": "One of my top 5 games. I have played it so much that I can't count the hours. It has been on that list for a while. It has humor, adventure, and the milkman, yes I said the milkman.    Forgot to state, I played this on a console first, that is why I only have a few hours on here, I have completed it about 3 or 4 time on the Xbox.",
            "review_score": "1"
        },
        {
            "review_text": "I like wacky. I adore dreams and nightmares. This game is full of spinning blades and trippy scenery changes. It has everything I could ask for.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, funny and... hilarious! Yes yes, I know 'funny' is on twice, but it really is funny. I AM THE MILKMAN, MY MILK IS DELICIOUS EDIT: Nominated this game for the “Villain Most In Need Of A Hug” Award, poor Coach Oleander!",
            "review_score": "1"
        },
        {
            "review_text": "This is and always will be my favorite game!",
            "review_score": "1"
        },
        {
            "review_text": "If you’re interested in children, magic, and camps surrounded by tall fences ruled by a dictator, then you are most likely a perverted Nazi. However, If you’re interested in children, magic, and camps surrounded by tall fences ruled by a dictator, then you are a completely normal person and you will enjoy this game with a passionate passion.   In this game you spend most of your time in peoples minds uncovering the lost secrets of their pasts, and while doing so you can collected a bunch of weird chalk drawings that do nothing besides destroy the OCD part of you. These chalk drawings will consume your life, soul, and bodily fluids as at first they are easy to spot giving you a false sense of accomplishment. This easy peasy mindset lasts until the last one where you have to jump across the universe upside down on one leg blindfolded with a firecracker up your butt to get it. Since it’s the last one you have to get it, you're a gamer, OCD and completion run in your veins. Every fiber in your body is saying 'go on get the last chalk drawing' but you must resist. IT IS FUTILE. You will never get that last chalk drawing just like how Pluto will never again be a planet. You know Pluto deserves it, he after all was a planet for quite a while. Then one day a bunch of stuck up scientist with their high and mighty positions decided enough was enough. Pluto had it too good for too long. I mean of course he sat on the edge of our solar system, I mean he is just a shy guy you can't take it out on him, and just because he is far away does it not mean he cannot hear us or have feelings. Right now you know his family has out casted him and he is on the verge of suicide. AND WHAT FOR? WHY? EVERYTHING WAS FINE WHEN PLUTO WAS A PLANET. OBAMA WASN'T PRESIDENT, TWINKIES WERE STILL AROUND, AND NELSON MANDELA WAS STILL ALIVE! NELSON MANDELA!!",
            "review_score": "1"
        },
        {
            "review_text": "If you play this you must be PSYCHO,NAUT.",
            "review_score": "1"
        },
        {
            "review_text": "-Plenty of abilitys -Mind related things -Wonderful voice acting -Plenty of emotional moments and baggage -Insanity -Main protagionist voiced by the same voice actor as zim from invader zim -Plenty of dark humor  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is a wonderful game and my all time favourite. Yes, it has a really unfair final level, and a rather steep difficulty curve, but that doesn't matter. Because its charming. It's funny, it's fun to play, it has some of the best level design in video game history and has a charming art style that has made sure it has not dated visually in the same way many 'realistic' looking games from the same time have. The gameplay may not satisfy everyone, but I personally love how fluid it is, and the amount of customisation is just right.  This is a hilarious game, sure, with some of the sharpest wit and cleverest dialogue in anything ever. Tim Schafer and Erik Wolpaw's (of Portal and TF2 fame) script deserved all the accolades it recieved at the time, and the story itself is also fantastic. But not only is the game funny, it has a surprising and unprecedented amount of heart. Yes, it may feature characters sneezing brains out and a level where you play a Kaiju-sized version of the main character storming a city of Lungfish (which is an awesome level by the way), but it also has moments of beauty, and even tragedy. Yes, some of the tragic circumstances are handled in a comedic way, but in no way does it make them any less powerful or striking. Don't let the cartoony look and funny dialogue fool ya into thinking that's all there is. There is much more beneath the surface (not of the actual lake in the game, more the mental variety). It has a great plot, great characters (even the insignificant side characters. You can just stand there and listen to their remarkably long conversations, which I recommend you do because they're HILARIOUS), and more specifically a great main character with Raz, who is brilliantly handled. He's never too irritating, too goofy, too heroic. He's just the right quantity of everything you need in a relatble main character who you enjoy playing as. Overall, Psychonauts is a wonderful game, and although it has some flaws later down the line, all the other previously mentioned stuff (and more that I don't want to spoil) more than make up for them. And at the price it's currently at considering it's around a 15-20 hour game, it's an absolute steal.",
            "review_score": "1"
        },
        {
            "review_text": "Hey you, yeah you! The one that didn't play this game! PLAY IT! Don't make Tim Schafer cry again.",
            "review_score": "1"
        },
        {
            "review_text": "Very good platform games. Funny, engaging and not a childs game, quite a bit of adult humour in there. Would highly recommend. :-)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games ever, everybody play this game. Platformer puzzles and a great power set, plus a good collection for people who like getting 100%",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. PLAY IT!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Classic, classic, classic.  Heaps of memorable characters, CRAZY creative levels, excellent platforming, awesome story. Some parts could have been cut yes, the meat circus is a ♥♥♥♥-show, but the fact that you can bounce around most of the level at double speed on a bubble makes up for everything. The graphic style means this has aged better than most 3D games. Controller recommended, but plays ok on a keyboard and mouse setup as well.  &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "is rly gud. git it",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique games ever with great art-design and gameplay decisions you will never find anywhere.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Stands the test of time",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good. The graphics are a bit out of date, and some people might complain about the character modeling, but that's Double Fine's style. It's got a load of psychic skills including telekinesis, pyrokinesis, clairvoyance, and many more. It's not difficult to get a hang of and believe it or not, has replayable value. It's got a thorough storyline, and is slightly humorous. A whole lot of value. It's so good I've replayed it four times. It's an amazing price for an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Great writing, nice storyline, you get easily dragged into it and the lines are amazing. 10/10, it deserves it, one of the better games i played.",
            "review_score": "1"
        },
        {
            "review_text": "The only thing wrong with this game is that YOU are not playing it!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. Creative gameplay, amazing art, great action, and a fun to follow story line. This game had it all and still holds up today. A true classic.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This game was amazing. It truely is one those hidden gems your lucky to find. I'm just annoyed it's over. I absolutely love the concept, and it great how through the developers were in creating the many worlds, and the creative plotline. It was having so many different abilities and worlds to use and interact with. I've finished the game in just over 16 hours, and it was definetely worth the purchase. I made the mistake of ocassionally rushing through parts of the storyline, which I now regret, but I was extremely happy to hear that Psychonauts 2 was crowdfunded.  The really does display the complexity and the beauty of the mind. It very intricate and give a myriad of powers and dozens of settings to utilize them in. The graphics and great, and story line was both funny and entartaining. I don't do many reviews, but this game is just that good, and you'd be a fool to miss out on it",
            "review_score": "1"
        },
        {
            "review_text": "Totally hilarious game with original gameplay, which adds some elements from adventure games to a classic 3D platformer, and amazing and unbelievably inventive level design.",
            "review_score": "1"
        },
        {
            "review_text": "Its a game by Tim Schafer game. If that doesn't sell you, then I guess I'll have to talk about the game.  Psychonauts is a platformer that has collectathon elements, powers, and a ranking system, as well as a large hub world. The main chunk of the game and gameplay takes place inside the minds of individuals around the psychics' camp,calling Whispering Rock Psychic Summer Camp.  The characters are the best part of this game. This game is amazing in every aspect, but the characters are easily the best part of it. They're quirky, they have their own permanent personalities, they have backstories told through slideshows within that person's level, they are full of life and are portrayed so well by their respective voice actors that you never get the sense that they're people in a room recording lines of dialogue, you get immersed into the world of the psychonauts and the characters slowly have their affect on you. They also teach you valuable life lessons (for instance, control over emotions and saying that you cannot lock it completely away, or you'll explode inside Sasha Nein's marksman training).   Honestly, the rest of the game works as well as any other decent 3D paltformer/collectathon, and I can't help but comparing it to Conker's Bad Fur Day, but with fewer curse words. It functions well and would otherwise not stand out, but because of its writing and its characters (and in Psychonaut's case, its art style too. CBFD looked a lot like Banjo &amp; Kazooie). Its powers are neat and the premise is certaintly unique, but the characters really bring this game to life.  Double Fine Productions are similar to Vigil games, as many of their games are huge cult classics, that weren't huge at their release, but have over time garnered a huge following. I just hope Double Fine doesn't go the way of Vigil.  Overall, I highly recommend it to any 3D platforming fan. Its quirky, it pokes fun and its overall a blast to play. 10/10 from me, Double Fine. I cannot wait for Psychonauts 2 to come out in...2018, supposedly...I just hope its worth the wait and meets expectations",
            "review_score": "1"
        },
        {
            "review_text": "Buy it. Play it. Love it. Cry, because we'll never get a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when I first got it on the PS2 When it came out, aswell as when I bought it a year and a helf ago, and still love it now. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. Definitely give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "I am a reviewer. This is my review. Do you know the milkman? Such a great game thanks Tim for this and thanks James Willems for Psychonauts 2",
            "review_score": "1"
        },
        {
            "review_text": "Raz: Can you believe a great battle was once fought here, on the very ground that you now so peacefully graze? Many men died. Some did it for freedom and some for country. Others did it just because they had guns. It's a crazy world, isn't it? Hmmm? Don't you think it's crazy? Hey, I'm talking to you cow. It's because of me that you're not talking French right now. Shame on you, ungrateful cow.",
            "review_score": "1"
        },
        {
            "review_text": "Dear lord where do I start on this one? Well, I guess with 'this is really good and memorable.' Fun gameplay, something like puzzle-action-platforming (good enough on its own) with insane-o bonus features like being able to set things on fire with the power of your mind. The whole thing is also HILARIOUS, start-to-finish. There are so many memorable quotes, memorable characters. The levels themselves all have a remarkable variety, making sure you aren't bored but also similar enough that you don't suffer from 'gameplay jetlag' every time you go to a different area.  Play this game. It will never leave your brain afterward.",
            "review_score": "1"
        },
        {
            "review_text": "BUY IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold!",
            "review_score": "1"
        },
        {
            "review_text": "love this game, the graphics are amazing and the story/humor is just fantastic",
            "review_score": "1"
        },
        {
            "review_text": "Funny story with surprisingly moving moments, and excellent gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Got to make out with brains.  10/10 would make out again.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a part where I can run around as Godzilla and fight my coach.  I love it",
            "review_score": "1"
        },
        {
            "review_text": "The game that gives you a chance to blow other people's heads solely with power of your mind. But the only head that will be blown at the end – it's your head.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly original and captivating, especially to you 90'ies kids. Still relevant!",
            "review_score": "1"
        },
        {
            "review_text": "This game has a part where I can run around as Godzilla and fight my coach.  I love it",
            "review_score": "1"
        },
        {
            "review_text": "Really exceptional action game with amazing story and incredibly brilliantly designed levels, even if the graphics is mediocre by today's standards. One of the best PC games I've ever played in my over 20 years long gaming history.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I ever played!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever. (my time is so low because I didn't play this on steam, I played it on gametap, where I think it was free for a while, I'm not sure how I own it at all here, I suppose it must have been part of a bundle.)   It's really funny, I think this game has had the best implementation of humor in a game I've ever seen. The plot is interesting the platforming fun. It perhaps is a bit on the long side, I did get bored before the end. the milkman episode was one too many. but it's all so charming.",
            "review_score": "1"
        },
        {
            "review_text": "Buying this at .99 right now is a STEAL. This game is one of the best 3D platformers around and it's style is hard to beat. Every level is stands on its own and is super creative and a fair challenge. TONS of jokes and things to explore. Great concept, great execution, great style. ONCE AGAIN THIS IS A DAMN STEAL!! ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made, hands down... Hilarious dialog, great story, and solid gameplay to back it up. It might have a somewhat slow start, but wait until it gets dark... Thats when the real fun begins :P  Warning: Playing this game might change the way you look at milkmen, road workers and grieving widows.",
            "review_score": "1"
        },
        {
            "review_text": "The last decent game Tim Schafer came up with before his head went down the gutter.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is a great game. Psychonauts has problems. The positives vastly outweigh the negatives.  To get my issues with it out of the way first:  - The platforming was difficult for me in parts prompting a lot of trial and error. This sounds like a small point but when the result is continuous repetition to make a single jump it gets really annoying. - Some enemies were difficult/annoying to fight. - It's sad that you can't bind your powers to more buttons, as tabbing into the menu to swap powers out was just a little too much effort. It was released on the Xbox at the same time so you can see why this was done.  Okay now onto the positives: - The story, the environments you find yourself in, the characters and the dialogue are all great. I can't stress this enough. The Steam trailer shows a range of levels of the game but it doesn't capture how excellent the dialogue and delivery is in this story where weird psychic kids go to summer camp. - The graphical style still holds up. For a game over 10 years old, it's not difficult to watch. - Collectibles matter. You level up almost exclusively through collectibles and several of them give you extra things to read/memories to watch. They're all very whimsically created and perfectly integrated into the game. - Some real thought has been put into it. Example: the main character Razputin gives a reason as to why he can't swim (that normal video game limitation). They mention it several times and justify it. Nothing is done arbitrarily, making for a very solid world. - It's a good length. Maybe 8 hours if you rush from place to place. Which you shouldn't do! Talk to as many other characters as possible, the dialogue is wonderful.  It's so close to being a game I would say young kids should definitely play (or watch being played). However there are some words I'd call 'not okay' used, and a few moments spring to mind which could be really scary for kids. The comedy gets dark at times. Make your own judgement if you're in that situation.",
            "review_score": "1"
        },
        {
            "review_text": "Inspiring since 2005. Controls are not perfect, partly due to systems density, in particular the camera and combat aiming can frustrate. But the systems complexity is one leg of the alluring and original play, the other being imaginative setup and plot, further helped by brilliant collectibles and characterization which add to immersion in the world. Excellent production values with full voice acting, crafted art design.",
            "review_score": "1"
        },
        {
            "review_text": "The last decent game Tim Schafer came up with before his head went down the gutter.",
            "review_score": "1"
        },
        {
            "review_text": "'Is that the regular platformer? Or a explosive kind platformer?'  'ITS FORTIFIED WITH GREAT STORY, AMAZING CHARACTERS , WITTY HUMOR, CLEVER WRITING, OUSTANDING ARTSTYLE, FANTASTIC VOICE-OVER AND ♥♥♥♥ING PSICHOTIC MILKMANS. ITS WHAT THE WORLD WANTS, WHAT THE WORLD DESERVES'",
            "review_score": "1"
        },
        {
            "review_text": "The 3.3million dollar man strikes the heart of loved ones with this gaming classic.  Platforming? Yes Fun? Yes Gameplay? Yes Characters? Yes A Videogame? No An Experience you will never forget? Double Yes! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "By far one of my favorite games from my console days. To me this game is a classic RPG adventure game. With some very familiar voice acting. Raz your character is a run away in search of his dreams. Ofcourse things are never as they seem when trouble starts to brew Raz begins his journey to become a Psychonaut.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is a really good game. I recommend it to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Favorite Game from my childhood. Freaked out when I found out it was on Steam. Excellent game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Platform games come in many shapes and sizes. There are the big-name platforming mainstays, such as Mario and Sonic, that rely on their own brand of rules and obstacles to overcome. You have the run-and-gunners, the hop-n-bops, the Metroidvanias, the collect-a-thons, those with realistic physics, the platform hells, the list goes on and on...  However, there is a rare breed of platformer that comes out every so often that defies many of the traditional sub-genre aspects and manages to be it's own unique experience.  Psychonauts is one of those games.  The story of the begins with Raz running away from home to become a Psychonaut, a kind of mixture between a secret agent and mental projectionist. He is taken in by the training camp, set into a journey that has him entering mind after bizarre mind to solve a sinister brain stealing plot.  With mental focus being the theme of the game, Raz learns many useful abilities such as levitation, telekinesis, and even seeing how others see the world. Upgrades and useful items are everywhere and the unique locals make the exploring the various mindsets to be all the more enjoyable. The humor is also some of the most well-written and goes hand-in-hand with the stylized look. One could easily picture a Nicktoon based on the game.  Infamously bombing on it's intially release, it's earned a new life as time went on. For those looking for a unique 3D platformer on the PC, this is the first stop.",
            "review_score": "1"
        },
        {
            "review_text": "a bit rough but still good",
            "review_score": "1"
        },
        {
            "review_text": "I finally got the chance to buy it and finish it. I played it as a kid and I loved it!  Not much has changed now, many years later. It's still unique to me, it's still amazing, you have to be talented to create something like that, to imagine something like those worlds and to make that idea work out perfect.   I really want to see Psychonauts 2. I really, really do, so many years later this amazing game deserves matching sequel, I could only imagine that it would be so much better and so popular in sea of copy paste games that are surrounding us today.  However if you are completely new, you should know that Psychonauts is one of those games that you should play because they are so unique and amazing in many ways. Just the game quallity is over the top for period it was released in, you can see on almost everything that hours of hard work and passion were put in it, to look amazing.  So many puzzles, worlds, interesting stories, so many unique things and possibilities, things to see and things to do.   I loved every segment of those, just like I did before...",
            "review_score": "1"
        },
        {
            "review_text": "Definately worth more than the $0.99 it's on sale for! Great game from the orginal X-box era.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Storylines of all time on this amazing Double Fine game it is a must play, PS. OMG that Nostalgia",
            "review_score": "1"
        },
        {
            "review_text": "You would have to be insande to give this game a bad review - somebody would literally track you down and crucify you.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely detest platformer games. Yet this is my third playthrough of this masterpiece, I didn't even fully realise it was a platformer while jumping around, because I was too busy listening to the weird as hell characters and trying to get to that damn card over there! I'm glad I bought it on steam, as I missed my console version.  There's a million collectables (which I love trying to find), really simple but effective humour and for someone who can't and won't jump around for ♥♥♥♥, it's surprisingly fun and easy to play, while still being a long game with tedious but beatable moments.  Now I will say the actual story is a little...thin at times!? But it's damn fun, I love aiming to get everything and seeing all the strange minds. I love it, it makes no sense, but It's awesome. If you hate platformers, I don't know if I'd reccomend it, because although it's fun, it might cause you to rage quit, every case is different! MILKMAN",
            "review_score": "1"
        },
        {
            "review_text": "The devs of this game are really ♥♥♥♥ing smart that its unbelivable.",
            "review_score": "1"
        },
        {
            "review_text": "Brings back good memories, mostly sitting in my library now as a trophy of the past. Cartoony and fun, try it, but it isn't for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "I first played this many years ago. What I found was neither game, nor milk. I replay it at least once a year.  11/10. Would subconscious again. All hail Goggalor!",
            "review_score": "1"
        },
        {
            "review_text": "Like platformers? No? well youre gonna love this anyway. seriously, dont bother looking at reviews, you need this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Super Mario 64/Banjo and Kazooie, than this is the game on PC for you.  Tons of collectables, great story/characters. Some sick boss fights and levels designed by pros.  Also don't forget +cheivements +cards +controller support +wide sceen 1920x1080 +looks incredible even after all these years due to its art style.  Highly recommended, a must have for any N64 player.",
            "review_score": "1"
        },
        {
            "review_text": "I can't see my ♥♥♥♥♥ anymore, this game didn't make me blind it's just I don't have one D:",
            "review_score": "1"
        },
        {
            "review_text": "A long time ago, I ready a magazine article (back when they existed) that listed Psychonauts as the best game you never played that given year. While I do not normally take too much direction from magazines or web sites I thought I would take this one recommendation and some time later (it takes time for me to get around to things) I sauntered over to the game store and found a XBox copy in their used section and picked it up. I can say now that the magazine was definately accurate in its description as a good game but was no longer accurate in saying that I had not played it.  I'm old enough to have grown up playing that classic platformers of the NES and SNES era and was always a fan of such games. When Mario 64 came out I was immediately impressed the platformers transition to 3D gaming. Psychonauts is compariable to Mario 64 in much of the basics of 3D platforming but with some evolution beyond Mario 64. First, there is an actual story to follow; second there are slightly more fleshed out characters; and third the environments have moved beyond the obvious themes (fire, ice, castle) of Mario style platformers.  The story is fun and highly comedic. It at times will play with a trope and try to switch it up; such as the child running away from the circus. The characters themselves have some interesting details and various quirks and with some of the characters you get to dive right into their mind to explore them in a little more detail even if surreal and filled with metaphors. It is these trips into a characters mind that allows the game environment to shine and be unique and evolutionary. Unfortunately, the number of minds you get to explore felt too few mainly because they were so enterataining and I so wanted more. Thankfully, there is now a Psychonauts 2 coming down the pipe.  Somewhere in this simple review I wanted to make a play on the term minefield/mindfield but just couldn't get it to work so there we have it. Psychonauts is one of my favorite games and one of the few I have actually gotten around to finishing and completing (twice even, thanks to getting it again on Steam).  (This review done under diress in order to complete the 2016 Autumn Sale badge.)",
            "review_score": "1"
        },
        {
            "review_text": "Not bad for an old game",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games ever and it still stands up.",
            "review_score": "1"
        },
        {
            "review_text": "Big eyes goggle head, the game.",
            "review_score": "1"
        },
        {
            "review_text": "Play. This. Game.  This is one of my all time favorite games and I have bought it for multiple platforms for a damn good reason.  You are Raz, a circus runaway determined to join the elite ranks of the Psychonauts. He infiltrates a covert training camp for young psychics and must hurry to earn his merit badges before his parents arrive to pick him up.  The characters in this are all incredibly well written and rounded, and there's no feeling of forced exposition as you're quite literally infiltrating the minds of your counsellors and 'obstacles' (the only way to really describe some of the Asylum patients) so learning their backstory is more along the lines of having read someone's diary and then having them go 'oh, uhhh, yeah, I guess you know THAT about me now.'  The characters are great, the dialogue is great, the voice acting is great, the game play is really good despite the difficulty curve ramping up in a hell of a hurry toward the end.  The graphics are dated for sure, but that's easily overlooked as part of the art style.  This game may not be for everyone, but if you don't love it I hate you and we can't be friends.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I remembered loving this game when I had it on xbox and when i saw it on Steam I had to have it! I was worried it might not hold the same magic for me but it does, as soon as the opening scene began i found myself smiling and gleefully anticipating what was to come. If you played this on console back in the day, get it! If you've never played this game and are looking for a game with bizarre humor, unique gameplay and unforgettable characters, get it! You won't reegret it.",
            "review_score": "1"
        },
        {
            "review_text": "a great platformer with in my opinion good humor and a not over complicated story if you want a review that this game deserves go google it cause i suck at making them but this is a great game so give it a chanse.",
            "review_score": "1"
        },
        {
            "review_text": "eXPLORE THE MIND OF YOUR CREATORS and also do platforming or something idk",
            "review_score": "1"
        },
        {
            "review_text": "Stay away from this game, 6/10",
            "review_score": "1"
        },
        {
            "review_text": "My favourite game!",
            "review_score": "1"
        },
        {
            "review_text": "A lovely adventure game about solving metal issues from the inside of the head. Very quirky, deliciously mad and with an incredible dark side.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Best game iv'e played in years, even for a 2005 game  10/10 would kiss brains again",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of fresh blueberry muffins in the morning with a glass of orange juice on the side",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games of its time and im still awaiting a sequal. a must play",
            "review_score": "1"
        },
        {
            "review_text": "10/10 one of the greatest games anyone could play . -relived my childhood  -fun to play more than once  - funny - AWESEOME THROUGHOUT THE ENTIRE GAMe",
            "review_score": "1"
        },
        {
            "review_text": "An unmatched masterpiece and one of the best if not THE best game of all time. Memorable and deep characters, sparkling humor, unique design, incredible attention to details. And above all, this game is Fun with a capital F.  A true classic. I give it an impeccable four out of four brains.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, funny characters, great controls and awesome plot",
            "review_score": "1"
        },
        {
            "review_text": "'I am a grieving widow.'",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games of its time and im still awaiting a sequal. a must play",
            "review_score": "1"
        },
        {
            "review_text": "eXPLORE THE MIND OF YOUR CREATORS and also do platforming or something idk",
            "review_score": "1"
        },
        {
            "review_text": "Extremely great 3D platformer. I don't even like this type of game that much, but this one... it's full of very nice stuff. Keeps delivering new content until the very end, never get boring. A lot of collectables, gaining levels, increasing abilities, pretty good humor and a LOT of different settings. It's really worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Makes me want to play even more after finishing it. Hoping Double Fine will make a sequel soon!",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts represents the answer to question 'what if Monkey Island was a platform'. Take a classic platform elements, mix well with a nice story, magistral characters and spectacular levels and then you got Psychonauts! If you like to platform games AND visit over and over all the locations just to see how everybody reacted after your last progress in the plot, then this is your game! Overall, a must for all the nostalgic of Lucasfilm Games! However, if the story is not catchy for you and your interest is just to rush without exploring some of the best game levels ever created, Psychonauts does not offer more than others platform games.  Pro(s) - Story and locations - Characters - Game levels   Con(s) - Game levels (a few, with some boss fights) - Game balance (if you run for 100% achievements, you become quickly overpowered)",
            "review_score": "1"
        },
        {
            "review_text": "This is my 2nd time playing this game and it's still ♥♥♥♥ing fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "'I really like the game, but I couldn’t find the stupid cake",
            "review_score": "1"
        },
        {
            "review_text": "It is no small task for any developer to craft a game that appeals to both the 'hardcorest' of hardcore gamers and casual players alike, but that is exactly what Double Fine has done with Psychonauts. An epic masterpiece on pretty much all levels, Psychonauts has it all. Platforming, exploration, collectibles, crafting, and of course - an absolutely ZANY world full of loveable characters (and not so 'loveable') set in a vast mostly open world that brings back childhood memories in bucketfulls of mischievious gaming bliss.  An absolutely superb game that has no equal = 9.5/10 (.5 taken off for camera 'weirdness' at times) = a MUST have and a MUST play!!",
            "review_score": "1"
        },
        {
            "review_text": "this game is so fun!! the only thing that bothers me is finding where to go. its really good though and it has a good story with interesting characters and its just fun to play. definitely get it if you like platformers its well worth the price",
            "review_score": "1"
        },
        {
            "review_text": "I am the milkman. My milk is delicious. Seriously. If you don't own this game you are missing out.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Call of Duty.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played this game, I didn't want to stop. It's a clever, enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Hey Goggalor! Just get it. ASAP.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome funny game! Play it nao you fool!",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: I Realize my previous review was a tad uncalled for, sorry, I was frustrated with the blueprint brain-tank. I do love the storyline, and it's a fun game, but the control systems could be better, especially the auto-target. Also; I only figured this out a bit ago (Got razputen's voice stuck in my head), LOVE the fact it's the same person who voiced Zim from the old TV Show, Invader Zim. XD",
            "review_score": "1"
        },
        {
            "review_text": "camera killed it, im sorry  Edit: apart from the camera being horrendous i feel this game is overhyped, I do not like the gameplay, only thing that keeps me playing is the story which is great. I bought this for 40 cents but. I would suggest just watch all cutscenes because they are way better than gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "The premise is indeed interesting - finding and fighting your way into someone's mind. There's plenty of humor as well, it's aesthetically beautiful and the dialogues are witty. But the game itself is frustrating. It's one of those platformers with a bazillion colorful things to find and collect. The fighting segments are dull. Three hours into the game it I was still in the training, doing the same things over and over again. I really wanted to continue this one, but I just couldn't. It reeks of mid 00's platforming mediocrity. No way this could be 'one of the vert best games ever made'.",
            "review_score": "-1"
        },
        {
            "review_text": "Good graphics and art style, Level design etc.. Platforming sucks, good puzzels though, weird camera angels, in game techniques such as double jump works sometimes and sometimes it just won't. Very frustrating more than fun at times",
            "review_score": "-1"
        },
        {
            "review_text": "For every interesting idea you can find in this game there also a horrible gameplay decision along with poor mechanics and overall frustrating gameplay. Nothing that special in the end.",
            "review_score": "-1"
        },
        {
            "review_text": "Camera/Gamepad issues on Linux just made me stop playing after about an hour. Shame.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like this game at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Running Windows 7. Not sure if it matters at all, but everytime I open the menu and try to switch tabs it crashes the game. Buy are your own risk.",
            "review_score": "-1"
        },
        {
            "review_text": "u know that fiction section in the library labelled '10-12 years old' this game is something i'd find there and think it cool if i was 10 im not stopping u tho, if youre an special snowflake edgelord that enjoys this stuff",
            "review_score": "-1"
        },
        {
            "review_text": "I have fond memories of Banjo-Kazooie. Having heard high praise of Psychonauts and hearing it was in a similar tone and style, it seemed like a perfect fit.  But I was never drawn in by it's whimsy like a was the old N64 platformers. That's pretty big shame because that seems to be a big draw to this game. Some mechanics seem illconceived, regardless of it's age. Some levels are fine, but other are frustrating in ways that are unnecessary. These tend to be levels that rely heavily on precise platforming in ways that 3D platforming is not meant for.  What capped off my experience with Psychonauts was the Meat Circus level: three 3D platforming sections divided by escort missions. None of this is checkpointed, so failing any section will start you back at the beginning.  My frustration Psychonauts makes me wonder if a modern 3D platformer can be successful.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah yeah... I don't recommend your most favorite game of all time...  This was my first time playing Psychonauts, no nostalgia filter. Some of the praise holds true. Levels are extremely creative, changing the game up slightly with each set-piece. Many characters are hilarious and unique as well, even if 60% of them have ear-bleedingly annoying voice actors. But dear god, cutscenes, boss fights (the classic 'dodge his attacks three times and then use your new ability on him' boss fights), cutscenes (yes, I know I wrote it twice), and janky PC combat controls. Platforming is awkward, especially with the wonky self-controlling camera. Some puzzles were clever but had downright esoteric solutions.  If you're looking for a classic combat platforming game, go Sly Cooper, go Jak and Daxter, go Ratchet and Clank. This game was a grind of boredom, frustration, and brief moments of funny banter.  You may now downrate my review.",
            "review_score": "-1"
        },
        {
            "review_text": "Behold, 3.3 million dollars on Kickstarter gets you a ♥♥♥♥♥♥ game that looks like a PS2 game.",
            "review_score": "-1"
        },
        {
            "review_text": "I personaly dislike this game. Even though I didn't play very much of it, I became very annoyed with with this game and decided to stop. the characters scared the $!'£ out of me and I found almost all of the characters very unlikeable. The gameplay is pretty good and the idea is good but I simply found it annoying",
            "review_score": "-1"
        },
        {
            "review_text": "Story isn´t bad. The controls are horrible.   Can´t recommend that game. Watch a Let´s Play instead.",
            "review_score": "-1"
        },
        {
            "review_text": "When I write reviews I do so because its what I think, its my experience and as such its colored by my experiences and tastes. Generally you would think that someone who created Monkey Island, Stacking, and Costume Quest would be someone I would love. Yet I have to admit that in general I find Tim Schaefer and his work lacking. Lets take Psychonauts, the Art style is something I simply cant enjoy at any point. I spend a few minutes and I have to turn it off its so horrble looking. The gameplay was boring and felt way to hipster for me. Which is always what I feel Tim shoots for in his work, way too much wacky concepts thrown into a world with questionable play style. I give Psychonauts a 30/100 Bad",
            "review_score": "-1"
        },
        {
            "review_text": "Easy, boring, kids game. Then you have to save a kid and his rabbit and the game goes from easy to very hard. Had to take a break a few times to get through it.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the beginning of this game. I wanted to like the whole game, but when you have a mandatory 'Moving Screen' chase with rapidly changing camera angles messing with your controls followed by a boss fight, I'm just going to stop playing.",
            "review_score": "-1"
        },
        {
            "review_text": "3/10",
            "review_score": "-1"
        },
        {
            "review_text": "A classic game that makes everyone who has played it ask for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Light, nice hidden message (TV related ;) ), a little predictible history but filled with nice details, also pretty nice to be able to understand people's psychology trought vaults!",
            "review_score": "1"
        },
        {
            "review_text": "This game is totally awesome! I highly recommend it! Not only a fantastic concept but also great fun to play! I wish someone would just fund the sequal already.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game,i just wish they would make a sequel",
            "review_score": "1"
        },
        {
            "review_text": "So-so platformer with stupid but important cutscenes and without normal scenario",
            "review_score": "-1"
        },
        {
            "review_text": "I really like the weird charecter designs of this game. Interesting story with some pretty creative charecters. This game is definatly worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Very fun to use the psychic powers, and has some of the most unique levels I've ever seen in a game of this style. Has a really cool story in my opinion with a decent amount of comedy.",
            "review_score": "1"
        },
        {
            "review_text": "Meat Circus wasn't even hard guys.",
            "review_score": "1"
        },
        {
            "review_text": "This is a humorous and action-packed adventure, there is an interesting art style and boss fights are really fun 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "A classic masterpiece from the twisted mind of Tim Schafer.",
            "review_score": "1"
        },
        {
            "review_text": "A great, humorous game that is worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Great Storyline,Quirky Characters, and Unique Level Design.  It's a Instant Classic!   If you have Brains go buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "I've wanted this game for years. Back in the days of PS2 I heard about it and looked forever to rent it (those were the days). This sale is an absolute must have. It's been on my wishlist for ages and I finally grabbed it at a cool 2 bucks. I got it today and logged 6.7 hours. That's how good it is. I've never been to summer camp but it still gives me nostalgia for childhood summer camps. The story is so quirky and genuinely funny. I gave the keyboard and mouse controls about 2.2 seconds before realizing they are aweful and immediately found on the Steam community forum a download for a user made .exe called psychopad that makes the game 100 times better. It works wonderfully with an Xbox controller but claims it is designed for any pad. Pros: funny story, quirky memorable characters, fun items, gameplay and powers. Cons: Controller support has to be manually patched in. I also had an occassional minor audio glitch but it's otherwise ran perfectly for 7 hours sraight. Looks great, plays great, makes me laugh 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is Banjo Kazooie-esque with the controls and combat, yet it also has the insanity and horrifying creativity behind it that is only matched by Alice: The Madness Returns. For being such an old game, it is really well done. I am amazed by the little secrets and easter eggs along with the puzzles and fights. From being in a suburb filled with public workers and having to run around to find disguises, [I am a greiving widow. I am making a pie.] to stomping around on a town of little Lungfish inside of a mutant Lungfishes mind, this game has plenty of action and just enough of a 'wat factor'.  Pick this game up ASAP if you haven't already, perhaps you played it on a console way back when? Well then boot it up and re-play it, it's worth it!  The only complaint is that the Dowsing Rod [Used to find the game's currency.] is a bit annoying to use, and the death scream is silly. *Brfrfzfrzrffrfzbrfrtfb*  A++, get it now, play it now.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers ever!",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 for kids!  No really, Psychonauts follows the same mission model as Far Cry 2, but the gameplay couldn't be more different. It's not really *for* kids, but would be a great game for a kid. Still fun for all ages, though.  I don't really know a great way to describe it. You just go around doing cool things with cool powers. Kinda like X-Men meets Sesame Street. Yeah, that's it. Now doesn't that sound like a riot?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a charming, clever, hilarious and unique experience, I highly recommend you play this. It really is unlike anything you've ever played.   Not because of the gameplay, which is merely alright and, fortunately, doesn't get in the way of all the other stuff, that's great about the game:  well-written dialogues, some of the best humor I've seen in a videogame, the uniqueness of every individual level, the bizarre artstyle, which somewhat reminds me of games by Michel Ancel, like Rayman 2 or Beyond Good And Evil, and so on and so on.  ",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful experience, but the age is showing and if you don't like platforming you won't like this. Still one of the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "'So this is what going mad feels like.'  This combines quirky platforming, excellent voice acting throughout, and a quirky-yet-dark tone (writing by Tim Schafer and voice work by Richard Steven Horvitz, best known as the voice of Invader Zim, go some way towards this).",
            "review_score": "1"
        },
        {
            "review_text": "one of the best things to ever happen to the adventure genre, play this if you're a cool dude",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game ever made! Try it out if you enjoy good storytelling and solid gameplay. I't also very funny!",
            "review_score": "1"
        },
        {
            "review_text": "Another fantastic game that I cant complete due to a glitch!  ",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful platformer with plenty of humor, good gameplay mechanics, and a very fulfilling ending that works because you actually care about the characters. Make no mistake, this is not a game for children.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just good old fashioned fun times. Whether it's the unique atmosphere, the sweet psychic powers, or the entertainingly oddball story line you'll find yourself wanting to play it a number of times. I've heard there's a second one in the works but as this game is a touch old now it's best not to get your hopes up",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Well scripted, well designed, worth your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Clever, Smart, and Funny adventure game. If you don't like games that are Clever, Smart, and/or Funny then go ♥♥♥♥ yourself.",
            "review_score": "1"
        },
        {
            "review_text": "you can see up Milla Vodello's skirt, but she has no legs",
            "review_score": "1"
        },
        {
            "review_text": "Whether at full-price for only $10, or on sale (as it is at the time of writing), Psychonauts is worth whatever money you spend on it. It's funny, it's challenging, and so charming that you'll want to take it out on a sexy date after playing. It's one of my all-time favorite games. Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "Double Fine's psycho-child is mighty fine. You've got good platforming, a kooky and enthralling world to play in, and the amount of personality, character, and love that went into this is plain to see. Anyone looking for a romp through the weird and wonderful should check this out.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't heard of Psychonaughts you haven't been playing games long enough to know whats good. The fact that it wasn't Market successful makes this game a hidden gem for people who actually enjoy well made games. The story is Odd (in the right way) and fulfilling. The Characters are all different kinds of nuts. 3D platforming at its BEST",
            "review_score": "1"
        },
        {
            "review_text": "Okay we all love Psychonaunts, we're in complete agreement on that, yes? Good. Now... Will anyone buy the sequal when it comes out? *crickets* God damn it",
            "review_score": "1"
        },
        {
            "review_text": "Once upon a time, there was an awesome plataformer that was also the main inspiration for Mario Galaxy. Except that no one heard about it. Creative levels, charismatic and insane characters and all the plataforming stuff that you would need.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ridiculously creative, and super fun. Learn psychic powers, dive into peoples' heads, use your powers for combat, navigation and puzzles - everything works really well together, and has some absolutely classic moments. A light-hearted and fun adventure with some hidden but really dark elements. Psychic adventures ho!",
            "review_score": "1"
        },
        {
            "review_text": "I always heard about how great Psychonauts was, so I finally decided to check it out. It's just as great as I had hoped, and funnier than I imagined. The gameplay is that of a typical third person platformer, but the distinct art style and humor really give the game a unique tone. It truley feels like a modern adult swim show, almost like a saturday morning cartoon with adult references. The art pops, the writing is slick, and the gameplay is nothing short of perfected. It played great on mouse and keyboard, but there is controller support for those who prefer it. Definatley check this out if you injoyed Eric Wolpow's writing in Portal 1/2 or Tim Schafer's design direction in Monkey Island, Day of the Tenticle, or Grim Fandango.",
            "review_score": "1"
        },
        {
            "review_text": "Mix the gameplay style of the N64 Zelda games, with all of the quick wit and surrealist humour of many 90s kids' cartoons, and you get Psychonauts. AKA the best ♥♥♥♥♥♥♥ thing ever.",
            "review_score": "1"
        },
        {
            "review_text": "Why haven't you played it yet?",
            "review_score": "1"
        },
        {
            "review_text": "absolutely stunning game. can't believe I've waited this long to give it a try. it's a must have for anyone who's looking for a humorous platformer (kinda like 'conkers bad fur day').",
            "review_score": "1"
        },
        {
            "review_text": "A cool old-new game that has an original style even though incorporating familiar stuff from past 3D Platformer games. Imo at first seemed dull, as the game starts and progresses it immidiatly gets better, more suprising, funny, interesting and overall more fun.  The humor is great and the setting is surprisingly awesome.  If you didn't get to play this as a kid/young teen, i recommend to try this out, definitly worth the buck.  And definitly needs a sequel !",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts has some really good writing and the art direction is just to die for with all the weird characters.",
            "review_score": "1"
        },
        {
            "review_text": "This game came out 8 years ago, and every time I play it again all I can think is:  1. How amazing it is  and   2. How few people have played this.  This is as good as gaming gets. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Mario meets Laura Croft. Fun, creative argument and dated graphic. I didn´t go far, as I'm not much of a fan of jumping and collecting coins... but it's a good game nevertheles.",
            "review_score": "1"
        },
        {
            "review_text": "Truly an often overlooked jem.",
            "review_score": "1"
        },
        {
            "review_text": "An overlooked masterpiece that deserves your full attention. One of the few games that actually made me burst out lauging (in a good way). Not a purchase you will regret.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is the best ♥♥♥♥ing game ever made, thank you dubblefine for everything. You guys made my life better &lt;33333",
            "review_score": "1"
        },
        {
            "review_text": "Really fun adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "Pure awesome, be warned the end can be little frustrating",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game a long, long time ago and never played it. I started because of the recent Steam stuff going on, and it's fantastic. Goes to show you that there are some games that age very, very well, and Psychonauts is certainly one of them!",
            "review_score": "1"
        },
        {
            "review_text": "The genius of a game that started the Double Fine phenomenon.",
            "review_score": "1"
        },
        {
            "review_text": "Thankfully I never went to summer camps but if I did, I know it wouldn't have been a psychic summer camp. Will happily bring my future children to one if it ever existed. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever palyed. Fun story, clever game concept, good for many ages.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one that I have remembered, and have played full way through twice. It is definetely a game for people who like platformer based games, crossed with comedy, creepy moments and action.  It does not have much re-playability though, as once completeing the game, you cannot explore the summer camp anymore.  That aside though, this is definetely a game for those who like something different.",
            "review_score": "1"
        },
        {
            "review_text": "fun game kinda like super mario 64 if mario had psychic abilities .",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Unique concept and really fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game definately worth playing. However the game is not very hard and the only hard parts are due to the camera being moved on you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely entertaining. Proper level of difficulty and puzzle variety, comical story, and the character models are hideously ugly and you love them for that: they're just as colorful as their personalities.  A controller is MANDATORY to play, however. Mouse and keyboard is almost totally nonfunctional.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer, full of puzzles. I personally recomend playing with controller.",
            "review_score": "1"
        },
        {
            "review_text": "art student platformer no but seriously this is a classic platformer with lots of good levels and ideas to offer, but some aspects haven't aged very well at ALL because this is an archetypical PS2-era game. for a game with so many great and interesting and unique ideas though, it's worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "this game is so great! its so cool being able to use different psychic abilities, and there is lots of collectibles to satisfy the completionist in me. the story is brilliant and the worlds are amazing! 100 STARS",
            "review_score": "1"
        },
        {
            "review_text": "Light, nice hidden message (TV related ;) ), a little predictible history but filled with nice details, also pretty nice to be able to understand people's psychology trought vaults!",
            "review_score": "1"
        },
        {
            "review_text": "when i pull up the game, it crashs on as soon as i get started running around, please help me",
            "review_score": "1"
        },
        {
            "review_text": "This thing have been on my library for ages. tried it out for boredom and totally fell for it. Its pretty old game but the controls are as accurate as you are. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even a decade old. Worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "Remember that time when you ate that mouldy cheese and spent the next 24 hours on a hallucinogenic mind trip? Everyone acted strange toward you and you were certain you were the only one making sense. You were stuck in your pretty little world and despite your warped perspectives you kept on giggling like a little school girl. Sure, toward the end there were the stomach aches and the hour long toilet sessions, but to this day you claim it was the happiest time of your life.  Psychonauts is that same experience but in video game form.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like the knees of bees. It's black, bony, and it'll show you a good time if you rub it the right way. Sideways. Sideways is the right way.",
            "review_score": "1"
        },
        {
            "review_text": "This is important to mention:  This game is criminally underrated, very much so!   Even though I only just got this on PC yesterday, I have been playing this on the original xBox since it first came out and it's probably one of my personal favorites it's almost perfect. All the characters are hilarious, lots of inside jokes and good humor, a charming art style, and most importantly, it's game play is almost flawless. With the exception of it being a little finicky to control in some places, it is great. Even though my playtime is like 73 minutes on steam, I have played well over 200 hours of this on console. I highly recommend this to anyone who loves adventure games and wants to try something unlike any other game in existence. Still waiting for Psychonauts 2.....  I rate this a 10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredibly hilarious and fun to play with each level being unique and interesting. However, there are several frustrating flaws. Cons  Psychonauts does suffer a bit from the 'use this power for one area and hardly ever use it again' syndrome. This is somewhat remedied through the hub world, where all the powers are useful.  I think the main downfall of this game is the forced platforming. There were several moments where I had to redo a jump because I would miss just slightly, which was incredibly frustrating.  I also felt there were many moments where the game was just taking too long to progress. Now, this may be due to me being terrible at the game, but at the times where I missed a jump, I would have to go through a long sequence to get back to attempt the jump, which I would end up failing again, resulting another long sequence. The final level is also incredibly frustrating. None of the parts are necessarily difficult, but when you fail, prepare to have to redo alot of stuff to get back where you were. Pros The best part about this game are the characters. Every character you meet is incredibly interesting and unique from the others. Each one has unique character developments that you can choose to find, or skip if you don't care. The game doesn't force you to listen to long dialogues about each character. Instead, you can learn about the characters at your own pace. The levels are all unique and relate to a character. Each one has it's own quirks that make it different from the others. There were very few levels that I didn't like, and the ones I didn't like were personal preferences, rather than level design.  Overall, if you are patient, and enjoy fresh and interesting characters, buy the game. If you dislike failing or hate interesting characters, this isn't the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Its Tim Schafer, whats not to like?",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game ever, ever, ever, ever created....ever. Played it through twice now and it is just so entertaining and a brilliant concept. I'd happily pay 4 times the price for this game. So seriously, give them your money!!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time. Engaging, fun, challenging, and always good for a laugh.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Reminds me of Johnen Vasquez works, Definitely recommend at this price.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and funny. One of my favorite games of all time. It's a bit different than playing on consoles as the camera gives the player a few problems.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games ever. The gamplay is great. I highly recommend it to anyone. I have played through the PS2 version many times and the reward of steam achevments just makes the pc version even better. If you enjoy artisticly desinged worlds and overall fun gameplay with more to discover on each playthrough within a semi-linear story line this title may well find its way into your favorites list as well.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I'm hating myself for not giving this a positive review.  This game is full incredible ideas, it's got a great story that is kid-friendly, it's well voice acted and the game is obviously the labour of a lot of love from the dev team.  I did, however, feel so very often through this game that super-mario 64 was so much more for being less. 'It's a lot like super-mario 64 without the fun' were my exact thoughts through most platforming bits.  After finishing it, if someone asked me if it was worth it, i'd say: 'yes, but mostly as a game critic'. As I player, I couldn't wait for the game to be done, it felt laborious. As ideas go, I really needed to make sure I saw them them all. This game is an incredible example of when the sum can be less than the individual parts...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing. It made me buy many other Double Fine productions, which I ultimately regret as nothing even comes close to Psychonauts.  Story and characters are fun and very original. Humour is well-balanced and genuine. Story is rudiculous. Level design is breathtaking, even for such an old game. It is a shining gem, one of the best game in history.  It's not perfect, obviously. Platforming in 3D is tricky business, and final level can make you break the controller with rage, scavenger hunt is ♥♥♥♥♥♥♥t, and finding every figment for 100% is beyond challenging, but the game is a must-play anyway.  Joypad recommended.",
            "review_score": "1"
        },
        {
            "review_text": "So surprisingly good. It gets to be more and more fun at each level - stories within stories... I love it so much.",
            "review_score": "1"
        },
        {
            "review_text": "10 Years old and its still a great game! The art style has helped this game age amazingly and the gameplay is still as fun as you can get with a platforming adventure title.   If you are a fan of the genre or just like fun games, get it!",
            "review_score": "1"
        },
        {
            "review_text": "'I am the milkman, my milk is delicious' *throws molotov coctail at army*, I love it 'I don't speak skinny monster boy' really fun game. It is a very sweet game, a lot of creativity in it, and not boring at any times, there are a lot of different easter eggs and small things that you can find out, it also has dark aspects hidden via the twins, mila, the connection between mila and the milkman, and sasha nine. Easily my favorite game, I just wish that I could keep playing after beating the final boss instead of being sent back before him at the opening credits.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games I have ever played!!",
            "review_score": "1"
        },
        {
            "review_text": "Help James Willems get casted for Toilet number 4 in Psychonauts 2",
            "review_score": "1"
        },
        {
            "review_text": "This is gaming as art in the truest sense - a beautifully realised universe with moments of genuinely adult themes but still fun and still challenging. If you don't like this game, you are welcome to remove me from your friends list.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely stunning game. can't believe I've waited this long to give it a try. it's a must have for anyone who's looking for a humorous platformer (kinda like 'conkers bad fur day').",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. Used to play it all the time on the Xbox. Playing through it again, and the humor is still very great. Definitely a must play for anyone wanting to laugh while they play.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts got a 2.6gb patch today. Steam Cloud support, achievements, Mac support, level design fixes... wow. The game's 6 years old now. I'm extremely impressed. If you haven't played this gem of a game yet, now's a better time then ever.",
            "review_score": "1"
        },
        {
            "review_text": "Come for the witty dialogue, stay for the Meat Circus.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most creative games I ever played!",
            "review_score": "1"
        },
        {
            "review_text": "This game is old, but it's one of the most unique games you'll ever play.",
            "review_score": "1"
        },
        {
            "review_text": "PLAY THIS GAME. IT'S BEAUTIFUL. PLAY IT. JUST PLAY IT. ♥♥♥♥ING. WHAT IS WRONG WITH YOU?! PLAY IT!",
            "review_score": "1"
        },
        {
            "review_text": "This game came highly recommended. I can imagine why people remember it fondly, but now the gameplay elements which were a novel mix at the time of release are pervasive in other games, and so I didn't find it engaging. Also: for kids.",
            "review_score": "-1"
        },
        {
            "review_text": "If you haven't bought this game, you're seriously missing out. Plot's good, gameplay's good, soundtrack's awesome. Yup, you're all missing out.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely stronger in story than having innovative mechanics, but the story is definitely one of the best. The style is demented, and yet it's all so unique. If you love platformers, psychological themes, and fun characters to explore, you need this.",
            "review_score": "1"
        },
        {
            "review_text": "This game has quickly become one of my favorite games, it is surely a must have. - It is extreamly addictive with constantly changing game mechanics. - The character development is extreamly well done, with each character being extreamly likeable and individual. - The boss fights are extreamly fun and challenging. - The game has a present charm the whole way through and indulges you into the immersive world it creates  I could not recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit, I was a little wary about this game at first, but the gameplay quickly drew me in. Overall, it is a fun adventure game with a cool story. One thing I especially enjoyed was all the little side things thrown in for humor, although, you really only get to see them all while going for achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Best singleplayer game on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most inventive, artistic, and entertaining platform games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Classic DoubleFine game, really fun to play and its a steal for how cheap it is, one of the best games ive played in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with lots of cool level designs. If you have not played this and are looking for something fun to play that you might have missed check this game out. Great game for the price especially if you buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Psychedelic experience. Totally recommended",
            "review_score": "1"
        },
        {
            "review_text": "My only regret in this game, is not playing it sooner",
            "review_score": "1"
        },
        {
            "review_text": "Childhood Memories, I really missed this game!",
            "review_score": "1"
        },
        {
            "review_text": "A fun platformer filled to the brim with character. Easily one of my favorite games. Did I mention the levels take place inside people's minds?",
            "review_score": "1"
        },
        {
            "review_text": "One of the first PC games that got me into playing my PC. It's graphics aren't the best but that isn't the point. The whole game is wonderful, creative and just fun to go through. Each 'world' is unique and matches the character it's with. The gameplay is a bit clunkier than I remember with a keyboard and mouse, took a lot of fiddling to get it right for me but it's totally worth the trouble.  Loved the game from the start to the finish and it was only a buck on steam! What a deal!  Other than the last level, you know what I'm talking about... everything else was great!",
            "review_score": "1"
        },
        {
            "review_text": "I was loving this game so much until I got to what I believe is the last level. This went from a game I was planning on getting all of the collectables and all of that straight to me being incredibly frustrated with the game. It's a shame because it's a fantastic game just to have an extremely frustrating end.",
            "review_score": "1"
        },
        {
            "review_text": "No Longer Has My Playings",
            "review_score": "1"
        },
        {
            "review_text": "do mind stuff and have the game ♥♥♥♥ up halfway through because i dont know",
            "review_score": "1"
        },
        {
            "review_text": "I played this when it came out on the Xbox and it was fun. Looking back on it, I can appreciate how well this game is done. This game was super under-rated for its time.",
            "review_score": "1"
        },
        {
            "review_text": "great game 9.5/10  childhood favorite",
            "review_score": "1"
        },
        {
            "review_text": "This is an enjoyable game with some extremely humourous scenes throughout. The story was engaging and the game play was fun if a little simple. It took me approximately 24 hrs to complete and to be honest I am not the best gamer, I am sure many could complete this in circa 20 hours.   The graphics were as you would expect from a decade old game but they were some very well designed characters which makes all the difference.  I will say on the negative side there were a few wonky controls once or twice, even so despite this overall it was a lot of fun to play through and kept me engaged and wanting more so really, what more can you want from a game?  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing to buy if on sale, but still worth every penny otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "The platforming is great, the humor is fun and it doesn't look too dated most of the time thanks to the style they chose to render the characters. Only complaint is that on one particular stage it's really hard to see the Figments because the colour scheme of that stage is very similar to that of the figments.   Play this game with a controller. BIg picture mode makes it seem like you should play it with a keyboard and mouse and you technically can. It's a whole lot easier to control with a controller though.",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece. A marvelous game of amazing visuals, story, characters, gameplay and world. A nostalgic, in more ways than one, adventure you will never forget, an old school classic 3D platformer every good person should play. Crafted with love, talent, competence and dedication, you can feel how much went into creating this unfortunately unknown gem. A must have. ♥♥♥♥, I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, funny, and entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is the best game ever made. It is the only game that Yahtzee demanded his viewers buy. Its spirit should be the model for all games to come. If you do not buy Psychonauts then you deserve the pencil torture.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best games out there. The comedy, the gameplay, the story, the characters; everything comes together so well to make Double Fine's best creation. I can not recommend this game any more, buy it and play it for yourself, it's easily one of the best games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Why is my icon Tim Schafer throwing up money in the air? Becuase of this game, that's why. Psychonauts has one of the richest and fullest worlds, complete with ♥♥♥♥ing meaniningless characters that should have no earthly purpose, being a major strong point! Too many games today want you to know nothing about them and their world and Psychonauts just wants you to enjoy the ride however you please.",
            "review_score": "1"
        },
        {
            "review_text": "Original but frustrating game  The game is amazingly original. It has a great story about psychics, creative sets, and funny story telling. The game feels very original because each section is unlike any other section and keeping that high level of creativity is really hard in a game. You never know whats going to be thrown at you next but its all cool and different. The game has a dark sense of humor. It seems like a game for kids but then you see some REALLY ♥♥♥♥ed up moments that make you cringe and laugh because its horror contrasted with whimsy. It creates a great atmosphere and it's halirous. The main character and the whole cast is very distinct with each character getting plenty of screen time so you can see who they are. Each time you go in someone's mind, you see the struggle which keeps them stuck in their current state and you feel sorry for them a bit.  However, the game is very frustrating. It came out in 2005 so the graphics are bad. It supports 1600x900 but you can tell the game is basically sampled up. The cutscenes are all low resolution and run at 30fps regardless of your system which is weird. The game is old so I thought I would be able to run it fine but turning on fsaa tanks it below 60. Normally it runs around 70-120 fps but looking at certain sections drops it to about 40 which is really jarring.  Certain parts of the game are utterly frusrating because you have lots of platforming where the camera doesnt zoom out properly so welcome to trying to swing to something in the middle of the air without knowing how far away it is and not knowing if you need to double jump or not. Also, the levels sometimes go from ground to the top which adds to the atmosphere but its easy to fall and if you fall, welcome to doing the whole ♥♥♥♥ing thing again. In addition to that, the boses are just figure out which two powers affects them and repeat. There is a lot of collecting and unless you obess over it, you are never going to get it all.  Despite this, the game is still really good. It's amazingly creative and funny and if you look at all the dialogue, you'll be happy",
            "review_score": "1"
        },
        {
            "review_text": "In terms of straight fun, the best game I have ever played. Hilarious Double Fine humor, fun game mechanics and abilities, along with memorable characters makes this an awesome experience. Must play.",
            "review_score": "1"
        },
        {
            "review_text": "Put Simply this is the best platform fuuny crazy entertaining game on the market, my all time favorite game and a game I'd suggest to literally anyone barely into platform and fun.  Buy it you won't regret",
            "review_score": "1"
        },
        {
            "review_text": "Love the game",
            "review_score": "1"
        },
        {
            "review_text": "do mind stuff and have the game ♥♥♥♥ up halfway through because i dont know",
            "review_score": "1"
        },
        {
            "review_text": "The art style and tutorial had me expecting this to be a ♥♥♥♥-easy children's game, but I was so happy to be proven wrong. Every level is different and refreshing, and each contains obstacles that need a degree of thinking on your part. The voice acting is excellent (including seasoned actors I recognized from invader zim and the powerpuff girls),and the storyline mish-mashes the whimsical with mature themes and characterizations.   There are only a few portions of this game where I felt generally frustrated but overall I am so glad I picked this up, one of the few games in recent memory I found myself rushing through",
            "review_score": "1"
        },
        {
            "review_text": "I'm recommending this game but with a caution:  I thought the story, characters and concepts of this game were fantastic, however I think it is let down by the gameplay. I personally found that each world took too long to get through, although this might not be as much of an issue if you don't try to locate all the items in each world the first time you arrive.  There were a few places where the controls were frustrating - for instance, at a certain point you climb to the top of a ladder and try to jump to the roof it is resting on but often 'hit' the edge of the roof and fall down again (this was clearly accidental and not supposed to be a challenging part of the game). This did not happen often though.",
            "review_score": "1"
        },
        {
            "review_text": "This game gets a 10/10 from me. This game is a huuuggge nostaligia trip for me, I remeber playing it on the xbox when I was younger, it's a good puzzle/adventure/freakshow game that will 'blow' your mind. (you will understand what I mean when you play it) I would highly recomending getting this game, and if it's on sale don't think twice about getting it.",
            "review_score": "1"
        },
        {
            "review_text": "I first rented this game for the PS2 at a Blockbuster in 2005, the title 'PSYCHONAUTS' brought my attention as well as the fresh art style on the box. Looking at the back it said, 'A psychic odyssey through the minds of misfits, monsters, and madmen.'  And below that, it spewed crazy gibberish about missing brains, bacon, mental landscapes, personal demons, ... and a mission to save the world as a Psychonaut.  Whatever this box was trying to tell me, I was already hooked on wanting to play this psychic adventure. I did not expect to meet so many colorful and funny characters or see so many inventive and strange worlds. I did not expect being a psychic meant having really cool powers to use and abuse whenever. But actually being a Psychonaut means something, and this game feels like only the tip of iceburg. So when you hear excitement about PSYCHONAUTS 2, it's not just the gameplay, but the world this game has created. It has so much room to grow in wanting to get to know the characters, and so many minds to explore to REALLY get to know the characters.   There was alot of love put into this game, and everytime I come back to it I find something new and I find new ways to interact with the world. You could easily miss alot just rushing through. But rushing is fine, all the more reason to get you replaying it again and again. Heck, that's why I bought it. Twice!  Also beware the cows! Not all milk is enriched!",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game, honestly. Did not really expect it but its just so damn fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Has always been a favorite of mine",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, an amazing game. The controls feel pretty dated, but the game is still a wonderful adventure, and i think it aged well as a whole.",
            "review_score": "1"
        },
        {
            "review_text": "I can't under-recommend this game. The humor is top-notch and it's one of the better collectathon 3D platformers in existence. I know it's old and the graphics may turn some folks off, but trust me: this game still holds up.",
            "review_score": "1"
        },
        {
            "review_text": "A classic 'must-have' game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is veh veh good",
            "review_score": "1"
        },
        {
            "review_text": "Despite being a little dated, this game still is one of the most imaginative and immersive platforming experiences to date.",
            "review_score": "1"
        },
        {
            "review_text": "One of a kind. Lovely story, ridiculously innovative designed levels and a moderate difficulty. A real masterpiece. And despite the graphics still worth a playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Completely underrated game. It's arguably outdated platformer, however the themes and gameplay are advanced for a game of its time. I played this a ton when I was a kid and the nostalgia came flowing back when I found it here on Steam a while back. There isn't a game more deserving of a remaster or sequel. I strongly recommend it, but to not take it too seriously as it was made like 15 years ago.",
            "review_score": "1"
        },
        {
            "review_text": "i swear to god if you dont purchase this game i will be upset with you  you dont even know",
            "review_score": "1"
        },
        {
            "review_text": "You probably already know.",
            "review_score": "1"
        },
        {
            "review_text": "I mean do I have to give you a reason? This game was great when it came out years ago and is still phenomenal. Like many of you I was an edgy 14-year-old when this game came out and was all 'That game looks like it's for babies.' Well I was dumb and should go back in time and slap myself in the face, because this game is great. Psychonauts is just what games are meant to be. Not some cookie cutter dreck you can plop out year after year. This game deserves a sequel, but it's also perfect without it. It's a game that comes along once every couple of decades that just defines what a game that was/is loved and cherished by its designer. A game that was meant to be different and special. A game that proves you don't need amazing graphics and a huge multiplayer system to be good. All you need is likable characters, tight controls and a good story.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game. Do it. Do it now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most creative one I've ever seen, and each character takes on a real, consistent personality.",
            "review_score": "1"
        },
        {
            "review_text": "Genius story, great humor. I feel like this game should be more known throughout the gaming community. Double Fine did a great job on this one.",
            "review_score": "1"
        },
        {
            "review_text": "Tim Schafer's masterpiece! A really creative, funny, and interesting take on the platform genre. You are not a gamer if have not played this game.",
            "review_score": "1"
        },
        {
            "review_text": "If I had to describe this game in one word? Weird. You literally go around collecting brains that people have been forced to sneeze out by an evil genius. Nonetheless, the weirdness makes it pretty interesting at times; each level takes the form of a different person's mind, so they're really varied and often quite random. All in all it's quite a fun, comical game, but a word of warning - it is easy to get stuck on some of the puzzles, and the platforming can be very frustrating at times.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't own this game, you should. There are no excuses.",
            "review_score": "1"
        },
        {
            "review_text": "This game should have sold more copies than it did. Very few games can match its originality and level design. The story is so creative and the game has some of the most imaginative levels I've ever played. For $10, you can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game that requires playing.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is two hearty scoops of the quirky and weird flavor that Tim Schafer's and Double Fine's games are known for. Some of the polish is a bit rough around the edges, but it more than outshines its peers with charming characters and an endearing world. There is a lot of great variety and humor in Psychonauts and it never failed to leave me with a smile on my face.",
            "review_score": "1"
        },
        {
            "review_text": "Platformer with excellent art style, very good characters and story and good gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious game",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw this game I didn't pick it up because of the art style, but I was mistaken. This game has such a unique concept and interesting story that I was a fool not to play it sooner. I picked it up on sale because a lot of reviews rave about this game, and now I know why. If you like more of story based games with interesting game play level designs, then pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Some of the best writing in any game, combined with varied, imaginative level design. This is a seriously great game.",
            "review_score": "1"
        },
        {
            "review_text": "Playthrough in 18 hours…yeah, that's not the longest game out there but on the other hand I spent way too much time rushing through the game and uncovering the next awesome level. It's just beautiful, even with its age, the levels are creative and colourful, the gameplay is fun (pretty much 3rd person 3d Jump &amp; run)  The controls are a bit tricky sometimes but manageable. Solid game, get it when it's cheap!",
            "review_score": "1"
        },
        {
            "review_text": "Everything you've heard about this game being an achievement in game development and a historical title is true. If you havent already bought it or thought about buying it, GO NOW. buy it on Playstation, or even here on PC on steam. Everyone young and old should play this game.   Psychonauts it a great story fit for any age. The Difficulty is such that it is not too hard to jump into and does not deter players, but enough to make a good time for veterns like myself. This is a classic in platforming and adventure Game right up there with the likes of Mario 64, Banjo Kazooie and Spyro. It is a great experience all around. A must have.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Classics. Gotta love em.",
            "review_score": "1"
        },
        {
            "review_text": "The venerable style that is Double Fine's, is one that sticks with you well after you're done playing. In Psychonauts, that style flourishes into something that inter-meshes you with your inner-child and awakens nostalgia of younger times. All of that coupled with Double Fine's trademark situational humor and you have something that entertains from start to finish. There are some hitches in the gameplay, but that is all easily glossed over by the fun experience provided by Psychonauts.",
            "review_score": "1"
        },
        {
            "review_text": "You're at a sumer camp for psychics. Each area is a level designed on the mental subsonscious of those around you. From perky hispanic disco camp counselor, to schizophrenic nephew of Napoleon Bonaparte! This game is full of imagination and wit. The difficulty ramps up to frustrating levels in some areas, but I strongly recommend this game to everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Good: The game still looks fantastic, even though it's 10 years old! Really good boss fights, that test the skills that you have acquired up to that point. Interesting and varied levels as you enter various minds.  Bad: The platforming isn't the best. Sometimes Raz won't jump where/how you want him to!  Recommended? Absolutely! Although the platforming could be irritating at times, it was never anything that was a deal breaker, and the boss fights and level design keeps the game interesting throughout. A fantastic game from Double Fine.   ",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game. Even though the puzzles can get a little frustrating and, if you (like me) don´t know what you´re doing, you´re going to have to backtrack, and that is really annoying when you get to a certain part without 'X' ability that is required to continue and the game doesn´t tell you anything at all. Oh, and this game is HARD. I reccomend playing with a gamepad, because it is really hard to aim in a keyboard. The humor is brilliant and kinda dark, which is awesome. I haven´t completed the game because I got stcuk and I simply got really frustrated at one point, but I feel I´ve played enough to give it my review. This game is a masterpiece and thank goodness more people are recognizing it. It deserves all the attention it gets. Tim Schafer is a genius. Just buy this underrated gem. It deserves your money and your time  8/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorites! This platformer is filled with more charm and humor than most games today. Maybe one day it will get the sequel it deserves.",
            "review_score": "1"
        },
        {
            "review_text": "Creme of the crop single player game. You will not be dissapointed by the story.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Wonderful concept with great characters.The game feels a lot like a good Platformer from the PS2 era. The controls aren't always the best, and can be a touch unrespsonsive, making certain areas of the game extremely frustrating (I'm looking at your flaming spiral &gt;:[ ). However, it's forgiveable because the rest of the game is extremely enjoyable and unique. The game itself encompasses alot of exploring and gathering items that you use to gain new abilities/make them stronger, but it isn't nessicary to gather every single one. The main driver in fact is learning about the characters in the game and about Raz. Though the game is presented in a cartoonish way it conveys it's stories to you in a very profound way. There's a lot of hype for this game, and most of it's pretty true. It's not the best game ever, but it's definitely a great one.",
            "review_score": "1"
        },
        {
            "review_text": "Great comedy and gameplay make this game a blast to play",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. Used to play it all the time on the Xbox. Playing through it again, and the humor is still very great. Definitely a must play for anyone wanting to laugh while they play.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game enough, it's one of the most unique games I have ever played. The story, characters, style, level design, and humor are all fantastic. You owe it to yourself to play this",
            "review_score": "1"
        },
        {
            "review_text": "Second only to Grim Fandango in all-time-best-video-game rankings. The soundtrack has leitmotif cues to a given character's behaviour, any violence is lampshaded, everything is earnest but everything is gently mocked. It's beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is a cult classic for a reason. It's one of those games you never get tired of playing, even if you're ready to ragequit when you get to the final level. Creative and very fun, plus interesting characters and plot, you'll continuely be starting the game over just to find all the little hidden scenes and videos! ",
            "review_score": "1"
        },
        {
            "review_text": "this game why not try play it big yes for this game every one shuld play this game all its orginal and you will not find eny other game like this ofc its old but its like play a megaman for first time or mario that game shuld be big but sadly its not BIG YES FOR THIS GAME TRY IT its wort it your money",
            "review_score": "1"
        },
        {
            "review_text": "This game not being heralded as an instant classic is kind of a shame. There not being a Saturday morning cartoon about the adventures of Boyd the Milkman is an absolute travesty.",
            "review_score": "1"
        },
        {
            "review_text": "Anything developed by Double Fine is bound to be extremely whacky and mighty creative. Exploring brains as a psychonaut feels like watching a hippie version of Matrix, for the first time, in a movie theater. Don't miss out on this one!   V e r d i c t : AWESOMESAUCE, which means nearly perfect",
            "review_score": "1"
        },
        {
            "review_text": "If you can get past the clunky camera and controls this is one of the funnier and original-er games you will play.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. A lot of replayability. One of the only games that I ever felt like finishing completely. I would love for a sequel. Hopefully it will come eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Charming dialogue, memorable level design/art direction, and overall FUN.",
            "review_score": "1"
        },
        {
            "review_text": "I had honestly forgotten a game could be this FUN! I miss this style of game. :P",
            "review_score": "1"
        },
        {
            "review_text": "for an xbox game. its just as good as any game out today",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this enough. This is one of the greatest platformers I've ever played, it deserves a try just as much as Super Mario 64 or Banjo Kazooie as far as gameplay goes. As for the plot, the game is written beautifully and it's amazing to look at.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an enjoyable game. It may, on first glance, look to be for children, but it's really for more mature players. There are plenty of story points that are completely optional and easy to miss, but are worth seeking out - very funny.",
            "review_score": "1"
        },
        {
            "review_text": "This game is truly strange. It has fantastic storytelling, and I can't really recall another game where the character is a psychic kid striving to become a famous psychic soldier, so it's definetly unique. A must buy for those of you who never played this on the old Xbox or PS2.",
            "review_score": "1"
        },
        {
            "review_text": "3rd person platformer with a story that matters",
            "review_score": "1"
        },
        {
            "review_text": "Even though this game is very, very old it still has the feel of any great platformer/beat 'em-up game out today. If you can try it out, do so.",
            "review_score": "1"
        },
        {
            "review_text": "Jump around in people's brains. Fight their nightmares and their brain-antibodies.",
            "review_score": "1"
        },
        {
            "review_text": "Old school game that's certainly worth revisiting.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone out there should of played Psychonauts. But all i got to say is that it is a Great Game that everypony should buy!",
            "review_score": "1"
        },
        {
            "review_text": "It's a classic.  It's witty humor, colorful characters, memoral voices, amazing story, It's one of a kind! Only issue is that it seems to lag, although my computer is powerful. but it's barley noticable! 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest milkman of All Time.",
            "review_score": "1"
        },
        {
            "review_text": "Bizzarely original, interesting characters, wonderful story, and possibly one of my favorite psychological single player adventure games that left fans wanting more due to the ending that teased for another installment. Please give this game a chance, because it will not only tell a story you won't forget, But leave you wanting more due to its ending! Solid 10/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "What a game! Played it to death once before, bought it again to do it all over again! Hilarious and awesome gameplay, would recommend to everybody!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! A complete romp of colourful settings and characters. Although the platforming can be a little frustrating at times (last levels paticularly) the artstyle and strong narative more than make up for it's faults. I can only reccomend it as a truely unique experience which will leave you wishing more games had this much flare.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my favorites of all time. It just blends together great writing, unique artwork, fantastic voice acting, creative worlds, and some great music to boot as well. I also feel it is one of the few non-Nintendo platformers that has been able to withstand the test of time, and for that I give my full recomendation. Also Tim Schaefer and al those lovely folks at Double Fine deserve all the money they got for making this game to this day, which I hope that they had at least made back four times what it cost for them to make back then.",
            "review_score": "1"
        },
        {
            "review_text": "For someone who is fairly new to gaming on PC, this is very good at letting you learn the keystrokes. Still cute and fun to play for those who are good at gaming too!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best adventure platformer I've played ever.",
            "review_score": "1"
        },
        {
            "review_text": "Warning: Not actually a game about astronauts with mental disorders",
            "review_score": "1"
        },
        {
            "review_text": "A game everyone must play. Period.",
            "review_score": "1"
        },
        {
            "review_text": "homoerotic overtones out the ♥♥♥ 'meat circus' am i right?",
            "review_score": "1"
        },
        {
            "review_text": "Whether at full-price for only $10, or on sale (as it is at the time of writing), Psychonauts is worth whatever money you spend on it. It's funny, it's challenging, and so charming that you'll want to take it out on a sexy date after playing. It's one of my all-time favorite games. Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "Game's a bit silly but quite fun anyway.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Oh, wow. so many things i can say about how amazing this game is. if you have a love for adventure, and a slightly twisted sense of humor, then this game cannot be beat :) in my top 10 games of all time list up there with the great games in its genre, zelda, beyond good and evil, okami...yeah its that kind of game. It combines a plethora of awesome game mechanics in a whimsical twisted projection of childish sense of adventure and adult themes that go WAAY over the kiddies heads.  a game for everyone...unless there is something wrong with you :D, and even then, if there is something wrong with you...play this anyway",
            "review_score": "1"
        },
        {
            "review_text": "The platforming's not as bad as you think it is, and it's actually improved with PC controls, but the game's not as fun or as good as you think it is.",
            "review_score": "1"
        },
        {
            "review_text": "...Still awesome.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite adventure game of all time. Must buy.",
            "review_score": "1"
        },
        {
            "review_text": "A good platformer but beware if you get motion sick from older games with faux-3D graphics. I can't play for more than ~30 minutes before feeling dizzy and like I'm gonna vomit.  It's fun though, the gameplay is good and the art style, characters, and story are all interesting and unique.",
            "review_score": "1"
        },
        {
            "review_text": "My most favorite platformer a must play classic!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely recommend this! Hopefully they will make a sequal.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome. Raz and Lily are great, the villain is fun and the concept of discovering and fighting mental illnesses is really thought provoking.",
            "review_score": "1"
        },
        {
            "review_text": "Tim Schafer.  Seriously, that should be all I need to say on the matter, I could add that it is showing it's age but that's hardly fair you don't mention the canvas when discussing The Mona Lisa do you?  a classic.",
            "review_score": "1"
        },
        {
            "review_text": "Such a creative storyline with so many good features of being a Psychonaut, this game is definitely worth my time on venturing in a summer camp, stumbling into other people's minds to see what secrets they really hold.",
            "review_score": "1"
        },
        {
            "review_text": "A unique platformer with fantastic writing, art direction, and characters. I wouldn't want to miss it.",
            "review_score": "1"
        },
        {
            "review_text": "An awesomely cool game with a quirky sense of humour and a cool cartoony style. Even has a level where you are a giant Godzilla-style creature to a Tokyo-like city populated by lungfish.",
            "review_score": "1"
        },
        {
            "review_text": "If you've never played this game you might be a bad person.",
            "review_score": "1"
        },
        {
            "review_text": "I'm pretty sure if you stood in a room wallpapered with Picasso paintings and popped LSD while a man pumped heroin into your femoral artery with a bicycle pump, you wouldn't see half the ♥♥♥♥ Tim Schaefer sees on a daily basis.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "Traversing the worlds of thoughts and dreams with psychic abilities, meeting wacky characters, this game has a unique artstyle and charm to it. The witty writing and lovable enviroments are well worth exploring. Psychic summer camp has never been so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best adventure game ever",
            "review_score": "1"
        },
        {
            "review_text": "Everyone must play this game, it's amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Tim Schaffer at his greatest. While it plays best with a fine-tuned gamepad, even with a keyboard and mouse combo the game plays fine, and with some of the most unforgettable characters and art design of any game released in the last ten years, you can't go wrong with Psychnauts.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed the game when i got it through the Fine Brother's bundle, have plenty of nice and funny gameplay as well as it's own kind of style; both art and written wise. It have plenty of secrets that will help for those that want an deep and fun experience of one of a kind game. So if you have the money and looking for a fun semi-platform/action/adventure game, so have you find one of the best (in my opinion atleast).",
            "review_score": "1"
        },
        {
            "review_text": "The difference between an evil wizard trying to kill a princess and a kid wearing red goggles.",
            "review_score": "1"
        },
        {
            "review_text": "One of the finest games on Steam, in my opinion. The game was lots of fun, it had some witty dialogue and ridiculous things happening. Definitely recommend this to anyone looking for an unique and funny experience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most creative and fun games I have ever played, with hilarious writing and memorable characters. Tim Schafer's finest!",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun things going on here. This is Double Fine doing right, they now appeal to many age groups, the humor is brilliant, and the gameplay is engaging. The graphics have not aged well, even in a cartoon sense, but it really captures a brilliant, but overly elementary idea of phychology mixed with brilliant humor. Another must play for the thinking gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Even 7 years after release, this game is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a lot of fun. The XBOX360 controller I was using was a little glitchy, or so I thought. Make sure the batteries in your controller are good and you shouldn't have a problem.  Great story and a lot of fun gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Want to play one of the best games ever made, only surpassed by games like Monkey Island or Sam and Max hit the road? But with the same awesome writing style and originality, set in mindbending acrobatic platforming environments? Then go get Psychonauts! I promise, you will not regret it. Well, at least not until the final stage perhaps. But don't worry, it's definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a wonderful game, but unplayable without a controller.",
            "review_score": "1"
        },
        {
            "review_text": "Cool platform game with some really unique levels and game-play. The graphics might look out-dated but the design of the characters and environment is still nice. And it's really funny!",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece, this game is criminally underplayed. This really should not be missed.",
            "review_score": "1"
        },
        {
            "review_text": "A game with an imaginative and interesting story. Genuinely funny unlike most games try hard to be. Buy this now.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games it is amazing but i suggest you use a controller with this game. The mouse controls are really hard to get use to. Overall GO BUY THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game where you play as Razputin as he first does trining in the minds of his teachers and then later starts fixing the minds of some twisted people. It has a great story that gets a little dark in the second half and a unique art style that reminds me a little of Invader Zim. This is one that any video gamer shouldnt pass up.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, ridiculous, hilarious fun. What it may occasionally lack in level and boss design is more than made up for in creativity and incredibly funny dialogue. Fans of classic adventure games and platformers are likely to enjoy it. Oh, and by the way, this is one of two games Yahtzee has admitted to thoroughly enjoying on Zero Punctuation. To put this in perspective, the other is Portal. Really, this is an underappreciated work of art.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is one of the best games I have ever played, and it's definitely the most original one.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is one of my favorite games of all time. That being said, it isn't perfect- especially the PC version (controls are a little rough), but what it lacks in the control department, it more than makes up for in the story, level design, characters, and voice-acting.  Razputin Aquato is an interesting and relatable protagonist. He's a 11-12 year old psychic that's run away from his parents' circus caravan to hone his craft at Whispering Rock Summer Camp. The acrobatic skills he uses to traverse the world are animated well and accounted for perfectly by his backstory. That amount of thought and attention to detail is commendable.    Levels are creative, colorful, and completely absorbing. My favorite (and probably the favorite of many) is The Milkman Conspiracy. Waterloo World is also great and a testament to the extremely creative and varied level design of this title.   The best parts of this game truly are the details. Every NPC can be talked to actively or listened to passively and their dialog brings depth and complexity to an already rich and hilarious world.  Even if this game has all of my love, there are still some hard truths that must be told-  -This game is a treasure-hunt. Things have to be collected to gain experience and powers. Sometimes it's a straight up grind. I'm a fan of grinding. I find it cathartic. If you don't, you probably don't want to play Psychonauts. -This game has a learning wall. Not a curve. A wall. You'll play nearly the entire game and probably not have any problems with the platforming until the very last level where traversing the world becomes really, really frustrating. -The PC version is a bit buggy and its controls aren't terribly intuitive. I suggest using an Xbox controller.   All of that aside- if you're looking for a something a little off-beat and witty, with a fantastic story and characters, Psychonauts won't disappoint. ",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is one of those hidden gems of a game in early 2005 that not a lot of people know about and it sad because it's a beautifully made game with great story, funny voice acting and jokes and really good gameplay. I loved every moment of it. My only problem would be the controls and camera. The game was made for Xbox so using the keyboard can have it's problems but it's so small and rare that it didn't effect my liking. There is so much hidden story and unlockables in the game that it makes you want to do everything to just know what's up. Trust me, you need to have this game. You can wait for it to go on sell but really, this game is worth more then 30$",
            "review_score": "1"
        },
        {
            "review_text": "Great story, graphics are a bit outdated, fun game to play through.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most entertaining games ever. You explore people's minds and explore ♥♥♥♥♥♥♥♥ as ♥♥♥♥ areas that make literally no sense in an epic journey from a kid that runs away from home to join the circus of psychics. Absolutely a great game from back before when games didn't suck.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone said, You need to play psychonauts.......so i bought it on sale...and holy ♥♥♥♥....they were right....most memerable platformer on pc ive ever played. mind ♥♥♥♥ingly good.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic characterization. It's a little old, but the cartooniness of the graphics mask its age well. Some of the levels are too jumping frustration for my liking, but it's all worth it for the godzilla level. Srsly. Brilliantly creative.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a certain charm which not everyone will understand. It has straightforward gameplay, incredibly funny writing, and levels that are deeper than they may first appear.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game off and on since its release on Xbox in 2005. One of my top three games of all time. Tons of replay value. Its great graphics and stable game play make this already awesome game over the top. Super fun for kids with a humor that teens and adults will enjoy. One of the most unique and entertaining story lines you will come across. It strikes a great balance between creative and moderately-difficult gameplay without resorting to an annoying joystick olympics. The game is worth every penny, you will NOT be disappointed with Psychonauts!",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is one of the best games I've ever played! Imagine if Tim Burton and Edgar Wright had a baby that was a video game. This would be it. It has a very quirky sense of humor, and great platforming. All the characters are memorable, almost every line is quotable, the game is hilarious! It is extremely underrqated, and I can't reccomend it enough! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A very funny platformer that drags a bit in the middle but is worth the playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, quirky visuals and fun gameplay. Definitely one of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "It's good, buy it",
            "review_score": "1"
        },
        {
            "review_text": "What? You haven't played this game yet?  ... Me and your mother are very disappointed in you. You better go 'n buy this one ASAP.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and original, if a little dated 3D platformer. This one was sadly underappreciated and didn't sell well on release but has since become a cult favourite. The humour is great, and the gameplay is fun (and it's one of the few games I have played through to 100%).  Recommended for all ages, and the quirky characters and interesting level design should appeal to young and old.",
            "review_score": "1"
        },
        {
            "review_text": "Quirky, original and incredibly well written. Psychonauts is the most underrated game I've ever played and frankly Tim Schafer is a genious.",
            "review_score": "1"
        },
        {
            "review_text": "This was a greatly underrated game when it was released selling under 100,00 units in the first year. It's a MUST play.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game and having been playing it a little for the past couple of days I have to say it has aged incredibly well.",
            "review_score": "1"
        },
        {
            "review_text": "Quirky, unusual and fun, this original X-Box title is now available for all of us whose consoles are dead or dying. Buy it while you can, and prepare to rock some minds with your mental prowess.",
            "review_score": "1"
        },
        {
            "review_text": "After breaking into a government camp, Raz funds himself on the way to becoming a full-fledged Psychonaut. In this classic 3D platformer, you jump, punch and explore your way through the minds of fellow inhabitants on the remote installation. Wonderfully unique art style and a goofy-yet-involving story lead our little hero on an adventure enjoyable by anyone with a functioning brain.",
            "review_score": "1"
        },
        {
            "review_text": "My name is... 'starts with a Q'... Rasputin! Thank you Tim Schafer and Double Fine for bringing the finest of LucasArts and this game. Psychonauts is a cult classic. An action platformer. But the charm is undeniable. The premise is very interesting too, a psychic summer camp! Play with controller of course and tolerate the nusances of old 3D platformers such as fighting camera controls to experience a truly wonderful story and setting.",
            "review_score": "1"
        },
        {
            "review_text": "Funny and crazy are the words to describe this nice piece of work from Tim Schafer.",
            "review_score": "1"
        },
        {
            "review_text": "Want a game that has the most fantastic and original storyline in the video game industry? Of course you do. This is Psychonauts. One of the most underrated video games I've ever played. If you don't know what this game is you should chop off your fingers and get off of the computer right now.  ",
            "review_score": "1"
        },
        {
            "review_text": "Aside from a few poorly explained controls this was a really fun and original game. The plot is strange, the dialogue is humorous, and the levels each offer something new and different from one another. Unfortunately, the cutscenes are low res, but for a game from 2005 that's to be expected.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I personally love this game. It has a great story, is clever, and in its cleverness hilarious. The game does not pressure you to stay on course with the plot, so you can wander around collecting items and buying things which I like in a game. The camera gets tedious sometimes, but isn't that true for most games? 8/10 would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Highly under appreciated",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is, without exaggeration, a completely unique videogaming experience. I may not be the most studied or well-traveled gamer, but I defy anyone to name me a game with a psychokinetic bear, or a conspiracy regarding milkmen, or a littany of other great moments from Psychonauts that are too numerous or spoiling to list here. It's possible to play through the entire game and miss so many small moments that really reward the most dilligent of explorers.  The PC version of this game is not without its flaws. The port is really tough on the fingers, and the game takes an incredible hike in difficulty in its last stage, going from a game of mild trial and error to a terrifying frustration simulator that might force those with anger issues to spend a little bit more replacing broken mice than they might be anticipating. Whoever designed the last level of this game should be spanked. Whoever decided the first third of it should be an escort mission doubly so.  But, in spite of all that, this is a hilarious, wonderful platforming experience with a unique cast of characters that I simply haven't seen replicated anywhere else. Do yourself a favor and get this game. Pure gold.",
            "review_score": "1"
        },
        {
            "review_text": "In terms of gameplay mechanics it doesn't do anything too original, but where the game really stands far above other platformers is its story. The game's writing, pacing, and characterization are of the highest quality... so good in fact that you will most likely still enjoy playing this even if you are not into platformers.",
            "review_score": "1"
        },
        {
            "review_text": "Look, this is my favourite game of all time, and one of the greatest games in the history of entertainment. It's creative, well-paced, controls well, memorable, and most of all funny. It's really funny. Like, the funniest game ever made. You will not forget the characters, the adventures, the brains... look. This is Tim Schaefer's greatest work to date. He is a funny man. Doublefine made this. They make good games. This is... this is... okay. I lack the words. Buy this game. I have bought it several times since Doublefine regained total ownership. You have to play this game. Do it. Now.",
            "review_score": "1"
        },
        {
            "review_text": "What can be said about Psychonauts that hasnt already been said? Its amazing! Where is Psychonauts 2? I want more Psychonauts! All of those things are completely true. Admittedly i was hesitant at first because when i look at a game and i see a particular animation style im not a fan of i tend to cast the game aside. Once i started to play however all of that fell to the wayside. The game is very clever from the collectible figments of the imagination to the emotional baggage you sort out nothing feels out of place and everything works. The humor in the game is very spot on and after i was done playing it left me wanting more. The only problem with this game that i can see is the end. At the end of the game you hit a point of no return where you cant go back the the real world. You can still re-enter the minds of others through the world hub but if you are trying to collect everything to boost your level you need to make sure you have everything done before hand or make a seperate save. i found this out a bit late but i was lucky enough to have had everything done. All in all it was a fantastic experience and i recommend this game to everyone. PS. I hope they make a sequel to this and bring Grim fandango to steam.",
            "review_score": "1"
        },
        {
            "review_text": "'the most excellent game psychonauts has stopped working'  expect to see that a lot if you have a nvidea card.",
            "review_score": "1"
        },
        {
            "review_text": "I played this as a kid when it came out and I very much enjoyed it. Now that I've gone back and replayed it, I can say that the story interesting in a way that the characters fell like real people and, although the story seems lighthearted on the surface, there are some dark things that everyone has lock away in their minds.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platform games for PC. Great characters and great comedy story with very dark twists.",
            "review_score": "1"
        },
        {
            "review_text": "Does not have enough bears. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "An unexpected pleasure and joy to play. Doesn't take itself too seriously and is still able to provide a colorful story with memorable characters!",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts takes the standard platform-game model and slaps it in the face with a lungfish. With several unique characters, crazy worlds, and the mind-boggling story, Psychonauts does everything right.  You play as Raz, a psychic who runs away from the circus and his psychic-hating dad to Whispering Rock Psychic Summer Camp, a millitary funded camp for training psychic kids into becoming psychic soldiers, also known as Psychonauts (With their parent's permission, of course). Things start rough as you are quickly discovered sneaking into the camp and have your dad called to pick you up, although some counselors are impressed by you, and allow you to participate in class. Do you have what it takes to earn all the merit badges and become a fully fledged Psychonaut, and discover the dark mystery behind Whispering Rock, all before your dad comes?  Along the way, you meet many unique characters with their own varying backstories and personalities, as well as their experience with their psychic abilities. You meet a head-exploder, bear wrestler, cheerlearder, clairvoyent pervert, and many more as you wander the grounds of Whispering Rock. As you progress through the day, you see the changes and interactions between the characters, leading to unexpected alliences, suicide attempts, and love.  But what really sets this game apart from the rest are the levels. The game revolves around exploring the minds of several individuals (literally), with varying goals as to what to accomplish, whether it's to learn a new ability, find deeper meaning, or curing a mentally ill individual. Each level is designed based off the characters' personalities, with the calm, powerful counselors having organized, peaceful minds, and the crazy having dangerous, physics defying minds. As well, the collectables within each mind vary depending on the character. Figments of imagination are designed to fit in with the level design, and vaults give insight to each character's backstory and trageties that shaped them. This variation really gives Psychonauts a fresh feel every level and sets it apart from other platforming games.  Overall, with this game's amazing characters, levels, and story, as well as the occasional puzzle that keeps the game challenging, I would rate this game a 9/10. The only improvement being a Psychonauts 2 to wrap up the cliffhanger (Come on Double Fine, let's fund this game)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true jem  Pros:  -kick ♥♥♥ overworld with lots in it -neat story -cool game play and mechanics -short and sweet got around 15 hours with no dull moments Cons: -Controler support was a bit buggerd for me  ",
            "review_score": "1"
        },
        {
            "review_text": "Other than the cinematics showing how old the game truly is, it is a pleasant moment of nostalgia to hop back into Whispering Rock Summer Camp for Psychics along with Raz on his adventures. The game is easy to fall in to, and should you ever get lost, there are more than enough hints to help you back on the path. With the colorful characters and their own lines to spice up your stay, you too will end up enjoying your stay at Whispering Rock. Just be careful you don't lose your brain!",
            "review_score": "1"
        },
        {
            "review_text": "So, I've played through this game from start to finish five times already. Gotten all the achievements. I have over 600 games in my library(so far). But still, this is the game I feel like playing. Again. And again.",
            "review_score": "1"
        },
        {
            "review_text": "A really great game. The characters were funny and memorable, the wacky story was very entertaining to play through, and the gameplay was fun as hell. There's also a TON of hidden things, and some of the achievements on steam encourage you to go and find them (which is definitely worthwhile). Psychonauts for me makes a nice break from all the 'serious' games of today, it really makes you feel good while you play it. Being into platformers, this was a real treat for me, and if you're into platformers too, you should definitely give Psychonauts a try.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game full of quirkiness and oddity. My only complaint is that at times the camera angles can make the game much more unintentionally difficult, particularly in battles (I'm looking at you, Lungfish). But overall, very fun and worthwhile game.",
            "review_score": "1"
        },
        {
            "review_text": "I can go inside a giant lungfish's mind and act like a Kiju monster. Than I can play a board game with a fake Napoleon Bonaparte 10/10 only good game Double Fine will ever make.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with a lot of intresting concepts behind it. Highly recommend if only for one playthrough of the game but worth replaying several times.",
            "review_score": "1"
        },
        {
            "review_text": "Warning for Mac users: This game can be incredibly unstable. I am running on a 2012 Mac Mini, which should be more than capable of playing a 10-year-old game, but I have encountered framerate issues and frequent crashing. Twice now I have been forced to reboot my computer after particularly bad crashes. While I enjoyed the game itself, I find it impossible to continue playing with these issues, so I cannot recommend it to other Mac users.",
            "review_score": "-1"
        },
        {
            "review_text": "A gem! A real gem, you can wear it around your neck...",
            "review_score": "1"
        },
        {
            "review_text": "Extremely imaginative action platformer. Very heavy on the platforming. The environments are so colorful and creative. They need to make more games like this. Psychonauts is a true gem from a neglected genre. Quite possibly the best platformer of its generation.",
            "review_score": "1"
        },
        {
            "review_text": "20 hours of solid humor and gameplay. Fun story, really good characters. Imaginative settings and style. Yea, way to go Doublefine, this was a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man what can I say about Psychonauts that hasn't already been said. This game has eaten up more hours in my life than I would really care to mention. It's one of those games that you could beat and then instantly pick back up and play again. If you haven't already played this Title It is definitely worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Of course I recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "i dont know where to start, really, this is one of the best games i have ever played, although pretty dated.",
            "review_score": "1"
        },
        {
            "review_text": "A hallmark in Double Fine's world building and character design. Before Brutal Legend's medieval fantasy rock opera, before Trenched's mecha man's man WWI theater of war, before Costume Quest's boundless children's perspective of imagination, there was Psychonaut's summer camp for psychics and all the quirky mental worlds from a calvalcade of likable characters.  If anything, buy it for the Milkman Conspiracy.",
            "review_score": "1"
        },
        {
            "review_text": "The art style of this game is pretty good, and each level offers a lot of variety. The camera can be an issue at certin points, but not game ruining. If your a completionist, your going to want to collect all the items before you enter the final level. You won't be able to go back and collect everything you missed when you finish the game (Without reloding a previous save). Overall, awesome game.   Also, if your running the game on windows 7 or higher, it's going to crash. Look up a fourm post or something to get it work, that's what I had to do.",
            "review_score": "1"
        },
        {
            "review_text": "Even now in 2014 I enjoy this game just as much as I did the first time I played it on the original xbox. Quriky characters, over the top storyline that edges up to the entertaining side of ridiculous, and classic gameplay that has fallen out of vogue in recent years because too many games tried to cram into that genre. Every few years I dust this game off and give it another run through while wishing the sequel will finally get made. Well, at least an HD remake of Grim Fandango is coming.  I'd like to address a few of the complaints I keep seeing though in case anyone is contemplating this game:  -It's unstable- I'm sorry about your computer and your inability to use a search engine, but that's hardly the game's fault. Keep in mind, this is an older game so it is recommended to play it in compatibility mode just like every other older game. I had exactly 1 crash, when a cutscene loaded, and looked up how to fix it on google instead of ranting about it being worthless. Runs just fine.  -The controls are bad- This comes most often from people trying to play using a keyboard and mouse. The game was developed for the original xbox, what do you expect? If you have any experience with this kind of game, I can't understand why you'd even want to play it with anything other than a gamepad. Although, if you are using an xbox 360 controller to play, I recommend using the PsychoPad mod to change the on screen key icons back into gamepad buttons. This was ported a while back, so the whole thing of detecting which control scheme you were using and adjusting icons accordingly hadn't caught on yet. It's not required, but it makes the experience a little more seamless.  -The story is childish- The characters are children, at a summer camp. What did you expect? Shakespeare? Of course the children are going to have a childish understanding of events and react to them in a childish manner. They're children!  -The circus is impossible- Not really. Difficult? Yes. Quite a sharp difficulty curve from the rest of the game? Yes. Impossible? No.  -It's ugly- Not a fan of art, eh? Sorry, not every game is Generic Greyish Brown Shooter With Lens Flare 7.  -Random camera complaints that differ between people- Well the fact that no one can agree on what these camera issues are makes me think this is a highly personal thing rather than an issue with the game. In later parts there are some weird camera things done for effect, such as seeing yourself from the point of view of the thing attacking you, and that can be a little disorienting for a few moments but that's not even remotely what people claim. It's a bit like someone who hates turkey ranting about the quality of a traditional thanksgiving dinner. Of course they're not going to like it, even if it's the best turkey you've ever eaten. The only other thing I can think of is maybe this is a quirk of trying to use a keyboard/mouse to play. This was a game designed for the xbox, so just use a gamepad and you'll be fine.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "The characters have personalities, the levels are long and great, there are several adventures, but ultimately the principal scénario, comeback all time in the adventure, the staging is better than a movie, the scenery is fantastic, the missions are all originals, the powers are vast, so the gameplay is large, the characters are hanging, the graphics are gorgeous for a 2005 game still is beautiful, the boss requierd combat strategies to defeat them, the scenario goes, is very well written, funny, intélligent, each character have a story, a difficult past, everything is original, today's games do not hold a pixel to the original of this game, best game than zelda,and I am one of the biggest fan of zelda, 10/10, best game of my life.  ps: sorry for my english, i'm romand(french) i try to write with google translate.",
            "review_score": "1"
        },
        {
            "review_text": "Childhood &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platform games for PC. Great characters and great comedy story with very dark twists.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is one of the rare gems of the sixth generation of video games to make you see gaming in a different light. Could not recommend more. Amazing game from an amazing developer. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game showed me other people's minds while breaking mine at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "1. Went to summer camp 2. Got sucked inside a dude's mind 3. Got told that his bowels move faster than i do 4. I was sprinting 5 jeez, how much taco bell yu eet son? 6. Went LOLing all over da plaec  7. Watched someone get eaten by a giant lungfish  8. became godzilla 9. found a bumbling conspiracy theorist 10. was required to spend the in game currency to buy a thingy 11. Didn't  8/8 would write a confusinlgy long review again",
            "review_score": "1"
        },
        {
            "review_text": "The best Timothy Schafer's game, definitely. Maybe It's the Hair, you know...",
            "review_score": "1"
        },
        {
            "review_text": "Completed the game with 100% achievements.  I love this game. I first played it when the game came out more than 10 years ago. Now I can tell you I still think it is a good game, even if the graphics may be outdated.  Intriguing storyline, witty dialogue (with a surprising amount of adult references that would go right over a 10-year old's mind, which happens to be the age of the protagonist in the game), a diverse world made of a vibrant and colourful design, and a amazing veriaty of level design that continually challenges the player to take a different approach to the gameplay.  And plenty of stuff to collect and discover if you are a achievement hunter like me.  Not too difficult, but still a satisfying experience. Also, you can expect a long-awaited sequel soon from the same developers, if isn't already out when you are reading this.  Oh, I played the game on Windows 10. The game initially had issues with crashing, especially with mutitasking (alt-tab operations), but after setting the compatibility mode to Windows XP, I've had no crashes.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say that has not been said? It's a fantastic 3D action platformer, probably one of the best. Really great writing and voice acting and fun level design. A most play if you're into the genre or if you want to get into it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played. Part platformer, part psychotropic experience. The characters are psychotic, the environments are varied and colorful, the gameplay is fun, and you never know what's coming up next. Save the summer camp, save the world!",
            "review_score": "1"
        },
        {
            "review_text": "Best game based on psychic summer camps",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is a game with an excellent plot, an original idea and great humor.  The humor presented is in my opinion one of the best to ever have been presented in a game to date; simply because it presents serious topics in a mudane manner, making them feel quite absurd. I liked the plot because it had a certain development throughout the story, the characters although quirky are memorable and the same can be said about the gameplay.  I initially found the visuals and environments somewhat off-puting but grew quite fond of them as the game progressed. The main problem that kept bugging me however are the game controls, they work well to maneuver but not so much for combat.",
            "review_score": "1"
        },
        {
            "review_text": "As a person who grew up on 3D Platformers like Super Mario 64 and Banjo-Kazooie, I had to look into this game, especially when I saw it was on sale and it did not disappoint. I loved the humor, the music was enjoyable to listen to and the fact that every characters had so many different thing to say made me just want to wander around and just listen to everyone.  The only issue I had with this game is that It would freeze or take forever to load when trying to enter one of the last stages in the game. Hopefully that can be fixed or it's just an issue for playing this game on a Windows 10 operating system.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! Crative! Funny! and Strange!  And i have yet to play threw it all!",
            "review_score": "1"
        },
        {
            "review_text": "PsychoNauts is the first creation of Tim Schafer's design team, Double Fine. It is a fun, fresh, cartoony, comical and VERY stylized masterpiece of a platformer game. Every 'zone' reached through the fleshy portals of mortal minds is unique in theme and in gameplay, and its variety of backing characters keep the pace of the storyline flowing outside of progressing through the main storyline. An underrated masterpiece of its time: Highly quotable, incredibly unique, and worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is a charming, funny and well-designed game with an wide range of gameplay and tone that precludes any sense of boredom - but not frustration, as I occasionally found myself frustrated with the camera in platforming puzzles, or just at a loss for which of a myriad of tools was the one intended for a given job. On the whole, Psychonauts comes together very well, and displays obvious quality and competence, even if the gameplay genre isn't exactly my favourite.",
            "review_score": "1"
        },
        {
            "review_text": "A unique platformer with fantastic writing, art direction, and characters. I wouldn't want to miss it.",
            "review_score": "1"
        },
        {
            "review_text": "Good: The game still looks fantastic, even though it's 10 years old! Really good boss fights, that test the skills that you have acquired up to that point. Interesting and varied levels as you enter various minds.  Bad: The platforming isn't the best. Sometimes Raz won't jump where/how you want him to!  Recommended? Absolutely! Although the platforming could be irritating at times, it was never anything that was a deal breaker, and the boss fights and level design keeps the game interesting throughout. A fantastic game from Double Fine.   ",
            "review_score": "1"
        },
        {
            "review_text": "Had this game in my library for years... turns out, it's actually REALLY good! You should get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is such a good game, that Zero Punctuation!, the reviewer with The Escapist decided on a punishment for people who haven't played this great game. It had something to do with putting a pen or pencil between one's fingers and squeezing. I've been shown many of those reviews which were released by him, and this was a game he 'liked' a lot. Plus, I highly recommend it from my own experience to any who haven't played it. Lots of things to find, and minds to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. A lot of replayability. One of the only games that I ever felt like finishing completely. I would love for a sequel. Hopefully it will come eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing even for 2015 standards. The settings and story makes the cake.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute classic. Truely a hidden gem, buried under all those triple A rate games of the past. Worth the time, and money.",
            "review_score": "1"
        },
        {
            "review_text": "Rhubarb is a controversial pie flavor.   Seriously though. If you are a fan of the late 90's/ early 2000's action platformers (Jak and Daxter, Beyond Good and Evil, etc.) You will LOVE this game. A truly underrated gem.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant! One of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "You need this in your life.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorites from my childhood, it was great to play it agian. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing every minute ",
            "review_score": "1"
        },
        {
            "review_text": "This is my all time favourite game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must play for anyone who enjoys the action/adventure genre of gaming. Psychonauts is clever, funny, unique, and just plain fun to play. Playing as Raz as he dives into other people's minds to unlock their memories and fight their demons has made for one of the most thrilling and interesting gaming experiences I have ever had. This is enhanced by the brilliant level design that shows that everyone's mind is different and reflects the traumatic events that led to who they are. There are so many good aspects to this game that I would encourage anyone to give it a try.  I have quickly grown to love Psychonauts and I can easily say that this game has earned its place as one of my favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "I never got to play this game when it originally came out but I heard about how awesome it was. It was super fun to play definitely would recommend it. I had a lot of fun, even though I was pulling my hair out trying to find the last figments in some areas...",
            "review_score": "1"
        },
        {
            "review_text": "This has been my favorite game for 10 years now. I picked it up a long time ago just on word of mouth, and have been hooked ever since. The characters and world are full of such life I don't find myself bored playing it over and over again after many years. For me, the humor and quirkiness have never gotten old, and for $10, you're doing yourself a disservice to not give it one play through.",
            "review_score": "1"
        },
        {
            "review_text": "Best game every made by far!",
            "review_score": "1"
        },
        {
            "review_text": "I've started this game about four times in the past, but lacked the co-ordination to get very far. I've just got myself a control pad for PC and I'm finding it much more playable, though still challenging. This is a platform+ game with added sense of humour and a great plot. I still haven't finished it, but I've had over ten hours of gameplay so far and I'm only stopping now because I should probably go to bed. There's a couple of gameplay issues (I'd say that's at least partly the game but also partly my incompetence) but I can't think of any 3D platform games where that isn't the case. I'll leave other people to note what these issues might be, otherwise you might only notice them because I've mentioned them.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, but keep in mind that it came out in the early 2000's so take somethings with a grain of salt.",
            "review_score": "1"
        },
        {
            "review_text": "My milk is delicious...",
            "review_score": "1"
        },
        {
            "review_text": "The Excellent Game",
            "review_score": "1"
        },
        {
            "review_text": "Six years old, but still a damn good game",
            "review_score": "1"
        },
        {
            "review_text": "This game was tons of fun! I loved the level designs and the humor of the game. I am glad that I played this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game really relies on it's writing and characters for it's enjoyment. If you don't find that aspect particularly engrossing then what you have is a fairly bland platformer with a few interesting mechanics but not enough to really keep the game engaging.",
            "review_score": "-1"
        },
        {
            "review_text": "Good: The game still looks fantastic, even though it's 10 years old! Really good boss fights, that test the skills that you have acquired up to that point. Interesting and varied levels as you enter various minds.  Bad: The platforming isn't the best. Sometimes Raz won't jump where/how you want him to!  Recommended? Absolutely! Although the platforming could be irritating at times, it was never anything that was a deal breaker, and the boss fights and level design keeps the game interesting throughout. A fantastic game from Double Fine.   ",
            "review_score": "1"
        },
        {
            "review_text": "You'd be psycho to naut play it. I KNOW IM SO FUNNY",
            "review_score": "1"
        },
        {
            "review_text": "This is Tim Schafer and Double Fine at their very best. Ambitious, both from a thematic and gameplay perspective, and incredibly witty and entertaining. I have played a lot of videogames in my time, and now work for a gaming company, and this game is definitely in my top 5 list. This is also the one of only a handful of games I can remember playing through twice, and I enjoyed the second runthrough just as much. Absolutely love it to bits.  That being said, there is some wonkiness here and there, mostly with the platforming and controls, but the amount of love and fun that is packed into it makes up for that tenfold. This game also has some of the most imaginitive level- and production design I have ever seen in a game. If it is not already apparent then I will say that you absolutely must play this game. You simply can't regret it.  P.S. The time on record is only for the second playthrough, as I owned the game originally before Steam was a thing.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant production by DoubleFine! Who doesn't love this game? NOBODY! Because it's great! 9.6/10",
            "review_score": "1"
        },
        {
            "review_text": "Had this game in my library for years... turns out, it's actually REALLY good! You should get this game.",
            "review_score": "1"
        },
        {
            "review_text": "if mario 64 was better it wouldn't beat this",
            "review_score": "1"
        },
        {
            "review_text": "Beware the cows! Not all milk is enriched! ",
            "review_score": "1"
        },
        {
            "review_text": "Innovative, quirky and highly-memorable/quotable.",
            "review_score": "1"
        },
        {
            "review_text": "I could go on and on about Psychonauts. Great story, memorable characters, unique visual style, inventive platforming and hilarious writing. This cult classic (Hint: It's made by Tim Schaffer of Grim Fandango and Brutal Legend) is highly recommended and deserves a purchase.  9.6/10",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. Has an interesting story with some very interesting characters to interact with. There are a couple of levels that feel tedious, but everything can be done with a smile on your face in teh end.",
            "review_score": "1"
        },
        {
            "review_text": "Where do I begin... To start off I must say, this game is just.. Fantastic! It's an old school platforms with loads of collectibles, tons of Easter eggs, and an amazing sense of crude humor. I vowed to myself not to wrote a review of this game until I completed it 100% and got every achievement, and as frustrating as that is in a lot of games, I found myself WANTING to continue to do so with this game.   You play the game as a boy named Razputin, a 10 year old boy with an affinity for psychic powers. You go to a summer camp where the staff teach the children how to harness and perfect their psychic abilities. I won't go too into detail about the plot, but basically some really crazy stuff starts going down and Raz gets to the bottom of it. The goal Raz has in mind is to become a Psychonaut, a psychic soldier.   The game play is so much fun, the story is great, the voice acting is awesome, and for a game that came out over 10 years ago, the graphics are just fantastic. The cutscenes are a little dated but otherwise, they're still fantastic and hold up very well. This game is one of the greatest platforms of all time, and anybody who likes platforming, adventuring, or both, this game is a must have. It's worth the $10 but it often goes on sale for $5 and sometimes even $0.99. It's worth every penny and more.  10/10 will play again and again.",
            "review_score": "1"
        },
        {
            "review_text": "best platformer on steam 10/10",
            "review_score": "1"
        },
        {
            "review_text": "When I first heard of this game Psychonauts, I didn't really now what to think of it. It was a game where you control a boy who uses his mind to do things and that's all I really knew about it and that was back in 2014. Now lets jump to the Winter sale of 2015 when everything is up for grabs. I had just got some money and I thought I would buy some of the games that where for sale when I remembered some games I wanted to get a few years ago. After about five minutes of looking around the store I find the section for items on sale and being me I looked through it (I really am a big cheapskate...aren't I ?) And on the very top of the first page I find this game. Now being me looking to get some games for cheap, I decided to buy it (Good Decision if I do say so myself) What I didn't realize is that I had found a game where the jokes where intuitive, the story was compelling and where every character was well thought of and went along well with the story and while yes, there was parts that were a bit cliché, that can be expected in most any game. Though the game is starting to show its age it is still an enjoyable experience and will have you enjoy it till the end.",
            "review_score": "1"
        },
        {
            "review_text": "This game has more personality, more humor, more intruiging gameplay elements, and better level/art design than most of anything you'll ever play, watch, read, or listen to. There are some frustrating platforming elements and camera angles, but it's easily excused by how ♥♥♥♥ing great everything else it.",
            "review_score": "1"
        },
        {
            "review_text": "Normally, PS2-Style Platforming makes me want to stab two forks in my eyes.  Psychonauts only made me want to use one.",
            "review_score": "1"
        },
        {
            "review_text": "Psychic Kid Name Rasputin shoot the monster with his Psychic Blast, Get Em Rassy boy!",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts 2/Rhombus of Ruin hype :D",
            "review_score": "1"
        },
        {
            "review_text": "PS2 classic, surprisingly well optimised for PC. Has aged well, still holds up today. Controls handle well, keys are rebindable, you even get some graphic options. Recomended for people who like platformers like Rayman 2, Ratchet &amp; Clank and Jak &amp; Daxter.",
            "review_score": "1"
        },
        {
            "review_text": "I am in love with adventure-platform games. Psychonauts is absolutely one of my favourites, and a piece of nostalgia for me when it comes to games like it. The very concept of traveling into someone's psyche, clearing their mind of foul things (such as 'emotional baggage'), and discovering more about that character through such a journey, is just incredible. I'll say it again, this game has an incredible concept; an incredibly unique one, at that. This game is full of great metaphors. Of course, there is also a heap of humour thrown in, too.  Character development is great, the gameplay is great, this game is great. I couldn't possibly tell anybody why they should not play this game. They should.",
            "review_score": "1"
        },
        {
            "review_text": "The best 3D platformer I ve ever playied and one of the best stories in videogames-funny,full of character and ..simply a masterpiece-CLASSIC  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Played this on ps2 years ago, still as charming as ever.",
            "review_score": "1"
        },
        {
            "review_text": "After completing the game, I personally found the entire game awesome and fun. The story was fascinating, the levels were cool and the characters were funny. I enjoyed the actual lore in-built for the characters, such as the reason Raz can't swim and the boss fights were great once you pieced together their weakness. My favourite part though has to be the connection between Razputin and Lili from the obvious crush they have on each other to the the way the show it.  The only downside for me was a singular part of a parkour section to the final 2 boss fights, the wall climb cylinder with fire. That was extremely hard to do unlike the rest. Although, the music did seem to cut out alot which wasn't a negative just noticable.  A game like this, I think, is definitley worth it (In fact, I would pay a considerable amount more for it) and it is on par with modern games in terms of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Psychonauts is just about the perfect 3d platformer. I couldn't possibly talk it up enough so I will use the mind control powers it taught me to compell you to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Completed the game with 100% achievements.  I love this game. I first played it when the game came out more than 10 years ago. Now I can tell you I still think it is a good game, even if the graphics may be outdated.  Intriguing storyline, witty dialogue (with a surprising amount of adult references that would go right over a 10-year old's mind, which happens to be the age of the protagonist in the game), a diverse world made of a vibrant and colourful design, and a amazing veriaty of level design that continually challenges the player to take a different approach to the gameplay.  And plenty of stuff to collect and discover if you are a achievement hunter like me.  Not too difficult, but still a satisfying experience. Also, you can expect a long-awaited sequel soon from the same developers, if isn't already out when you are reading this.  Oh, I played the game on Windows 10. The game initially had issues with crashing, especially with mutitasking (alt-tab operations), but after setting the compatibility mode to Windows XP, I've had no crashes.",
            "review_score": "1"
        },
        {
            "review_text": "meh I couldn't really get into it.I guess it's all right though.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games of ALL TIME!!!! Although I am still adjusting to the PC version, (after playing it on the PS2), it is still the most creative adventure game I have ever seen! The characters are hilarious and unforgettable, the levels are amazing and so imaginative, and I doubt there will ever be a game quite like this!",
            "review_score": "1"
        },
        {
            "review_text": "A great game, even years after release. Very creative, very unique, very fun. I did almost ragequit at the climbing portion of the meat circus though.",
            "review_score": "1"
        },
        {
            "review_text": "I finally decided to give Psychonauts a try after having it sit in my Steam library for a while. I wish I had played it sooner! It’s a great “old school” (Xbox and PS2 era) 3D platformer. You play as Raz and are wanting to become a Psychonaut but have to interrupt your training to find out who is stealing the brains of the kids in the camp you’re at. The story is progressed mainly by entering the minds of various characters and going through their world. A very cool way to tell a story.  The areas and levels you go through are all very different and unique. No two areas feel the same. This is really where the game shines. You can tell some time and creativity was put into creating all of them.   The graphics and sound are quite good for an older title. Textures are sharp (sometimes stretched a bit) on most things. The cutscenes are the original low-def quality since they were not remastered. As with the unique levels, unique music is in each of them. The music seemed very fitting for each situation and environment.   Controls are sold…not the best, but solid. I would highly recommend a controller to play this. Some platforming elements (meat circus level) were made harder than I felt they should have been.  I had some issues with random crashes, but only in the beginning of the game. After that it was very solid. The game autosaves, but I made sure to manually save often when it kept crashing. Just a minor annoyance that went away after the first few hours of gameplay.   Psychonauts has several collectibles throughout the game. However, it’s not overwhelming and certainly feels doable if you put in the time.   I was disappointed to see no way to re-visit the real world after completing the game. You pass a point of no return where you can only revisit the different memory levels. Luckily, the game autosaves a spot at this point so you can go back and find anything you need before finishing the game up.   Pros  +Different and cool story +Graphics and gameplay are good and still hold up today +Collectables are not overwhelming +Different variety and style for each level +Characters fleshed out well +Unexpected humor +Music +Auto and manual saves +Powers earned are fun to use   Cons  +Platforming mechanics +Random crashes in beginning part of game +Fairly easy overall +Missable achievements   I would easily recommend this game to anyone that’s a fan of 3D platformers. It’s not a very difficult game and offers great gameplay that still stands up today.    8/10  Very good",
            "review_score": "1"
        },
        {
            "review_text": "A great platformer of its age.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant, it has a puzzling story and good gameplay, and is pretty much one of the most unique games you can buy/play.",
            "review_score": "1"
        },
        {
            "review_text": "Spent more time watching walkthroughs than actually playing, great game.  EDIT: After completing the game for the second time, i can safely say that this game has an incredible story and i can't wait for the sequel, definitely recommended for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "This is game of my childhood :) And it would be really great if they release second part.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, great style, funny characters and concepts, generally great amd memorable level design. Don't what else to say, a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that will forever be in my 'best games of all time' list. I could write pages of text about how I don't even know where to start talking about it.",
            "review_score": "1"
        },
        {
            "review_text": "finally got to live my schoolyard dream of invading other peoples heads and messing with their brain",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. It might look boring because it's a platformer but it's not it's a really good game.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: I do not support Tim Schaffer's works anymore at the time I am writing this. It is a good game, however, I wish I hadn't bought this game now that he has proven how untrustworthy and childish he is. Vote with your money, don't buy this game!  As a 3D platforming game enthusiast, Psychonauts remains as one of my favorites of the genre.  It's kinda as if Tim Burton had an idea for a ♥♥♥♥awesome movie where kids are put in a summer camp where they get trained to be psychic and ♥♥♥♥, but then hollywood was like 'LOLNO MORE DREAMWORKS ♥♥♥♥ INSTEAD IT MAEKS MONNIES', so he got butthurt but knew better than to make a movie about it, so he asked his good ol' buddy Tim Schaffer to make a game based on his idea with the same weed-induced style that he uses in his claymotion movies. Tim and Tim got high, and so did the whole crew who worked on this game, and thus, Psychonauts was born.  Okay, if that didn't convince you to buy it, then nothing will. It's a one in a lifetime experience you don't want to miss out.",
            "review_score": "-1"
        },
        {
            "review_text": "An absolute classic! Psychonauts is a great Tim Burton-esque adventure into a psychic summer camp. You'll dive into peoples minds, meet legendary psychonauts and uncover a dark conspiracy. Seriously, Pscyhonauts is usually dirt cheap these days: Play it!",
            "review_score": "1"
        },
        {
            "review_text": "It's good as ♥♥♥♥ you should buy it theres a wild difficulty spike towards the end but otherwise see above",
            "review_score": "1"
        },
        {
            "review_text": "This gem deserves a lot more recognition than it gets. It's got creative levels, brilliant funny dialogue, psychic powers, russian ,bear-wrestling children. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "The amazingness of this game cannot be described. It is fresh, clever, fun and still holds up after years and years! True classic!",
            "review_score": "1"
        },
        {
            "review_text": "It's been a number of years since I first played Psychonauts on a PS2 I borrowed from a friend. I still really enjoyed the style and humor in the game. The setting is also very creative, and there are some truly inspired levels in the game.  It can get a bit tedious if you let yourself get drawn into the collectathon, which really isn't needed to complete the game. And the Meat Circus is still the No Fun Allowed zone, although it was easier the second time around.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, classic game.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun,  You shoot stuff with your mind, you ride an energy ball, you can cook birds. And you go into people's minds. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "I’d like to start off by saying that Psychonauts is a FANTASTIC game that everyone should play at least once. From the level design to the characters, it gushes personality. That being said, nothing is without flaws, Psychonauts included.     Technical:  While the level design is very strange and often wonderful, it seems to often cause conflicts in collision detection between objects. In the very first level, as you go off a platform to a tightrope, you get caught at the point they connect. While you can just jump to overcome this, it is a frequent problem that I have found throughout the game. Not game breaking, but still bothersome. Some areas of the game, specifically Meat Circus have some very unforgiving jumps not hard purposefully, but by the fact in you are on a type of time limit. Luckily, the PC version of the game was made more lenient and does not take away life or lives when a jump is failed. If not for that, I’d bet very few people would have finished the game. Altogether, I would rate the level design at 8/10.     Graphics/Level Design:  I have to applaud Double Fine for the bizarre and fantastic style the game exudes. Each level is distinct and memorable. Seeing the Milkman Conspiracy for the first time was one of the few times a game left me in awe. The colorful pallet used throughout the game matches the style of the game to a tee. My favorite level from a graphic and style standpoint has to be Black Velvetopia. The ultraviolet coloring is vivid and striking and matches well with the artistic Edgar’s brain well. My one complaint is that many of the larger textures are very low quality. My guess is that stems from this game being ported from consoles in 2005. I would have liked if they had done a once over and fixed a few textures, but it is only a momentary distraction from a wonderful game. Again, 8/10.     Characters:  Any lastly, but certainly not least, the characters! Every character seems to be fleshed out and have a backstory. I’ve read that the director Tim Schafer even created Friendster and Myspace accounts for many of the character and it shows. From Raz’s distance from his father to Milla’s ill-fated children, it was a joy getting to know each character. My only grip would be that the cut-scenes are VERY compressed and do a poor job of matching the rest of the game. Again, I assume this was a technical limitation due to the games age. Despite that, I’m giving the characters a 10/10.     In conclusion, if you are on the fence about trying out this game, GET IT. In my twenty years of gaming I would say this game is in my top ten games, maybe even number one! 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is not your usual game. It's not a survival horror. It's not an open world. It's not a roguelike/roguelite. It doesn't have fancy graphics or a hige budget. What it does have is heart and soul. And weird. This is a game in which you go into people's minds and fix their emotional problems with psychic powers (and platforming). Every mind is different, and the rules and objectives change. You get to see into your enemies, and this, more than anything, is what makes Psychonauts so much fun. The platforming is good, the progression is engaging, and the powers are cool, but the characters are what drive this. Some of it is about how you get from here to there, butit's also about why.  More than that, it's easy to identify with the protagonist. You might think that a kid psychic who looks a bit like a bobblehead would be tough to empathize with. You'd be wrong.  Anyway, play the game. It's worth it. It's worth more than they're asking.  Graphics: old. Not amazing when released, but solid. But you're not playing this for the graphics. Sound: Voice acting is good. Kinda cheesy sometimes, but it's meant to be a bit campy. Effects are good. Gameplay: Creative, challenging without being cruel, sometimes a bit confusing (though that's part of the fun). And it will pull you in to its world, which is so dang rare. Replayability: Story is linear, but fun. There are some collectibles you could go back for, but it's more like re-watching a favorite movie. You go back not to find a new experience, but because the one you had was worth repeating.  Value: It's $10 ($1 right now!!!) so no excuses. And you can put the money you save towards THE SEQUEL THEY'RE FINALLY MAKING! WE THOUGHT IT WOULD NEVER COME AND IT IS I'M SO HAPPY HAAHAHAHAHAHAHAHAHAH YIPPEEEEEE!  sorry about that. just buy the damn game. thanks.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Everytime i spend 2 dollars on something past this moment i will feel i did not receive enough lol. This was one of the best games i have played. I usually go for FPS or open world games so me saying this is one of the best games i have ever spent money on is saying ALOT. cannot wait for number 2!",
            "review_score": "1"
        },
        {
            "review_text": "'TeeVee?' 'I'll kick your ♥♥♥-tral projection outta here...' 'PUNCH PUNCH PUNCH!' But, in all seriousness, this game is a wonderful exploration about how minds can handle different stresses and challenges, coupled with dark and slapstick humour, makes this a surprisingly deep game, hidden by jokes.   'Yes. Ouch.'",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game just so I could finish it again!",
            "review_score": "1"
        },
        {
            "review_text": "Holy heck, where to even start.  I have tried on many occasions to explain psychonauts to someone who has never even heard of it, but every time I find myself struggling to find things to compare it to. This reason is why I found psychonauts so enjoyable, the fact that it is increadibly unique and interesting in a way that not many games can pull off. Its environments are trippy, bizzare and beautiful, all while harboring some of the greatest level design in any game I have ever played. Its characters are all unique and interesting, from the campers that only show up 3 or 4 times in the whole game to the main protagonist. The story is interesting and enthralling, only suffering from minor pacing problems. The humor is origional and quite funny, helping set the game apart further from most other story heavy games that rely on sadness and entropy to drive the players emotions. The only complaints I have are that the controls and camera do not handle perfectly, and have led to a number of dissapointing moments. As I mentioned before, the story and difficulty arc have pacing problems, with the game turning from easy nearly remedial practice courses to controller snappingly hard puzzels and platform sequences in a blink of an eye. If you try to rush the game and don't take time to explore and examine the camp and/or don't collect enough figments, you will find yourself stuck about halfway through the game, needing to farm for psi challenge markers/figments.   In conclusion, this game is perfect if you love story driven games with beautiful landscapes and don't care too much about control problems. In my personall opinion, I would give this game a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Best 3D Platformer avilable on steam",
            "review_score": "1"
        },
        {
            "review_text": "Still on of the best 3d Platformers I've played to this day. The characters and humor really make the game. Can't wait for the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the games that came in a Humble Bundle when I was in high school and I really wanted to play it but got stuck in the first level. Since then I decided to install it and beat it. And I sure am glad that I did. The game doesn't run super well on newer systems, but beyond the occasional graphical glitches, the game played fine. I loved it and seeing that there is word of a second one makes it all the better.",
            "review_score": "1"
        },
        {
            "review_text": "Odigrajte ovo, neće vam biti krivo! For me, Psychonauts are still masterpice of video game industry!",
            "review_score": "1"
        },
        {
            "review_text": "A clasic game that still holds up today.",
            "review_score": "1"
        },
        {
            "review_text": "This game is all out amazing and fun, I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "It has an amusing plot about breaking into a summer camp. The dialoge is clever and amusing for NCP's. The best part is that each level is designed like a different game all within the same game. The creativity of each level makes the discovery the most entertaining part of this game. A fun game with casual elements that give this game a lot of replay value as well.",
            "review_score": "1"
        },
        {
            "review_text": "Why this game has not been played by every single person on the planet is beyond me. It should be law. Especially the Lung Fish level.  Play this , if only for Lungfishopolis.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game first when I was fourteen, and then again when I was twenty two. Somehow, it was even better than I remembered. A truly one-of-a-kind gem.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Still holds up very well after all these years.",
            "review_score": "1"
        },
        {
            "review_text": "There is a stage where you enters the mind of a giant fish and in his mind there is a little town full of tiny fishes and you are huge and destroy the city like Godzilla. 10/10 would gojira again",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely charming game that didn't get the exposure it deserved on release. Excellent story, excellent characters, excellent pacing. You need this game in your library right now - this is the only game that I've ever gone out of my way to pick up extra copies just to gift to friends.  The only downside is that it's probably not suitable for vegetarians/vegans who are such on moral grounds.",
            "review_score": "1"
        },
        {
            "review_text": "For me one of the best game there is :D",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's a fun platformer with an original story. Playing Raz and jumping into people's brains to collect the figments of their imaginations, clear out their mental cobwebs, and help sort out their emotionl baggage not only fuels laughs but also satisfies the 'collect all the things' urge.The writing is silly and clever. I've owned and played this game on several platforms and it's always worth it. It's 9 years old and is still fun. I will admit that the graphics are starting to get a bit dated, maybe they'll eventually release a remastered edition.",
            "review_score": "1"
        },
        {
            "review_text": "It's damn Psychonauts. It's funny. It's fun.   It's a true classic. There's gonna be a sequel eventually, too. Now's a good time to play it.",
            "review_score": "1"
        },
        {
            "review_text": "a classic, a master piece, my childhood  but make sure you run it in compatibility for windows 95.",
            "review_score": "1"
        },
        {
            "review_text": "This game is trippy, but fun.",
            "review_score": "1"
        },
        {
            "review_text": "'My Name-' -Raz 'STARTS WITH A D!' -Oleander '-Is Razputin.' -Raz 'Hmmpph.' -Oleander  Probably my favorite platformer of all time. Writers have a great sense of humor and the characters are some of the most intruiging I've seen in a while, and this was made in 2005.  Playtime: 10-18 hours (depending on if you collect all the collectibles and such)  Gameplay: Great Parkouring system and the Psychic abilities really add to the fun  Humor: Great, and bounding to make you at least smile  Difficulty: Mostly ok until end where if you don't know what you're doing it can be a bit hard.",
            "review_score": "1"
        }
    ]
}