{
    "app_id": 383270,
    "name": "Hue",
    "release_date": "2016-08-30",
    "developer": [
        "Fiddlesticks Games"
    ],
    "publisher": [
        "Curve Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Puzzle"
    ],
    "achievements": 13,
    "positive_ratings": 737,
    "negative_ratings": 48,
    "price": 11.99,
    "description": "Hue is a vibrant, award-winning puzzle-adventure, where you alter the world by changing its background colour.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/383270/header.jpg?t=1476285538",
    "minimum_requirements": "OS: Windows XP SP3/Vista with SP2/7/8/8.1/10 x86 or x64 Processor: Intel Core2 Duo E4300 (2 * 1800) or equivalent | AMD Athlon 64 X2 5000+ (2 * 2600) or equivalent Memory: 2048 MB RAM Graphics: GeForce GT 610 (1024 MB) or equivalent | Radeon HD 6450 (512 MB) or equivalent Storage: 400 MB available space",
    "recommended_requirements": "OS: Windows XP SP3/Vista with SP2/7/8/8.1/10 x86 or x64 Processor: Intel Core 2 Duo E7300 (2 * 2660) or equivalent | AMD Athlon 64 X2 6000+ (2 * 3000) or equivalent Memory: 4096 MB RAM Graphics: GeForce GTX 560 Ti (1024 MB) or equivalent | Radeon HD 2900 XT (1024 MB) or equivalent Storage: 400 MB available space",
    "reviews": [
        {
            "review_text": "Hue is a colour-based puzzle-platformer. You are given a palette of colours and an array of obstacles, interactable objects and hazards in these colours. Each time you change to a colour, all of the objects of that colour disappear and you can move yourself and other objects through them. The core gameplay consists of switching through colours and manipulating objects, phasing some in and out of existence in order to make your way to the end of the level.  Unlike many puzzle games, however, these puzzles are always intuitive and never infuriating. You will usually know exactly what to do very quickly, and even if there is a little thinking outside the box involved, these levels are not particularly long or complex, so even later levels will not take more than ten to fifteen minutes in total to figure out, and can be completed in thirty seconds once you know what to do - though there are quite a few curveballs where you get close to the end and realise things aren't going to work the way you intended, so it's back to the drawing board! They are also well-designed; each level has a few hazards, but dying will never take you back more than a few moments. There are also very few situations where you will be stuck and need to reset the level. The end result is that you will never be too frustrated at a level. You will always know where you went wrong and what to do to proceed, and you will never feel that your deaths were unfair. Many times I entered a level, looked at it, and thought 'oh no, this is going to be a rigmarole' and was always proven wrong by how intuitive and simple it really was. The levels are always fun and interesting to play, throwing in new mechanics every few levels so you never get bored or complacent. There are also a few short pure platforming sections mixed in to shake things up a little and keep things varied.  As well as exemplary gameplay, Hue also exhibits a fantastic soundtrack and aesthetic. A simple, cartoony art style with snappy animation makes everything stand out, and really helps with making the levels intuitive. The soundtrack is an eclectic acoustic mix of mostly slow piano tracks, with the odd bouncy, fun song mixed in to keep the mood high. The sound design is also snappy, with everything having its own distinct, fun sound.  The one area where the game is not so great is the story. There are many sections where you are merely wandering down a corridor, listening to some narration. The story is a little interesting, but the writing is not fantastic, often very simple philosophical musings that don't really add anything to the game. The voice acting is great, but while these sections are short, they take a minute or so each, which is quite a lot in a game like this where levels are also short, and only serve to slow down the pacing.  Overall, Hue is one of the few puzzle games I have played in which I never got frustrated or felt the puzzles were unfair or padding (apart from the story sections). The levels being short really helps the gameplay, so that you are never stuck anywhere for too long. The level design is some of the best I have seen in a puzzle game; always intuitive and simple, but still making you think differently every time.  Highly recommended and one of the best puzzle games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "Been a big fan of puzzle platformers and this one caught my eye thanks to a co-worker. I instantly fell in love with the look of it and the core gameplay mechanic.   I grabbed a copy of the game and played it on a live-stream and I instantly fell in love with it. It ranks up there with Ori and the Blind Forest, Unravel, INSIDE and Limbo. The game can be quite challenging and can make you quite salty when you die a few times trying to solve the more difficult puzzles.  Highly recommend if you are a 2d puzzle platformer. The game and the music are beautiful. 10 out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this quite a bit. Puzzles towards the end were a little frustrating, but not overly so. Music was great. Worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "  A beautiful game with an amazing new mechanic! One of the best indie puzzle - platformers of the year.  Colourful, happy and with puzzles that make you use your brain! I really enjoy this game!!!  Note: Play it wih a controller.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game - and the colour on the mouse changes with the colour in the game. Now I just have to make my LEDs on my computer adapt to the game colour.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a lot of fun and ended up being pretty challenging at times toward the end. The basic mechanic involves changing the color of the background, rending obstacles and other objects of that color invisible. The puzzles are fairly straightforward at the start but quickly become rather complicated, involving paint jets (that can change the color of objects), circuits, and more. I ended up feeling challenged but not frustrated. The story had a neat link to the gameplay, but there's not much there, though the voice acting is actually quite good. There's also a few hidden secrets that will keep you looking around for a little while. I definitely recommend this to fans of quirky puzzle platformers.",
            "review_score": "1"
        },
        {
            "review_text": "such a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Never before has a game given me such visceral satisfaction just from looking at simple colours. Absolutely beautiful, and I suggest playing with the lights off so you can appreciate their vibrancy to the fullest. There's also an excellent, soothing soundtrack to keep you nice and calm while you're racking your brain trying to solve all the puzzles.  Speaking of puzzles, while the whole 'change the background colour to make things visible/invisible' isn't a unique mechanic in games (I'm particularly reminded of Outland as a good example of this), Hue uses it creatively enough to always make things interesting and fun.   Short and sweet, it's definitely worth a look if you're a fan of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Pure pleasure to play this game",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I got it as part of the christmas humble bundle, and it was totaly worth every penny. here are some of my favourite things about it: 1. the narration, i love the womens voice, I honestly look forward to those little letters just to hear her gentle voice. 2. The story itself is quite interesting. 3. The attention to detail, there are so many details everywhere that just make the experience so much more enjoyable and immersive, from the subtle moving objects to the variouse jokes/puns that you get from random characters/objects. 4. The music is beautiful. 5. The puzzls are great and relaxing. 6. I love the art style. and many other things that I can't recall for now. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Hue was alone...",
            "review_score": "1"
        }
    ]
}