{
    "app_id": 383460,
    "name": "Sound of Drop - fall into poison -",
    "release_date": "2015-10-30",
    "developer": [
        "aiueoKompany"
    ],
    "publisher": [
        "Sekai Project"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Visual Novel",
        "Anime",
        "Indie"
    ],
    "achievements": 21,
    "positive_ratings": 286,
    "negative_ratings": 37,
    "price": 9.99,
    "description": "Nestled in the heart of Tokyo, the quaint little aquarium, Manten Aquarium. Numerous urban legends have arisen from here. On the night of the full moon the waters turn to blood and man faced fish lurk within.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/383460/header.jpg?t=1546645190",
    "minimum_requirements": "OS: Win XP+ Processor: Pentium3 1.0GHz Memory: 512 MB RAM Graphics: DirectX® 9 Compatible Graphics Card DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "After finishing the one of the True Ends, I would say the game is amazing. The story is pretty vague at some part , I would say maybe it's the translation or my slow brain (or both) , I usually find myself reading some parts twice to actually gets it. However the CG , The multiple true endings , The soundtrack definitely worth it. I haven't yet go thru the other 3 True End but this game is definitely worth it. If only it have japanese voices I would rate it higher though.  +Amazing soundtracks +Amazing Graphics + Multiple True Ends +Mari the cute Loli +Affordable   - Unvoiced - Hard to understand at some part. Might need to read it 2 -3 times.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "I was pleasantly surprised by how invested I became with this game and how much it stuck with me afterwards, especially considering the best of the visual novels I’ve played so far have been sound/kinetic ones not choice based. And as a fan of horror in any medium it is a real treat to see a visual novel create such a great horror atmosphere. I couldn’t wait to try each decision I’d left before and find the new ending, especially as there were several choices that threw me off completely (examining the cutlass-fish anyone?). And these bad endings are horrifying at times, the detail in which these are written is utterly amazing and more than once I was staring at the screen in awe at how brutal and disturbing these could get, and a couple of times it’s difficult to tell if this is a bad ending or if Miyu can turn it around at the last minute. That’s story-writing I am very envious of. I had not originally purchased the soundtrack but after a hundred percenting the game I immediately grabbed it at the end of the sale as the music is just beautiful, especially that amazing opening song.   However the biggest thing that really pushed Sound of Drop above and beyond for me personally is its replay-ability. I imagine there are at least one or two people like me who make a save at every choice and when the story is over, go back to each individual choice and make the opposite decision. I very rarely replay visual novels from the beginning unless there’s a section I didn’t save for, as I can usually get all the endings/achievements just by going back to the decisions saved. But after doing that thoroughly there were several bad endings and a couple of true endings I didn’t have yet, no matter what I did. So I finally started from the beginning again and not only was I treated to a completely new opening scene that developed one character and introduced another, but this actually changed a few aspects of the main plotline, it was an amazing experience.   Overall a fantastic visual novel and just a fantastic game in general, I can only hope to find more horror games that are this creative in their execution.",
            "review_score": "1"
        },
        {
            "review_text": "Played through all the endings, overall opinion is it's a well written horror story, but feels really trial and error-y. Some of the 'Correct' choices make no sense upon first encountering them, so if you're any sort of logical person you're bound to bad end a couple of times naturally, otherwise it was fun uncovering the whole story and figuring things out.  A note: achievements are bugged (as of time of writing, 15/12/2016). I have completed every ending, including bad ones, and the ones for 25, 50, and 75% completion of CG's and bad endings haven't popped.",
            "review_score": "1"
        },
        {
            "review_text": "For its price, this VN had alot more story and plot connections than I thought it would have. I still haven't managed to get all of the endings without the use of guides. If you do finish it once through however, there is a prologue that in itself is pretty eye opening once you know the story a bit more. 10/10 would die to whales again... and again....",
            "review_score": "1"
        },
        {
            "review_text": " 'I feel salt ocean water in my mouth. I am slowly drowning in my sorrow.'",
            "review_score": "-1"
        },
        {
            "review_text": " My full review can be found here.  [www.the-backlog.net]   Disclaimer: I received a code from the publisher for review purposes.  The Manten Aquarium has become the host of several urban legends - during a full moon, the water turns blood red, human faces can be seen on the fish, and ghosts can be seen in the tanks. Junior High students Mayumi and Himeno head there, Himeno insisting that they should investigate these legends. What ends up awaiting them is far beyond what either of them could have imagined.  Sound of Drop - fall into poison - is an around 3-4 hour visual novel. The length will depend on how many bad endings you end up getting and your reading speed. If you want to aim for all the endings, you'll be reading for much longer. The visuals capture the scenes perfectly, as do the sounds. While there's no voice acting present, it doesn't need it - the game does perfectly fine without it. While it would have been nice to see more about certain characters, I definitely enjoyed the story. If you're a fan of horror titles and/or visual novels then be sure not to miss Sound of Drop!",
            "review_score": "1"
        },
        {
            "review_text": "Overall I cannot recommend this game. For me there was nothing I really found engaging about it, nothing really kept me interested. What ultimately made me purchase this was the horror tag, but unfortunately It wan not really scary. Sure the main character was always in danger, but that isn't scary. It was gory at times, but again, to me that does not frighten. To be fair, there was a handful of moments that were frightening, but unfortunately far too few.  Another thing was the story. No spoilers, but when the mystery is reveled, it is really rather bad. The reason all the bad things are happening to our character is as cliche as they come. The characters themselves are pretty good. There personality is generic but while not immediate apparent, the motivations of all of them are good. All of the characters have reasons for being there and they all do things that make sense in there own internal stories.  In the end tho, this game is flat and boring as they come.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite a good horror visual novel, if you feel like having quite a decent read over the spawn of a day or two, pick this up.   The good",
            "review_score": "1"
        },
        {
            "review_text": "One of my first Steam games. Slightly unpreditable. There was only one really scary bit though.",
            "review_score": "1"
        },
        {
            "review_text": "This game..... HOLY FUDGE...... First five mintues spent dying in ways I couldn't even imagine (ripped apart, stabbed, etc...) . Overall this is a diecision making game so be preapred to do a thing no gamer should (Being serious). Nice thing is the gore (and trust me plenty of that!), art (Facial expressions and some movenment), Fishies, and most of all the story. Characters can be likable (For me it's Mayu cause she dealing with some freaking crazy stuff) Controls are pretty easy it's called spam quick save and prepare your body for death. Otherwise soundtrack is OK and can if your really in the game can send tingles up your spine or make you feel happy (For a matter of three seconds to the Fit hits the shan) I feel its a great game overall but if you not into horrible death's, Ghosts?, and other fricking nightmare making day wreckers this is not your game friend. Otherwise have fun and enjoy the story that has pretty much no happy endings.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the only graphic novels I have paid for, having tried out a couple of free ones before, and I have had no regrets. The sheer amount of endings, only four of them being good, gives it a lot of replay value and there enough save slots to ensure you will be able to see everything. The more you play it the more you learn about the world and the characters within them. The choices you have to make do actually have an impact and if you manage to choose the one that doesn't kill you, your choice can still have an impacts on others.  It might be my bias towards loving marine life and aquariams as a whole but the visuals are brilliant as well and keeps you really involved in the story. It took me three pretty solid days to get the story finished entirely and each of the good enedings had their own emotional impacts. It's hard to mention anything about the story without giving anything away, but there is defiently a two part ending to this, as in you need to play a second time to unlock more story.  While the overall style and a couple of the tropes and jokes are an anime style, you don't need to be an anime fan to enjoy this. Ofcourse if you enjoy anime these are just more positives towards this!!  I managed to get this for half price on sale, but would still say it is worth it's full value! So if you need some time to kill and want to really enjoy said time then buy this, buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "OMG Dat scene with human heads floating in blood was LEGITIMATELY spooky! But dafuq who is the girl who committed suicide after coming back from Manten!",
            "review_score": "1"
        },
        {
            "review_text": "I was initially intrigued by the setting (I haven't encountered many horror stories set in an aquarium), and after an hour I was hooked. I love how the creators made an aquarium creepy - so many fishy ways to die. Makes a very welcome change from all the mental hospitals and schools.  The artwork and soundtrack are both phenomenal. It's the first time I've bothered buying the soundtrack for a game on Steam. Together they really build the atmosphere.  The story is pretty damn good for the most part, but it has its weak points. As a horror game, there were some eerie moments early on, but once things begin to be explained in detail the horror lapses. The music and art kept up the atmosphere though. The translation isn't perfect - it's rather clunky in places, but otherwise it reads well. The characters are rather rounded for a visual novel of this length, and I found myself caring for them. Some of the secondary routes are very exposition heavy though, with the protagonist just standing there being talked at for large periods of time. Despite this, or maybe because of it, the world felt fleshed out and almost real. I felt like I really got to know Manten Aquarium during my 9+ hours of playtime. I was almost sad to leave it.  In short, an atmospheric and aesthetically pleasing game with a strong story and characters.",
            "review_score": "1"
        },
        {
            "review_text": "This is a solid visual novel that manages to be horrifying ang enthralling. Playinga visual novel like this is an amazing and refeshing break from the endless barrage of empty and unfuffiling VN's whose only positives are the chest sizes of its characters. This creepy and engaging VN is easily one of the best VN's on steam.",
            "review_score": "1"
        }
    ]
}