{
    "app_id": 383580,
    "name": "Flesh Eaters",
    "release_date": "2016-05-03",
    "developer": [
        "S.C. 16 BIT NIGHTS S.R.L."
    ],
    "publisher": [
        "S.C. 16 BIT NIGHTS S.R.L."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Action",
        "Zombies"
    ],
    "achievements": 9,
    "positive_ratings": 927,
    "negative_ratings": 364,
    "price": 1.59,
    "description": "Flesh Eaters is retro style single player RTS zombie survival game with resource gathering and crafting. Zombies are everywhere! You must gather resources to build barricades, upgrade weapons and armour and explore the city under the siege of the...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/383580/header.jpg?t=1513410553",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Graphics: DirectX 9.0 Compatible Storage: 20 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Craft an AK and maximize 'loot'. Doing that, the game becomes very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "For 99 cents, this game is well worth every penny, very addicting, very challenging, and has some roguelike elements, if you're looking for an rts zombie outbreak simulator, this game is your best bet, thank you devs for makings such an interesting game, i hope there'll be more endings and new stages, and alot more updates to this game, I'd hate to see this game just be this short.",
            "review_score": "1"
        },
        {
            "review_text": "Rough around the edges without a doubt, and it sure has balance issues, but for the price it has a charm of its own. Nice visuals and effective sounds offset the shortish game length,           YouTube™ Video:  Flesh eaters retro zombie survival - quicklook.&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I was originally going to play this for only a few minutes, but then a few minutes turned into a little above an hour. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "alot of fun, and pretty addictive",
            "review_score": "1"
        },
        {
            "review_text": "GYAAAAAA My favorite, and all this ours i cant even finish this game even once All upgrade soldier and die with bom because miss shot zombie 100% will misshot again",
            "review_score": "1"
        },
        {
            "review_text": "A cool little game. Certainly has room for potential. As it stands, it’s ok. Recommended but with improvement I’d be sharing with friends all over. I did a quick review video.  Check it out and let me know what you think!         YouTube™ Video:  Flesh Eaters | Cheap Steam Games #25&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "nice game ok story ending could be little better and there is 3 game modes if you don't count the campaing",
            "review_score": "1"
        },
        {
            "review_text": "its like a flesh wound, it heals and goes away but then it leaves a huge scar!",
            "review_score": "1"
        },
        {
            "review_text": "This game is currently slow and boring, completely dependent on getting good random weapons at the start. 3/10  EDIT: 06/05/2016 Still unfairly difficult, the doctor seems completely bloody useless, amd sandbox mode still gives you random weapons which sucks",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, I cannot recommend this game at this time. I purchased &amp; have been watching this game from its early days, eagerly anticipating &amp; awaiting its final arrival...&amp; now thats its here...all I can say is its an extremely underwhelming disappointment.   In what was recently described by the Dev, as the FULL GAME now being released, I thought great, theres more content now, theres actually a finished story mode to play now...sadly this is not the case.  Before the supposed final release the game was very bare, with little to do other then a tutorial mode &amp; some simple &amp; lacking sandbox modes. It appeared there was an, as of then, unfinished story mode that had you sitting at your base/HQ with some cool looking features &amp; an option to choose missions to go on, which looked cool &amp; promising.  That is what I was looking forward to in its finished state...but after relaunching this 'Finished' product, those features are now, nowhere to be found &amp; instead were replaced with an overly simplistic, dumbed-down, pick 3 random events to chose from every day that gives a you a quick option like loot firetruck for random supplies, in which you take no part in, it takes you to one of a FEW locations, like a hospital, or lab or police station.  Problem is you have only 30 days total, 30 days which are counted with the click of ONE mouse button to proceed to a quick random event or a quick &amp; meaningless venture to one of the few building locations. 30 turns to chose from before the game is over, win or lose...I literally zipped through story mode in 10-15 minutes each. Not cuz I wanted to, but because there is sooo little content to actually play through. And the side missions where you actually do go through the police station etc are bugged, so that after going back to these places, they are still swarmed by zed, most often times giving you little to no opportunity to gather any supplies or do anything other then make a hasty retreat. Rinse &amp; repeat this until day 30, 10 minutes later where you either lose or somehow manage to complete any of the 3 dumbed-down objectives.  I hate to criticize &amp; leave bad remarks, but after waiting for something at least half-way playable for this whole time, only to be treated to this shallow, hallowed out experience is just wrong. Im especially taking the time to write this negative review, because this game had so much promise &amp; potential &amp; COULD have been one of the few special games here on steam that COULD have stood out amongst a lot of the other crap on here. But sooo much was left undone with this game &amp; the Dev has stated they are done with this game other then minor fixes or bug tweaks, which STILL will not make this game worth playing, even for the super low price. I would have to be paid to endure spending any more time on this game.  In short, at its foundation, this game had the look &amp; the feel &amp; potential to be a very fun, very captivating experience, but instead was left dry &amp; empty &amp; void of any real content &amp; we are instead left with what feels like, just an extremely, very incomplete &amp; unfinished game, which is a huge shame considering the foundation &amp; ideas were solid &amp; this game could have been so, so much more.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanna like this game, really I do, but it's been so long, and it's still the horrible, sh*tty mess it was over a  year  ago.   I undestand that it's EA, and no doubt some dipsh*t will say that 'I shouldn't have bought it,' and they would be absolutley right. This should be a free flash game on newgrounds, not on steam!  It has the makings of an excellent Door-kickers style zombie defense game, and all of the graphics are pretty solid, nothing looks strange, the artstyle makes sense and looks pretty decent... you get the idea.  However: The pathfinding is awful. Characters will, despite litterally standing  right in front of the needed scavenge point  they will walk  all the g0ddamn way around the thing to scavenge it, unless you manually click on the  exact point  . This is a squad-based game people, pathfinding is important. Resources are excruciatingly difficult to get, and without spending the first six levels in scavenging, you won't be able to do  anything.  Period. The gameplay is repetetive and boring after about five minuites, even in the new 'story' mode, which includes a tutorial... The tutorial is horrible. It's just... Moving on... The English is terrible. This isn't bad in itself, but after a stupid long amount of time,  nothing has been done to fix it, and they've instead done  more work in the broken English!    So, I can't reccomend it. I really, really, really can't. I'm sorry Conrad.  Post-Release:  F*ck it. The game has not changed AT ALL since I last played it. NOTHING. Steer well clear and f*ck this mess. I spent less than a £1 on this and I feel ripped off.",
            "review_score": "-1"
        },
        {
            "review_text": "So, I have revisted the game. Still seems very alpha-ish- to me. Gameplay is rather bland, literally... get ammo&gt;get parts&gt;repair car&gt;stay alive. I don't like it honestly the UI isn't great music, is also not the greatest the sounds however, (when I say sounds, I mean things to make it seem eerie and creepy not like gun sfx.) are ♥♥♥♥ing great. Gets the creepy feeling of a horror game going, which imo thats a requirement for zombie games. Characters as far as I saw are bland as well, Soldier, Medic, and Engineer. I still don't recommend a game thats done according to a developer seeing as theres still problems in it. Which I didn't delve to deep into the story -or the game for that matter- so for all I know its one hell of a game. Though these are my opinions and I don't care to greatly for RTS games in the first place so those opinions might be blinded by that feeling of the genre.  Before I make a rant about a game I'll end it here. I give it a rating of 4/10. Could be much better but isn't good enough to cost money.",
            "review_score": "-1"
        },
        {
            "review_text": "Ah, another encounter with the  Back to Basics  publisher. A publisher that's not really known to players, cause he keeps his doings shady, but some of the more observant people may know him, them, it, whatever you call it. This establishment keeps pumping out cheap games, each made in a few weeks, with the very same textures, no significant gameplay, no storyline, no unique sounds even. How they keep these similar games and not breaking any Steam rules is beyond me, but okay, let's move on to the game.  What do we have here? Another unfinished game, with the very same art as their other titles:     Kivi, Toilet and Shotgun.  Check the characters, textures, sounds, particles, weapons and the overall feel of the game.    Neon Hardcorps.  Yet again, check characters, textures, weapons, particles, camera, sounds and overall feel.   This game has zombies, top-down perspective and a promise to add more content later (spoiler alert: won't ever happen).  There is no single player campaign, no significant (and finished) sandbox mode, there's nothing to actually play with. If you do enjoy unfinished products with no quality whatsoever, buy it. If not, just move along.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is one of the worst i've ever played. Not recommended !",
            "review_score": "-1"
        },
        {
            "review_text": "Still pretty much exactly how it was, terrible gameplay and mechanic overall. Not recommended",
            "review_score": "-1"
        }
    ]
}