{
    "app_id": 383620,
    "name": "Flight Unlimited Las Vegas",
    "release_date": "2015-07-08",
    "developer": [
        "Flight Systems LLC"
    ],
    "publisher": [
        "Flight Systems LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Racing",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Racing",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 6,
    "negative_ratings": 19,
    "price": 1.99,
    "description": "The popular iPhone Flight Simulator with over 4,000,000 downloads world wide is now available on the Steam Network for PC and MAC. The Steam version features enhanced lighting effects, enhanced shadow effects, and all of the aircraft unlocked and available to pilot. Experience the thrill of flight with Flight Unlimited Las Vegas.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/383620/header.jpg?t=1447376869",
    "minimum_requirements": "OS: Windows 7 Processor: Pentium 1.4Ghz Memory: 2000 MB RAM Graphics: 3D Graphics Card Storage: 800 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "UPDATED REVIEW.  With joysticks now supported I can give this a thumbs up. Its a fun little flight game. Not really a simulator. Plane Physics are no the best bur doing the missions are fun. The ground textures could use some work though. Id rather have a basic flat texture than pixelated satillite views.  ORIGINAL REVIEW Why no joystick Support?!?! I really wanted to like this simplistic Flight Simulator. I play super sims like DCS FSX and ROF this game would have been awesome to play on my laptop but i cant use my joystick! I know its a mobile port but come on! I wish i liked playing sims on mobile but i really dont.. its no fun without a joystick.. PLEASE fix this! This would be a great little sim.",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable. Terrible game. I tried using a joystick and crashed before even getting off the ground!! I've spent $2.99 on better things like crappy coffee.",
            "review_score": "-1"
        }
    ]
}