{
    "app_id": 384030,
    "name": "Florensia",
    "release_date": "2016-11-29",
    "developer": [
        "AHA Entertainment"
    ],
    "publisher": [
        "GAMESinFLAMES"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Anime",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 258,
    "negative_ratings": 174,
    "price": 0.0,
    "description": "Florensia is a Free-to-Play MMORPG and with it´s 3D anime style the game shows you its legendary worlds ashore and at sea. Mysterious islands, the great ocean, dungeons, picturesque pirates and dangerous monsters are waiting to be discovered.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/384030/header.jpg?t=1519729716",
    "minimum_requirements": "OS: Windows XP or Higher Processor: Penitum4 1.3GHz Memory: 512 MB RAM Graphics: A graphic card thats supports at least DirectX 9 or better DirectX: Version 9.0 Network: Broadband Internet connection Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows XP or Higher Processor: Pentium 4 2,4 GHz Memory: 1 GB RAM Graphics: A graphic card thats supports at least DirectX 9 or better DirectX: Version 9.0 Network: Broadband Internet connection Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "This is a mmorpg. This game is free, looks like a alpha build, is dead like all hell, has a repetetive soundtrack, is not good for new players and can not even be put into full screen. Sorry I can not stomache this *game* anymore. Have fun, enjoy and find a better mmorpg :)",
            "review_score": "-1"
        },
        {
            "review_text": "Dead Mans Game. I remember years where Florensia were full of players in every District. Now you can hear yourself breath in this game. Would only recommend this game if there would be a new grafic patch w/ more community. 7yr old grafics suck tbh.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible.  Its super laggy and and just weird.  I played this game for 12 mins and i'm like nope and exited the game. Plus I had to load this game about 5 times before I could actually play it. All Is this game is awesome. Not.",
            "review_score": "-1"
        },
        {
            "review_text": "Really Gay super duper Gy",
            "review_score": "-1"
        },
        {
            "review_text": "The best game :) I've been playing this game more than 5 years.. i love it..",
            "review_score": "1"
        },
        {
            "review_text": "Game sucks, no patch, only item shop updates.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like Luna, FLYFF, and others like it and don't want to spend a month learnding 30 hotkeys and the like this is a pretty good one.",
            "review_score": "1"
        },
        {
            "review_text": "Wow what a game, played it since it came out and had lots of fun. also spent some money on it back in the day. I along side side some friends played 1000s of hrs. and it was fun. now its a bit empty and it was not really updated.  but i still love it. It was my first mmorpg   Id say, go in with low expectation. it is p2w and it is slow but my oppinion , it is fun.  A word of warning. once you are lvl 80= you will find yourself to be a bit alone :) was just my experience.  Give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Logged in assessed the graphics, UI, and the general flow of the game... Promptly uninstalled and found better use for my time.",
            "review_score": "-1"
        }
    ]
}