{
    "app_id": 384080,
    "name": "Industry Manager: Future Technologies",
    "release_date": "2016-10-06",
    "developer": [
        "astragon Entertainment"
    ],
    "publisher": [
        "astragon Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Realistic",
        "Management"
    ],
    "achievements": 79,
    "positive_ratings": 151,
    "negative_ratings": 102,
    "price": 17.99,
    "description": "INDUSTRY MANAGER: Future Technologies is a classic economy simulation in which you can build your own empire, research new sustainable products, and sweep aside the competition on your way to fame and success.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/384080/header.jpg?t=1540301892",
    "minimum_requirements": "OS: Windows Vista/7/8/10 Processor: Dual-Core Processor with 2.4 GHz Memory: 4 GB RAM Graphics: DirectX 9 compatible graphics card with 1 GB VRAM (GeForce 400 Series or comparable | ATI Radeon HD 57xx or comparable) DirectX: Version 9.0 Network: Broadband Internet connection Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows Vista/7/8/10 Processor: Dual or Quad-Core Processor with 3 GHz or better Memory: 6 GB RAM Graphics: DirectX 9 compatible graphics card with 2 GB+ RAM (GeForce GTX 660 or comparable | ATI Radeon HD 68xx, 77xx or comparable) DirectX: Version 9.0 Network: Broadband Internet connection Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "Do you like complex economic simulations? Do you like games filled with simulation features, and a rich gameplay?  This game is not for you then.  I spent roughly an hour and a half getting used to the game itself. Learning the features, how to research products, how to produce, etc. After that, I can confidently say it only takes me 5 minutes of real life time to net 10 million a day for the company.  All I did was start out with the biotech, and sold over the counter cold/flu pills for 4000 dollars per PILL. How does this work, you ask? Well, it appears the developers created the advertisement to work as a price + demand modifier. Not only do more people purchase your product when you activate the advertisement, but they will also pay MORE for it.  It cost me 3 bucks to produce a single pill, and with 5 minutes of in-game time, maxed out advertisement, I set it to 4000 bucks a pill, and people bought every single pill. All 1400 of them. In fact, I could have done it in even less time, but it took me 4 minutes to research advertisement.  Do not recommend. This belongs in early access.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics :8 Sound :8 Simulation:4 Depth :4 AI:4   A polished version of the Cult game Capitalism . Graphics &amp; Sounds are nice however the game doesnt have any depth, this is why it becomes boring after few hrs. unlike Capitalism which i stil enjoy playing.  Also AI of Capitalism is more sophisticated compared to this game.   I wouldnt reccomend that game",
            "review_score": "-1"
        },
        {
            "review_text": "Finally a new business game that looks good and works good. I only discovered Capitalism one year ago (strange because it should have been a game for me when I was young but I never heard of it), but didn't like it because it was too clunky/old for me. I play lots of old games, but in Capitalism, it just wasn't for me.  That's why I am happy to see this and this game is not at all bad. I'm only in it for little over 2 hours and I already believe I will have great fun with this game. It does, however, take 2 hours to start to grasp how it works. Not that it's not intuitive or something like that, but just because you have lots to do and understand. Take that time, if you're into this kind of game, you won't be disappointed.  As for the graphics: I think they are gorgeous. This game has by far one of the most beautiful user interfaces I have seen in games these last years, and it functions perfectly.  I have only one negative point at this moment: you need a mousewheel to be able to rotate buildings (which is a necessity). This issue has been communicated and the developers have said it is a high priority issue, so I expect to see it solved soon. Also an in game calculator would be a nice addition.  If more negatives come to me, I will tell about them, but at this point, I am very happy with this game and I happily recommend it to everyone who enjoys trading and business and other numbers stuff.  Is it worth the full price? I do think so, yes.",
            "review_score": "1"
        },
        {
            "review_text": "One hour into game I thought I had made a mistake buying it. But then as I played on and became more familiar, hmm, it's not too bad. Now I'm hooked on it, I've still a lot to learn but I'm becoming addicted. One gripe, playing on normal the rivals have gone bust very quickly, I'd bought some of their stock, money lost now, but so early in the game no way could I afford to buy 51% to gain control. All in all I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great! Build / Research / Produce / Sell  Takes a little getting used to but I like it!  Right now I have to finish other games, (Steam and it's sales... you know ;) ) but this one is certainly one I'll come back to have fun playing Thumbs up!  :)  ",
            "review_score": "1"
        },
        {
            "review_text": "played the old game this is based off of and have to say i love this new game upgrade wow.. hope it keeps going ...keep up the good work hours off fun.. hope you keep upgrading the game...",
            "review_score": "1"
        },
        {
            "review_text": "Nice game for the price. High replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Just to much micromanagement for me, that does not add to gamedepth.",
            "review_score": "-1"
        }
    ]
}