{
    "app_id": 384110,
    "name": "Pathologic Classic HD",
    "release_date": "2015-10-29",
    "developer": [
        "Ice-Pick Lodge",
        "General Arcade"
    ],
    "publisher": [
        "Good Shepherd Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Atmospheric",
        "Story Rich",
        "Survival"
    ],
    "achievements": 42,
    "positive_ratings": 843,
    "negative_ratings": 150,
    "price": 9.99,
    "description": "Pathologic Classic HD is the Definitive Edition of the original Cult Classic Psychological First-Person Survival game. In this unforgettable experience, players control one of three unique characters as they try to save a mysterious town from a deadly plague that cannot be stopped.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/384110/header.jpg?t=1505118648",
    "minimum_requirements": "OS: Windows XP or Later Processor: AMD Athlon 64 2.3 GHz / Intel Pentium 2.2 GHz Memory: 2 GB RAM Graphics: Radeon HD 4890 1024MB / GeForce 210 512MB DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "(I have completed a full playthrough of the original pathologic before its HD re-release. It was a personal favorite game of mine.)   Overview:  Pathologic's effectiveness as a survivial-horror game relies on the passage of time; gathering enough food and supplies for yourself is trying to begin with, and as the plague takes hold in the town, the price of food and medicine skyrockets as districts fill with plague vapors, rats, and the shambling sick. It's impossible not to feel the invisible noose of desperation tightening around your chosen character's neck.   As for the game's story, if you manage to keep yourself alive, you're going to uncover some wild stuff. The town this game is set in is steeped in cults, competing factions, and world-changing magic, but none of it is spelled out for you at the start. Magical Realism is a good way to describe it, which just can't be said about many games out there.  Each of the three player characters can learn things the other two can't. There are many unique NPC's to interact with and learn about the world from, and all of them treat each player character very differently. Many will tell half-truths and try and manipulate you to suit their ends. There is branching dialogue and quests may resolve differently based on your actions.   ----------------------------------------------------------------------- Reasons you might love this game:   - A wonderfully original setting with interesting characters and lore.   - A sense of slow, creeping decay that many horror games aren't patient enough to pull off.  -A barter economy born of desperation: rummage through trash cans for baubles to trade children for, swap your only weapon for a loaf of bread, loot the houses of infected districts for items at the risk of contracting the Plague...you'll be making hard decisions constantly under time pressure.  - A strange but very well excecuted soundtrack.   ----------------------------------------------------------------------- Reasons you might not like this game:  -Combat is very clunky.   -You'll be doing a lot of walking from place to place with not much happening between besides trading with people or visiting a store. (Unless its a plague district or nighttime, when you can run into knife-weilding bandits.) There is no sprint button.   -If you don't like games with a lot of text. Characters have a lot to say.   - If you aren't careful, you can exhaust your supplies and money and be completely ruined well into the game. Keeping rolling saves / quicksaving often is highly reccomended.  ----------------------------------------------------------------------- All in all, if you are looking for an unrelenting, unique experience, this game is truly an unpolished gem that is well worth your time for its story and atmosphere alone. ----------------------------------------------------------------------- Gameplay tips from someone who has played through the game:   - 'Q' brings up your quest log. ' L' brings up letters you've received that will give you hints on what to do. They often show up at the start of a new day. 'P' brings up your status screen.   -If one of your Bound (Also called Adherents) dies at the end of a day, you didn't complete the day's main quest and will be locked out of all but one very grim ending to the game.   -Look through trash cans whenever you can. Junk can be traded to children for invaluable supplies. Bottles can be filled up with water and traded to drunks for bandages and tornaquets.   -Equip clothing and use drugs that boost your immunity when going into infected districts/houses. It may be the difference between catching the Plague (which can only be cured through two very rare items) and remaining healthy. Take protective clothes off when you leave; they lose durability when being worn.   - Even with your best efforts, you're gonna probably gonna get the plague. The higher your infection bar, the faster your health will drain away.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unwelcoming games of 2015. An HD re-release from the 2005 original.  Pathologic however provides a deep, dark, chilling experience - dystopian city dying in the embrace of a fatal plague. As all games from this studio the metaphoric weight of every message has a special mention, most of the game, even the tutorials are cryptic. It is a story for patient meditation. Eventually your decisions impacting the fate of the city.  I hope updates continue to fix existing bugs. Such developers as Ice Pick Lodge I commend with both hands.  This survival game came out way before it's time.    The new version from Kickstarter will change every nuance unfriendly to new players. This one is worth it because it completes that new version with it's own perspective on the story.",
            "review_score": "1"
        },
        {
            "review_text": "A town in the middle of nowhere, blessed with unique and almost magical architecture, ravaged by plague. The player has 12 days to stop it. You can play as one of three main protagonists- all of whom are different from one another, yet still interact with each other throughout the game. That is, while you pick one of them, the other two will still exist within the universe and go on about their stories, sometimes even sabotaging your plans. Each of these characters have their bound- a set of important characters that support you throughout the game and are required for your victory. If you fail to complete any quest until midnight, one of them gets sick and dies. Thus, time has to be planned (and definately not wasted). Also, keep in mind that each character is harder to play (Bachelor being easiest and Changeling being the hardest).  The game has a rather large world (town) map and a large set of characters, all of whom are unique and have their own agendas. Recources are a large part of the game- exhaustion, hunger and infection. All of these will drop as time goes by and between your seemingly impossible battle against the plague, you'll have to keep a close eye on them. Reputation is also important, for if you're hated in the town, it might cause some problems.  The game is very symbolic. The best example I can give is the three protagonists- the three people that ultimately decide the town's fate. Each of them represent a different view on the world and inevitable clash against one another. Pathologic has amazing soundtrack- one of the most atmospheric soundtracks I've seen in a video game.   Another very unique thing about this game is that it always tries to hurt the player. You may find yourself in a tough spot, so I suggest keeping multiple saves so that you can restart the day if you messed something up.  Pathologic has one of the best plot twists to ever be in a video game. I will not sppoil it, but it is shocking and something you'd never expect.  All of this being said, I can come to a conclusion- this game is a masterpeace. A rather unknown masterpiece, much to my surprise. It has a huge H.P. Lovecraft vibe to it and I recommend this to anyone who likes story driven games.  Beware tho, because Pathologic can be slow and hard- at times, you can wonder around the town without any clue where to go.   Lastly, if you like action driven games and prefer mechanics over story, atmosphere and music, I would say Pathologic isn't for you. PS: I have spent around 40 hours in the game and have completed only 1 storyline. I still have 2 characters I need to play as, so this review i based on Bachelor's story only.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely, if you know what you're getting into.  In terms of narrative, Pathologic is easily one of the most ambitious games out there, not just in the multi-layered way the story is structured but also its ideas (I suggest you don't look these up any further if you're planning to play it -- it's best to go into it blind). There are very few other games like this out there, and most of them by this same studio. However, the rest of the game doesn't live up to the same standard. You could argue that the game is bad at communicating things to you, but I'd say it uses a more realistic/natural way of communication than UI prompts or blatant quest text. A more objective complaint is the graphics, which are bad by modern standards, if you care about that sort of thing, and the gameplay, in spite of all the original ideas it tries to execute, is a bit broken -- but it's not too bad, definitely not as bad as most people/media like to paint it. Ironically, it still manages to be one of the best examples of gameplay-story integration, in my opinion.  But if you don't mind an old-looking, somewhat clunky, very text-heavy game, and especially if you play games for their story, Pathologic is unique.   P.S. If you're doing multiple playthroughs, save Changeling for last.",
            "review_score": "1"
        },
        {
            "review_text": "Pathologic is a lot like a dream in many respects - appropriate, given how I hear it was based on one. Like a dream, it is difficult to describe, and to tell you truly I have significant difficulty recounting the events of the game's story: I can describe them adequately at an entirely superficial level, but bereft of their context their precise meaning is impossible to communicate plainly. In that sense, Pathologic is what I always point to when the question arises of whether video games can be considered art - it bears little similarity in terms of its structure to a film or novel, but instead makes innovative use of the unique characteristic of the medium to tell a story that cannot really exist in any other format.  On the basic level, Pathologic is a game where you amble about at a leisurely pace between various buildings. Sometimes you shoot and cut people, and you'll likely spend a lot of time scrounging for garbage to barter with and the necessities of life. It is slow, sometimes to the point of tedium, sometimes ugly, and curiously uninviting, even foreboding. It is also an incredibly atmospheric, richly layered narrative experience - something that exists not by itself but rather in the process of interaction between the game and the player.  I'd say it's like nothing else in the world - a one-of-a-kind journey. Opening it up just now felt like coming back home for the first time in a very long while.",
            "review_score": "1"
        },
        {
            "review_text": "Being constantly stressed out has never been so enjoyable.  10/10 Would stress out again.",
            "review_score": "1"
        },
        {
            "review_text": "Very much not for everyone but a very good game. Although most of the gameplay (at least in the bachelor campaign) is somewhat of a walking simulator it fits with the games themes very well. Each day you have to complete a series of tasks to try to find a cure to the plauge, but each task is seemingly all the way across the city so each day becomes a frantic and tiring race to each location with the knowledge that you probably don't have enough time or food to complete everything by that day. By day 9 you will be physically worn out and tired of this but so will your character; although that is certainly not fun it fits perfectly in what the game is trying to say in the same way that a horror movie may not be fun but the dread may fit with the themes of the movie. I'm excited to play the other two campaigns; very good game thus far (Note the first campaign took me 25 hours to complete)",
            "review_score": "1"
        },
        {
            "review_text": "its ♥♥♥♥ing metal bro just buy it",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic of videogames. It is a great chance to have opportunity to play it again. Especially, after a lot of improvements. HiRes textures, widescreen support, absolutely new English translation (original translation was not good), and some new visual effects that make game look really good (I remind you that original game was released 10 years ago).",
            "review_score": "1"
        },
        {
            "review_text": "This game seems like it would be REALLY nice....if you have the required taste for it.  This game is a very open world and dialogue based expirience, in which nearly every (or perhaps, literally every) decision you make WILL have consequences. The reason why I couldn't see it through to the end......or even to the second virtual day, is because as said before: it's VERY dialogue based, and anything important in the game is in text dialogue. Not audio. The text is always in the mideval accent, as well. This made most important messages a tad more difficult to decipher.  The combat in this game is perhaps it's lowest point. The combat (from what I have expirienced) is very tedious, because there is no running or blocking mechanic. If you ever get into a strife with a foe, you literally have to hurt this person, take a hit, then hurt this person again. If you lose enough health, you might wanna take a potion, but other than that: there's nothing I can say.   In conclusion: If you want to read a novel and enjoy large open-world maps but do not enjoy action games, then I'd recommend this for you. If however, you are looking for an expirience with good combat mechanics, an easy to follow plot, clearly laid out decisions (with clear consequences), then I'm afraid you've come to the wrong game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the most underrated game ever, even tenshion, knock-knock and carvo are more popular from same developer. And this game is much better of these 3!",
            "review_score": "1"
        },
        {
            "review_text": "I am done. Yes thats how long and entertaining everything was. It is more like a journey into dream / horror rather than a game. I really cannot put into words what I saw what I discovered but it was worth time. I miss some Stamina system though it would add up some reality. Because fights and running is clumsy and slow without it. Also AI likes to block itself in certain places during chases. Few grammar mistakes appears too with conversations ending weird. Yet I forgive it totally because the atmosphere of this game is the only one of a kind. I will be counting days now until my next visit in this God forsaken city.  PS: Waiting system would be nice too since a lot of NPC's are talkative only after 7 AM except Changeling route kinda weirid.",
            "review_score": "1"
        },
        {
            "review_text": "A steal at only $13.",
            "review_score": "1"
        },
        {
            "review_text": "This will either be one of the best or the worst games you'll played. RockPaperShotgun has a great article about it, but I suggest you not to read it before you play the game. I'll not talk about it at lenght, there is a lot to say, but only if you enjoy it and if you do, nothing that I say will matter anyway. Give it a try, whether for good or bad, this is an experience you won't forget.",
            "review_score": "1"
        },
        {
            "review_text": "Holy pogo-sticks, people -- I have just started playing this game but feel it is worth commenting on.   If you care to take the leap keep in mind that the game is going to be experienced in an egine that feels of the era of a well-polished THIEF 1: The Dark Project. This technichal fallback on graphics may be too much for some people to handle, so be warned. That said, I am in awe of what the game seems to be trying to accomplish -- story-wise and in terms of what a game is. I wish there was a run command to or a way to move about the town(s) more quickly, but apparently at least in the beginning it's important for the player to walk. The absolutely mundane crash with the COMPLETELY SURREAL with an odd nonchalance, making me wonder if the whole game is supposed to be a dream, or alternate plane, or who knows.   Sadly, the fact that a million games coming after Pathologic have not seemed to borrow from it. I can already tell aspects of it might sag under it's own weight -- but I'm with-holding judgement until I get a bit farther. Atmospherically and voice-talent wise... as well as the ambitions of the game give me a very strong first impression.   The idea that there is an invisible cat I can only meet in the factory district at night and perhaps only on day 1 intrigues me... and the game suggests that a lot of weird stuff happens at specific times, much of which you are likely to miss. Very strange concept for a game -- progression though the content you are ABLE to witness, as opposed to showing you everything and leaving nothing to the imagination. Life isn't like the latter, so the idea of a game trying to be more like life in a temporal/reality sense is quite impressive. Will update review when I can honestly pass judgement. Right now I'm down the rabbit-hole, but give it a positive benefit of the doubt.",
            "review_score": "1"
        },
        {
            "review_text": "Explore a city full of ♥♥♥♥♥♥♥ as you find out why the ♥♥♥♥ the guy who invited you to his party is already dead.  Find the out the killer in world that passes through in real time. Sleep, eat, get diahrea, and die from the common cold.  There's monsters and ♥♥♥♥♥♥s. kill em with your fist.  it's a pretty good game.",
            "review_score": "1"
        },
        {
            "review_text": "An intense dive into a strange, quirky world shrouded in cosmic mystery.",
            "review_score": "1"
        },
        {
            "review_text": "Some black thing with a white head suddenly attacked me. I've never gotten so scared in my whole life what the ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "This is the most mind numbing game I have ever played. It's dialog heavy and there's a ton of reading, which is fine I was expecting it. However the way its written is long winded with little to no information given. It's like someone went overboard with the thesaurus on Microsoft Word because they wanted to sound smart. One character told me about building my reputation and after a paragraph or two telling me advice her mom gave her she said I needed to do good deeds, but I couldn't do that because my reputation was too low. After all that the only information I gained was that at some point in her life she had a mother. The characters had no personality whatsoever either, it was like I was talking to the same blabbering windbag over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "Hey kids! Wanna visit Russian silent hill? Wanna visit a wonderful town where you can meet ovegrown Tonberry from final fantasy and nobody doesn't care about it? Want to live a life of a homeless man? Well, then this game Is for you! In all seriousness, this game is typically not fun, for me personally. There is a WAY too many aspects of it that you have to care about to survive, and it kills all enjoyment, because instead of exploring a haunted town and talk to characters you have to bother about your survival. Wich would not be a problem if you wouldn't burdened by six life-threatning bars.  Narrativly It feels more like a novel written by Dostoyevski. Problem is I not a fan of him at all. I know he is terribly popular in foreign countries, but not so much in mine. I have to say that there is a lot of interesting separate storylines... wich are ruined by terribly written characters, who are way too busy to whine about life instaed of helping you to solve THEIR problems. So, yeah. Be aware that thi game is not for everyone. Not for me, that's for sure",
            "review_score": "-1"
        },
        {
            "review_text": "Fatalistic themes, a lingering sense of dread, and quite the long walk.  +The atmosphere is top-notch. You're in an uphill battle, and almost everything in this version works to the benefit of the product. +Better translation. --While infamous for its creepily pseudo-english start, I much prefer this translation. It conveys the tone and overall theme a bit better, in a digestible format. +If you enjoy a good book, or can get engrossed in a story, this's for you. The main actors in this 'play' are fleshed out to a pretty insightful extent, reflecting the complexities of the noble (Or 'tribal') classes (Or 'castes') in this foreign, alien setting.  -The game itself suffers from some design flaws from the get-go, unless my drivers and cards are working against me, environmental lighting occasionally flickers violently in the worst possible situation. -The combat. It would be gloriously brutal if it were more... Streamlined. (Not arguing to be MORE combat-oriented, but flow better.) -Certain points of the plot need to be explained better to avoid confusion. (Such as when you're Daniil, and suddenly no-one is giving you the option to take their blood sample because you spoke to someone for just a moment.)  I will admit that replaying this game is quite... Hard. You know certain twists are coming, and you know how things work. I bought this remake on steam to see the better translation and what was changed.  Same game, better skin, better writing. I bought this to support the devs, they did great. Looking forward to the remake.",
            "review_score": "1"
        }
    ]
}