{
    "app_id": 38410,
    "name": "Fallout 2: A Post Nuclear Role Playing Game",
    "release_date": "2009-08-19",
    "developer": [
        "Black Isle Studios"
    ],
    "publisher": [
        "Bethesda Softworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Post-apocalyptic",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 4758,
    "negative_ratings": 321,
    "price": 7.99,
    "description": "Fallout® 2 is the sequel to the critically acclaimed game that took RPG'ing out of the dungeons and into a dynamic, apocalyptic retro-future. It's been 80 long years since your ancestors trod across the wastelands.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/38410/header.jpg?t=1447352408",
    "minimum_requirements": "OS: Windows Processor: Pentium 90Mhz or faster Memory: 16 MB  Graphics: SVGA DirectX®: Any DirectX Hard Drive: 565 MB Sound: DirectSound or SoundBlaster Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "THIS GAME.  THIS ♥♥♥♥ING GAME.  BUYING THIS GAME WAS ONE OF THE WORST MISTAKES I EVER MADE.   I started this game up expecting to have a good time, as I did with the other Fallout games. I'd played Fallout 1, and I'd heard from almost everyone that Fallout 2 was FAR superior. I throroughly enjoyed Fallout 1, but my main problem with it was that the game was timed, and practically forced you to rush through it. Because of this, I felt as though my experience with the game was cut short. The main thing I was looking for when I started playing Fallout 2 was a lengthier game that would allow me to explore and progress at my own pace.  I got more than I could have ever hoped for.  The game started out slow, much like many other RPGs, and frankly, it was a bit boring for the first few hours. But I knew from my previous experiences that Fallout games only get better as you progress. I made it through the first few areas, and started getting a feel for how things worked, finding plenty of new quests, etc. It was becoming rather enjoyable, then I got the car, which would allow me to carry more things, and explore the wasteland with much more ease. It was very exciting, almost like getting my first car all over again. And at that point I was hooked.  Everything from that point on is a bit of a blur, I remember traveling from city to city, back and forth, looking for every quest I could possibly find. The process of finding better and better gear for my three companions was addicting, the process of ensuring the prosperity of all the settlements was addicting, the atmosphere is addicting, becoming famous for various reasons across the wasteland was addicting, the fact that the game goes into so much detail and lets you influence the way things play out was addicting. EVERYTHING ABOUT THIS GAME IS ADDICTING!  I couldn't help it, hours and hours of my life were being sucked away, and there was nothing I could to about it except keep playing. IT WAS AMAZING.  The final toll was a little over 66 hours for me. And that was all spent on a single playthrough. When I FINALLY beat the game, I felt a feeling of happiness and satisfaction that I haven't felt in YEARS. But most of all, I felt an overwhelming sense of FREEDOM. NO LONGER WAS I SHACKLED BY ITS IMMENSE QUALITY, BY ITS SHEER BEAUTY. I will never play this game for the first time again, that makes me both relieved and depressed. Depressed, because this game is phenomenal, because it is one of the best games I ever played. But relieved, because I will never lose that many hours that quickly ever again.  This game is a true gem. It is an incredible, immersive experience even by today's standards, and in fact, shïts all over most modern RPGs.  That's the problem, though, this game is TOO GOOD. DO NOT PLAY THIS GAME UNLESS YOU HAVE ABSOLUTELY NOTHING TO LOSE.     Now if you'll excuse me, I'm gonna start my evil playthough.",
            "review_score": "1"
        },
        {
            "review_text": "You can be a pornstar. 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "some ♥♥♥♥in scary ♥♥♥ shit in this there was an explosion and some ghouls and some robot dudes at one point careful ♥♥♥♥♥ it pretty scary",
            "review_score": "1"
        },
        {
            "review_text": "Just over a decade ago, life was simpler and more frivolous, so every fictional discovery was fascinating and entertaining. It was in that simple, mid-teenage life, that I dug Fallout 2 out of a fortunate coincidence. A disc copy of the game, in a modest gaming magazine, to whose cover it was poorly attached. It seemed interesting enough, and with little knowledge of cRPGs or English, I went home and gave it a try. Boy, was I enthralled by this game. A game which would, about ten years later, still be the most cherished piece of gaming I have ever experienced.   Fallout 2 ventures deep into the dark territories of humour and morbidity. Not many have the grit for its atmosphere, inauspicious and heavy as it is, its dense soundtrack that evinces feelings of gloomy solitude and decadence; exactly the vibe you have got to be in when playing any Fallout title, for that matter. Back when I first tried it, I would engage in conflicts between the curiosity to explore its narrative and the uneasiness caused by that very atmosphere, even after having previously and briefly tried Planescape: Torment - an equally dense game. Fortunately for me, I got past that.  Provided that you can also overcome such uneasiness, you've got an unparallelled RPG challenge ahead of you. Fallout 2, very much like its predecessor, is beautifully written, and cleverly designed in a way that connects your actions to the realities and contextual changes of Northern California as you go. The turn-based combat is typical late-90s cRPG gold. The S.P.E.C.I.A.L role-playing system, a jewel derived from Gurps, offers you that edge of character construction and skill management that makes a bonafide RPG pleasurable. The post-apocalyptic setting and aesthetics, built on the famous premise of the Divergence - the historical fragmentation in which the fictional linearity of the game took a different course from that of our world in the heat of the Cold War, leaving the former with that futuristic-50s style -, renders Fallout's identity unique and typically dark humoured. Its characters are deeply unpredictable and credible, especially the companions, much more mature than those of the previous installment (with all due respect to the likes of Ian and Dogmeat). The game leaves that bitter feeling of longing in the player's mouth should they pass away or have to be left behind for some reason. Each companion adds to the player's enterprise, each has their own story, each has their own passions and motivations. And flaws.  Fallout 2 appeals to multiple audiences. Those looking for an RPG; those looking for a post-apocalyptic piece; those looking for a story-driven game; those looking for open-world dynamic narratives; those looking for a demi-horror title; and so forth. While it may not touch some of these categories in depth, it is a game that brings them all to a perfect harmony. Be ready for a challenge, an unforgiving gameplay, but be also ready for enriching rewards that will open your mind to new spheres of role-playing gaming.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite video game of all time.  There are only 3 reasons why you should not play this game  1: if you've never played Fallout 1. 2: if you've played Fallout 1 but hated it. (you disgrace) 3: if you hate turnbased rpg's.   other than that, you have no excuse to not play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the only games where you're feasibly able to punch your way through everything. I ♥♥♥♥ing punched a dude in the solar plexus. Do you know where that is? I had to look that ♥♥♥♥ up. Apparently it's a part of your abdomen that controls nerves. What it has to do with the freaking sun, I have no idea. I still LEARNED.   You think Fallout 3/New Vegas was the ♥♥♥♥ just because you cut people's heads off with bullets with the velocity and precision of a medieval executioner's chopping axe? Hell no, people turn into red ♥♥♥♥♥♥♥t on the road with the punches you'll be throwing. If you gun 'em down, then they get the Robocop treatment and lose like, 90% of their torso.  And also, you can aim for the eyes, or go testicle hunting in V.A.T.S   11/10, would travel to San Fran and stop Scientology with my head exploding, window washing karate again.",
            "review_score": "1"
        },
        {
            "review_text": "My wastleland team consists of:  A Tribal (me), An Overweight repair man, A Zombie doctor, A Mutant sheriff, A Cybernetic dog and a perverted teenager that makes drugs  This is the best game I've played in a long while. ",
            "review_score": "1"
        },
        {
            "review_text": "Before i start the review i would like to give you a overview of what i will speak about in the review   Fallout 1  Fallout 2  Fallout 3  Fallout NV  and maybe Fallout 4 if i feel i need to   Story  Fallout 2 is set 80 years after the events of Fallout 1 and you are the grandchild of the 1st games's protaganist the vault dweller you are the chosen one of your village Arroyo tasked with finding a G.E.C.K to help save your village.  Gameplay  Fallout 2's gameplay may not be appealing to the modern genration but once you become familiar with the combat system and the fact that all quests are unmarked the game becomes excellent Fallout 2 sticks to the formula of the first game you can tell this because the games play virtually the same.  For me Fallout 2 was definatley more challenging than Fallout 1 and definatley more challening than the newer Fallout 3 and FNV this brings me onto my next point  Why i personally think fallout 1,2 and NV are better than 3 and 4  Personally i think 2 and NV are the best games in the franchise for me Fallout 2 engrosed me into the deaper lore and decisions of the game along with the backstory. When i comes to the ending of Fallout 3 there is only one major outcome of the game (Im not going to spoil if some of you havent played Fallout 3) and the end credits just talk about what sort of person you were in the game. Whereas in Fallout 1,2 and NV the way you handle quests in different areas and your actions in these areas affect the areas future in a deaper manner. for example Fallout 1,2 and new vegas in the end credit scence you hear things like 'Your involvment in this town and how you did this mean the town prospered or the town was quickly eradicated' Wheras in fallout 3 this isnt there.   General overview of Fallout 2   Fallout 2 is a timeless classic of the Fallout franchise and for those who consider themselves die hard fans of the fallout series you should get this game also if you do get the game also download the resteration patch from the No mutants allowed forum it adds cut content into the game and fixes bugs and generally makes the game better overall  Note: In no way in this review am i hating on Fallout 3 i think Fallout 3 is a brilliant game and i recommend it to anyone but i do not think of it as a Fallout game that stays true to the originals like Fallout New Vegas did   Thank you for taking the time to read this review",
            "review_score": "1"
        },
        {
            "review_text": "Still the best after all these years. Do yourself a favour and buy this instead of Fallout 4.",
            "review_score": "1"
        },
        {
            "review_text": "  I beat this game as a kid (and the First One, and i still play it as a man.)   -This game just stays classy. Post-Apocolyptic, Chaotic World. I wish the new Fallouts still resembled this fully as the original game designers intended fallout to be.    Sex, Drugs, Alcohol, Guns, Mutants, Raiders.   - I loved this because you can be bad, and kill every thing in your path. There are no such things as invincible people.    *Bethesda* {cough, cough}   - This killed the new fallouts for me.  -Any Ways, Get past the slow game play and the graphics and you have this wonderous story line. -  -You have almost everything you can imagine, hell on earth with out the demons and of course satan. (Well i guess you could play as satan) -Anyways just remember this isn't really a review just a little bull  Got You!   and just a little speel on how great this game is.    War, War Never Changes.",
            "review_score": "1"
        },
        {
            "review_text": "In fallout 2 theres alot of things you can do, such as  1. become a pornstar 2. kill kids 3. force kids to become pornstars 4. drive a car 5. inteligent deathclaws 6. online multiplayer (its a mod) 7. KILL EVERYTHING 8. Robot dog! 10. fun gameplay! 11. notice i left out 9 12. now im just wasting your time 13. dis gayme r good 14. buy it now... im waiting 15. notice i forgot 9   Its one hell of a blast from the past!",
            "review_score": "1"
        },
        {
            "review_text": "Nearly twenty years after the fact, this is still my favorite RPG. With the exception of New Vegas, this was the last official Fallout game in which the skill system was, in fact, meaningful and had a significant effect on gameplay.  Do you want to be something of a pacifist, with high speech, intelligence, and survivalist skills who runs for cover at the first sign of a fight and has his companions do all the heavy lifting for him? Go for it, Skeeter.  How about a post-apocalyptic hard-♥♥♥ who just wants to make a living skinning giant geckos and selling off discarded raider gear? You can do that too. The game does have a story and it is actually pretty good, but you're likely going to spend more time doing just about everything else than you are folliwng the main plot, and that is a very good thing.  The graphics have not aged particularly well, and the game takes some minor adjusting on a modern rig in order to make it work and look properly, but seriously, don't let that stop you. Once you get used to the visual style, the pixel hunt-like searches for items dropped on the floor becomes the least of your concerrns.  You will be far more interested in the cavalcade of goodies that's just fallen to the ground alongside the raider whose chest you've blasted a whole clear through.  Also you can murder children, and acquire a perk which reflects said habit of killing children. Game of the year, all years.",
            "review_score": "1"
        },
        {
            "review_text": "my favorite of all times- finished this 45 times since it's original release date- going for no. 46 completion ;)",
            "review_score": "1"
        },
        {
            "review_text": "Got hooked on jet and killed the creator.",
            "review_score": "1"
        },
        {
            "review_text": "I shot a child in the head. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Oh Fallout 2, where to begin? So first off I recommend this game to anyone who loves a good story, It is actually by far one of the best stories I know (Fallout 4's story is crap in my opinion so get over it) I've played all the Fallout games and currently own all but one. Fallout 2 is a game I enjoy playing( though I don't play very often and don't have many hours on my account) It's very enjoyable and for it's time was a very advanced game. My one wish right now is to see this game and the first one remade into first and third person games...while leaving the story totally untouched, Hopefully Bethesda (and maybe Obsidian) do remake this game (And yes I know that they likely have to get permission from interplay given the games were made by them) Even if that doesn't happen I want bethesda to take a big slab of pages for the next game they make...Fallout 4 needs work bad...I don't want the same mistake made on their next game",
            "review_score": "1"
        },
        {
            "review_text": "The hype is spot on for this classic, it actually is not blind nostalgia when it is said that this game allows for far more role-playing than every other video game in existence.  Fallout 2 is not bound by modern day game design limitations and rules, it does things modern games are afraid to do. It was designed by the most talented game studio of all time, Black Isle Studios, with much of the excellence being on showcase in Planescape: Torment which was released the following year. Largely a different kind of excellence, but both games are so much more original and limitless than anything today. Everything you do in Fallout 2 leads to some reaction, big or small, but usually somewhat realistic. When playing the game you have to think twice about what you say and how you act.   Keep talking to someone who doesn't want to be bothered, and there may actually be consequences. Sneak around in the open and people will question you. Walk around with a weapon equipped in certain places and you may find yourself being fired upon. Throw away First Citizen Lynette's trust and say goodbye to Vault City forever. Become a boxing champion in New Reno and you will be famous and respected in that area, with the townsfolk calling you 'Champ' most of the time. Play as a cold blooded, ruthless killer and you will be feared and certain quests will open up to you while others will become unavailable. Finish the main quest in a positive way and you will be hailed a hero in most places. Play as a low intelligence character and watch the whole game transform appropriately (look it up on YouTube if you must). The list goes on, these are just some examples of the attention to detail in Fallout 2 that no other game exhibits.  Fallout 2 is also a very good satire, less serious than its modern counterparts. If you've only played Fallout 3 and Fallout 4 then you've barely experienced Fallout. New Vegas is an impressive sequel however, but still more 'gamey' and with less role-playing.",
            "review_score": "1"
        },
        {
            "review_text": "War. War never changes.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Lots of content and branching quests. Even if your build isn't particularly adept at combat, you can get through the game in other ways. Good writing, gameplay, and world building. A must play for any fallout fan.",
            "review_score": "1"
        },
        {
            "review_text": "It's 2016 and I'm playing this game, that says it all.",
            "review_score": "1"
        },
        {
            "review_text": "You can become a porn star and enslave people.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "First 10 minutes: You missed. You missed. Scorpian missed. You missed. Out of action points. Scorpian hits you for 5 points. 'Your bones are scraped clean by the desolate wind. Your Vault will now surely die... as you have...' *Exits game* 11/10 would miss again",
            "review_score": "1"
        },
        {
            "review_text": "Whew, this game. I could make a big frickin' list about the cool stuff here (plus killap's Restoration Project, which is a ♥♥♥♥in' awesome mod), but I am too lazy to do that. What I will say, though, is that you should definitely play Fallout before trying out Fallout 2 because of the story, obviously (if you don't care about story, I don't know what you're doing here), and also for the better introduction to the gameplay system and game that Fallout gives. Fallout 2 is harder, longer, and has way more quests and content, of course. I mean, damn, dude, in Fallout, you start with a gun, some ammo, stimpacks, a knife, fighting some silly weak rats. In Fallout 2, you're a tribal with nothing else other than a spear, fighting giant ants. It shouldn't be a big deal for players who are used to it, but I've seen people complaining about dying way too much at the beginning of Fallout 2 (and guess what, a lot of them never even played the first one!). I think I've played and finished this game more than enough to say that I loved it, and I still do, as I enjoy playing it from time to time, and try some different cool builds. I'm not an old school gamer, but I still feel a great compassion for this game, which I truly think is well-made. (Guess I'm not so lazy at all, seeing as I took the time to at least write a bit about this cool game.) Totally recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Harold?!?! Harold!!!",
            "review_score": "1"
        },
        {
            "review_text": "When I played I was a BLAST, it was the first one of the RPG games I've ever played, and as the people say you'll always remember the first one. It is a highlight in the RPG business. Realistically I have no words to qualify this one if I could I'll give it a 100 or even a 1000. Please have in mind that the interface is an old one nothing like the ones we are used now please be patient it will be worth it I promise",
            "review_score": "1"
        },
        {
            "review_text": "choices matter",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games ever made",
            "review_score": "1"
        },
        {
            "review_text": "It may have a slow start, but it only gets better from there.",
            "review_score": "1"
        },
        {
            "review_text": "BEAT GAME EVER AWESOME OLD SCHOOL GAME U CAN PLAY IT FOR MONTHS AN STILL HAVE FUN",
            "review_score": "1"
        },
        {
            "review_text": "Another true classic. (I have owned three different copies of this game to support this claim.)  To get the most out of your gaming experience, be sure to check out the best fan/mod community for this game 'No Mutants Allowed':  www.nma-fallout.com    Here you can find an unoffical patch to fix bugs, improve graphics and gameplay ' and restore many elements of the game that were left out by the developers due to constraints.. Even better, you can also consider the 'Resortation Project' or other Mods to get more out of your Fallout 2 gaming experience.",
            "review_score": "1"
        },
        {
            "review_text": " The second post-apocalyptic classic.   As you may have already noticed from the screenshots, Fallout 2 is very similar to its predecessor. Not only in terms of the interface, gameplay or graphics, but also the story itself. Or at least, I would say so.  Once you create your character with whatever abilities and skills you decide you want, you will enter the wasteland once again as a person from Arroyo, a village that was started about 80 years ago by the Vault Dweller, the main character of the original Fallout.  Your main goal is to find a very important item that could save your people who are sick and diseased, and it is up to you how you cope with that quest. And if you decide to accept your fate and indeed go on this quest to find not only the item that is needed, but also the truth about many things you simply cannot help but wonder about, then prepare for a heck of a ride.  I, personally, have enjoyed the first game a bit more, but the atmosphere is still there and if you liked the original, you are going to like this as well. Definitely.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Much better than both New Vegas and Fallout 3 combined I woukd say. A bold statement, Yes, but a must have for any fallout fan. The graphical integrity and how the game runs is just fantastic one could possibly even say that falout 3 was just a minor step on the the step ladder when it comes to graphical quality but most definatly a step down when it comes to the story. The story involved you searching for the G.E.C.K. device to save your tribe from disease but of course on your way you come across many obstacles and obstructions as you are looking for the G.E.C.K. 11/10, Must have, Game of the century, Perhaps the game of the universe.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game....SO far Due to the fact I am a fan of the later games. I didn't enjoy it as much but still liked it. The turn based combat I found wasn't that good..But the story was great! However I recommend this Game To people who played it in the 90s or people who want to learn more about the fallout story. I do not recommend this game to people who Only like the new games and think the old ones suck.",
            "review_score": "1"
        },
        {
            "review_text": "It's definitely harder to get into than Fallout 1, but in the end it's worth it. Whereas Fallout 1 drew me right in from the start, I had to force myself through the first couple hours of Fallout 2, but it was worth it. What you find is a game with everything that Fallout 1 did right, (the atmosphere, the characters, the immersion, the story) and added onto it with a bigger environment, more things to do, more items, and a generally longer and more diverse gaming experience. Highly recommended to anybody who can appreciate an older game.  NOTE: If using windows 7, the colours will most likely look really distorted when you launch the game. This makes the game unplayable, but it can be easily 'fixed' by closing explorer.exe when you run the game.",
            "review_score": "1"
        },
        {
            "review_text": "Don't believe the 'Time Spent' counter. I have put in about 100+ hours into this game on other versions. Now that I got that ♥♥♥♥ out of the way, all I have to say is that Fallout 2 is one of the best RPGs of all time, and if you love RPGs, you better get it however you can, because it is well worth the time you put into it, for it has the following:  - An open ended world that feels just like the real world, involving drugs, sex, politics and much, much more.  - The same good ol' gameplay that the first game had, but with much improvement.  - A story that ♥♥♥♥♥ on a lot of other stories not just in RPGs, but video games in general, with plenty of interesting and quirky characters.  - Tons of interesting side quests, including a side quest to blow up an outhouse in order to get a watch from a giant ♥♥♥ rat.  - The ability to become a porn star (come on, you know you wanna be one).  Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and story but to many hookers at such high prices 1/10 Ign",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to: Put a dynamite in a toilet and blow it up? Become a pornstar? Marry? Divorce? Irritate sergeant because you got no power armor? Get sad and just take drugs?  Then seek help, this game will consume you.",
            "review_score": "1"
        },
        {
            "review_text": "Classic. Hours and hours of fun. Great atmosphere, great gameplay. Probably the best dialogues in any game I've ever played. Best Fallout game for me.  Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 2 is the best Fallout game in the series hands down. You should play it, more then once.. And do every side quest because this game has so much to give and will leave you happy for hours. Buy it, play it. Replay it. And then RECOMMEND it too ALL your FRIENDS.",
            "review_score": "1"
        },
        {
            "review_text": "Now that Interplay has lost the rights to Bethesda, the new ownership has decided to patch the glitch that would cause your game to black out every few minutes and/or the random rainbowish colors that would be there in error due to the incompatibility problems caused by newer systems. This pretty much saves you a few minutes if you couldn't figure out the problem yourself online. Nonetheless, the game itself has an enriching storyline that even pleases graphics-spoiled gamers like me. I would really recommend this to anyone who has played any part of the newer fallout series such as Fallout 3 and Fallout: New Vegas but wants to know the backstories to various references in the newer games, such as the origin of Marcus at Jacobstown in Fallout: New Vegas or Harold at the Oasis in Fallout 3. Overall I would recommend this to anyone who is looking for fun games in general.",
            "review_score": "1"
        },
        {
            "review_text": "Much like its predecessor, Fallout 2 is, in my opinion, the best game in the franchise and is a must for both new and old players.",
            "review_score": "1"
        },
        {
            "review_text": "At first I was really really sceptical about it because its such an old and somewhat clunky game for todays standards which CAN throw you off, especially in the beginning. Same happened to me. Long time fallout fan but never played 1&amp;2. At first its very difficult. Combats in early levels are such hardcore RNG based. But after a while you realize you dont have to fight everything at all. This game doesnt force you to fight like 3 and 4 did.  Anyway, if you get past the clunkiness and stuff you are in for a great and very atmospheric/immersive game. Loving it by far now!",
            "review_score": "1"
        },
        {
            "review_text": "Best post-apocalypse ever. I'm playing it all my life. Uh...strange feel.",
            "review_score": "1"
        },
        {
            "review_text": "let's me stab children in the groin, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the greatest RPGs of all time. Riddled with dark humor and really dark themes it allows the player to find hilarity in some pretty awful stuff. Includes things like heavy drug use, sex (a fair amount of it), and copious violence (you can kill kids). Pop culture references that are still relevant today albeit in a darker context. All around a must play.",
            "review_score": "1"
        },
        {
            "review_text": "just like the first one but with more stuff to do!",
            "review_score": "1"
        },
        {
            "review_text": "I r8 8/8 missed 8 times in a row, accidentally shot self with bb gun Fallout 2=pranks in the wasteland gone wrong, (almost shot) (GONESEXUAL) (IN THE HOOD) (YOU WON'T BELIEVE WHAT HAPPENS AT THE END)",
            "review_score": "1"
        },
        {
            "review_text": "You can be a pornstar 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Last play this game 12 Years ago this game still adict fun to play and legend !",
            "review_score": "1"
        },
        {
            "review_text": "The most awesome game in the whole galaxy. Played it for about 5 years in a row",
            "review_score": "1"
        },
        {
            "review_text": "A must play for fallout fans Be sure to pick up fan mods to get it to work on a modern system",
            "review_score": "1"
        },
        {
            "review_text": "This game is HUGE, actually it was really too long for me and the mid-end game was really painful for me to play. Never wanted so much for a game to finish !  A very good game nonetheless, didn't like the tribal thing at all but the rest is okay, i still prefer the 1st which has a better post-apocalyptic atmosphere IHMO.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but the combat system did not age well. All other elements are great.",
            "review_score": "1"
        },
        {
            "review_text": "you can kill children in this game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "In some ways, this is a direct improvement over the first. There is more stuff to do, more stuff to unlock, bigger map, etc. The character customization is deeper. That's all fine.  However, what I appreciated about the first game were its simple objectives with various free-form solutions. Fallout 2 seems to strip these away in favor of increasingly complex and awkward quests. Often, they will require speaking with specific characters who are almost indistinguishable from other, less important NPCs, and doing so in a specific procedure. The Gecko Power Plant quest is a good example of how this, combined with a lot of tedious running around, results in a tiresome game of 'who's who'. Of course, the player usually has a choice in these sorts of situations to take a moral shortcut for negative karma, but the rewards for pursuing a 'good' outcome pretty much always outweigh the rewards for 'bad' behavior. I prefer to finish quests in as complete a fashion as I can, but their weird, constricted structure here bores and angers me.  Other times, logic is sacrificed for the sake of creating gameplay. I understand that Vault 13, literally a hole in the side of a mountain, could be easily ignored, but if this Pipboy is the same one that belonged to the Vault Dweller, wouldn't it make sense for the locations canonically visited in the previous game to be on it already? At least the military base should be on there, if not the vault, but at least it's not hidden to the point of requiring a quest for exploration; Speaking of bases, what about the Sierra Army Depot? It sounds and looks like it would be big enough to be noticed just by going near it, but nope, it only appears when a certain quest is activated. There's also the Enclave power armor that's good at fooling Enclave soldiers in every situation save for the map's random events, but whatever, I'm sure someone with nothing better to do has come up with an explanation for all this. Bottom line is, the first game did not do this sort of thing. It let the player reap the full benefits of accidental discovery.  A large map is good, but the random events happen WAY too often. I breathe less often than I encounter something on the map screen. Almost every time, the enemies appearing in these events are too hard (instant death), too plentiful (slow, agonizing death), or easily outrun (waste of time). Save scumming becomes a necessity for travelling through particularly brutal areas, such as the region around Navarro, where movement needs to be taken an inch at a time, lest I come across a patrol and get a one-way ticket to the game over screen. Get the car, because that ♥♥♥♥ happens a lot less often, although there is still the occasional stop made involuntary for whatever reason.  Overall, the game is representative of living in modern day California; It's buggy (frame drops, some crashing), very disorganized, and constantly frustrating, but it has its moments, and it gets more fun after the first few hours. Bigger? Yes. Better? Maybe. It's still worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "An outstanding follow-up to the original PC RPG classic, Fallout 2 has violence and charm in spades. It's one of those rare sequels that improves upon the original while still leaving the first game with a feeling of its own.  There is no other series of games apart from the Fallout universe that I've spent more time in. Every character you roll up can have a completely new experience.  Also, you can kill children. How ♥♥♥♥ed up is that?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best from the Fallout series. I loved how you went to the oil rig platform to dispatch the president. It was a great experience to roam the wasteland in search of GECK. Its an dated graphical masterpiece and I consider it must play.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed playing it more than 90% of the new games. Epic content, story and characters.",
            "review_score": "1"
        },
        {
            "review_text": "More of the same. It's hard to find a bad thing to say about the fallout series.",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 2 Where do I begin? In my honest opinion this is the best Fallout game I've ever played, sure the gameplay aspects are a little outdated but the RPG elments are the best, full stop. Also unlike Betsheda's Fallouts you can kill anyone, and I mean everyone so yes that includes kids.  YES YOU CAN KILL KIDS!!!!!!!!!!!!! P.S I do have short play time but that's only because I lost my origanl CD when I moved recently, so I had to buy it on steam. Totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing. Everything you want from a RPG is here.",
            "review_score": "1"
        },
        {
            "review_text": "Jesus Christ this game is hilarious. Buy it. Buy the whole damn collection!",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best fallout game I've ever played. If you liked new vegas you'll like this game",
            "review_score": "1"
        },
        {
            "review_text": "Still my favorite game of all time. Stands up to the test of time. Make sure you get the restoration mod, it adds hours of entertaiment and some really neat locations.",
            "review_score": "1"
        },
        {
            "review_text": "The new ones are great, fantastic even. But honestly, this one was the best of them all.",
            "review_score": "1"
        },
        {
            "review_text": "TFW when 'You critically struck for 0 damage.' Welcome to Fallout 2.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, while it may seem clunky at first it is quite easy to get the hang of things.",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 4 is a great game, but it is not a great Fallout game.  Fallout 2, this game right here, was the first truly post-apocalyptic RPG where every choice had consequences, your character stats mattered, and the replayability of another character was NOT just cookie-cutter. You could actually build a character too weak to survive the first zone, instead of just doing 10% more damage with weapom type x.  You most certainly did not get laser weapons, power armor, and a minigun to kill a deathclaw from an elevated position in your first play session. Your choices did not all result in the same outcome, nobody held your hand through a tutorial (in fact, you probably died in the first 5 minutes), and you the player could not over-ride your character's abilities by aiming better or jumping on top of something or or or ...  I only have 41.3 hrs on record with the Steam re-release. However, I have two worn-out CD-ROM discs, a playable third in a binder, a GoG version somewhere, and a very real understanding of video game addiction.",
            "review_score": "1"
        },
        {
            "review_text": "A post-apocalyptic turn-based RPG like no other.  This game is a classic. I've put in hundreds of hours in it playing different ways with different characters before I added it to my steam library (I own the discs for 1 and 2).  The game has a good mix of stat/skill building and loot collection. For its time, the cutscenes are pretty good. There's little to be desired in such a classic game. The ability to choose your path in this game is beyond astounding for such an old game. If you remember when Fable came out, people freaked out because you could choose your own path. Fallout has done that stuff way before such games. If you like to be a jerk or a good guy, you can do either to your hearts content.  Fallout has some of the most memorable designs and lore of any post-apocalyptic setting I've seen, and I would definitely recommend it for anyone who enjoys a good turn-based, isometric RPG romp.  Easily a 10/10 game. As good in my childhood as it is in my adulthood, a timeless classic.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, 100's of hours of content and very fun. 10/10   Make sure you get the Restoration Project, adds LOTS of cut content into the game. I can't play without it.",
            "review_score": "1"
        },
        {
            "review_text": "If you're getting the compatibility error, download the restoration project from no mutants allowed. It'll fix that and many other bugs interplay never got.",
            "review_score": "1"
        },
        {
            "review_text": "Fallout franchise is legend for me maybe last games didnt give us what we expected but fallout 2 is rise of the legend.",
            "review_score": "1"
        },
        {
            "review_text": "fallout 2 enough said",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing amazing game fav game now asides from.majoras mask",
            "review_score": "1"
        },
        {
            "review_text": "Fall-out, baybee!",
            "review_score": "1"
        },
        {
            "review_text": "Good but not as good as the first Fallout.",
            "review_score": "1"
        },
        {
            "review_text": "This one is a gem, a very underrated gem. Everything about this game is great. The old school feel is right there. I could say a lot about this game but hey, I don't need to tell you any reasons why you should play this game, what are you waiting for? Just buy it and play it already.  It would be amazing if they could make more games like this one  9.5/10 I would suggest it to any apocalyptic, Fallout, WRPG, classic, open world, isometric, turn-based, atmospheric and retro fans.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;played fallout 1 &gt;play fallout 2 &gt;watch opening cutscene &gt;make pimp character focused on talking way out of problems &gt;i am the chosen one &gt;the chosen one must go through temple filled with agressive beasts &gt;fyi they send someone with no combat experience into this temple &gt;try to leave &gt;♥♥♥♥♥ tells me i gotta stay &gt;fight some things &gt;find out i have spear &gt;equip &gt;throw &gt;miss &gt;its literally gone forever &gt;find another spear &gt;decide to throw aswell &gt;miss &gt;also gone forever &gt;door that needs to be blown up &gt;accidently pick timed explosive up &gt;panic in inventory &gt;fails at dropping it &gt;5 seconds until explosion &gt;drop &gt;run &gt;somehow live &gt;seriouslythoughtimedexplosivesarea♥♥♥♥ingnightmaretheamountoftimesiblewmyselfupinfallout1isinsane &gt;manage to get to the end &gt;convince noob not to fight me &gt;epic cutscene about a suit &gt;finally out of temple &gt;save &gt;ask villiage elder why she try to kill me with temple of ♥♥♥♥♥♥♥t &gt;the chosen one must be experienced in combat &gt;Y AM I THE CHOSEN ONE &gt;I HAVE NO COMBAT EXPERIENCE &gt;idiot elder &gt;find man that speaks in riddles &gt;he is almost impossible to understand &gt;he wants me to weed his garden &gt;i accept &gt;the plants are agressive &gt;i die &gt;reload save &gt;do everything again &gt;acually suceed in weeding garden &gt;♥♥♥♥♥♥♥♥ asks me to bring him flint to sharpen my spear &gt;fyi i have no spear &gt;i get flint &gt;he questions why i have no spear but gives me one of his &gt;lesson learned: dont throw spears &gt;go to town &gt;meet drunk &gt;he asks for money &gt;i say don't spend money on bear &gt;i am a scum according to him &gt;i give money to repent for my sins &gt;he gives lots of info &gt;still has no idea whats going on in town &gt;find out man is missing in cave &gt;go to cave &gt;2 white geckos &gt;ez xp &gt;2 golden geckos &gt;ez-dead &gt;no &gt;save &gt;WHY          10/10",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe I haven't got round to writing a review for this game already! Fallout is a role playing game with an excellent story run throughout the series. This game is one of the best games I have ever played and it is a game that you can simply play through time and time again not only due to a wide range of choices but a story that you will want to hear again and again, admittedly the controls up until fallout 3 have been a bit primative and lack luster but they work if you're willing to give them a prod and experiment. Fallout 2 is an excellent addition to this series but the game either is for you or is not and with the excessive amount of bugs, primative style of controls and lacking graphics compared to todays top RPG's such as The elder scrolls I would only really reccomend this game is you really enjoyed fallout 3 and New vegas and would like to explore the story of fallout further; if you are one of those people who can't get enough of the fallout series this game is 100% for you, you will not be disappointed because the original games are just as good if not better than the recent ones except more primative.",
            "review_score": "1"
        },
        {
            "review_text": "All I am going to say is that this game is an absolute masterpiece. Get the unofficial patch and the restoration project by killap and have one of the greatest gaming experience in your entire life!",
            "review_score": "1"
        },
        {
            "review_text": "Could not figure out how to play it. I guess I just suck at turned based games.",
            "review_score": "1"
        },
        {
            "review_text": "#stopfallout4",
            "review_score": "1"
        },
        {
            "review_text": "i raided a village and took everyone as slaves. You can't do that in Fallout 4 because: Fallout 2 &gt; New Vegas &gt; Fallout 3 &gt; Fallout 1 &gt; Fallout Tactics &gt; Fallout Brother Hood Of Steel &gt; Fallout 4",
            "review_score": "1"
        },
        {
            "review_text": "01000110 01010101 01000011 01001011 01001001 01001110 01000111 00100000 01001101 01000001 01010011 01010100 01000101 01010010 01010000 01001001 01000101 01000011 01000101 00101100 00100000 01110011 01110100 01101001 01101100 01101100 00100000 01100010 01100101 01110100 01110100 01100101 01110010 00100000 01110100 01101000 01100001 01101110 00100000 01100110 01100001 01101100 01101100 01101111 01110101 01110100 00100000 00110100 00100000 00001010 00100011 01100001 01100100 01100001 01101101 01100110 01100101 01100101 01101100 01110011 01100010 01100001 01100100 01101101 01100001 01101110",
            "review_score": "1"
        },
        {
            "review_text": "This game it´s awesome, really, I ve played Fallout and Fallout 2 many times before than the game appeared on Steam and I love it. This is the best Fallout game for me, I will wish, that the next Fallout game will return to this format, for now, we must be happy only with Wasteland 2..",
            "review_score": "1"
        },
        {
            "review_text": "  Valve i tryed to play my game but when i started playing for a while it just loged me off the game now when i try to go back it doesnt let me go to the game. So if u can please help me cause i spended money on this game  ",
            "review_score": "1"
        },
        {
            "review_text": "See these 10 minutes? I died twice in that period. DO. NOT. USE THE SPEAR.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorites. This is like Fallout 3 but Top-Down and always in VATS with combat. I have played this more than 10 times and this has lots of replay value. You could change the way you play with a Melee build, Unarmed build, rife/pistol build, Big guns build. This game even includes boxing and one of my favorite towns, San Fransisco. At first this game was hard to get into but once I did, I got all the Intreplay Fallout games. I recommend you to give it a chance and try to get into it as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! If you haven't played any of the classic fallouts then try this one first!",
            "review_score": "1"
        },
        {
            "review_text": "If theres one thing I love its fallout. Fallout 2 takes this to a whole nother level, its better than fallout 4 storyline wise! You are introduced to the enclave and much more. I just love it.",
            "review_score": "1"
        },
        {
            "review_text": "I dont think i am allowed to write a review.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this title for the first time many years ago was sort of life-changing for me. This was the first game in the Fallout series that I played, and when I went back and tried Fallout 1, I found that I prefer all the improvements it made over the first. Some things were a little unfinished, but there's a Fallout 2 Restoration Project online that adds a lot of the unfinished parts in, so that's not a big deal. A must-play if you're a fan of classic roleplaying or adventure games. I'm a fan for life.",
            "review_score": "1"
        },
        {
            "review_text": "100 %",
            "review_score": "1"
        },
        {
            "review_text": "Just for a reference.  Get the high-res patch and restoration project in  killap.net  makes this game perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Def. feels like an expansion of all things but don't doubt it isn't as entertaining",
            "review_score": "1"
        },
        {
            "review_text": "I will never get that GECK.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly thought this game was much harder than Fallout. It is Harder to get weapons, and travle around the world without an Outdoorsman skill. I also do not approve of the Vault Dweller creating a VERY primitive tribe that does not even have a pistol, only spears. Other than that the game is good if you like a challenge, I just did not have the patience because I was planning to play all games in order, and the anticipation to finally get ot 3 combined witht he frustration made me quit the game. After I cool down though I will certainly play this again because it is very satisfying completing quests.",
            "review_score": "1"
        },
        {
            "review_text": "i'm using an inventory editor but it was working perfectly yesterday but when I loaded it today it just crashes tell me what I can do to stop this crash",
            "review_score": "1"
        },
        {
            "review_text": "Leik Skirym wit les sweg cuz u hav nun soe itz liek a 420/an ♥♥♥♥♥ wich wil b censired cuz ur an f,a,g,i,t",
            "review_score": "1"
        },
        {
            "review_text": "(ignore my playtime, I first had this game on my old steam account) Fallout 2: Good, not fallout 1 levels of good, but good nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "The controls aren't initially too bad, especially when you finally master them. Unfortunately, Black Isle Studios didn't have the knack to implement an abundance of voice actors. Truth be told there are only a handful of them in the entire game. Everything else is good old fashion dialogue. Sure, you might here me and other people complain about this. But let's just say, for the shake of this review. I get over the fact the game only has a limited amount of voice actors until Fallout 3. The only major problem I've encountered thus far with Fallout 1 through 2 (including Fallout Tactics) is the despicable combat system. I mean this combat system sucks.. I'm talking atari style combat.. A friendly individual fires first, then a hostile target fires second. It essentially goes back and fourth until one or the other is dead. This is extremely unrealistic, and truthfully. I don't believe there was any excuse for this whatsoever. Take my word for it, I'm a huge fan of the Fallout series; but this is just ridiculous. In closing this message, I want to add the story is of course outstanding. I hope one day they'll consider doing a remastered version of both Fallout 1 and Fallout 2. Preferably with Fallout 4's new creation engine.",
            "review_score": "1"
        },
        {
            "review_text": "Admission time: I didn't get into Fallout until 3... and I don't like the older ones.  It's not the visuals - I'm a huge fan of Baldur's Gate and Divine Divinity, which it resembles from a visual perspective. It's fine, if not impressive.  It's not the writing. The word is definately Fallout, and it's awesome.   So... here's the problem...  IT'S SOOOOOOOO SLOW.  It's maddening. I really, really want to get into it, and explore the world, and delve into the earlier fallout games. I want to watch the step-by-step creation of a thing I love. I did the same thing for Saint's Row, and while 1&amp;2 are pretty rough around the edges, they're still perfectly good games.   Fallout 1&amp;2? Yeah, not so much. I'm not spoiled, I'm not too 'modern' a gamer. I love turn based strategy games. I only want the visuals to be appropriate and not hideous, and these are well within that criteria.   But the interface is awkward, even taking into account the age of the game. The action is so slow that it's hard to call action...  And all of that keeps me from enjoying the rest of the game - which, I'm told, is awesome. It could be the best game ever, but I can't bear playing it through the initial quest, so I'll never know.   If you've got the patience of Job, I imagine you'll love it. If I hadn't played the Baldur's Gate games - which use the same engine, but move at a steady clip - I might love it, too... but holy crap, I just can't bear the awkward coupled with the slow.",
            "review_score": "-1"
        },
        {
            "review_text": "An amazing story wrapped in an imaginative narrative hamgstrung by Irritatingly, needlessly difficult and tedious gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;get to some random town after avoiding confrontation for an hour and a half &gt;decide to search the place for weapons so i can get rid of my spear &gt;go to a part of town populated by mole rats &gt;get killed multiple times because my melee weapos skill is low and i keep missing the mole rat 2 inches from me &gt;go on forums for help &gt;'your just bad at the game XDXDXD' &gt;uninstall and replay fallout 1",
            "review_score": "-1"
        },
        {
            "review_text": "This game leaves a bad taste in my mouth like crap taste. No tutorials no objective no nothing maybe if the grapichs werent for the n64 than the game might have still been crap actually come to think of it.    This is your Master of Reciews signing off ",
            "review_score": "-1"
        },
        {
            "review_text": "Math classes are more fun than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game when it first came out. I thought it was awsome, and in its time, it was.  However, times change. After playing it a bit, I have found that I do not have patience for old-school game mechanics. For example: You get a quest to Find X. X can be a person, or an object. And that is all you get. Please find X and get something from him. You would think getting the object from Mr. X would be the problem and perhaps you are right. However, you must spend HOURS clicking on everyone in town to find Mr. X, IF HE IS EVEN IN THAT SAME town. If it is an object, lets hope you notice it amonge the muddled brown textures sitting on the ground somewhere.  Do you want to recall what NPC said about something, perhaps there is a hint in something he or she said? You will not find any such notes in your trusty pip boy. Perhaps you can find the NPC and talk to them again. Maybe they will go through thier dialog again, or perhaps they will just ask you if you got the job done yet and you will be SOL.  Anyway, I discovered I do not have the patience for such things anymore. If you do, then this game is a great classic. Just be sure you are in the mood to play a very long, old school game or are ok with constantly googling the quest solutions.  ",
            "review_score": "-1"
        },
        {
            "review_text": "don't buy this game on steam, it's ♥♥♥♥ing broken  ",
            "review_score": "-1"
        },
        {
            "review_text": "Are you ♥♥♥♥ing kidding me? Miss. Miss. Miss. Miss. You died. Miss Miss MIss MIss MIss you Died. Repeat. Worst game I have ever seen in my life, especially considering the cult following. Dumbass fanboys coming to the rescue of a piece of garbage game, just because they know how to abuse the game. Pathetic.",
            "review_score": "-1"
        },
        {
            "review_text": "They didnt even try to iron out the games gfx to suit to win7/w8 users. Random glare/white out graphics everywhere",
            "review_score": "-1"
        },
        {
            "review_text": "ive tried like 4 times to beat the first level and could not",
            "review_score": "-1"
        },
        {
            "review_text": "the year is 2012. all video games are bad i write a seven paragraph review of fallout 2 to prove to my internet friends that i have taste and culture i sip the red wine from my red bull can and sit back in my computer chair with a cherry flavored swisher sweet cigarillo.  Cu latine sapientem vix, veritus patrioque nec ut. Ius velit putant te. Assum copiosae nec ea, eos mutat brute libris no. Maiorum quaestio adipiscing te vel, ♥♥♥ argumentum eloquentiam te. Duo id elitr iuvaret, duo te apeirian eleifend, sonet admodum theophrastus an vim. Aliquid adolescens no per, vel expetenda scriptorem vituperatoribus ei, an purto debet noster mea. Iisque erroribus splendide mel eu.  Has ne nemore dicunt periculis. Eos oporteat platonem democritum eu, te minim neglegentur sed, mel debet vituperata reformidans cu. Nam ea dicant vivendo accusamus. Docendi consulatu id pro, ferri aliquando no duo, eum oblique suscipit philosophia ne.  Vim et utamur laboramus, eam et docendi corrumpit philosophia. Consul commodo quo at, duo ei affert efficiantur ullamcorper. Pri phaedrum torquatos comprehensam ut, sea eu delectus legendos abhorreant, vis ei illum copiosae reformidans. Et autem incorrupte ullamcorper pri, ea mollis inermis fierent nam, mea elit aperiri posidonium ut.  Justo mucius causae eum ex. Te per honestatis interesset, facete veritus pericula ius in. Ei nec putent forensibus, ne amet bonorum pro, id sit doctus facilisis. Ut vix tantas reprehendunt. Pri postea nostrum accusamus eu, cu eros illum qui. Eu mea impedit constituam.  Vim vidisse aperiam referrentur eu. Id per sumo choro omnium, idque dicunt et usu. Eum dolorem mandamus no, epicurei accusata signiferumque id eum, an duo primis quidam. Dico detraxit assueverit ut nec, partem aliquid ei eum.  Ea his denique mediocrem, nihil vidisse admodum in sit. Graecis efficiendi his ne, rebum choro albucius ea vix. Per abhorreant accommodare mediocritatem ne, eu pro agam ullum ocurreret. Eripuit atomorum nec ea. Habeo consulatu constituam ne ius. In mei noster eruditi.  Viris epicurei eos ea, consetetur contentiones mea ut. Aeterno accusam moderatius in nec. Aliquip fastidii in pri, autem graece ancillae sea ne. Ea congue saperet perfecto nec, eum aliquid utroque percipitur an, perpetua democritum et mel. Veniam epicuri in eum. Et nec natum clita.  Has affert albucius expetendis cu, ex eum mundi indoctum forensibus. Sea exerci habemus cu. Cu quis democritum pro, ancillae abhorreant concludaturque ne eos. Ei qui enim iisque elaboraret. His mazim sensibus inimicus ut, te sed impetus utroque comprehensam. Usu quod elaboraret te.  Te sea solum omnium assentior, eu nec meis corpora. Pri in solum ancillae mandamus. Vis errem labitur cu, sea audire corrumpit eu. Dolorem moderatius omittantur no usu, sit scripta intellegam reprehendunt et. Nam suas alia dicta ex.  Pro id cibo munere aperiri, sed no mentitum eleifend. Velit liber reprehendunt et sit, has at indoctum referrentur liberavisse, ad vel homero hendrerit. In lorem discere pro, sea te nibh legere minimum. Ex mea quodsi intellegam. Consequat vituperata appellantur per ex, duo tollit vituperata at. Eos an recteque temporibus, vim quas constituto ei. Usu wisi iudicabit philosophia ad, commodo conceptam ut eum.   Cu latine sapientem vix, veritus patrioque nec ut. Ius velit putant te. Assum copiosae nec ea, eos mutat brute libris no. Maiorum quaestio adipiscing te vel, ♥♥♥ argumentum eloquentiam te. Duo id elitr iuvaret, duo te apeirian eleifend, sonet admodum theophrastus an vim. Aliquid adolescens no per, vel expetenda scriptorem vituperatoribus ei, an purto debet noster mea. Iisque erroribus splendide mel eu.  Has ne nemore dicunt periculis. Eos oporteat platonem democritum eu, te minim neglegentur sed, mel debet vituperata reformidans cu. Nam ea dicant vivendo accusamus. Docendi consulatu id pro, ferri aliquando no duo, eum oblique suscipit philosophia ne.  Vim et utamur laboramus, eam et docendi corrumpit philosophia. Consul commodo quo at, duo ei affert efficiantur ullamcorper. Pri phaedrum torquatos comprehensam ut, sea eu delectus legendos abhorreant, vis ei illum copiosae reformidans. Et autem incorrupte ullamcorper pri, ea mollis inermis fierent nam, mea elit aperiri posidonium ut.  Justo mucius causae eum ex. Te per honestatis interesset, facete veritus pericula ius in. Ei nec putent forensibus, ne amet bonorum pro, id sit doctus facilisis. Ut vix tantas reprehendunt. Pri postea nostrum accusamus eu, cu eros illum qui. Eu mea impedit constituam.  Vim vidisse aperiam referrentur eu. Id per sumo choro omnium, idque dicunt et usu. Eum dolorem mandamus no, epicurei accusata signiferumque id eum, an duo primis quidam. Dico detraxit assueverit ut nec, partem aliquid ei eum.  Ea his denique mediocrem, nihil vidisse admodum in sit. Graecis efficiendi his ne, rebum choro albucius ea vix. Per abhorreant accommodare mediocritatem ne, eu pro agam ullum ocurreret. Eripuit atomorum nec ea. Habeo consulatu constituam ne ius. In mei noster eruditi.  Viris epicurei eos ea, consetetur contentiones mea ut. Aeterno accusam moderatius in nec. Aliquip fastidii in pri, autem graece ancillae sea ne. Ea congue saperet perfecto nec, eum aliquid utroque percipitur an, perpetua democritum et mel. Veniam epicuri in eum. Et nec natum clita.  Has affert albucius expetendis cu, ex eum mundi indoctum forensibus. Sea exerci habemus cu. Cu quis democritum pro, ancillae abhorreant concludaturque ne eos. Ei qui enim iisque elaboraret. His mazim sensibus inimicus ut, te sed impetus utroque comprehensam. Usu quod elaboraret te.  Te sea solum omnium assentior, eu nec meis corpora. Pri in solum ancillae mandamus. Vis errem labitur cu, sea audire corrumpit eu. Dolorem moderatius omittantur no usu, sit scripta intellegam reprehendunt et. Nam suas alia dicta ex.  Pro id cibo munere aperiri, sed no mentitum eleifend. Velit liber reprehendunt et sit, has at indoctum referrentur liberavisse, ad vel homero hendrerit. In lorem discere pro, sea te nibh legere minimum. Ex mea quodsi intellegam. Consequat vituperata appellantur per ex, duo tollit vituperata at. Eos an recteque temporibus, vim quas constituto ei. Usu wisi iudicabit philosophia ad, commodo conceptam ut eum.",
            "review_score": "-1"
        },
        {
            "review_text": "do yourself a favor and dont waste your money on this slow peice of ♥♥♥♥.. i honestly feel really really bad for anyone back in 1998 that had nothing to play besides this abomination.",
            "review_score": "-1"
        },
        {
            "review_text": "READ * READ * READ* READ* READ*   i wont disagree with the people who say this game is amazing, ive played many video games and i can tell by just over a few hours gameplay that this is a cult clasic!____BUT____ AND THIS IS A BIG BUT_______ this game was proberly legendery to play back in 98 but now by other games standards this game is garbage, if you've played the latest bethesda games and are looking for a new game to play this is definetly not the one for you!! I would only recomend this game to someone revisiting there favourite childhood game etc.   this game makes FO3 look like a 100m sprint, FO2 is so slugish by todays standards of gaming that you will be bored to death in minute, If your in to more modern up beat faced past games like FO3 or FONV this is definelty NOT FOR YOU!  Ignore the other fanboy reviews!!!!!   in 98 this would be a 10/10  by todays standards (including gameplay, narative, charechter models etc. (not graphics for obious reasons) 3/10     COMPLETE WASTE OF MONEY!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Another great classic coupled with Fallout. It's more battle based, but still a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this from steam unless you want to waste your time and money trying to get it to run properly due to steam not updating it for modern pc, I don't enjoy low rez rainbow discolouration gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Just Amazing. It's a classic. 'Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best and most played rpg's i have played. Would highly reccomend. i have owned this game long before it was on steam and one of the longer played games that i own.",
            "review_score": "1"
        },
        {
            "review_text": "Atmosphere, story, artstyle, characters, weapons, skills, gameplay, gameSTYLE and world to explore - all of this has been perfected for a vidya.  That about sums up this masterpiece. More open-ended than it's predecessor Fallout but that depends entirely on you whether or not that is a good or bad thing.  If you come from Fallout 3 do not give up on the rough start with this game (also applies to Fallout), it is worth every bit to get into it, dare I say way more rewarding to get into than Fallout 3.  If you want an amazing immersive experience that even FEELS realistic, this is for you to sink up 60h into. Amazing game for it's price and I don't even consider it 'dated' in any regard. The gameplay feels intuitive and the visuals are gorgeous. ",
            "review_score": "1"
        },
        {
            "review_text": "The old school masterpeice that wet our tounges for the post apocalyptic RPG, I would recommend this game to anyone in any situation.  Just bought a house? Play Fallout 2. Just got Married? Play fallout 2. Just won the Lottery? Hire a bodyguard and an accountant, then play Fallout 2.",
            "review_score": "1"
        },
        {
            "review_text": "it's good",
            "review_score": "1"
        },
        {
            "review_text": "Went to a town and saw a building with its door blocked by ruble.  Blew that ♥♥♥♥ up and it revealed a spooky dealthclaw.  Killed it with a BB gun.  10/10 best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Arch Dornan still haunts my dreams. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing for the time it came out, I would deffinatly reccomend it to anyone who is a fan of the Fallout universe",
            "review_score": "1"
        },
        {
            "review_text": "a aboslute gem, but its kinda unforgiving  left the village, got caught by the enclave, got eaten by a minigun  10/10 would get eaten by minigun again",
            "review_score": "1"
        },
        {
            "review_text": "This game is not like any other fallout game to date. Though it's built in an isometric world instead of an FPS, you are immediately immersed into a sprawling universe that feels like it has been existing for a long time now. It doesn't feel like it's built for you to play in, but it was built by it's own citizens.   The game is hard. Like, almost near impossible even at a low difficulty setting. This makes conservation of ammo and healing items ESSENTIAL for your surivival, if not totally dependent on it. There are tons of mad max refferences, a car you can drive, and some unique sidequests that you won't see in ANY OTHER fallout games.  Before you start playing, get into the habit of saving after every encounter with an enemy. A large amount of uncontrollable variables can get you or your team killed in an instant.   I'd give this a 9/10, the games only flaw   (for me)   being the incredible difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "This proves that, even today, that graphics don't make the game. I did a 4 hour session of this game the first time I started it up. That's something special because I always just do 2 hour sessions for games.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game folloing fallout since the first game always a new great exp each time i play them cant wait for fallout 4!",
            "review_score": "1"
        },
        {
            "review_text": "To this very day Fallout 2 is one of the best games that I've ever laid hands on. I played it back in school for hundreds of hours and now that you can get it on Steam, I just had to buy it once more. Its graphics might seem quite outdated, but if you're not too much of a superficial gamer, you should be able to deal with it.  What makes this game so incredibly beautiful is the developers' love for details and a really convincing atmosphere. You get thrown into a post-apocalyptic world full of glorious black humour, knowing only little about your actual main quest. There is barely any hand-holding, which modern RPGs do all too much. In Fallout 2 there are no quest markers, only hints. To solve your missions, you have to listen to what NPCs tell you, instead of clicking right through dialogues, following a pointer on your minimap and shooting a few bandits in the face. As most things in Fallout 2 can be done in a variety of ways, you can solve problems by talking, violence, in favor of your own interests or to help a certain person or faction. And the outcome will always be entirely different. You decide everything.  On your way through the radioactive desert of the American West Coast you will discover tons of secrets, interesting characters, quests and enthralling side stories. Considering its release date, the game's actually huge. I've played Fallout an infinite number of times, but so far I always managed to discover something new - be it a secret area, a new way to solve a certain quest or just another crazy NPC.  As if this wasn't enough cool things to know about Fallout 2 already, there's even more. For example Fallout's unique character creation system. Your avatar will have a truckload of skills, talents, perks and attributes, which have a direct influence on the gameplay and everything else. You want to conquer the wasteland as a highly intelligent scientist and sweet-talker instead of being a violent brute? Want to be a sniper instead of chopping your enemies with a chainsaw knife? Well, just give it a shot. No two playthroughs will ever be the same.  I could go on and worship this game for another 20 minutes, but I think, if you're not convinced by now, you won't ever be. However, if you're into oldschool RPGS, buy this game and experience one of the most superior titles in video gaming history. Period.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games of all time, and arguably the best in the Fallout franchise, Fallout 2 manages to remain a fantastic game to this day.",
            "review_score": "1"
        },
        {
            "review_text": "After so many years I still enjoy the game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 2= best fps",
            "review_score": "1"
        },
        {
            "review_text": "I found my lost love of 17 years again. It's perfect for many reasons. Immersion is the main one. Also it's a real RPG. Eveything is affected by your stats and actions.",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 2: Basically A Whole Lot Better Than Fallout 1",
            "review_score": "1"
        },
        {
            "review_text": "Just beat the story. Great Gameplay, main story was fun and pretty interesting, it touches on issues such as race and how much trust you should put in governments, like New Vegas there are many ramifications to your ending. Though you get an option to keep playing after the end which I liked. My favorite fallout game. I've only have 4 and New Vegas though, so I'm comparing it to them.",
            "review_score": "1"
        },
        {
            "review_text": "I suggest you mosy on over to my Fallout 1 review. This game is all that and more. The story is just as bleak and colorful (somehow) as the first with even more memorable characters. I will never forget Sergeant Dornan, God bless the Enclave! If you aren't aware of how incredible a game Fallout 1 is, follow these steps. Go check it out, buy it, play it, love it, then buy this game, play it and love it. 10/10 One of my top ten games.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game recommend!!",
            "review_score": "1"
        },
        {
            "review_text": "Fallout Two is a extraordinary game. I will try to express the game. Two dimensional computer game that is ahead of it's time. You can give your character attributes classified as S.P.E.C.I.A.L that stands for strength, perception, endurance, charisma, intelligence, agility, and luck. You also have another system that allows you to choice and upgrade your skills. If you kill enemies or do what your skill is made for you can get experience and change level. For example lock pick could be upgraded by trying to lock pick something and exceeding. Books can also give you experience and new found knowledge when you read them. You can get perks and traits by acting a certain way or doing a certain thing. The world is a unstable environment with radiation and enemies. You are the chosen one follow your path down the heroic side or evil side. This is a great game ten out of ten a really great game!",
            "review_score": "1"
        },
        {
            "review_text": "having played this ages ago. to find it on steam and with the other 3 games of the same name i wasted no time in throwing my cash at it.  okay. some pros. its top down and unforgiving at times but thats what post apocilptia is like. lovely dialouge with lots of choices on how to proceed baised on character skills and what info you have at the time. sometimes doing the right thing isnt good for you.  cons. if you have low morals.. its easy to make money. if you have even less morals is incredibly easy to make money as a female than it is as a male same bugs as was in the old game are here.",
            "review_score": "1"
        },
        {
            "review_text": "Wow... Ugh, nuh, oh. the only conversation items in the whole game 10/10 would make a litterally ♥♥♥♥♥♥♥♥ character again",
            "review_score": "1"
        },
        {
            "review_text": "one of the old time legends of past. greatest RPG i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "A true classic. Make sure to patch it!",
            "review_score": "1"
        },
        {
            "review_text": "I wish I have more time in my life to read every text line in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Must play! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Greatest Fallout of all time to be quite honest. Played it as a kid and loved it. Still love it.",
            "review_score": "1"
        },
        {
            "review_text": "My favourite Roleplaying game. If you played Fallout 3 and 4 and can't decide if the originals are worth trying, the answer is a definate yes.  Pros The best soundtrack in the new games is taken from the originals.  Unlike fallout 4, these are actually roleplaying games not FPS. See how atmosphere and richness in characters and locations was acheived back in the day.  cons You will need a lot more patience as it is not always instant gratification and will need to read text from a lot of NPC's.",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 2 is probably the single most definitive game I have ever played. It made me the gamer I am today. The story, the options you have, the ability to reall do whatever you want. It is challanging, brutal and unforgiving. All the traits a good rpg needs are in this game. It is also from a time when games didn't hold your hand. you had to really play it to make it.   Any personthat says they are a fan of any rpg should play it at lewast once. Once you have you will loo at any other rpg you have played and realize as fun as they are, you are playing a game that coddles you in comparison.   Simply put, play the game. Don't think about it, just do it. Or regret it for all eternity.",
            "review_score": "1"
        },
        {
            "review_text": "The fifty shades of fallout.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing else quite like this gem has come out, ever. Make sure to get the community patch if you're going to play.",
            "review_score": "1"
        },
        {
            "review_text": "Like, Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "yeah i recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Steam version works with all unofficial patches, fixes, and mods.",
            "review_score": "1"
        },
        {
            "review_text": "Multiple endings, moral choices, multiple factions, strong voice acting, tactical gameplay. Less than one year after original game. The year is 1998 and this is the sequel to the best post-apocalyptic RPG ever created. More characters, more locations, more weapons, more items, and more choices. Just more of everything in Fallout 2. Yup – you guessed it right – I’m going to say that this game is worth the piddly $10 they charge for it. After you crush Fallout 1, carry on the story in Fallout 2.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game sooo much! Everyone should've played it (and the whole series) at least once!",
            "review_score": "1"
        },
        {
            "review_text": "This game along with it's original starter made one of the best games ever. In my opinion, this game made me love RPG's and if your thinking of buying this I hope you get the same experience!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just aazing! its fun to play if you like turn based RPG's.",
            "review_score": "1"
        },
        {
            "review_text": "If classical RPGs were a country, Fallout would be on the ♥♥♥♥ing ten dollar bill.",
            "review_score": "1"
        },
        {
            "review_text": "First mission, is really confusing but past that the gameplay is slightly tweaked to be easier. Whether that be story, fighting, inventory adventures, camera angles and graphics and such. You fight a lot more different creatures and stuff, like a huge Mario looking plant, which shoots spikes and you basically get high with a doctor dude. So yeah, blaze up.  8/10 pretty neat game.",
            "review_score": "1"
        },
        {
            "review_text": "Well, my relationship with the fallout series isn't that lengthy, as I have still yet to complete Fallout and Fallout Tactics along with all the other classic Fallout games.   But as a person who mainly just favors FPS and direct combat and whatnot, when I first got this game, I was plagued with graphics issues.  Things showing up as mixmatch of black,red,blue pixels, overall sound being rather screwed up, and I really started to doubt whether my purchase was worth it.  But recently, while waiting at an airport, I decided to just out of boredom give this game a try.  I dunno what really happened, but the graphics problem was gone. I assume it was patched over the time that I left it to sit in the library, but it was gone.   I watched the intro, I started to play, and there I was, clicking away for hours.  This sort of game with the old-school PC point and click action normally wouldn't be my cup of soup, but for whatever reason this game got me addicted. I paid more attention to story than I ever did with Fallout 3 and New Vegas, and even just laughed at how many cultural references were being made in this game, along with certain 4th wall breaking elements.  Basic story line goes like this. You are a tribal who leaves your settlement to find a GECK, which is supposed to turn barren land into fertile soil, and recreate towns. You go on a looooooong journey, choosing careers, finding companions, but once you come back to your village, you find out that it's been removed, and the lone survivor tells you to go and find them. The rest is up to you to find out. No more spoilers for you, come back next year!  Did I mention careers? Hell, there are also so many reputations/jobs/statuses you can get. Do you want to be a gun-slinging ganster? Do you want to be a dirt-flinging grave digger? Do you want to be a crap-shoveling brahmin excrement remover? Do you want to be a ♥♥♥♥-swinging pornstar? Do you want to get MARRIED? Then this game's got you covered (In more than one way... Grab yer jimmy hats!)  It's almost like GTA in some aspects. You can also get a car! (Conditions do apply though; you need money. And parts. And fuel to get the car operating.) But no biggie, once you get that dream car of yours working (And if you've got enough fuel) you should be zooming around the wasteland (Unless an Enclave patrol pulls you over and shoot you with their futuristic-crap weapons. Then you're sunk unless you've got good stats and good armor. Or mutant soldiers, for that matter.) Want to get drunk? There are multiple types of alcoholic drinks that you can (over)indulge in! Feeling really horny? There are sex-workers GALORE. (Though you will be missing the hot pixel-to-pixel action between your hero and the person you're screwing/being screwed by. Too bad. All you get is a black fade-in screen.) Want to be the 'cool kid' and take drugs? You won't be doing cocaine or heroine, but try some psycho and jet. Oh, some drugs make you stronger and more intelligent, too (Withdrawl's still a ♥♥♥♥♥.)  There are of course, like all other Fallout games, the infamous SPECIAL and karma system. Do you want to be a hero and save the wasteland from evil? Or do you want to join the evils of the wasteland and become infamous? Take your pick, because once you get outta your small podunk settlement, guaranteed, your karma won't be staying at 0. Oh, as for your SPECIAL system, you get a few options: Play with whatever characters the game provides you with (And with their original stats) or just choose that character and modify their stats a wee bit. (Side note, having low intelligence is pretty funny, but on the long run, it will make everything just harder. Take your pick: Funny dialogue, or practical gameplay. Funny dialogue, or practical gameplay.)   One thing did kinda get me a bit iffy about the game, though. It's the infamous talking heads. They're hideous. They're... Rather too smooth-looking, some of them. Almost as if they're made from clay. But other than that, that's pretty much it. Other than those hellspawn wanamingoes. Those you try to avoid.  Yes, there were glitches (obviously not going to be really patched anytime soon), yes, there were frustrating moments in which I forgot to save and was pushed back 4 quests back (losing massive progress and possibly my laptop due to the amount of frustration), but hell, if you know when to save, know what you're clicking (ESPECIALLY the dialogues, mind you, a wrong click can seriously cause big problems. And you can't back away from it unless you exit and load your closest save), know how to read (And if your character has the intelligence to actually say fluent sentences, but it's rather hilarious and frustrating if your character's intelligence is below 3), you wouldn't regret buying this game. Chock-full of quests, interesting characters, jokes, and random encounters with enemies, friends or foe (the special ones are more or less what we'd call now, 'easter eggs')   Oh yeah, unlike the original Fallout (Which gives you 150 days on time limit with the waterchip), there really isn't a time limit for this one. I myself took at least over a year screwing around and actually finding the GECK. Though you should still be aware that the game engine itself can only let you play for 13ish in-game years.   Do I recommend this game?     ♥♥♥♥ yes.    Is it worth $9.99?    Ehhh.... I'd say wait for a sale to happen. I've got my collection at a 75% off sale, and I don't regret that decision one bit.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 game if you enjoy the Fallout series and appreciate some of the older classics. Be sure to get the Restoration Mod.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games ever made. Literally. Buy this.",
            "review_score": "1"
        },
        {
            "review_text": "I just ate my ♥♥♥♥ing toe.",
            "review_score": "1"
        },
        {
            "review_text": "This game literally made my life.  There's a few times in life when the word 'masterpiece' or 'perfect' is the only possible way to describe something, and Fallout 2 is exactly it.  This game will leave you feeling more satisifed than you've ever felt in your natural life, and upon completing it, enter an existential depression, for the beauty of what you've witnessed will never be re-created.  The only thing you can do having finished the epic journey of the Chosen One, is to sit in the Cafe of Forgotten Dreams, on No Mutants Allowed, and wistfully remember the past of the Vault Dweller from Fallout 1.  Then begin another 120 hour playthrough. ",
            "review_score": "1"
        },
        {
            "review_text": "*You Missed* That is combat in this game. Make 'Speech' a tag skill and run away from fights. It will get you through this game. (Or just let your companions do all of the work while you shoot from behind them)",
            "review_score": "1"
        },
        {
            "review_text": "When i got this game awhile ago is was not playable since every thing looked like a photo negative. I guess when steam recently patch it they fixed the issue. Which is good for me since i can now enjoy the game the way it was ment to be. I look foward to pushing my way through the wastes and running like a scared little girl from deathclaws.",
            "review_score": "1"
        },
        {
            "review_text": "Classic  I absolutely love the classical Post-apocalyptic feel, humanity is f*cked up, mutated animals run wild endangering you at all times, civilizations like New Reno in the ♥♥♥ end of nowhere full of mobs warring for supremeacy, ♥♥♥♥♥♥♥♥♥♥s and drug addicts all over. This game NAILED the atmosphere of a bleak world, this game is naturally hard which i like, even on the easiest difficulty. If you like feeling like your gender, personality, and morals actually count; i recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Beat up Mike Tyson, Helped Arthur find the Holy Hand Grenade, stole a Trekkies Phazer, had a shotgun wedding, banged a mobsters wife AND daughter, oh and became an 'adult film star'  10/10 would eat my mutated toe again  (Played the HD version, actually have about 35 hours)",
            "review_score": "1"
        },
        {
            "review_text": "A very old Game, but very addicted when you play it for the first time, the story line the bad decisions you could make, let you and your party blow up alot of times, there is alot to do like bombing ♥♥♥♥ holes, killing cows, falling in love and get married with consequenses, annoying people with serious issues, but if you have no regrets in anything, you can allways just kill everthing =)",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 2 defined the series. The creative force of this game led to the fallout series being what it is today. Despite a number of bugs and unfinished quest lines, the depth and intricacy afforded by this game was the gold standard of its time. For fans of the modern iterations of the series, this is a must play. For fans of isometric rpgs with turn based combat, this is a must play. And for fans of post-nuclear-apocalypse themed games this is a must play. And when you do play it, say hi to Sulik for me.",
            "review_score": "1"
        },
        {
            "review_text": "Its alright",
            "review_score": "1"
        },
        {
            "review_text": "I started my adventure by punching ants, and giant scorpions in the face.  As realistic a rpg as there has ever been. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Story is still pretty good despite all these years, and combat is well :D",
            "review_score": "1"
        },
        {
            "review_text": "Wee girls these days trying to act all big has too be the funniest thing ever like ♥♥♥♥ up and get yourself a life, your nothing but scum. Nothing but a slagg running round with your trousers at your ankles. Touch my friends again and youll be got, you know who you are!! ‪#‎mybestfriendsaremybestfriends‬ ‪#‎hurtthem‬ ‪#‎ihurtyou‬ ‪#‎simple‬",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, probably the most 'Fallout' fallout game there is.",
            "review_score": "1"
        },
        {
            "review_text": "This is proper old skool brutal. It IS fallout, the storylines, the ideas, the missions, the npc's etc but damn... Sure the graphics can't hold a candle to modern games but you get the point and the characterisation is good enough that you don't really notice too much unless you're looking for it. Random encounters are an interesting one, they are really random. You might meet a trader, or get some wierd interaction that makes no sense, or get blown off the map by a band of thugs or all three at once, who knows. Inventory, managing it and getting it, is crucial and neither is particularly easy. It makes sense and works well but it's no loot hauler. Npc management, although basic in modern terms, is fairly well done and this is definitely a big part of the game if you want to get anywhere. Overall I'd say this was a rainy day grinder for those that either want to play it for completeness or like the old skool difficulty levels.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's I have played aside from the balders gate and icewind dale games. If you have the patience with these types of games I would highly recommend picking this and the first one up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard to get into. It took me 9 hours to understand all the mechanics because there is no tutorial. Nonetheless, despite it's unfriendliness towards newcomers, this is a fantastic game. However, I suggest you look up a tutorial on youtube.",
            "review_score": "1"
        },
        {
            "review_text": "yes, consider the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Spends 20 Minutes creating character  &gt; Thinks agility isn't that useful  &gt; mfw when I can barely do ♥♥♥♥ in combat  &gt; finally dies  &gt; forgot to save  &gt; cri  10/10 would get ♥♥♥♥ed up the ♥♥♥ by giant ants again",
            "review_score": "1"
        },
        {
            "review_text": "Went to the town and met Torr, helped him protect some Brahmin and got into a fight with two rustlers. Got punched to death in the desert. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely an enjoyable game. I had some fun with it And after the first 30 or 40 minutes of playing it, I could see where all the  'You missed. You missed. Giant ant missed. You missed.' Jokes are coming from",
            "review_score": "1"
        },
        {
            "review_text": "The only game in which you can become Mike Tyson and bite off someone's ear. And then become a pornstar.",
            "review_score": "1"
        },
        {
            "review_text": "1.) Walk into a town full of rednecks. 2.) Order Brahmin Fries at a diner, break previous record for most eaten. 3.) Find out Brahmin Fries are mutant cow testicles. Get food poisoning. 4.) Try to proposition a farmer's daughter. 5.) Farmer's daughter is shocked and thinks I'm a ♥♥♥♥♥♥. 6.) Farmer kills me with a shotgun before I can put my clothes back on.  69/10 would become target of frontier justice again.",
            "review_score": "1"
        },
        {
            "review_text": "Would miss again 11/7",
            "review_score": "1"
        },
        {
            "review_text": "good game. Really fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the game but there is way too many random encounters in the map",
            "review_score": "1"
        },
        {
            "review_text": "This was my favorite game in 2004. I played it over and over again. I own this game twice because buying it once wasn't enough.",
            "review_score": "1"
        },
        {
            "review_text": "it was ok but pretty hard to get into",
            "review_score": "1"
        },
        {
            "review_text": "In what game can you become chem addicted, child killing porn star who sold his wife into slavery?   Protip: Virgin of the Wastes title can be added via save editor.",
            "review_score": "1"
        },
        {
            "review_text": "It has everything you would want in a role playing game :  - rich background - detailed character creation - nonlinear story - countless combinations to resolve quests - enough rng to make turn-based combat fun - combat is optional - dialogue is optional  You can simply enjoy creating different characters and stories for a decade or two without being too frustraded by other games limitations. Fallout 1, Arcanum and Planescape Torment will do the rest.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story, amazing characters, amazing leveling and perk system. The only things that haven't aged very well are the graphics and combat. Its the very definition of a 'timeless classic'.",
            "review_score": "1"
        },
        {
            "review_text": "I've played it 10 years ago, and I still occasionally play it today... Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Turn based games are rare. This one is a great one. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "There is not really much to say about this, and even with the game breaking bugs and crashing that was brought forward from the 90's version, it still got the:  Test of time steam nomination from me.  ",
            "review_score": "1"
        },
        {
            "review_text": "Simply one of the greatest RPG's of all time. It's a must see for anybody that wants to call themselves a gamer. This as well 1 and New Vegas are what Fallout is.",
            "review_score": "1"
        },
        {
            "review_text": "Had sex with a man's wife. Sneaked my way out so when we the baby, I don't have to pay for child support.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game ever. For million reasons.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Great writing, story, gameplay everything.",
            "review_score": "1"
        },
        {
            "review_text": "I nominated this for the 'Game Within a Game' award. Why? Because I love making my fortune gambling at The Den!",
            "review_score": "1"
        },
        {
            "review_text": "This game, man. This game. It does all the things the first one does: the post-apocalyptic setting, the fancy schmancy dialogues, the actions, the storyline, the NPC's, the replay value ... And more. This game is old. Really old. Most pc's probably can't run this properly anymore. Which is a shame. Go play it. Now. It's cheaper than Starbucks coffee and the story, the choices, the various endings, ... it will keep you coming back for more.  And don't forget: War. War never changes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is flooded with water chips.",
            "review_score": "1"
        },
        {
            "review_text": "Baldurs Gate quality RPG in post-apocalyptic setting. Enjoy this masterpiece, if you can.",
            "review_score": "1"
        }
    ]
}