{
    "app_id": 384190,
    "name": "ABZU",
    "release_date": "2016-08-02",
    "developer": [
        "Giant Squid"
    ],
    "publisher": [
        "505 Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Relaxing",
        "Atmospheric",
        "Exploration"
    ],
    "achievements": 12,
    "positive_ratings": 15634,
    "negative_ratings": 1233,
    "price": 14.99,
    "description": "From the art director of Journey®, ABZÛ is a beautiful underwater adventure that evokes the dream of diving. Immerse yourself in a vibrant hidden world bursting with color and life as you descend into the heart of the ocean. But beware as you swim deeper as dangers lurk in the depths.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/384190/header.jpg?t=1491246242",
    "minimum_requirements": "OS: Windows 7, 64-bit Processor: 3.0GHz CPU Dual Core Memory: 4 GB RAM Graphics: Geforce GTX 750 / Radeon R7 260X DirectX: Version 11 Storage: 6 GB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": "OS: Windows 7, 64-bit Processor: 2.4GHz CPU Quad Core Memory: 8 GB RAM Graphics: Geforce GTX 780 / Radeon R9 290X DirectX: Version 11 Storage: 6 GB available space Sound Card: DirectX compatible sound card",
    "reviews": [
        {
            "review_text": "beautiful. short but worth it. now we need journey and flower for pc.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful exploration game, based on marine life and some sci-fi, without spoiling things. Faithfully replicated wildlife, a nice musical score, and immersive graphics.  Controller was flaky at times, breaking the immersion sometimes, but it wasn't a dealbreaker.  Gotten at the steam sale for like $2, and well worth it. Full retail is $20, which is steep for a 4 hour playthrough and another 4-8 for Cheev addicts.  9.5/10 in a bundle or &lt; $5 5/10 at full retail so wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Despite a lot of people saying it plays at roughly 40FPS on average, I am running a GTX970 at 60FPS with everything on ultra.  The game itself is beautiful, everything just fits together in a way that relaxes and keeps you hooked.   EDIT: I have now completed the game though I missed a few collectibles here and there, I think I'll go back to it in a couple of weeks to complete it. RE: Framerate drops Later in the game, I had a few drops to around 50FPS, barely noticeable but worth noting.",
            "review_score": "1"
        },
        {
            "review_text": "Valium in the form of a game.  An extremely beautiful journey through the sea. A game with simple controls, a short story, but definetely worth it.   It's absolutely gorgeous. Every little moment in ABZU gives you an immense feeling of peace and serenity.  100% anxiety killer.",
            "review_score": "1"
        },
        {
            "review_text": "beautiful or rather gorgeous, also relaxing as a bonus - educational  simply must play",
            "review_score": "1"
        },
        {
            "review_text": "Short and Sweet :3 ABZU really should be a game many developers look to when the are searching for inspiration, The way Giant Squid manage to make an atmosphere which almost completely immerses me is amazing. Believeable yet not so real to be dull or boring, The thing that really stuck out to me was the way everything in this underwater world reacts to you, Reefs sway with the current, Octupie hide in there makeshift homes as you come closer, The attention to detail is top notch.  Its a game about discovery and learning as much as you can from this mysterious ocean of creatures and structures, It really is one of the most beautiful games i've played, Every type animal looks unique and is eyecatching in its own way, I always felt a sense of wonder discovering a new area to search through, Could not wipe the smile of my face :).  I guess the one thing people could argue is that ABZU is too short, But I felt very content in my purchase and it left me wanting more which I feel is better than being left with more content just for the sake of more hours, I feel the game is very well paced and enjoyable. I dont want to talk to much about ABZU for the sake of Spoilers so I will keep this review, Short and Sweet ;3.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I certainly have some issues with the game. The camera could be better, sometimes controls (especially navigation) felt stiff and invisible walls in some areas irritated me. However, the design and the music were so great that they redeem all the problems... for me, at least. Because of the visuals and the soundtrack, the game felt gorgeous and touching at the same time, it certainly was an amazing experience. However, you shouldn't expect free roaming in the ocean, the game is basically a set of beautiful rooms with some collectibles to discover. If you're okay with it and you can bear with some issues, then you'll probably enjoy the game as much as I did.",
            "review_score": "1"
        },
        {
            "review_text": " ABZÛ  marks up-and-coming developer Giant Squid's first outing and does so in a remarkably definitive statement using video games as their medium, exploiting its aesthetical influences with more streamlined nods to contemporary gameplay functionality of similar genres.  Matt Nava, acclaimed triathlon champion and creative director of previously works such as  Flower  and  Journey , draws subtle inspiration from them, but draws the focal point of the game’s aesthetic away from any fixed point, with careful, sporadic color modulation of just a handful of elements that invite a powerful, hypnotic graphical style across the full course of the game’s length. Nava commits a typically ambitious and celestially experimental redux of his previous work, and provides an atmosphere transforming into something altogether more alien and overwhelming, culminating in an epic yet utterly earned conclusion as the game draws near its end.  The resounding intensity of the story arch is layered with emotive and diverse elements. At times distant, playing on themes such as isolation but also religion and nihilism. The finale really is a smouldering sign off.  The soundtrack of  ABZÛ  advances on the themes and playfully exploits the players assumed fondness of BBC nature documentaries, drawing the focal point of the music from a classical orchestrated score, later inviting to more careful ambient notes as the player explores more surreal environments. The score progresses into deeper territory still toward the end, and presents an engineered initially unassuming soundworld that ultimately reveals layer upon layer of painstaking detail. Polyrythmic celestial bass lines interlock expertly from the beginning, gradually unfolding while never relenting.  ---  seriously though the game is cool and very pretty but the score is a bit of a let down they should have done some experimental electronic ambient stuff or something… shame you can’t turn off the music in the options and play your own ambient stuff. the dreamlike underwater worlds really go against the conventional musical score. Game is also very short - my playthrough was 1,5 hours... game should be 15 bucks, not 20! i'll still recommend the game for its originality",
            "review_score": "1"
        },
        {
            "review_text": "A charming and modern ecological fable   and   a celebration of marine life.  it's short but intense",
            "review_score": "1"
        },
        {
            "review_text": "If you played Journey, this is the spiritual successor to that. A very short game that uses scenery, art, and music to create a relaxing game. There is no dialogue whatsoever, so it is a perfect game for someone who wants to swim around with fish, enjoying beautfiul environments. The story is told with imagery and ♥♥♥ mentionned before, it is quite short.",
            "review_score": "1"
        },
        {
            "review_text": "god... FEELS ARE REAL after finishing game. This game is ♥♥♥♥ing BEAUTIFUL! worth EVERY penny!",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Fantastic, gorgeous, beautiful - could this be the ultimate chill-out game? More to follow..:)",
            "review_score": "1"
        },
        {
            "review_text": "If only this game came out earlier, I would have gotten A+ for my Marine Biology Exam and be a Professional Scuba Diver now.  ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible journey from beginning to end, and this is coming from someone who is terrified of water. This game made me feel at home in the ocean depths, swimming on orcas and jumping into the air with dolphins. Took me five hours to play through because I took my time, so don't rush through this one. There's so much to see and experience that doing so would be a personal diservice.   It's not a traditional game by any stretch, but it's one that aims to redefine what we view as a videogame and what we view as art. Please pick it up and give it a try, you won't regret or forget it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm still trying to found DORY...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! However there is a mistake in the namings of the powder blue tang and blue sturgeon. Also wish it would be eaiser to select fish in the meditation and it seems to only flick between specific fish and its often difficult to try and select some of the smaller fish or even invertebrates at the sand bed.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely gorgeous. Fantastic soundtrack. Smooth Movement. This game would be a 10/10 if it was longer, but...it's very short.  This may be the shortest game I've ever played, but was such an intense experience that it was worth it.   I beat this game in ~2 hours, and I took my time... that is a definite problem. However, if you find the trailer appealing, I strongly suggest picking this up (maybe on sale, I got it 30% off). I wish there were games like this on a much bigger scale.  The game recommends a controller, and I agree with this. Haven't tried kb/m in this so I don't know if it's usable.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, calming and powerful. Similar to Journey.  A short masterfully done game.",
            "review_score": "1"
        },
        {
            "review_text": "ABZI is a game much like Journey, in both art design (which is unsuprising given who was involved) and in how it feels. If you have played Journey and loved it, ABZU is an easy recommendation, however if you though it was simply okay or didn't enjoy it, ABZU is either not worth it's current price point or simply isn't worth getting.  It is a beautifull game, with stunning art design and music that perfectly compliments the moments it is present in. The controls are solid and the overall experience is amazing. However as suggested above, given it's current price point I would advice people wait for a sale. The game is amazing, but given that simply playing the game as it seems to have been intended I had reached the credits in 85 minutes, which included pausing the game to briefly making a coffee. Those suggest it is significantly longer I can only imagine where padding the time by looking at everything by swimming up close it it and staring at it, which essentially can make any game long.  Put simply, this is a must play experience for anyway who likes atmospheric games and are not bothered by minimal mechanical complexity (I can hardly say there is any present here). It just may be worth waiting for a sale unless you truly feel you have to play it now due to its very small amount of content.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful, colorful, full of life, I can't even express how much I loved the experience, the music, everything flows, just let it go and follow the path.  Seriously, you should play this, may can be short but it's an intensive way.",
            "review_score": "1"
        },
        {
            "review_text": "  Abzû strives to strike true where Journey once did while inverting the setting from an arid desert to an underwater labyrinth, but it misses the bullseye. For every dolphin leap from the water, every new species of aquatic life discovered, every deep-sea dive with a sperm whale, there are inconsistencies such as there being no indication as to the purpose of having more than one mechanical companion, or that the story aims for ambiguousness but succeeds vagueness. Ominous mines flicker violently as the Avatar closes in proximity to them, but even when they are set off, the Avatar is visibly in pain, but survives even a chain reaction of several. Why do these mines even exist? Why is this Avatar seemingly invulnerable? What are some things that I can take away from experiencing Abzû that will help me remember it years from now besides the fact that I swim for approximately two hours (and about three if looking for hidden items and fish)? I cannot answer any of these questions, so I can only conclude that this game is a bold experiment that is missing the polish that I have come to expect even from indie developers such as Giant Squid.   Full Review at   Geeks Under Grace   [www.geeksundergrace.com] ",
            "review_score": "1"
        },
        {
            "review_text": "I played the whole game. And it is a grate game. For example the musik is prodigious. It is one of the best games I ever seen. If you want to relex, you will buy this game.",
            "review_score": "1"
        },
        {
            "review_text": " Swimming through  ABZÛ 's largely beautiful environments provides an enjoyably relaxing moment but its unfocused narrative and lack of context feel purposeless outside its moments of awe. Explore and activate parts of the environment, optionally releasing marine creatures, and turn grey to pastel.",
            "review_score": "1"
        },
        {
            "review_text": "The most relaxing and beautiful game that I've ever played. A work of art.",
            "review_score": "1"
        },
        {
            "review_text": "Highly reccomend for people who just want to have fun,Be amazed by beautiful ArtWork. It's fairly cheap for such a beautiful experince. People will pay more than 20$ for a few hours of arcade video games,So it is not really bad to spend 15$ on such 5 hours game",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Journey.  Like, nowhere near.  There's just not enough of a 'gaming' element for me. Journey had great core mechanics revolving around platforming and puzzle solving. Abzu has swimming. Just swimming. There's no challenge and 0% skill involved, other than using the sometimes awkward combination of camera and player controls. This gets particularly bad in corners or other tight spaces.  Journey's narrative unfolded through sound, ambience and visuals, with a real sense that the player is driving towards somthing. The problem with Abzu is that it's not just inferior in terms of gameplay mechanics and challenge, it's also a far less engaging narrative. After an hour of swimming around going vaguely forwards, I was still completely lacking any sense of purpose, and was struggling with any reason to keep playing at all.  If you want to go exploring in a pretty underwater world, then Abzu will probably do you fine. But it lacks the depth and engagement of Journey, and you'll probably get bored quickly. I did.",
            "review_score": "-1"
        },
        {
            "review_text": "What can i say this is the most relaxing game i own and i love all the music i recommend this game to anyone that just wants to chill. Even at full price i think its cheap for what it is",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game which sadly has no replay value. The music and graphics are wonderful. But I expect more from a game. There's no challenge whatsoever. Gameplay is nearly non-existent. Feels more like a screensaver instead of an actual game. Definitely not worth 20 bucks.  More like a 5$ value.",
            "review_score": "-1"
        },
        {
            "review_text": "This is really good",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. What an experience. Truly a masterpiece, this is one of the most gorgeous games I have ever played. No need for attacks, enemies, guns or vehicles. Just you, an infinite sea, and the fauna that inhabits it. If you enjoy exploring, and like sea creatures, this is definitely the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game made by Giant Squid. Stunning visuals, fluid and satisfying controls, a very compelling non-verbal story. Played it twice and probably will again at some point.  10/10 would fish again",
            "review_score": "1"
        },
        {
            "review_text": "The game is really different from everything else in the market today. Unless you count Flower, Flow, Journey, and the recently released Bound.  The story is rather unexplained, but that is because every time you play it, your experience will explain what is going on. The game relies on your perception in the deepest level. It connects to you as if you're a child reading an exciting story for the first time ever. And no game can do that as good as this (and the ones listed above).  On top of that, the design of this game is remarkable. Sure you don't have a billion polygon just like a typical Call of Duty game, but you have a gorgeous well-animated undersea level where you will be inspired to draw a fanart over and over again.  And the music is very fitting to every mood. The dark part of this game is still going to haunt my nightmares. It's just that good.  I recommend everyone to play this game to experience the beauty of the underwater world.",
            "review_score": "1"
        },
        {
            "review_text": "I first saw ABZU at E3 and thought it looked like it was going to be a good game, so when I saw that it was out for £12 I had to grab it.  I'll start off with pretty much my only gripe by saying the game is quite short (2 hours straight playing saw me from start to finish), though there are collectables that I missed thoughout the game, and the environments and fauna in the game are so large and diverse that there is certainly way more to see!  Graphically this game is absolutely stunning, I didn't realise it was running on UE4 until I finished it and saw it in the credits. To think that this runs on the same engine as Killing Floor 2 just shows how flexible and impressive this engine really is. The colours are beautiful, and animations and controls look and feel super fluid and the game is just generally enjoyable to zen out and play. The soundtrack is also beautiful. I really hope more is done with this game, as it really is a perfect platform to expand on.  tl;dr   Game is beautiful to watch and play, though a little bit short.  Solid 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my most favorite games now. A story of a explorer who finds a mischief friend, only that both of you had a tragic end. Only then you reconnect together after being reborn in a new life and face the foe who brought you both down. Truly the most stunning in visual appeal and in story in any game ever. I never have a meet a game that has no words at all that can make you think twice about life. My most favorite game now in the world  Life is about who you love.  If you have lost someone close in your life I strongly advices you to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth the $. Overall, The game is a great way to just explore the ocean. The story line is left to be interpreted by the player and that can lead to so many possibilities. The way the game was designed (music, graphics, puzzles) really keeps you entertained all the time. The simple controls made it easy to explore. The music gave the ocean so much more dimension. The interaction to the world is fenomenal. The storyline is kinda short but there are so many things to do you could play it more than one time, each time focusing on a different aspect of the game like finding all the sea life, getting achievements, etc. The art in the game is breathtaking. I have never seen an exploration game create so much great work in each location. The interactions between the player and the environment is outstanding. I would recommend anyone this game, even if exploration games are something that they don't enjoy.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "What shall I say?  ~   Awesome   Graphics ~   Great   Music ~   Stunning   Atmosphere ~   Entrancing   Action ~   A Lot   Of Awesome Stuff To Do ~   1 Great Price    I spent a lot of time for just swimming with the fish or holding on the shark for a jump out of the water.  If I'll be a dolphin next life, I wanna be a dolphin in this freakin' game  10/10 for supporting these developers again.  Love it :)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game.  The first time i have played anything like it.   Abzu gives you an awe inspiring experience, something that left my mouth wide open at times. Incredibe visuals and soundtrack. you will often find yourself saying 'WOW'.  The gameplay is nothing complex, but it is fine for a game like this. Easy to use. A controller is highly recommended . There are many many fish . Amazingly animated .( some you wont expect!)    This exploration game , not too long and not too complicated . The story is interesting and the entire package is a real treat to your eyes and ears. Highly highly recommened.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is a wonderful experience. It has beautiful graphics, soothing gameplay, and a great, although minimal, story. That the story is minimal is a good thing anyway, because in the end, it's about the experience. The story still leaves an impact that you feel in your heart. The only con is that the game is pretty short, but it's worth playing over again anyway. I highly recommend ABZU if you want a peaceful game to lighten up your life.",
            "review_score": "1"
        },
        {
            "review_text": "What a beautiful game. The music and graphics make this a journey well worth taking. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful. So relaxing and inspiring.  If you love Journey, you'll like ABZU.",
            "review_score": "1"
        },
        {
            "review_text": "overall im giving it a thumb up.  but know that this is a direct copy of Journey, so it get off high ground but the latter is still the superior here.  if you never played Journey or owned a PS, do play this.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game if you love eyegasm. Anyway, it's sad that the game is so short but it was so fun and beautiful that it became one of my favourite games! I still have some collectables that I missed.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have ever played. This game makes you feel all kinds of emotions, not to mention the countless goose bump encounters I had while playing this fantastically beautiful and sophisticated piece of art.  10/10 would recommend buying it, worth every penny.   FANTASTIC EXPERIENCE.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of my most favorite games now. A story of a explorer who finds a mischief friend, only that both of you had a tragic end. Only then you reconnect together after being reborn in a new life and face the foe who brought you both down. Truly the most stunning in visual appeal and in story in any game ever. I never have a meet a game that has no words at all that can make you think twice about life. My most favorite game now in the world  Life is about who you love.  If you have lost someone close in your life I strongly advices you to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely gorgeous game. VERY short though. Just under 2 hours. It would have been nice to have some form of free roam beyond simply revisiting the chapters. But it is truly a work of art and it runs very smooth. For the price it is right now I think it is worth it. But think of it more like going to the movies. There are no real puzzles, no real dangers, and no time constraints. You control a player but you're for the most part an observer.",
            "review_score": "1"
        },
        {
            "review_text": "Such a powerful, emotional game. I'm not lying when I say I cried at the end. The last sequence was so powerful.  Amazing visually, emotionally, and every other ly I can think of.",
            "review_score": "1"
        },
        {
            "review_text": "This game is all about beauty. Nothing more and nothing less. If you enjoy a really beautyful game, jumping blue whales and mysterious underwater world I highly recommend ABZU to you. But note, it's not a thrilling game.   I didn't rush through it so you can imagine that the gameplay is quite short. But it's worth replaying it. The most fun part in my opinion is the last chapter.    Riding a shark is so awesome! :-)     ",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is the new way to spell beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Simply wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most incredible experiences of 2016.",
            "review_score": "1"
        },
        {
            "review_text": "I've been eyeing the game for quite a while before finally getting it on sale. My only regret was not getting the game earlier.   It's just absolutely stunning. The music, atmosphere, just plain pure perfection. Would totally recommend to get this if you play a lot of competitive or intense games. It comes real to close to actual meditation. Just sit back, relax and enjoy the view.   Of course, before getting the game, make sure your computer can handle it. It can get real heavy on the graphics. Personally, I experienced several but brief framedrops from time to time. Didn't ruin the experience for me at all though.  As an overall, 10 out of 10 :)",
            "review_score": "1"
        },
        {
            "review_text": "A fun experience very similar to Playstation exclusive Journey. If you enjoy walking simulators, or think games can be art, you'll love this.  Pros: The 2-hour playtime (on an average playthrough) is perfect for this game, as you feel like you've done everything. Most of the mechanics are introduced within the first 10 minutes, and the rest is easy to figure out.  Movement is slick and fluid, and the main character is animated very well. Absolutely gorgeous. The simple, bleak art style from Journey returns, but much more vibrant, colorful, and alive.  Cons: Camera controls are a bit lackluster, and control is taken away from you often.  Some sections feel like a derivative of Journey - it seemed like the game was trying to go for a 'wow' moment early on, but it hadn't done enough to deserve it.  If you're worried about price, get it on sale. There's not much replayability, unless you want all the achievements and collectibles. Overall, it's a pretty enjoyable experience, despite some faults. I give it 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is absolutely breathtaking. Great way to spend an afternoon.",
            "review_score": "1"
        },
        {
            "review_text": "A very magnificent game. Loved it so much. However, there is not much else than exploring the underwater environment and progressing by solving the easy puzzles; no story told to you (you need to figure it out via what you need to do and what you see from the walls of the ruins), no instructions with the exception of the most important controls and absolutely no information on what you're doing there or where you are supposed to go. There's no text aside from the menu and the control instructions in the beginning, which is actually nice since it won't distract from the environment.  Pros: +Very beautiful everything (the visuals, music etc); especially inside the pools was extremely magnificent +Lots of different fish. Like a lot. +While the fact that no story is told may bother some, it leaves space for player's own imagination. +An intriquing adventure,   while it looks peaceful, things turn quite sinister at some point   +The ending part was very rewarding (  how on Earth can you make a single Great White Shark such a touching character?!  ) +The controls are good for a controller +Completely playable at 30 fps although it looks even better at 60 fps (not that I had such a high framerate for more than a single moment once during the playthough, but I noticed the difference)  Cons: -It takes a while to launch -The options for camera pitch, swim pitch and camera yaw can be seen only in the menu while playing; plus, the pitch options were inverted by default, which caused me a fair lot of trouble until I stumbled upon the options -Playing with mouse and keyboard was quite awful when I tested it (thank the Force I got a controller as a Christmas gift); the note on controller being strongly recommend for this game is there for a reason! -While all the beautiful stuff must have taken a lot of work etc, you beat the game in a couple of hours; sure, if you decide to spend time on relaxing in the scenery and turning every stone to find everything, it'll take more than that, but for a couple of hours' game, 20 euros is a bit too much. Getting it during a sale is recommended.  Briefly: A magnificent short game worth playing, although getting it from sale is recommended. Absolutely get a controller if possible.",
            "review_score": "1"
        },
        {
            "review_text": "  there are truly no words to describe how amazing this experience yes it is way short but nothing short of amazing  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played and will ever play. Thist game is MASTERPIECE!!! I wanted to play it for such a long time and then today I got it as a present and it was one of the best game experiences I've ever made!   So, do I recommend this game?!!!  Hell yeah!!! It will took away about two hours or so of your life time for the first playthrough and for me it won't be the last one!!! Play it, like it and love it!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderfull GAMEE, The graphics was so beautifull and it was just a splendid game about oceans fishes and many moree definetly should buy this game is worth it !!!  GOOD JOB",
            "review_score": "1"
        },
        {
            "review_text": "Breathtaking visuals and amazing soundtrack. A quick ~2 hour experience unless you plan on completing all achievements (secret collectables). But what an experience it is. Extremely reminiscent of Journey which is a very good thing indeed.  And I think I formed an emotional attachment with a shark.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous looking relaxing underwater adventure with some of the most beautiful art of 2016. Despite the 'strong recommendation' to use a controller, it played fine with keyboard and mouse. While the game is topnotch in terms of what it does, it is also very short at around 1-3 hours depending how you play. At that length it's difficult to justify the 19,99€ pricepoint, but I definitely recommend waiting for a sale and then picking it up.",
            "review_score": "1"
        },
        {
            "review_text": "An experience about beauty and connection. Thank you Team ABZU for remembering us that video game can be something else.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, relaxing gameplay. A game to come down from a hard day. A little bit to short an a little bit lack of gameplay, but overall a beautiful game. Very fine music - Love it! :)",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is... an experience.  From the moment you start the game, you start with no knowledge of who you are and what is your purpose. But the game shows you everything, in the most beautiful way. With no dialogue and only by visuals and music, the game manages to tell an incredible and touching story. The atmosphere and feel of the game are so calm yet at the time other feelings are needed they are present and felt. At times, I felt at awe just by the mere understanding of where I am and what is around me, and felt so immersed in the game that every little thing was incerdible to discover. Finding the joy of every little part and feeling the tension of the darker parts made the game feel whole and immerse me in the game, making it feel like a real experience.  The game might be short, but the feeling joy, fear, anxiety, hope, and awe, enjoying the incredible and colorful visuals, and the amazing score that follows any moment worth every second.",
            "review_score": "1"
        },
        {
            "review_text": "Its great. Nothing bad about it. In just my 2 hours i had the most fun in a singleplayer game. Well done Giant Squid",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically a love letter to the sea. Stunningly beautiful. Possibly the closest you can get to the serenity of SCUBA diving without actually going SCUBA diving.   Seriously, there were moments in this game so beautiful and astounding they brought tears to my eyes. And made me smile, drop my jaw, and cheer at how well the developers portrayed the pure awe of the ocean.   As for game play, there's not much to it. You swim, you explore, you occasionally come across some collectibles. Nothing intense. Just a relaxing, awe-inspiring love letter to the sea. :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beautiful and relaxing gaming experiences of last year, if a bit short.  The game is NOT worth the asking price though, wait till you can get it for the price of a movie ticket.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. Nice animals. Deep ♥♥♥♥, and Im not only talking about the deep sea levels. Never thought I could feel this much for a great white shark. I would reccomend it, but it is a bit too short for the price. About 2 hours to finish the base game.   8/10 Buy it on sale. Maybe",
            "review_score": "1"
        },
        {
            "review_text": "Very wet Journey.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR - I can't recommend this game enough. At the time of this review, it's about the price of going out for a bite to eat and a movie (or less). Buy this instead, you won't regret it, and you can revisit it again anytime you want.  The game has no user interface or spoken words but instead uses abstract environmental storytelling. The controls are fluid and give a great sense of freedom in your movement. There is some light puzzle solving and an item collection challenge, as well as quite a few steam achievements. On my machine (i7, GTX 980) the game ran buttery smooth.  Abzu for me is an emotional journey of childlike wonder. It made an impact on me that is going to last a while, and I'm glad that I can go back to experience it all over again. I went into it expecting a simple game where I would swim with fish and whales and maybe learn a thing or two about the oceanic ecosystem. What I got was so much more than that, and I experienced a story that was told in a way that I hadn't experienced in many years. Fair warning, much of it is easy to miss if you don't take the time to look around and absorb what your seeing. This game is short, but so very sweet. In today's games, it's too easy to blast through them as we move to complete objectives. I had to unlearn that while playing this game, and take my time to enjoy and appreciate the experience.  I'll also say (hopefully without spoiling anything) that this game isn't exactly rooted in our current existence as we know it. Time is a thing, and if this game was an educational tool, it would reveal just as much history as it would what our ocean is like today. Speaking of educational tool, I wouldn't have any problem letting my kids play this. My son watched me play this game and said 'Woooooooow' more than a few times. And in closing, that is what I appreciate the most about this game. It reminded me what it was like to be a kid again, to look at the world through a different set of eyes that was curious and wondered in absolute amazement about both what exists and has existed in our world. I hope you, the reader will take the time to experience this, and will enjoy it just as much as I did.",
            "review_score": "1"
        },
        {
            "review_text": "This game is mesmerizing. One of the best experience I have ever had!",
            "review_score": "1"
        },
        {
            "review_text": "I had bought this game to try to get over my phobia of deep water and the things that can lurk in said waters. It's very beautiful and I was proud to get as far as I did. But idk if I can continue playing it. 2spooky4me.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone (including me) is judging this as an unofficial follow up to Journey, so let's tackle that.   It's very pretty, and Austin Wintory's score is amazing as always. Several scenes caused me to stop and admire the art direction, use of color and light, and bustle of fish all around me.   I finished in about 2 hours, finding roughly half the hidden shells and meditation points. I recommend the game whole heartedly, but for those looking for Journey 2, consider the following.  Moving the diver around is fluid, but often I wished it were faster. You can tap a button three times in a rhythm (tap-pause-tap-pause-tap) to get a brief boost, but I missed the soaring, zooming feel of Journey's traveler.   Austin Wintory's score is again amazing, but I wasn't as moved as I was with Journey's, possibly because the vague 'story' didn't add emotional resonance to the score. The music told me I was supposed to feel melancholy or excited, but the game didn't tell me why. Journey told an incredibly sad tale through environmental context, cave drawings and music. This game tries to do the same, but just didn't hit me the same way (emotionally) at all.   If this sounds negative, it isn't. I'm comparing it to one of my favorite games of all time, and perhaps the makers of this game set the bar a little too high by making so many obvious allusions and homages to Journey to begin with. Still, I don't regret buying it in the slightest. It's a beautiful game with a terrific score, and I'd recommend it to anyone who enjoys these type of explorative, meditative and artistic experiences.",
            "review_score": "1"
        },
        {
            "review_text": "Holy Diver You've been down too long in the midnight sea Oh what's becoming of me  Ride the tiger You can see his stripes but you know he's clean Oh don't you see what I mean  Gotta get away Holy Diver  Shiny diamonds Like the eyes of a cat in the black and blue Something is coming for you  Race for the morning You can hide in the sun 'till you see the light Oh we will pray it's all right  Gotta get away-get away  Between the velvet lies There's a truth that's hard as steel The vision never dies Life's a never ending wheel  Holy Diver You're the star of the masquerade No need to look so afraid  Jump on the tiger You can feel his heart but you know he's mean Some light can never be seen  Holy Diver You've been down too long in the midnight sea Oh what's becoming of me  Ride the tiger You can see his stripes but you know he's clean Oh don't you see what I mean  Gotta get away Holy Diver",
            "review_score": "1"
        },
        {
            "review_text": "Basically Journey but underwater. Exploration heavy, absolutely beautiful, peaceful, and very subtle in the storytelling. Recommended if u like artsy fartsy games.",
            "review_score": "1"
        },
        {
            "review_text": "Not really a game, more like a silent movie but absolutely beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Must-play  This is the Fantasia of video games",
            "review_score": "1"
        },
        {
            "review_text": "very peaceful, its basically journey underwater",
            "review_score": "1"
        },
        {
            "review_text": "What a game. WHAT A GAAAAAAAAAAAAAAAAAAAAAAAAAAAAAME!!! God, I never felt bored!  WHAT A GAAAAAAAAAAAME Cried 4 times.",
            "review_score": "1"
        },
        {
            "review_text": "Such an amazing game. Graphics are gorgeous and the gameplay is amazing. Definitely worth a purchase!  Just make sure you use a controller if you do plan to buy it. It is significantly easier with a controller",
            "review_score": "1"
        },
        {
            "review_text": "As beautiful as it is short, this is very similar to Journey but even shorter. Still, I recommend it for those who enjoyed Journey but keep these caveats in mind: -it's strictly single player -there's little replayability -exploration is minimal  oh but the pros: -musical score -flows easy, which is relaxing -controller scheme is a joy with sticks (no pun intended) -great art direction -Feelgood story, if ambiguous ",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy Journey than this game will hit all the same notes. It's beautiful, introspective, and philosophical. It doesn't hit quite the same climax at the end the way Journey does, but it follows the same recipe and is very good for what it is. Don't expect a ton of action or suspense here. It's not that kind of game. You'll get beautiful scenary combine with a moving score and overall message in about 1-2 hours of gameplay. Decide for yourself how much that's worth.",
            "review_score": "1"
        },
        {
            "review_text": "It is always exceptional when a game manages to be minimal while retaining the essence of what games are. Removing all the cruft modern titles are burdened with often leads to an experience that is refreshingly pure. Typically, this approach also leads to innovative, experimental mechanics that are fun to explore. Abzû looks like one of these titles, and I was very disappointed when I realised it wasn't.  There is a fine line between distilling elements to their core components, and removing them altogether. Unfortunately, Abzû crosses that line, and then some. The near-absence of mechanics turns the play-through into a radically passive experience, and without any form of compelling challenge or interaction, its status as a game becomes glaringly debatable.  Not that, as an art piece, it has no value. The soundtrack is particularly well executed, and the visuals, while nothing special, still hold up in their naive simplicity.  Still, while Abzû hits a few right notes, the extreme brevity of the experience (you will find that two hours are more than enough to consume it), compounded to the lack of interaction, make it a very hard title to recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Very emotional and beautiful game. You start feeling very connected to the ocean and by the end of the game I felt a strange sadness.",
            "review_score": "1"
        },
        {
            "review_text": "A bit short but still a really amazing experience. If you liked Journey it's instant-buy, if not it's still instant-buy :)",
            "review_score": "1"
        },
        {
            "review_text": "Loved every second of this game",
            "review_score": "1"
        },
        {
            "review_text": "Ooooh, I totally forgot to write a review on this one and now I'm obviously not right there anymore, but let me at least say a few words: I actually got this game kiiiinda for free at first, played through it, bought it and played through it again twice (it's not very long) because I absolutely loved it! Now, that's not even saying I would recommend this to everyone (although I would love to), and that's because if you look at it soberly there's not much of actual gameplay there. You dive through places, find some spots to interact with to get through to the next area, and... wow, that's actually pretty much it (apart from some optional collecting). I'm actually baffled about the lack of actual gameplay myself. So that's why I'm sure some people will be thinking 'this is dull and pointless'. However, those people probably don't have a heart :) I enjoyed every minute in this lovingly crafted place. The orchestral soundtrack fits perfectly and some scenes (although sometimes a tidbit corny) will give you goosebumps and an elevated feeling that very few games ever achieve to convey.  However, I'm sure not everyone will 'feel' this. Since I've always had a certain fascination for marine life I was especially susceptible to this :) This game might have felt absolutely ♥♥♥♥♥♥ if they didn't get the animals right, but that's where you see the developers love for the theme most: The animations (for hundreds of different species!) are breathtakingly realistic and the swarm algorithm must stem from a genious' mind. [Just think about how ♥♥♥♥♥♥ fish (and birds) are animated in other games (so I'm guessing it's just very difficult and/or a ton of work)]. That shoal of Jack Fish and the last (very satisfying) part of the game made my jaw drop!  The background story seems to be much more complex than it seems... there's some interesting speculations to be found online about Babylonian gods and stuff, but in the end you don't really need all that. This game is really more about the abstract experience I'd say.  If you are not the kind of gamer that said about Dear Esther: 'What's this?? This ain't no game! What's the point?' I would suggest you try this game; it's not very expensive after all and for me it became one of my personal favorites.",
            "review_score": "1"
        },
        {
            "review_text": "Wow!, simply an amazing beautiful experience.  A must buy.",
            "review_score": "1"
        },
        {
            "review_text": "This game was just amazing ABSU-loutely beautiful! It's just like an alternative universe of Journey. This is a 10/10 must play!",
            "review_score": "1"
        },
        {
            "review_text": "Never in my entire life have In ever experienced something like this game. It is absolutely beautiful, has a magestic soundtrack, amazing visuals and incredible gameplay. It isn't a game, it's an experience, but it's a gloriously wonderful experience that everyone should have.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely visually stunning game! I just wish it were longer!",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Journey this will make you very happy &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Short game.. bought it on 30% off  Graphics: 10/10  Sound: 10/10 Story: 6/10 ( don't get the story of the game ) Gameplay: 9/10 ( Relaxing &amp; Enjoyable )  TOTAL : 8.75/10",
            "review_score": "1"
        },
        {
            "review_text": "'From the art director of Journey®-' shut up. Take all the money I have and keep it forever.",
            "review_score": "1"
        },
        {
            "review_text": "First, this game is very, very short. It took me about 2 hours to complete. That being said, I've never had a game better capture the feel of wonder you have travelling beneath the sea. Level design and lighting is done perfectly to capture a sense of endlessness, and small interactions (like predators seeking and eating their nature prey) are very delightful. I thoroughly enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the first games where I was actually sad it ended so quickly.",
            "review_score": "1"
        },
        {
            "review_text": "I was really excited to get into this experience of a game but I was dissapointed to see that even though I met all the minimum requirements and over and the game was unplayably laggy.",
            "review_score": "-1"
        },
        {
            "review_text": "ABZU is one of the most beautiful and soothing games I have played in a long time. If you like fast pace or action then stay away from this because it isn't for you. If however your looking for something very relaxed then ABZU is perfect, almost like a break from the action.   The soundtrack is beautiful and very atmospheric, the graphics are gorgeous and while there isn't much gameplay as such its more about the experience and seeing the sights. Like I said its more of an experience than a game, if your looking to unwind, relax and experience a beautiful but calm game then this is for you and I would 100% recommend it. If you want something a little fast paced or with a little more gameplay rather than just swimming from A too B and looking at all the pretty things around you then give this one a miss because your gonna get bored very quickly.  In all I would 100% recommend this game to anyone, like I said if you like lots of gameplay and fast paced action this ain't for you but other than that I'd recommend anyone to pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Teenage daughter got bad motion sickness playing. Game looked nice, and she was a huge Journey fan but said it lacked direction unlike Journey where you know the goal of the game at the start- reach the mountain.",
            "review_score": "-1"
        },
        {
            "review_text": "My girlfriend forced me to buy this rather than Deux Ex......",
            "review_score": "1"
        },
        {
            "review_text": "Abzu, it came at a time I needed it most. A beautiful, strikingly heartfelt rush of joyfully connected experiences. The closeness and delicate nature of the music and imagery ties together flawlessly in a way that almost begs you to become overwhelmed at it's beauty.   A wonderful experience though hindered by performance issues and a seldom comfortable camera. For me, 30fps at 1080p with a 970 in some of the more demanding parts was a touch too jarring, but generally speaking a 60fps experience at 1080p.  Was shocked at 4k being a sub 30fps experience, though I'm not sure if the game is optimised or if there really is that much going on under the hood. Performance issues aside, a beautiful game.   Thank you for making it!",
            "review_score": "1"
        },
        {
            "review_text": "You can ride dinosaurs! 10 out of 10, 100 out of a 100! best game, best game!",
            "review_score": "1"
        },
        {
            "review_text": "I'd probably only recommend it if it is on sale for most people. I really, really enjoyed this game and had a few moments where I was profoundly touched and moved by the experience.   It can be completed in 3 hours if you really rush the story, which is mostly linear but each area is very beautiful and teeming with plants and aquatic life to explore.   There's no dialogue and the story is vague/open to interpretation, which I feel makes it more of an indie title that a lot of people will feel is pretentious and style over substance.   That being said, I personally feel this title is genuine and I loved all aspects of it.   A very relaxing and gorgeous experience -- dim your lights, calm your mind and get lost beneath the waves.",
            "review_score": "1"
        },
        {
            "review_text": "Best graphic ever! Truly amazing!",
            "review_score": "1"
        },
        {
            "review_text": "8/10 too mutch water",
            "review_score": "1"
        },
        {
            "review_text": "An amazing experience! Not really a game but I enjoyed every minute of it. The feeling of depth and realism take you to another world.   Just a warning. Graphic card optimization is very poor. Can't get solid 60fps even with 2 GTX 1080's running in SLI at 4K. Obviously doesn't support sli at all. Even at 1080p resolution the game struggles to maintain 60fps with Ultra settings. Odd, as everyother game I own locks at 60fps no problem with max settings. Still as 1080p resolution its amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Gorgeous. Great music. No clue what I am doing (its discorvery dude). Definitely recomend.",
            "review_score": "1"
        },
        {
            "review_text": "great journey through the ocean",
            "review_score": "1"
        },
        {
            "review_text": "... ... ... (weep T-T)   Just like Journey, you go on a linear journey in teh deep mysterious ocena, where an underworld is about to be discovreed by you. Best game in my opinion! Glad they really nailed it again. Short though, but awesome!",
            "review_score": "1"
        },
        {
            "review_text": "i cannot play this game due to cooked and uncooked content.I know this is a great game. can someone please explain.",
            "review_score": "1"
        },
        {
            "review_text": "Bought Game. Started it. 2mins in began taking screenshots. 30mins later: went to buy a new keyboard cuz screenshotbutton quit.  10/10 would wreck my F2 again",
            "review_score": "1"
        },
        {
            "review_text": "An amazing experience! Not really a game but I enjoyed every minute of it. The feeling of depth and realism take you to another world.   Just a warning. Graphic card optimization is very poor. Can't get solid 60fps even with 2 GTX 1080's running in SLI at 4K. Obviously doesn't support sli at all. Even at 1080p resolution the game struggles to maintain 60fps with Ultra settings. Odd, as everyother game I own locks at 60fps no problem with max settings. Still as 1080p resolution its amazing.",
            "review_score": "1"
        },
        {
            "review_text": "holy fish,,, this is wet!",
            "review_score": "1"
        },
        {
            "review_text": "8/10 too mutch water",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is a beautiful game from Giant Squid. It has an interesting narrative, beautiful scenery and a lot of fish.   It's a short but sweet game with some puzzles, exploration and collectables.  I would 100% recommended this game even if you weren't interested at all from the trailer and screenshots.  I don't regret this purchase one bit and i don't think you would either.  9/10  I still love this game, thats why i nominated it for the Steam awards!",
            "review_score": "1"
        },
        {
            "review_text": "Journey 2.0",
            "review_score": "1"
        },
        {
            "review_text": "Stunningly beautiful game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have been less then 20 minutes into the game, have no idea what i'm doing but ; just wow. I have enjoyed every second. This game is beautiful. Smooth, fluent for the release. It was a gifted game but I plan to continue right now.",
            "review_score": "1"
        },
        {
            "review_text": "When I die I wanna go to this world :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty much an interactive, underwater version of Fantasia.   A truly beautiful piece of art. Well worth your money and time.   Play with some headphones or a good set of speakers turned up.",
            "review_score": "1"
        },
        {
            "review_text": "the controls are ♥♥♥♥ and the length is short but lets just say if the graphics were a person id ♥♥♥♥ em",
            "review_score": "1"
        },
        {
            "review_text": "No Man's Sea",
            "review_score": "1"
        },
        {
            "review_text": "Best game cried when Jeff came back 10/10 Just enough water",
            "review_score": "1"
        },
        {
            "review_text": "I picked up this game with almost no context. I saw an article on some gaming website about it, thought it looked pretty, and bought it. And that is why 100% of people will buy this game; it looks incredible. You don't need a review to tell you that. The art style and every aspect of the execution is truly gorgeous, with every chapter having very different visuals, from colour palette to assets. Almost every mechanic in the game is geared towards showcasing just how beautiful a game they made; vents in the floor do nothing but release more species of fish to swim around, statues allow you to 'meditate' and look at the underwater landscape from a fish's point of view... It's all very well done, although very graphics-heavy given how they went for a pseudo cel-shaded look, as the huge amount of fish on screen at any one moment can often tax your PC quite heavily. Many moments are truly breathtaking; swimming in a jet stream with schools of fish all around you, swimming alongside blue whales, and watching sections of the ocean come to life as you restore them.  The control scheme is possibly one of the most satisfying implementations of swimming ever; moving is fluid (lol), your character looks graceful and feels excellent to move with. There are the odd niggly moments where they'll veer in a direction you didn't intend, but this happens very rarely. Jumping out of the water like a dolphin is great fun.   The music is also excellent; a full orchestral and choral score that really enhances the experience, yet isn't intrusive. It isn't quite atmospheric, but goes a little further than that, and makes the game's more beautiful moments just that little bit more jawdropping.  Now for the parts they didn't do so well. The game has practically no plot, which is not necessarily a bad thing at all, but what little they did include feels stilted and too minimal to be worth anything-- about halfway into the game you'll start encountering these tetrahedron shaped things which act like depth charges, they'll make a menacing sound when you get near and will zap you. These guys are the 'villains'. Yeah. But because the game doesn't have a life meter, or any way to die, the 'threat' these things are supposed to pose is actually non existent. The parts of the game where you have to navigate through fields of these things may as well not be there, as you can bump into as many as you want with no penalty other than slowing down. Honestly, it just feels like an attempt to introduce something other than swimming and fish, and it doesn't quite work.   Early on you will encounter little floating bots that you activate and will follow you around. They're required to progress as they remove coral walls for you, but having them floating around constantly is incredibly annoying and detracts from the nice feeling of swimming around with the fish. They soon disappear after the halfway point, but they are an annoyance whilst they're there.  Finally, the length. This is a two hour game, and once you've experienced everything the game has there's not much incentive to go again. There are a couple of collectibles in the form of shells, I'm not sure what they do (I'm fairly sure I didn't get all of them the first time) but really not enough to make me want to go back again immediately. Perhaps once some time has passed I'll get something more out of it, but I doubt it. Again, not a bad thing, but with a £15 asking price, is it worth it?  Maybe. This certainly is an extremely artistic game, with the emphasis on the 'artistic' part. The gameplay doesn't stretch any further than swimming from point A to point B, but this is a game that really is about the adventure. The feeling that this game gives you, a truly childlike sense of wonder and freedom, really does have to be played to be fully understood. This game truly is a memorable gem, even if that memory is a little short.",
            "review_score": "1"
        },
        {
            "review_text": "It was abolutely amazing. The music paired with beautiful atmosphere creates a relaxing adventure that's well worth playing.   I honestly didn't know what to expect when starting this game, but I was happily blown away. If you're in the market for an action game then maybe this isn't for you, but if you want a beautiful and calming experience that will engross you then this is the game for you.   It was an emotional experience and a game I would easily play again.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent. This is one of those games that walks the line between the experience of playing a game or watching a movie. The play time is short but it is 'short and sweet' in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Abzu is an amazing game, it's so simple but you make such a connection to it, it's possible to spend hours just wondering arround just looking to the amazing art design.",
            "review_score": "1"
        },
        {
            "review_text": "I was kind of looking forward to playing this game, and I can't help but feel a little disappointed from the result.   Well, okay, I wasn't expecting something that fantastic. But I was expecting something that made me- you know- FEEL something!  ABZU is the first creation from Giant Squid, created by the art director of the games Flower and Journey, Matt Nava. Now, before I talk about what ABZU is about or the gameplay or all that whatnot, I think it's fair that I shoot off my opinions about Flower and Journey first.  You know how much I love to do that.  Flower is pretty average. The visuals are stunning and it controls marvelously, but the story behind it is pretty bland. It focuses too much on the nature vs. man conflict and doesn't do anything that creative or new with it. I get it, Flower. I'll start using eco-friendly lightbulbs. Get off my f***ing case!  Journey is pretty damn good. Again, it's conflict is too similar to Flower and I didn't get much out of it. I didn't feel that the threat was that imposing, but I loved the visuals and controls once again. I also think the puzzles, silent storytelling, and link-up play with strangers made it feel a lot more genuine. Did it deserve game of the year 2012? Not really. But it's still worth a look at.  ABZU follows a lot of similar themes to these games, which is to be expected after coming from a guy who worked so hard on these previous games. I may not love them as much as other people, but I do think there was a lot of effort put into them nonetheless. However, ABZU feels a bit lazily made in some regards.  How? Well, that's the tricky part.  I think, yet again, that the visuals are stunning. The underwater world of ABZU is breathtaking at times. The sea floor is designed in a cell-shaded cartoony theme but each environment you explore varies enough in structure and color palette to give a sense of discovery and each looks unique and beautiful enough to warrant appreciation. The fish that habitate the world make it feel alive and bustling with energy and each fish is designed uniquely with different swim patterns and tendencies. To be brief, this game really makes you feel like an scuba-diving explorer.  Along with that, Austin Wintory makes his return to composing another excellently-done video game soundtrack. He did a fantastic job in Journey, and I personally think he outdid his work with ABZU. Some of the songs that play are so seamless that they help draw you further into the action or calm that happens within the game. One of my favorite tracks is 'Delphinus Delphis', that really captures the essence of swimming through a fast jetstream filled with millions of fish swimming about all around you. It captures the wonder, the danger, and excitement within ABZU wonderfully, and I think Wintory is definitely getting the recognition he deserves. I certainly hope he keeps going on to compose more video games, or even some movies in the future.  Well, it does sound like I like ABZU a lot, doesn't it? But you know me. I can never truly love anything, especially a game revolving around the sea. It reminds me of when I was a young boy, living alone on a small island in the Pacific when I would sleep alone, shivering beneath the palm tree as the waves would bash the eastern side of the island, as if to frighten me. I've been scared of the ocean ever since.  If you believed that story, congratulations. You're gullible.  No, what does bother me about ABZU is the laziness of the story-telling. For one, it relies on you befriending this shark that's introduced in the game but I didn't have much reason to do so. He acts very showy and aggresive, but after saving him he doesn't really do anything. And when they try to pull on your heartstrings, it just felt very rushed and forced.  Along with that, I groaned when I saw events unfurl in ABZU the exact same way they did in Flower and Journey. Yet again, there is an all-powerful, dying, destructive force that is imposing itself on the environment and nearly overpowers you, until you find the magical power of 'the first thing we pulled out of our a**es' and you finally crush the big, evil... thing and save the world! I was hoping it would do something a little different, but the writing fell back on the same conventions built on Flower and Journey which are, in my opinion, weak. I never felt that intimidated by the big-machine-thing because it didn't pose a real threat. I'd already restored the sea-coral-magic-things and the mines set up all over don't even kill you, they just stop you for a couple seconds. That's not scary. That's annoying and tedious.  The gameplay is also significantly weaker in ABZU than it was in Journey and more on par with Flower. Oftentimes, you're left to explore a large room with two switches put somewhere randomly around the room that will both open the door. It's not challenging or engaging. It's boring, and far too often does ABZU rely on the big-room-two-switches-one-door idea that it feels very lazily designed. In Journey, you often had to use teamwork or your own know-how to solve the puzzles set before you. They weren't that challenging, but they were something! With ABZU, it feels more like you're doing the same thing over and over. You swim down a jet stream, follow some whales, go through a giant robot door, find two switches, open a door, wash, rinse, and repeat.  I still think ABZU is worth playing, if you like this sort of game. I'm just disappointed that even with a fresh new design team, ABZU can't help but feel like just another game made by thatgamecompany, but this time it's underwater. It's certainly beautiful and excellently-scored, but the execution of the story is so bland and forgettable that I couldn't be bothered to remember it within the next week. But that scuba diving and underwater exploration was so engaging that I might go back and play ABZU simply for that pleasure alone. I'm giving ABZU a 7/10.  Also, don't worry about the warnings for having a controller in this game. It controls just fine with a keyboard and mouse. Take my word for it.",
            "review_score": "1"
        },
        {
            "review_text": "Go on a sightseeing tour, a very linear and repetitive tour across a very boring body of water where you meet a shark.   In all seriousness, this game was not fun for me. Although the game did not run well on my PC, I do feel that the problem is further beneath that.  If you are not interested in game graphics, this is not for you. If you are interested in a game that breathes lore intrigue and has something special tying it all together, this is not the game for you. If you enjoy a movie where everything looks beautiful or you enjoy doing the same thing over and over again then you probably already bought this game.  Also, the game recommends a controller. I ended up using my retired 360 controller and everything went well until I had to actually use it. In short, the controls are a mess with or without the keyboard. Holding right trigger to swim the entire game was not fun and could have just as easily been replaced with simply moving the left stick forward and directing with the right stick. Everthing else is unintuitive but can easily be fixed by editing the controls, something you can't do with the swimming controls.  tl;dr You should buy this game if you like biomarine sightseeing tours. Otherwise, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "A great way to spend 2 hours especially if you have psychedelics :3",
            "review_score": "1"
        },
        {
            "review_text": "Love this title, if you ever had the pleasure of owning a Dreamcast and Played Ecco the Dolphin, your sense of deja vu will get quite intense when you play ABZU. The art style is very beautiful although I did sometimes wish that it had embraced a less handrawn athestic. Playing on a Steam controller is a must for this one, with careful editing of the standard controller so that the right hand thumb pad has less friction, suddenly you have one of the best games to show off the hardware. The game is so very relaxing to play, its a joy.",
            "review_score": "1"
        },
        {
            "review_text": "srsly play",
            "review_score": "1"
        },
        {
            "review_text": "I beat it so fast I could refund it afterwards   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to play Journey but don't own a PS3/4 or want to set up an emulator and try to get it to work?  Buy this game.. closest you will probably ever get to it.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fishtank screensaver with great music, ruined by horrible controls and some questionable gameplay. Probably worth the sale price, overall meh.",
            "review_score": "-1"
        },
        {
            "review_text": "too much water...",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT LIKE THE CAMRA AND CONTROLE STYLE AT ALL IT SHOULD BE FIRST PERSON",
            "review_score": "-1"
        },
        {
            "review_text": "If you like awkward, inconsistent controls, raising the level of the water temple over and over again, and watching everyone you know and love die, this is the game for you. I could recommend this as a relaxing zen game if it weren't full of horror-esque scenes with spooky music and devil bots. There's also no story or exploration; you just swim down hallways and press the interact button as the game directs. It is, however, very pretty.",
            "review_score": "-1"
        },
        {
            "review_text": "i cringed",
            "review_score": "1"
        },
        {
            "review_text": "DISGRACEFUL MY STEAM WONT RUN IT",
            "review_score": "-1"
        },
        {
            "review_text": "For the first 5 minutes of this game learning the controls was really fun but then it crashed. Now it only crashes and will not open. Hopefully there is a fix sometime soon.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played this game and finished it-- There's two hours of my life I'm never, EVER getting back. My first thoughts on this were shock and awe-- it looked like it was worth the $20 I handed over for it. Really, it's better to just map my thoughts of the game. First impression: This looks good, the landscapes are amazing. Midway through the game: ...this is starting to get boring. Arriving at the wreck: Oh, look, a spaceship! I think. That's interesting. After going through the wreck: ...seriously? Penultimate chapter: Okay, whatever is at the end of this story, it had better be absolutely worth every second of this tedium. And then the finale rolled about. By that time any positive thoughts I had about this game were drowned by a constant annoyance at just how tedious and  slow  it was. Adding to that was just how disappointing the ending was. I was actually thankful for the credits which I spent staring at the screen trying to filter this annoyance of mine into words.  TL;DR: This is No Man's Sea-- Interesting name, interesting premise, sloppy, tedious delivery that feels more like doing chores than an actual game. It's a shame I just passed the two hour mark, since that means I can't refund-- Not that I won't try anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "ABZU is a fantastic game. The graphics are beuatiful, the music is fantastic, and my playthrough I enjoyed completely. But here's the thing: it's short. Rediculously short. When I buy a 20 dollar game, i expect it to last a little while, but not with ABZU. I beat the entire game, taking my time, collected every secret shell, released every fish, in 94 minutes. Like, I said, the game itself was fantastic, and I enjoyed the experience, but 20 bucks for a little over an hour of gameplay? Give me a break. But I mean hey, you can buy it, play through it, then refund it for full money back. Guess the dev's didn't think that part through...",
            "review_score": "-1"
        },
        {
            "review_text": "I got as far into the game as the giant squid logo, then made a few ocean noises and left me with a black screen. Save your money.",
            "review_score": "-1"
        },
        {
            "review_text": "The game looks pretty but the control and the camera are horrendous on PC. Quite unplayable without a controller imo.",
            "review_score": "-1"
        },
        {
            "review_text": "I LOVE THIS GAME BUTS ITS ONLY AN HOUR AND THIRTY MINUTES LONG!!!!!!!  This game is absolutely phenominal. I love it. The music is preformed by a real orchestra of violas and clarinets, cello and a whole choir. The visuals are some of the best I've seen all year. it runs smooth and in my playthrough there were zero bugs.  The ONLY PROBLEM is the the entire game is only 1 to 1.5 hours long. Its worth a but on sale but even fifteen dollars on launch for a 1 hour and thirty minute game is not worth it me.   Wait till its on sale and make sure to wishlist this masterpiece.   ",
            "review_score": "-1"
        },
        {
            "review_text": "The game performs rather poorly. On all LOW settings on specs that exceed what's recommended, I get dips to 45-50fps. I expected to run this at smooth 60fps. Rather disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "A short but completely magical and awe-inspiring game which revealed my true love for Mr. Sharky",
            "review_score": "1"
        },
        {
            "review_text": "What can I say... this is not really a game, the gameplay is mostly about swimming around and solving trivial puzzles, and it can be completed in less than two hours.  But... this is a love letter to the ocean.",
            "review_score": "1"
        },
        {
            "review_text": "That was one of the most beautiful games I have ever played, it has an incredible story and the bonds that you will feel, you will feel deep within. Plus it is still amazing on keyboard...no controller necessary.",
            "review_score": "1"
        },
        {
            "review_text": "  I received this game for free from Nvidia. It is a visual stunning gaming with an amazing soundtrack. Very relaxing and makes the player want more. I just so happened to keep playing everytime I would find the ends of stages and to my suprise, ended finishing the game in a little under 2 hrs. It is an immersive experience but very short. I kind of wonder about the backstory of the hero, interesting nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "  Best game iv played in a while. With great music and beatiful grafics and surroundings",
            "review_score": "1"
        },
        {
            "review_text": "If you ever need proof that a good game doesn't need to be long, deep, have a multiplayer and all that ♥♥♥♥♥♥♥t, buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! very beautiful graphics and soundtrack. Short but would recommend if you dont mind spending $20 on something that you'll likely only play once. No regret from me.",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually write review about games but this... This is not a game! Its a masterful visual design and sound presentation that would make you fall in love with this peaceful ocean and its character. It has a short and sweet story that revolves around 'Ocean of wisdom' and I would recommend this game to anyone who would love to experience a remarkable story with alot of emotions.",
            "review_score": "1"
        },
        {
            "review_text": "Great beautiful game! I did like the fact that when i tought the game was over it still had a little tail. Playing with keyboard was totally ok in opnion. ",
            "review_score": "1"
        },
        {
            "review_text": "IF its what you are looking for, you will love it.  I was looking for it.",
            "review_score": "1"
        },
        {
            "review_text": "This  Game  Is  Beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "This to me is not a game.   As i heard greatness from ''Journey'' I was trilled to try for the first time a game of the same gendra. Yet i was a little disapoint with the result...   It is an ''Artventure'' experience which is incredibly beautiful. The art work built for that game is outstanding and the music make a perfect fit for the mood of the game.   This clearly is an other ''game gendra''... But, as a ''Traditional Gamer'', I find hard to say that this game was challenging in term of difficulty. There is no puzzle or dexterity challenge. there is no way to die or let you know that you are winning or loosing which fits perfectly with my opinion. This is not a game.   I cannot Recomand this as a game...Yet, this work need a place in a museum, it surely needs Augmented Reality to feel 200% the gorgeousness of the Artwork.",
            "review_score": "1"
        },
        {
            "review_text": "True to form with the other Matt Navas games I've played, I had to sit there for a moment contemplating life. Abzu is a stunning game and while not quite as memorable and affecting as Journey, it'll live long in my memory.  For those of you thinking 'Is this for me?', you're predominantly exploring along an expansive, but linear, path. There are collectables and some light puzzle solving but you're mainly there for the feels, man.  You also get to rescue loads of fish.",
            "review_score": "1"
        },
        {
            "review_text": "The game may only last about two hours, but wow is it beautiful. A very pretty game worth supporting, and good for meditation or relaxing vibes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing with its breathtaking graphics and unique designs, i never imagine Ocean Adventure can be this beautiful if its only even in a game. In each area you get to have unique and different species of sea creatures to intereact and explore, the scenery OMG, JUST HEAVENLY BEAUTIFUL WITH THE OCHESTRA MUSIC.",
            "review_score": "1"
        },
        {
            "review_text": "its a beautiful game and an awesome adventure just like Journey. But the only thing that kept me from exploring just as much as in Journey are the controls.  I really did not feel like exploring every corner because the controls are so hard to grasp sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game it looks beautiful",
            "review_score": "1"
        },
        {
            "review_text": "Abzulutely amazing! Had a lot of fun, and it has amazing visuals.",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric, very colourful. I'll be honest, open water - even in games - freaks me right the hell out. This however I enjoyed. Abzu makes everything seem so peaceful, even when a large marine predator goes into a feeding frenzy right by you it's hard to get stressed out. Best way to play here is to take it easy and just watch what unfolds around you, might not even feel the need to move for a good while. Anyone only interested in blitzing it through a game in forty minutes or so (which is not only possible but exactly what I tend to do) is going to miss a lot of the point here.  So the obvious elephant in the room is the influence of thatgamecompany. Several members worked on this and there are definite visual and story influences from their games. Personally I'm a big fan so I don't see a problem with this, but if it's something that would bother you (for some reason), go in pre-warned.  Only real issues I had with the game technically were getting it to start up, which could be a little unpredicatble at times. And framerate drops when a lot was going on. I know I'm not using the best system for gaming so I have the lowest settings on. I would absolutely love to fire it up on a high def system eventually and just bathe my eyes in the aquatic gorgeousness.   For anyone who's a fan of thatgamecompany, you want this. For anyone who isn't, what's wrong with you?",
            "review_score": "1"
        },
        {
            "review_text": "absolutely loved it. A bit of mystery, a short gripping story and in my eyes a good completing ending. And of course the stunning Journey like visuals.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful soundtrack Beautiful environments Beautiful controls Beautiful narrative  This is a work of art.",
            "review_score": "1"
        },
        {
            "review_text": "So much sploosh",
            "review_score": "1"
        },
        {
            "review_text": "A very worthy successor to Journey, really enjoyed taking the time to explore every place in the game! The music fits the visuals perfectly!",
            "review_score": "1"
        },
        {
            "review_text": "This is a stunning game, with beautiful visuals and soundtrack. The storywhile minimalistic, is present and interesting. It is actually derived from the ancient Babylonian epic 'Enuma Elis'. It is short, but I know that I will definitely be coming back to swim with my favorite fishes again soon.",
            "review_score": "1"
        },
        {
            "review_text": "Stunningly beautiful experience!! This is a piece of art. The graphics, aswell as the soundtrack could not be better. After just having been disappointed by No Man's Sky, this makes my day better again : D",
            "review_score": "1"
        },
        {
            "review_text": "This game was absolutely gorgeous and I seriously recommend giving it a shot. I couldn't find anything wrong with it outside of the lag and occasional glitch. The only glitch I had was with the small robots, the engines didn't render properly or something so half the time they were strobing blinding white light in my face.   All in all the game was quite the experience and I don't think I cried that hard in a long time, not over a game at least. The last game to make me cry like that was Bioshock: Infinite.   Abzu stirred up many different emotions inside me and I absolutely loved every minute of it.While I'm certain it may not be for everyone, it's a gaming experience I won't forget any time soon.",
            "review_score": "1"
        },
        {
            "review_text": "Ride all the fish! Kill all the    triangles   !    Sharks    will help you!",
            "review_score": "1"
        },
        {
            "review_text": "I love leaving meditate mode on and just acting like it's my wallpaper it's just so gorgeous. Although it is short I definitely would prefer this to a movie.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful game, just like Journey you communicate with your surroundings with ping noises, catching bits of the incredibly heartwarming story from the ruins scattered throughout your journey. Great soundtrack shifting from area to area to the point where you feel lost on the atmospheric depths of each zone. Would highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Best game i have played this year. It is honestly great i love everything about it.",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is an aesthetic game that let’s you dive into the ocean like no one has ever done before. With a wide variety of fish swimming through the sea there is much to explore. The controls feel just right in the hand with smooth gameplay. The graphics really stand out as much as the deep short story. Though this game is only a bit over 1 hour it entails a journey that is definitely unforgettable.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't normaly say much in reviews but this gem needs to be experienced! As an avid marine aquarium keeper and diver, this has to be one of the most beautiful and relaxing games I've ever seen. Yes the game is somewhat short but it'll last as long as you want it to. I found myself just lingering in one place just to swim and interact with the different fish species and smiling the whole time. What a great way to unwind after a hard day at work. Great Job Giant Squid. It is evident that there was a lot of love put into this! I hope to see something like i this in VR.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for anyone. Period. Especially so for those who are fans of Flowers and/or Journey for consoles. An excellent game all around with many odes and callbacks to the first two games mentioned. I have tested this on multiple setups and monitors. If you have a good rig, its really a beautiful game. More so if you have a 21:9 monitor (curved is even better) at 1440p (or even 4k) at full settings running at 60fps or higher (titan X or founders 1080).   As many have mentioned, it is absolutely gorgeous (some scenes are just jaw-dropping and amazing). And the soundtrack and overall quality leads to a very calming and almost cathartic experience. Again, as many have stated, it is a rather short game, but if you actually enjoy the experience, and dont run through it and take a lil time to explore some areas and ride some of the different sea life, 'm sure it could easily clock over 3-4 hours. Which i know for the price tag seems short, but all in all its quite worth it. Especially if you have VR because alot ofo vr games are 10-20 bucks and are basically demos and much, much shorter. Mentioning that though i will admit, if they had waited a little longer to put it on PS VR and on PC VR it would have been so OP. By far.   All and all a great game, fantastic port job, extremely fluid and immersive, lots of fun suprises and definitely one of a kind with little comparison except for Journey. Still totally worth it but if you have a limited budget i would say maybe hold off until you can get it on sale or hopefully in a bundle before christmas. Definitely a must buy and top ten of the year, only downside was i wish it was longer, as do most, but if you played Journey you know what to expect. Some replay value, mostly in showing off the great areas and scenes that standout to your friends and family or yourself again.,.   Graphics: 9.5 (Distinct, simple at times, overly complex at times but only to the brink and never overwhelming).  Optimization: 9.5 (would never think it was a port, extremely well running with zero bugs or big framerate drops even when you have 10thousand fish in a single school at one time or tons of other on screen goodies and animations).  Sound: 10 (could soothe a thorn-pawed tiger in a second). Effects come through so perfectly. If you have a good pair of headphones its an amazing experience and goes hand in hand with the visuals all the way.  Value/Replay Value: 7.5 (lots of production but no matter what is still beatable in under 2 hours, sadly enough)  Controls: 8.5 definitely requires a controller. Works well on xbox one and steam controller. May need a settings tweak and iversion on camera for some, i did.  Overall: 9.5        ",
            "review_score": "1"
        },
        {
            "review_text": "This game was absolutely breathtaking, stunning and peaceful. I love how similar it felt to Journey in the emotions it gives you while being its own story and environment. While it isn't a drawn out game, I feel that is actually far better. Each new area is packed full with things to explore and you don't have to spend a lot of time getting frustrated figuring out what to do. It's not designed to be a challenging game - it's a journey (lol) that you get to experience peacefully, soaking in all the beauty and connection with the wildlife. The soundtrack just ties it all together and even brought happy tears to my eyes at the end. I'm so happy I bought this game and look forward to playing games like it in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to be a fish?",
            "review_score": "1"
        },
        {
            "review_text": "You get to ride fishes like you're at a rodeo.",
            "review_score": "1"
        },
        {
            "review_text": "Found a rubber ducky. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "So, I just finished ABZU and I think about posting my thoughts about it while they're still clear in my mind.  First of all, if you like very visual games, by all means, get this game. There are many different colorful environments to explore.  This game has no dialogue. Absolutely no text in spoken nor written form. The story is told solely by visuals - just like a colorful picture book. So it leaves a lot for the player to think about. The way I see it, the story is told very much by metaphors. The world is in no way realistic - it's more like a beautiful dream. You can think what your dreams might mean - this game is very similar.  What annoyed me a little was the pacing. The climax arrived a bit too quickly. However, the fade out after that was on point which smoothened the rather spiky climax part making the game more enjoyable towards the end.  If you feel like seeing a visually beautiful story, by all means buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Review in progress:  Pros: After playing this game for merely 30 minutes, I can confidently say this is one of the most stunningly beautiful games I have ever played. After recently downloading indie games like inside, and starbound I was left feeling unsatisfied. This game offers such graphically immersive experience without being graphically demanding. The art is just beautiful. I started getting goosebumps out of the intense feeling of awe, as I swam through a jet stream with a myriad of colorful, beautiful fish, and out of nowhere comes these orca's. The feeling was overwhelming, and awe inspiring.  Con: Unable to use 1440p (2560x1440) due to weird resolution settings. Furthermore at 4k resolution (3840x2160) has some issues, its not very well optimized, as I have a rather high end pc, and can run high end games ie. The Witcher 3 without noticable framerate drops. There is fairly noticable framerate drops at this high of resolution for Abzu, as low as 20 fps. Finally the last complaint is the controls are a tad jenky until you get used to them, but they are fairly easy to get adjusted to. So, the controls aren't even that big of an issue, but it's the only thing I can honestly complain about.   Overall: I am cynical of every damn game I play. I felt the need to write this review immediately because this game is prestine and beautiful. The artistic direction has no fundamental flaws, it is unique, the soundtrack is beautiful, and the graphics are stunning. The artistic vision is truely genious, and that is not a word I loosely throw around. I have never played journey and this game makes me want to play journey. I have such a newfound respect for this artistic direction of this game. Its just amazing. Totally worth the price tag. Its just plain out awe inspiring, and beautiful. I was getting goosebumps at parts, because of the overwhelming beauty of this game, matched with a stunning, pleasant soundtrack, that makes the game feel more like an active movie, then an actual game. Read my other reviews and you will see that I am not just giving this a 10/10 for no reason. I've hated and complained about a great deal of other titles, that were well received.   Please consider buying this. My hope is this team will continue to make games like this, as the market is just flooded with simlar ♥♥♥♥♥♥♥t, and this is just the most unique game I have ever played. This game is just incredible, I can't ♥♥♥ kiss it enough.",
            "review_score": "1"
        },
        {
            "review_text": "Super relaxing game. Colorful enviroments, great soundtrack by Austin Winory, and runs great on my system (AMD 8350, R9 270X). Plays fine on mouse and keyboard. Only problem is that the sheer amount of fish makes it ♥♥♥♥♥♥♥ impossible to find Nemo.",
            "review_score": "1"
        },
        {
            "review_text": "A short but ultimatimately very enjoyable and whole expereience. This game takes you on a visual and emtoinal journey.",
            "review_score": "1"
        },
        {
            "review_text": "There is no reason not to play this game. In fact, everyone should play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Most gorgeous and soothing game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "So immersive...the music and soundtrack combines with the graphically beatiful coral scenery and interactions with the environment. Just superb.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!  Pros: -The Graphics Are Beatiful -Music is better than ever -A Mysterious Story  Cons: -It is just realy short... You can get trough the game in less than 2 hours.  I would recommend you buying it but not for $16, Just buy it in a sale for $5 :D",
            "review_score": "1"
        },
        {
            "review_text": "I am reviewing this as an ocean lover. I've been diving since highschool and just finished getting a degree in Marine Biology. That is my background.  If you want to know what my dreams are made of... just how mystifying the ocean feels...  This is it.   You can make every SCUBA simulator in the world, go ahead, try and make it as realistic as possible, but when you get down to it, this game will make you feel like I do whenever I jump in. The chills, the beauty, the flow of all things.  This is a masterpiece! I want to say more, but I can't figure out how to explain it!",
            "review_score": "1"
        },
        {
            "review_text": "I know comparing games to other games is lazy critique but...This game is underwater Journey, plain and simple.  But I mean that as a complete and total compliment.   This game is beautiful, simple, and fun. If you loved Journey, you will love ABZU. Great music, stunning visuals, and well contained exploration. Linear without being forceful about it. Great pacing. Surprising little plot twist that actually delighted me.   My only complaint is that the story element isn't as fleshed out as Journey's, or I'm missing it. I can gather quite a bit from the mosaics on the walls, but there's not enough to piece together the story as well as the small cutscenes in Journey did. I have little to no clue why these evil triangles exist, the significance of the magic water, or the temple, or the shark. I feel like I'm missing important context clues but if they're in game, I haven't seen them. A little more so that it was easily understandable would have pushed the game from the 9 I'm giving it into a 10/10. My other complaint is that I don't quite understand the hitboxes of the mines. My first playthrough, I only hit one. Second, I struck about seven of them, but I didn't seem to be closer to them than I was on my first run. So, that was a little offputting.   Oh: and when the game says a controller is strongly recommended? They aren't kidding. I can't imagine playing this with a keyboard and mouse. The controls are going to be a little erratic for you the first time you play because the camera, character direction, and character movement are all separate. The character does not move forward without the proper button press, and so you'll find yourself spinning in circles without going anywhere once in a while. Once you adjust, though, it's golden.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful atmostpheric game that will help you delve into a underwater world filled with life. Its story is emotional through its simple telling, and yet contains a whole culture and mystery within the linear progress. The soundtrack is breathtaking, swelling at critical points and immersing you into the game.  Abzu doesn't need dialogue or a tutorial. Explore and live, and this work of art will give everything it can.",
            "review_score": "1"
        },
        {
            "review_text": "This game is art, a gorgeous experience full of emotions.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic visuals combined with an excellent score is what makes this excellent. Less a game and more an interactive experience but totally worth picking up. Throw some headphones on and get lost in the ocean.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Journey, you are bound to like this game as well. I love both this and Journey, and I can see where ABZU borrows from Journey. Just go play this, you should experience it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, short just an hour or 2 but is replayable. Great game but a tad expensive. Get it on sale boi",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. One of my games of the year. My only issue is that it sometime has problems starting. Other than that, I have no complaints. Amazing environments, music, and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Phenomenal. Absolutely phenomenal. 2nd favourite game of 2016, next to INSIDE, respectively. Colour and music made this game a very powerful experience. Worth every penny, if not more.",
            "review_score": "1"
        },
        {
            "review_text": "An atmospheric adventure that will make you think about the wonders that lies beneath the seas, through a relaxing and poetic journey.  F12/F12, would screenshot again.",
            "review_score": "1"
        },
        {
            "review_text": "Wow just wow... exactly what you expected from the makers behind Journey. Instant Buy, Instant Love. You can't miss this game. This experience.",
            "review_score": "1"
        },
        {
            "review_text": "This isnt a game. This is an experience. An experience like no other.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Good atmosphere, nice music that compliment the game, stunning graphics. And do not forget the mysterious plot and story troughout the game. Only minus with the game is short...",
            "review_score": "1"
        },
        {
            "review_text": "Abzu very different kind of game but I thoroughly enjoyed it. The visuals, soundtrack, and overall artistic style really sucked me in all the way to the end. Although there is a focus on taking your time and enjoying the game's atmosphere, there are a few mysteries in the storyline which the game will keep to itself right to the end, but constantly pique your curiosity with clues and twists. I also very much appreciated having a game I could use to relax.  gamepad controls are great, wouldn't change a thing about them. If you plan to use a keyboard, don't. Playing through this game for the first time is a once in a lifetime experience you won't want to sour with the wrong controls. Not that the keyboard controls are poorly designed, it's just that with your character swimming through 3D space and a need to rotate the camera at will, keyboard and mouse really aren't the right input device for the job.  If you're after a challenge or long campaign, this isn't the game for you. The gameplay consisted of finding buttons and unlocking species to advance to the next area, and I completed it in about 2 hours. This didn't bother me at all though since there was plenty of fun to be had gliding through the incredibly diverse scenery while hunting for secrets, and actually being surprised (there are plenty of surprises) and entertained by how the game changed themes as I progressed.  You might want to think of those 20USD like a conert or movie ticket as you're more or less buying an experience.  I think I'd like to go back in and 100% the acheivements and secret shells. I have never had the attention span to want to do this with any other game which I think goes to show how stunning it is.  Absolutely beautiful. Must play before you die.",
            "review_score": "1"
        },
        {
            "review_text": "Short (slow paced/ fully explored 3 hours of gameplay), visualy stunning, mysterious underwater journey.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the most beautful experiences I've ever had in a game",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is a wonderful game and any words I could string together here wouldn't do it justice. Please play it.",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful game. Controls are alright, but once you get used to them you'll be swimming around to a beautiful soundtrack while thousands of fish swim around you.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the game. And to be honest i didn't want it to end. This is by far one of the most beautiful and best experiences i've had with a game. It has a great story, and effects you emotionally on a lot of different levels. It is the best 20$ you will ever spend.",
            "review_score": "1"
        },
        {
            "review_text": "A breathtaking experience that truly inspires awe! I'd consider it an 'art game' so it wouldn't be everyone's kind of game, but it had relaxed pace, peaceful gameplay and tells a very interesting story without any dialogue. ABZU was really refreshing, and a new favourite for me!",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful.  Everything from the scenery to the atmosphere.  Theres no clear story but if youre good with imagination, you will know whats going on.   Im definitely gonna keep an eye out on Giant Squid from now on because they really took me by surprise.   Much credit goes to the music developers as well, it was really enjoyable.    ",
            "review_score": "1"
        },
        {
            "review_text": "So much sploosh",
            "review_score": "1"
        },
        {
            "review_text": "suh gud maek me cri a lil but nat too much 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Epic game, no doubt.  Graphics are really cool, the music is super relaxing and brings a good vibe.  I'm not kidding if I say that the game gave me the chills from time to time.  Definitly worth giving it a go.",
            "review_score": "1"
        },
        {
            "review_text": "From what little time I have already spent on this game it is a beautiful, magestic, captivating and tranquil game that anyone can get into. With simple controls and a realistic aqaurium of sea creatures that'll leave you mesmerized and gaping in awe at what you will experience. I recommend this game to anyone willing to play it as it is both fun and interesting to all who wish to delve into the depths of such a fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most beautiful game I have ever played. This graphics are artwork. The story is divine. The gameplay is to die for. You just have to experience it.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say... this is not really a game, the gameplay is mostly about swimming around and solving trivial puzzles, and it can be completed in less than two hours.  But... this is a love letter to the ocean.",
            "review_score": "1"
        },
        {
            "review_text": "Blue heaven!",
            "review_score": "1"
        },
        {
            "review_text": "This game is purely amazing. The point of the game is basically just to enjoy the graphics, and have a relaxing trip through a magical ocean. 10/10!!!",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is a short and sweet adventure through a beautifully rendered underwater world. It is a fantastic experience marked by gorgeous visuals and score. While the game is short at ~2hrs long, it serves as a very relaxing break and lovely way to spend part of an evening.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely Breathtaking  ABZU is one of the rare few games where its goal is to take you on a spiritual journey, so it is of no surprise that the art director for Journey as well as Flower is leading the helm for this remarkable experience. ABZU draws many paralels to Journey with its story where not a single word is uttered and your imagination is set free to draw your own conclusions, as well as the stunning music that so elegantly draws you in to the experience and the beauty of the environment and the plethora of sea creatures in the many underwater edens. Yes, ABZU takes place almost entirely underwater, but unlike the other undersea games floating around Steam, ABZU is not a survival game, it is a broad but still linear narrative game based around art, exploration and relaxation. The only complaints I can mention are that the movement controls on a gamepad (XBOX 360 for me) can get some getting used to and occasionally I found myself swimming in circles. The other grievance I can mention, if it is a rather childish one, that the game was just a little longer, my end game time clocked in at 94 minutes. Even just a single level to bring it up to Jouney's length which I felt was perfect. I will still play it for many hours more to find all the hidden collectables and all the little secrets I'm sure are hiding in the deep, just a little forewarning for those that like big drawn out experiences.  Those aside, play this game. It is utter enrichment for the soul like its predicessors and give you imagination a fresh breath of air. If you got the cash to spare, go for it, I doubt you'll be disappointed. For others whose money is a little tighter, mark it on your wishlist and wait for a good sale to come around. But I assure you, ABZU is not an experience to be missed out on.",
            "review_score": "1"
        },
        {
            "review_text": "great game ",
            "review_score": "1"
        },
        {
            "review_text": "I bought games for $60 and asked myself why the f*** is thos s*** worth $60 and this game only cost $16 and i'm here like WHY THE F*** DOES THIS AWESOME GAME ONLY COST $16. Its super amazing go play it :)",
            "review_score": "1"
        },
        {
            "review_text": "Abzu is probably the most visually impressive game I have ever played! The environment that I found myself in was incredibley gorgeous!  However, Abzu's gameplay is very weak, and the game is very short. It's more like a virtual tour of some very impressive art work. That being said, the art and soundtrack is so impressive that it made the game worth a buy to me.",
            "review_score": "1"
        },
        {
            "review_text": "amazing experience, even for someone is afraid of big open ocean like me. love the art style",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. Really enjoyed playing it with my 4 year old daughter. Has some really great moments in the story that i wont spoil here",
            "review_score": "1"
        },
        {
            "review_text": "I'm stunned. I entered this game thinking I could live out a life long dream of being a mermaid and I left with a bucket of feels that ranged from giddy like a schoolkid to heartbroken with no reason to ever love again.  If you're looking for the most relaxing game to make you as unafraid of the ocean as possible, this is that game.  11/10 would break my heart on purpose again.",
            "review_score": "1"
        },
        {
            "review_text": "Super relaxing game. Colorful enviroments, great soundtrack by Austin Winory, and runs great on my system (AMD 8350, R9 270X). Plays fine on mouse and keyboard. Only problem is that the sheer amount of fish makes it ♥♥♥♥♥♥♥ impossible to find Nemo.",
            "review_score": "1"
        },
        {
            "review_text": "A short but ultimatimately very enjoyable and whole expereience. This game takes you on a visual and emtoinal journey.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful atmostpheric game that will help you delve into a underwater world filled with life. Its story is emotional through its simple telling, and yet contains a whole culture and mystery within the linear progress. The soundtrack is breathtaking, swelling at critical points and immersing you into the game.  Abzu doesn't need dialogue or a tutorial. Explore and live, and this work of art will give everything it can.",
            "review_score": "1"
        },
        {
            "review_text": "Though it lacks the emotional punch of it's main inspiration Journey. Abzu more then makes up for that with a nonstop barrage of colorful, imaginative, drop dead gorgeous splendor complemented by it's attention to detail and a rich and wonderful score by for my money the best video game composer working right now Austin Wintory. It might not be everyone's cup of tea but it's a relaxing, meditative, visually stunning deep-sea dive meant to be soaked up rather than sped through. And like most deep-sea dives it sticks with you long after you finish it.",
            "review_score": "1"
        },
        {
            "review_text": "It's boring after you finish it once but for the first time you play it it's pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This is a really nice little trip. It's pretty, and positive, and easy going enough for just about anybody to enjoy. It's a bit short (took me 1.3 hours), but it was a pleasant enough journey that I didn't mind in the end. I kind of felt like I had just had a very enjoyable movie experience.",
            "review_score": "1"
        },
        {
            "review_text": "Mysterious, Ethereal, Enchanting, Soothing and just plain heaven on the eyes and ears. Worth every penny for me and will play every now and then after enough time that i forget how beautiful an experience this game was just to see if i can get that same feeling all over again as the first time.  Was really sad at how short this was, but i don't think making it longer would have been any better as well.",
            "review_score": "1"
        },
        {
            "review_text": "Its like if BBC Planet Earth made a playable tech demo and threw it into the flooded set of El Dorado. Easily one of the most beautiful and breathtaking games that I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game that made a lasting, emotional impression on my wife and I. The art direction is simply gorgeous. Mechanics in the game are very simple and that made it easy to involve casual gamers in the experience. The game is short at around 2 hours to complete, but I believe that the experience was meant to condensed. I recommend grabbing it on sale and playing through it.",
            "review_score": "1"
        },
        {
            "review_text": "Very meditative game, beautiful scenery and great animations on the fish swarming around you as you explore the beautiful lush submerged worlds.  You could complete it in about 2 hours, which I don't mind since it was a great experience. However the ending felt a little rushed to me, maybe 3 hours-to-complete would have been better. Minor gripe though.  I had to mod ini files (simple though) to be able to play in 21:9 (3440x1440), which looks amazing by the way, but it felt kinda silly that a game like Abzu doesn't support the 21:9 resolution out of the box. I wish they'd patch this in, and maybe a FOV slider too.   I got it at -30% discount, so 12 euros or so, which felt like a fair but maximum price to me. Full price (20 euros at the time of writing) does feel too steep, not just because of the game itself, but because of all the other great games available on steam that will last you 50+ hours instead of 2 for the same amount of money.",
            "review_score": "1"
        },
        {
            "review_text": "To be able to submerge myself in this underwater simulation was beautiful. I felt one with the fishyz.",
            "review_score": "1"
        },
        {
            "review_text": "Makes me wanna ride a great white regardless of what happens afterwards",
            "review_score": "1"
        },
        {
            "review_text": "This is a truly beautiful game; I would say the best thing about it is the beautiful underwater seascapes it contains. It is also very relaxing, simple gameplay with the main goal being to get from level to level and enjoy the scenery. You also get to know the names of many of the fish and sea creatures it contains. The only negative was that it is really short (I finished it in 3 hours), however with this type of game there wouldn't be much point in making it really long; if it was anything like 20 hours long you would simply get bored. Certainly recommended for sea + diving lovers!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! very beautiful graphics and soundtrack. Short but would recommend if you dont mind spending $20 on something that you'll likely only play once. No regret from me.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful and entertaining game, though a bit short and at times repetitive, so I would only pick it up on sale.  I am a big fan of Endless Ocean 1 and 2 for Wii - so when I found out that this game was quite linear and did not focus on identifying the different fish the same way, I was a bit disappointed. However, it definitely has a lot of the same charm (exploration of beautiful areas, plenty of colorful and funny fish).   What I liked a lot about this game, is that there is almost no text. There is a storyline and things are happening, but you are left to your own imagination to put the pieces together. If you want to play a relaxing game, this is a good choice.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and atmospheric game.",
            "review_score": "1"
        },
        {
            "review_text": "An eye-wateringly beautiful game that calms you and puts you into an almost medidative state. The colours, the environment, the animals, everything is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "A short but amazing adventure. Colorful environments full of life, much of which reacts to the player in a variety of ways. Anemonies retract when disturbed, fish will dart out of the way or sometimes even follow you around, and some of the bigger critters can even be ridden around for a time. Not a word of dialogue, but the soundtrack more than makes up for it.   Some tenser, darker moments, but no combat, and overall a very relaxing experience. Tho short (beaten in 88 minutes), it welcomes multiple playthrus with various secrets and achievements, and I'm definitely gonna take another pass thru,",
            "review_score": "1"
        },
        {
            "review_text": "Abzu very different kind of game but I thoroughly enjoyed it. The visuals, soundtrack, and overall artistic style really sucked me in all the way to the end. Although there is a focus on taking your time and enjoying the game's atmosphere, there are a few mysteries in the storyline which the game will keep to itself right to the end, but constantly pique your curiosity with clues and twists. I also very much appreciated having a game I could use to relax.  gamepad controls are great, wouldn't change a thing about them. If you plan to use a keyboard, don't. Playing through this game for the first time is a once in a lifetime experience you won't want to sour with the wrong controls. Not that the keyboard controls are poorly designed, it's just that with your character swimming through 3D space and a need to rotate the camera at will, keyboard and mouse really aren't the right input device for the job.  If you're after a challenge or long campaign, this isn't the game for you. The gameplay consisted of finding buttons and unlocking species to advance to the next area, and I completed it in about 2 hours. This didn't bother me at all though since there was plenty of fun to be had gliding through the incredibly diverse scenery while hunting for secrets, and actually being surprised (there are plenty of surprises) and entertained by how the game changed themes as I progressed.  You might want to think of those 20USD like a conert or movie ticket as you're more or less buying an experience.  I think I'd like to go back in and 100% the acheivements and secret shells. I have never had the attention span to want to do this with any other game which I think goes to show how stunning it is.  Absolutely beautiful. Must play before you die.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me enjoy life for 2 hours - 10/10 would cry again.",
            "review_score": "1"
        },
        {
            "review_text": "From the art director Matt Nava, to the composer Austin Wintory, with environments meant to be explored, Abzu feels very much like a spiritual successor to Journey. The world, music, art, portrayal of various sea life… It all comes together to create one of the most visually stunning games of the year.  One could sum this game up as “Journey, but in the ocean”, and you wouldn’t be wrong. But there are so many surprises, and so much more in Abzu, that doing so would be a disservice to this wonderful experience of a game. There are so many exciting and awe inspiring moments that I don’t want to talk about this game in any way other than “You have to check it out for yourself.” as it’s an adventure you don’t want to spoil.  As Journey was before it, this game is simply spectacular, and has definitely become a new favorite of mine.",
            "review_score": "1"
        },
        {
            "review_text": "Great 'game'. I use airquotes because its not so much a game as an experience. I had heard about this game and was on the fence, but ended up buying it during a sale. So I can say that the graphics are BEAUTIFUL and so is the sound. I ended up playing the whole game in one sitting as I was so immersed in the underwater world it takes place in. I'd reccomend this game, with headphones in. It's truly a unique experience",
            "review_score": "1"
        },
        {
            "review_text": "Like Flow, Flower &amp; Journey before it, this is a gorgeous but brief experience. At first it could be mistaken for a graphics demo or fishtank screensaver, but as the game progresses there are some familiar emotional beats that the game hits to make you feel that you're getting more out of this than some painfully elementary puzzles. The moments of delight pay for everything else, including some clumsy controls and an aggravating camera.  Once it's over you will have three or four memorable experiences (more than many 30+ hour games can supply) but at two hours for a run-through you'd have to be crazy mad on fish or a serious lover of arthouse game experiences to buy this outside a sale.  A must-play for most, and I expect to play it at least twice.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful game.  If you played Journey and loved it, this is the true successor to Journey.  The game is only about an hour long but i recommend getting it on sale. Its not too hard and is definitley one of those 'games' that is more a piece of art than it is a traditional game; akin to Journey.  Unlike Journey, you're playing in a vibrant ocean. The narrative with this one is decent but also a little strange and heartwarming in a way. It's a bit of a rollercoaster and not totally up front and in your face.  I give this one a spaghetti and meatballs out of ten.",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is my game of the year for 2016. It's short, but the art, sound, and story are all beautiful.   It's an amazing experience for the whole family, and we enjoyed exploring the underwater world and mystery of AZBU together. I also recommend the 'Meditation' mode of the game to anyone trying to sooth a tired and grumpy toddler to sleep. It has very calm music and visuals that can ease them into slumber.",
            "review_score": "1"
        },
        {
            "review_text": "I spend a good chuck of Christmas Day 2016 swimming around in this beautiful underwater world. It is not a game with combat, serious puzzles or really any challenges put in your way, it is a game of exploration and wondering at the amazing experience. Playing this game is a kind of meditation on tranquility, similar in parts to their other game 'Flower'. Make sure you have a game pad and decent audio and visual hardware, and you're in for a treat.",
            "review_score": "1"
        },
        {
            "review_text": "The Best 2 hours of gameplay you can get. Magical, peaceful, and takes you on a trip. Close to Journey, but who cares, at that point I need more of these kind of game, so it did not bother me",
            "review_score": "1"
        },
        {
            "review_text": "A fun experience. Vivid colors, beautiful sounds, and a simple but interesting story make for fun way to spend an evening. In total it takes a couple hours to complete but is really fun and enjoyable the whole time.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a Pixar Short Film that you can play.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awe-inspiring. There is beauty in every corner of this game. It has a simple story well told through environment and music, but that really isnt the draw for Abzu. If you find joy and inspiration in the sea, or even nature in general, I cant think of a game I could recommend more than this.",
            "review_score": "1"
        },
        {
            "review_text": "This game brings stunning visuals, simplistic controls, and awe inspiring sound design to their peak possibilities. This game is a feast for the senses; with its low price, it is well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the most beautiful games I have ever played. I have never felt so emersed in a game before.  The amound and love and care that went into the soudntrack, the aquatic creatures, and the enviroments is mind blowing. I couldn't help but explore every nook and cranny.  I highley recommend this game.  Also this game deserves an immense amount of awards.",
            "review_score": "1"
        },
        {
            "review_text": "this game will stick with me forever",
            "review_score": "1"
        },
        {
            "review_text": "This game is really pretty for how simple it is....  Pros - Seems timeless (You can get lost playing this game and have no idea how much time has passed.) - My girlfriends face when playing (I was simply watching it and my girlfriends face as she lit up while swimming around with fish.)  Cons - I'm probably not going to get much time with my lady until she has found everything and feels complete..which given how simple and free this game feels....might never happen &gt;.&gt;",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun just swimming with the fish. Need more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful.  I came in expecting this game to be the equivelant of an underwater walking simulator.  And it is. But the imagery and magic of the world that the game submerses you in makes up for it in spades. The price is probably the only downside, as this game can be finished in under 3 hours without rushing (though it never out stays its welcome). Wait for a sale, like I did.",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is a short game, but it's a great visual and musical experience, very much in the same spirit as Journey, Flower and other zen-like games that takes you on an unforgettable journey through and through. Be sure to meet the system requirements. Despite the fairly (but appealing) simplistic graphics, the game can be pretty taxing - even on newer system.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes a game will surpirse you with wonderful moments. Moments so wonderfull that makes you think that it was worth your purchase just to experience that one moment. That is how this game left me feeling. Your experience may not be as rewarding as mine. But if you are willing to give it a try, it might reward you with a experience so unique to other games.  If it dosent, swiming with the fishes is kinda fun and the art is preety cool.",
            "review_score": "1"
        },
        {
            "review_text": "This game has stunning visuals and overall relaxing atmosphere but seriously lacks any kind of challange in gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This is not just a game. This is a work of art.",
            "review_score": "1"
        },
        {
            "review_text": "This game just blow my mind. The game is unbelievable good! There has not been said a single word and you can understand the story. Not only that, but the game itself is looking fantastic. The graffics are simple, but so cool! And then the music. The music is making the game feel so nice. You really get a awesome feeling when playing this game. Eventough this game has a small story and you can finish the game fairly quick, you will enjoy it every second. This really is a AMEZING game!",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game maybe 9 or 10 times on my PS4. I love it so much that I just bought it again on my PC. Though strangely the PS4 controller support doesn't seem to work very well, at least for me. It's very unresponsive, putting in a command takes about a second to respond, and when it does, it does it too much. Tried recalibrating a few times and still the same issue.  Anyway, if you can get it working, it's defintely a must buy. I would have been completely okay with buying this game at a full $70 price, it's completely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "If you need a game to relax and to chill, then play this game. It has a simple story plot, but awesome visuals and audios. I've never seen an underwater world so colorful and so detailled. Such an awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "beau·ti·ful ˈbyo͞odəfəl/  adjective adjective: beautiful  pleasing the senses or mind aesthetically. 'beautiful poetry'  synonyms: attractive, pretty, handsome, good-looking, alluring, prepossessing;  'nuff said!",
            "review_score": "1"
        },
        {
            "review_text": "This game is visually stunning. I was very impressed with the animal behavior such as a shoal of fish parting as I swam thru the middle of them. I would meditate for long periods just watching all the animal life pass by me. The game was a bit short but I still feel I got every dime's worth out of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Short and gorgeous underwater exploration game. It hits many of the same beats as Journey, but that's not a bad thing! The controls can be a little wonky, but that's about the only negative I have. If you enjoy relaxing, beautiful games, this is a wonderful way to spend an afternoon.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game the day it came out, the preview on the steam home page peaked my interest, the positive reviews sealed the deal for me, most reviewers called this game 'an experience' and I strongly agree. Running the graphics on the highest settings, and the new age sound track make this game a feast for the eyes and ears, and a completely immersive experience. What I liked about the game was having no idea what the hell I was supposed to do, learning as I went was part of the fun. I enjoyed it so much I have played it through twice, and I still have missed a few meditation spots. I don't want to give away any spoilers, but I thorough enjoyed the game, it doesn't focus on high scores or survival, but more exploration and completion.",
            "review_score": "1"
        },
        {
            "review_text": "It is a beautiful game, which really gives you a sense of diving in the sea. However, there should be some sort of story, meaning or structure. The sometimes repetitive tasks also destroyed the immersion. Because it is also very short, I would recommend getting it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Best short game i've ever played, I was amazed of every detailed objects while playing.",
            "review_score": "1"
        },
        {
            "review_text": "An overall AMAZING game and one that I'd suggest anyone should pick up if they can.  This is the sort of game that puts other games to shame for just how amazingly beautiful it is.  Trust me ... you gotta see it.  - BW",
            "review_score": "1"
        },
        {
            "review_text": "The developers put a lot of effort into this game and it shows in spades. It shouldn't be about the length, you're getting an experience that can't be had elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best diving simulator I have played. Short but a great experience.",
            "review_score": "1"
        },
        {
            "review_text": "Forget walking simulators. Check out diving simulators. This is a brief and relaxing artsy-fartsy experience with vibrant and unique visuals, sweeping orchestral scores, authentic marine life all over the joint and of course, ancient aqua Egyptians. Not sure what the story is about, but phallic coral obelisks, angry triangles and shark patronuses aside, this is a pretty chill game.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible. Not difficult (though sometimes a bit stressful), but I've listened to the music for hours, completed all the levels (still have some stuff left to find!), and I feel like I could keep playing and replaying this many times over.  It's a bit short, and I'd like some larger areas to explore, but for what it's already got, it's pretty great.  Would recommend, if you like water and fish.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game.  I can't really say anything about it without comparing it to Journey on the PS3/4. It is essentially an underwater Journey. It has beautiful cel shaded graphics that are some of the best I've ever seen (it happens to be my favourite visual style for games), and an excellent soundtrack by Austin Wintory, who also composed the music for Journey.  It's a very short game, and only took 1.5 hours for me to complete, although this type of game has very good replay value. I can't really find any fault with it, but it'd be cool if it had some level of multiplayer, where you and another player who are in the same area can seamlessly integrate into the one game (this is what Journey did, and it was so good). You can't really interact with them, but it adds a very cool sense of companionship when somebody joins you on your great journey.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, immersive exploration game in the ocean. Calm, peaceful game. Great marine life and graphics.",
            "review_score": "1"
        },
        {
            "review_text": "MOST BEAUTIFUL GAME 2016!!!",
            "review_score": "1"
        },
        {
            "review_text": "Abzu is a difficult game to recommend... Not because it is bad, but for its incredible short duration. The game roughly took me 3 hours to complete (without getting everything), however I must say that getting it on sales and finishing it yesterday, was a nice way to start the weekend. I don't know why, but this game made me see again, that videogame industry is full of authentic Art pieces, and Abzu is one of those. You'll discover a world full of colour, realistic animations, lots of fish species and a wonderful OST. So, if you appreciate Art in videogames, I recommend Abzu to you.",
            "review_score": "1"
        },
        {
            "review_text": "Sick of your life? Feel miserable? Need a timeout and your friend just ate your KitKat? Just chill, sit back, grab your controller and get this game. I guarantee you that it's gonna make you feel better... much much better. You'll be smiling again in no time (±4 hours). Happy times, happy times indeed.",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is a game that is heavily inspired by the games Journey and Flower. This has some of the most amazing visuals I've seen in a game, scene after scene of striking art design. The soundtrack is great too, made by the same composer as the soundtrack for Journey. I would highly reccomend this game to anybody looking for a stress-reducing game. If you're looking for in depth gameplay, you will be disappointed, there's very little challenge to it and there are only a few collectibles to find. But if you're looking for a game to replay over and over just to take in the beautiful sights and sounds and become immersed in this underwater world, then you have found the right game.",
            "review_score": "1"
        },
        {
            "review_text": "There are games and then there are works of art. Abzu is the latter. A beautiful interactive masterpiece set to an amazing score by Austin Wintory. If you loved Journey (and who didn't?) then you will love Abzu. It might not be quite as good as Journey, but it comes darn close and is amazing in its own right.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what other word to describe this game other than... stunning. Just stunning. From the visuals to the soundtrack to the compelling story, this game was a pleasure to play. Loved it from beginning to end.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the closest thing you'll get to playing Journey on PC. It is absolutely worth every penny if you can stomach paying full price for a 1.5-2 h expereince. It is even more worth it if you wait for a sale.  Beautiful, artistic and even slightly emotional. You owe it to yourself to play this if you've had the slightest interest in the games produced by ThatGameCompany on the Playstation 3.",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is an incredible game experience, with excellent visuals, a soundtrack and leaves you with a sense of wonder.",
            "review_score": "1"
        },
        {
            "review_text": "An eye-wateringly beautiful game that calms you and puts you into an almost medidative state. The colours, the environment, the animals, everything is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Never thought id connect with a shark and soar through the galaxy with a smile on my face. Game of the Year.",
            "review_score": "1"
        },
        {
            "review_text": "I used to be a Fish",
            "review_score": "1"
        },
        {
            "review_text": "ABZU is a short game, but it's a great visual and musical experience, very much in the same spirit as Journey, Flower and other zen-like games that takes you on an unforgettable journey through and through. Be sure to meet the system requirements. Despite the fairly (but appealing) simplistic graphics, the game can be pretty taxing - even on newer system.",
            "review_score": "1"
        },
        {
            "review_text": "  A beautiful exploration game, what an experience. Truly a masterpiece, try to pick this one up on sale. $21 seems like a little too much. Overall fantastic game, beautiful soundtrack.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "  Damn. This might be legitimately the most beautiful game I've ever played, sonically, visually, and emotionally.  This delivers the sense of wonder, awe of natural beauty, and mystery of alien civilization that I wanted - but didn't get - from No Man's Sky. It is short, but meditative. Heck, there's a button to meditate and watch the fish. Austin Wintory's score is gorgeous, and perfect.  I cannot reccomend this game highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game, Reminds me of Flower on the Sony console.",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful game. A must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I finished the game in under 2 hours. Not going to refund it cuz it was a really good game but this is pretty much a free game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like to watch a movie with beautiful music - Buy it (though only in a sale, cause it is rather short)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, dem feels. Not as good as Journey though.",
            "review_score": "1"
        },
        {
            "review_text": "This is an incredibly well produced and compact game. The variety of environments for a game set mostly underwater is impressive. The story was minimal but compelling in an unexpected way. Abzu is truly a masterpiece in the short game genre.",
            "review_score": "1"
        },
        {
            "review_text": "Tried to make a seaturtle jump with the dolphins. Failed. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I really havent played it much, but this game is such a beautiful and magnificent game. The artwork is amazing and the game mechanics are pretty nice too, I would highly recommend this game if youre just looking for a good visual/cool game to play.",
            "review_score": "1"
        },
        {
            "review_text": "A really great soudtrack aswell as a fantastic artistic direction which blew me away since the beginning. The game may be short in time terms, but it's definitively worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "So poetic and magic. I realy like play that game Thank developers",
            "review_score": "1"
        },
        {
            "review_text": "A short, relaxing experience.  I'm recommending this, but honestly I'm sad to say I can only recommend it at sale price. If you really really like fish and swimming it might be worth the full price.  I loved Flower and Journey and I was glad to see some elements from both in this game. This comes close, but sadly does not match those experiences. Which is not a total dis as that is a hard thing to achieve.  What ABZU succeeds in is creating a lovely environment and an interesting main character you control. There are also lots and lots of different sea creatures to discover through the game and a 'meditate' mode that lets you just pick a fish and let the camera follow it around while it does its thing. There is an element of armchair archaeologist where you get to try and fugure out what happened to the game world (and who you are). There are even a few good emotional scenes.  It is short and I don't feel it offers much replay value, but I feel the experience was worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "  Honestly wasn't expecting much when I started the game. Was pleasantly surprised. Would strongly recommend this game, possibly along with some patience.",
            "review_score": "1"
        },
        {
            "review_text": "SO BEAUTIFUL. make sure to watch on a very large screen and your hardware can handle the ultra settings. I feel like I just went to another world for a couple of hours.",
            "review_score": "1"
        },
        {
            "review_text": "Without hesitation, without competition, my favourite game I've ever played. I played it all in one sitting, mesmerised. I have a huge love for whales and sharks, as well as always having had a deep fondness for the ocean and marine life in general, so this game was... masterful. Absolutely incredible for me. I fell in love immediately, and couldn't rip myself away from the game for even a minute.  If you have even the slightest interest in or fascination for the ocean, I highly recommend you play ABZÛ. It's a gorgeous, fascinating, and enthralling game from start to finish. Highly recommended.  10/10  SPOILERS:  I have to admit I cried when the Great White died. It's my favourite shark, second only to the Whale Shark, and I was sad to see it die just after having befriended it. Having it come back to life and destroying the ominous, creepy pyramids by its side was one of the most satisfying things I've experienced in a game. Wonderfully executed build-up and pay-off.",
            "review_score": "1"
        },
        {
            "review_text": "Flower was fun as you zipped through the air at the speed if sound, reviving your fellow flowers and expanding the play area.  Journey was fun as you tested how far you could leap with every new upgrade, rode various scarf-creatures, and surfed the sand.  This game is pretty, but it's not much fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you love exploring, this beautiful game will reward you! The story itself only takes a couple of hours to play through, yet I was surprised how the simple adventure captivated me. Taking the time to explore this amazing world is a lot of fun. My heart still pounds with a tinge of fear diving deep down into the darkness in the middle chapters, yet the excitement of what I may see takes over. This game gives you a chance to see and explore all kinds of underwater species, some of which you may never get to see in today's world. I had great fun exploring the ABZU world in detail myself, before turning to some great guides for help in finding the remaining collectables. I bought this game on sale, but it was certainly more than worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Words cannot describe how beautiful this game is.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing, it's a beautiful experience and my favorite game of 2016!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game firstly as a ''joke'' from the Steam winter sale (It was 70% off the actual price). When I first got into the game, I was amazed from the game's beauty. That artwork was just amazing and beautiful (It reminded me one of my dreams I once saw). The game was very relaxing and it was actually my first adventure/exploring game without violence :D  I really loved the soundtrack, it really blends in with the game. I also loved the thing that the game was simple and story rich. I highly recommend buying this game and playing it with a controller (In my opinion it is alot easier to play with a controller.. I used a PS4 controller, but I guess XBOX One controller could be better).     That was my ''first'' review.       Thanks for reading my review :) I hope you will spend some of your money on this game and will enjoy it even more than I did :D",
            "review_score": "1"
        },
        {
            "review_text": "What did I just play? Can't say I'm certain, but it was beautiful. If you need that game to just relax with this is it. No pressure. No crazy puzzle solving. No threats. Just unwind and take in the sights.   Now if you'll excuse me I need to hit the all u can eat seafood buffet.",
            "review_score": "1"
        },
        {
            "review_text": "IF YOU ARE READING THIS PLEASE KNOW AND UNDERSTAND THAT THIS IS A WORK OF ART AND YOU NEED TO BUY THIS IF YOU ENJOY ANYTHING, 1. CELL SHADED 2. SMOOTH AND COMFY CONTROLS 3. SOME OF THE BEST GRAPHICS MY EYES HAVE EVER GAZED UPON. TLDR; if you like artsy, visually stunning graphics, and swimming with the fishes buy this game no questions asked!!!",
            "review_score": "1"
        },
        {
            "review_text": "As a scuba diver, I can say that this game does an incredibly beautiful job of conveying ocean life in a way that most people, unless they dive, may never experience. It's a beautiful game, absolutely breathtaking- and your best friend is a shark. How awesome is that?  My first playthrough, I honeslty had no idea what I was doing- but the gameplay is simple; the motto here is just keep swimming. You can only circle the active gameplay areas so many times before you realize there's an objective and how to complete it.   On the downside, keyboard controls for movement are a bit awkward. Playing with a controller would be optimal as you can maneuver the 3D environment with a little more ease and finesse.  All in all this is a great little gem.",
            "review_score": "1"
        },
        {
            "review_text": "SIT,PLAY,HEAR THE MUSIC,RELAX AND ENJOY.BEST GRAPHIC INDIE GAME 2016",
            "review_score": "1"
        },
        {
            "review_text": "I love explosions, hardcore action as well as tactical and strategic thinking games. Never been a fan of 'artsy' or 'relaxing' style games but this game just blew me away. A very similar experience to seeing a beautiful movie it starts slow and playful, starts to show a greater story underneath then a dramatic finish I'll never forget.   Highly recommended if you can sit still for 10 minutes or so, long enough to get hooked.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome and really relaxing, its the best game i have ever played",
            "review_score": "1"
        },
        {
            "review_text": " 73 minutes played",
            "review_score": "1"
        }
    ]
}