{
    "app_id": 384300,
    "name": "CPUCores :: Maximize Your FPS",
    "release_date": "2015-07-06",
    "developer": [
        "StartupTim, LLC",
        "Tim Sullivan"
    ],
    "publisher": [
        "StartupTim, LLC",
        "Tim Sullivan"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Utilities"
    ],
    "tags": [
        "Utilities",
        "Software",
        "Singleplayer"
    ],
    "achievements": 15,
    "positive_ratings": 6208,
    "negative_ratings": 2324,
    "price": 10.99,
    "description": "Maximize your FPS :: Use CPUCores to isolate and constrain OS + non-game processes and dedicate CPU resources to be used exclusively for your games! CPUCores fully integrates with all Steam games!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/384300/header.jpg?t=1555962467",
    "minimum_requirements": "OS: Windows 7 64-bit, Windows 8 64-bit, Windows 10 64-bit Processor: Any dual core CPU or higher.  Low/Medium/Medium-High 2/4/6 core CPU systems preferred. Memory: 1 GB RAM Additional Notes: CPUCores was designed for system ranging between medium-low to medium-high end PC systems.  CPUs that are in the 2 core (dual core)  to 4 core (quad core) range, as well as some 6 core CPUs,  This systems that have the best results would typically be (low end) E8400/Q9600, AMD FX, Core2Duo, and medium-high end i5 and i7s.",
    "recommended_requirements": "OS: Windows 7 64-bit, Windows 8 64-bit, Windows 10 64-bit Processor: Any dual core CPU or higher.  Low/Medium/Medium-High 2/4/6 core CPU systems preferred. Memory: 1 GB RAM Additional Notes: CPUCores was designed for system ranging between medium-low to medium-high end PC systems.  CPUs that are in the 2 core (dual core)  to 4 core (quad core) range, as well as some 6 core CPUs,  This systems that have the best results would typically be (low end) E8400/Q9600, AMD FX, Core2Duo, and medium-high end i5 and i7s.",
    "reviews": [
        {
            "review_text": "i dont really think this helps with AMD systems. I have noticed no difference in running versus not running  This is based on PERSONAL Experience with the program and the DEV is working VERY HARD to help remedy this problem. Do not upvote this to be rude, or insensitive to others, or to start flame wars.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall, I noticed a small increase in FPS (+/- 5%). Barely noticeable, but still there. It's most noticeable when entering a huge environment with lots of variables on screen, with possibly an autosave or checkpoint triggered. Other parts of a game that are less CPU/GPU intensive, there's not much of a difference. Loading times are slightly faster, as well. The developer seems to be very involved with this software, which is always a plus. Worth $10.",
            "review_score": "1"
        },
        {
            "review_text": "This magical application runs all my games faster AND keeps Windows 10 more stable in the process. Whatever the hardware specs on your machine, this one is an automatic MUST.",
            "review_score": "1"
        },
        {
            "review_text": "After buying this product the other day and testing it with a series of video games I had installed from all different genres ( fighting, racing, action, open-world adventure, etc ), I noticed no significant increase in my games' performance. In fact, in the one instance that I was expecting it to show the most improvement, the software actually  reduced  the framerate and overall performance by as much as 35%. I would not regard my system as 'top-of-the-line' ( it's a nearly two-year-old laptop ), but for the software not to be able to improve my performance in any noticeable way at all is a bit telling of how small claims can become large lies or half-truths.  I opted for a refund immediately after trying ten of my more demanding games with CPUCores, and finding that most of them were not improved in any significant way.",
            "review_score": "-1"
        },
        {
            "review_text": "Initial POSITIVE review after using for one evening. Monitored a session of the MMO Age of Conan using Windows 10 Resource Monitor. CPU is Intel i3-6100 (2-core/4 threads) O/C to 4.1Ghz and Video is an GTX 970.   Clearly saw the bulk of the workload shifted to the second core (threads 2 &amp; 3) and did notice less drops in FPS while in complex scenery like cities. Without CPUCore I would see the workload spread over all 4 threads equally. Age of Conan did seem to run smoother. Althrough I feel that not all games will benefit, I do feel that I will see positive improvements in a number of games.   Was skeptical to start with but the program did seem to help. Will be testing with various other games/simulators and plan to update review. ",
            "review_score": "1"
        },
        {
            "review_text": "Bought it from website and got a Steam license after haggling with the dev but it works like it says",
            "review_score": "1"
        },
        {
            "review_text": "Works as advertised. If you have a PC that is made for gaming and you are looking to up FPS, this is probably not for you. I did not notice a difference in my gaming experience. However, that being said, I do like the fact that I can solely task cores to do certain things like video editing and rendering.  If you have a PC that is not geared towards gaming or you have an older GFX card, I would say this may be worth it for you.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this soley to test if it's decent. To my knowledge ; I've tested it on a high-end game known widely as The Division.  Notable comments : 1 . In-game FPS did not show any increase in any way ; the FPS in fact decreased slightly while playing the game. 2 . Loading times were in actual fact faster than usual. 3 . Gameplay of The Division was smooth sailing and nothing other than the loading times had really changed.  Out of a 10, I would rate this software at a 8.   In conclusion, Although my in-game FPS did not really increase : My loading times were in fact much more faster because more CPU Cores were assigned to the game. Overall the game was more satisfactory than usual and I'd recommend this product if you have the money to spare.",
            "review_score": "1"
        },
        {
            "review_text": "I tested it on csgo and hitman . not noticeable fps boost for csgo.15+ fps boost for hitman.  bought it to play division, however the game is on my other account. Problem is, you can't share this software w/ your family linked account, which means I can't use it to play Division.  For now, I ll just refund.  Bought it from their website. Cost a bit more but works well.",
            "review_score": "1"
        },
        {
            "review_text": "Question for CPUCores company, what is the difference between cpucores.exe and  cpucores-launcher.exe?  I am trying to run the software and it shows a login box for the cpucores.exe but the cpucores-launcher works fine.  Oh runs great thnks, but not sure is the cpucores-launcher.exe for launcher games like GTAV or which do I use? ",
            "review_score": "1"
        },
        {
            "review_text": "Just installed, seems to work, referred to this program by a fellow developer on the assumption I can set it and forget it and my tasks will perform faster overnight.   ",
            "review_score": "1"
        },
        {
            "review_text": " I've been having some issues with this program. I bought it through Steam, but now when I try to open it, it asks me to purchase/validate or reopen the program through Steam, which I already am doing.  Plus, the only game I use this for, Fallout 4, doesn't even run through this program. When the program doesn't arbitrarily make me try to validate or repurchase (and it's arbitrary, it'll not ask me for one instance, and then trying to use it in another instance will try and make me repurchase), it just doesn't start the game. It will just loop back to the Fallout 4 settings pop-up.  something is wrong with this application.   did the changes and tested it over the weekend, it works now. thanks.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this for anyone with a mobo/processor from 2011.  Hugly improved my ARMA 3 Preformace!",
            "review_score": "1"
        },
        {
            "review_text": "WILL THIS WORK FOR ALL? No!  DOES IT WORK FOR ME? Yes, so far I've used just for half an hour and the results are astounding!  CAUTION: This isn't for $10,000 systems but if your PC is 2+ years old then this program is GOLDEN!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, but should be usable in different steam accounts. Incl family sharing!!",
            "review_score": "1"
        },
        {
            "review_text": "Cpucore is a very good software,it did indeed increased my fps by 20% but there's still lag in some parts of the game. I would give Cpucore a solid 8/10...Why 8? Because : 1)After playing a game on steam,I can't start another game because it doesn't let me.The start button cannot be pressed,the only way to play another game with Cpucore is that you have to restart it.  2)I tend to do alot of arranging in my desktop like placing the rainmeter software at a suitable place or like my music player....I would arrange the cpucore window/hud at a suitable place around my huge desktop but after restarting cpucore it just goes to its default placement.  Tim,Please fix this problem.",
            "review_score": "1"
        },
        {
            "review_text": "I'll preface this by saying i know very very little about the technical side of a PC, so this is coming from somebody who won'tknow alternate methods.  I've used this program for barely any time at all and i'm already seeing results. Oblivion goes from 20-30fps to 36-40fps! Skyrim goes from 15 up to 20. My PC is rubbish, I would highly recommend this if you have a low end PC and limited knowledge. It has made games playable that weren't before!",
            "review_score": "1"
        },
        {
            "review_text": "OMG. I can't believe it actually worked. Used to play fallout 4 on 40 fps, now i'm getting a clean 60 =)",
            "review_score": "1"
        },
        {
            "review_text": "Does one thing and does it well, exactly how an application should be.",
            "review_score": "1"
        },
        {
            "review_text": "If you have some problems with your fps in-game (by that i mean people who have low-medium PCs, not beast PCs), then this is what you want. I have a laptop with i7 8GB RAM 1.8~2.4GHz GeForce GT 720m. CPUCores helped me with a lot of games that run on high graphics like   GTA 5: Without CPUCores 10-25 fps. With CPUCores: 30-40 fps. (WOW)  Rocket League: Without CPUcores: 15-20 fps. With CPUCores: 25-30 fps (GOOD)  I am bread: Without CPUCores: 15-25 fps. With CPUCores: 25-30 fps (GOOD)  See what I mean? I really hate those people who reviewed CPUCores as bad because they did not see a difference in fps. Why did they rate it as bad? BECAUSE THEY SAID THEY HAVE BEAST PCs! THE AUTHOR (Tim) ALREADY SAID THAT CPUCores IS ONLY FOR PEOPLE WHO ACTUALLY HAVE PROBLEMS IN THEIR FPS.  So yes, CPUCores is good. :D BUT, I did notice the small fps drops as Tim said, but it only sometimes (not rarely) happens. If this would be fixed I will be really happy and will erase this comment about fps drops.",
            "review_score": "1"
        },
        {
            "review_text": "+ Pros:  ▲ Only 1 thing needed to be installed (some .net) ▲ Clicked to run in steam and opened ▲ No advertisements at all ▲ Interface was super easy and i just lcicked some ♥♥♥♥ ▲ I think it made my fps go up  - Cons:   Can't get all the achievements because my PC isn't worth a house worth! Cmon who has 6 core cpusss???",
            "review_score": "1"
        },
        {
            "review_text": "This is the best cpu software around it made dishonored 2 run in 4k 60 fps in ultra seriously thanks for making this dude",
            "review_score": "1"
        },
        {
            "review_text": "Alright a$$ bags listen up, I need to tell you about this one... oh boy...   CPUCores is actually really amazing, I game from a laptop quad core 2.0 ghz and seeing that most games us only one core at a time this software helps me game just that much better, it isn't a replacement for great hardware but is a good alternative then just dropping EVERYTHING visually. BUT just cause it utilizes all core doesn't mean I can just play at max resolution and max detail. I have come to terms with this and I blame that, mainly, on my laptop, but to get just that much more to play the game without lagging or stuttering then this really helps.   I paid full price, that is correct 20 dollars US and it IS WORTH EVERY PENNY. I'm just glad that it isn't subscription based cause I wouldn't buy into something like that.  And on top of that, the developers are very helpful and respond quickly, which is really nice.   Now if you read all this and don't buy then you are just a ridiculous g-tard.  ...no seriously, tennouttaten!!! GREAT JOB!",
            "review_score": "1"
        },
        {
            "review_text": "The most simple program ever used. Its just download open an go no crazy installation works well at boosting games performance well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR The program works better on lower specs, in higher specs it help steady the game. ------------ Whoa it says I'm only using it for 0.1 hours, actually I'm using this program 3 days straight on my second notebook. well, nevermind, as long the program works. --------------   in my MSI GE62QF (i7 6700HQ [@2.60 GHz, 8 cores], 16GB Ram, GTX 970 3GB) +It helps making my fps in the game steady, I tried CPUCores on grim dawn, fallout 4, just cause 2, and Saints row 4. +at random timing windows 10 dragging the laptop's performance. When the normal fps is 60, at random timing it drops to 30-40fps but this program manages the drop to 45-52 fps. +it prevent any background process to interrupt the game, except the process that using disk access heavily. For example, I'm installing XCOM 2 then I run Grim Dawn, The game got steady 60 FPS but the game randomly stutering and when the game loading an area it takes more times, but the fps still steady at 60 FPS.  -rare random freeze when quitting game, when I played grim dawn &amp; fall out 4 it freezes when I quit the game, it's very random and rare event though but unfortunately I can't call task manager if this happens, I had to push power button to turn off the notebook.  +It works really well on improving my second notebook ASUS A451LB performance (i3-4010 @1.7 GHZ, 12GB RAM, GeForce 740M, win 7 SP1) I get +10-20 FPS for any game I play. Since win 7 is better OS than win 10 it never have any quit freeze problem. I tried using Handbrake for compressing my video files, it usually took 4-8 hours to compress, but since using this program it reduced to 3-5 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Well I'll be damned... it works... I'm finally able to play Fallout 4  NOTE: I'm using an old CPU - 920 core i7 on a 7 year old machine.",
            "review_score": "1"
        },
        {
            "review_text": "Use this if you need more FPS. There's some basic ♥♥♥♥ton of controls in a few aspects.",
            "review_score": "1"
        },
        {
            "review_text": "This App Is Amaizing!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I had my doubts but I can say that my FPS boosted pretty good. Not the high end FPS (only maybe 10 more FPS) but the game did not crash or studdering anymore. The low end FPS was waaaaaaaaaaaaaaaaay better.",
            "review_score": "1"
        },
        {
            "review_text": "My old Pc had an old Radeon Grapics card that struggled as i diddnt have the money to update  Games i couldnt play were stuff like La Noire and GTAIV  but when i used this i could play GTAIV , so it did make an improvement  also noticed improvments with MGS Ground Zeros and a few other games  So it was worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "this program lives up to its name.  my games run smoother and I leave my setting on high or ultra high. it's a worthy download and easy to use.  my system: 2.4 intel i7, turbo boost up to 3.3 16gb ddr3 ram 4gb nvidia 950m hp envy 15t (touch screen)",
            "review_score": "1"
        },
        {
            "review_text": "OMG best 16 dollars i have spent in years. EVERYTHING is faster smoother and just plain better! Awesome software!",
            "review_score": "1"
        },
        {
            "review_text": "Hello the software runs great but have a question, what settings do I use for i7 930?  :::: FOUND IT ::::   I have the first option set with a check and the middle option no check and then the bottom one is checked, this seems right? I have an i7 930 CPU from Intel.   Thanks I am getting more FPS already!  UPDATE MONTHS LATER  Program is still working well and use it often for games that are not in Steam, works great on Origin games as well",
            "review_score": "1"
        },
        {
            "review_text": "I'll keep this simple:  I'm running an Alienware Alpha i3 with 8gb ram with stock HDD. I'm running Windows 10.  Before I was running Dark Souls 3 on medium/high settings and motion blur disabled to get smooth gameplay.  After CPUCores I'm running the game with all high settings, effects enabled, and Texture Quality on MAX with smooth gameplay. I'm not sure about my FPS (as I don't really know how to check), but there's a distinct improvement. I'm very happy, and I think if you've got a comparable set up you will likely be happy too.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Grabbed some copies on sale for my friends as well.",
            "review_score": "1"
        },
        {
            "review_text": "i really only play dayz and its not the best performance yet as we know and this has much alot of difference to the game by at least 15-20 sometimes alot more FPS. i was very skeptical about it but when it went on sale i decided to jump in for the sake of a few quid. and boy am i glad i did, i have a high end setup and still helps so much.... thank you dev!!  predator G6-710, i7-6700 cpu@4.00ghz (boost to 4.60ghz), 16g ram, nvidia GTX 970,   and it still helped. even more so with other games that are optimized makes every game smoother and so much better.",
            "review_score": "1"
        },
        {
            "review_text": "had this since is was not on steam, it has become an essential part of my gaming experience, there once was a game called Ashes of the Singularity, that ran at mear 20fps, i used this and my computer decided to say *i want do double that* and made it 42fps, with being a topdown RTS, this is sufficient for me to play.  GARUNTEE TO WORK ON i7-4810MQ (well mine anyway)",
            "review_score": "1"
        },
        {
            "review_text": "I've noticed significant improvement in framerates for heavily moedded older games {e.g.Fall Out and Oblivion) not much though with well optimized modern games.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Works great with my laptop. Usually when I play WoW, my fps average from 30 - 45 in combat, and 45 - 60 when out of combat. Now when I use this program, I would average from 40 - 55 in combat, and 60+ when out of combat. For me, it was really worth it of buying this. To be quite honest, I'm not quite sure why there are negative reviews...  Here's my graphics card: NVIDIA GeForce GT 650M (Pretty Midrange)",
            "review_score": "1"
        },
        {
            "review_text": "▬▬▬◙▬▬▬ _▂▄▄▓▄▄▂_ ◢◤ █▀▀████▄▄▄▄▄▄▄◢◤ █▄ █ :D ██▀▀▀▀▀▀▀▀╬ ◥█████◤ ══╩══╩══  I'm high.  EDIT: I am very shocked, this software WORKS!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! Helped my PC run games i liked to play much better! Thanks alot!",
            "review_score": "1"
        },
        {
            "review_text": "I fully recommend this software. For me, with my spec: OS - Now Windows 10! Was Windows 8.1, works just as well Processor - AMD Athlon(tm) Dual Core Processor 4850e 2.5 GHz GPU - AMD Radeon HD 7700 Series Ram: 4GB I noticed around a 5-10 frame increase in my fps. But that's not even the best part, my fps dips are much less dramatic. Normally, in some games like Borderlands 2 or TF2, I would get random FPS drops going from 50 down to 30, but with this the drops are only going to 40-45, which makes my games feel much smoother. I also asked about how it'd help in the discussions, and the Developer (Tim) got back very quickly with a helpful answer.  10/10 would definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "i7 4810 16gb ram ddr 1333 250gb ssd gtx 960  Maybe 10% more FPS. Worth it for the sale price, maybe even normal price.",
            "review_score": "1"
        },
        {
            "review_text": "FOUND OUT FROM A FRIEND AND THIS PROGRAM ACTUALLY WORKS  I AM USING IT ON A PC FROM 2012 AN OLD I7 AND MY FPS IS DOING BETTER  I MOSTLY AM PLAYING PIRATED SKYRIM LOL",
            "review_score": "1"
        },
        {
            "review_text": "This is so helpful! i run my games smoother than ever with this software! thanks CPUCores!",
            "review_score": "1"
        },
        {
            "review_text": "does not help i don't know why. droping my frames by 5% by 27fps from most of my games. my specs are amd a10-5750 APU with HD graphics 2.50ghz quad core.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont havew a High End Gaming PC but this did not even change anything on my pc i went through all the settings and nothing. so (#refund)",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this. Tried running it with my games and it locked up my system so bad I couldn't get checkdisk to run. Ended up having to reinstall Windows 10 and wasting a few days setting up my PC. Refunded.",
            "review_score": "-1"
        },
        {
            "review_text": "It trades fps (somewhat more smooth) for freezing programs on the background, like chrome, from time to time or even crash them. All aboard the refund train.  GTX 980  16 RAM   I7-3820 CPU  Windows 10",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this yesterday to see if i could boost Fallout 4, since Fallout 4 is very CPU dependent cause it has many drawcalls and AMD CPU's have some troubles with games with high drawcallcounts, i thought this proggie might make a difference with my old 1090T Phenom 6 core CPU, well it turns out that it doesn't.  I saved my game at the corvega factory, let my character look at a specific spot that gave me a FPS drop to 28FPS per second, started the game through steam first, 28FPS, then i quitted the game and started it through CPUCores, the exact same result, 28FPS, so it actually didn't do anything at all.  I always read the manual from any software or hardware i buy thouroughly, and follow the reccomendations to the letter, and i always test stuff thouroughly. The software didn't give me a average FPS boost, neither did it gave me a specific FPS boost in drawcall heavy spots, so my conclusion is simply that it doesn't work on my system.  Since i have no older dual core CPU i can't comment on that statement, but if you have a AMD 6 core or better, then this program certainly doesn't do anything at all.",
            "review_score": "-1"
        },
        {
            "review_text": "  My friend sent me this for a laugh, ended up saying it was just a £15 task manager. Its a scam lel.",
            "review_score": "-1"
        },
        {
            "review_text": "Scam. Nothing more, nothing less.",
            "review_score": "-1"
        },
        {
            "review_text": "Save ur money becz this ♥♥♥♥ didnt have any work",
            "review_score": "-1"
        },
        {
            "review_text": "it may work for some people, but i wont work on my laptop   TL;DR : Get a refund, it actually decrease my fps",
            "review_score": "-1"
        },
        {
            "review_text": "bought it for csgo, didnt increase my fps one bit. In fact whenever i scope and take a shot it lags for half a second after.",
            "review_score": "-1"
        },
        {
            "review_text": "Works well with overwatch and SC2.   I made a ham sandwich. Then ate it.",
            "review_score": "1"
        }
    ]
}