{
    "app_id": 384570,
    "name": "Zanzarah: The Hidden Portal",
    "release_date": "2015-08-20",
    "developer": [
        "Funatics Software"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Action",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 331,
    "negative_ratings": 167,
    "price": 5.99,
    "description": "The legends speak of a long forgotten prophecy... of a shining hero and of perilous adventures... of sinister powers, strange worlds and swarms of fairies ... but they said nothing of a girl with a big heart instead of a big sword!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/384570/header.jpg?t=1524057329",
    "minimum_requirements": "OS: Windows® VISTA,Windows® 7,  Windows® 8 Processor: Athlon or Pentium® 2 Processor with 500 Mhz Memory: 64 MB RAM MB RAM Graphics: 3D- Graphics card, 8MB (GeForce, Voodoo 5500) DirectX: Version 8.1 Storage: 1400 MB available space Additional Notes: Please make sure you are using the latest graphics card driver (especially for NVIDIA cards). You can always find the latest drivers directly at the manufacturers' website. Please do not rely on automatic Windows updates.  - Symptom of NVIDIA cards: broken polygon display after starting the first scene. Solution: 1.   Open  NVIDIA control panel 2.    Go to &quot;Manage 3D settings&quot; -&gt; &quot;Program Settings&quot;, there, select &quot;Zantph.exe&quot; 3.    Set the &quot;Maximum count of pre-rendered single frames&quot; to 1 and... 4.    &quot;Apply&quot;. The grapic-errors should now be fixed. -Incompatibility with notebooks (FPS drops in the menu): Set your screen resolution to a modus with 32 bit color depth",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Have you ever imagined a cross between Quake and Pokémon? I bet not. And you probably also never heard of ZanZarah, an obscure German game about a teenage girl visiting a land of fairies. What these things have in common? Well, everything.  In ZanZarah you play as Amy, who goes from London to a magical land of fairies, elves and wonder. This enchanted world is threatened by an ancient evil, your arrival was foretold by a prophecy and all that. Your quest here is to explore the land, help the locals and raise a strong party of fairies to save the world. To recruit new magical creatures, you must first weaken one in combat and then capture it with a special ball. Sounds very familiar, no?   And it doesn’t stop there. ZanZarah offers over 70 magical creatures – including animals, dragons and demons – spread into 12 types: Fire, Water, Nature, Air, Stone, Ice, Chaos, Energy, Psi, Metal, Dark and Light.   Their attacks have the classic effective/noneffective relationships, and in true Pokémon fashion you also get to choose your initial fairy between three types. They even evolve after reaching a certain level.  But here’s the big twist: unlike Pokémon, you won’t battle in turn-based combat, but rather in FPS arenas with elaborate layouts, firing magic blasts at enemies while strafing, dodging and flying!  There are no guns, but each fairy can equip up to four different spells – two offensive and two passive. The game features 120 spells with a wide range of effects, damage, fire rate and mana pool. Spells must be charged before firing – some allow for quick bursts, others are very slow – but charge too much and it will backfire. All of this keeps battles interesting, as you’ll have to figure out the best loadout to use depending on the arena layout or the enemy type you face.  To crown everything, the soundtrack is excellent. Composed by King Einstein, the battle music is exciting, the exploration music is charming and the main theme is a beautiful melody sang by Karina Gretere.  The only real downside - and this will be a deal breaker for some - is that even this new 2015 Steam re-release doesn't run well on modern computers. You'll occasionally get some visual glithces and graphic artifacts, but the worst part is that the game drops to like 5fps when you open a menu, no matter how powerful your PC is.  If you can deal with this, give ZanZarah a try. If not, don't even bother.",
            "review_score": "1"
        },
        {
            "review_text": "Even over a decade later, I am still mesmerised by this fantastical world. Captured my imagination as a kid as still even now. Only thing misssing is steam achievements. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I grew up with this being a game I wasted a lot of time on, upon seeing it realesed on steam my only thoughts were along the lines of 'oh, they've updated the graphics and made this playable on some far more advanced machines then what I was using way back when' but damn I was wrong, I ended up downloading it to one of my older computers and it works fine but it's such a hassle just to go out of my way to play this on one of my severly out-dated computers, IF they ever go about making this work on superior computers then by all means I'll give this a thumbs up but until then, unless you still have a computer that runs like those in 2008, just avoid this game",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game years ago and liked it, so I bought it when I saw it on Steam. Sadly, I could not get it to play on my computer and had to request a refund. It would lag to the point I thought it was frozen several times. There are no patches for it, and Daedalic seems to have no plans to fix this issue.",
            "review_score": "-1"
        },
        {
            "review_text": "One of my favorite games of all times, a beautiful world and history. You're just going to need to install dgVoodoo if you plan to play on modern software.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not working, when you start in london, you can't move. It looks like you are standing both outside and inside, and it is like you can see a wall, but it is not.",
            "review_score": "-1"
        },
        {
            "review_text": "Some friends were talking about this game, well, instead of talking 'hyped' would be the better term. :D And they looked at me as if I was some kind of alien when asking what they are so excited about, since I am the same age but never heard of it before. So they decided to gift it to me.  So what can I say? I am not hyped like them. But that does not mean that I am not hooked already, too. Such a beautiful, lovely game! Best way to describe it: Just charming! Thanks for this gift, guys!",
            "review_score": "1"
        },
        {
            "review_text": "I think the idea of the game is wonderful. I had many video glitches and sluggish contronller movement and response. Seem like this one needs tweaking. I liked the game it was just to hard to control under Every setting and the graphic issues made this game hard to play for long. I think updates wiill address these issues. For now I had fun, but will wait as bit to see if it updates the next time I load it. Hopefully that will address my issues. I would Love to see a Vsync button I think that would help. for 7 bucks, its an ok purchase. I can't wait to see if it gets fixed!",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game when it was originally released and it instantly captured me. Where to begin?  In this lovely game you play Amy, a teenage girl who gets drawn into the world of Zanzarah. In this magical Land where dwarves, swamp goblins and elves inhabit the world, everything revolves around Fairies. These creatures exist in the astral plane , where they often battle each other.  FIrst you defend yourself against rogue fairies who lurk in trees, stones, lakes... Later on you are able to collect them. The omnipresent rock-scissors-paper principle grants interesting battles. Its a constant challenge to set up your 5 member fairy team against current obstacles, like getting through a psi-fairy ridden cave. Should you at any point be at a loss which fairy is effective against the one youre battling, simply press f1 and keep scrolling till you can see the effectivness chart.  As the story continues you begin to realize into what you have been drawn into. While it starts quite peaceful you soon uncover that Zanzarah is in peril and its up to you to save it. As you get more and more powerful (or better put your fairies) you will be able to get to Areas which were previously inaccessible. There are not many games around which give you this feeling of accomplishment / progress. Which is even more true to the rune system: You are able to fast travel to many locations, which means (too) long walks arent necessary.   While today it may seemed dated (but still very nice to look at), back in the day the graphics were simply breathtaking. Lush green forests, mountan landscapes, swamplands... you surely get around in zanzarah. And every Area is so detailed, you can feel the love to detail that ran into their design. Zanzarah can be compared with a certain asian game where red and white balls with little creatures in them play a big part ;)  In short: Get the game, immerse into the magical world of zanzarah, have fun :D",
            "review_score": "1"
        },
        {
            "review_text": "I first played Zanzarah in my childhood and it was amazing, and as of today, it is still amazing! I highly recommend this game because it captures the essence that not many games do nowadays and quite frankly not many games like this are being released anymore, but I'll tell you some more on why I recommend this game:  I'm not going to say much about the game or the story since I don't like spoiling it for other people, but I will tell you this to start with: As the game progresses you gather fairies! That's pretty much your weapon in the game (very unique to see nowadays, but we have to remember it wasn't released in any recent years) and the combat is pretty different to most games as well! It can be a bit hard to get into at first, but once you play a little more, you'll get the hang of it! You get maaaany types of fairies, all have different looks and different strengths and weaknesses! With that being, the game kind of forces you to think! You have to think of what type of fairy it is, and you have to think of what would work best against it! Of course a lot more goes into it and it involves logic when it comes to the elements you see all around you in daily life, in the game!  When it comes to settings, it's alright, I know that for some people's computers (including mine) there are crazy stutters when you open the menu and the inventory, so it can hurt your eyes a bit and that can put people off the game pretty much imagine, but don't be! That won't be very noticable the more you play and get carried away with the story and what you have to do! There are other problems I believe as well, so be prepared for that! I have the version on disk as well and there is no problems there at all, so it could perhaps be a problem with Steam or your computer, I'm not really sure!  The soundtrack in the game is lovely and the graphics are as well! There isn't much negativity I can say about the game and also bare in mind that it will take a couple of hours of your time to finish the game and to get through to some parts since it can be a bit challenging! The story is great, combat is unusual but works well, fun collecting fairies and fighting! This game may not be for everyone, but for those who enjoy a different atmosphere, combat and look, this is a game for you! ;)",
            "review_score": "1"
        }
    ]
}