{
    "app_id": 38460,
    "name": "MDK 2",
    "release_date": "2009-09-17",
    "developer": [
        "BioWare Corporation"
    ],
    "publisher": [
        "Interplay Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Classic",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 95,
    "negative_ratings": 19,
    "price": 6.99,
    "description": "3 Unlikely Heroes, 1 Ultimate Goal Kurt Hectic is back to save the universe. This time he is teamed with the genius Dr. Hawkins and the 6-legged gun-toting robotic dog, Max. Together they must out-sneak, out-blast and out-think their enemies as they attempt to reclaim earth from a vile alien menace.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/38460/header.jpg?t=1447352480",
    "minimum_requirements": "OS: WindowsProcessor: Pentium 300MhzMemory: 64MBGraphics: DirectXDirectX&reg;: 7Hard Drive: 650MBSound: DirectSound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "yes i recommend this game to anyone who enjoys comic book themed stories and 1960's style of influence in the game. this game is great and i highly recommend it to anyone who loves third person shooters and mcgaiver style quests where you must be creative when making tools and weapons",
            "review_score": "1"
        },
        {
            "review_text": "Favorite game of all time, the nostalgia from my childhood brings back good memories of old lan parties",
            "review_score": "1"
        },
        {
            "review_text": "Like the first game, but wittier and better looking. Still amazing for its variety.",
            "review_score": "1"
        },
        {
            "review_text": "MDK 2, a third person shooter, action-adventure, developed by Bioware, and the sequel to MDK developed by Shiny entertainment. The game follows the adventures of Kurt Hectic, a janitor who uses a chaingun with a limitless supply of bullets and a sniper rifle, Max, a six legged dog who smokes cigars and wields four guns, and Dr. Fluke Hawkins who utilises his intelligence to make materials to fix his problems. The game makes you go through 10 levels of killing aliens, giants aliens, and puzzle solving. Positive/s: The combat system is excellent Each of the three characters play differently, requiring different strategies to get through each level. Kickass music. Entertaining aliens and bosses A silly but entertaining story.  Overall a very fun and entertaining game.  9 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  MDK2 TRACK 21&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This game is as fun and funny as I remember it being. Can't wait to finish it again.",
            "review_score": "1"
        },
        {
            "review_text": "the sa2 of third person shooters",
            "review_score": "-1"
        }
    ]
}