{
    "app_id": 384990,
    "name": "Gon' E-Choo!",
    "release_date": "2015-11-25",
    "developer": [
        "Marc Ellis"
    ],
    "publisher": [
        "Marc Ellis"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "VR Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Action"
    ],
    "achievements": 8,
    "positive_ratings": 66,
    "negative_ratings": 16,
    "price": 1.59,
    "description": "'Gon' E-Choo!' is a 3 stage, arcade-style game based on the earliest arcade platformers. Collect 10 letters in each stage while avoiding an irate and unrelenting gator!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/384990/header.jpg?t=1458672076",
    "minimum_requirements": "OS: Windows Windows 7 Processor: Intel Core 2 duo Memory: 4 GB RAM Graphics: Intel HD Graphics 3000 DirectX: Version 9.0 Storage: 140 MB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i5 Memory: 6 GB RAM Graphics: Nvidia Geforce 760 DirectX: Version 9.0c Storage: 140 MB available space",
    "reviews": [
        {
            "review_text": "  I actually enjoyed this game. Wish their more more arcade games/machines but this was really fun. Thought it was cool when you left the machine the game still went on. 3 stages and collect the paper and avoid the hungry gator  Pros Tips can be enabled can zoom in and out from the machine inspect items  art from the game and the side of the machine is AMAZING  Cons Needs more arcade games",
            "review_score": "1"
        },
        {
            "review_text": "I just got this in a bundle, gave it a go. I think it's a lot of fun, but that's because I'm an old-school arcade gamer. To me, the £1.59 price mentally comes up as '16 credits at 10p a go' and that doesn't seem like terrible value.  It's a lot like if you took a few early 1980s arcade games and mushed them together - it's mostly like Popeye - you collect falling floaty things before they get to the bottom of the screen while this big angry guy chases you, unless you get the power-up that moves about at the sides of the screen. The animations are very reminiscent of that original game, as well as the mechanics.  The animal theme and the inventiveness of the second level, with the big tree and the way you can jump and springboard from one side of the level to the other remind me of Peter Pack Rat. It is a looooong time since anything made me think of Peter Pack Rat!  And 'getting a power-up and eating the bad guy' makes me think of Pac Man. :)   The arcade game is, for some reason, in an arcade machine in a tiny dingy room containing spare arcade parts, flyers for the game, and a tape deck with a piece of music that's like real people recorded the game's theme. I guess it's to add 'atmosphere' to the experience, but to me, this just felt kind of lonely and claustrophobic. So I went into the options and made it display the game only.  The graphical style, the font chosen for the text, the music with its authentic sounding bloops and bleeps, and gameplay are all the atmosphere I need. They are very faithful to arcade gaming of that era; I feel that a lot of love has gone into getting the small details right.  The one drawback is that the game has too few levels before it repeats. It's only got 3 levels. I mean, to compare, Mr Do had 8 levels before it repeated, and I think that's a fair number.  So - I would recommend this game, but really only to people who already have fond memories of early 1980s arcade gaming. I don't know if it would hold the attention of anyone else.",
            "review_score": "1"
        },
        {
            "review_text": "The vore animations make me hungry",
            "review_score": "1"
        }
    ]
}