{
    "app_id": 385250,
    "name": "Paint it Back",
    "release_date": "2015-10-14",
    "developer": [
        "Casual Labs"
    ],
    "publisher": [
        "Casual Labs"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Puzzle",
        "Indie"
    ],
    "achievements": 20,
    "positive_ratings": 361,
    "negative_ratings": 5,
    "price": 5.59,
    "description": "Use logic as your paintbrush to restore lost works of pixel art. Try the demo!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/385250/header.jpg?t=1484291972",
    "minimum_requirements": "OS: XP / Vista / 7 / 8 / 10 Processor: Intel Pentium M 1.7GHz Memory: 1 GB RAM Graphics: Any 3D capable card DirectX: Version 9.0c Storage: 195 MB available space",
    "recommended_requirements": "OS: XP / Vista / 7 / 8 / 10 Processor: Intel Core 2 Duo Memory: 2 GB RAM Graphics: Any 3D capable card DirectX: Version 9.0c Storage: 195 MB available space",
    "reviews": [
        {
            "review_text": "This is a good nonogram puzzle game.  It has 150+ black and white nonograms, but the picture they encode are in color (upper left on the screenshots), so the shapes are not always obvious. Sizes range from 5x5 to 40x30. For the larger sizes, there are options to break them up into smaller parts to make them easier to solve, but you get less rewards. There are also rewards for not using X marks, for not making mistakes, and for being fast. Because there's a challenge mode where it will select a random puzzle of the whole set for you to do without telling you which one it is, there is limited replayability. The interface is ok.  If you like these types of puzzles, you can confidently buy this game. (There's a demo, too.)",
            "review_score": "1"
        },
        {
            "review_text": "a lot of fun for every fan of nonograms (picross).. (hint: check coupon dumpster for 50% off coupon :)",
            "review_score": "1"
        },
        {
            "review_text": "They just added workshop support!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Charming, challenging, cheap. This is without a doubt the best picross game on Steam. Picross lovers, look no further. Newbies would also find this to be a good introduction to the puzzle genre as there is a solid tutorial and plenty of easy levels which slowly ramp up in difficulty. Highly recommended to any fan of puzzle games!",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game for everyone. My wife and kids also got addicted to it. Now that they've added in a fix to allow solving the painting without guessing (which is sometimes needed on the later really hard paintings) the one frustration I had with the game is gone.   Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "If you both know what nonograms are and enjoy them, just stop reading this review and buy the game.  If you're not familiar with the word, a nonogram is a puzzle similar in spirit to sudoku and other logic puzzles of that sort, except it's pictographic. You fill in (or cross out) spaces in a pixel grid following a simple set of logic rules, and with that information, you fill in more spaces, etc. If your logic is impeccable every step of the way, you have a picture when you're done. If not, well, you'll probably have to start over. :) They're a lot of fun, and serve as a great way to relax and unwind will still engaging your mind.  Paint it Back (I find it almost impossible not to type/say Paint it Black) is an almost perfect implementation of nonograms. There are a lot of puzzles included, at a variety of skill levels, and you can play the harder puzzles at easier skill levels if you prefer, which breaks them down into sub-puzzles for you. There are hinting modes if you need them, the controls are easy to learn and provide both keyboard and mouse-based control, the graphics are good, and the puzzle themes are funny. They've also recently included support for playing puzzles created by other users in the Steam community. Also, if you have a shared family PC, the game supports up to six player accounts so that everybody in the family can play without messing up each other's save games. (I'm not sure how critical this is if you have separate accounts anyway, though.)  If I have any complaints, they're very minor. There were a small number of puzzles that could only be completed with guess-work, and some may enjoy that (or at least not mind it), but I dislike these. There's a whole user interface element which could be implemented slightly better called 'Marks' to support this sort of guessing. Given that only 2-3 of the puzzles included required it, I feel like they could have left Marks out entirely and swapped in puzzles that didn't require any guessing and the game would have been improved. Also, at least on my system, the keyboard controls were prone to occasionally repeating when you tapped a key, which made using the cursor to count a bit tricky at times. I would have preferred a delay-before-repeat on the keyboard controls to prevent this.   This is one of my few Perfect Steam games, because the achievements were actually fun enough to go for even when they required additional play after I'd completed all the puzzles.  Overall, if you like this sort of game, or you think you might, I'd say go for it.",
            "review_score": "1"
        },
        {
            "review_text": "Paint It Back is a great nonogram puzzle game with a painting theme that I am absolutely addicted to (as you can probably tell from my playtime). A nonogram is a puzzle where you are given a grid and each row and column has one or more numbers by it which tells you how many consecutive cells need to be filled in in that row or column. You will need to use logical thinking and information from other rows and columns to figure out which cells are the ones that should be filled in and complete the painting.  It's hard to explain why Paint It Back is so addicting but it is. It is definitely one of those 'one more turn' type of games. You will sit down to play it for an hour to wind down and it will be past midnight before you know it. I think the main reason why it is so fun and addicting is that it is a very simple game to play but it also requires a lot of logical thinking to complete the paintings.  Paint It Back offers a lot of bang for your buck. At the time of this review, I had put in over 21 hours and I still have a lot of puzzles left to complete. I estimate that it will take me at least 25 total hours to complete all of the puzzles and that's with me focusing on mainly the normal and pro paintings (the master difficulty puzzles are very time consuming).  If you like puzzle games at all and especially if you like nonograms or similar puzzles like Sudoku you should definitely check out Paint It Back.  Note: I received a free review copy of the game but received no other compensation for this review.    Read my full review   [www.geekyhobbies.com] ",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. I've always been looking for a casual puzzle game that can keep me focussed but I haven't really found one that I can keep playing for a long time. This is perfect. The gameplay is simple but on the higher difficulty some paintings become serious challenges. The music does become a little repetitive but it fits so well that I don't really mind. This game is great and even if you're just a little curious, I highly advise you to check out the free demo.  TL;DR -Play the demo -This game is great",
            "review_score": "1"
        },
        {
            "review_text": "I love it. I love these kind of puzzles, and yay! a new game full of them!",
            "review_score": "1"
        },
        {
            "review_text": "I love these kinds of puzzle games for playing whilst I'm doing other things, and this game has certainly provided a good few hours of puzzle-solving distraction. It's pretty much what it looks like - a logic puzzle game where you 'create' pixel art based on number clues given to you.    Pros   + Quirky bright graphics + Easy to use interface + Decent number of puzzles + Sufficient level of challenge and the player chooses which challenge level they'd like for each puzzle + Few additional things to aim for over and above just finishing the puzzles, if you want to earn all the achievements    Cons   - I might be wrong, but I don't think all of the 'master' level puzzles are solvable through logic alone. If true, that's not great - I don't want to be forced to play out a guess in these kinds of puzzles. *Edit - Although I still don't agree with having puzzles in the game that are unsolvable by traditional methods, I do want to add that the developer is extremely responsive and as a result of mine and others' feedback has added a message in the game that lets you know if a puzzle requires the mark-up mode before you start it. I'm impressed by their response to constructive criticism as too often (in my opinion) devs either don't respond or respond badly it seems. Kudos to the devs on this one.    Would have been nice to have   Not exactly 'cons', but... While you're solving each puzzle there's a 'painting' in the top left which paints the pixels in colours as you progress. In some cases, this made it obvious where the next squares should go - I hid the painting by using windowed mode and pushing it off the screen, but it would be nice to switch this off. (I didn't spot this option in the settings). Also, and this is really a personal preference, but my favourite logic puzzles are ones with text puzzles to help you solve the grid, so it would have been great to see a few of these thrown in to mix it up a little.  All in all, does what it says on the tin, and if you like grid-based logic puzzles, you'll like this game.",
            "review_score": "1"
        },
        {
            "review_text": "The best picross game on Steam, with memorable music (albeit repetitive) and addicting progression. 30+ hours of content. Easily recommendable if you're a fan of picross.",
            "review_score": "1"
        },
        {
            "review_text": "I love these kinds of puzzle games for playing whilst I'm doing other things, and this game has certainly provided a good few hours of puzzle-solving distraction. It's pretty much what it looks like - a logic puzzle game where you 'create' pixel art based on number clues given to you.    Pros   + Quirky bright graphics + Easy to use interface + Decent number of puzzles + Sufficient level of challenge and the player chooses which challenge level they'd like for each puzzle + Few additional things to aim for over and above just finishing the puzzles, if you want to earn all the achievements    Cons   - I might be wrong, but I don't think all of the 'master' level puzzles are solvable through logic alone. If true, that's not great - I don't want to be forced to play out a guess in these kinds of puzzles. *Edit - Although I still don't agree with having puzzles in the game that are unsolvable by traditional methods, I do want to add that the developer is extremely responsive and as a result of mine and others' feedback has added a message in the game that lets you know if a puzzle requires the mark-up mode before you start it. I'm impressed by their response to constructive criticism as too often (in my opinion) devs either don't respond or respond badly it seems. Kudos to the devs on this one.    Would have been nice to have   Not exactly 'cons', but... While you're solving each puzzle there's a 'painting' in the top left which paints the pixels in colours as you progress. In some cases, this made it obvious where the next squares should go - I hid the painting by using windowed mode and pushing it off the screen, but it would be nice to switch this off. (I didn't spot this option in the settings). Also, and this is really a personal preference, but my favourite logic puzzles are ones with text puzzles to help you solve the grid, so it would have been great to see a few of these thrown in to mix it up a little.  All in all, does what it says on the tin, and if you like grid-based logic puzzles, you'll like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Paint it Back is a great Logic Art Puzzle Game. It will be very familiar to people who have played Picross or any of the other nonogram style games. I believe this was on iOS, but I have only played it on steam. It was fun, and had varying degrees of difficulty depending on how savvy you were with your X's and O's. Lots of unique puzzles specific to this genre. Even has some randomly generated puzzles for replayability once you unlock all of the rooms. I enjoyed it.   8/10 Minesweepers",
            "review_score": "1"
        },
        {
            "review_text": "At first it seems painfully easy but then you get to the painting with multiple difficulties. It's logic is similar to Sudoku and it plays a lot like Hexcells (also on steam). The story and asthetics are cute and make it feel family friendly, so I would recommend it to children; perhaps above the age of...hmmm...10? But you need not worry about the challenge as it is choosable most of the time. I've had great fun and great frustration playing this, definitly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "+ A good nonogram game with quite easy Achievements. + Finished nonograms are colourful, cute and funny. + Good also for the beginners. + Freud emoticon for the Freudian slips.  - Some glitches with the grey numbers. - Only couple of different songs to listen. - Couple of the nonograms require guessing to solve them.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun to play. Plenty of puzzles to do. Highly recommend :)",
            "review_score": "1"
        },
        {
            "review_text": "Do you like picross/nonograms? Then you'll like this game. If you aren't familiar with those puzzles, then try the demo. If you already know you don't like it, then move along, because there isn't anything extra in this.  Just classic picross? Yes, but with a great presentation, crazy sizes and workshop support, plus achievements for challenges like not using Xs. Totally recommended for picross fans.",
            "review_score": "1"
        },
        {
            "review_text": "A simple nonogram puzzle game with loads of puzzles. Touch friendly screen friendly.",
            "review_score": "1"
        }
    ]
}