{
    "app_id": 385330,
    "name": "Stray Cat Crossing",
    "release_date": "2015-08-28",
    "developer": [
        "Jurlo",
        "JetPackGone"
    ],
    "publisher": [
        "Fridge"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 441,
    "negative_ratings": 38,
    "price": 2.09,
    "description": "Stray Cat Crossing is an indie pixel horror game about an encounter with a mysterious little girl named Cat. Explore a surreal world filled with colorful characters, challenging riddles, and dark secrets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/385330/header.jpg?t=1447376978",
    "minimum_requirements": "OS: Microsoft® Windows® XP / Vista / 7 (32-bit/64-bit) Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 512 MB RAM Graphics: 1024 x 768 pixels or higher desktop resolution Storage: 200 MB available space",
    "recommended_requirements": "Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 512 MB RAM",
    "reviews": [
        {
            "review_text": "I recommend this game if pretty visuals and beautiful soundtracks are major parts in your gaming experience.   I played the demo a few days before and was very excited to play the full version. The demo covers tthe first act of three in the game. I was interested by the Ghibli-styled horror, and the first act delivered some chilling moments. However, after the first act I felt the game tone the horror down. Nothing really comes after you and the sense of dread is replaced by wonder, which is alright by I really wanted a horror experience, especially after the first act. The third act is item fetching and LOTS of repetition, and the horror elements are completely sapped.  The story is interesting, but not without poor writing. Lots of unneccessary characters and too many unexplained details. It's not hard to figure out what exactly happened by the end, but there are questions that will nag at you.  This game has incredible visuals for a 2D game. The characters are well designed and the locations are incredible. This and the amazing soundtrack are the best parts about this game.  Gameplay is alright. You have a run button to go places faster and there is one instance where you have the option to jump. Puzzles are way too easy. There's only one or two instances where you might die, so the rest plays like an interactive novel.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  This is one of the best rpgmaker games I've ever played.  I absolutely adored the music in this game. Sometimes it was cute and when needed it was completely haunting. The music helped set the atmosphere of the game perfectly.  I was intially drawn to the art-style of this game and it definately didn't let me down. It is unique and colourful with stunning character designs. I loved the Tim Burton-Alice in Wonderland feel to the 1st two levels.  The gameplay itself was fairly fluid. I highly enjoyed the puzzels, even though some were challenging.  I loved the inclusion of literature references in the background items.  The cut-scenes were cool. The story was very touching. It had me crying at the end.  I enjoyed every bit of this game and I am glad to say it has become one of my favourite games. Thank you JetPackGone and Jurlo for making a fantastic game. :3",
            "review_score": "1"
        },
        {
            "review_text": "Horror isn't usually my bowl of milk  because I'm a ♥♥♥♥♥ (cat - a ♥♥♥♥♥cat! you and your censorship, you)  but I wouldn't call this piece of art 'horror'; it's creepy and weird. The music makes it even more creepy and the art is bloody beautiful. Unfortunately, it took me months to finish playing this lovely game since I'm a lazy nuthead and I would be lying if I said that it wasn't a confusing experience for me. The puzzles were nice; not too easy or too tough. The characters were interesting except of the MC. I did like little Cat, though. I could relate to her because (running away from home, feeling unneeded and worthless). Yes, I still feel like a kid in my twenties. The boy with a camera (to be honest, I thought it was a girl) reminds me of Flaky from Happy Tree Friends. I wish I'd get to know his name at least. He was there for Cat when no one else was.  This whole game is about letting your past go. Humans make mistakes and it's natural. Someone always ends up getting hurt one way or another. Sometimes there's nothing you can do or say to make things better. Even when it makes you feel useless and you start hating on yourself - just stop right there. You can't beat yourself up over everything you do. That's life, unfortunately. It takes long to learn how to live. Too long. How many of you people are truly happy? I'm not talking about material happiness. Appreciating and cherishing what you have is a good start. 2deep4you? I beg your pardon. You could listen to blaberings of an idiot or you could do whatever you feel is best for you ( don't do drugs, kids ). I never take my own advices and that's why I'm an idiot. I'm a sad human being. All in all - gg, bee gee. Staying alive and all.  I guess, curiosity didn't kill the Cat. ",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is that this is an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool little game. Very creative.   The only negative is that there's a particularly frustrating jump-chase event at a particular spot in the game.  This game is definitely worth checking out though. It's a love letter to silent-hill in a Persona/anime wrapper.",
            "review_score": "1"
        },
        {
            "review_text": "Short and bitter. The foundation of the plot is built on pure emotions of loss, lonliness, and a little bit of anger. You piece together the background behind the mysterious girl named 'Cat' and solve your way through puzzles in a world of dark, morbid fantasy. Truth lingers just behind all the odd creatures and strange requests, do you want to know it?  *side note: I recommend just buying the game from the start because the demo covers the first third of the game and the full game only requires two hours or so to complete it, so the demo is a little too much to be a demo.",
            "review_score": "1"
        },
        {
            "review_text": "So much Spooky babby it made me Pro-Choice.",
            "review_score": "1"
        },
        {
            "review_text": "I really recommend this game if you like pixel and horror games and in my own opinion it´s really fun and worth the money",
            "review_score": "1"
        },
        {
            "review_text": "A RPG which starts with madness and slowly and brilliantly unveils it's story through subtle hints and metaphors, never giving away too much until the reveal at the end. The graphics are beautiful, the music fitting and the characters all as weird as they are special. While some areas can be frustrating when trying to figure out how to solve a certain riddle, it is never unfair.",
            "review_score": "1"
        },
        {
            "review_text": " Wish I could rate it as maybe. So in between Yes and No.",
            "review_score": "-1"
        },
        {
            "review_text": "  Basically take Yume Nikki, add some jumpscares, some puzzle elements, some dialogue, a couple nightmares and some really freaky characters and you have Stray Cat Crossing.  It's pretty great but probably not for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "It's a bit short but worth the time. It has puzzles, horror and unique characters. The story is good.",
            "review_score": "1"
        },
        {
            "review_text": "interesting story, that's about it",
            "review_score": "-1"
        },
        {
            "review_text": "This was a really fun and atmospheric game!",
            "review_score": "1"
        },
        {
            "review_text": "Might contain spoilers:  A nice little game. You can complete it in about 3 hours. I love the music, the atmosphere and the art style of it. Not a 'terrifying' horror game, but it will make you feel uneasy at times. I love the monsters in it and the story, though simple, does make you feel for the main character at the end.   HOWEVER, I still don't know who Dr. Faustus is...... And it kind of bothers me. Did I miss something???",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Loved the music, the ambiance, the puzzles. overall rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game but.......        The first death cutscene with the first monster lagged me, i've seen how it's ment to go when it happens but i only see one part of it when it happens to me, and the area with the sphinx's house lags me crazily, my pc is quite good aswell so i wouldn't see why this would happen...",
            "review_score": "1"
        },
        {
            "review_text": "One of the few unqiue RPG maker games I've played with a really strange twist. If you're looking for a good story that has a morale compass behind it, SCC is certainly different. The title was misleading at first based on the trailer but once I played the game I understood.  The only con is the game is very short (can be beaten within 2 hours or less). But the story, especially the deep thought and theories you can come up with afterwards makes you think.  Recommended if $2 or less.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful artwork, amazing soundtrack and an enchanting storyline. Doesn't take very long to complete, I wish there was more to it.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely recommended.  Been following this game's development for quite some time and the finished product didn't let down at all. The art in the game is gorgeous, enviroments and maps are well planned and the game's overall desings are really nice. Music and sounds are top notch as well. It can be clearly seen from the game that the devs have made it with care and put effort to tiniest details.  If you were to nag about something, I'd say that the game's plot was rather simple and predictable, but then again, it didn't really left a feeling that it was half baked either - since the game was rather short anyways, if the plot would've been any more complex it would've felt too stuffed and just odd.  Overall it was short, but extremely pretty and nicely done game that you can get off very cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the exploring and story was worth playing to the end~",
            "review_score": "1"
        },
        {
            "review_text": "Good game great story I'll wait for your other masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "The game draws inspiration from Witch's House, Alice in Wonderland and the like while still managing to stand by itself as it's own game. Standout music, colours and characters. It took me 2 hours or so to finish the game so I think it's worth the price. It was fun, but the themes are heavier than just a casual romp.The thing I enjoyed most about the game was the music and the characters, and it's likely you will not forget them for a long time.   However, as the final act requires tedious and unecessary repetition in order to progress. Some people have commented that the ending was underwhelming for them, but I thought it was a good payoff, as it did leave me stunned in my seat for a while.  All in all, it wasn't perfect, but for the amount of work in contrast to the price, it's definitely something fans of Ib, Witch's House and Mad Father should check out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, from the soundtrack to the story this really has it all. Without going into many details this game isnt very long but for the price tag I believe its worth the experience. Stray cat crossing has you playing as a wanderer of sorts that helps a little girl home, little does our heroine know that she's headed down the rabbit hole for a whirlwind adventure unlike any other. There are a few challenges here and there but if you can overcome them and persist, the pay off is rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "&gt;&gt; has cute larva friend that loves and accepts me more than my real friends do  &gt;&gt; dies  10/10 would have my cute larva buddy swallowed whole again",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth twice the asking price.   It's a surreal, disquieting experience with a touching ending, and incredibly well done, even though it drags on a bit towards the end. I Highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game so much! All the characters were unique and I wanted to know know more about all of them! The story left me wanting more, but wrapped it up in a nice enough way where if I don't get more I won't be too disappointed. There is still some mystery to the game that will probably have me questioning everything I saw when I look at it again in the future. For a game I finished in around 2-3 hours I think that I can say it is worth the price and the strain on my emotions.",
            "review_score": "1"
        },
        {
            "review_text": "Great story. I wouldn't call it a horror story, it's just a little weird and even funny sometimes. Gameplay wise, the puzzles weren't too hard, they just need a little bit of thinking and the hints lead to the solution; except (maybe) for the ram puzzle where he looks at the wall.  With these games, I like to take my time and if I'm stuck, I just leave and come back another time.  I hope you'll enjoy this game as much as I did.",
            "review_score": "1"
        },
        {
            "review_text": "This game was great from start to finish. If you're looking for a horror game, I wouldn't choose this though. It definitely had some creepy aspects but didn't follow a horror theme, in my opinion. The ending was amazing. Completely worth the 3 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "loved the story, soundtrack and the art of the game. Even know it was a short game its worth the play. You get to meet diffrent characters that are all unique and tie into the story in unexpected ways. there is one part that i got stuck on and had to do over manny times and was a bit annoying. But it was my own fault for not gathering all of the items needed to continue. In the end I recommend this game to all.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely astonishing.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoy a game with great art and environment? Do you favour some dank rhymes? Are you looking for a short, spooky sort of game to enjoy casually? If so, Stray Cat Crossing is perfect for you. The only aspect of this game I would change is the length. I enjoyed the puzzles and atmosphere. In fact, I absolutely love the art/graphics. I just wish this game was longer, and that there was more story. It has potential. I was only able to get four hours out of it (during my first playthrough) because I left my computer several times during my play time.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoy a game with great art and environment? Do you favour some dank rhymes? Are you looking for a short, spooky sort of game to enjoy casually? If so, Stray Cat Crossing is perfect for you. The only aspect of this game I would change is the length. I enjoyed the puzzles and atmosphere. In fact, I absolutely love the art/graphics. I just wish this game was longer, and that there was more story. It has potential. I was only able to get four hours out of it (during my first playthrough) because I left my computer several times during my play time.",
            "review_score": "1"
        }
    ]
}