{
    "app_id": 385490,
    "name": "MiniDrivers",
    "release_date": "2015-08-31",
    "developer": [
        "Ivanovich Games"
    ],
    "publisher": [
        "Ivanovich Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 3,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Racing",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Sports",
        "Indie"
    ],
    "achievements": 44,
    "positive_ratings": 66,
    "negative_ratings": 57,
    "price": 4.79,
    "description": "The craziest races are now on your hand with MiniDrivers! The animated serie which is loved by millions of people around the world has a new main character: You! Create your own stores or change the rules becoming World Champion.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/385490/header.jpg?t=1450119915",
    "minimum_requirements": "OS: Windows XP Processor: 2.2 dual core Memory: 2 GB RAM DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "-",
            "review_score": "1"
        },
        {
            "review_text": "how to use any weapon??? idk how to use it",
            "review_score": "1"
        },
        {
            "review_text": "It's buggy, annoying as hell (especially the voice), contains ADVERTISEMENT, WAITING TIME (like some of the Android games) and not fun at all! Be aware of this title! Not just the price is cheap, the whole game!  If you want similar gameplay, try out F1 RACE STARS (on sale) or you know what? Wacky Wheels! Those are great games! But not this one! I bet MiniBikers is the same formula.",
            "review_score": "-1"
        },
        {
            "review_text": "keyboard and mouse?! launchscreen?! this is not the eighties anymore... proper xinput support would be the minimum for such a game (every game tbh)  camera I ended using is still awful - dev should check bang-bang racing and release a patch to make such a perspective selectable ;) (the cameras behind the car just make the game look bad!)  love such racing games but after bang bang racing and mini motor evo this is a letdown (and not due to gfx!)",
            "review_score": "-1"
        },
        {
            "review_text": "Said that it was fun for the in game money but the game is just not fun on pc",
            "review_score": "-1"
        }
    ]
}