{
    "app_id": 385730,
    "name": "WWE 2K16",
    "release_date": "2016-03-10",
    "developer": [
        "Visual Concepts",
        "Yuke's Co., LTD"
    ],
    "publisher": [
        "2K"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Full controller support"
    ],
    "genres": [
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Fighting",
        "Simulation"
    ],
    "achievements": 55,
    "positive_ratings": 1725,
    "negative_ratings": 1026,
    "price": 34.99,
    "description": "The newest addition to the flagship WWE video game franchise will deliver fun, authentic and hard-hitting action, including returning fan-favourite features and game modes, new innovations and more!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/385730/header.jpg?t=1534550907",
    "minimum_requirements": "OS: 64-bit: Windows® Vista SP2 Processor: Intel i3-2105 / Phenom II X2 550 Memory: 4 GB RAM Graphics: GeForce GTX 460 / Radeon HD 5870 DirectX: Version 11 Storage: 44 GB available space Sound Card: DirectX 9.0x compatible sound card",
    "recommended_requirements": "OS: 64-bit: Windows® 7 / Windows® 8 Processor: Intel Core i5-3550 / AMD FX 8150 Memory: 8 GB RAM Graphics: GeForce GTX 660 / Radeon HD 7850 DirectX: Version 11 Storage: 44 GB available space Sound Card: DirectX 9.0x compatible sound card Additional Notes: At least 2 GB DDR Video Memory",
    "reviews": [
        {
            "review_text": "Do you want one of the most accurate simulations of wrestling money can buy?  Do you want (mostly) outstanding graphics and smooth gameplay?  Do you want a relatively robust amount of unlocks customization options?  Do you want a ridiculous (and I mean ridiculous) roster size?  Do you want to play a plethora of matches from wrestling history?  Do you want a satisfying amount of well-made community content?  Do you want to talk about Tyler Breeze?    This is the game for you    Are you like me and more or less simply want a career mode akin to the old SvR games, with a never ending cycle, branching paths and voice acting?  Do you want a large variety of match types, again akin to the SvR games?    Nooooope     Basically If all you want is a great wrestling sim with plenty of unlocks and historical matches, look no further. You will get hours of fun from this game. But if you want a satisfying career mode or unique match types, you will be often frustrated by this game. The career mode is repetetive and dull and you CAN'T use your character in any mode other than career, even after you retire. And beyond 2k showcase, don't expect to see buried alive matches and really any niche match types.    6.5/10 for me, 9/10 if my negatives don't matter to you  ",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Gameplay is solid. Best roster to date. Career mode is far better than 2K15's.  Cons:  Renee Young's character model looks like a methhead. Seriously. Those teeth are the stuff of nightmares. Constant branding. We get it, it's a WWE game. No need to mention that every thirty seconds.",
            "review_score": "1"
        },
        {
            "review_text": "This could be a great game, but (as mentioned in many other reviews) the constant corruption of save files is just not acceptable. This results in losing hours of downloading, editing and creating CAWs. As long as this isn't fixed, I'm done with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes 2k15 look like an unfinished beta. There are very well made improvements such as the reversal system and the ability to change difficulty during career mode.  The game itself is addictive (note: I'm a huge wwe fan anyway) it has that 'hmm maybe one more match' feel about it. The career mode is excellent with infinite choices to make your own superstar and get into the hall of fame over a 16 year career.   Had zero running issues and running it at 60fps on a gtx 770.",
            "review_score": "1"
        },
        {
            "review_text": "Currently, this is THE wrestling game to buy on steam. 2K16 is a MASSIVE upgrade from 2K15, with tons of more features such as Create a Show, Create a Diva, and Create an Arena as well as having the largest roster EVER with tons of arenas and over 100 spots of your created wrestlers. If you're looking for a stacked roster and tons of creation then I would gladly recommend 2K16.",
            "review_score": "1"
        },
        {
            "review_text": "Fighting Hitler with an army of Stone Colds. Just like what wrassling should've been",
            "review_score": "1"
        },
        {
            "review_text": "The game makes Roman look strong  10/10 for authenticity",
            "review_score": "1"
        },
        {
            "review_text": "Short version: This is no different to last year. The only change is now you have a set amount of reversals (that you regain over time) to avoid the ridiculous amont of reversals of yesteryear. Unless you REALLY love Showcase or somehow weren't bored of the Career or Universe mode's repetition, you won't miss this. It's probably better than what THQ would still be producing, but 2K are just like WWE - phoning it in now they have no competition. Why try?  Long version:  Exactly as I said in my review of last year's game, there are moments of huge potential hidden in here.  The movement is so fluid nowadays that things look a notch more realistic (like playing a tag match as The Outsiders, and Hall slips out of a move and pushes the guy in your direction as you run up and deliver Nash's Big Boot finisher, beautiful).  The tech is advanced enough to have physics for satisfying impacts on weapons and through tables now too (X-Pac's Super X-Factor onto a ladder or table you conveniently laid below is a bit more satisfying now, but not as much as setting up a table next to a ladder, fighting on top of the ladder, and powerbombing the guy off it in exactly the right place where you laid out the table, which you may or may not have set on fire beforehand.  But it still needs a lot of tweaking. They're clearly aiming for the more thought-provoking game we once had around 2007, with stamina and limb damage and how it affected your moves, but they're still not there yet. Even when they do add things, there's no tutorial and no real manual so people are tasked to find out themselves what icons mean or how to do things.  Another notable thing is finisher spamming and no-selling. Spamming finishers and kicking out of them has become cool. This has been replicated in the game, and it's just as ridiculous. Your matches can go 10 minutes too long because Rusev kicked out of his 10th F-5. It makes the health bars meaningless.  Unfortunately the graphics have always been a generation behind. There's been no major graphical overhaul in this version, it's still cartoony, and the Divas are still creepy as hell and have ♥♥♥♥ed up Joker smiles. Funnily enough, Steph finally looks a lot like Steph now - she seems to have a face that's been impossible to recreate in digital form thus far.  And how's the commentary? Well Cole, King and JBL are annoying as ever. They're all good guys ('faces') now, so they brown-nose everyone in the ring and spout hyperbole like how Kane and Daniel Bryan was 'one of the most famous tag teams in history'. They have conversations about the guys in the ring... then repeat THE SAME CONVERSATION a minute later. So kudos to 2K for accurately recreating their horrible, repetitive chatty commentary. Well King, if wishes were fishes...  While the roster is large (mainly because of the Austin showcase adding random guys like Savio Vega and Mikey Whipwreck), #GiveDivasAChance didn't reach WWE 2K16 so women didn't get the same treatment. Basically the only women are Trish, Lita and all the usual names. No one new like Sasha Banks, Bayley or Charlotte nor the female legends like Victoria, Molly, Ivory or dare I say Chyna. And for some reason Emma has her cool heel theme but is still dancing like an idiot and her face looks like a puffy kawaii interpretation rather than her actual self. With added sunburn to her face.  This year's Showcase has you play through an abridged version of Austin's WWE career (with a few bonus WCW and ECW matches). Haven't you done a bit of that before? Yes! You'll be replaying some of the matches you did in WWE 13's Attitude Era showcase!  There's no big extra bonus showcase this time around either, just one where you play one match each as the Hall of Fame class of 2015. Relive those historic and proud moments like when Jake the Snake beat the everloving ♥♥♥♥ out of inductee Randy Savage while Miss Elizabeth screamed for him to stop, or the time Alundra Blayze faced Paige at WrestleMania 31, or you can relive Kevin Nash's career- and industry-changing moment when he and Scott Hall... faced Harlem Heat in a tag match.  I always enjoyed Showcase mode (and it s predecessor Legends of WrestleMania), but it's not very interactive now. Here's how it goes now:  1) You start a match  2) 5-minute cutscene of entrances and opening moments of match, very slow-paced.  3) Get given an objective as you start the match (e.g. irish whip your opponent, do your finisher, throw them out the ring), this can take anything from 3 seconds to a minute or two.  4) Very slow-paced cutscene plays of what happened next in the match, this can be a few minutes, because they've got to show every second! You've now been sat here 10 minutes and only played for 2 of those minutes at most.  4b) Sometimes there's a QTE, which means you spend 20 seconds watching the buttons waiting to see which flashes, so now you're not even watching the cutscenes!  5) Go back to 3 until match is over.  This is combined with the familiar half-♥♥♥♥♥ unemotional commentary from J.R. He and King are slightly more believable, but now just sound mildly interested. I picture them sitting on the sofa, feet up in front of the TV and commentating on the match to each other.  My Career mode is where you create a guy and climb the ranks. In the last game it was just a load of meaningless matches, and it's not any different this time around. Again there's huge potential here. When I reached rank #1 for Kevin Owen's NXT title, I made sure my bosses (the game) gave me my shot by taking out Owens. He was having a match, so as he was doing his title pose during his entrance, I appeared into camera shot behind him, the crowd went mental, and I laid him out.  When I got promoted to Raw, I needed to fast track myself to the title, so I made a statement by going after the #1 contender for the world title: Brock Lesnar! He was having a match, so as he was doing his little pose during his entance, I appeared into camera shot...  Ah, you see where I'm going. That's the problem. You can go after people, make statements, do your thing, but there's only one way to do it, it's the same old ♥♥♥♥, and there's no intricate storylines. Just as in Universe Mode, two guys beat each other up each week then have a PPV match. Same every month. Even if something major happens, like joining The Authority, it's like nothing happened, just a random cutscene that played.  The unintentional highlight of this mode is the promos, delivered awfully and eerily similar to one of the Family Guy voices. 'Nothing but net.'  Every week you're very awkwardly interviewed by Renee Young. She asks you about a guy, you stare silently at each other for 10 seconds, then you get a choice of reply. A lot of the time these choices are vague, or it's a meaningless choice. You'll randomly turn heel for not trashing your bosses (The Authority) in your first month in the job as an NXT jobber, or you'll pick a harmless looking response and your guy will insult the fans or something.  There's nothing sophisticated though. All you're doing is saying if you want to feud with a guy and if you want to be heel or face. Every ♥♥♥♥ing week. Then do random matches and see random cutscenes, the same ones you've seen every month.  Universe Mode is completely unchanged. It and My Career are pretty much the same now. I've seen a lot of people say they stopped playing Career when they realised it was the same as Universe.  On its own as a game it's alright, but this is pretty much exactly the same game as last year, if not worse. I don't feel like I've wasted my time, but it's definitely wasted potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun, There is no lag, great graphics, and you get ALL the Dlc for free",
            "review_score": "1"
        },
        {
            "review_text": "Better than 2K15, I pre-ordered it and it totally as I expected. Worth buying, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "To keep this short and sweet, WWE 2k16 is the wrestling game that fans deserve, it is a massive improvement over 2k15 which lacked so much customization, had a lack luster career mode, terrible soundtrack and the worst matchmaking system of all time in a video game.   Pros: Game run really well, no crashes for me during my 105 Hour playthrough, and the game ran at a   constant 60FPS at 1080P (Expect for the entrances which are capped at 30FPS).    The entrances now don't have a loading screen, it just goes from one entrance to the next straight away   which adds realism to the game.   Arnold's T1 Entrance and Overall design is incredible.   Having the ability to choose what championship you want in to go after in Career Mode, as well   as choices like joining the Authority or Rebelling against them.   Soundtrack is so much better this year, and you can also use WWE Entrance Themes from the game for  Menu music as well.   Customization: You can create Divas, Arenas, Championships, Shows etc...   Stone Cold Steve Austin's Showcase Mode is just awesome.     Cons: Online matchmaking is still terrible and there is no leaderboards at all.     Renee Young's Career Interview's are repetitive, random at times with no link to your current storyline  what so ever, and she look's terrible too in the game.   No choice of Voice in Career Mode, and no Diva's Career Mode.  Overall I enjoyed WWE 2K16 way more then 2K15, If you are thinking about picking it up then you will definitely get your money's worth compared to last year, plus you get an extra 6 matches for Macho Man Randy Savage's showcase mode because you get all the game's DLC for free. 2K you are going in the right direction, keep it up.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly mediocre port of a fantastic game.  Had troubles getting to full screen but these are easily fixed in the .ini file.  Controls with keyboard are intuitive, but not ideal (this is to be expected)  Roster is filed to the rafters with both legends, and current wrestlers, however many characters that would've been great for DLC like AJ Styles, Shinsuke Nakamura, No Way Jose etc are missing.  Overally, for what we get, it's damn fun, could be improved but I still recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "You did everything right with the pc port 2k (;",
            "review_score": "1"
        },
        {
            "review_text": " Rating: ★☆☆☆☆&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ☐ Worth full-price &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ☐ Only on sale   + Massive roster. + Decent graphics.  - Horrendous optimization. FPS tanks  HARD  outside of fights on a rig capable of running modern AAA releases on the best graphics settings at 60 FPS. - Gameplay mechanics and animations are clunky and leave a lot to be desired. - QTE-fest.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game, and I call it worht it. It's fantastic, and fun. Even sometimes you can feel the game is unfair, in some of the matches and you gonna scream at your screen, but it's still good and fun.   I was very unsecure to buy it, because of alot of negative comments, but I have not yet had any errors in the game.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of WWE's best games to date. Huge roster! I miss AJ Lee's character though. Also, I disagree with a lot of the character ratings. Some are way too high and others are lower than they should be.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game and would like to give it a positive review, but with all the bugs, and now the the 1st update corrupting my save data i can't do that",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty decent all in all, but on a lower performance system expect to lower graphics levels and resolution, and expect drops to super slow-mo speed. Since PC upgrade though, once running at max graphics @ 60fps cap, plays really well indeed.",
            "review_score": "1"
        },
        {
            "review_text": "The WWE community creations' search system is all messed up and always lead me to the same spot instead of following of any of these hashtags. Plus, I won't be able to make 'NEW CONTENT' disappeared after I exit Movies menu.",
            "review_score": "-1"
        },
        {
            "review_text": "Its alot Better than 2K15 i got to Admit - Bigger Roster - Good Steve Austin Story and Bonus Objective - Godlike Animation that makes the Wrestler look more alive - All ECW Titles (Okay the Tage Team Title misses)  But why can´t i not recommend it ? You might ask  Well.....  - AI can Counter the Most Ridicoulus Moves ever (Even when their Counter Bar is empty they can still Counter your Finisher) - Stamina Systeme is ♥♥♥♥ing ♥♥♥♥♥♥♥t AI can Kick out after many Finishers when they have Enough Stamina 'Purple Bar' (I gave Ryback 6 DDTs and he could still kick out even tougth his HEad was Bleeding and his Damage Meter on his Head was Red) - My Career locks Items that i can use in Universe Mode and Normal Matches (Why ?) - Universe Mode is Buggy as Hell, i was 1# Contender for the NXT Title but i didnt earn a Single Titlematch or could fight against the Champ (even Tough im his Nr. 1 Rival). I knwo that you can Edit the Matches and can start Rivalries but still i doesn`t make sense at all - Games crahses sometimes for No Reason at all  I will change my 'Not recommend' to 'Recommend' If 2K fixes some of these Problems but for now stay away from the Game",
            "review_score": "-1"
        },
        {
            "review_text": "A lot better than last year. However still needs some performance improvements.. maybe letting out a patch may help. Otherwise, its worth the money :)",
            "review_score": "1"
        },
        {
            "review_text": "Runs well.   Great gameplay.   Suped up Creation suite.  No Cheeseburger 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros: + Game mechanics  + Very engaging game modes + Playing with friends Cons:  - Career mode can get very boring at times.  Overall, the game is really fun and engaging but can get boring over time. Fortunately if one mode gets boring, there's others to play. Aaaaaaand if they all get boring, hook up multiple controllers and play some wwe with your friends. That's the best option among all.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game most of all the downloades i got the wcw area so fun to play and go back in time",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, but the execution is kinda a miss.. the game runs in 40fps for me, and is lagging and stuttering for no reason. I played 2k15 on all settings max with endless frames no problem, so something is wrong with the port here. I am guessing this will slowly but surely be fixed, but still a bit dissapointing.",
            "review_score": "1"
        },
        {
            "review_text": "A good PC port, if lacking in graphics options such as model, object and environment detail, but is a much better improvement over the previous game. I'm not a wrestling fan, but even I love this game, with its vast customisation, game modes, character roster and sheer amount of replay value is incredible.  Running at a locked 60 fps, WWE 2K16 sees the return of many favourite game modes, like create-an-arena, create-a-diva, match types, a whole new career mode and much more. The graphics seem better than WWE 2K15, especially with the character models and costume textures. Gameplay wise, I'm loving all the match types and going into the options menu to change rules, game hints, blood on/off and so forth. And speaking of, I also love the new mini-game-like QTEs that happen when actions like a pin, or grapple, occur. It adds a simple layer of 'fun' on-top of what is already a fun, meaty game. I love making my own movesets with my characters, making an entrance for them, and an arena for them to battle in. It's just incredibly fun and you'll be here for triple digit hours with it all!  I haven't tried online, so this is an offline review. Having said that, a couple of things I want to see added in for the inevitable sequel is better audio design. What I mean is - I want to hear the occasional character scream or grunt as they pull off certain moves; giving it immersion by proportioning realism onto what is already a realistic game. Also minor, yet near-essential things like hearing footstep noises, climbing the ladder/cages, more variety in 'punch' sounds beyond the generic slap noise. And finally, better flowing commentary: it's quite jarring hearing the commentary suddenly cut-out to talk about something else I'm doing without finishing the previous sentence.  Overall, as I said, I'm not a wrestling fan at all and I doubt this game will turn me to one, but I'm very much enjoying my time with this game. Perhaps a little more violence wouldn't hurt with enhanced persistent character damage, floors being scuffed and whatnot as per real wrestling. Having said that, this is a much better, improved, real letter to the fans that were left disappointed by the previous iteration or like me, just lost interest after so many features were dropped.  Recommend to people who enjoy sports, brawlers, RPGs, simulators and action. Worth the £35 asking price? Definitely!",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR --&gt; From an objective point of view, it isn't that good and the pricetag really doesn't justify the content it offers, even if all the DLC is free on the PC version. That being said, if you want a more in-depth analysis, please keep reading.  I've been a wrestling fan for around 10 years. I remember switching channels through my TV late in the night and finding a show that caught my interest: Smackdown! The main event that day was Bobby Lashley vs Batista vs Finlay and I won't forget that match easily.  After that, I tried my first wrestling game by renting it from a local Blockbuster (does anyone stil remember those?). It was Smackdown vs Raw 2006 for the PS2. The controls felt a little bit clunky because it tried to be something it was not: a grappling simulator. However, I enjoyed every single moment I spent on that game just because I could recreate what I saw on the show and fight with my favourite wrestlers.  Fast forward to 2016 and I'm still playing the same damn game with an updated roster and a graphic mod.  The main problem with WWE 2K16 is exactly that, they've been doing almost the same game for 10 years. Sure, they've added more game modes, characters and other stuff. They have even improved the grappling and striking system to make it more fair when playing with friends (oh the times when you had infinite reversals and they were performed just by smashing a button).  If you're a hardcore wrestling fan like me, you will probably enjoy this game, even if it has really strong weaknesses as a a PC port (fps drops, physics crashing, animations glitching...) and even if it adds nothing at all to previous WWE games but a wider roster that doesn't involve repeating the same superstar in different time periods (I'm looking at you WWE 13 and your 3-4 versions of Triple H).  However, if you're looking for a fun sports/fighting game this probably isn't the correct choice for you.",
            "review_score": "-1"
        },
        {
            "review_text": "WWE games aren't what I remember them being. The controls are wonky and the gameplay seems blan. Don't spend your money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Much improved over 2k15. I got it on sale and am happy with it so far.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game from Humble Bundle (It's currently cheap.)    All of my play time has been me TRYING to get the game to run past the splash screen. It crashes every single time, I haven't installed any mods or even played a single match. I know my computer can handle the game as I pirated it before I bought it to see if it would play well. I've tried the fix everyone praises fixed their game, it worked one time and got me to the main menu, but I had to restart due to a scrolling issue; I haven't seen the menu since.....   Here's my suggestion:  If you really want to play the game, either buy it on console or pirate the game without the update, at least it will work that way...  EDIT: The issue was with the WIndows 10 Anniversary Update, so after a clean install of Windows 10 and a re-update to the Anniversary Update the game now launches, but will not go fullscreen without a Borderless Window app. It plays well, but I feel highly inconvinienced (I know W10 isn't officially supported, but it's still bothersome when compatibility doesn't work). So if you have Windows 10 build 1607, pass on this.  I brought the issue to 2K support, so hopefully it doesn't happen with 2K17.",
            "review_score": "-1"
        },
        {
            "review_text": "WCW/NWO Revenge for the N64 is what I want in a wrestling game, this is not that type of game. I wouldn't even classify this as a game, more like a very slow, drawn out rhyhthm game. I have yet to even come close to winning a match. Here's how a typical match for me goes. Throw a punch, throw a move or two, get reversed. CPU on offense now, try to reverse, too fast, wait for CPU to finish move, try to reverse, too slow, wait for move to finish, try to reverse, too fast, wait for move to finish, try to reverse, too slow.......and so on until it comes to the submissions, oh lord the submissions are terrible. Rotate the thumbsticks to avoid your opponent, sounds easy enough. Get put in a submission, move up, it's not moving up, try to go left, WTF it went right, get submitted..you lose.   The game does look good though and I like where after the match I get interviewed by Rene Young, though I'm not sure how serious I am taken when I'm 0-20 and talking about being the greatest living legend in WWE.",
            "review_score": "-1"
        },
        {
            "review_text": "This is probobly the best wrestling game you can get on a pc.Lots of fun features and customisation.You can interupt your openents entrance,i like that there are no loading screens between entrances and the start of the match.MyCareer mode is fun in the begining but after a while it becomes realy dull and repetitive.Anouncers are quite buged aswell, sometimes they repeat the same line twice or the call a reversal when a wrestler didnt reverse,a few times anouncers even called a male wrestler 'she'.The customisation is also not too bad.You can change practicly everything, but that is also the downside of this game.I've spent some time making a few arenas, custom championships and i edited a few superstars to create my own show in a universe mode.It worked fine for some time.But recently for no reason at all the game just started crashing after almost every match.I have also expierienced quite a few crashes during wrestlers entrances.Sometimes the game even crashed while performing an OMG moment on the anuncer's table.It just seems that the game can't handle all the customisation it lets you do.Overall it's not a bad game but all the crashes and model glitches that i encountered makes me say that i dont recomend this game if you like customisation since it will just make you feel frustrated after having to edit things because the game could not handle a wrestler or arena etc.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game as I used to enjoy playstation era WWF Smackdown. Little did I know that the francise has been turned into Quick Time Events game. Entirely my fault due to not reading/watching reviews. Well I can't recommend this in good faith at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I downloaded a mod that gave Kevin Owens a bigger belly 10/10 game of the year",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game, yet there is a problem I have with it. For some reason WWE 2K16 just doesnt work anymore.Its was fine before yet now Ive done everything I can to fix it but no matter what for some reason when I try playing WWE 2k16 now the game doesnt even open. I open the game on steam and it says running, then it stops. Can someone please help me with this, and I do know what the problem is but cant fix it. But I do recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Love this game :)",
            "review_score": "1"
        },
        {
            "review_text": "WWE 2K16 has a wide array of characters: J0HNCEN@, b0rk lazor a.k.a. the 1 in 21-1, and that hair stylist that your mother goes to way too often; Enzo Amore",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why the reviews are mixed. I think this is a good wwe game. I've played WWE 2k15, 14, 13, and Smackdown v Raw 2011. I think 2k16 is pretty good. I mean, there's nothing really bad about it. It's fun. Nice Custom Superstar maker. I like the face deformation. You can make some real freaks... Good times.... Good times.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game a step up from wwe2k15 the create a diva,create a champinship,create an arena and more looking forward to the next game WWE2K17",
            "review_score": "1"
        },
        {
            "review_text": "this game is really fun to play  you can play as sonic or as our god and saver gabe newell  but when i select john cena  there is nobody there  nothing in the caracter and nothing is showing in the ring  it's like the human eye can't see him",
            "review_score": "1"
        },
        {
            "review_text": "Trash.",
            "review_score": "-1"
        },
        {
            "review_text": "I've had a bittersweet experience with this game. I first bought it directly from steam, and despite having a more than optimal hardware configuration for playing it, an error would appear every time I tried to launch the game. After trying all possible methods, I got annoyed, uninstalled it, and asked for a refund.  After almost a year, I happened to win a key for the game in a giveaway. I decided to give it a try once again, only to find the exact same error whenever I tried to launch the game. This time I decided to read the threads in the game's dicussion forum, almost one by one, until I found a solution I've not tried before (apparently it was a new solution). To my own surprise, IT WORKED! And so, I was finally able to play the game to my heart's content.  I'm really happy with this game! Sometimes the FPS drop drastically while loading some of the entrances, but besides that it works like a charm. Sure, it may take an entire minute to load at first, but it's worth it. IF the developers had not abandoned this release in order to work on the newest version, things would've been different, and users wouldn't be rating the game as badly as they're doing now. Nonetheless, if you manage to 'skip' the errors it throws at you while launching the game (the ALT+tab during Steven Austin's splash screen saves lives), you'll find it's an enjoyable experience. It has really good graphics, nice animations, a challenging AI, and an impressive roster!  So, I give this game a thumbs-up.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game :) Way better than WWE2K15. No Bugs, No crashes, no Issues :)   AMD FX(tm)-8120 Eight-Core Processor, 4.0 GHz 32.0 GB RAM 64 Bit Windows 10 Home GeForce GTX 970 SLI  I'm not sure what all these negative reviews are about, unless you just have a crappy PC that's not made for gaming.....",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this game. i found the movements smoother then the previous games, the process for chain wrestling, reversals, etc, all very smooth and accurate. I dont get that 'wtf i hit the button' moment, as i didn in previous games.   the graphics are great, the male characters are spot on, while the Divas look a little 'butch' and unrealistic.   The career process is pretty much the same as 2K15. Its dry and dull, and you grind it out to advance your char. I HATE the interviews.....'and there you have it'. anyone who has played, knows what i mean, and those who are about to play, will know what i mean within 3-5 carrer matches.   I would give this game an OVERALL of 6.5/10. the career is the only reason its not an 8 or 9.",
            "review_score": "1"
        },
        {
            "review_text": "The online community it's dead, but it doesn't matter, the content of the game can give you a lot of hours to have fun. :3",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing",
            "review_score": "1"
        },
        {
            "review_text": "EDITED: The controls are still pretty bad. Took a while to get 'used' to them. Much of the time it feels like you are not in control at all. The submission wheel thing is just horrible. I really wish they had an option to change it. The CPU is a bit unfair. But I suppose that makes the game more challenging.  the CAW is alright. You can make all kinds of things, but the body types are pretty bog standard.   I would only recommend if you buy it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "What can I say about the game other than it's a disappointment? Before I downloaded the game and spent the $50, I double checked to make sure my system was able to run it. It was. I like that there's a variety of superstars and a variety of different match types and I personally don't mind that you have to unlock things because after all game wouldn't be fun if you didn't have things to earn. The problem is I can't play any of the matches as this thing crashes more than a driver playing GTA. I was able to create a superstar but the minute I go to edit? Crash. The minute I try anything other than character creation? Crash. And I'm a female so I expected that you can't really do much of anything but go for the Diva's championship but seriously, I felt so left out about the story mode (which I couldn't do anyway because it kept crashing).  I hadn't played any WWE games since the Playstation 1 and I was really looking forward to it. Honestly? Not worth the $50",
            "review_score": "-1"
        },
        {
            "review_text": "The reversal system is worse than hitler",
            "review_score": "-1"
        },
        {
            "review_text": "This game is excellence of execution ",
            "review_score": "1"
        },
        {
            "review_text": "A lot better than some of their previous ones. However, it still belongs in a pile of garbage. The moves have no clear indicators to when they are gonna happen so you can't properly reverse them. I'm not talking about moves just being hard to reverse, I'm saying that the characters just teleport to certain spots when they do a move and the reversal indicator is never properly timed. The submission system can either work or just spaz out sometimes. The game has very little in the way of proper introduction to some of the newer mechanics if you haven't played any recent WWE 2k games and that can really affect a match. In MyCareer mode you constantly get asked questions by a monster(mouth and eyes like to freak out) and the answers are very bland. The character creator is once again a couple steps forward and then a couple back. It takes forever for certain parts to load and sometimes they don't load until you have completely set them up. The game can still be fun if your a WWE fan, but I can't recommend it as a game. 2K has had so many chances to make a good WWE game, but it's just dissapointing that this one isn't as good as it should be. As I mentioned though, the game can still be fun if your a fan of WWE.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing trash. It makes me want to end my suffering every moment i play it.   10/10 Game of the Year 2004",
            "review_score": "-1"
        },
        {
            "review_text": "Submission system is ♥♥♥♥ed Pin system is ♥♥♥♥ed Reverse System is ♥♥♥♥ed  you have to take a ♥♥♥♥ load of cocaine to hit the right button at the right time.  cena kicked out at 2 after three dirty deeds in a row by ambrose.  but at least you can have undertaker vs. sting at wrestlemania.  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "One Word For this Game. Realism. 1V1 John Cena, Roman Reigns, Rock, HHH. I did Mutiple Finishers, then one finish from them. Boom! So real.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to give a negative review, I really wanted to, but the only thing that kept me holding off is the content and the price. The career mode has taken a leap from 2k15, However, it still needs a lot of work. The career mode is repetitive and the game just loses its track. Events happen once in a blue moon, you cannot even start a career match without someone running in your match, the rivalry that follows that is very repetitive. The roster is a huge YES! However, please consider that if you are a fan of WWE games for their Career mode like me, please look elsewhere, the career mode is one boring ride but the only good content other than Showcase!",
            "review_score": "1"
        },
        {
            "review_text": "Slightly less terrible than 2k15, the series is on the right track, but I can't with a clear conscience recommend this game yet",
            "review_score": "-1"
        },
        {
            "review_text": "tooooo nice 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome currently playing a royal rumble while writing this luckily im number 30... but anyways this game is great mainly because I love wwe in general I dont know if you would like it if you're not a wwe fan but if you are go for it. its great it would be cool if they added cool features like more weapons being able to have more than six wrestlers in the ring at a time etc I hope you buy it and enjoy the game as much as I have :D",
            "review_score": "1"
        },
        {
            "review_text": "-----------------------------------------------------------------------  The good:  Way better than 2K15  Sound and music are very good  Roster feels more balanced  Cena no longer always kicks out at 2  Graphics are fair to good, depending on specs. I run everything at max settings and it's pretty good looking.  Foreign objects do as much damage as they actually should now  Supposedly multiplayer is good, but I havent tried it yet (Same thing with MyCarereer)   IF you buy the DLC, you actually get a good amount of things for what you pay for  Title managment (Not new, but fun as hell with all the options you are given)   --------------------------------------------------------------------------------------------   The bad:  For some reason, I had to use a 360 controller for my 2nd player, as a USB keyboard did not work.  If you don't have a solid state drive, you have to wait about 5 minutes for the game to startup everytime (This has been fixed with the latest patch)  A lot of characters use the same animations  Odd, slow motion glitches when characters go outside the ring area (announcer table, intro lane) and this is not graphics,  it does the same thing on low settings for me (Fixed with latest patch)  Some ladder and tag team matches work, but i have crashed about a fourth of the time trying both of those (Stability for theses matches has increased greatly with the latest patch)  Apparently if you use AMD this game pretty much won't run and the devs don't plan to release fixes for it  Announcer repeat themselves OFTEN, More than 2K15 even  Sound patches out when doing 4 or more characters in 1 match (This is no longer a problem, it has been patched)  Crashes seemingly at random (Not often, it did twice in 2 days which is not that be IMO) when in the menus or loading  screens  Counters sometimes say 'Too Early' or 'Too Late' even when no button is pressed, leading me to belive the ocunter system is messed up (It works sometimes, but really feels like RNG)  -------------------------------------------------------------------------------------------------------------------------------  All in all, you liked 2K15 or are really into wrestling, yes, I think you would be ok with buying it now.   Hopefully they patch it soon, because the game did just release and it seems like these wouldn't be hard fixes.   EDIT (3/29/16): The latest patch has fixed NUMEROUS issues, making the game feel completed now. I would most certainly reccomend this game right now, as most bugs and issues have been fixed. PC users can finally say we have an actual, good wrestling game now :D",
            "review_score": "1"
        },
        {
            "review_text": "good game but they could do more about the creat a diva in my career mode cause the creatadiva seems other wise useless to me but other than that i love the game",
            "review_score": "1"
        },
        {
            "review_text": "Fun when it works.",
            "review_score": "-1"
        },
        {
            "review_text": "Can ♥♥♥♥♥ smack Brock Lesnar as Mr. McMahon 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Improvement from wwe2k15 . Good interface with good fighting styles . Although they could've added better superstars in the roster like Rey Mysterio , CM Punk and Jeff Hardy. Definently worth it if you are wrestling fan !",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Great game untill i lost all my saves, Thanks 2k.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game! love all the classic content....Just hope 2k17 comes out day one with console versions. Also, I play across 2 different machines and save file sync up instantly...havent had any of the corrupt saves others are reporting",
            "review_score": "1"
        },
        {
            "review_text": "Better than nothing...",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game but wait till WWE 2K17 is out on PC in febuary",
            "review_score": "1"
        },
        {
            "review_text": "Better than nothing...",
            "review_score": "1"
        },
        {
            "review_text": "It's like WWE but much less repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "The server is already on a countdown for turning off, buying this game with both the creation system for caws and the online gaming tied into the server makes it not worth buying.  The game works well on my Windows 7 mid range games machine, it seems to have lot of problems for some windows 10 users, It isn't a mistake that they didn't list windows 10 on the supported O/S list.",
            "review_score": "-1"
        },
        {
            "review_text": "Other than the graphics i find this game unplayable. Maybe if you had been following the series its fine but seriously 2K just made wrestling boring.... think this game has a damn bloody steep learning curve.  Others may like it for the characters and all but this will be my last WWE game im getting...",
            "review_score": "-1"
        },
        {
            "review_text": "It just wasn't really fun... The fighting was really just boring. Where was the skill, where was my sense of growth as a player. Was buggy. The my career mode was lacking any narrative, which I thought would be a huge draw card for wrestling which is a sport that appears to be literally constructed around story telling.  ",
            "review_score": "-1"
        },
        {
            "review_text": "worst game i ever played",
            "review_score": "-1"
        },
        {
            "review_text": "This game has major problems, knowing the history of the developer 'Yukes' you'll never see these issues go away. As bugs and glitches from 2003-2004 still persist today.  First off they are still using an Outdated 15 year old engine. The third party havok physics etc. are added on top of it. It explains why when you create a wrestler each item takes ages to load. The game has to analyze the layer of clothes etc, it's amatuer and lazy development - considering other developers like iD software's John Carmarck rewrites engines from scratch for optimization.  Much of the game does not really reflect the 'WWE' experience or pro wrestling in general. It's a step above the old arcade button mashing and going in the right direction towards sports entertainment, I'll give it that. But it cannot decide whether it wants to please Wrestling fans, Casuals or 'Multiplayer Annoying Competitive gamers who don't watch wrestling but brought this game to fight people online.' Online play is basically people running around the ring and spamming one move just to win. It's sad, the Multiplayer Non Wrestling players are pathetic. There are less Wrestling fans playing this and more Multiplayer Button Mashers have sadly brought this.  Alot of stuff hence becomes confusing to arcade gamers. Since they don't watch the show, they might not understand the significance of OMG moves etc.  Showcase mode is Cutscene + QTE-fest. It relies heavily on nostalgia for engrossment.  Yukes overlooks the best feature every year. And that is, UNIVERSE MODE. Yep, they still have no idea what to do with it, and instead spend all year focusing on Showcase mode. Universe mode now is more RPG like, but the A.I booking is trash. The realism is a joke, so much that you can call it amatuer and lazy development. Teams and stables are useless, no managers are possible in rivalries. And yeah simulate enough and your Wrestlemania main event is Darren Young vs Erick Rowan. Money in the Bank is thrown in half baked, you cannot play the match before cashing in. Custom titles have a glitch which doesn't allow the weeks to be counted. Rivalries are simply beatdowns. Stories have been removed. The personality and RPG Statpoints are so underdeveloped and pointless. 5 chairshots will make the opponent instantly get up, thats the most realismn breaking feature. In universe mode they could have added realismn, not Mortal Kombat.  Don't bother with career mode, it's a grindfest and half baked with a demonic looking Renne Young interviewing you.  Create a wrestler is slow and painful to use. Create an Arena is fine and works okay.  Create an enterance is pointless as you cannot change camera angles anymore, whats the point of having pyros if you can't allow the camera to zoom out? LAZY DEVS! Lets not forget the lack of good or usuable enterance themes. Another thing is that this game gives less custom stuff for you to use in creating shows, wrestlers etc. Transistion animations, enterances, music, titanatron are so limited. If people create stuff they don't want to use stuff that already exists.  Largest roster superficially, 1/4th of the roster are duplications of Stone Cold, Undertaker and Rock.  Lets remember, the guys who had the attention to detail in Yukes are long gone. This series is just a yearly cash grab, The graphics and engine are really showing it's age. Just see how stupid Paige, Seth Rollins etc. looks in the game.  It's sadly the only good WWE game on the store, till it's 60$ addon comes out. ",
            "review_score": "1"
        },
        {
            "review_text": "  Cena kicks out at 2 after 5 finishers. 10/10, a masterpiece of realism.",
            "review_score": "1"
        },
        {
            "review_text": "i cant play i have windows its kicks me out in the title screen with stone cold what do i do i tried eveything runing ad admenistrator the alt tab trick nothng works i spents $60 i want to play this game",
            "review_score": "-1"
        },
        {
            "review_text": "What a garbage game.. 10/10 would not recomend again!",
            "review_score": "-1"
        },
        {
            "review_text": "it lags i lot screw steam for this plus it sucks ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't decide whether to buy this on PC or PS4. Went with the PC version because of the price tag which included all the DLC...wrong choice. Gameplay is so choppy its unbearable. Tried turning all the graphic settings down, didn't help much. I've never had a problem running games before. From Fallout/ and Bioshock:Infinite to starcraft and Dota 2, this is the first time Ive had this problem. Should have went with the console version, as now I am just out of money. Very Dissapointed. Makes me afraid of buying games now realizing how screwed you are if something like this happens.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is worth it but I don't understand why it doesn't save when you close it and re=open it again",
            "review_score": "1"
        },
        {
            "review_text": "controls are ♥♥♥♥ed..",
            "review_score": "-1"
        },
        {
            "review_text": "I can't get the game to run. I am running the game on the Alienware Alpha. The specs are:  Intel Core i3-4170T CPU 3.20GHz 8.00GB RAM 64 Bit Windows 10 Home  I keep getting the loading screen that just sits there. Can anyone help me figure out why it's not working?",
            "review_score": "1"
        },
        {
            "review_text": "controls are ♥♥♥♥ed..",
            "review_score": "-1"
        },
        {
            "review_text": "I play wwe2k16 in start a match always stopped working,please fix this problem soon......thank.",
            "review_score": "-1"
        },
        {
            "review_text": "im disappointed cuz theres not alot of stuff to wear in creation mode .. the new wwe gen is so bad and the submissioin and pin sucks.. R.I.P wwe games",
            "review_score": "-1"
        },
        {
            "review_text": "This game runs lilke utter dog ♥♥♥♥. My PC run at spec above whats required and it still runs at 5FPS, game continusly crashes, and sound is always droping out. But if all of these arent a turn off then the game itself isnt bad (if it wasnt broken)   6/10",
            "review_score": "-1"
        },
        {
            "review_text": "nice games",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best wwegaming experience till date",
            "review_score": "1"
        },
        {
            "review_text": "cant even start my career becuase it keeps crashing and its constant bugs, it looks cool i just wish it was playable. I will have to give it a thumbs down until the game is patched and works.",
            "review_score": "-1"
        },
        {
            "review_text": "the game crashs !!! fix it",
            "review_score": "-1"
        },
        {
            "review_text": "THE ULTIMATE WARRIOR PACKS SO MUCH DESTRUCITY HE CAN NOT BE CONTAINED BY YOUR GTX980 VIDEO CARD!!!    In all seriousness, I paid $49.99 for this game but got what essentially amounts to a really crappy Stone Cold desktop wallpaper because even when I do manage to sit around long enough for it to load into the game the second I go to get into a match my screen goes blank and the game crashes.....",
            "review_score": "-1"
        },
        {
            "review_text": "Didnt enjoy ot to many QT events not my cup of tea",
            "review_score": "-1"
        },
        {
            "review_text": "no entrance music online, crashes all the time, super buggy, The Rock says dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "I can't see the quit game option in the main menu. Needs patched.",
            "review_score": "-1"
        },
        {
            "review_text": "  it is hard to get use to but you can do it",
            "review_score": "1"
        },
        {
            "review_text": "When pressing play on steam it says the game is running but it wont run. first game i got a refund for no fix on the forums both on steam and 2K.",
            "review_score": "-1"
        },
        {
            "review_text": "Whenever you try and launch it Stone Cold puts your computer in a kimura lock until you forcefully quit. 10/10 Quality Product",
            "review_score": "-1"
        },
        {
            "review_text": "No..Just No...",
            "review_score": "-1"
        },
        {
            "review_text": "Poor performance no matter what settings I choose and my computer meets the spec requirements. Guess not even the PC can save this ♥♥♥♥♥♥ game EDIT: Ok so the game actually runs fine now that I restarted my computer but now it crashes whenever I go into community creations fantastic job 2k you really are a great developer.",
            "review_score": "-1"
        },
        {
            "review_text": "The pin and submission system really ruin the game for me, their very awkward to complete also the reversals in the game are very annoying, everything i do seems to get reversed which makes the game very annoying and boring!",
            "review_score": "-1"
        },
        {
            "review_text": "Ive got all the setting as low as they can go and still it is studily laggy, I waited months for this Will there be a patch?",
            "review_score": "-1"
        },
        {
            "review_text": "No Hulk Hogan. No options to creat Hulk Hogan. Shame on you WWE get over your selves. What Hogan said was not racisit he was joking with his friend. When he isnt in the ring he isnt your property, and if you think he is that makes you slave owners WWE and that makes you racsist.",
            "review_score": "-1"
        },
        {
            "review_text": "this game so massed up",
            "review_score": "-1"
        },
        {
            "review_text": "No educated feet. JBL sucks  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game but when I play the carrer i keep finding the AI changing the game so it is easier to win. I just fought Curtis Axel and my controller 'convientlly' stopped responding when I was in a submission hold. Also the game speeds up the bar to kick out and as well as lowering your damage. Also it will NEVER put you up against someone in your range of overall. Your an overall of 60? Ok have fun battling people of overalls 70 and above. The game cheats so it can win. If the deveolpers see this FIX YOUR GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Just Spent 38 hours trying to finish the damned repetitive MyCareer mode so i could Export my character into universe mode, Only to find out (Despite what the game tells you at the start of Career mode) That you cant export characters from my career, Which means the 20 or so hours that i didnt enjoy of mycareer, i went through for absolutely nothing, and as a result im probably not going to play universe mode, which is a shame because ive loved that mode sense i first played it in SvR 2011, Its such a shame that the Glorious Andrew Omega, WWE'S STAR WEEABOO cannot be retrieved   Says all the nice guy things Wins all matches Cleanly Allies with the top Faces Rivalries with the top Heels Defies the Authority at every corner  Is still somehow a heel.... This must be what it feels like to be Roman Reigns 10/10 Super Villain Plushie Simulator",
            "review_score": "-1"
        },
        {
            "review_text": "It's so ♥♥♥♥ing bad, it's beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Game is really fun going through the showcases and it does really hit the nostalgia factor. I did have concerns buying this after reading about the issues on these boards.   The game does tale a bit to load 2-3 minutes.   i have gotten a couple of game crashes   i am using windows 10   With the exception of the long load and the couple of crashes ive had no issues whatsover. I have not downloaded any user created content though.   overall i do not regret my purchase. they just need to patch a couple of minor issues in my opinion ",
            "review_score": "1"
        },
        {
            "review_text": "First buying this game, I'd say it's decent. I admit, there are some modes I wished had returned from earlier games and the MyCareer is a bit repetitive, but it's atleast a step in the right direction, away from WWE 2K15. Also, I would go ahead and reccomend WWE 2K17. I just bought it for PS4 and it's amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Slightly better than last years version, but still not worth an upgrade if you have it already. I downloaded Chuck Norris and used him for the campaign mode, so thats a plus I guess.  Is there a thumbs in the middle button on here somewhere?!",
            "review_score": "1"
        },
        {
            "review_text": "9.0/10",
            "review_score": "1"
        },
        {
            "review_text": "Never played a wrestling game in my life, never been into wrestling, all I did was laugh at it.  My first real experience into the pro wrestling world. I was not disappointed. Funny as hell with friends. Lots of stuff to do and unlock. Is good.  10/10 would meme again",
            "review_score": "1"
        },
        {
            "review_text": "Laughably bad I already owned this game on PS4, and once it went on sale on Steam I figured I'd give it another try. Do not expect any enjoyment during online play, the lag renders the game virtually unplayable. Creation suite is a joke, and takes twice as long as it should to load anything, and dont even try to get your face into the game first try. The gameplay itself on single player is okay, but nothing great, and is far less fluid than WWE games over 10 years old. There are visual glitches seemingly every match, and any time a wrestler is wearing a championship belt it seems to float around their body, genuinely pathetic looking for this series. My career mode is also a waste of time and the showcase mode is halted as soon as you face Bret 'I'll reverse everything' Hart. Overall, this game really isn't up to much, it's fun in certain circumstances, but not because it's good.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "i cant open the game.help me please",
            "review_score": "1"
        },
        {
            "review_text": "People hate certain aspects of this game, and sure it could be more polished. However, I love the roster depth and community content. It's a great time waster for wrestling fans. Watch your favorite wrestlers fight and control them. It's pretty amazing. Now, let's pray that they deliver 2k17 quicker.",
            "review_score": "1"
        },
        {
            "review_text": "kevin owens attempted to pin me during a pre match run in  10/10",
            "review_score": "1"
        },
        {
            "review_text": "WWE 2K16 is alot better then WWE 2K16... the graphics are nice, it runs really smoothly along with playing very smoothly. This is overall a good release&lt; 2K just gotta get a good mod support system.",
            "review_score": "1"
        },
        {
            "review_text": "*starts game* *Laggy as ♥♥♥♥* * updates drivers and turns down settings* * little better* *realizes the benchmark is with 6 ppl in 1 match* *goes to mycareer* *goes fine* * waits for patch before going to more than 2v2*",
            "review_score": "1"
        },
        {
            "review_text": "Probably the ♥♥♥♥♥iest controls I have ever experienced with the exception of the keyboard controls of the PC port of dark souls. There are so many things bound to each button when using an xbox controller that you are lucky if your character does what you actually want him to at any time. Couple that with a twitch quick time ♥♥♥♥♥♥♥t reversal system that the AI completely ignores and it makes a terrible experience.",
            "review_score": "-1"
        },
        {
            "review_text": "So far, the game is okay. To deal with framerate issues, I reduce the number of crowds in the arena.",
            "review_score": "1"
        },
        {
            "review_text": "The loading time between the entrance and the actual match is on par with Zack Ryder's appearance - close to none.  Game runs very smoothly. Spent quite a while at CAW and MyCareer mode; MyCareer has quite the upgrade when compared to last year's game. I didn't try the showcase mode yet, but the game seems packed with a lot of content.   If you liked WWE 2k15, you will love WWE 2K16.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the ♥♥♥♥♥iest controls I have ever experienced with the exception of the keyboard controls of the PC port of dark souls. There are so many things bound to each button when using an xbox controller that you are lucky if your character does what you actually want him to at any time. Couple that with a twitch quick time ♥♥♥♥♥♥♥t reversal system that the AI completely ignores and it makes a terrible experience.",
            "review_score": "-1"
        },
        {
            "review_text": "200% better than WWE 2k15 More customization, more modes, a huge roster. I havent had this much fun with a wresting game since WCW vs NWO Revenge/No Mercy/SvR  Plays like butter at 2160P/60hz with 2x970 Windforces, i7-5820K, 16GB Ballistix DDR4, W8.1Pro. No SLi issues either.  Can I get a Hell Yeah? (SCSA style).",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is solid and challenging. The career mode characters and story seem really flat in comparison to the Showcase mode which is the best part of this game for me. Reliving moments from Stone Colds career in amazingingly accurate detail is a lot of fun to watch at least once. That novelty will inevitably wear off, but I am having a lot of fun on this.  Entrances are locked at 30fps and gameplay is 60fps, but IMHO its not a limiting factor when you are just watching the entrances and not playing them. 980 Ti maxes this out at 4K, no sweat 60fps.",
            "review_score": "1"
        },
        {
            "review_text": "Was hoping to have some fun reliving my PS2 smackdown games.   All this game does is test your reflexes to see if you can hit the reversal quickly enough. But if you do it too well, then you run out and can't do anymore. How's that make sense? And pray you don't get in a submission, even with an XBox 1 controller it's impossible.  Health doesn't really matter, stamina doesn't really matter, hell, even specials don't really seem to matter, the match will end...eventually.  Load times are unbearably long, even with an SSD.  The graphics are about the same, though, so there's that.",
            "review_score": "-1"
        },
        {
            "review_text": "Coolest wrestling game . I recommend it .",
            "review_score": "1"
        },
        {
            "review_text": "this game is not worth it that is the third time i lost my data and i don't recomend buying this game this game is crashing a lot losing data a lot i don't recomend this game",
            "review_score": "-1"
        },
        {
            "review_text": "Reverses finsher with no reversals.  GG",
            "review_score": "1"
        },
        {
            "review_text": "Contrary to what some are saying about performance, I can confirm that you can absolutely melt your GPU off with insane frame count if you're running a higher end system.  The game runs fabulous for me but I keep V Sync on to stop 3452 fps coil whine from getting out of control.  Pros to this years offering? Improved CAW, though masks and facepaint still leave a lot to be desired. Slightly better visuals than last year on PC. It's a Triple A wrestling game on PC!!! Game mechanics are improved over the b.s. that was 2k15 (even though I liked that title too)  Cons? the CAW voice can not be changed and the voiceovers and dialogue leave a LOT to be desired. Rivalries, while pretty cool, are super repetitive especially in the early stages of your career. It takes literally for ever to get to main event status (at least in my experience thus far).  Overall the game is really well designed in my opinion, and being able to download smarky ♥♥♥♥ from the 2k creations hub thing is great for any fan of the actual business itself. You can also download and run some pretty well put together CAW's from the hub who look like new WWE additions, or some other indie faves or past wrestlers who did not make it in. If you've got the cash now go for it. I picked up 2k15 last year for $13.99 but had no trouble getting this years offering on release day for PC at full price.  ",
            "review_score": "1"
        },
        {
            "review_text": "John Cena speaks Chinese /10",
            "review_score": "1"
        },
        {
            "review_text": "2K16 is a pretty solid game that is a good gateway to understanding the appeal of professional wrestling. Not only does it cover the highlights of the poster child of WWE's Attitude Era 'Stone Cold' Steve Austin, but high points of the newest Hall of Famers like Alundra Blayze, Rikishi, and 'Macho Man' Randy Savage. Needless to say, experiencing Career Mode is a good place to start for anyone that wants to know why people tune in to buff guys pretending to hate each other (sometimes) and not-so-pretending to beat the Hell out of each other.  For those who want just a match, the roster is enormous and the modes are varied.  Wrestling is an inherently creative endeavor, and with 2K16's tools, creativity is encouraged. Build custom wrestlers with their entrances, arenas, shows, tag teams, championship belts.  Universe Mode is like being in charge of your WWE programming lineup, which means you can make something better than current programming easily.  While no means an absoultely complete and flawless experience, it's pretty close.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like wrestling games this is the game for you i recommend this game because first you have a lot of gamemodes like no holds barred table ladder and much more second it's graphics are amaizing third (the most good thing in this game) if you had a bad day or you are really really angry on somthing just play this and pretend that the thing you angry on or the guy who did you a bad day",
            "review_score": "1"
        },
        {
            "review_text": "There\\'s been a handful of crashes and glitches, but overall a good enjoyable game with beautiful graphics.",
            "review_score": "1"
        },
        {
            "review_text": "In not that much of a fan of the WWE, but I like wrestling games. I do recommend this game, since it's pretty good and perhaps is the best one available for PC. However, there are a few things that I don't like, I hate or I simply wished they haven't removed.  Cons -No custom matches: Which means you may only play with the ones defined by the game. Not a big variety and you can no longer change things like 'win by Finisher only' and stuff like that.  -No symetry when creating superstars or divas. You edit things with points and the lack of a symetry tool makes the process a bit tedius.  -I know it's the PG era and stuff, but I do miss the intergender matches. You can kinda 'hack' wrestlers to be able to fight intergender, but it could increase the risk of crashing the game.  -Wrestler creation process is in general slow and lacks of previews... but keep reading. XD  Pros -In depth wrestler creation. If you take your time working on this, you can get pretty awesome results. There are certain limits but in general creationg is pretty cool. Even when you can't preview anything and the process is slow, if you enjoy spending hours customizing, this game is good.  -Sharing content. Or if you're lazy and are looking for Deadpool, Rainbow Dash or Undertaker in another outfit... you can just see if someone already made it and download it.  -Universe mode. Kind of like a story mode, which can be customized. For example, you can select only your custom supersatrs to be part of the matches, set the championships and stuff. Way better than the actual story mode.  -Good gameplay. As any wrestling game lately, it takes a bit of time to get used to it, but it's pretty well done.   Long story short: If only intergender matches were a thing, as well as match creation/customization... I'd love this game. As it is now, I just think it's good.",
            "review_score": "1"
        },
        {
            "review_text": "I Love This Game",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, I've really had alot of fun with this. Lots of wrestlers and game modes. A very good value with all the DLC for free. Not a perfect game but I'd give it a solid 8/10. My two biggest gripes would be that it is hard to switch targets and you can't rebind xbox 360 control configuration. I would really like to rebind the reversal button to something other than Right Trigger, because you have to press it so fast, and squeezing a trigger is slower than pushing a button for me. Also, sometimes the indicator for reversals doesn't pop up on screen even with plenty of stamina. So, three gripes but nothing game-breaking.  *EDIT*: I didn't think it would happen to me but my save somehow got corrupted. I saw that this has happened to others as well. I'm not gonna nownvote even though that's 100 hrs down the tube, cus luckily I can unlock everything instantly I guess. It still sucks though and MyCareer is wiped. I like the game overall still but I hope this problem gets fixed if possible.",
            "review_score": "1"
        },
        {
            "review_text": "good WWE game, downside for me and some others i found on disscusion page is our game crashes at 2K Showcase, oh my gosh, i really hope dev will fix this issue  after that i will give positive review",
            "review_score": "-1"
        },
        {
            "review_text": "Way better than 2015",
            "review_score": "1"
        },
        {
            "review_text": "HE ALMOST SPEARED HIM IN HALF! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty fun. Universe Mode in particular is a ton of fun with a bit of imagination (since using the Rivalries function will just basically give you the rivals fighting each other every week, and then again at the PPV). Booking things on your own will get you a ton more enjoyment out of it. Showcase is fun as well, depending on if you're into reliving the past or seeing/hearing about the past for the first time. MyCareer is kinda lame in my opinion. It reminds me of the Career Mode from like, SvR2009. Which was basically just a series of matches.   Overall though, it's the most fun I've had with a wrestling game since No Mercy on the N64, so I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good pc port of WWE 2k16, so far I have not seen any problems or crashes, it also has all the DLC included which is a nice bonus.",
            "review_score": "1"
        },
        {
            "review_text": "The 2K Showcase mode in this game is excellent, it's a fun way to play through stone colds vest matches, and really teaches you a lot about the attitude era.  The game is incredibly buggy, but buggy in the fun sense, that characters can fly around and ladders will shoot off the ropes.  My Career is also bugged, it has a save game error that affected me and a small number of people, but be wary, although there is a work around... other than that it is a solid mode, that is fun and replayable.  The customisation of characters is great and very fun.  I recommend this game, but it does have it's flaws, but it is a 2K WWE game, and it's what we expect, definitely pick it up while you're waiting for 2K17 to hit PC.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty Good game to smack people around. Had fun Playing and makes me remember the first WWE game that i played on ps2. Overall great game to have fun with.",
            "review_score": "1"
        },
        {
            "review_text": "I know the real thing is scripted, but no matter how many times I pin an opponent they kick out making it seem like the game is rigged too.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun game. Most negative reviews of this are from people who had a technical issue with the game and just gave up right away or they got rid of the tutorials. Very great game and is a good direction for the WWE games",
            "review_score": "1"
        }
    ]
}