{
    "app_id": 386080,
    "name": "Pharaonic",
    "release_date": "2016-04-28",
    "developer": [
        "Milkstone Studios"
    ],
    "publisher": [
        "Milkstone Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 56,
    "positive_ratings": 150,
    "negative_ratings": 32,
    "price": 10.99,
    "description": "Embark on a journey of exploration and violence in the Two Lands of Egypt with Pharaonic! This unforgiving Combat RPG features an streamlined and challenging combat system that will keep you on your toes while fighting for your life!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/386080/header.jpg?t=1503926177",
    "minimum_requirements": "OS: Windows XP SP3 Processor: Dual Core processor Memory: 2 GB RAM Graphics: DirectX 10 capable hardware Storage: 1 GB available space Additional Notes: 64bit OS recommended but not required",
    "recommended_requirements": "OS: Windows 7 or newer Processor: Quad core processor Memory: 4 GB RAM Graphics: GeForce 460 or better Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Harder and more rewarding than dark souls 3, a little jewel that every dark souls fan should have in his library. Good luck with this game, made me swearing more than ds, and that's why a love it!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really one for 2D games or side scrolling games in general but this game is pretty cool; the controls are fairly tight, the combat is slow and requires a bit of planning/adaptability. Each of my deaths has been pretty clearly my bad. &gt;&gt;Some advice here,  those three dodge types you have actually have intended use, play with them and find out. Level design is pretty decent thus far, twisting and interconnected, they really do utilize the 2.5D space well, imo.   Pros: -level design is pretty decent, you'll get lost if you don't have the map or at least a good sense of direction. --plenty of shortcuts too, especially to bosses. -combat is solid, with three dodge types and a variety of weapons and armor it's hard to complain -Art style, personally, looks pretty nice, and I'm loving the Egyptian setting, so very refreshing to see. --Badass ladies, you can be one, and you'll fight some, it's great.  -Animations are very smooth along with the framerate (even on older hardware here, 700 series GPU) -Combat, again, is really slow, but it is built around that, you don't just move slower, everyone does. This allows for a good variety of style in combat, allowing the player to dodge around, block, poke, use magic, etc and feel confident that you can balance the situation. It is fairly easy to get overwhelmed when panicked, and the damage from many enemies is not forgiving, but with movement speed and all the options the player has it is quite fair, imo.  Cons: -some enemy hitboxes on their weapons seem to start very early in the attack, now that makes sense since an ax is always an ax, but this can make it easy to get caught in multiple strikes when dodging through enemies. Now that isn't terrible, it can be an absolute nightmare in boss fights. Again, this can be countered with spacing and using the other dodge mechs, but never the less it felt important to mention.  -I'll add more when I find them, but so far that's it.    Overall, I'd say it's pretty solid. I'd say it's like a 2D Dark Souls except this actually feels significantly better than the latest titles, for me, so I'll say instead that it is a really solid 2.5D hack and slash, with excellent animation, combat, and beautiful dodge mechs.   If you like 2D give it a shot, if you liked Salt and Sanct this will feel slower, but probably a bit more polished, at least to me. Finally, if you like souls like combat but just aren't feeling the latest titles from FROM this is definitely a good buy.  So far, I highly recommend this game. Of course, check some vids, maybe take advantage of the refund option to give it a shot yourself. It's nice.   One thing I'd like to add is that this game feels incredibly fair. If the devs for some reason read this one review in particular, you did the difficulty RIGHT in this game. If you make more titles like this, don't get lost in the 'hard as hell' mentality, with hpyer aggressive enemies or annoyingly high enemy damage, fair and balanced is on display here and it is so incredibly refreshing to see and feel again.",
            "review_score": "1"
        },
        {
            "review_text": "If Darksouls was a 2.5D game based in Egypt this is it. Chellenging game but never unfairly so. While you'll die a lot at least you'll know it was entirely your fault, whether you miss timed a parry or tried to rush through enemies only to get punished.  Would definitely recommend the game especially with it priced so well.",
            "review_score": "1"
        },
        {
            "review_text": "  I also did an impressions live stream of this which has a VoD on YouTube:         YouTube™ Video:  Pharaonic (PC, Mac, Linux, PS4, Xbox One) - PXA Peeks Livestravaganza&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to enjoy this game so much. but no.  Cons: 1. No sense of progress. Even at end-game you will still be cursing at the screen. When you get a weapon that's twice as good, your new enemies will be four times more powerful. And that's how it goes, for the whole game.  2. This game puts you in way too much stress to be enjoyable.  3. Because of the above, you never get a sense of flow or mastery. Only endless grind.   Pros: 1. It's pretty 2. Graphic design is wonderful: levels, wearables, weapons.",
            "review_score": "-1"
        }
    ]
}