{
    "app_id": 386280,
    "name": "Vendetta - Curse of Raven's Cry",
    "release_date": "2015-11-20",
    "developer": [
        "Reality Pump Studios"
    ],
    "publisher": [
        "TopWare Interactive",
        "ACE"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Indie",
        "RPG"
    ],
    "achievements": 58,
    "positive_ratings": 130,
    "negative_ratings": 125,
    "price": 26.99,
    "description": "Vendetta: Curse of Raven’s Cry is a third person, open world action-RPG that combines fast-paced swordplay with thrilling naval battles and exploration. Assume the role of dread pirate Christopher Raven and take your revenge on Captain Neville Scranton and the men who killed your family.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/386280/header.jpg?t=1489337492",
    "minimum_requirements": "OS: Windows Vista / 7 / 8 / 8.1 / 10 Processor: Intel / AMD Dual Core CPU @ 2.0 GHz Memory: 4 GB RAM Graphics: Geforce GTX 460 / AMD Radeon HD 5000 Series @ 1 GB DirectX: Version 11 Network: Broadband Internet connection Storage: 18 GB available space Sound Card: required Additional Notes: Keyboard, Mouse",
    "recommended_requirements": "OS: Windows Vista / 7 / 8 / 8.1 / 10 Processor: Intel / AMD Quad Core CPU @ 2.0 GHz Memory: 8 GB RAM Graphics: Geforce GTX 670 / AMD Radeon R 9 @ 2 GB or better DirectX: Version 11 Network: Broadband Internet connection Storage: 20 GB available space Sound Card: with 5.1 support Additional Notes: Keyboard, Mouse, Optional: Controller",
    "reviews": [
        {
            "review_text": "not nearly as bad as everyone makes it out to be. it's just full of prime eastern european jank and hilariously inept writing that *adds* to the game. two worlds ii is still far funnier (and better), though.",
            "review_score": "1"
        },
        {
            "review_text": "Really good pirate game, sometimes reminds me of Two Worlds, but is quite different, actually. I really like its dark, pirate climate, cheesy humour and open, realistic world. Sea battles can be fun and so is sword fighting - could be a bit rough, to be honest, but once you get used to it - it works fine with me (although fighting with animals or larger group of attackers can be quite challenging).",
            "review_score": "1"
        },
        {
            "review_text": "Shiver me timbers ! Finaly a cool pirate themed game. If you are into pirates then I believe it is safe to say you will enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Decent story, good naval combat, economy and trading system is well crafted. The melee combat is slightly sluggish and unresponsive, but can be enjoyable. The best part is the exploration, the game has some interesting Islands that you can freely explore and find hidden treasures. The graphics are moody and athomspherical with a good shadow and lighting system. The game can look really good in the sunlight.",
            "review_score": "1"
        },
        {
            "review_text": "Watch and see for yourself.          YouTube™ Video:  Vendetta - Curse of Raven's Cry .....Again. Bugs, Glitches and gameplay.&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "It looks like a brilliant game but it's such a shame I paid £35 for it not to get past the loading screen :(",
            "review_score": "-1"
        },
        {
            "review_text": "not quite recomended. it crashes so often to the desktop. and acording to the Devis its not a important issue to fix.",
            "review_score": "-1"
        },
        {
            "review_text": "So game is back in the steam store (again). Will there be any patch's to fix the games issue's?  Right now i cannot recommend the game till issue's are fixed. But i will re-review once thats done, but its highly doubtful as last i heard the ppl that made the game went into administration.",
            "review_score": "-1"
        }
    ]
}