{
    "app_id": 386330,
    "name": "HoD: On open seas",
    "release_date": "2015-07-20",
    "developer": [
        "HJO Creations"
    ],
    "publisher": [
        "HJO Creations"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Strategy"
    ],
    "achievements": 20,
    "positive_ratings": 3,
    "negative_ratings": 15,
    "price": 0.79,
    "description": "We will release two things 24th of December. One is an update, the other one is a new game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/386330/header.jpg?t=1481646107",
    "minimum_requirements": "OS: Windows 7 Processor: 1.8 GHz Processor Memory: 4 GB RAM Graphics: DirectX 9 compatible 3D graphics card DirectX: Version 9.0 Network: Broadband Internet connection Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 8/Windows 10 Processor: 2.4 GHz Processor Memory: 6 GB RAM Graphics: DirectX 9 compatible 3D graphics card DirectX: Version 10 Network: Broadband Internet connection Storage: 15 GB available space",
    "reviews": [
        {
            "review_text": "Back in the day I used to have this demo disc for my Playstation, I think I got it with a Playstation Magazine or something. On one of the discs was a game titld 'Overboard', which was a funny little platform game about a (pirate?) ship. I really liked the game and I wanted to buy the game but I was very young and simply did not have the money.  You've probably guessed it 'Hands On Deck' is heavily inspired by 'Overboard', in fact it almost looks like the exact game but sadly it's simply not as great (yet), which would be OK if the game was still in Early Access, which it's not apparently.  Hands On Deck's graphics do look a bit smoother than the classic game but aside from that 'Overboard' had a lot more details.  Overboard was a pretty fast game but 'Hands On Deck' seems to take a much slower approach making it less fun to play. Also, one of the most fun parts about the original game was the fact you could lose your 'pirates' in the water after you had been hit and you could pick them up again before they would drown. Hands On Deck seems to have removed that feature so all you got left is a barebone version of the classic 'Overboard', which is a shame because it could have been much more.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I managed to play the first level of this game. When I walked to the doorway to go to the next area, I received the message 'Unfortunately, this is how far you'll get for now.. However, you are now a part of something that we believe in and we won't stop until this game has reached it's full potential. We are going to release a new chapter every Sunday'. I've owned this game for sometime but just barely got around to playing it. Are they in the process of updating it? Apparently, it was so bad that they are re-releasing it under a different title...I'm not quite sure. I guess I'll have to see what happens next but so far, I would not spend any money on this game.",
            "review_score": "-1"
        }
    ]
}