{
    "app_id": 386490,
    "name": "Wanda - A Beautiful Apocalypse",
    "release_date": "2016-06-03",
    "developer": [
        "Kodots Games"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 12,
    "positive_ratings": 95,
    "negative_ratings": 60,
    "price": 1.69,
    "description": "Wanda is a minimalist story-rich puzzle about two robotic lifeforms finding happiness, companionship and hope in a lonely post-apocalyptic world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/386490/header.jpg?t=1512310381",
    "minimum_requirements": "OS: Windows XP/Vista/7/10 Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 512 MB RAM Storage: 400 MB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wanda is a wonderful game.Fantastic Storytelling,guiding the player through the world of Wanda!This is probably the sadest and most heart-warming game i have ever play! The story is personally amazing &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "  Wanda - is a beatiful game minimalist story-rich puzzle about two robotic. Wanda is a short and simple story about two lonely robots in a desolate, ruined world. Unlike many other 'end-of-the-world' games, Wanda is not about a tale of desperate survival but about finding companionship, love and hope in a wasteland.  Good graphics,nice sound,very good puzzle. Nice game,really. I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "you roam around time to time solving puzzles. game features some 'future' language, you cannot understand it, so the only thing game can help you with is just small icons from time to time. however, i did not find the correlation between the icons and the tasks or puzzles. Interesting graphics, great soundtrack, but the games seems to be overpriced. Can recommend for someone looking for new experiences in gaming, and for experiments in games",
            "review_score": "1"
        }
    ]
}