{
    "app_id": 386420,
    "name": "Job the Leprechaun",
    "release_date": "2015-07-31",
    "developer": [
        "Herrero Games"
    ],
    "publisher": [
        "Herrero Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Platformer"
    ],
    "achievements": 3,
    "positive_ratings": 130,
    "negative_ratings": 30,
    "price": 2.09,
    "description": "Help Job the Leprechaun to rescue his friend Eri in this retro style Platformer Game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/386420/header.jpg?t=1546333420",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core 2 Duo Memory: 512 MB RAM DirectX: Version 8.0 Storage: 10 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you get it from a bundle, and you'd like to have ~ 1-1.5 hours of casual platforming in retro style, go for it. Don't mind this review if you're intrested in gameplay-releated review, as it's okay.  But I'm not willing to rate this game positive. Hit detection is indeedwonky - I've got killed by shots what was going above my hat, while I killed zombie-dogs (?) who was basically *inside* me and still survived.  But my main gripe is game design. Level design is okay, most levels can be easily completed within the time limit - but game design.  -There's no way to exit the game unless you start a game - no escape option in menu, and neither escape button works.  -The game's controls are simple (4 directons+jump+hit) but one can not rebind the buttons. And while X-Y is a common pick for the old A B buttons, my qwertz keyboard begs to differ that this is the best available option. Yes, I know I can change it to english with shift-alt as I've done it, but still - non-rebindable controls should be forbidden in 2015.",
            "review_score": "-1"
        },
        {
            "review_text": "Great little platformer. Looks good and sounds good. I just wish it didn't make you start all the way back at the beginning of the game when you run out of continues.",
            "review_score": "1"
        }
    ]
}