{
    "app_id": 386700,
    "name": "The Oil Blue: Steam Legacy Edition",
    "release_date": "2015-08-06",
    "developer": [
        "Vertigo Gaming Inc."
    ],
    "publisher": [
        "Vertigo Gaming Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Indie"
    ],
    "achievements": 31,
    "positive_ratings": 107,
    "negative_ratings": 43,
    "price": 3.99,
    "description": "It is the future, and the world is in grave need of oil. You and a crew have set off into the ocean, reclaiming old island drilling sites for oil production as you work for the UOO, the biggest oil supplier in the world. The working conditions are dire. You have no choice.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/386700/header.jpg?t=1447377063",
    "minimum_requirements": "OS: Windows XP or Higher Memory: 500 MB RAM Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pretty interesting. You get up to 4 different types of oil drilling machines each with their own way to micromanage. Using them in certain ways increases 'temporary damage' and if you dont mitigate it, it does 'permanent' damage which can be repaired only once per day. The hard part? You have up to 4 different types but so far I've gotten up to 7 total slots. Trying to micromanage the drilling and damage mitigation on that many is stupidly hard. The amount of oil you need goes up as well.  10/10 Oil storage is full",
            "review_score": "1"
        },
        {
            "review_text": "They have managed to make a game that relaxes you yet raises the blood preasure a bit trying to complete the goals on time.",
            "review_score": "1"
        },
        {
            "review_text": "The Oil Blue is definatly a good game. Anyone who has played Vertigo Games' Cook Serve Delicious will be instantly familiar with the formula in The Oil Blue.   You are an oil surveyer for the UOO, and your task is to reclaim islands in the Pacific Ocean for further oil drilling. You do this by employing a variety of machines like the groundwells and oil derricks. In total there are only four different machines but each one has a unique interface to interact with, and all of them pump oil differently. Some machines require more attention than others and it's your job to balance your time and attention spent on them.  It is this element that makes this game instantatly feel familiar to anyone who has played Cook Serve Delicious, the frantic minigame centric styled gameplay.   The Oil Blue has many positive aspects such as the soundtrack, the art, the strange feeling of isolation drilling on these lonely rocks of land, and the wonderful sounds the machines make. In terms of gameplay The Oil Blue will certaintly offer a challenge to new players, as you frantically try and micro-manage your various machines to pump enough oil to reach your quota within a given deadline. The Oil Blue offers a perfect feeling of stress to meet a deadline, all while you cant help but enjoy yourself as you press away at glowing buttons to pump more oil.   The Oil Blue does however have some less than stellar aspects that need addressing. For starters there are no resolution options, no rebindable keys, and very limited audio options. The repair minigames are also not very impressive, as your machines drill they incure stress that needs to be repaired, so it happens often and there are only a handfull of minigames that you will play a lot of. So you quickly come to master these minigames and they will quickly offer no enjoyment or challenge, and will just feel like a waste of time. Thankfully as you rank up in the game you can auto-repair your machines for five thousand in game dollars, which allows you to bypass minigames you dont enjoy. I also personally found the game a little too easy, as within a few hours I had unlocked all machines, all seven slots for machines, oil rigs, and before I knew it I was a multi-millionaire sitting at rank 5. So if you are skilled and get the hang of the game it becomes very short as there becomes very little to unlock past getting all the machines and all seven slots for your machines. I still enjoyed the time spent getting there, regardless of how short it felt, I just wished the progression had more things to unlock.  Overall I would still recommend this game to anyone that wants a quick gaming experience, for it can be very easy to pick up and play for short sessions, offers a good frantic challenge, is inexpensive, and will run on pretty much anything. Given everything I've said I would definatly recommend The Oil Blue.",
            "review_score": "1"
        },
        {
            "review_text": "When I first started playing the tutorial it looked like a game that might be right up my alley. Create or harvest something, sell that something, then find better ways of getting that something to grow your fortune. Fun! But at the end of the tutorial I ran up against the fix-the-machines mini-games. While the gathering and selling part of the game was clearly explained, the instructions for the mini-games were short and not especially helpfull. I was mashing the buttons the sparse instructions indicated, with no clue of what I was trying to accomplish. I tried a few strategies with no luck, and after a few minutes just quit out of frustration. Since these mini-games are an unskippable part of the tutorial, it meant that the game was over for me.    I bought this game hoping it was an economic sim, which at it's heart is what it seems to be. But the under explained repair mini-games simply ruined the experience for me. With some sadness I asked for a refund. It's a shame too, since I think this problem could be fixed easily by simply making the mini-games skippable, or at least explain what the heck the player is expect to do exactly.  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "The game is pretty simple: Drill for oil and sell em in a limited time. But man, if DS would be a simulator this would be it. It all starts nice and easy until the game is going to be total duche: 1. Island: 8 barrels of oil? Pff I can handle this 2. Island: 50 barrels? Sure. Nice and steady 3. Island: Are you kidding me? 168 barrels??? ... 6. Island: FML  But still, I love it, every new Isalnd is random generated (not the look, but the loadout of every Island + it i open ended)  Graphic: The artwork is just a delicious meal for the eye but the resolution is kinda small. 7/10 (would have been 10/10 but meh, the resolution..)  Sound: It's pretty good and realistic 8/10  Gameplay: I love it. It's hard but it is just fun 9/10  All in All I give it 8/10",
            "review_score": "1"
        },
        {
            "review_text": "The key to making a good time managment game is giving the player the information necessary to correctly split their time between tasks. The Oil Blue does not do this. Simply giving the player a blinking light for a second indicating that something is going to need to be done in a few seconds isn't enough when transitions take time. Clunky transitions between menus for selling, repairing and drilling are annoying as well. Many of the minigames are also very frustrating, in particular the repairing minigames are horrible.   Worse than that, the dev says he's lost the source code to the game. As a result, you have the option of playing a blurry, pixelated game, or a tiny windowed game. In short, avoid The Oil Blue, and spend your money on something else.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good game however I cannot have the correct resolution and the achievement is broken...  thats why its cheap. The person who made that game were just rushing through to make profits.",
            "review_score": "-1"
        },
        {
            "review_text": "Easily worth $5, but picked this one up for a dollar on sale.  Usually the fairly simple, calming games are boring after a few hours, but I'm still engaged so far.  You can sit and just listen to the music for a while, or go full throttle and make hundreds of barrels of oil a day.  Honestly is really nice for relaxing after a long day of work or school.   Do yourself a favor and get drilling.  Edit: Found the alternate soundtrack, which I love to bits. Even more points from me.",
            "review_score": "1"
        },
        {
            "review_text": "I'm adoring this game.  Like several people, I ended up discovering Oil Blue after having a ton of fun with Cook, Serve, Delicious. I wanted to know what else the developer had to offer. Back then, however, I couldn't seem to find a copy anywhere. Was so thrilled when I saw it was on Steam (and for a pittance).  If you like 'Cook, Serve, Delicious', 'Papers, Please', or other types of timed management games, you'll love this. There's more to it than that, though.  Cook, Serve, Delicious has a very light atmosphere - Oil Blue does not. For those who were hoping for something a bit darker (literally and figuratively), you'll find it here. There's something lonely and a little eerie about starting your drilling process at the start of the night, suberging yourself to push huge drilling machines into motion, only to resurface when you need to sell your drilled oil or to fix a machine.  The game is as engaging as it is entertaining, but you'll come for the gameplay and stay for the atmosphere.  I desperately hope Vertigo Gaming does another pensive title like The Oil Blue!",
            "review_score": "1"
        },
        {
            "review_text": "I'm adoring this game.  Like several people, I ended up discovering Oil Blue after having a ton of fun with Cook, Serve, Delicious. I wanted to know what else the developer had to offer. Back then, however, I couldn't seem to find a copy anywhere. Was so thrilled when I saw it was on Steam (and for a pittance).  If you like 'Cook, Serve, Delicious', 'Papers, Please', or other types of timed management games, you'll love this. There's more to it than that, though.  Cook, Serve, Delicious has a very light atmosphere - Oil Blue does not. For those who were hoping for something a bit darker (literally and figuratively), you'll find it here. There's something lonely and a little eerie about starting your drilling process at the start of the night, suberging yourself to push huge drilling machines into motion, only to resurface when you need to sell your drilled oil or to fix a machine.  The game is as engaging as it is entertaining, but you'll come for the gameplay and stay for the atmosphere.  I desperately hope Vertigo Gaming does another pensive title like The Oil Blue!",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best casual micro-management game I've played in a very long time! Super addicting and perfect for idly playing in the background while doing other stuff",
            "review_score": "1"
        },
        {
            "review_text": " A Paladin’s Steam Review: The Oil Blue. Intensive Drilling Micromanagement That Requires Almost as Much Work as the Real Thing.",
            "review_score": "1"
        }
    ]
}