{
    "app_id": 386870,
    "name": "Playing History 2 - Slave Trade",
    "release_date": "2015-08-27",
    "developer": [
        "Serious Games Interactive"
    ],
    "publisher": [
        "Serious Games Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 8,
    "positive_ratings": 64,
    "negative_ratings": 41,
    "price": 3.99,
    "description": "Travel back in time and witness the horrors of slave trade firsthand. You will be working as young slave steward on a ship crossing the Atlantic. You are to serve the captain and be his eyes and ears. What do you do, when you realize that your own sister has been captured by the slave traders?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/386870/header.jpg?t=1447377071",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core 2 Duo Memory: 1 GB RAM Graphics: Intel Graphics / 512MB VRAM Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Just like the good old days!",
            "review_score": "1"
        },
        {
            "review_text": "it's ok",
            "review_score": "1"
        },
        {
            "review_text": "Dark theme but well realized and good education",
            "review_score": "1"
        },
        {
            "review_text": "  I bargained with a village chief to buy as many slaves as I could, I dumped 25 of them into the ocean, I told one of the slaves that it's OK to commit suicide and I got the platinum rank at the end.   Slave trade was never so satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "The uproar over this game is obscence. To realize that so many people are ignorant of what made their 21 fist century life possible, well there isn't much hope for humankind.",
            "review_score": "1"
        },
        {
            "review_text": "As a nig, I felt it was my responsibility to review this game. I was really reconnected with my ancestors, especially when playing the mini-game “Slave Boat Tetris.” Seeing the “Half Off Negro Slave” posters really reminded me of my childhood and moved me to tears.  On first start up the game crashed instantly, I felt as if the game knew I was black and was trying to protect itself.  Slave Trade.exe has stopped working ",
            "review_score": "1"
        }
    ]
}