{
    "app_id": 38700,
    "name": "Toki Tori",
    "release_date": "2010-01-28",
    "developer": [
        "Two Tribes"
    ],
    "publisher": [
        "Two Tribes Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Casual"
    ],
    "achievements": 38,
    "positive_ratings": 1660,
    "negative_ratings": 226,
    "price": 3.99,
    "description": "The gameplay in Toki Tori is a blend of two genres. While it looks like a platform game, it's a puzzle game at heart. To progress through the game, the player must pick up each egg in a level using a set number of tools.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/38700/header.jpg?t=1488471030",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: Intel Pentium 4 / AMD Athlon XP 1.5 Ghz or higher Memory: 1 GB RAM (Vista) 512mb (XP) or more Graphics: DirectX 9 compatible, 128MB VRAM DirectX®: DirectX 9.0c Hard Drive: 200 MB of free space Controller: Microsoft Xbox 360 controller or compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Some levels are locked until you join the developers Steam group, even though you bought the game. If it was free I could understand, but given that you have to pay for it and they still lock you out of content...",
            "review_score": "-1"
        },
        {
            "review_text": "What can be better than a little chicken looking for eggs? ;) 'Toki Tori' is really entertaining, positive and cute. It mixes elements of specific platform game and logical thinking. Graphic is colourful and completely happy, I must say. This game is perfect both for children and for adults who want to solve some puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Toki Tori is a great platformer puzzle game. Visuals are cute, but don't be decieved by it's childish look, this is by no means an easy game, as things get challenging after the first few levels. However, what I really admire about this game is that challenging doesn't equal frustrating, which in my opinion is a rare quality in this genre. Even if you buy this game for the full price, it's still well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "u need brain to play  ",
            "review_score": "1"
        },
        {
            "review_text": "Cute puzzle game ^^ Have many many bonus level and it's hard",
            "review_score": "1"
        },
        {
            "review_text": "Tricky puzzler that manages to stay away from becoming frustrating. Very clever level design makes sure you know pretty much what you need to do while leaving you to figure out exactly how to do it. For those who really want to get their cogs whirring there's also a full set of optional Hard levels, though it's recommended to finish the main game first as they often require devious strategies that won't be immediately obvious without a good knowledge of how the game works. Very attractive presentation and catchy music round this off into a great package.",
            "review_score": "1"
        },
        {
            "review_text": "A cutesy but really quite hard puzzler. If you're liable to be frustrated then probably don't buy this. As a a fan of puzzle games I grabbed it on release ($5 and a demo, why wouldn't I?) I try not to look at walkthroughs or give up at all, really, so this game has lasted me a while.  I'm still on the last world and just about done with that. As this one's a straight up puzzler ♥♥♥ platformer you're given a set of tools to get around the level and collect all the eggs witihin. You can avoid enemies (or use them to your advantage), teleport, make bridges, make cubes, shoot a gun and more. Each world is varied enough and introduces a new enemy type.  Plenty of content with about 40 normal levels, about 25 hard and a few bonus levels. I'm not sure that I'll really try out everything but I thought this was a great little game, especially as it was so cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Toki Tori is a rare game. It gets my entire family involved despite its single player puzzler gameplay. My son can lend a hand just as fast as my wife can. Everyone I have ever shown it to cannot help but make suggestions and get involved. Great game. Cannot wait for TT2 (especially on Wii U)!",
            "review_score": "1"
        },
        {
            "review_text": "Like bird butts? Make your little fella jump and climb up things, and die in frustration time after time. Good puzzler with adorable bird thing. (that will shoot b!tches) Quack, squeak, sqwack, warms my heart right up.",
            "review_score": "1"
        },
        {
            "review_text": "Toki Tori is a 2D puzzle game that might look like a game parents would give their 10yo children to play, but don't be fooled by the looks of this game. As cute and adorable as the tiny chicken called Toki might be, as challenging are the puzzles and as tricky are the techniques that are required to beat the levels the further you progress through the game.  Each level comes with a predefined and limited set of equipment that you're allowed to use. Your goal is to use the equipment wisely to move around the level and collect all present eggs. This sounds easier than it is!  Toki Tori features more than 80 levels across 5 different worlds (including a Portal themed world!), each divided by normal, hard and bonus levels, so there is plenty stuff to do and once you are done you can go on and create your very own custom levels with the included and easy-to-use level designer.  If you enjoy puzzle games you will love Toki Tori as it will keep you pondering for many many hours. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Cool little puzzle platform 2D thing, not as easy as it looks at first glance.  You play a bird that collects eggs, the game eases you into it very slowly and the first normal levels are just walking through the level. But it gets harder, ALOT harder and some of these puzzles take several tries and retries an back and forth. It has many hours of fun though if you like this type of game.",
            "review_score": "1"
        },
        {
            "review_text": "A very sad story of a duck, named Tori, that has lost it's eggs. The game is very heart warming especially with the great graphics, even better than the Frostbite engine used in the battlefield series. Overall, I rate the game 98.5/100.",
            "review_score": "1"
        },
        {
            "review_text": "A decent puzzle game that ♥♥♥♥♥♥ me off dramatically when it decided to lock content from me unless I joined their Steam group. Not a deal-breaker on its own, but when you claim that those levels are only for those who 'support the developers' by doing so AFTER I PAID FOR YOUR GAME, you can eat a ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Yellow Birds. Sadistic game. Like it.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game. Brings back memories of Eggbert on the MSX II nice remake of the game with cool graphics and music. Also difficult puzzles which you don't just complete without thinking hard",
            "review_score": "1"
        },
        {
            "review_text": "I cant beat the first level. 11/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Game for chill :D  It is nothing special, so dont judge it too fast.   Music is relaxing :3  It is logic game, so not only pwn pwn, but hmm hmm.  It is awesome so far ! :D  7.6/10",
            "review_score": "1"
        },
        {
            "review_text": "It's great!",
            "review_score": "1"
        },
        {
            "review_text": "Chicken cannibal simulator 2014 12/10 would eat again",
            "review_score": "1"
        },
        {
            "review_text": "shoes/10 best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Its okay game , in late levels its pretty logical and difficult so you must watch walkthroughs on YT over and over again.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Capndrake was all over this game like white on rice, so he forced me to get it via manipulative paypal shenanigans!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. It's a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "10 / 10 - 'Best 0.30 cents game i ever played'",
            "review_score": "1"
        },
        {
            "review_text": "Toki Tori is one of the best puzzle platformers i have played so far. It looks good, controls are intuitive, and not in the least: the puzzles become very challenging in the late game. Everyone who likes puzzle platformers should give this game a try. Totally recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Good for children and for grown ups, altough it has kid like scenarios.  Good for mind cracking",
            "review_score": "1"
        },
        {
            "review_text": "Good logic platformer, if you like BRAID, go for this one.",
            "review_score": "1"
        },
        {
            "review_text": "Nah... I don't know ...",
            "review_score": "1"
        },
        {
            "review_text": "Is it supposed to be for kids? Are you sure???",
            "review_score": "1"
        },
        {
            "review_text": "★ ★ ☆ ☆ ☆",
            "review_score": "1"
        },
        {
            "review_text": "is an adventure game that offers rewards after each level passed.",
            "review_score": "1"
        },
        {
            "review_text": "How the ♥♥♥♥ did this even end up in my library",
            "review_score": "-1"
        },
        {
            "review_text": "It's okay I can't personally get into it myself. It feels to childish for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Toki tori i swear you should buy this game! This is the best game out in FPS Better than ANY COD GAME no joke 10/10 aiming is sooo good i had to go to the doctor 5 times of how awesome it is! I killed like 5665 faze fanboys and destroyed em good i swear buy it 10/10 Best fps out there - Ign",
            "review_score": "1"
        },
        {
            "review_text": "Bought on sale for 50 cents Basically a kids game, buy it for your younger kids or siblings.",
            "review_score": "-1"
        },
        {
            "review_text": "The most mindless puzzle game I've ever seen, this game annoyed me to no end",
            "review_score": "-1"
        },
        {
            "review_text": "This game is too easy",
            "review_score": "-1"
        },
        {
            "review_text": "damn good puzzling game. Atm costs 2,25 bucks. Money damn well spent",
            "review_score": "1"
        },
        {
            "review_text": "a nice, pleasantly and naive looking game, that will make your mind crash after few hrs",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun and difficult!",
            "review_score": "1"
        },
        {
            "review_text": "Good simple neat game, 7/10 not too good not too bad :)",
            "review_score": "1"
        },
        {
            "review_text": "it was a awseome game",
            "review_score": "1"
        },
        {
            "review_text": "Cute charactors, good for everyone that love puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Toki Tori is so cute!! =D The puzzles aren't actually easy. Requires a lot of thinking and trial &amp; error. Thank God for the REwind function.",
            "review_score": "1"
        },
        {
            "review_text": "it's a fun game to play, i will recommend it ^^",
            "review_score": "1"
        },
        {
            "review_text": "A big misconception I had about Toki Tori was that it was a 'kids game'; that an adult wouldn't be able to enjoy it fully, and that your hand would be held through the entire game.  Toki Tori is not one of those games.  The game starts out pretty straightforward, but gets more and more complex as you get further. In total, there's 5 different playstyles, broken up between 5 'worlds'. There is a mild story, but it's used to answer 'what is going on', without answering 'why is it happening', and investing too much time into it. The story is considered done after the 4th world.  There is additional things to do beyond the story, and you can expect to invest at least 8 hours into the game, including all hard levels, bonus levels, and achievements. Players who are purists against guides (this is a puzzle game afterall) can probably expect to invest closer to double the time.  Everything in this game is attainable and completable, whether you're an expert at puzzle games, or a newbie. There are no hints or tips, so your only other option than solving a puzzle on your own is to look up a video guide.  Overall, solid game. Family friendly, but still offers complexity to older players.",
            "review_score": "1"
        },
        {
            "review_text": "A great little puzzeler. Also great if you have kids. The puzzels can be challenging but some are really simple. It has got bright graphics. It runs smooth even on bad computers.  ",
            "review_score": "1"
        },
        {
            "review_text": "Worst game I ever played in my life.. I wish I could get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pretty fun puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously one of the best puzzle games I've played in a while, you should consider buying it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good gaming experience.",
            "review_score": "1"
        },
        {
            "review_text": "Rip $0.70",
            "review_score": "-1"
        },
        {
            "review_text": "★★★★★★★★☆☆ 8/10 Very good platform game for kids and adults",
            "review_score": "1"
        },
        {
            "review_text": "Fun addicting little puzzle game where you guide a bird into death.",
            "review_score": "1"
        },
        {
            "review_text": "Very simple puzzle platformer. But that doesn't make it easy!",
            "review_score": "1"
        },
        {
            "review_text": "For such an innocence looking game, Toki Tori is cruelly challenging. Yes, I like playing puzzle games, but Toki Tori’s sense of challenge just goes from mild to infuriating hard. I really do like everything Toki Tori has to offer, and despite looking like an incredibly easy kiddie game it turns into one of the hardest challenging puzzle games around, and that alone is impressive. It really is a hidden gem amongst puzzle games, and one that would challenge anybody that thinks they’re clever.  The game is simple enough; Toki Tori needs to collect all the eggs in order to proceed to the next level. Toki can use a number of gadgets to get all these eggs, but usually there is a limited amount of uses on each item. These gadgets tend to range from simply building a ladder to arming an ice bazooka. The main objective is then to find a way to optimize all your items so you can collect all the eggs, and in lies the sneaky cleverness of Toki Tori. Toki Tori has a tricky twist on how you might simply try to get one egg only to not have enough resources to get the next one. More often than not, Toki Tori’s tricks you enough that it can really be trying on any player, and even with the ability to skip a level in a world it gets to the point of aggravation. Toki Tori can just spike in difficult so easily that in one moment you are getting puzzles done left and right, then in the next you don’t even know how to string two eggs together. You could spend an hour on just one puzzle and still not solve it. The game can often get stuck in your head just wondering how you can make it work, only to realize that you were completely doing the wrong approach. And all this could really just be avoid if the game gave you some clue on how to get the eggs. Whether the hint be which order to get the eggs or how to just get one of the eggs, any kind of hint system would have made such a hard puzzle game become a bit more bearable. But don’t let the games hard difficulty fool you that it has nothing else to offer, because after you solve all the regular puzzles harder puzzles are unlocked. Making Toki Tori last far longer with even more challenging puzzles then the ones in the main game. So needless to say, Toki Tori will have you scratching your head for quite some time. But for what it’s worth, it’s quite a wonderful mountain of a game to conquer, even if it looks and plays cute music while you’re doing it.  Final Thoughts:  Toki Tori is really a surprising gem of a game, and one that holds the phrase, “don’t judge a book by its cover” quite well. Although it may look cute, this game can be quite cruel with nearly each puzzle requiring all your resources of weaponry and tools, leaving little room for error, meaning this game will challenge anyone’s wit when it comes to solving puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Ever played Resident Evil? Well this game is for you then . . . full of puzzles and blood. You play as Toki Tori a new deputy for the Tobi Police Department only to discover that a terrible incident occurred on Tobi City. All the citizens are either dead or turned into Racoons . . . so pump your guns and get ready to blast those Racoons back to where they belong . . . .  A second one is now available but you have to wait for the third one before you can play it.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle game that feels like it was made 20 years ago. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "Simple platformer. 5/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun, but challenging little puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "A cute and colorful platform puzzler that's surprisingly challenging.",
            "review_score": "1"
        },
        {
            "review_text": "To a casual observer this game may look rather simple and boring, however, that is not the case. Toki Tori is one of the funnests most addicting puzzle games I have ever played. It is similar in some aspects to other great puzzle games such as cogs, portal and braid as it contains many of their aspects. In some ways Toki Tori is also similar to chess as you have to think a few moves ahead to solve the puzzles. The ability to rewind back time so you don't have to start from scratch is a nice bonus, very similar to that in braid and makes the puzzles much less stressful and more fun to solve. There is not much story line to it, apart from you travelling the different worlds to collect eggs for a massive omelet at the end of the game. All in all, Toki Tori is a rather relaxed game which even lets you skip a level if you found it too hard at the time. I highly recommend this game to anyone who likes puzzles games as much as me and would like to see a cute comical chicken collect eggs ^_^",
            "review_score": "1"
        },
        {
            "review_text": "I was quite surprised with this game, 'tis a delightful puzzle experience.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not crazy about this game, probably won't play it again after getting the summer achivement. I've played lemmings types games and enjoyed them, but I dunno this just never clicked with me. Watch trailer, that will tell you if you will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Oh hell, son! You got to play Toki Tori! A baby chicken solving puzzles like a CHAMP! I told my friend Charles about this game and he said, 'sounds like a game for babies.' WHAT?!? I just stared at him for a second in disbelief before I kicked him in the solar plexus, put him in a headlock, and then I bulldog'd him into floor. He was on the ground writing and complaining about not being able to breathe or some garbage. I started yelling, 'YOU DON'T EVEN KNOW, CHARLES! YOU DON'T EVEN KNOW HOW GREAT A GAME IT IS!'",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the cutesy exterior fool you; this is a serious puzzle platformer. Toki Tori is a lot of fun, and a good challenge. I also recommend checking out the Game Boy Color original, as it is different enough to warrant playing both versions.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game..simple and effective..must download",
            "review_score": "1"
        },
        {
            "review_text": "5 Star puzzle game, it's strength lies in it's accessibilty. The theme is appealing to children but the content is absolutely complex enough to challenge an adult gamer. One of the main pitfalls in puzzle games is the difficulty curve, in my opinion, Toki Tori nails it and you find yourself gradually solving more complex problems without ever feeling completely lost (for too long). Next time its on sale, pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most enraging games I have ever played. Bought it on sale for 49 cents.   10/10 Would 49 cent rage again.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes you feel good and then shows you how dumb you really are causing you to question how you got here in life when you can't even figure out a simple puzzle game designed for kids.   11/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Really simple platform puzzler. The game is pretty fun with a nice cute background and setting. This is a little humor in the game which makes it a really light-hearted game. It is a game that is calm and simple to play. Anyone can pick it up and play.",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad of a game :)",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME IN THE WORLD. HOLY ♥♥♥♥ I'M JOKING, IT'S ♥♥♥♥ING AWESOME!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The best puzzle game I have ever played.  Don't get deceived by the chicken's silly look. This may look like a game for little kids, but, after the first easy levels, it isn't. The hard levels are very interesting. Don't ever look for a solution on the internet, and you'll feel a great satisfaction when you finish the game. No matter how hopeless the level seems, there is a proper, non-glitchy solution.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun",
            "review_score": "1"
        },
        {
            "review_text": "I played this game, I only did one thing. I had one ♥♥♥♥ing thing in mind and it gave me an acheivement for it. 10/10 5 stars A+ tennouta ten best game BESTGAME",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "great casual game. got in on steam sale for 0,39 but would recommend for the full price aswell. It gets difficult sometimes but collecting all the eggs is pretty satisfieing so its worth the hastle! :d",
            "review_score": "1"
        }
    ]
}