{
    "app_id": 387010,
    "name": "FIVE: Guardians of David",
    "release_date": "2015-11-24",
    "developer": [
        "Kingdom Games"
    ],
    "publisher": [
        "Kingdom Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Adventure"
    ],
    "achievements": 21,
    "positive_ratings": 104,
    "negative_ratings": 48,
    "price": 6.99,
    "description": "FIVE: Guardians of David is a Diablo-style action-RPG set in the ancient lands of Canaan. Lead and play the five heroes, battling across exotic locations filled with archaic cultures, rich characters, and powerful artifacts. Experience one of the greatest stories ever told in this 11-Act epic.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387010/header.jpg?t=1494954261",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core 2 Duo 2.0 GHz Memory: 4 GB RAM Graphics: DirectX 9.0c DirectX: Version 9.0c Storage: 4 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Yes, Yes this is an ARPG based on the Bible. I say 'based' as its clear when they invent a character or place. It doesn't preach, and doesn't require you to know the bible to enjoy this.    But Bible aside this game doesn't suffer for its Bible trappings. I'm a sucker for games that use any source material well and moreso when they enrich your own knowlage or lack thereof the materal in the game. Crusader Kings II has their wikipedia links when they use actual people and Five Guardians of David does as well by having Caches hidden throught the level to collect and with it comes a bit of directors commentary as to where you are sits in the bible or where they chose to embellish, even has the passage they took it from.    So now that I have said that the Bible setting of the game doesn't interfere with the game by being 'preachy' I have slain that 500 pound gorrila and can move on to the game itself.    Its an action rpg with the standards of a action bar that fills as you level up and a equipment that you earn to increase your stats with. Being paired up with other controlable npcs allows for you to have choices in how you want to fight such as be melee or ranged. It also helps the story along as your charcter doesnt talk alound to himself for exposition. This is the Bible so yes there is plenty of bossfights and they come with decent set pieces and a solid challenge. David can get stumped by Goliath.   Productionwise the game's artists and programmers must be commended for making a setting aproprate to the era. Good sound design and suprising voice work helps move a simple story. The music sets the mood and the games cinematics do a good job of setting the plot and location well.   My only complaints so far is the 'comic book cutscenes' could be handled better and be a better resolution. And AI partners love to ignore a beating you are taking if its more than 5 feet away, There is a few crashes when I mess with the shadow settings as well.   Overall if you want a fun arpg, moreso one thats set in the Bible, this stands alone but it stands strong.",
            "review_score": "1"
        },
        {
            "review_text": "Superb, biblical and cool at the same time",
            "review_score": "1"
        },
        {
            "review_text": "I am not a religious person. However, I have found a lot of enjoyment with this game.  It is not without its glitches... however, these are overcome with a bit a practise. The biggest one for me was when holding the SHIFT key down to remain rooted in place - it doesn't just keep you fixed to the spot, but it also fixes the direction. This made it more difficult at the start of playing. But as I said, you get used to this, and just release the SHIFT key when attacking a different enemy.  I saw other reviews that indicated that this game isn't very religious. I beg to differ in that regard. As you go through the game, you uncover rocks that provide information about the story. The majority of these also contain biblical references. Also, when switching characters, they have little speeches, one of which is a shout of 'FOR THE LORD!'.  If you can cope with all of the above, then give the game a try... and I hope you find enjoyment in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Casual ARPG with high production values. Unique historical setting that seems really well researched. You get some cool abilities and having 5 characters to choose from on the fly keeps things fresh. I'm not a big fan of the inventory management. Having to stop and sort through tons of items a few times per stage isn't something I enjoy but I guess that's kind of a staple of the genre. Still a bit buggy at times but the devs have fixed a lot with the first patches.",
            "review_score": "1"
        },
        {
            "review_text": "  Overall, it was a fun and enjoyable game. I still have yet to complete it, but so far many aspects of the game are well executed and the difficulty level is well balanced.  Likes: The soundtrack is amazing and well worth the purchase The artwork and dialogue are very well done and really draw you into the story line Great execution of linear gameplay with good combat mechanics Great story line and use of comic book style cutscenes Good amount of loot with varied statistics  Dislikes: Some of the narration dialogue felt very formal, more like a history lesson than an immersive narration",
            "review_score": "1"
        },
        {
            "review_text": "the game is a solid 7 out of 10 but there are significant bugs related to pathfinding and character death that need to be dealt with",
            "review_score": "1"
        },
        {
            "review_text": "It's not bad.....I mean it's probably the best Bible game you'll ever play it's just that there's free ARPGs that are better than this. The voice acting is good and the game is responsive but it's just a little too plain in combat. There's a lot of character variety but there's no real challenge because if you die you respawn at a checkpoint with the enemies not regaining any health, so you can just get hand held through all this Bible lore you, let's face it, probably won't care about. I feel like the game could have been better or cooler with a different setting by was held back by the Bible setting. There's a lot of times where the lore is legit, 'we made this character up, hardcore christians don't hate us'. Overall I'd give this game a 2.5/5. Make the kids in bible school play this xD",
            "review_score": "-1"
        },
        {
            "review_text": "Unity Engine. I've not found a single Unity game I've enjoyed yet. The battle system is quite tedious. Meaning you have to move ever so slightly if you want to keep your cursor on any enemy you want to select for a confrontation. You can and will find yourself running by them and turning around to go back to hit them repeatedly. Save function is not as accurate as it should be. Not anything like most are familiar with for instance Titan Quest. As far as authenticity with the Biblical narrative? No. Other than character names.",
            "review_score": "-1"
        }
    ]
}