{
    "app_id": 387070,
    "name": "One Final Breath™",
    "release_date": "2015-08-10",
    "developer": [
        "Dark Day Interactive"
    ],
    "publisher": [
        "Dark Day Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 8,
    "positive_ratings": 18,
    "negative_ratings": 86,
    "price": 2.79,
    "description": "Find your daughter in the halls of the abandoned St Mary’s Boarding School, which was once a hospital with a dark history. Play as the run down father who must overcome his issues and bring his child home in this episodic horror series.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387070/header.jpg?t=1447377088",
    "minimum_requirements": "OS: Windows 7 32bit, 64bit, Windows 8 Processor: Duel Core 2.1ghz or Higher Memory: 4 GB RAM Graphics: 1.3GB Graphics Card or Higher DirectX: Version 9.0 Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows 7 32bit, 64bit, Windows 8 Processor: Duel Core 2.6ghz or Higher Memory: 6 GB RAM Graphics: 2.0GB Graphics Card or Higher DirectX: Version 11 Network: Broadband Internet connection Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "Ugh, where to start. One Final Breath is another piece of Unity garbage that's labeled as 'horror' when in fact it's yet another key finding simulator.  You're an alcoholic father who's divorced because of your alcoholism and you have to go find your daughter. The story is basic and fairly typical in this day and age. You look for keys to unlock doors to get further into being able to find your daughter.  The controls are insanely clunky. Sometimes you have to be really spot on if you want to interact with something. Do you want to strafe while sprinting? Good luck with that. Do you want to sprint at all? Keep hitting shift and hope for the best. By the way, your flashlight has a limited battery life; who knew? Certainly not I until it suddenly stopped working, because there is no battery indicator or mention of this anywhere within the game.  The emblematic problems that come along with Unity of course plague this game. Consistent FPS? Nah, who needs it, even on high end gaming rigs such as mine (specs in profile). The achievements don't even work right. But hey, that's what you get when you use an engine that costs $50 to learn and own for life. Unity will be the death of horror games.   Rating:  0.5/5.0  - Abysmal, avoid it like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "I beat this game in like 20 minutes and the only actual gameplay aside from using keys on doors was punching in two number codes, one jump scare, and one word code. It's not scary and it doesn't even have story going for it because it bills itself as 'episode 1' but it's been over six months since the game came out and there's been no updates from the developers.",
            "review_score": "-1"
        },
        {
            "review_text": "  Buggy and too short to be considered a game!",
            "review_score": "-1"
        },
        {
            "review_text": "Don't know why, but these indie horror games, lags on my computer. It more is like a slowness than studdering, but still, I have a core i7, and a GTX 970m graphics card. There should be no reason for lag. Other than the unbareable lag, it seems like the developers can make this into something good, at least from what I have seen, which isn't much, because again, the unbareable lag. At this time in the game, I would not reccommend purchasing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad, I enjoyed it. I do have difficulty saying 'buy it,' though, since I found it pretty boring. Later episodes will have to tell more.",
            "review_score": "1"
        },
        {
            "review_text": "Well, straight up, I have to give this game kudos for trying to stand out at least a LITTLE in the current rash of first-person, 'non-combative' horror games being foisted on the market...yes, there does seem to be THAT many of them of late! First of all, there's the rather wacky 'detective'-style monologue of our booze-happy protagonist, which while a little on the 'inappropriate' side for a game whose primary aim should be SCARING us, is at least...er...yes, 'different', I suppose. Secondly, the slightly cartoon-ish graphics are...well, again, DIFFERENT! You may be getting the impression by now that I'm not necessarily using the word 'different' to imply 'genius', but points to the devs for vaguely trying and all that jazz.    Then there's a lot - and I mean a LOT - of things in this which are all-too-familiar to those of us who buy every second first-person horror game that comes out. A lack of a flashlight*, which doesn't so much add to the atmosphere, but makes searching around for keys and what-not a bit of a chore. And did I say KEYS? Yup, lots of THEM in this game, too. You know you're in for a key-heavy game when you attempt to open the door to a public bathroom and are told, 'I need to find a key to open this bathroom'. Thank ♥♥♥♥ it isn't that hard to gain access to a public toilet in the REAL world (unless you're in France). What else? Well, the sound effects drop in and out and seem unfinished at best; some of the 'animations' (e.g. our character raising his phone to answer it) are lifeless and robotic; there's oodles of doors which you not only can't unlock, but indeed can't seem to interact with any more than you could a perfectly featureless brick wall; keypad panels next to doors which are almost impossible to successfully interact with...and so on and so forth.   There's some other distinct lacks of originality which I noticed, but these are really more observations than complaints, as I generally eat this kinda thing up for breakfast in all honesty. How about a school with weird 'overhangs' from a hospital, such as wheelchairs with ghostly spinning wheels...sound familiar? How about said hospital crossing over into an asylum? Spooky little girls with black hair? No...none of that rings any bells for you?! Man, you really don't watch too many horror movies or play too many horror games, do you?!?   Alas, almost everything that I've stated thus far might be eminently forgiveable, if this game didn't commit perhaps the cardinal sin of any self-professed 'horror' game...that is to say, it just ISN'T THAT SCARY. Sure, it's a tiny bit 'spooky', and yeah, there's a couple of very minor and faintly effective 'jump scares' up its worn sleeves, but nothing even remotely inspired.    I guess it goes without saying that this game isn't QUITE as good as it looks in the screenshots. But really, what should I expect at this stage? We should all know by now that any game whose Store page makes you go '♥♥♥♥ me, that looks ♥♥♥♥ing AWESOME!' is probably going to fall substantially short of expectations, unless it has words like 'Outlast' or 'Amnesia' in the title. I only have myself to blame, really. I really should know better. Oh well. No doubt there'll be another game just like this in the Store by this time next week, and unless the price is suitably outrageous, I'll probably be a ♥♥♥♥ and buy that one too. Sigh.    Now, I see you're waiting anxiously for the PUNCHLINE to all I've said thus far? C'mon...you know it already. You've looked at the Store page. You've heard my testimony thus far. And you've had a glance at my playing time. What you maybe DON'T know is that I have a tendency to pause things for short periods whilst I go off and do other (quite possibly more productive) things, like visit the toilet (the one in my flat, which I definitely don't need a key to gain access to). So yes, sure enough...IT'S A VERY SHORT GAME.    Now, granted, it still has a few 'episodes' to go, and I believe I'll get these for 'free' down the track as part of my mighty four dollar expenditure. But unless future episodes are substantially longer, it's still going to be only a few hours in length, tops. In all sincerity, such things affect my opinion of games very little, as long as they're high quality games for whom the short length seems more than justified given the narrative being told (see 'Among The Sleep' for one such example). Now, I honestly can't see the limited charms of this game improving THAT much over the course of subsequent episodes - should said episodes even appear - but I'm nothing if not over-generous, so I'm going to give it a thumb-up anyway. A very WEAK thumb-up. Like, say, a HALF-SEVERED thumb at best?    ONLY BUY IF YOU'RE DESPERATE OR A HORROR COMPLETIST, LIKE MY IDIOT SELF. YOU HAVE BEEN WARNED.   Verdict: 5/10.  (* Yes, I too can see a flashlight in the screenshots and video. But I'll be ♥♥♥♥ed if I could actually find it IN THE GAME.)",
            "review_score": "1"
        }
    ]
}