{
    "app_id": 38720,
    "name": "RUSH",
    "release_date": "2010-12-03",
    "developer": [
        "Two Tribes"
    ],
    "publisher": [
        "Two Tribes Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Casual"
    ],
    "achievements": 25,
    "positive_ratings": 1069,
    "negative_ratings": 117,
    "price": 3.99,
    "description": "From the twisted puzzle minds behind the award winning Toki Tori comes a new game, simply called RUSH. Fortunately for fans of high quality puzzle games, RUSH is anything but simple. In the game's fully three dimensional levels, players need to guide cubes to color coded exit points using Conveyor belts, Warps, Stops Signs, Splits and...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/38720/header.jpg?t=1488470929",
    "minimum_requirements": "OS: Windows® XP SP3 or higher Processor: Intel® Pentium™ 4 2.4 GHz or better / AMD Athlon™ XP 3000+ or better Memory: 1 GB Graphics: 256 MB video RAM or better (NVIDIA® GeForce® 8400 GS or higher / ATI Radeon™ HD4000 series or higher) DirectX®: 9.0c Hard Drive: 400 MB free space Sound: Windows® compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Quick review:    Short Verdict  : Awesome game. Recommended for puzzle lovers with good spatial orientation.    Pros  :    Nice challenge level    Interesting puzzles    Frustrating at times for a short while, only to be rewarding later    Good BGM     Cons  :    No replay value    Inability to drag the map around instead of just rotating it makes some levels unnecessarily difficult  ",
            "review_score": "1"
        },
        {
            "review_text": "RUSH Review - Raymond K. Turcotte  A amazing game all in all. I really enjoyed playing it, some puzzles were diificutlt but it was worth the achievements. The game has some easy achievements and hard ones.   My one complaint would be with the achievements, thier are some that you can only get in december and one that you could only get in 2011. Really? Why? Not sure. I'm assuming just to make a quick 10$.  I managed to get around 80% of the achievement so, i'm not to sad. but believe me, i would get the two i'm missing in a heartbeat if i could.   One thing i loved about the game was that it refferenced other games, like Portal 2 (Glados) and Toki Torri. (I think...) but i think it's awesome that the developpers do that in games. It gies my a smile. because i loved the Portal seris.   Anyway. I 100% percent recommend this game! Get it now while it's only like 0.20 cents.",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly good. I had 22 cents left on my steam wallet. Found this game. Bought it. And didn't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This game, is about nerds only. This is the most...hardest game ever made for me Why? This game needs a lot of artifical intellegence because its about placing stuff to make cubes go to the right place and its pretty hard darn game so here is my ratings.  Gameplay 10/10 A.I 10/10 Graphics 9/10 Soundtrack 8/10 Multiplayer (No multiplayer at this game)",
            "review_score": "1"
        },
        {
            "review_text": "RUSH is quite hard, yet very accessible. For the rest of my review, you need to understand the gameplay a bit: watch the videos, because I won't explain it here.   If you are stuck, you can always use an in-game hint: it can either show you which tiles you used are in the right spot and which one are in the wrong spot, or it can show you where the tiles should go (without telling you which ones go where). It's up to you to decide which hint to use (you can use both as much as you want in every level) or if you'll use hint at all. It's nice to be able to move forward in a puzzle without having to look at the solution and feeling like you're cheating.",
            "review_score": "1"
        },
        {
            "review_text": "Want to test if you are really dumb ?",
            "review_score": "1"
        },
        {
            "review_text": "Bought this on sale for the cards, then realised it didn't have any, so I thought I'd play a bit and see what it was like. I must say I was pleasantly surprised by this game: it's good fun and the animations are nice and fluid. Depsite the rules being relatively straight forward, you can still be up against quite difficult puzzles so it's alwways satisfying whan you get all the blocks to go in the right holes.  If I had to rate I'd say maybe 8/10  You can't really zoom so sometimes if it's a long shape, you can't see all at once, but you can move around so this solves it. Perhaps including a level editor would be a fun idea? I can't see it being too hardfor this game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice puzzles in this game. Some of you will freak you out, but you also have a hint system. On medium some of the levels are already tough. For 1.24$ you can't do anything wrong.",
            "review_score": "1"
        },
        {
            "review_text": "simplistic, aesthetic puzzler which is quite challenging. what more could you want? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "RUSH has been on my wishlist for a long time as a low requirements game to enjoy while I'm away from my desktop (Which also means I didn't plan to run it under Windows.)  Here's all I have to say: This title is no longer cross platform. Under OS X it produces a white screen with background music and a green cursor. There goes the entire reason I bought it. A similar problem is produced in the developer's game EDGE, so it's clearly an engine issue. I reported the issues within hours of buying the games, hoping maybe they'd fix it. Nothing.  Do not buy this if you're trying to support cross platform developers.",
            "review_score": "-1"
        },
        {
            "review_text": "RUSH B!!! *And I go to B with one russian who can speak english, the rest go to mid and die*  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Rush is a really neat puzzle game. I would say it's worth picking up if, and only if, you thoroughly enjoy puzzle games. I mean it is pretty and put together very well.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those puzzle games on sale for like $0.19 and your like 'meh, why not' and then its fun for a while until you get towards the end and your just like ♥♥♥♥ this ♥♥♥♥ I'm sick of this game and you go online and look up for to beat like the last 5-10 levels.  Prob worth $0.19",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for .34$ and felt stupid. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "RUSH is a really simple puzzle game, but it's that simplicity that makes it fun to play time and time again.  The puzzles in this game range from pretty easy to extremely hard.The soundtrack is really good.If you like puzzle games this is worth checking out! puzzle games this is worth checking out! ",
            "review_score": "1"
        },
        {
            "review_text": "You should RUSH out to buy this game! (Not really, I bought it for .49 $ so I'd wait for another stupendous sale.)",
            "review_score": "1"
        },
        {
            "review_text": "the band is better   neil peart is the greatest",
            "review_score": "-1"
        },
        {
            "review_text": "Are you a patient nerd? Well these stupid little cubes are for ya.  ♥♥♥♥ gets tougher and more irritating what-with moving this and that to here and there and places you'd hardly expect ('nless you some kinda geek.) There's nothing really 'RUSH-y' about it unless you just wanna hurry up and finish a level.  Oh, and hints are for cheaters.",
            "review_score": "1"
        },
        {
            "review_text": "       You'll Enjoy This Game If You Like:",
            "review_score": "1"
        },
        {
            "review_text": "A very mediocre spatial puzzle game. The difficulty of the easy and medium puzzles is incredibly low such that even a modest ability will breeze right through them - probably suitable for babby's first puzzle game. The hard puzzles tend to be more annoying than puzzling. Lots of trial and error to handle the timing to avoid collisions, instead of actually thoughtfully puzzling out non-intuitive solutions.  The interface could be much better too, but I suppose at this price-point I can't hate on it too much.  That said, if you can get it on a really cheap sale, which is likely, it isn't *completely* devoid of fun if you think this might be your type of game.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't remember what this game is about",
            "review_score": "1"
        },
        {
            "review_text": "RUSH is a puzzle game with a unique mechanic and setting. It is a world comprised entirely of blocks. The idea of the game is to redirect the various colored blocks into their respectively colored 'exit'.   The main rule is if the blocks hit a wall, they will turn to the right. You must use this and many other tools to move them, turn them, stop them, speed up, slow down, or use the 'wall turn right' mechanic to get them to the correct goal.  As crazy hard as the puzzles get, they still pale in comparison to the soundtrack. It's beautiful, upbeat, and relaxing all at once. Just like I said in the title, I want this soundtrack so, so bad.   In celebration to the release of Portal 2, RUSH received a few, free DLC's that featured Glados, and DAMN THEY ARE HARD!   It's casual in that it's not high stress and there's no punishment for losing. You just keep going until you figure it out. You can also ask the game for a hint, or the answer itself.   It's cheap, it's simple, it's relaxing. Normally I'd say this is a mobile game that needs to stay off of Steam, but if they can bring this kind of quality, then they can stay. 10/10 Because it did so well what it sought to achieve.",
            "review_score": "1"
        },
        {
            "review_text": "More of a flash game, not very fun, which is pretty sad considering how awesome it looked.        51 cents though.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a puzzle indie game. need i say more?",
            "review_score": "-1"
        },
        {
            "review_text": "A very good puzzle game. Only problem is lack of volume control. Now it's a static on/off and the on is very loud. Would've liked to keep the music on, but it too is very loud. Over all, for 50 cents, it's a great game. Would recommend to all who want to slow down a bit and think.",
            "review_score": "1"
        },
        {
            "review_text": "Rush... Another brain-♥♥♥♥ing game, which is still kind of interesting. Even levels on 'easy' stage are sometimes hard, but it's a very cool challenge. If you like logic puzzles - get it! Another splendid, colorful, 3D cube game!",
            "review_score": "1"
        },
        {
            "review_text": "It's sort of like chu chu rocket. But not.",
            "review_score": "1"
        },
        {
            "review_text": "A 3D Puzzle Game with lots of colo and a pretty good soundtrack. The puzzles themselves are very entertaining and give your brain that good morning workout it needs. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "it seemed boring to me",
            "review_score": "-1"
        },
        {
            "review_text": "Yes this game is really good, but a complaint is that there is no zoom in/zoom out function making some levels harder when you can't see some places easily.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but a little bit hard. Good Idea!",
            "review_score": "1"
        },
        {
            "review_text": "Cute little puzzle game where you direct cubes around. It starts off extremely slow though and doesn't give you the option to skip the very simple levels at the start that are no harder than the tutorial. Additionally, the music is boring and was annoying to me. I can't see myself continuing to play this game, unfortunately.",
            "review_score": "-1"
        },
        {
            "review_text": "Perhaps it could be improved by adding a fast forward button so you don't have to see the horrible cube spawn animation all the time and see if you actually did the puzzle correctly. Probably half the time you spend playing this game is watching the cubes do their thing than actually solving puzzles. 1/3. For those people curious on how i have 0/0 hrs is cuz i returned it",
            "review_score": "-1"
        },
        {
            "review_text": "Same review for the threeTwo Tribes games: This is a simple puzzle well executed, but I quickly lost interest in the mechanics. Only good as a minor diversion. Worth it at 90% off, but not full price.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent thinking puzzle game. Pretty calm. You have to figure out how to guide the blocks to the exits. They move on their own. Most levels grant hints if you can't figure out where to place things.",
            "review_score": "1"
        },
        {
            "review_text": "SHORT REVIEW INCOMING: To be honest RUSH is nothing special. It's a mediocre puzzle game by the makers of TOKI TORI. Is it fun? Maybe, it gets pretty boring after a few minutes, but it's not bad either. I would say that is not suited for PC. Get this for your phone not for your computer.",
            "review_score": "-1"
        },
        {
            "review_text": "The difficulty in forcing cubes to reach their destination demonstrates the inefficacy of utilising square wheels for transportation.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of bright lights, feels like I'm on drugz r something",
            "review_score": "1"
        },
        {
            "review_text": "RUSH is a solid puzzle game, unique in the way that each one needs to be. The basic mechanic of using directional and other controlling pads to direct blocks of various colors toward their respective goals is an intelligent and compelling one, if slightly more so on paper than when playing. I give my compliments to the developers for wringing as much life as they have with RUSH out of a few simple pad types: up, down, left, right (no cheating - the pads rotate in tandem as you rotate the camera), alternate-direction (this one's my favorite, particularly with the puzzles that having blocks approach the pad from different directions creates), conveyor (shifts a block over one space while preserving its direction), and temporary-stop. Use of warp points, while a bit of a design crutch, adds more variety so I'll give it a pass. The game does get tedious, though, when you have to fine-tune your pathways so that blocks don't run into one another. In moderation this would add welcome depth to the gameplay, but as it is, it shifts the balance a little too far from creative problem-solving to drudging trial-and-error. Another, less frequently visible flaw in the game mechanics is that the number of blocks you must allow through your system is inconsistent - I once noticed that, due to the way I had my alternate-direction pads set up, my solution wouldn't have worked if one more block of each color had been expelled. The general feeling of designing cycles, however, is quite relaxing, so the gameplay is still well in the positive zone in my eyes.  There's not much to be said about the aesthetics. The music, while extremely repetitive, somehow scarcely gets annoying. The visuals... exist. My only complaints tangent to a discussion of aesthetics here concern the camera: you can't zoom, and the overhead expanse of blocks in the 'crocodile' (or was it 'alligator'?) level is a needless hindrance. Not impossible to work around, but not pleasant.  Overall, RUSH is an enjoyable, if imperfect, piece of work, and I'd recommend picking it up if you want something to occupy a few minutes (or longer) here and there as needed.",
            "review_score": "1"
        },
        {
            "review_text": "For a puzzle game, it can be difficult if you choose not to use any of the hints, which is a good thing for people who love to solve puzzles. However, if you're not adept at puzzle games, the hints are always available to you. This is a great game where you won't become too frustrated, but will definitely make you scratch your head and think, so long as you don't spam the hint buttons. I highly reccomend it. Loads of fun, and can be played in short bursts, one or two levels at a time.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing to do with 2112, Moving Pictures or A Farewell to Kings. However, there is potential for the occurence of grace under pressure.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, casual game. Nice brain teasers to relax while you're on a break.",
            "review_score": "1"
        },
        {
            "review_text": "Rush is an awesome puzzle game (It's basically ChuChu Rocket 2!!) and it now costs 87p. Why WOULDN'T you buy it?",
            "review_score": "1"
        },
        {
            "review_text": "It's basically a clone of ChuChu Rocket!, but in 3D! Great gameplay, price and soundtrack. A must-have for every puzzle fan!",
            "review_score": "1"
        },
        {
            "review_text": "This one's quite a good little puzzler. It's from the guys that made Toki Tori (also awesome) and, to describe it like most media outlets, it's Chu Chu Rocket with cubes. You place pieces such as arrows, conveyor belts, stop signs and so on to guide blocks to their respective endpoints. Like all good puzzle games it starts of easy and get's fairly hard. The trial and error nature of the game gets a little frustrating and I found myself abusing the hint system far too much (with no real disadvantage to using it, why not?)   That said, this was perfectly priced at only $5 and I'd love to see more puzzlers like this released at a cheaper price. The devs have been releasing bonus levels every week or so and (I think) a level editor is planned.",
            "review_score": "1"
        },
        {
            "review_text": "A great game and very well made. Just started playing and it feels smooth, the gameplay is right on and it does have quite a challange if you keep playing. Absolutely worth the money (it was $0.49 when I bought).",
            "review_score": "1"
        },
        {
            "review_text": "I didn't think a game about guiding blocks to goals would be very fun but I was wrong.",
            "review_score": "1"
        },
        {
            "review_text": "fun bought it in idie pack forgot about it played it year later loved it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and challenging. I would recommend this game to anyone who wants a good puzzle game!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty challenging (ie. fun for puzzle fanatics), very minimal graphics and premise. It's odd how many of the achievements centre around finding and completing hidden puzzles which you just find in menus like a hidden object game. But everything else serves the game and fits with the mechanics, and I enjoy how ludicrously challenging some of the later puzzles got. The difficulty curve seems to be a good fit. The music also suits the trippy cube-rolling and teleporting madness.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, it's a logical thinking game If you want something to play, buy this game :&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Buy this if you're really bored, or if you actually like spending time on puzzle games. It's a pretty high quality puzzle game which makes it stand out from other indie games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fine.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I normally don't play too many puzzle games but RUSH is a solid 8.5/10 in my book.  The difficulty of some of the levels is high but it's worth it when you eventually see the blocks all move correctly. The music is pretty well suited to the game as well, it has a good beat to it.   The only complaint would be like others have said and that's the fact that a number of achievements are not possible anymore or restricted to certain months. Other then that however, I'd strongly suggest you pick up this game, especially considering the price ($5.49 CAD at time of writing). That being said, you could probably wait for a sale and grab it for under $2. Either way it's a great deal!",
            "review_score": "1"
        }
    ]
}