{
    "app_id": 387290,
    "name": "Ori and the Blind Forest: Definitive Edition",
    "release_date": "2016-04-27",
    "developer": [
        "Moon Studios GmbH"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Atmospheric",
        "Great Soundtrack",
        "Platformer"
    ],
    "achievements": 57,
    "positive_ratings": 15886,
    "negative_ratings": 627,
    "price": 14.99,
    "description": "“Ori and the Blind Forest” tells the tale of a young orphan destined for heroics, through a visually stunning Action-Platformer crafted by Moon Studios.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387290/header.jpg?t=1542845738",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core 2 Duo E4500 @ 2.2GHz or AMD Athlon 64 X2 5600+ @ 2.8 GHz Memory: 4 GB RAM Graphics: GeForce 240 GT or Radeon HD 6570 – 1024 MB (1 gig) DirectX: Version 9.0c Storage: 11 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i5 2300 or AMD FX6120 Memory: 4 GB RAM Graphics: GeForce GTX 550 Ti or Radeon HD 6770 DirectX: Version 11 Storage: 11 GB available space",
    "reviews": [
        {
            "review_text": "This is incredibly hard for me to do, but I'm giving this game a negative review. Mind you, if there was an inbetween-option like  'It's okay'  then I would definitely have chosen that, but since the choice lies in either  'Recommend'  or  'Don't recommend' , I'm afraid I must settle for the latter.   Ori and the Blind Forest is a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "With literally thousands of games, very few manage to hold my attention for more than a few hours...Ori was an exception, it's a game I played from start to finish. Lovely story, awesome graphics and such a cute main character...Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I have played both Ori and the Blind Forest first and then bought the DE (=Definitive Edition) afterwards for 5€ (25€ total). You should definitely buy this because it is one of the best games I have ever played. After the list about pros and cons of the original I only compare the two games but since you'll receive both anyway you don't really need to go trough everything. I never used anything but a gamepad to play but I recommend using one if possible as other reviews complain about complicated controls which isn't the case when using a controler.   Pros and Cons of Ori and the Blind Forest",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games in the world. The story is just fantastic, It really pulls you right in to it. The game always trows something new at you before you get bored on an other mechanic. The whole world you are in is one big masterpice. It also has one of the best soundtracks ever.  This is without doubt my most favorite game ever.  It deserves all the awards",
            "review_score": "1"
        },
        {
            "review_text": "I don't think I've ever been emotionally involved in a game more than in Ori and the Blind Forest, and it's been a real pleasure to play it again in the Definitive Edition, the feels are still there. This game has everything for it, from gorgeous graphics, to insanely good music and addictive gameplay with a great difficulty curve as well as clever level design, and a nice story with adorable characters.  The new features in the Definite Edition are really nice, the difficulty settings let everyone enjoy the game the way they want, teleporting made me more motivated to find all secrets, the two new zones are really fun to explore, the new music is really pleasant to listen to, and being able to come back to the Ginso Tree and Forlorn Ruins if we forgot to get some collectibles is awesome, as well as being able to keep playing on a save file even after completing the game.  I'd also like to mention how the game runs way better than the original Ori and the Blind Forest, the problem of visuals and sound not being in sync during cutscenes isn't there anymore in the Definitive Edition, and some laggy areas of the original doesn't anymore, which is perfect if you don't have a beast of a computer.  So yeah, I really love this game, and I HIGHLY recommend anyone to play it. Unless you really have a passionate hate towards Metroidvanias, I'm pretty sure you'll love Ori and the Blind Forest: Definitive Edition.",
            "review_score": "1"
        },
        {
            "review_text": "Keep in mind that I haven't really played 2D Sidescrolling MetroidVania platforming games, or whatever genre this is.  My thoughts on this game - mixed, but generally positive  Starting the game you are blasted by a beautiful soundtrack which stays that way throughout the game. Further, the art-style is gorgeous to look at. It's a charming game.  The opening cinematic story sections are heartfelt and get you motivated to keep playing the game as it does have an air of mystery about it. Consider the world of Avatar and the way that world had an atmosphere of 'magic' about it - the viewer, or player in this case, wanting to immerse themselves in that world - this game achieves that.  Playing through as Ori to restore life to the forest you will go through many areas and mazes, conquer many traps and upgrade your abilities over time as well as even hunt and locate secrets to further boost those upgrades. The upgrades themselves exist on 3 'trees' where, as you obtain skill points through combat and secret boosts you can adavnce along any and all increasing your attack damage, gaining additional mid-air jumps, increasing the effect of life restoration, revealing some secrets on the map, and so on. The secrets are not too out of the way and over the course of the game I didn't need to 'grind' for skill points which is good. It's a very casual game as without necessarily intending to, I found that I located most of the secrets. Some I did want to find just because I wanted to master my abilities which also works to the game's advantage. The story is pleasant and magical and the tense moments are just that.  However. (Keep in mind this is my first venture into these types of games)   Controls.  Mouse and keyboard - you will be jumping a LOT. Be prepared for aching fingers and you might need a thimble for your thumb on the spacebar. At one point I picked up my controller because of this, but found I had to move BACK to mouse and keyboard because of the rather silly way in which some abilities are implemented and not being particularly suited to the D-Pad of a controller. (I didn't use sticks as I would find that I would be going up or down unintentionally).  There also appears to be a bug for PC where some abilities do not even work (ones obtained from skill trees). But I could complete the game without them anyway.    Level Design.  Maybe I'm impatient, maybe I'm easily frustrated, but some levels and their designs are infuriating. WHen you have so many control systems and abilities to juggle the level design can be very tricky to navigate without some abilities getting in the way or not working necessarily as intended.  As someone with a visual impairment, sometimes the art-style to the game, while fantastic, was a drawback because it made seeing where I could stand and where I could not quite hard leading to many deaths on my part. Then there are the tense climax/chase moments in the game. These should be fast, exciting, but ultimately just turn into trial and error 50, 100-attempt sections that by the end you have lost all your excitement and just want to get the section over with.  Most of the game is relatively straight-forward however and was only really frustrating to me outside of the things I mentioned already when I just found controls, level design, or Ori's movement to be unintutive or temperamental.  Having said this, overall I would recommend the game, it's a charming experience and I imagine would be much more enjoyable to those more experienced with 2D side-scrolling platformers. As my first step into the genre, I'd say it was worth the time and money, although it isn't too long - maybe pick it up when it's on sale. Worth a second play-through, perhaps not for me. But I will be picking up that soundtrack, and that opening will probably stay with me a good while.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best single player game that I have ever played so far  I got stuck on some of them and I gotta say this game is really challenging   Raged once in a while but at the end, it was all worth it   Gives you the feels too   10/10 Recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Hear about game from random source, See game in random commercial, Bought in Xbox bundle,  Play game for hours, Probably one of the best games I've ever played, DE comes out on Xbox,  Buy DE on Xbox, Join speedrunning community, DE comes out on steam, Bought it on steam, Going to play for hours again.  10/10 should have got this game earlier Would buy again",
            "review_score": "1"
        },
        {
            "review_text": "An expanded version of one of the best platformers out there.  The Ori-ginal is great by itself. It has some of the most fluid, fun controls and challenges of any game I've played, and it's clear from the start that the people of Moon Studios perfectly understood what they were doing, because everything works masterfully! Simply moving around feels great, and combined with creative environments and obstacles, it adds up to a kind of platforming brilliance that you don't see very often. Despite the structure of the game, I'd argue that it's more Rayman than Metroid, though I strongly recommend it to pretty much anyone who enjoy sidescrollers. It's a game that keeps getting better with every new challenge and every new ability, most of which only enhance the platforming (the bash ability changes everything). It also has the best quicksaving system I've ever seen.  All of it is wrapped up in a fantastic presentation. The art is detailed and gorgeous, the soundtrack is dramatic and unforgettable, and both compliment each other perfectly, as well as the grand, poetic storytelling that goes all out to make the world feel gigantic and ancient. It seems like the developers only took lessons from the best of the best, and nothing feels underwhelming, cut short or left out in any way. It's all extremely polished.  It's pretty weird that this Definitive Edition isn't just an update to the original version, because now that game is just taking up space on the store and in my library. There doesn't seem to be any reason to buy it when the DE is the same thing + new levels, new abilities, difficulty settings, fast travel options and full backtracking support (although more graphical options would've been nice as well). Having beaten the old version, all these additions were very notable, very early on, and they only serve to make the game more exciting than ever.  If you like magic, fun, challenge and feeling emotions, you should pick this up. There has never been a better time to do so.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best platformer on a PC ever. Not only is this game gorgeous articistically, and in particular its soundtrack, it also challenges you. Whether you're playing for 100% completion, deathless victory, stressing through a 3-hour speedrun or just hopping around for your first time, this game provides some unique challenges that flow along beautiful gameplay. This is definitely the best non-Mario platforming game, ever. Get it and play through at least once in your life.  As far as the Definitive Edition versus the Original, the Definitive Edition offers 2 new abilities which only get truly utilized in one major new area on the map. Without any spoilers, is based around a Naru-centric story which is short but sweet. It can be confusing since rather than adding new challenges in other areas of the map, tney just forced you to get the new abilities to unlock some older ones. The greatest part is that you can get back into all the areas and use waypoints to teleport. This is nice and saves time, though if you're trying to collect all the secrets, you'll still be hoofing through areas a second time when you get triple and charge jumps. It could just be me, but I noticed some lag on the water escape which I never had on the original and shouldn't ever really have. Furthermore, I noticed Steam failed to register my achievements after a while.  In summary, I loved this game so much that quite honestly I didn't mind any of the shortcomings with the Definitive Edition-specific content, But to be clear, the definitive edition doesn't really add much of anything worthwhile. If you've never played through Ori and Blind Forest, do it. It is fantastic. If you have but are wondering if the Definitive Edition is worth getting... I'd say only as an excuse to play through it again. Keep in mind, that like most platformers, replay value is limited. You can aim for achievements, but despite my love i probably won't play it again for 6 months to a year and soonest. Ori and the Blind Forest is fantastic, and plays really well on both Xbox and Steam controllers, but can be extra challenging on a keyboard thanks to the eventual use of 8 buttons/keys for different purposes. No matter what, this game is worth playing once though. And possibly obsessing over it's soundtrack afterwards. The Definitive Edition could be worth skipping, but let's all just hope we eventually get an Ori sequal at some point.",
            "review_score": "1"
        },
        {
            "review_text": "What do you get when you mix: 'A heart warming story that will touch your soul' with 'fantastic unbelievable art visuals!'  I was absolutly star strucked when I first launched the game; the prologue, the music and the art direction was just all perfectly synced together! It even managed to reach out to a soft spot inside me, I couldn't help but let loose a tear just from how beautiful everything looked and how touching the storyline was. The story in my opinion (and others) is very heart warming.   This game has got all the bells and whistles you would not expect and will definitely latch onto your soul once you start playing it; A 'Must Experience' is my recommendation. I hope you enjoy this game as much as I did!",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game for people who are interested in platformers in general. It is challanging at some points but is a fun game to play through. 6 times i have finished it and i will likely complete it another 6 times by the next 2 years.  Worth buying twice",
            "review_score": "1"
        },
        {
            "review_text": "Played this after playing the original version, this is pretty much the same review with new content in the last paragraph. Hands down the best 2D platformer I've ever played. For me, it's like a combination of Spyro the Dragon &amp; Metroid.  + Graphics &amp; music are beautiful. + Great plot. + Gameplay is fun, not too easy or hard. + Lots of collectables and RPG elements, including a skill tree. + Diverse array of enemies.  New content: This edition adds early development footage which shows attacks, enemies, and puzzles that didn't make it into the game. There are two new attacks and two new optional areas. I look forward to a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "great visuals, great music, fun gameplay. usually not a fan of platformers but this one is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "If you're like me and you love exploring, in what can only be described as a truly gorgeous and incredibly well crafted world. Running around like a headless chicken(in this case a glowy mutated rabbit made of   deathlight  ) trying to find all the collectibles. Then, good news you one person reading this review! This is not the Dacia sandero! But just the metroidvania game for you.  Completed the original, and this is more of that. Plus even more of that level of quality. So what are you waiting for? Stop reading these words and buy the darn game.",
            "review_score": "1"
        },
        {
            "review_text": "First of all; This is a great game!   The new skills added makes the game a bit easier, but they are not ruining the feel of the game. I have played the original game over and over, and I'm having a blast every single time. That said, I don't think I'll spend that much time on the Definite Edition, since the map, the objectives and 'quests' are the same.  Adding the new skills and two other areas to explore, doesn't make the game more fun to play. I would rather have the devs make a larger area to explore and a couple of new bossfights.   That said, I think it's worth buying, due to the bonus storyline and the skills added.",
            "review_score": "1"
        },
        {
            "review_text": "Not the same genre, but I used to think Bioshock Infinite was the most beautiful game I've ever played until I touched this. Nothing even comes close to the world of Nibel: each area feels unique rather than copy-and-pasted, and enemies while abundant do not feel overused; the music is ethereal, the voice acting soothing; the story is moving and actually makes you feel sympathy for the characters. Movements are fluid and satisfying too. I can't find any faults with this game... it's an absolute masterpiece.  Also as someone who never played the original game, none of the new areas or abilities felt 'extra' to me, and it all pieced smoothly. The game is plug and go for an Xbox controller, but you'll need a third party application for PS4 controllers.",
            "review_score": "1"
        },
        {
            "review_text": "It's good. That's all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "It's by far the best game I have ever played in my whole life. The story is just beautiful. (You're inhuman if it does not make you cry) The graphics are a solid 9/10, awesome backgrounds. Let's talk about the soundtrack and the music in general. I promise you, you will not be able to find a game with a better soundtrack. It'd be worth buying the game, just for the music. And let's not forget the gameplay.. A Jump and run game with awesome obsicles, different level designs, multiple options to choose at the skilltree and there is just SO much to explore. (I recommend to not just rush the story, enjoy the game) There is just one thing that annoyed me. After you have finished the main story, you won't be able to play on this save anymore. That was kinda sad, because i would have loved to get 100% and explore EVERYTHING.  It's still a mustbuy. Trust me. You won't regret a single minute of playing this piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "1-player 2D platformer, excellent visuals and polish, low replay value, good story, good soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "It was a conflicting surprise to see Ori get a rather costly update (if you didn't buy it when it was down to 25%). Compared to the original game it has two new powerups, reworked ability system and an extra area you can find. The most important update would be the removal of area restriction; in the old version you couldn't access certain story-heavy areas after you'd cleared them story-wise. This was a bane for the 100%'ers who didn't do it right on the spot.   Nevertheless, this game.. this f*cking game. It's beautiful. It's grand. As a platformer it has everything from enticing atmosphere, immersive surroundings and magnificent music to excellent controllability and easy-to-understand game mechanics. It's got an unique system called Bash, which is an ability you open during the first third. It alone makes you feel like a fast and nimble spirit creature speeding across the poisoned forest.   The character grows stronger and faster and the very scenery feels alive by adding permanent (positive) changes on the world as you progress the story. Though it's for only 4-6 hours, every hour feels twice the amount. It's that kind of game that sticks with you as a positive memory. It's a game I'd want my children to play if I ever conceived any.  Don't be afraid to pay the full price. Please support the people that made this game. It's worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "I've finished this game twice so far and let me tell you this; if you're a fan of good and fluid platforming like Super Meat Boy (or the old days of 2D Super Mario on the SNES or NES), this game deserves a spot in your library without a doubt. It has one of the best platforming in years I'd wager. Along with level designs that make great use of Ori's abilities (and how well animated Ori is), moving around and exploring have never felt more satisfying.  However, and this is entirely my opinion, if you're feeling for a more Metroidvania game with a fleshed out combat system or deeper RPG mechanics, this game does neither of those. Granted, the combat mechanic fulfills its purpose, but it can be pretty mindless as your means of offense is to only repeatedly press a button to kill your enemies with little to no strategy as your projectiles automatically homes onto an enemy, and sometimes pulling off a charged attack when need be. Don't let me fool you though, this game does offer a variety of ways to finish off your enemies by using the environment to your advantage. Additionally, you'll unlock more abilities to maneuver around the gorgeous world, allowing exploration to be fun, rewarding and less repetitive. The light RPG mechanic, albeit simplistic, works wondefully well as the abilities and upgrades you unlock have a great synergy with one another and are well balanced, making it so that there's no ability or upgrade that is outright useless or overpowered. This game's story is the weakest link, but if anything, it gives you just the right amount of motivation to continue playing while you're engrossed by the beautiful soundtrack, only to realize that you've already reached the end.   All in all, it's a good game and I enjoyed it thoroughly so play it now, you dork.",
            "review_score": "1"
        },
        {
            "review_text": "Just perfect! this is the best game i have ever played! the soundtrack is amazing, the art style is the most beautiful i have ever seen, the story is rich and emotional and the gameplay is super fun and challengeing.",
            "review_score": "1"
        },
        {
            "review_text": "A Metroidvania with a lot of heart and an animated film quality aesthetic, Ori is really one of the best in recent years.  The soundtrack, controls, level design, art direction; it's all top notch. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The visuals, gameplay and audio are all marvelous, blending together perfectly. The story pulled at my heartstrings, with the soundtrack upholding the rich atmosphere within the game. You may die often, but if you persist it is a rewarding experience. There are plenty of bonus features with this definitive edition, enriching the experience even further. While I completed the game in a relatively short period of time, its high replayability balances it out. Ori and the Blind Forest is now my favourite platformer.",
            "review_score": "1"
        },
        {
            "review_text": "All I can say about this game is that it is pure art! It has an amazing soundtrack, great gameplay and an amazing artstyle. It feels like an actual classic platformer.",
            "review_score": "1"
        },
        {
            "review_text": "The best platformer I have ever played, and I played quite many. Tight controls, gorgeous visuals and amazing music. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Ori and the Blind Forest: Definitive Edition is perhaps the best game I have played in a long time. The backgrounds are incredibly detailed and the atmosphere is transcendent. The music is fantastic, Ori himself is beyond adorable, and everytime Sein is talking, I just want to say, “Hey, Listen, Watch Out!”  Apart from the spellbinding graphics, the gameplay can become challenging. As you try to juggle each ability and avoid enemies. The story is definitely not lacking in depth, instead of dumping it all on you at once, it is broken up and distributed throughout the game, without interrupting gameplay.  The ending of the game WILL make you cry.   Ori and the Blind Forest: Definitive Edition will not fail to disappoint players, leaving them wanting more, the replayability is very high. 100/100 Best game of the century",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing. Just adding to the positive reviews. Only negative comment is that the menu's are a bit confusing if you're not investing much time into the game",
            "review_score": "1"
        },
        {
            "review_text": "This game is an absolute masterpiece.  You will be hit with feels. The visuals are incredible. The soundtracks are just beautiful.   Play. This. Game.",
            "review_score": "1"
        },
        {
            "review_text": "The DEFINITIVELY worth platformer.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Beautiful graphics, the music is better, than perfect, played it with both keyboard and controller, and never had too much difficulty with the controls. Bought the original, bought the Definitive Edition, and I loved playing through both of them. Totally recommended. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you are after a 2D platformer, look no further! This is probably the most beautiful 2D platformer around, both visually and aurally. I completed the original game. Now re-playing it but the definitive edition this time.  Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This is in my top 5, possibly top 3 platformer games I've ever played, and will be there for a long time. The beginning is a bit slow with a lot of cinematics, however the visuals are absolutely phenominal and very colorful. The music is outstanding, and fits with the area of the map you're in extremely well. Speaking of the map, the world itself is large enough to not feel clastrophobic and make you want to explore, yet not too large where it takes you forever to reach one side from the other. The puzzles range from easy to infuriating. The controls are solid although some of the sections require you to be totally perfect or have a bit of luck. This game was frustrating as all hell at times but I couldn't put the controller down. I only wish i had bought this game sooner.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time fav games!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game",
            "review_score": "1"
        },
        {
            "review_text": "stunning graphics amazing story great gameplay ",
            "review_score": "1"
        },
        {
            "review_text": "Only a few hours in and I do not regret buying this game. Beautiful, well-paced platformer with equally beautiful music and aethestics.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute MUST for platformer lovers. Definitely recommended for everyone else as well. 2D platformer with excellent and various mechanics, beautiful art and graphics, fluid movement and great level/map design. Its not in my top games ever played list.",
            "review_score": "1"
        },
        {
            "review_text": "The original game was already a must buy, and even for owners of the original game the purchase for 5€ is absolutely worth it. The additional ingame content may not be much (maybe half an hour to an hour additional playtime if you know your way around Ori) an additional 29 Songs of soundtrack are also included! Regarding the base content, the amazingly good reviews for the original game tell everything there is to say.",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful game (graphics, story, and music). Challenging and fun, despite my usual dislike for platformers.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful platformer, really enjoed it.",
            "review_score": "1"
        },
        {
            "review_text": "This game delivers in terms of art and music. Some of the most beautiful graphics and art I've seen in a game, and the accompanying score is some of the best music I've heard written for a game resulting in a beautiful game with absolutely gorgeous music. The mechanics of the game is implemented pretty nicely. You jump through the air, jump off of projectiles before travelling through a tunnel of spikes. Everything becomes fluid and multiple skills are used in succession. This game has a tonne of secrets which requires a lot of exploring (and backtracking which can get annoying). Numerous skills (with Bash being a favourite of mine) can be obtained and need to be used in order to beat a lot of the areas. Despite all this, there are some things that are left to be desired. The difficulty spike means that the game can get difficult quicker than other games like this, which will test one's patience. The story, while emotional, is not anything special. The combat isn't as complex and developed (such as the combat system in Dust), instead focusing on platforming and puzzles (with a few time-trials). This means that if your looking for a tear-jerking story and/or intense action, you'll be disappointed.  If you want a story-rich game or a combat intensive game, this probably isn't the game you're looking for. However, if you want a game that looks stunning, has incredible music and/or challenging platforming, this is the game you're looking for.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is very well designed and has a very sad but good story board. I made this short so you don't have to read a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Now, before I start: I am NOT the World's Greatest Gamer, and your mileage may vary, but Ori and the Blind Forest is the most BRUTAL platformer I have ever played. I love the artwork, the story, the music, everything about it, but I find myself rage-quitting after trying to solve the same puzzle over and over and over again with perfectly-timed double- and triple-jumps, using air-dashes and targetted dashes... Forget playing with the keyboard and mouse. Even though it's more precise than a controller pad, it's just too complex. I should note, I'm playing on Easy difficulty. God help me if I try playing any other difficulty! I've had to restart after getting myself stuck in areas I was unprepared to play, as I didn't have enough energy orbs to open doors that were absolutely necessary. All in all, I have to give this game two thumbs up for making me cry in the opening cinematic.",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually write reviews but I felt the need to write one for this game. This game is nothing short of amazing. This is one of the best games I've ever played. Everything about it is amazing. Great visuals, great soundtrack, fluid controls and a proper difficulty curve. There is a story present, which isn't much but the simplicity of it makes it engaging and enjoyable nonetheless. If you ever thought about getting this game for a second, do it. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Story: 9/10 - Beautiful story, really had me engaged. Only game which made me connect with both the main character, and the villain. Very nice.  Graphics 10/10 - The graphics were breath-taking, absolutely flawless with the greatest 2D animation I have ever seen on any form of media, including movies.  Gameplay 8/10 - Gameplay was good, unique and fun, the only problem is that there were a lot of controls to remember.  Sound 10/10 - The soundtrack for this game was amazing, fit every scenario very well. Absolutely incredible during the introduction, and the areas where you had to escape from the areas you were in quickly, like when the water flooded the tree, and when the ice started breaking down in the fire area. Sound effects were also stunning. Amazing job.  Overall 37/40 - VERY HIGHLY RECOMMENDED",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully-made game, giving new environments every journey. Well done, Moon Studios.",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore platforming, If you like platforming its a must.",
            "review_score": "1"
        },
        {
            "review_text": "Simply put: this is a gorgeous game with great sound and the feel of it is pretty good for the platformer genre. I still need to sit down and have it out in a long session of play because I keep trying to play it in small bursts. That is not working out to well - but only because I am not a very skilled gamer. You'll be better - trust me. :) Most importantly, though is it is phenominal-looking and the emotive storytelling is top-notch. Do it!",
            "review_score": "1"
        },
        {
            "review_text": "One of very few games I have ever played that has triggered such an intense emotional response on all fronts. The music is beautiful, visuals are incredibly detailed and dynamic, and platforming controls are remarkably fluid. This game is a work of art!",
            "review_score": "1"
        },
        {
            "review_text": "I completed this game at a friend's house. When I got back home, I bought it for myself. There NEEDS to be more games like this. The mechanics are well made, the music is excellent and the visuals are wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "Cried more than when my grandma died 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game will blow you away with incredible gameplay and story. Together with amazing artwork and beautiful music makes this one of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A Metroidvania game with a good story and nice visuals. its so rare to find a game of the 'metroidvania' genre in this day and age. a blast to play, runs smothly and good pacing! easily one of my favorite games in recent memory.",
            "review_score": "1"
        },
        {
            "review_text": "This game can REALLY ♥♥♥♥ you off, but it's fun as hell, love the puzzles and the abilites/talent trees.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Geez! Are you really asking me do i recommend this game? Because i LOVE IT! Hard but fair, with really good controls, with beautiful graphics and nice story platformer? Just stop reading all that reviews and buy your own copy!",
            "review_score": "1"
        },
        {
            "review_text": "Nice action-platforming, amazing aesthetics, animations, music and art. The story's not bad either. Good game!",
            "review_score": "1"
        },
        {
            "review_text": "  so wonderfu game , this game make me cry alot , :'(",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best platform games I have ever tried. Beautiful, 10/10 package. Worth the shot, give this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "Original Ori Review: First Edition (I have 47+ hours on this edition) This is one of those games that deserve the 'Perfect Game' category. Perfect balance between action, puzzles, challenges and rewarding cutscenes that will keep you at the edge of the seat. You will end this game with a smile on your face and quite possible, tears. Congratulations to the devs and thanks for creating a game that can be called without any doubt, a masterpiece. I have to make a special mention to the Music, since it is a great part of the experience.  Gameplay 10/10 Graphics 10/10 Music 10/10  About Definitive Edition: Definitive Edition adds background story on Naru and a new map. Both additions have the same level of quality as the original game. Also there are new powers, fast travelling between zones and difficulty levels, which is great because now my 5 yo kid can play the game by himself in the easy difficulty.  Conclusion: DE is great for re-playing the entire game, and the new songs in the soundtrack are really *really* good. Upgrading worths every penny.  *Edit 11/23: Nominating this game for “I'm Not Crying, There's Something In My Eye” Award : )",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible game in every sense of the word. The original was a masterpiece, and the Definitive Edition was even more so. Truly an amazing game.   The art design and overall mood of the game is breathtaking. It's very visually appealing, with unique graphics and beautiful artwork. The moods it creates resonate with the player very well, and it is very immersive.   The music is simply spectacular. Before I even owned the game I listened to the music on repeat for days, I was captivated. The music adds to the mood making it at times feel lighthearted, and other times feel mysterious and mystical. Truly amazing soundtrack and overall sound design.  The gameplay, similarly, is very rewarding and thrilling. While it is a 2D platformer, there are numerous movement abilities you can gain through playing that allow you to control Ori in all sorts of ways. While the game is difficult, it is not frustrating. You have to be good with a new ability to use it to its fullest potential, and you have to really think about what you are doing at times. The gameplay is very interactive, and the combat (while slightly repetitive) is very fun as well. Once you get bash, a whole WORLD of possibilities opens up for you.  Lastly, the story is very immersive and full of emotion. The studio really did a wonderful job of conveying emotion and atmosphere in this game with little dialogue, and it is beautifully done. The characters are fun and dynamic, and really add a lot to the game.  Overall, I cannot recommend this game enough to anyone and everyone. It is truly a masterpiece. I've spent many hours playing this game and I have no plans to stop now. If you love video games at all, you're truly missing out by not playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Please.. ;_;",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This game is something special. It's just fantastic; all around polished. Buy it. It's gorgeous to look at and has a heart warming and chilling soundtrack. A great story and it's very challenging to play; a platformer to the core. My only drawback is sometimes the hit detection is sometimes off a bit. That is literally the only complaint I can make. Buy it",
            "review_score": "1"
        },
        {
            "review_text": "Really interesting platformer, with a great story. (Doing this for nomination)",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Everything about it is just great. Great soundtrack, a story that gives you the feels and pretty graphics. It's a masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "I hope they make another one. Such a great game with cool music.",
            "review_score": "1"
        },
        {
            "review_text": "This is a frustrating game. It can make you want to pull your hair out or even scream into your pillow (I did both - 820 deaths in the ~11 hours it took to complete this game)  But this game is also mind blowing and creative, with an abundance of abilities and places to explore. It's difficult, yet extremely rewarding. When you hit a slump you always know that you'll progress greatly in the game if you overcome it.   Ori made me laugh, made me want to cry, made me grind my teeth together, and made me drop my head into my hands; but in the end it made me proud of myself and the journey I had experienced.   9.5/10, truely a masterpiece. 100% reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw the previews for Ori and the blind forest I was incredibly excited to play it. But, after seeing the price I was rather put off. So I waited a few months to see if it would come on sale. It never did... But my patience got the best of me so I bought it. And Wow... I honestly regret not buying it on the day of release. This game is an absolute masterpiece. For a 2D platformer, the graphics blew my mind. The short but heart touching story line had me sobbing like a little kid. The controls and mechanics of the game were so pleasing to use. Finding the hidden items was a challenge but fun at the same time. I probably spent way too long trying to finish the game but oh well.  Overall this game is well and truly worth the 25$ (Au). For the 20 hours I spent on it. I highly recommend this game to everyone.  ",
            "review_score": "1"
        },
        {
            "review_text": "Here are some things that make this game incredible: (also, don't reference my play time. I beat the original version of the game twice before buying the Definitive Edition)  - The Story: This game tells a beautiful story about loss, joy, self-discovery, hope, despair, courage, and so much more.  - The Atmosphere: The feel of this game is so magical and surreal. It's a strange, unfamiliar world, and yet you immediately put yourself into Ori's footsteps and feel as if you belong there.  - The Soundtrack: The music in this game is GORGEOUS. It's powerful and soothing at the same time. I strongly recommend buying the soundtrack with the game.  - The Animation: Once you get a hang of the controls (which aren't hard to get used to), this game flows beautifully. It's so much fun to flip and jump through the air while latching onto things to fling yourself even higher. You feel weightless. -The Difficulty: This game is not easy. However, it is nowhere near impossible. It's also quite hard to get frustrated at such a pretty game. Plus, the reward is well worth the work.   TL;DR It's a great game. Buy it (:",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful story. Quite the emotional rollercoaster, tears of sorrow and joy were shed.   The levels/puzzles do become rather difficult so I played on Easy as I prefer to enjoy the story. There are plenty of secret areas to find and unlock and it is easy to get distracted exploring the environment, especially when it is so beautiful! The music is perfect and really gets your heart pounding in those escape situations. I would recommend playing with a controller, I coundn't get the hang of the KBM controls.  In short, I would 100% recommend you give this game a shot.  Note: I played the Definitive Edition not the original. Completed in 10.8 hours.   ",
            "review_score": "1"
        },
        {
            "review_text": "What a game! It's beautiful, engaging and challanging. Difinitely costs every single dollar.  So nice to see the games which are done with soul and great effort.",
            "review_score": "1"
        },
        {
            "review_text": "The music, enviroment and the feels this title delivers it all at best possible way..Worth buying.   Ratings:- 9/10  Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Definetely one of the Best ingame soundtract I ever played and listen to. This game really have a beautiful visual and art, super colourful. Besides the visual, this game also have great soundtrack, especially when you discovered a new area, gameplay is super fun, and kinda hard. Lots Lots of puzzle, challenging enemies and bunch of abilities to level up your game!",
            "review_score": "1"
        },
        {
            "review_text": "There are few games that I would recommend. Fewer still are those that would be able to withstand the test of time. This is a game that I will come back and play again in 5 years and think, 'This game is gorgeous. The music in Ori is fantastic. The story is wonderful.'  The game can be hard and unforgiving on most difficulties so be prepared to try over and over. I would also say that there are multiple ways to approach different puzzles which most games don't have, but due to the mechanics of the game you can play as you see fit.  I highly recommend this game.  If there were a tag for 'buy this game right now!' This game would have the tag under popular user tags.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. My friend recommended me this game and he did not disappoint.  From the gameplay to the music to the visuals, Ori and the Blind Forest is stunning, starting from the opening cutscene to the end credits. While the story lasts maybe 10 hours if going for 100% blind, there exists some replay value for harder difficulties or the near-impossible one life mode. I can't say enough good things about this game, and my only complaints are due to my inability to play this game well. If you enjoy video games as a certain style of art, I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is easliy the best platformer I have ever played. This is a must play. The soundtrack is outstanding. The art style is stunning (Looks AMAZING in 21:9) Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece. Thats all.",
            "review_score": "1"
        },
        {
            "review_text": "Worth every dime. Such a beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "OMG great platformer tricky and smart u must be good at platforming (this type of games ) or this game might be a nightmare for u , not really but it is not that easy . 1 - level designe is awesome  2- the visuals are breath taking  3- the blatforming is in another level  4- the music Oh what i can say about it ( there are better tho )   can u just buy the game and show the developer some love so they can make another piece of art again .",
            "review_score": "1"
        },
        {
            "review_text": "This game, it's just, just so beautiful, both in story and art. This is definitely a must have, and it's also challenging, but not so much as to hinder the story's progression.  The abilities are fun to play around with and have been integrated into level design so that you can come back to old areas and find new secrets. ",
            "review_score": "1"
        },
        {
            "review_text": "Really gorgeous game, with a great story, great soundtrack and progression of skills. However, the difficulty is too high. Usually you are able to save almost anywhere, but during specific vital sequences, you are unable to save. Those sequences requires flawless execution of complicated manouvres, with no room for error. Trying to get through them was more frustrating that fun/challenging.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played too many hours of this game just yet, but I can tell I will.  Graphics are pretty cool looking, and the mechanics are really interesting and fun.  There's a good amount of challange, but nothing that will make you tear your hair off for.",
            "review_score": "1"
        },
        {
            "review_text": "great game, awesome Soundtrack  I highly recommend playing this gem",
            "review_score": "1"
        },
        {
            "review_text": "The soundtrack to this game is amazing. It's a beautiful game and was definitely worth my money.",
            "review_score": "1"
        },
        {
            "review_text": "There's nothing I can say about this game that hasn't already been said by a thousand other reviewers, but I echo the sentiment that this game is one of the most beautifully polished and all-around excellent games that has been made in the last decade. The puzzle portion is engaging, challenging and rewarding, the visuals are breathtaking, and wrapped around all of this is a heartstring-plucking story about loving one another even when there's seemingly nothing left in the world to love. :')",
            "review_score": "1"
        },
        {
            "review_text": "This game is so beautiful!",
            "review_score": "1"
        },
        {
            "review_text": "Ori and the Blind Forest is an exciting, heartwarming little game that will both challenge your skills and tug at your heartstrings. I wholeheartedly recommend it!   It's one of those games that is way more than just the sum of its parts; it's not just a solid platformer. This game really has heart and soul! I found it so easy to become immersed in the world and feel attached to these little characters. The polish that went into this game has really brought the magical forest to life with its vibrant visuals, orchestral soundtrack and even bits of voice-acting.  If you've heard of this game already and are thinking about getting it, my advice is: Stop thinking about it, or ho-hum over waiting for a Steam sale. Just do it! Pull the trigger on it and get this game - it's worth it. You won't be disappointed.   Final note: This review is based on my experience with playing on an X-Box 360 Controller. Also, one feature of the new Definitive Edition is that it has selectable difficulty modes now. If you were perhaps intimidated by this game's infamous challenge, know that you can adjust it at any time.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Played and enjoyed enormously both Ori and the Blind Forest and Ori and the Blind Forest: Definitive Edition (for 5€). All the improvements of the new edition (new game areas &amp; abilities, new travel possibilities, difficulty selection) made the experience of revisiting this worlds even more magical. A perfect combination of beatiful graphics, music, great game mechanics and story.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer, but REALLY HARD!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great platformer. It's challening but forgiving and it looks amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely... Beautiful... Game... Definitely a must play!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely brilliant (and I know that this review is long after release, but it deserves it). It is one of the best games that I've played in a long time. It has an excellent, heart-melting story, with a beautiful soundtrack and enjoyable gameplay with a nice challenge. This game is one of very few i would give 10/10 to, and is probably the best game that I've played all year.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely brilliant (and I know that this review is long after release, but it deserves it). It is one of the best games that I've played in a long time. It has an excellent, heart-melting story, with a beautiful soundtrack and enjoyable gameplay with a nice challenge. This game is one of very few i would give 10/10 to, and is probably the best game that I've played all year.",
            "review_score": "1"
        },
        {
            "review_text": "This game blew me away with the graphics detail and soundtrack . also fun to play",
            "review_score": "1"
        },
        {
            "review_text": "This game blew me away with the graphics detail and soundtrack . also fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! A better Metroid game than anything Nintendo has put out recently...",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a beautiful, polished amalgam of the best platformers mixed with the exploration of Symphony of the Night that I can't believe I didn't play until now.   Absolutely incredible artwork. This game has the most art and it's all wonderful.   The movement feels so good. It's fluid, responsive. It never feels like the game's fault when you fail a platforming section. Mightily impressive.   Exploring the world becomes joyously quick.   The story is simple, but very well told.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! A better Metroid game than anything Nintendo has put out recently...",
            "review_score": "1"
        },
        {
            "review_text": "I don't play a lot of platformers, so I don't have much to compare to - but this game had a lot of fun mechanics like climbing walls, bouncing off enemies in any direction you choose, etc. This makes it both fun and quite challenging; some of the areas are very, very precise and leave no room for error. I think it might be easier on a controller (?) because my fingers feel pretty un-coordinated at times trying to switch between all the skills you gain to get through areas. And some moments are incredibly frustrating (flooding tree anyone?) where I died an embarassingly large number of times before getting through it. However, when you do get through it, or gain a new skill to explore an area you couldn't before, it's pretty satisfying.  Game mechanics aside, the visual and musical appeal of this game are excellent. The story is pretty simple but still touching. I probably won't end up replaying it and would say If you can get it on sale, definitely worth trying.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome graphics and music, atmospheric gameplay, very enjoyable and quite difficult, highly recommendable!",
            "review_score": "1"
        },
        {
            "review_text": "Beutiful game and great story so far. It almost make me cry at the beginning",
            "review_score": "1"
        },
        {
            "review_text": "Definitive Edition features additional content which adds a little to the story and gameplay. If you haven't purchased the original, this one includes all the content from the original game. If you have purchased the original, you honestly won't miss much.  Having said that, I love this game so much. So much so that I chose to show my support. This is what games should be about; a work of art. The music, fantasic. If you haven't bought the soundtrack, it is worth it. Gameplay, fun. Very much like old-school metroid. Story, tugs at the heartstrings. Graphics, who cares? But, great indeed.",
            "review_score": "1"
        },
        {
            "review_text": "Top.",
            "review_score": "1"
        },
        {
            "review_text": "You died. You died. You died. You died. Ori and the Blind Forest: Dark Souls Edition.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so beautiful and well designed. Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I usually don't like platformers but this one was addicting til the very end.  Just like a used needle from you uncle's pedophilic trap house. Minus the hepatitis C and Repression.  Must Buy!!",
            "review_score": "1"
        },
        {
            "review_text": "Classic version with new areas, abilities and soundtrack. What else to say?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platform-adventure games I've ever played. The art direction is outrageously good. The music is superb. Controlling Ori, especially after a few key powerups, is a joy. Highly recommended to anyone that likes platformers, art, and animation.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "An absolute masterpiece, for a first game, this isn't that bad! PROS -beautiful art style -fantastic parkour -well done skill tree -beautiful story -phenomenal art style -fantastic art style -twenty more points just saying 'Great art style' -awesome soundtrack  CONS -soundtrack is OP, nerf it pls -graphics are also OP -story is OP -Bugs, I once fell through the floor, skipping at least 30 million generations of gameplay    Summary of the game, SPOILERS INBOUND, ♥♥♥♥ OFF IF YOU HAVEN'T PLAYED IT YET, I MEAN IT    Ori and the Blind Forest: Definitive Edition is a phenomenal, fanastic, beautiul, and other similar words Masterpiece, I fell in love with the game ater 2 seconds of looking at the title screen, *sped up scpeech* and the Ginso Tree part, OH THE GINSO TREE PART! the water was rising up, and ori got hurt ONCE, I pressed escape (Pun not intended), and set the Sound Effects to 0 and the BGM to maximum, and sat there, before this bit I had ~50 deaths, and when I actually started doing Parkour, I had 1000+ and if that doesn't tell you how OP the soundtrack is, I don't know what will.",
            "review_score": "1"
        },
        {
            "review_text": "Really looking forward to playing this through again with all the refinements. It was amazing the first time, and not it's even better. If you like MetroidVania style games with great platforming and puzzles, a good narrative, and you haven't checked this out yet- you really, really should.",
            "review_score": "1"
        },
        {
            "review_text": "Best use of my money since I bought the original game for full price. Seriously. Gorgeous.",
            "review_score": "1"
        },
        {
            "review_text": "The visuals, the soundtracks and the characeters... I'm in love.",
            "review_score": "1"
        },
        {
            "review_text": "The best and most visually-stunning Metroidvania game on Steam.   Child of Light and Ori should make a collaboration someday.",
            "review_score": "1"
        },
        {
            "review_text": "The original version of this game was great, and replaying it with the added sections is still great. Not quite as good as it could have been for an addition, but it doesn't downplay what it had before, which was a simple story, elegantly told with gorgeous music, stunning art, and difficult, but fair gameplay. This one's a doozy, but be prepared to work for your good ending.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game. Amazing Music.  It has some great emotional moments that makes you both Joyful and Sad. A Game of the Unexpected but finishes with a Joyful ending! This is a remastered verion with more content! Overall, this is one of my top favorite games in my library. (Played around 2,500 hours+ of the music of this game within my Itunes Library!)",
            "review_score": "1"
        },
        {
            "review_text": "Great music and gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "I had the chance to try out this game at the EMP Museum in Seattle and was impressed, so bought it here on Steam. It's a metroidvania style platformer. It has stunning visuals and a great soundtrack. The gameplay is awesome. Seems easy at first, but gets quite difficult as your progress. Tons of fun. I highly recommend it. :)",
            "review_score": "1"
        },
        {
            "review_text": "I played the original and loved it. This adds alot to the game and makes it more enjoyable. However the game is noticably more buggy and slower the orignal version, mainly cutsceans. I do hope they fix this soon.",
            "review_score": "1"
        },
        {
            "review_text": "There is one life challenge in this game.   It actually means your life trying to accomplish it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games in my whole life",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable Metroidvania platformer with tight responsive controls and fun abilities, albeit a little on the short side.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very and very well made platformer with unique ambience and a story of kindness! 8) 11/10",
            "review_score": "1"
        },
        {
            "review_text": "  I received this game as a birthday present. It is a visually stunning, musically profound video game with tight controls and a compelling story. The sense of motion and flow within the game is sound and a tad bit addictive. Almost every upgrade atainable in the game feels meaningful and useful in helping you traverse the rich world presented to you. ^_^ Love this one.",
            "review_score": "1"
        },
        {
            "review_text": "just another good review for a really good game 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "well polished",
            "review_score": "1"
        },
        {
            "review_text": "Simply Amazing. OST 98/100. Story 99/100. Gameplay 89/100. Characters 93/100.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best platformer games I have EVER played, the graphics are great and the story just sucks you in.",
            "review_score": "1"
        },
        {
            "review_text": "My Best of Best!",
            "review_score": "1"
        },
        {
            "review_text": "Everyone seems to love this game, but it just didn't come together into an enjoyable package for me.  The introductory sequence (about 20 minutes or so) made a very poor first impression. The movement during the 'interactive' opening is painfully slow, and the attempts to get me emotionally attached to the characters were not effective.   When one of the characters dies, you are treated to flashbacks of the two characters' key moments together, things that you actually just did 3 minutes prior! These types of flashback scenes work 40 hours into an RPG, where you do get the feeling of 'old friends'. They don't work in the first 20 minutes.   I stopped caring about the story here at the beginning, and nothing thereafter made me re-engage.  The few characters who speak in this game use a synthetic language. The little sprite that follows you around is cute, and has a lot of variety in his/her different sounds. The problem is the deep-voiced narrator. From the intonation of his phrases to the individual pronunciation of syllables, he sounds exactly like Jabba the Hutt. No joke, it is either an intentional homage or the creators were unaware of the influence of Return of the Jedi when they thought they were creating original sounds. It is very distracting and you can't take anything he says seriously.  The combat is unsatisfying and consists primarily of mashing a single attack button when you are somewhat near an enemy. This is because attacks auto-target foes; you don't even have to be facing them. Fortunately combat is not a major part of the game.  The music seems good at first, but most zones are quite large, with the corresponding music tracks on a relatively short loop, and they get old fast. The artwork and animations are beautiful, no problem there.  Don't let the colorful palette and cute characters fool you; a handful of sequences are extraordinarily difficult. These catch you off guard because the majority of the game is very forgiving as far as the basic platforming and combat goes. Then every so often (  the major story events and the end-game sequence  ) you will hit sections where the spikes in the challenge level are abrupt and extreme, where you will be required to exhibit near-perfect timing and repeat long sections over and over until you get everything right. The game was reminiscent of something like Super Meat Boy at these times. I have a hunch that many people enjoyed the game up until   the water tree section  , and that was the end for them.  Platforming and exploration follow the Metroidvania style where you find power-ups that expand your techniques for moving about the world. But a lot of the treasures you can backtrack to get aren't really worth it (too many of them are just experience globes) and there is really only one main path forward as you gain each new ability.  There are some cool stages in this game, like the one where certain parts of the floor and walls will rotate the orientation of your directional movement and jumps. It's hard to explain and best experienced on your own. That is, if you can make it past   the water tree part  . :)",
            "review_score": "-1"
        },
        {
            "review_text": "I'm afraid my overall experience with the game has been far too negative to warrant a positive review.  First off: the good. - Graphic: The game is visually stunning, smooth and very pleasant to look at. - Sound: The soundtrack is spot on and all audio effects are great.  The bad. - Story: For what i've played, the story of the game is ridiculously bland. [Minor Story Spoiler]   You start off as a white leaf in a stormy night, you fall off and you turn into a child. A forest creature takes care of you. You see the pair eating fruits until nearby trees run out, your newfound mother dies of hunger just as you bring home enough fruits for a few days, so you depart. You die, but by dying you are brought back to life because the ancient tree you initially fell from has put all its hope into you. Eventually you reach the tree but a giant black bird decided to steal a glowing orb inside the tree and threw it away, now your job is to find three stones and bring them to three different places to restore order to the forest.   Now, in my eyes this is a very, very boring storyline that exists mainly to justify your adventures. If you disagree, which is absolutely fine, try to tell any friend or person you know what the game's story is without having them laugh or be left extremely confused.  - Gameplay: Frustrating and tedious, put shortly. The game feels like a mix of Super Meat Boy and Metroid, as in you roam around from point to point across multiple obstacles with a certain degree of difficulty involved, while you will eventually find statues that give you additional abilities and with a bunch of side pickups if you're interested to hunt for them.  Now, unlike SMB and metroid, Ori and the Blind Forest doesn't do a great job at telling you what or where are threats; this is caused by graphical clutter (as you may find enemies completely covered by the foreground) or by using different colors: initially purple means bad, which makes sense and helps recognize threats immediatly. Eventually you may find differently colored threats that are hard to recognize quickly (mostly due to the graphical clutter, again).  So you died...it will happen, especially as there are a few areas where the developers want you to die at least that one time, and you'll find yourself back to your save point. Where is the save point? It's wherever you want! You're in charge of placing checkpoints! While this seems like a great design choice at first, it turns out to be fairly tedious after a while mainly because you do not know what you will face next. To create a checkpoint you'll need one unit of energy, which can be found in blue crystals scattered around the scenery, no energy = no checkpoint. If you save sparingly enough, then you will always have a few units of energy to save pretty much anywhere, however the game does a very bad job at telling you when you should create a checkpoint. Initially you'll find a crystal in locations where saving makes sense, which is how it should work, however after not much time you're left on your own in this regard, causing you to potentially save in terrible places or not save after you've been smashed by a falling rock, causing you to repeat a portion of the level.  Speaking of repetition, just like in metroid you'll notice there are a few areas you can't quite reach yet. Most of the times they aren't subtle at all and they serve as a reminder to come back once you unlock the ability required to reach it, which means you are bound to backtrack your steps. Most times those areas are accessible after jumping past various obstacles, which is fine, however it may happen that you go through all obstacles just to discover you need an extra ability just to reach that sweet sweet power up, essentially removing the prize after beating the challenge.  Now, while roaming around and defeating enemies you will eventually be awarded an ability point, which can be used to improve your capabilities. In the definitive edition this system is a tad flawed: the 4th upgrade of the 3rd skill line (yes, the skill tree is made of three lines) is a bonus to an ability you unlock at the end of the game and you must get it in order to access other upgrades in that line, which is a TERRIBLE design choice (this isn't an issue in the normal version of the game). Of course there will be more upgrades for this new ability which will, obviously, be in between the ones you may want, instead of being at the end of the line. Because reasons!  You should buy this game if you don't mind frustrating games.  TLDR: a mix of super meat boy and metroid, visually stunning but frustrating gameplay and bland storyline.",
            "review_score": "-1"
        },
        {
            "review_text": "I would recommend this game if bash wasn't bugged out.  Bash is supposed to launch you when you bash an enemy or lantern but I get 2 working launches out of 5, the other launches don't actually  launch me. Im stuck in the first position I tried to bash in. This makes  the finales of certain areas almost impossible, unless luck, chance and alot of smashing the keys gets you out of them. Because Bash simply wont launch Ori at all.  Im hoping they fix this, I first thought I was doing something incorrect but every gameplay I've watched of someone bashing, they do it same as me and get launched.   Another negative is how easy it is to get stuck in an area. I've seen many complaints in other forums about being stuck, if so many are getting stuck and the game becomes a slow brain melter of an experience the beautiful graphics really lose their touch because you don't get to run through the game and actually appreciate them.  Each new area just becomes another brain melting task and  you begin to loathe it rather than want to master the level and enjoy it.  That said I didn't give up, little more than 50% into the game and the bash is slowing me down the most. Just want the ability to actually work.   7/10 ,, had bash worked for me, a good 10/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful. Solid. Fun. All those words aptly describe this game.  For the first 30 minutes or so. Then the novelty wears off and the difficulty ramps up. One-hit deaths everywhere. Enemies with attacks so bright and flashy that I lose track of my character. Jump mechanics that are so floaty I constantly miss my targets.  And that save system? I thought I'd enjoy saving wherever I wanted. When I saved right before a cutscene and either had to rewatch it every time I died, or waste energy saving five feet from where I was, I realized I didn't really care for it.  I got this because I love Metroid and many of the games that aspire to it. The map, mechanics, and upgrades all make Ori SEEM like one, but it's not. It's so not. Those games are about exploration and puzzle solving, not twitch reflexes and endless restarts.  This is literally the most frustrating game I've played in years, and I'm including 30 hours of Dark Souls 3 in that. After the third ragequit, I remembered that I don't actually have to play this. I think my blood pressure will be better off.  Honestly, now I'm kinda ♥♥♥♥♥♥ at all the people who raved about this game, making me play past the two-hour refund line looking for the fun they promised.",
            "review_score": "-1"
        },
        {
            "review_text": "Great art and music. I would recommend this game on art and music alone.   Great fitting story. The story is simple. I would say it is slightly more complex than other platformers, but not as complex as most RPGs.   Poorly tuned default difficulty setting for certain parts of the game: * Time trials are significantly more difficult than rest of the game. Due to the savegame system, once player enters a time trial, they cannot leave it making the time trials a blocker to progress.  * Game has a special savegame system that use a unlockable renewable resource, progressing towards endgame without unlocking enough of this resource with 'side quests' (optional sections) makes the game significantly difficult. Difficulty can be reduced by acquiring unlocks; however, knowing when to invest time to do the optional unlocks is clear to a first-timer.   Unplayable with keyboard. Keybinding overlap causes certain actions to be difficult to excute in succesion.",
            "review_score": "-1"
        },
        {
            "review_text": "The developers of this game could write a book on how to make a game needlessly tedious and how to suck the joy out of something that's supposed to make you happy.   I'm at the water tree escape sequence and this is just a chore. Remember when games were fun?Pepperidge Farms remembers.",
            "review_score": "-1"
        },
        {
            "review_text": "Well... It's not that good.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "I mean what can I say that hasnt already been said? This game is phenomenal I plaed the original when it came out and what they added to this is subtle but very nice realy well done additons to an already beyond fantastic game. If you havent played ori before Buy it now you wont regret it particularly with an easy mode if ur not a big plat former but want it for the story and art defanlty get it. If you already have the origanal its more than worth the 5 dollars if you are a real fan of the game and if you are a big fan but didnt notice this game till after the promotion id still say buy it, it is amazing nice quality of life changes",
            "review_score": "1"
        },
        {
            "review_text": "+many upgrades for the character +Checkpoint freely selectable +beautiful graphics +lots of action +cool story +and more great stuff :)  I definitely recommend this game!!",
            "review_score": "1"
        },
        {
            "review_text": "I´m not crying, there´s something in my eye.",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric and generally fun to play, I beat the game in one session. It has a great soundtrack and amazing artwork too",
            "review_score": "1"
        },
        {
            "review_text": "A great update to a fantastic game that adds content do provide some more character backstory and makes it so the completionists among us don't have to sorry about locking themselves out.  Other than that, it's the same great Ori that it's always been- beautiful hand-painted backgrounds, a haunting soundtrack and a touching story. Oh, and razor-sharp controls combined with dexterity requirements that will make you earn your ending. The game feels like it almost expects too much of you in parts, then as you get more abilities and hone your skills it becomes a pure joy to play as you effortlessly perform acrobatic manoeuvres that looked impossible only hours prior.  Fantastic experience, highly recommended, just remember to bring a tissue.",
            "review_score": "1"
        },
        {
            "review_text": "One of the few platform games I have enjoyed.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing visual treat! One of the best Metroidvania games of the 21st century. This game has spot on controls, an awesome artistic design, a wonderful soundtrack, and a fantastic story! You're missing out on a very fun and beautiful adventure if you don't try this game!!!! Highly recommended!!!! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "An emotional tear-jerker of a game with beautiful animations, amazing music, and a riveting story. This is a must-buy for any fan of platofrmers.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most gorgeous games I've ever played &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics and awesome gameplay. One of those games you actually try to lean left or the right depending on where you jump. Havent done that since I was a kid in Mega man.",
            "review_score": "1"
        },
        {
            "review_text": "After the success of Ori and the blind Forest, Moon Studios release the Definitive Edition of Ori, a subtle addition to the original game that doesn't detract from the original. It takes what made Ori great and added new movement tech and a new area to explore as well as some additional story involving Naru. If you played the original and loved it, then it's definitely worth it to pick up the Definitive Edition to relive the fun.",
            "review_score": "1"
        },
        {
            "review_text": "As I said from old version (Ori and the Blind Forest) :  ' Ori and the Blind Forest is the most amazing plataform game I ever played , open world but with some 1 time 'instances', beautiful and well design world, the skills are all related and are amazing , when you experience you can't stop playing '  New version have (Ori and the Blind Forest: Definitive Edition) :   + 2 new skills  + 1 additional zone  + You can access at any zone any time + Better Graphics and much smoother gameplay",
            "review_score": "1"
        },
        {
            "review_text": "very good game, very recommended buying",
            "review_score": "1"
        },
        {
            "review_text": "Several playthroughs. Still one of my favorite games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely stunning. Jawdropping visuals and heartbreaking story tied together with slick and responsive platforming controls. A must play for every gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Even if you already own the original, this edition is worth getting just for another excuse to play through this beautiful game. Plus the additional content adds to and expands the game nicely. This game is still absolutely amazing. Gorgeous visuals, an adorable main character, an outstanding soundtrack, and great (though sometimes frustrating) gameplay all mesh together into a near perfect game.   If you've ever wanted to feel like you are playing a Studio Ghibli movie, then this game is for you. Also, I HIGHLY recommend playing with a controller. It is playable with keyboard/mouse, but some things, like aiming some of your abilities, are much easier to do with a controller (I played using an XBox 360 controller).   Great, beautiful game. Get it! :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far one of the most amazing platformers ever made. Absolutely beautiful art, fluid gameplay, excellent music, moving story, and everything else you could want. It is superior to everything else made in this genre in everyway. A must own game for anyone who likes platformer games.",
            "review_score": "1"
        },
        {
            "review_text": "I consider this game th best platformer and metroivania i have played in years, i enjoyed this game so much after i finished it i went looking for similar games but couldn't find anything i liked as much as this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a wonderfull blend of art, music, and story. The game was enough to captivate me through several playthroughs.",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of the best stories I have ever played. It has both happy and sad moments in the story line. Apart from the story this game also has amazing gameplay. It slowly introduces you to more and more abilities which allow you to travel to new parts of the map. Every ability is fun to use and the game stays challenging especially the final stages. If you like platformers and need an amazing game, play this game. I would recommend it to every type of gamer.",
            "review_score": "1"
        },
        {
            "review_text": "21/20  That's all  Enjoy the game",
            "review_score": "1"
        },
        {
            "review_text": "A hugely satisfying experience. Finished my first playthrough and i find my self eying up the insane no-death achievement with a suprising amount of enthusiasm. And inside wrapped up in a beautiful story. 5/7, would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the prettiest, most full-featured metroidvania I have played in years. I could just play it over and over, the fluid way the PC mvoes through the game world is beautiful. Great music, too.",
            "review_score": "1"
        },
        {
            "review_text": "I don't play platformers, but this game is extraordinary. Pure beauty and amazing gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Bought the first one. Bought the definitive edition. Played them both. No regrets.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, touching story and i wrote this review to get the award badge :D",
            "review_score": "1"
        },
        {
            "review_text": "I'm not crying theres just somethingin my eye",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good i've spent more than one night just looking for more games like it, sadly I've turned up short so far, one of my all time favorite games",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even if you're not super keen on metroidvanias. Gets pretty damn challenging in certain sequences.  On the definitive edition, I wasn't expecting such substantial new areas to be added. $5 extra on top of the game is easily, easily worth it. When you find it, if it seems too tough at first (like it was for me), come back later in the game when you've got some more meat on your bones. Having said that, the earlier you complete it, the better off you'll be for the rest of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Ori means Original. That mean you should buy it with Original because it's worth to be bought than having it with crack things that could contain some viruses or something that make your PC lagging. The game was simply amazing and ideal playing with your family especially your children who love playing game. Because like what I said before It's worth to be bought with legal and ORIginal.",
            "review_score": "1"
        },
        {
            "review_text": "Ori and the Blind Forest is a beautiful game that combines a beautiful soundtrack, stunning graphics and aesthetic, and most of all challenging and enjoyable gameplay to create an experience.",
            "review_score": "1"
        },
        {
            "review_text": "Ok. I'm impressed. Back in whatever year this game released (2014? idk.), I heard of this game, and oh boy, it looked brilliant. But, I didn't really have the time to play it. So, now, one year and something months, I have 100% this game.  STORY MUCH?: (POSSIBLE SPOILERS AHEAD. VIEWER... what? not that. READ IF YOU DARE.) So, there is a tree. A big one. (this game isn't teen rated, shut up.) The tree is named the Spirit Tree, and there was once a big storm that wooshed away one of it's inhabitants, Ori. Later, after the storm, Ori was found by a... (you know what? Go play this game. That's enough non-spoiler-ish story for you.) PROS: -Cute main character. -Puzzling at a non-massive difficulty rating. -Some similarities to a game I know of. -Easily 100% on this game. -2 extra levels on this edition. -Get both the original and Definitive Editions if you buy the Definitive Editon.  IN BETWEEN PROS AND CONS: -Feels, bruh.  CONS: -Some bugged achievements. -One Life Mode. Sentence says it. -Diffculties are only on this version.  This game gets a... 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Its an amazing game, it has amazing OST, amazing visuals, amazing charactors and an amazing story. If you already own the game, its not worth picking up unless its on sale as it only has a few more content thats new, or unless you wanna play it again (like me) or if you havent played the game yet, start here, it basically has things that SHOULD have been in the original game (like teleporting to areas, re-visiting areas etc) but for some reason or another was not in the original game.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the best platformer ever.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the most captivating games I've ever played. The graphics are gorgeous, the storyline is awesome, and the gameplay is so much fun. Highly reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I own both games. I've just throughly beaten the Definitive Edition and I do enjoy it, though there wasn't too much added. If feel like obsticles that use the new powers should have been added into the final level and all around map and not just the new part of the map. There also was a few times where the camera wouldn't follow the player, almost breaking the game. Was the Definitive Edition needed? Honestly no, I feel like a sequel would have been a better bet to make rather than just a smaller edition to the map. I will say Naru's backstory was well done in spite of everything, I did enjoy it as it made me connect and feel for the character more in a more touching way on par with what was done in the beginning. All in all though, if you don't have the orignal edition, you should buy this one. Those who already have Ori and the Blind Forest, you aren't missing too much.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful, stunning action-platformer that does Metroidvania better than Metroid or Castlevania.  Pros: Tight, speedy controls, fast-paced gameplay. Rewarding sense of exploration and discovery. Breathtaking visuals and awe-inspiring musical score.  Fun abilities that are difficult to master. Player feels like a platforming god by the endgame.  Cons:  Can be frustratingly difficult at times. Manual-ish save system is brilliant, but can set you pretty far back if you forget to save or have a tough time managing energy.  Overall 9/10. If you love 2d platformers, I STRONGLY RECOMMEND this game.  *A gamepad is almost necessary to play* ",
            "review_score": "1"
        },
        {
            "review_text": "absolutely gorgeous.. a magical game. Feels like studio ghibli movies",
            "review_score": "1"
        },
        {
            "review_text": "10/10 A masterpiece, best 20$ I ever spent, beat many AAA title in my book Make me cry in the first 9 min and the ending  I never thought I can find a masterpiece in today's gaming, simply we're overflooded by options, but Ori is a damn masterpiece  Great gameplay, tight control, very very good level design. I died about 300+ in one playthrough but never feel unfair from the level design, it is all about my sloppy fingers.  There is one escape sequence in the game, you know, standard platformer stuff, something chasing you and you have to get out of the way, I dead 50+ there but there was the greatest experience in my gaming life, I was very tense at the time but I also realized I was smiling all the way, the action combined with the music and aesthtic...hooked me on so damn much...Never had a game gave me such feeling  Ori and the Blind Forest is just a phenomenal game in every respect.  I just can't recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game.  The new abilities feel fluid in the rest of the world. The new area maintains Ori's defining beuty and haunting story. Additional difficulties for those who found the original too easy or too hard and for the insane (one life mode). Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "[Four Hours In] Ori and the Blind Forest is an exceptional 'Metroidvania' style game. ► Graphics 10/10  The graphics are crisp and vibrant. The masterful use of layers in this 2D platformer has blown me away. The animations are fluid and diverse.  ► Game-play 10/10 The control of your character feels spot on. Character progression feels substantial as you find new abilities and augment them with the skill tree. Not once has exploration felt repetitive. The clever level design, creatively scripted events and unique sights will keep you moving forward. Not to mention all of the secret areas and hidden upgrades.  ► Story 10/10 Perfectly simplistic. The first 15 minutes sets up the world and the stakes. This beginning sequence is surprisingly emotional for how quickly it passes.   ► Overall 10/10  I'm four hours in and everything about Ori and the Blind Forest is great. If you are into open-world platforming or the'Metroidvania' genre you won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Already have the original but I had to buy this and play through it again as it is my favourite ever game, I loved every single moment in this game. The soundtrack is still amazing to listen to no matter how many times I play. It is on sale at the moment for £3 which is incredible. Everyone should play this game! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ever since I heard of this game (the original one), I knew it would be a game I would love, and I was right. It took me a long time, but I finally played it after over a year of buying it, I didn't have a computer that could play it at the time. But now I got a gaming laptop, I7 Processor and GTX970 graphics. The original game played just fine, no lag whatsoever. But now to get to my point. This Definitive Edition. For some reason, I'm experiencing lag during cutscenes and events. Which I can't see why because I'm using some of the best hardware to play this game... Is it a possible bug? I didn't have any issues with lag in the original game at all. Anyways. This game is an absolute gem. Possibly one of the best games out there in recent times. It has everything you need, amazing gameplay, animation, graphics, story, characters, etc. One of those games that defines that video games can be art too.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed playing this game, worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Amazing Graphics. the platforming is great with smooth controls, combat works great. The story is interseting and keeps you wanting to know more.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game all around. Fantastic story, gameplay, art, and music. Well worth more than it costs.",
            "review_score": "1"
        },
        {
            "review_text": "NICE MUSIC AND ATMOSPHERIC 2D PLATFORM GAME",
            "review_score": "1"
        },
        {
            "review_text": "Must play, brutally challenging and very rewarding experience",
            "review_score": "1"
        },
        {
            "review_text": "What I love most about this game is the beat and the look and feel of it. It's truly awesome, and it almost made me cry in the first 5 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Such a amazing game in every way!!! Have to get it! Its My fav! &lt;3 ",
            "review_score": "1"
        },
        {
            "review_text": "EZ PZ, just kidding really makes you think about the puzzels.",
            "review_score": "1"
        },
        {
            "review_text": "Best metroidvania I've played. Amazing art style and graphics. The abilities you unlock allow for quick and fluid travel through the environments preventing backtracking to pick up collectibles from becoming a chore.",
            "review_score": "1"
        },
        {
            "review_text": "Ori &amp; the Blind Forest is a beautifully crafted platformer meticulously detailed with one of my all-time favourite video game music scores. It teases the player into a mystical and magical forest corrupted by an unknown evil with you controlling a little sprite like creature in its quest to restore natural order.  The game opens up gradually with each ‘level’ granting the player a new ability which allows them to reach previously unlocked regions in the game. Puzzles are well thought out and very challenging at times meaning there are a lot of re-tries until you are able to get it right. Some gamers love this trial &amp; error rinse &amp; repeat style of gameplay and can find much gratification in ‘perfectly’ navigating your weak little sprite through a perilous area (in a similar vein to Super Meat Boy) however other players, like myself, can find such repetition tedious and detrimental to the pacing of the story. All in all if you are a platformer fan, and enjoyed games such as Super Meat Boy you will love this well crafted game. If you aren’t, I still suggest giving it a go but brace yourself for some tedious parts of trial &amp; error resets until you can complete certain sections. ",
            "review_score": "1"
        },
        {
            "review_text": "intro is sad, would cry again",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game. It's visually appealing and unique. The story concept is really captivating. The gameplay is challenging, but yet metroidvania-simple. It makes me think of  FernGully: The Last Rainforest (1992)  meeting  The Secret of NIMH (1982) , coated in an Anime style.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best game i have played in a while. The artwork, animation, and story telling rival some of my personal favorites. The gamplay is a lot of fun and you can move through the game at your own pace. Overall the game is very well made. I highly recommend play this title as it gives you hours of fun. This game is more than the trailer advertised loads more in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer. Love the art. Lots of clever skills and the world layout is well done (so far). This feels like a hyrid of Zelda and Mario (pre 64) if you'd like a crude comparison. The 2D world is 'open' like Zelda (it doesn't end green sewer pipe to green sewer pipe), and new areas are unlocked/opened as you acquire new skills, or they can alternatively be unlocked by some other interaction with the mobs or environment. You have a progression of skills/feats likes Zelda, but you don't have equipment. There are no partitioned zone loads.  I'll probably be losing my fantasy football playoffs because of this game assuming the play time is around 20-30 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully FUN FUN FUN!!!",
            "review_score": "1"
        },
        {
            "review_text": "I must fully admit, I truly loved this game... Fantastic story and amazing visuals to boot, fun and challenging gameplay and a great OST. It only took a few minutes for me to become attached to this game, and It was honestly one of the best games I've played in a while.  Sincerely one of my favourite games, and the best puzzle platformer I've ever played. Great job Moon studios, truly.",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game when it came out but i was like meh not my style... then got it on sale and... even bought controller for it! its beyond amazing, the game story line...wow gameplay? OMG bring back memories from 90s when you actually were about to figure out how thing works and how move on to next stage... and yes i cried too LOL why its sooo sad? :( 100/100 one of the best game in history i think, great job! finished game and i want more levels ORI 2 plzzzzzzzzzzzz or expansion and dont make it that saaad :( or do it i dont care it was awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I'm about ten hours into the game, and I estimate I'm about halfway through while going at a casual pace. This game has made my eyes watery on multiple occasions for no particular reason. I already know I'll give it a second playthrough, not so I can find all the secrets I've missed, but to re-enjoy the overall aesthetic and atmosphere.  This game is the complete package. The art style is amazing. It's truly tough to distinguish the player, enemies, and other interactables from the background and landscape. This may sound frustrating, but in this game it's actually a really good thing. That's because the world feels cohesive and intertwined. The sound design and music is evocative and emotional, somewhere between orchestral and Tim Burton-esque with a subtle Eastern feel. The gameplay and controls feel solid and intuitive.  'Ori' is as adorable as it is punishing. The puzzles and challenges are engaging and exacting. You find yourself being really creative with your abilities. The story has an epic feel - though you have neat powers, you really feel like a tiny thing in a large, mysterious world. The mechanics are everything I'd expect in a Metroidvania game. I've been telling everyone I know who plays games to check this one out.",
            "review_score": "1"
        },
        {
            "review_text": "A beatiful game that gets platforming right. The escape sequences were some of the best platforming I have ever experienced, especially the first one. The music and visuals were both top notch. Most importantly the controls were perfect and I would only die to pressing the wrong button and not because I couldn't get a mechanic to work. The game isn't super challenging, but it takes some trial and error in some places. I probably should have played it on hard for my first playthrough. All in all it took a little over 9 hours to complete the game and get all the secrets.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning artwork, soul soothing background music, and simple yet challenging at times gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this version just to support the devs ... also bought copies to gift to friends.  You simply cannot miss out on this masterpiece.  Review: Open the menu &gt; starts crying play through the intro &gt; uncontrollably weep play through all chapters on hard &gt; tears of frustration well up due to hardcore platforming finish the game &gt; shed profound tears of joy and gratification ... as you've just tasted one of the most beautiful and sublime masterpiece made in recent time.  10/10 would shed grown-♥♥♥ man tears again.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers of all time, the animation is just gorgeous.",
            "review_score": "1"
        },
        {
            "review_text": "Kuro needs a hug!",
            "review_score": "1"
        },
        {
            "review_text": "Truly Fantastic game. You can tel that Moon Studios put a ton of love into every aspect. The graphics are beautiful, the soundtrack astounding, the story well paced, and I encountered zero bugs. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "impressive soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "One of the most amazing games there are. Smoothest controlls of all, and the level desing is simply perfect.",
            "review_score": "1"
        },
        {
            "review_text": "I'm gonna give credit were credit is due. I actually feel bad for getting this games on sale. Other then a few nit-pick issues this was overall a 9/10 game. The remaining one(if you disagree feel free to hate) belongs to 2 things and these are my personal opitions here. 1. would be the skill tree in the case of the air dash(mastered it before I could dash and made me think I could do it before I had the skill). 2. would be the button scheme, in the heat of the fast pace event, it's super easy to forget which button does what(nit-pick here: also needed to press and hold charge after use). Other then these 2 things it is an overall all great game from the story, to the breath taking scenery, and even the Soundtrack it makes it hard to think the UNITY program had anything to do with it. On sale or not it is a must game game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Some of the platforming though, might be a tad bit infuriating.",
            "review_score": "1"
        },
        {
            "review_text": "easily one of the best games of 2016 the original was amazing but i couldnt stay away once i heard the game ahd more i bought it as soon as i could",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games in recent years and ever better now with the definitive edition, play it, that is all there is to it.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning music, breathtaking visuals, and a heartfelt story. Fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing gameplay and story!",
            "review_score": "1"
        },
        {
            "review_text": " TL;DR: buy the game and the soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "the game is great amazing graphics and soundtrack. You should play it",
            "review_score": "1"
        },
        {
            "review_text": "Great mechanics  Visually stunning Moving story  Satisfyingly challenging   10/10",
            "review_score": "1"
        },
        {
            "review_text": "The movement feels crisp, and new abilities/mechanics are introduced constantly. The music is great, the art is amazing, and the gameplay is polished. The only complaint I have is that the two new abilities introduced in the definitive edition are only really used in thier own zones (as these zones and abilities were added to the game after release). Later zones fully test your mastery of the mechanics, and it would have been nice to have those last two incorporated aswell, especially since light-burst was a really fun ability.   I can't think of a platformer I would rate higher than Ori and The Blind Forest.  Highly recomended for anyone looking for a solid platformer or a metroid-vania that focuses more on platforming elements than combat.",
            "review_score": "1"
        },
        {
            "review_text": "Very amazing game. The visuals, music, story, platforming - they do it all really well. This game will be one of the gems that gamers will remember years down the road.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful. It has amazing graphics and it has the best soundtrack I've had the pleasure to listen to. I played the original game to compleation twice and I am enjoying taking my time finishing this one. I recommend this game to anyone who loves platforming games.",
            "review_score": "1"
        },
        {
            "review_text": "The best 'I'm Not Crying, There's Something In My Eye' game.",
            "review_score": "1"
        },
        {
            "review_text": "a damn fine gem, if you haven't played it yet, make sure you do. and that soundtrack, my god, its amazing.",
            "review_score": "1"
        },
        {
            "review_text": "wonderfull game - i really shred some tears. Everyone should try this game out.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE the BGM, (as my ringtone now) Love the scene, absolutely stunning Love the characters' voice Love the story Reminds me of Megaman X series, my childhood game,   The only downside is you're not allowed to continue to play and get other collectible (if you miss out) after you beat the final boss.  ",
            "review_score": "1"
        },
        {
            "review_text": "Its kinda like one of those games that you get so immersed in the world that you forget you a human. I ain't gonna spoil anything but the ending made me cry, and im not the kind of person to cry at loads of things. Ori and the Blind Forest is an absolute masterpiece and even if its not sale i reccomend you buy it because its well worth its price",
            "review_score": "1"
        },
        {
            "review_text": "The story in this game is amazing... Honestly it is just plain amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely beautiful. It has an amazing soundtrack, the visual style is pleasing to the eye, and the story is one that will really stir your emotions. if you have a computer that can run it, definately get this game.  I had gotten the original game, and getting this Definitive edition was worth it in my opinion. The extra areas aren't excessively long, which helps to keep from pulling you away from the main story, and the new abilities help make the rest of the world that much more interesting.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers ive played in a while, and a very engaging story that keeps you hooked till the end.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers ive played in a while, and a very engaging story that keeps you hooked till the end.",
            "review_score": "1"
        },
        {
            "review_text": "50% autumn sale, reviewed just for badge  10/10 would cry 1st 10 mins of the game",
            "review_score": "1"
        },
        {
            "review_text": "A really good game!!! The story line is so sweet and the game in general is very immersive. Definaly worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game so far, just wow.  I don't particularly enjoy platformers or metroidvania games, but this one is simply exceptional.  Very recommended.",
            "review_score": "1"
        },
        {
            "review_text": " One of the best Metroidvania games ever played",
            "review_score": "1"
        },
        {
            "review_text": "Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Holy mother of platform games... I can say beyond a shadow of a doubt that Ori is my favorite and for great reasons. The soundtrack and graphics are breathtakingly beautiful, the story is fantastic, and you'll want to explore all the things! If I had to give a negative thought on this game, it would be only one - the game isn't very forgiving at times. You don't get much time to master a new move before having to use it in life or death situations. I raged quite a bit for having to restart from the begining of an escape scene (boss level without a boss type situation) and wanted to give up. But after watching two play through videos for comparison to see how they achieved the area, I realized I did very little wrong and while one person's way was totally different from mine, the other was almost identical. I finally got it down and was very much relieved and happy. On my second play through after beating the game on Normal, I attempted a speed run on Easy mode and found they actually placed a checkpoint on one of these escapes. That was pretty cool to know for people who just want to enjoy the game more and rage less. LOL   While I own this game for PC, I should point out that I used my wired XBOX controller to play and I'm sure that made things easier for me, but I also know friends who've played with their keyboards and have done just as well. :)  I really REALLY hope that Moon will decide to make a sequel to this game. I'd buy it in a heartbeat for PC and go wild. My life needs more Ori in it. You will experience all the feels and be begging for more too. Give Ori a shot, shout out your love to the devs, and maybe if we toss enough money at them we will see a sequel sometime soon.   Ori is love, Ori is light, Ori is life.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a cat: cute and highly entertaining, but deep down it's a ruthless and purely evil thing that'll like you better dead.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS GOOD",
            "review_score": "1"
        },
        {
            "review_text": "Such ana amzing game. Ive just gotten it and im unable to walk away!",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game with gorgeous graphics, good sound and fun platforming.",
            "review_score": "1"
        },
        {
            "review_text": "A stunningly beautiful and interesting platform game. Instant classic!",
            "review_score": "1"
        },
        {
            "review_text": "This game is sooo awesome! Amazing graphics! I was emotionally invested like 3 minutes into the game, the story is really well done, the game is magical! 10/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "This game made me cry in the first 15 minutes. It isn't just a simple platformer, its more. It pulled more emotion out of me than any other game so far, and is worth every second.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO TIGHT AND ITS AMAZING AND IT HAS GOOD GRAPHICS AND IT HAS A COOL STORY AND O MY GOD but marios better",
            "review_score": "1"
        },
        {
            "review_text": "Finally got my controller, and am actually able to enjoy the full experience (:  Love it so far!",
            "review_score": "1"
        },
        {
            "review_text": "Eager to play a wonderfull Platform game well Ori is the game! For a platform Graphics &amp; Soundtrack 9/10 If you are nostalgic to Metroid Style games you should try it.  ",
            "review_score": "1"
        },
        {
            "review_text": "I don't normally post reviews, but this game really impressed me. I love the platformer style and they mixed in so many cool combat/player interactions that really made this game so unique and fun to play. The three skill trees all have really cool improvements and abilities that make the game even more fun as well (although I wish there were even more skills!). When it comes to platformers, this game has it all. Great story, BEAUTIFUL graphics, super intense escape scenes, and fun puzzles (and hard bang-your-head-against-the-wall puzzles) that once you finish them, there is such a great sense of accomplishment. The game took me just over 10 hours to beat, and it has great replayability potential as well. There are several different difficulties, including a 'one-life' playthrough option. Between finding all the secrets, beating all the puzzles, mastering the combat, and enjoying how absolutely gorgeous and fluid this game is, I can't choose what aspect I like the most. Great game, cannot suggest it enough.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously the best game I've played in 5 years. As a lifetime gamer, this is seriously amazing.   Amazing soundtrack, perfect game play, great story. The best part is the game play changes per new zone, making it exciting to reach the next zone.   Highly recommended, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, beautiful game. Easy to understand mechanics, but not an easy game either. Great music.",
            "review_score": "1"
        },
        {
            "review_text": "An emotionally charged and fantastic platformer. A movie studio needs to pick this up and adapt it into a movie.",
            "review_score": "1"
        },
        {
            "review_text": "These reviews do not lie. This game is absolutely gorgeous in every sense. The colours and visuals used in the game are absolutely mind-blowing. Coupled with the harmonious soundtrack, this game comes together as a perfect benchmark for any side-scrolling platformer. If this combination of beauty doesn't make you misty-eyed, then the story will. Reminds me of the old N+ in the way that it plays - but with far more abilities and tools to add to the gameplay.   So glad I took a chance in buying this game. You should do the same.",
            "review_score": "1"
        },
        {
            "review_text": "Do you enjoy platform games? Prepare for one of the best you are about to experience.  I was astonished with the beauty of the art, I have fallen in love with the main character and the story behind it. Gameplay is smooth, I have not experienced any cuts or bugs till the end of the game. Very challenging, game force you to be patient and plan most of your moves. I was a bit sceptic about this 'open world' idea, as it is not completely open, it feels like you have mostly freedom during your decisions into what you want to do next.  Pros: Smooth and challenging gameplay Beautiful art Likable character Unique abilities Variety of levels Possibility to still play after finishing the main story “Open world”  Cons: You cannot finish 100% of the game after finishing the main story (some levels are locked)",
            "review_score": "1"
        },
        {
            "review_text": "very beautifull game",
            "review_score": "1"
        },
        {
            "review_text": "I've never been so happy to die 20 times over the course of 5 minutes only to make it to the next segment which kills me 20 times.  This game is pure bliss. The gameplay, the graphics, the sound design and the level design are spot on.",
            "review_score": "1"
        },
        {
            "review_text": "Well.. what can u say about it... it's about perfect... flawless. the soundtrack. the artwork. the ABSOLUTE amazing and perfect controlling.  the only con side i could see is, thats maybe not the right game for people who tend to get frustrated ;) there are some pretty challenging parts in it.  i died 377 times in 11hours. it took me 10h to finish the game and another hour to find alle secrets, powerups and discover 100% of the map. but i enjoyed every single second and since the controlling my little cute cat-like thing is so enjoyable amazing, i can't blame the game for one single death :)  if u don't have it and u like plattformer.. GO FOR IT ! it's worth a full-price. if u don't like plattformer (like me), there is a good chance u like/love THIS one !  5 star rating !",
            "review_score": "1"
        },
        {
            "review_text": "  Wow! Such a beautiful game firing on all cylinders. I missed it the first time around when some early jumping puzzles discouraged me, but I’m glad I stuck with it this time. It really comes in to its own after the first couple power ups. The dash that launches you off of enemies reminds me of the newer Shinobi games and feels great.  The biggest downside is that I can’t recommend it to anyone who would struggle with hardcore platforming. There’s some really tricky parts and found myself getting frustraited at a few of the timed sequences. But if you can manage it you’ll feel like a badass and be treated to one of the best Metroidvanias in years.  Absolutely stunning art and music. The story is a little sappy and heavy handed, but is rare enough in games that it’s kind of nice to have. The way they occasionally blend cinematics into overlays with the gameplay is really cool… I don’t think I’ve ever seen that done before. Kudos to the devs, they really know how to make something special and clearly put in many hard hours.  The secret areas in the version are pretty neat and worth seeking out. It has a little extra story and some fun new abilities.",
            "review_score": "1"
        },
        {
            "review_text": "After much trial and tribulation, upon completion it is suffice to say Ori and the Blind Forest is a challenging and equally beautiful game. It is not a typical plat former and features a diverse range of game-play mechanics which keep you enthralled within the experience. Aesthetically, Ori excels as it has gorgeous and robust backdrops. The puzzles and levels in the game are brilliantly challenging and feature great environments meaning there is never a dull moment. Being surrounded by such vivid imagery constantly throughout game play is a definitive plus for feeling compelled and having a desire to keep going. Every new area always feels new and fresh to play through. The story also adds to the experience and world of Ori as it an emotional one that adds to the tone of the game and makes it that much more of a wholesome experience to invest in. Lengthwise, Ori is around 8 hours but compelling enough and has much to explore making it ideal and never a repetitive experience. Ori and the Blind Forest is a challenging game that is worth playing for amazing visuals, compelling and fun game play, as well as featuring a beautiful story.",
            "review_score": "1"
        }
    ]
}