{
    "app_id": 387240,
    "name": "Steel Rain",
    "release_date": "2015-12-03",
    "developer": [
        "PolarityFlow",
        "Adrian Zingg"
    ],
    "publisher": [
        "PolarityFlow"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Steam Turn Notifications",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "achievements": 82,
    "positive_ratings": 78,
    "negative_ratings": 11,
    "price": 6.99,
    "description": "It's the ultimate, strategic SHMUP ReMix! Control TWO combat wings, flick between THREE different formations, and BLAST your way through overwhelming enemy fleets! Liberate planets, build colonies, research tech and skills, craft items, or even play 2p co-op in this unique new indie game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387240/header.jpg?t=1499866157",
    "minimum_requirements": "OS: Windows XP or above Processor: Intel Pentium 4 2.0 GHz + Memory: 1 GB RAM Graphics: Min. resolution 1280 x 720 DirectX: Version 9.0 Storage: 120 MB available space",
    "recommended_requirements": "OS: Windows 8.1 Processor: Intel Core i Memory: 4 GB RAM Graphics: Geforce or Radeon Gen. 6+ DirectX: Version 11 Network: Broadband Internet connection Storage: 120 MB available space Additional Notes: Gamepad or Joystick",
    "reviews": [
        {
            "review_text": " Summary:",
            "review_score": "1"
        },
        {
            "review_text": "Steel Rain is very enjoyable and mildly addictive, has minor RPG-like elements, and a pure ardace style as well. 5 out of five stars! ★★★★★/★★★★★ ",
            "review_score": "1"
        },
        {
            "review_text": "The first time I played this game, it had it failing but the Devs have fixed everything I hated about the combat system.   Even now the Devs seems to be hearing to people's feedback and fixing anything wrong, so I have nothing to say no to a buy for others looking for a shooter of old.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, if unbalanced combination of genres. It tries to do too many things at once, not quite succeeding or failing, but it has its moments, so I can recommend it, if you're looking for medium-difficulty scroll shooter.  My main complaint is graphics. Often, it is very hard to distinguish bullets, or sometimes even enemies from background. Another thing, this game has a lot in it, but if you missed things in tutorial, it's hard to find explanation elsewhere in then game.",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game, lots of fun, lots of stuff to do.",
            "review_score": "1"
        }
    ]
}