{
    "app_id": 387370,
    "name": "Sol 0: Mars Colonization",
    "release_date": "2016-01-15",
    "developer": [
        "Chondrite Games"
    ],
    "publisher": [
        "Chondrite Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Workshop",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Indie"
    ],
    "achievements": 6,
    "positive_ratings": 258,
    "negative_ratings": 113,
    "price": 2.79,
    "description": "Sol 0 is a real time strategy game where you establish the first Martian colony. From the first human footprints on Martian soil to a thriving and self-sustaining colony, Sol 0 imagines a near future using technology that could be available within the next few decades.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387370/header.jpg?t=1542819325",
    "minimum_requirements": "OS: Vista / Windows 7 / Windows 8 Processor: Intel Core 2 Duo, 3.0GHz Memory: 2 GB RAM Graphics: 512 MB DirectX 9.0c compatible card DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 / Windows 8 Processor: Intel Core i5-3470, 3.20GHz Memory: 4 GB RAM Graphics: nVIDIA GeForce GTX 260, 512 MB or ATI RadeonR7, 512 MB DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Sol 0 isn’t the most groundbreaking strategy/simulation game at this time, but it does provide some enjoyable gameplay.  At this point I do like how the game restricts you on starting your base. You actually have to plan out everything before you decide to send some astronauts to their deaths. While starting out the game can be rather slow, I think it lends a lot to strategically launching what you need to survive. Once you get things rolling it’s just a matter of resupplying until you become completely self sufficient. This is where the meat of the game is, and can be satisfying, and boring to a point. Of course the game will keep things interesting by making EVERYTHING break every 10 seconds.   This leads me to my main issue with the game. I understand this is Mars, and it’s remote, and desolate, and things will happen. However, I hope and pray that human engineering is sophisticated enough to make technology that will last at least a few years without breaking. I would be cool with performing maintenance on things fairly often, but the amount of stuff that breaks in this game is TOO DAMN HIGH! If that’s not enough for you, on normal difficulty the game will make sure you become well acquainted with your new best friends. These friends go by the names, Dust Devil and Meteor Showers. They are like the best friend you really never wanted. They drop by way too often and wreck your best toys before leaving. These are the only “real” issues I have with the game.  Overall the game is well worth what I spent on it. If a little more balancing is done with disasters and stuff breaking all the time, I think the game will be great. I’ve heard a lot of people complain about bugs, but I haven’t had any issues with bugs other than having to issue orders twice every once in a while. ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Graphics are decent, audio is good enough, gameplay is entertaining. Even better, running flawlessly on Linux.  There are lots of interesting things to do, plus the fun of turning obstacles into resources. For instance, you start off with a lot of rocks preventing construction. You could push those rocks into a chasm, but once you build a geology lab, you need to destroy them there to build research points! Nifty gameplay idea.  If you're looking for a pretty simple simulator with lots of theme, then this has my recommendation. On the other hand, I wish it had an 'advanced mode' to add more complexity and more building. Also, I wish I could automate the rovers and extractors.",
            "review_score": "1"
        },
        {
            "review_text": "The poor man's Planetbase. The developer couldn't even be bothered to make a presentable walk animation for the astronauts.  Content is enough for a 5€, so there's that.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played this game a lot. I've tried to love it. I really have. But the idea that ALL structures have to be connected to each other is ridiculous. That's like building a college campus that's one long, connected building. I keep having to move my landing pads and geology labs to accomodate this idiotic requirement. Plus the game needs corner shapes. It's a cool little diversion, but as a serious, long-term contender it falls way short.",
            "review_score": "-1"
        },
        {
            "review_text": "Wasnt sold on this game at first but the more I get into it there is actually quite a lot to manage. I have only played for about 5 hours so far. If you buy this game I recomend starting with out disasters at first, you wont get acheivments but some of the disasters can just totally wipe out your colony if you dont prepare for them which is very disheartening for your first attempt.   That and to take it slow dont try to get a colony of 20 people in the first few launches its going to take you 3 or 4 launches just to start building the very basics of what your going to need.   For $5 I cant see any reason not to pick this game up if you are a fan of the city builder / colony management style of games. The game runs well and does what it says on the box.",
            "review_score": "1"
        },
        {
            "review_text": "This 'released' game is so full of bugs and annoyances, and broken mechanics that it is simply unplayable. No matter how much you try to build a colony, you will only end up wasting your time due to the number of bugs and dumb game mechanics that completely ruins the experience.  This is a released game that feels like a very early access. Considering how small the game is, it would not have been hard to finish it before releasing it in this broken state.  Zero respect for this type of release/sales tactics. Lower price does not mean its ok to sell a broken game.",
            "review_score": "-1"
        },
        {
            "review_text": "Could be better.  Lots of bugs and an ilogic user interface.  Nice try for an indie game, but I would not recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept, but way too simplified. The UI needs a ton of work too, it's clunky.",
            "review_score": "-1"
        },
        {
            "review_text": "Really fun game, really addictive game, really dangerous game. 10/10 would choose over sleep again",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately, the focus on micro and frequent annoying bugs make this a game that I would not recommend.  It's a shame too, because it has a lot of promise from the videos. But unfortunately it just ends up translating into being a pathfinding-helper for your astronauts. And hopeing that a bad event chain doesn't just starvation-spiral everyone to death.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this and Civ Beyond Earth, been playing this...",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Great little game! If you're into RTS this has some unique features, where you have to launch a rocket every 120sols to resupply, it adds a great divide in your RTS'ing!",
            "review_score": "1"
        },
        {
            "review_text": "i didn't want to play this any further :(  +pro: space theme very low price, 5€ 'simluation' aspect  -contra: 'simulation' below average graphics quality bad animations bad textures weird usability  meh...",
            "review_score": "-1"
        },
        {
            "review_text": "Have just started playing this and enjoy it very much. Simple but hard at the same time. Woth it!",
            "review_score": "1"
        },
        {
            "review_text": "So my mind has been changed, I carried on playing and if you can get past having your base destroyed by a tornado this is the game for you :D. its in early access with a thew glitchs but nothing that will make you jump from a high building but i have one funny point, When you go to launch ship number to is it just me or does the picture look like a white ♥♥♥♥♥ :D lol",
            "review_score": "1"
        },
        {
            "review_text": "I do like it....We could have another Banished here. Few bugs here and there but i think with a bit of time and a bit of input it could be a winner.  ",
            "review_score": "1"
        },
        {
            "review_text": "While obvioulsy not perfect in design and structure this game still makes up for it by being an interesting colony builder. In the end though you may prefer to purchas better ironed out games like planetbase or D9 at least until issues with movement and building are ironed out completly by the team at Sol 0",
            "review_score": "1"
        },
        {
            "review_text": "So my mind has been changed, I carried on playing and if you can get past having your base destroyed by a tornado this is the game for you :D. its in early access with a thew glitchs but nothing that will make you jump from a high building but i have one funny point, When you go to launch ship number to is it just me or does the picture look like a white ♥♥♥♥♥ :D lol",
            "review_score": "1"
        },
        {
            "review_text": "Fun sim game, not too huge or expensive. If you like this genre you will like this one.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun Game! Totally worth the $5 price.",
            "review_score": "1"
        },
        {
            "review_text": "First look I thought 'This is oe stupid game. It's sim city in space' so I tried it. Well I admit I wanted to know how this would turn out, but it's hard to play! Not as bad as super meat boy though... However, this take skill to do. Using rovers to find supplies and everything. I will tel you if you like COD speed, this is not your game. However if you can be a little slow, and you like simulators, then this is worth every dime. I don't know. I think this maybe my first loved simulator.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. Although, this game does have some no-game-breaking issues now(2016-01-18). The UI needs some improvement, the notices of disastrous events should be displayed more obvious. Also, the pathfinding system needs some tweaks, or you'll find some unfinished buildings, neither can be finished nor can be destroyed.  Anyway, this is still a good indie game. I quite enjoyed my time in it. And my son likes to watch the blob shaped little astronauts wandering around. Also the dev (I heard this game has a one man team) is still keeping things going on, guess we will soon get some improvement.",
            "review_score": "1"
        },
        {
            "review_text": "This seemed like an okay game, if you like moving around at the speed of a turtle. Yes, I know, there is a speed up time button, but I feared that it would bring my hunger down, so... I liked the ideas though, even though its been done before, I liked the fact I could choose how many supplies I could send up to space, how many people, and so on.",
            "review_score": "1"
        },
        {
            "review_text": "Sol 0: Mars Colonization is a fair little colony management game, especially given its price point. You start out with the basics; sending robot rovers ahead to chart the lands, then a cache of food and water, and if your rovers have struck water, it's time to send an actual astronaut and start building.  From then on, you'll constantly fight to maintain sufficient staff and power and to keep your colonists housed, fed, watered and breathing, all the while battling the worst that Martian weather can throw at you. If you're suffering from overcrowding or feel your colonists deserve it, the airlock is right there. :-p  The build order is largely the same on all the maps, but each map has different levels of resources available, and some lack certain resources entirely - this poses a fair challenge. This is also one of the flaws of the game; some resources are virtually endless (water, methane, ore), but others are completely finite based on the map (clay, gypsum). As the latter two are vital for your sophisticated food supply, the various climate disasters will eventually ensure that your colony will starve as you won't have the resources to develop new food strains to replace what you lose. Still, by then you'll likely have played for ages.  All in all, good value for your money, and a decent pass-time sorta game.",
            "review_score": "1"
        }
    ]
}