{
    "app_id": 387340,
    "name": "Hyperdimension Neptunia U: Action Unleashed",
    "release_date": "2016-03-21",
    "developer": [
        "Idea Factory",
        "Compile Heart",
        "Tamsoft"
    ],
    "publisher": [
        "Idea Factory International"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "Anime",
        "Hack and Slash",
        "Female Protagonist"
    ],
    "achievements": 35,
    "positive_ratings": 2394,
    "negative_ratings": 176,
    "price": 19.49,
    "description": "Choose your tag team and rip through massive hordes of enemies with exciting aerial and ground-based combos. Look out, though - take too many hits and your clothes and defense will end up shredded!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387340/header.jpg?t=1529447451",
    "minimum_requirements": "OS: Windows 7 (64bit) Processor: 3 GHz Intel i3 or equivalent Memory: 4 GB RAM Graphics: DirectX 10.x or OpenGL 3.3 or better graphics card with 1 GB RAM and support for v4 shaders DirectX: Version 10 Storage: 7 GB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Caution: ATI Mobility Radeon HD 5xxx, 1GB VRAM 5000 series, AMD processor may not work properly with this game.",
    "recommended_requirements": "OS: Windows 8.1 (64bit) or later Processor: 3.1 GHz Intel i5 or equivalent Memory: 8 GB RAM Graphics: DirectX 10.x or OpenGL 3.3 or better graphics card with 2 GB RAM and support for v4 shaders DirectX: Version 10 Storage: 7 GB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Caution: ATI Mobility Radeon HD 5xxx, 1GB VRAM 5000 series, AMD processor may not work properly with this game.",
    "reviews": [
        {
            "review_text": "You're probably well-familiar with the Hyperdimension franchise by now. Alongside Compile Heart's most popular RPG series, Idea Factory has commissioned the assistance of various developers, in order to produce spin-offs. It seems like every year, two or more Neptunia games are being released. Are we heading towards complete global saturation? It's too soon to tell. For now, let's look at the first spin-off to hit Steam:  Hyperdimension Neptunia U: Action Unleashed . In the interest of sanity, I'm shortening the title to  NepU  for the remainder of the review.   NepU  is by Tamsoft, the same developer responsible for the  Onechanbara  and  Senran Kagura  franchises. Those games are known for their fast-paced hack &amp; slash action... among other things, but let's not get side-tracked just yet. Anyway, the plot of this game follows Famitsu and Dengikiko, two rival gaming-magazine writers looking for the next big story. Since Gamindustri revolves around the actions of the CPUs as well as the CPU Candidates, you can guess where this is going. Neptunia and company team up to complete quests and slash hundreds upon thousands of monsters.  Fans of  Musou -styled games will feel right at home upon starting this one. Each quest consists of a small arena where monsters constantly spawn. By pressing the X and Y buttons, Nep &amp; the gang perform a dizzying array of moves to decimate these hordes. There are also special attacks as well as HDD transformations for that touch of variety. For most quests, it's best to form a tag-team. Each of the 10 playable characters can team up, so if nothing else, you have Nepgear for backup in case Neptune takes a dirtnap. Your mission is usually some variation of 'kill everything', but sometimes there can be hidden objectives or mid-boss battles. The heroines also level-up and earn monster-medals, which can boost stats and unlock equipment.   Since this is a Neptunia game and it is by Tamsoft, a little somethin' somethin' is provided for the fans. You know what I'm talking about right? Fan-service. Unlike most videogames, clothes are not immune to damage. Depending on the severity of the attack, the ladies can get stripped to their skivvies. This affects HDD forms as well. The loss of clothes can result in more damage, for you as well as the enemy. Visually, getting stripped affects some characters more than others. For Vert's HDD form, her attire changes from 'leaves little to the imagination' to 'Who needs imagination?' In case all of this makes you uncomfortable, damage-immune clothing can be easily acquired.   Overall I think that the combat is fun, but also not very deep. This can be attributed to the lack of difficulty. While the monsters can hit pretty hard, in most circumstances, they'll never get the chance to attack. The ladies of Gamindustri are usually too powerful to be threatened by these pitiful creatures. Their moves have a lot of range, and monsters are easily stunned. When the ladies are transformed, whatever semblance of a sliver of threat that the monsters had slips away. If a quest is giving you trouble, it's probably because you're attempting something that is too high a level. Unfortunately, the level of difficulty never really achieves the right balance. As with the Neptunia RPGs, the challenge of the post-game is in dealing with monsters that have mountains of HP, and are capable of killing level 99 heroines in a couple hits. It might be best to approach this portion of the game with a 'don't get hit' mindset. There are a couple accessories that trade survivalability for increased damage output. Dodging projectiles and other attacks is pretty satisfying, but for the most part, you'll be too busy crushing everything to notice.  Alongside the lack of challenge is the absence of conflict. Unlike the Console Industry, everyone in Gamindustri gets along like chocolate and pretzels. Didn't the first Neptunia RPG start off with the CPUs fighting to the death? I know they're all friends now, but shouldn't some attempts have been made to introduce a rivalry in NepU that goes beyond mild teasing? In the  Onechanbara  and  Senran Kagura  games, you might cut through a lot of mindless zombies and kunoichi, but you also have to contend with rivals. These opponents have abilities that are on par with your own. Aside from an optional and underutilized bonus mode, there aren't any instances where the CPUs and Candidates fight each other.   This to me is the perfect example of a missed opportunity. I've played and enjoyed the three Re;Birth RPGs, and while they're all pretty easy, their storylines feel 'earned'. The characters in these games might have wacky personalities and form-fitting attire, but they also run into problems, argue, and even fight each other. Eventually they rise up to the challenge and defeat the villains that have troubled them throughout their adventure.  NepU  doesn't have any real adversaries, and the big bad boss is only fought twice, in two very lop-sided battles. There isn't even a lame excuse for the heroines to fight each other. Even if it was something petty like Noire accusing Blanc for stealing her quests, it would make for a more interesting story. Naturally, this would translate into a more dynamic game, especially if you had to adopt a second style of fighting, in order to deal with rivals. Perhaps these opponents could have monsters under their control, and... well you get the idea.   The PC port is fantastic. Support for a plethora of resolutions and 60 fps? This game's got them. If you're looking for crashes or major bugs, you'll have to look elsewhere. The load-times are also far better than in the Vita version. I suppose that's to be expected, but it's welcome all the same. While not specifically related to the port, I really appreciate that all of the skits are voiced in English. This wasn't the case for the Re;Birth games, and I found myself defaulting to the Japanese voices, because the silence was irritating.  In conclusion,  NepU  succeeds if you're looking for something different from the Neptunia universe. There are some hilarious moments, and the process of gaining levels and slaughtering monsters is dumb fun. However, this game just isn't designed to remain compelling for a long period of time. Other hack &amp; slash titles, including those by Tamsoft, offer far more depth and content. While this game is just a spin-off, I sincerely believe that more could have been done with it. Even die-hard followers of the Nep-Nep faith should take caution before plunging into this amusing but shallow diversion.    If you liked this review or want to see more recommended games, be sure to follow our curator group:  Follow Original Curator Group  ",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game to anyone who isn't a huge Neptunia fan.   I love Neptunia. The memes, the characters, the flagship titles, all of it. I'm no stranger to grinding but this game takes repitition to a whole new level.   Every single enemy behaves exactly the same. In a crowd of 30 only one will try to attack you. Enemies are damage sponges. The game enables you to sacrifice your defense to spike up your attack and make them managable but naturally you die in one hit. A necessary trade if you want to finish this game punctually.   Most games have hit-detection cooldown. Not here. One enemy can attack you, your character dies and is replaced by your alternate character who also instantly dies from the same one attack mid-punch.  95% of the quests are identical. Slay the copypaste trashmobs in the annoyingly shaped, large arena that spawns the enemies too far apart for you to kill quickly.   The strengths are, like in all Nep-nep games, in the conversations and characterization. It's simply not worth the effort of doing the same mission 20 times to read and listen to their interactions. The grind gets more absurd the further you go with post-game content taking the tedium entirely too far.   Here's a tower with 50 missions you have to do in a row...once you finish it do it 4 more times (at the very least).   Even grinding lilly ranks in this game feels more tedious and arbitrary than usual.  Don't look at this Nep",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I am a Neptunia fanboy, I saw this spin-off and decided to give it a try. And beside all those 'Nep-Nep is in' kind of useless review, I am going to give my two cents on this game.  First, the disappointments. It is similar to some Japanese-style hack-slash games such as Dynasty Warrior from Koei, among them Orochi Warrior Z is my all time favourite game. Unfortunately this games pales too much in comparism to Koei's flagship series.  1. The battle field (or dungeon) size, are you even serious? You have access to all the dungeons from Neptunia and you decide only to utilise like less than 1% of the area of each dungeon? 2. The battle field, just too simple too plain. In Warrior series you have friends cheering and enemies cursing you on battle field, and there are tactics you should follow, be it diversion, infiltration or direct confrontation. Sadly, in this game, you are all alone, there is nobody accompany you. 3. The weapon system, the skill system, all absent. The characters are just about levels, nothing more.  As I was thinking for a refund, I found this game is not all bad. It is strangely addicting. I would try to give a few reason for this, 1. It is simple, yet not braindead. As I thought this game is going to be too easy, I was killed serveral times during the 3rd mission. Blindly go into the stack of monsters and mash buttons at your own peril. 2. Again, it is simple. No need to google or wikia for whatever hidden artefacts, or secret mission, or true ending. No need to worry if you missed some sythesis materials. And, no need to grind. If you feel tired or bored, play a few round of this game feels relaxing. 3. Some design is very interesting. There are missions (or dungeon) where the objective is hidden so you need to figure things out. There are also dungeons where monsters are strong but objective is simple, so the usual 'kill-everything-that-moves' mentality for hack&amp;slash games can get you into serious trouble.  4. Character skills, attacks and HDD are well designed. Many attacks of character also has certain property. Such as Vert's weak attack ending is able to paralyse your foe. It can be a game changer. Uni's weak attack is ridiculously bad, but in HDD, her attack do wonders. Nepgear's HDD weak attack is god like... There are just too much stuff to explore. So again, simple at the same time not brain dead. 5. Actually I would like the main series to use this style instead of the battle followed by encoutering the monster. It is much more engaging and faster-paced. If not, I would like to see if they are willing to improve this spin-off and add more features, to make the game on par with the Wariror series, then this game can be very good, even surpass the main series.  So, verdict? If you're look for a good hack-slash game, run away from this game, the price tells you all. As someone said, there are much better ones out there. If you're a Neptunia fanboy like me, or like relaxing anime games in general, this is quite a good pick, especially on sale.",
            "review_score": "1"
        },
        {
            "review_text": "  - break costumes  - quest level 99 hard difficult one or two hit death  - tournament  - nep nep tower 50 floor  - ost pretty cool  - my score game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I would only recommend this game to people who have played the core Neptunia games and still want more Nep. I just think this game is inferior due to the lack of story and the repetitive nature of the combat.  You're better off playing the Rebirth games before this one because you get way more Nep and if you like those then you will likely be able to tolerate Action Unleashed.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a bit like a Dynasty Warriors-lite, but with kawaii anime grills and clothes shredding.  Obviously it's a must buy as far as I'm concerned.",
            "review_score": "1"
        },
        {
            "review_text": "How to play this game: 1.) prepare some tissues 2.) pick chara 3.) spam heavy attack 4.) get hit by enemies 5.) costume break 6.) use your tissues   to wipe ur tears because ur chara is dying ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is basic so don´t expect much, there is a very notable unbalance on this game specialy after you play as either Rom and Ram on their HDDs,  +Nice graphics. +Easy fast gameplay. +Does not need many hours to level up (compared to the RPG versions) +Tanzerin Trombe is your best friend!! +Any character on this game is usuaful.  -Lack of challenge by bosses. -Story is too short. -Takes too long to be able to HDD unleast you get a costume break. -Lack of custom options.  Most of these CONS are not on Megatagdimension Blanc as far as i know soooo expect more smashing.",
            "review_score": "1"
        },
        {
            "review_text": "I need 34 hour to complete very end game. (all Achivements)  Review:  Pros: + Cute character : Nep Nep, Blanc, Rom, Ram , etc + Nice combat system ( Hack N Slash) + Comedy  + Recommend for nep nep fan ( play 4 fun )  Cons:  +Not recommend for the impatient ( cause Achivements too waste time )  +Mob like a stone mobile , 75% do notthing  *8.2/10*  - Still wait for Megatagmension blanc + neptune vs zombies xD",
            "review_score": "1"
        },
        {
            "review_text": "Let's see: -Hack and slash system to beat the crap out off your enemies: Hell yeah!! - game references and jokes . .kinda better in the original series but still legitly funny -Soundtracks . .Probably a reason why i still play it if i ever completed this game because it has some from the original series -medal systems . . .okaaaay - dress breaks during battle . . . .*Nosebleeds*thumbs up  Overall, this game is awesome, But i think the story is lacking . .because it only discuss about quests not like the original series that tells us about the CPU's/Goddess facing a crisis.",
            "review_score": "1"
        },
        {
            "review_text": "I let my character get beaten up so I can look at the 'Armor Break' feature.. Huehuehuehue.. [Perverted Thoughts Intensifies]",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, in my opinion. It takes the characters that we've all grown attatched to and puts them in one of my personal favorite genres: Beat 'Em Up (or button-masher, if you prefer to call it that). The combat system's a little simple, sure, but the missions are quite fun to play on and the HDD Modes make you feel like you are a lot stronger than the enemy (which you are). There's also the Clothes Tear, an explosion of fanservice and a different style of play, it gets rid of extra protection in exchange for speed and power, and later on in the game you can get different clothes that change if your clothes tear or not. (e.g. A soft outfit in case you like defense at the start, but not later on, a tough outfit that'll never break if you like defense, and even a pre-torn outfit if you want speed from the start.)  Would recommend, 8.7/10   Nepgear is best girl.",
            "review_score": "1"
        },
        {
            "review_text": "A solid action game that provides the typical great writing of the Neptuina series as well as a fresh new combat system that's incredibly fun. The game itself I would highly reccommend especially to people who found the original series too grindy or hard for them to get in to.   For one there seems to be some compatibility issues with Windows 10, go figure. The game should auto run in compatibility mode for Vista but that means cutscenes run in a small box in the corner of the screen for me. Not terribly horrible as so far the only cutscenes have been the OP and the start up credits. And on top of that running it in windowed mode doesn't work. It just freezes at the OP and you can hear the menu running but can't see it. To fix this I just found my screenshot folder and used that to navigate to turn it back to full screen, because the screenshots show the menu. These problems, while annoying, don't bother me anymore. However I do have a weird frame rate issue where the frames keep dropping to around 30 and locking there and the game just runs horribly it was meant for 60fps action at half that your characters are in water. It doesn't do this in menus and everything else runs fine its only when i launch up the mission does this happen. Upon testing it seems to be the mobs causing this which for worse computers would make sense, but I can run the game fine at 60 with no issues. But every so often i'll launch the game up and this will happen. Sometimes just letting the game engine run with it will fix it, other times closing and going to do something else, for me it was pay Rebirth 1, and then going back fixed it. This keeps happening and while i'm happy its not permanent, it is a mild annoyance.   Long story short, don't buy this game expecting a flawless port with no issues. Buy it because it's a great game that's tons of fun and be prepared to face these issues.",
            "review_score": "1"
        },
        {
            "review_text": "Let's get the easiest stuff out of the way and have me admit that the pervy fanservice aspect of this game is one of the reasons why I bought it, along with some battle arena goodness. It gets old real fast, though, seeing their clothes get ripped up, so you can equip your characters with unbreakable versions of their costumes. I did that for a while because I just wanted to kill cute things as cute girls, but then I was missing out on getting the boosts afforded from costume breaks, so I put the breakable ones back on.  I don't know what to say about this game. It's short, it's goofy, and just like the original Hyperdimension Neptunia Rebirth 1, I ♥♥♥♥ing can't stand the 'story' and pointless dialogue. The story isn't remotely compelling and that's obviously not the point, but nothing about it makes you curious about what will happen next. Thankfully the dialogue is kept shorter than usual, and for Hyperdimension standards, that's all I can ever ask for because in the other game, they just took waaaaaaaay too long to finish talking about...I can't remember. That's how bad the dialogue is.  I can see how others might find the 4th wall breaking funny and the cuteness exchange, but it's not for me.   The first half of the game you're given an over abundance of quests to complete and you go at them at your own leisure. Which ones to do first and which characters to do them with. The only reason why I played for 10 hours is because I do like the hack n slash battle system, and I was worried at first about it being too easy of a mash fest, but there are times where you do get challenged. Not so much that you sweat bullets, but enough to grab your attention back from basically mentally checking out to start paying attention to your spacing amongst the hordes of enemies.  Yeah, that's what this game is good for. If you want mindless fun, play it. Turn your brain off and mash buttons and occassionally use the dodge button to get out of 'tough' spots.  The sound bothers me, by the way. The music is fine and the voice acting is okay, but god the monster voices are annoying, and thankfully you can turn them off. But then all you're left with his hollow sound effects that don't make your attacks feel impactful despite of the physical force they cause in pushing enemies away. Then there's one real time cutscene that isn't in visual novel form and the mech monster was just silent. I had to close the game and turn it back on with allowing monster voices just to hear pointless stereotypical bad guy monologue.  I DON'T KNOW! I don't know why I ever bother with the Neptunia games. They're like one night stands that feel like a good idea at the time, but you regret it afterward. Great action, but nothing fulfilling to the mind or heart. I got this game for $20 because I did enjoy the visuals and the gameplay, but it left a lot to be desired. This game is good for $5, I would say, not at all worth the full price.  I would only gladly, without regret, pay full price for the next Action Release game IF the developers do the following:  - Have some more structure in tackling quests. Maybe one quest unlocks another rather than having a long list of them to do. - Quest variety. How sad is it that I felt relief in a fetch quest of picking up treasure chests that didn't really give me any real items? - The FIRST quest felt good in that you had to beat one part of the map to advance to the next, so why didn't the rest of the quests have that?! It was bland, but way better than being confined to ONE battle arena per quest with only a tiny option to move to another part of it. - Rebirth 1 was fun for the customization of your characters and dungeons from item collection and crafting. That would be nice to put into this hack n slash spin off. - Also, it wouldn't hurt to have more SP skills so it felt meaningful to go to the set up options and equip your characters with the moves you want instead of simply just having 3 per character. - Combos should have more customization. Throughout the whole game you have the exact same combos from when you start. I think it'd be better if you earned more moves as you leveled up or even had the option, like in Rebirth 1, to customize different moves you want to have in each link of a combo chain. - New monsters. PLEASE! Keep the ones they already have that's fine, but have some monsters that are the same size as the characters and more intimidating than a blob with a happy face. Killing those don't feel satisfying.  In conclusion, I don't play Hyperdimesion Neptunia games for what they are, I play them for what they could be: solid JRPG's with enough depth that you'd really need a long rope to get out of the deep chasm of customization. But that's not what these games are. They are a shallow waste of time and I have voluntarily wasted my time this week playing a game that has the potential to be so much more.",
            "review_score": "-1"
        },
        {
            "review_text": "TL;DR You can play as Nepgear",
            "review_score": "1"
        },
        {
            "review_text": "re-review  Pretty entertaining little hack n slash. Seems to be a lot of content. its sort of a tag tournament hack n slash choose from 4 CPU's or 4 CPU candidates and 2 reporters. as you beat up the baddies, coins are collected. you buy your general powerups etc with your coins. very simlar to how it works in Neptunia1-3 on STEAM. there is a lot of dialogue too, very visual novelish. a couple days later it got patched and seems to work great on all my machines. super happy it works on my main machine, also nice to see developer hard at work getting it to work. honestly buggy games dont bother me, but games that wont run at all bother me... honestly though, its runs great and its got decent controls. but the usual reversed left and right camera controls, which i always have to remap on all the Neptunia games anyways. overall its a very solid hack n slash, the characters are their typical adorable cheekiness. its a nice change from Idea Factories usual jRPG's, it still have many RPG elements in it though, typical jRPG neptunia stuff, players are very very customizable from clothes to weapons. so expect to do lots of grinding, but totally worth it!    -original post- hmmm the game is fun.... but wont run on my 4930K SLI GTX970's rig, yet runs fine on my x4 860K R9 290X HTPC and i5 3120 GTX645m laptop. but its a standard standard hack and slash, very repetative. but if you love the Neptunia franchise, you'll love this game too. has a lot of content and characters to play. i do like the game but the fact it won't run on my main rig is crazy considering all the other Neptunia games run great on it, hoping it will get patched, but honestly doubt it. of course if it does, will revise my review... its almost a thumbs down if it didnt run so great on my all AMD machine.",
            "review_score": "1"
        },
        {
            "review_text": "Boring, shallow beat 'em up with destructable clothing.  10/10, nep made great again.",
            "review_score": "1"
        },
        {
            "review_text": "Hyperdimension Neptunia U: Dogoo May Cry",
            "review_score": "1"
        },
        {
            "review_text": "Best hyberdimension game yet expecting great things to come in the future! btw did yu guys intended to make uni able to just hold down the attack button and spam attack? also i like how you guys gave out costumes that sute everybodys 'needs' i thought that wss very smart of you guys lol 😜",
            "review_score": "1"
        },
        {
            "review_text": "Apparently your clothes take get ripped when you take damage.  I wouldn't know, I'm not a scrub.  4th wall breaking now comes in Action RPG form.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would let the mobs ripping the girls clothes in every quest.",
            "review_score": "1"
        },
        {
            "review_text": "cool game for cool ppl",
            "review_score": "1"
        },
        {
            "review_text": "Maybe I'd feel better if the enemies didn't look like they want to hug you. I can only recommend this game to real Neptunia fans. If you are looking to invest hundreds of hours in a deep gameplay with many costumization for combos and skills, look elsewhere. But if you are just looking for another wacky Neptunia game with a simple, yet not too simple, hack and slash combat with some characters you've probably became attached to in the course of the other games, I'd totally recommend to buy this on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Basically this is a good game of Nep series but it’s hard for me to recommend this game, bcoz you may have many issues such as can’t start the game, crash, integrated graphics, low pictures… IFI, you can do a better job anyway and hope you will fix them asap.  I rate up this game bcoz I wanna see more Nep games as well as Fairy Fencer F: Advent Dark Force come to steam soon, and you will do it IFI, right? Shut up and take my money.",
            "review_score": "1"
        },
        {
            "review_text": "Went into dungeon *press F12* get beaten up. Broke the costume *press F12*  11/10 will press F12 again",
            "review_score": "1"
        },
        {
            "review_text": "I-its not like I bought this just to see their clothes get shredded!! B-b.b.Baka!!!",
            "review_score": "1"
        },
        {
            "review_text": "wahoo better animation&gt;&lt;  Great gameplay and story although it is not a long game Good game for the fans of Hyperdimension XD ",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but kinda lacking in content (repititive quickly). Grab on discount, not particularly worth the full price compared to Re;birth 3 imo.   Recommended for Neptunia fans. For non-fans? Nah, not really. Go grab Re;birth 1 first instead to see if you'd like it.  This game already assumes that you knew the characters and their world in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played the Rebirth series (I would buy the series if I have the money right now) but I can say Hyperdimension Neptunia U: Action Unleashed is a great game",
            "review_score": "1"
        },
        {
            "review_text": "'Costume break.' Issei would be proud.",
            "review_score": "1"
        },
        {
            "review_text": "As a huge fan of Dynasty Warrior and the Gundam spinoff I really enjoy this game, and actually probably more than the main games. Baisically mash buttons to kill huge numbers of enemies on screen with occational bosses.",
            "review_score": "1"
        },
        {
            "review_text": "Very good hack and slash Neptunia game.  Pros : Gives an option to start over an mission without game over , relaxing game , Good quest lists etc  Cons : Controls are comfusing but can be quickly learned  Worth Playing (I don't want to ruin the spoilers)",
            "review_score": "1"
        },
        {
            "review_text": "  I love this game so much",
            "review_score": "1"
        },
        {
            "review_text": " Short review:",
            "review_score": "-1"
        },
        {
            "review_text": "great graphics and soundtrack, a must buy for anime lovers.kek( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Bring the action to your Wi-- Wait... this isn't a Wii U game? What's with the 'U' in the title then?  Hyperdimension Neptunia U Action Unleashed will bring you action indeed. It's a 'warriors' type game where you have hordes of enemies on screen and you do flashy combos and constant button mashing (X/Square/U are your friends). With ten characters to play as each with their own style of attacking, you'll want to try out many combinations and wipe the enemies clean. Of course in the original nature of the 'warriors' game, it can get very repetitive. However, there is one thing I'm sure you're all here for that will actually wanna make you keep playing and not mind the repetitive nature, the Costume Break. Yep, when your girls lose clothing, you'll end up wanting to keep playing because you're now given fanservice all the way to the end of the quest. Most of the enemies may look tame and not attack often, but they can still gang up in numbers and possibly land a ton of hits enough to rip your clothes apart (and in cheap cases for tough missions, knock you down faster than you can register as many X buttons). In fact, you can even find pre-torn clothes for the girls to wear and bam, instant fanservice from start to finish. Enjoy the jiggle physics as well! U probably are thinking right now, is this game worth it? Well, it's a pretty short and easy game that can be completed in 12-15 hours depending on your skills. There are a couple of post game content to keep you playing a bit longer and I appreciate that at least. And well, it's Neptunia, there's humour in the rather simplistic slice-of-life-esque story. But in the end, I still liked this game. Once you get used to the repetitive nature, you will find fun action and glorious fanservice to be had. U too may be able to have fun as well with Hyperdimension Neptunia U.",
            "review_score": "1"
        },
        {
            "review_text": "if you agree nepgear is too pure for this game let me tell you there's an unbreakable outfit  waifus ripping everything apart 10/10",
            "review_score": "1"
        },
        {
            "review_text": "~ Recommend for perverts :v ~",
            "review_score": "1"
        },
        {
            "review_text": "Came for the boobs , stayed for the game",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the main games in the series, but still an enjoyable hack-n-slash romp. Story is non-canon and throwaway, but there are quite a few good jokes, fourth-wall breaks, and fun character interactions. Also, all of the main goddesses are very endearing, and the side-characters add their own personalities to the crew. Fan-service is turned up quite a few notches, and ripping outfits increase combat power substantially. Combat in the game is extremely easy, only a couple missions have any noticeable difficulty spikes. The post-game unlocks two new game modes, one of which is lackluster (would be AMAZING with multiplayer, however), and the other adds a lot of content to the game. All-in-all a fun addition to the Neptunia franchise, but definitely not essential.",
            "review_score": "1"
        },
        {
            "review_text": "The parts that I got to play before the game crashed over and over were fun. I think those were the tutorials.   Anyway, 10/10 for the ripped clothes, never got to rip Vert though. Vert OP.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Metal Gear Rising Revengence? Well if ya did to my next question, do you like the Hyperdimension Neptunia series? If yes this game is perfect for you fun fast pace hack and slash gameplay and fanservice what more could ya want?",
            "review_score": "1"
        },
        {
            "review_text": "I used to have some shame like you till I took a nep to the knee.   Gameplay Reminds me of Dynasty warriors, but with destructible clothing. So arguably you get more dynasties out of your  warriors  CPUs. ",
            "review_score": "1"
        },
        {
            "review_text": "Thank you for this beautiful game ! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "What happens when you cross Dynasty Warriors with Waifu games? This!  Hyperdimension Neptunia U: Action Unleashed (Still sounds like a Wii U game to me lol) is an intresting change to the normal Neptunia style, going for hack and slash combo times instead of the RPG roots it does so well.  The combat feels great and its refreshing to see the girls in a diffrent style of game and pull it off well, the gameplay is simple and effective, this doesn't set out to change the genre and sticks to what works.  The only negatives I have found are little nitpicks: Some of the enemy noises loop way too much, becoming annoying when you have to take out around 500 of them (there is an option to turn the voices off, so it is fixable) and the only other (Personal) complaint is the fact that my Iris Heart isn't in the game.  Overall, this is a fun, intresting game based in the world of Neptunia, its non-canon so if this doesn't intrest you despite being a Neptunia fan, then you won't miss anything, but if you like Neptunia, Dynasty Warriiors or looking for a fun game to waste 6-10 hours on, then get this, you won't regret it.  I rate this Nep-Nep/10, Top Nep!",
            "review_score": "1"
        },
        {
            "review_text": "What happens when you cross Dynasty Warriors with Waifu games? This!  Hyperdimension Neptunia U: Action Unleashed (Still sounds like a Wii U game to me lol) is an intresting change to the normal Neptunia style, going for hack and slash combo times instead of the RPG roots it does so well.  The combat feels great and its refreshing to see the girls in a diffrent style of game and pull it off well, the gameplay is simple and effective, this doesn't set out to change the genre and sticks to what works.  The only negatives I have found are little nitpicks: Some of the enemy noises loop way too much, becoming annoying when you have to take out around 500 of them (there is an option to turn the voices off, so it is fixable) and the only other (Personal) complaint is the fact that my Iris Heart isn't in the game.  Overall, this is a fun, intresting game based in the world of Neptunia, its non-canon so if this doesn't intrest you despite being a Neptunia fan, then you won't miss anything, but if you like Neptunia, Dynasty Warriiors or looking for a fun game to waste 6-10 hours on, then get this, you won't regret it.  I rate this Nep-Nep/10, Top Nep!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Great port. Worth it.",
            "review_score": "1"
        },
        {
            "review_text": "this is the first anime game i bought and it's ♥♥♥♥ing good (y)",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Neptunia : Hack n' Slash ? Ohhhh yeahh.  Very nice game with many quests, good story, maybe a bit boring after many quests done in a row.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a simple man. I see Neps, I press like.  This game came so i buy.",
            "review_score": "1"
        },
        {
            "review_text": "-A hack and slash games -1080p and 60fps  -Beautiful Graphics -Costume Breaks -More Fanservice than ever  10/10 will play for A hack and slash and Waifu. ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "I BET!! U WILL LET THEM GET  _________SOME HITS ON YOU  _______________FOR THE ͡(° ͜ʖ ͡°) ͡( ° ͜ʖ ͡°) _______________________L.llL._L.llL. ~yeah~",
            "review_score": "1"
        },
        {
            "review_text": "This is what God intended for entertainment",
            "review_score": "1"
        },
        {
            "review_text": "Hack and slash nep. Too close seeing what you want from them. This time, in PC!",
            "review_score": "1"
        },
        {
            "review_text": "Not what I was expecting.  Haven't beat it yet but already needs a few things said about it.  Alright, so if you've played the earlier games and you expect this one to be the same gameplay-wise, you will be disappointed.  Basically this went from the JRPG turn system to a hack and slash system kind of like Dynasty Warriors or the RWBY game, and you basically play as one tag team of which you can switch between two selected characters during a battle.  Character customization is great as always but finding and getting new equipment is a bit less simplistic to do so than in the other games.  Why am I talking about the gameplay mechanics, the highlight of this game is a new feature called 'Costume Break', the entire focus on this new mechanic is definitely fanservice, basically your character's clothing functions like a seperate health bar but you don't lose if it gets torn up, the weaker your clothes are, the weaker your character's defense but it increases critical hit rate and EXE gauge fill. (It's basically charge for a special attack if you don't know what it is.)  If you are a fan of the series and don't mind hack and slash gameplay then I reccomend this game, controls are different from the other games but like the other games, the controls grow on you and are easy to remember.  Being a new release, expect it to have several glitches and errors, I had to re-download the game because the first time I set the resolution to 1920x1080 and full screen and it deleted the .exe file, but apart from that I've not seen any other game breaking issues.  Of course this review is not finished and will be seeing updates but so far it is a pretty good change from the JRPG style and still maintains the Hyperdimension atmosphere and blahblahblah Nep-Nep everyone!",
            "review_score": "1"
        },
        {
            "review_text": "You can play it with a joystick.  If you're a man, that is.",
            "review_score": "1"
        },
        {
            "review_text": "BEST ANIME GAME 2016 (CUTE,GOOD VOICE JAPANESE) MY RATING 100000000/10 (VERY RECOMMENDED GAME,IF YOU ANIME LOVERS)  NB:DONT PLAY WITH KEYBOARD,MUST BE JOYSTICK OR SOMETHING . . . . . . . . . .. . . . . . . . . . . . . . . . . . . . . . . . SORRY FOR BAD ENGLISH :) ",
            "review_score": "1"
        },
        {
            "review_text": "Recommed The game.",
            "review_score": "1"
        },
        {
            "review_text": "Damn HyperDimension back at it again with the Fan Service ( ͡° ͜ʖ ͡°) Rip off clothes sim ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "New battle system... seem fun. Nep Nep Fan must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but crashes too much. But its not to worry because my laptop sucks. (1.6ghz and 4gb ram)",
            "review_score": "1"
        },
        {
            "review_text": "Neptunia U is in the branch of 'lukewarm Neptunia spinoffs' and theres been several now. This one basically being a musou map based brawler it has alot of short commings that make it weak even in compared to other musou style games. The biggest complaint is the customization or lack thereof of it. Even Senran Kagura, which is a game based on an anime and anime based games are notorious for lacking in super deep details, offers a vastly large amount of customization options for the player.  Nep U offers about 3 weapons and 1 alternate outfit a character and accessories that do not visually change the characters appearance. This does not help elevate the repeativeness of the game at all, which it does get very repeatitive with the forgetable story and similar missions in similar environments. Even the fan service aspect of the game is lacking when compared to other games that have done it. The entire game feels lacking and rushed.  I can only recommend this game if you are hardcore neptunia fan and will play anything involving them, if not theres far better of the same genre to spend your money on, the aforementioned Senran Kagura game which is also now on steam would be a good example.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like the characters of the Hyperdimension series and their 'plot' then this game is for you. However, the story doesn't follow the rebirth series. Game doesn't take very long to clear, grinding is minimal, but post game events take a while to finish. Would reccomend though to those who enjoy Nep and friends. Warning though, this is a heavy button mashing game. There is minimal skill required. For example, you can play as Neptune or Nepgear and win fight by only moving and pressing one button. Lastly, some levels are ridiculously long. Still recommmend since the game has the classic Nep humor.",
            "review_score": "1"
        },
        {
            "review_text": "New nep-part did took my heart and my soul. It's sooooo cuty. I love you, my little nep~",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr decent hack'n slash attempt, worth the discounted price but not really at full price.  Some of important things you should know: -Hyperdimension Neptunia U: Action Unleashed is a Hack n' Slash game, but with Neps, you won't see any turn-based here. -Did I said the port was amazing? at least for me. EDIT: Some peope can't get this game to run on their rig, be warned -If some of you gonna complain about IFI re-using game assets, heads-up, they are. But it's fine for me because it's a spinoff with Hack n' Slash, now go complain about something else. -Story... well, it is the same dimension as in Re;Birth 1, but the story is pretty much nonexistent for me, or that I just skip the dialogue too much. -Some people say the localization took liberty, be warned. -Still, decent jokes, which are Neptunia series charm. -Unless you're going for every achievements, the content is pretty short. -There's some NSFW stuff such as Custom Break, you might want to consider it if you play it with your family. -It's not on par with AAA Hack n' Slash title, but is not too bad either IMO, reason for this is bad enemy AI for most of the times, broken and underpowered moveset for some characters, and some more stuff, I guess worth the discounted price for now, but on full price you might want to reconsider it. -Obviously not for hardcore ones though, this one feels more casual, consider this if you need a break from DW or something similar  Overall, a decent attempt at Hack n' Slash game, you might worth it more if you're fan of the franchise.",
            "review_score": "1"
        },
        {
            "review_text": "  The Good: A fun hack-and-slash (think Dynasty Warriors) set in the Neptunia universe. The controls were solid and responsive when I used a controller. There's a lot of levels and two unlocked modes: a one-on-one fighting tournament and a multi-level tower with more stages to complete.  The Bad: As most Neptunia games, you will need to do some grinding. The levels are just thrown at you with no real structure as to what is next, making you have to look through them all to find which ones you should be doing.  The SaHD: As a riff on the Senran Kagura games, your clothes can get ripped in this game. While I appreciate that mechanic in SK, it comes off as creepy here.  (I played many hours on the PS Vita version. The game ran perfectly fine on my PC) More in-depth reviews and more at:  sahdgamer.com ",
            "review_score": "1"
        },
        {
            "review_text": "playing game @ costume break @ police rushing in my house and arrests me",
            "review_score": "1"
        },
        {
            "review_text": "Bought this only because it was like Senran Kagura, but didnt live to my expections,",
            "review_score": "-1"
        },
        {
            "review_text": "A different genre than the usual Neptunia games, with action-based gameplay, similar to the Dynasty Warriors series. The cast is the usual CPU characters, their sisters and two new journalists.  Unfortunately, the gameplay is very stale and repetitive, boiling down to simply selecting a map and killing mobs until you win (there are some exceptions, with special condition maps, but they hardly refresh the game). The unlock system is a pure grind and is poorly presented -- once all unlocks for killing a particular enemy are done, there is no indication of this, meaning the player has to constantly check all the progress all the time. Further, while each individual character can be customized, generally there will be the same accessories that you would want equipped all the time, making it just cumberson to repeat the equipping process for all characters (not to mention having to do it again when a better equip is unlocked).  All in all, while the Neptunia style is generally there, it hardly does enough to warrant playing this game. There should be enough moe games out there to easily skip this one.",
            "review_score": "-1"
        },
        {
            "review_text": "a lot of adventures waiting for u! especially those lewds costume break tho :3",
            "review_score": "1"
        },
        {
            "review_text": "This is a bad game   The IA is the worst. If you go run 10 times around a group of 40 enemy's 6 want to attack 0 hits on me. 1 Round is like 5 sec. And i cant find a way to stop the AI from being crap  Sorry idea factory bud this is a no",
            "review_score": "-1"
        },
        {
            "review_text": "Hyperdimension Neptunia Warriors: Costume Breaking Edition &lt;3 &lt;3  Rom is love, Ram is life, I want Vert to be my wife &lt;3 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": " twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman   twitter.com/Treashman ",
            "review_score": "1"
        },
        {
            "review_text": "Theres no Sadie :(, btw this game needs more combo mechanics, but more Sadie so 9/10  I recommend it anyway (Y)",
            "review_score": "1"
        },
        {
            "review_text": "it's a nice game",
            "review_score": "1"
        },
        {
            "review_text": "After finally beating the game and its 3 modes available, its finally appropriate to finally write a review for this game. Pros- ~10 characters with different fighting styles for each ~Funny story lines imo ~Costume breaks ~Noire ~Costume breaks  Cons- ~Reused maps ~Many same enemies (Some color swaps and strength adjustments but the same enemy overall) ~  Neptral Tower and its many, many floors    I have big patience for doing repetitive things but i felt it being tested. This is a nice game to play if you are a weeb/ tolerate weeb things and want something else to play. Beware if you want to 100% this game. Its a long and boring ride. Play this game in small doses.",
            "review_score": "1"
        },
        {
            "review_text": "Hyperdimension Neptunia U: Action Unleashed is a fun hack and slash spin-off on its own. But it comes with its faults also.   Pros Good small selection of characters (including Famitsu and Dengenkiko) Good amount of jokes and references Gameplay is easy to get into Good music selection even if small 1080p + 60 fps Good vita port Good controller support  Neutral The game plays just like Dynasty Warriors, so players might find that it gets repetitive (and it does, sort of)  Some characters are a bit broken on their combos and actions Fan service isn't for everyone  Cons Enemy Ai takes a bit too much time to attack Not enough locations are used  Recommended to play with a controller  7.4/10",
            "review_score": "1"
        },
        {
            "review_text": "PC port is good, but it doesn't support 1440p and has some slowdown issues.  Overall, the game is really fun and there is a fair amount of content. I wish there was a little more variety, but it was the first time they had Tamsoft work on a Neptunia game and it ended up pretty good.  Definitely recommend this game if you're a fan of Neptunia and other Tamsoft games.",
            "review_score": "1"
        },
        {
            "review_text": "Compared to the rest of the RPG series, AU is alot shorter, its focus is on fanservice so if you like that (which if you are playing the series I'm guessing you do :P) go for it.  There are clothing tearing mechanics like senran kagura, not many costumes though.  The combat is fluid and fun but the game is abit to easy (Especially in HDD form) The story, well if you came looking for that theres not much to it.  I'd reccomend it to a Hyperdimension Neptunia fan, but not for full price because of how short the game is (Unless you go for all the achievements)",
            "review_score": "1"
        },
        {
            "review_text": "Kill all the monster all the way!!!!! and see the clothes tore apart in process :^)",
            "review_score": "1"
        },
        {
            "review_text": "its a great hack&amp;slash game with some funny moments but like the other Neptunia games its over priced for what it is. Along with being over priced the game is very short and for someone not into hack&amp;slash games. It will start to get repetitive. That and the lack of any real replay value makes it hard to recommend this game at full price.  on a massive sale like the summer or winter sales they drop below $10 and for this type of game thats a great price.  6/10 TBH if i wasn't a big Nep-Nep and hack&amp;slash fan I would have skipped this one....",
            "review_score": "1"
        }
    ]
}