{
    "app_id": 387450,
    "name": "Shadow of Kingdoms",
    "release_date": "2015-08-11",
    "developer": [
        "TernGame"
    ],
    "publisher": [
        "Admax Game"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "MMO"
    ],
    "genres": [
        "Free to Play",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "Massively Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 28,
    "negative_ratings": 73,
    "price": 0.0,
    "description": "Can you defeat the shadow of your kingdom? Play as the last of the survivors of a former glorious dynasty to defeat evil and restore the honor and glory to your land!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387450/header.jpg?t=1447377116",
    "minimum_requirements": "OS: Windows XP or Higher Processor: Intel Pentium D or AMD Athlon 64 (K8) 2.6 GHz Memory: 512 MB RAM Graphics: Intel HD Graphics or AMD (formerly ATI) Radeon HD Graphics Storage: 1 GB available space Sound Card: Integrated Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is a pure rip off heroes of might and magic V (best HOMM ever made). Graphics same, units look almost identical. Problem though it reeks of pay to win genre with over symplistic combat to the point where player is not needed just an auto combat. It is almost as bad as dungeon keeper mobile. Did not like it one bit",
            "review_score": "-1"
        },
        {
            "review_text": "First of, I watched a friend of mine play this game and was totaly horrified cause this game is a total and shameless ripp-off.  ahem.... I will make this short and sweet, this game does not look like Heroes of might and magic 5... It is heroes of might and magic 5 ripped of down to the art work and every singel unit with a pay to  win concept hastily bolted on and the onley reason they dont have all 8 teams ripped of is because that might accually involve some work.",
            "review_score": "-1"
        },
        {
            "review_text": "This game cant open....................",
            "review_score": "-1"
        },
        {
            "review_text": "Homam 3 in MMO world, slow progress, but worth it",
            "review_score": "1"
        }
    ]
}