{
    "app_id": 387930,
    "name": "The Tape",
    "release_date": "2015-11-19",
    "developer": [
        "Kazakov Oleg"
    ],
    "publisher": [
        "Kazakov Oleg"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Horror",
        "First-Person"
    ],
    "achievements": 4,
    "positive_ratings": 184,
    "negative_ratings": 139,
    "price": 0.79,
    "description": "The Tape is a slow and creepy first person horror game, with mystical story and abstract psychological elements.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387930/header.jpg?t=1478062908",
    "minimum_requirements": "OS: Windows® 8 (32/64-bit)/Windows® 7 (32/64-bit)/Vista Processor: Dual Core Processor Memory: 1 GB RAM Graphics: 128MB Video Card with OpenGL support DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'm not entirely sure that it makes much sense for a 'detective' character to go around investigating spooky, cultist-and-demon-infested locales with nothing but an extremely damaged and/or astonishingly low quality video camera to guide his way, especially when he seems incapable of RUNNING at any given time, but I can safely say that it makes for an amazing atmosphere. The sound in this game is equally impressive/oppressive, so these two factors already put The Tape yards ahead of the vast majority of alleged 'first person horror games' released onto Steam in the past couple of years. The 'story' - what little there is of it - is furthermore highly intriguing, and the scenery is suitably compelling. There's even a tiny bit of what one might conventionally term 'gameplay' on offer: A tiny bit of 'stealthing' and/or other enemy evading, and even a 'boss battle' of sorts near the end. That's the good stuff.   Now onto the not-so-good stuff. The price is possibly a tad on the steep side, considering that the main game/campaign itself is probably under an hour, although there are some simplistic mini-games included as extras for those who can find pleasure in such petty things (including one where you time-manage some different camera angles to ensure things don't get dark for too long or you get jump-scared - sound familiar? - and another one where you wander around in a gloomy forest looking for pages of a book - also sound familiar?)! There's also more than a touch of the 'what the ♥♥♥♥ am I supposed to be doing here?'s in a few bits, though one could certainly argue that this fact adds a little to both the mystery of the piece AND the length of the gameplay, so it's perhaps not an absolute detriment to the game overall.    So yes, it's DEFINITELY scary and disturbing, DEFINITELY short, DEFINITELY not extraordinary value for money, but DEFINITELY worth a look if you're a die-hard horror fan, especially if you can grab it on sale. By all means, if you keep your expectations fairly low, you may be pleasantly surprised. Expect another Outlast - a game which it owes a small amount to, if not THAT much - then, well, you're clearly a ♥♥♥♥ing idiot and DESERVE to be disappointed. I will be looking out for other releases from this Kazakov Olag character, though, as it's due time one of these Euro dudes churning out cheap horror games turned out to be one with a noteworthy TALENT (and while we're at it, more than just a fly-by-night scam artist). Oh, look, he DOES have another game out already...hello, Putrefaction...Kazakov, don't fail me now...  Verdict: 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "The Tape offer a very good horror experience for decent price. It is scary as hell, but game is far from great.  For example if you play with HEAVY camera effects its just destroy your eyes simulator 2016! However on Low camera effects game is most enjoyable.  Biggest con for my taste is lack of object interaction in-game, but if we take in consideration that game was made by one man than this is somewhere the best we can get.  Overall; Nice horror experience 7/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a decent indie horror game for it's price. But it's fairly short and is just a nice little time killer. Reccomended to purchase if on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not bad, graphics in the style of horror and the game is terrible. It is good that there are achievements. Game is satisfactory, not in my style but who love Horror games, this is for him! Good Luck.",
            "review_score": "1"
        },
        {
            "review_text": "The Tape is a game that I recommend because: - it is a method to banish boredom - it has an acceptable price - it is indie - it is horror - it has trading cards  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Really short game. Probably the shortest I've played. The gameplay is really limited, as most walking simulators are. But the game is not without its merits. The visual style is unique and it looks really good. It's a bit disturbing to the eyes but that's the point.  The setting and the story are also really nice.",
            "review_score": "1"
        },
        {
            "review_text": "This one was slow and boring. Plus, I somehow ended up in the same hallway that originally leads to the bedroom where the girl you watched being sacrifices comes back to life as a demon, with no way in or out of said hallway. Prior to that, I was just aimlessly wandering the hallways. I tried following the pools of blood, I tried following the direction the servants weree all facing....nada. So....retired. I'll leave it unrated, but I wouldnt recommend spending 4 bucks for this. Maybe 50 cents. Maybe.   It does have potential however. With a bit of work. It has a Lord of Illusions feel to it, but it just isnt good enough right now, and of course the game busting bug I encountered.",
            "review_score": "-1"
        },
        {
            "review_text": "  Another boring object finding game with jumpscares. That being said, the VHS aesthetic was done very well, and the mood was great. It's just a shame the gameplay was lacking.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a joke",
            "review_score": "-1"
        },
        {
            "review_text": "This game is short, boring, and glitchy. There wasn't much of a story but what there was made no sense. Definitely not worth $3.99.",
            "review_score": "-1"
        }
    ]
}