{
    "app_id": 387970,
    "name": "Clown House (Palyaço Evi)",
    "release_date": "2015-08-24",
    "developer": [
        "gord10",
        "Aslan Game Studio"
    ],
    "publisher": [
        "Aslan Game Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Free to Play",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 449,
    "negative_ratings": 505,
    "price": 0.0,
    "description": "Freeware horror game with the mise en scène of an old black&amp;white film and unique horror experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/387970/header.jpg?t=1552238781",
    "minimum_requirements": "OS: Windows XP (SP2 or higher), Vista, 7, or 8 Processor: Dual Core CPU @ 2.2 GHz Memory: 512 MB RAM Graphics: Nvidia GeForce 8800 GT / ATI Radeon HD 4770 Storage: 164 MB available space",
    "recommended_requirements": "OS: Windows 7 or 8 Processor: Dual Core CPU @ 2.4 GHz Memory: 1 GB RAM Graphics: Nvidia GeForce GTX 280 / ATI Radeon HD 5830 Storage: 164 MB available space",
    "reviews": [
        {
            "review_text": "I've spent about 13 hours of ACTUAL gameplay in this game. Of all of it, I encountered many glitches and discoveries of how the game REALLY works. The clowns that are going to be evil are pre marked. Meaning you can pull a gun out and start unleashing on a clown hoping it eventually would chace you. You can shoot through walls. Be warned since you might shoot an innocent clown on accident. CLOWNS WALK THROUGH WALLS, MAN. DO NOT TRY TO CAMP IT OUT THEY'LL WALK THROUGH THE WALL. All in all this game is fun. For two reasons:   REASON NUMBER JUAN: Glitches are fun to discover and mess with Who doesn't love shooting clowns in the face  Well, that wasn't an iconic review, now, was it? PROS: + Shoot clowns + Clowns sat down so long they forgot how to run + Glitches CONS: - This is a free game. Stop complaining and take your handout.  *EDIT 9/17/15* Of all the posted reviews I'm the only one even with a full hour in this game, sooooo my review must be so much better given I have 13 hours of experience  *EDIT 3/26/16* Yo where the hell Clown House 2 at?  *EDIT 10/3/16* This game has prepared us for this spooky clown thing going on, call to arms and shoot em through the walls!",
            "review_score": "1"
        },
        {
            "review_text": "Start game up Read the intro about an evil Clown wanting to kill me out of a house full of Clowns and having to find some key to escape. They give me a pistol to use on said evil Clown but apparently can't kill innocent Clowns. Finally get in game 5 seconds in Immediately see a Clown sitting with a machete **SUDDEN DRAMATIC MUSIC** Clown starts walking towards me machete in hand **BLAM** Not today thank you.  Pretty much won the game in under 5 seconds. Got key and went for tea and biscuits. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is terrifying if your affraid of clowns. Especially with that mist of unknowing. There are a lot of bugs though... I keep getting stuck and unable to move! D; still fun if they'll work that out though.",
            "review_score": "1"
        },
        {
            "review_text": "when is clown house 2 coming out?",
            "review_score": "1"
        },
        {
            "review_text": "I love this game even tho I almost ♥♥♥♥ my pants but!.. Its awesome!!",
            "review_score": "1"
        },
        {
            "review_text": "This game rules",
            "review_score": "1"
        },
        {
            "review_text": "Wish it was longer bsesides that its creepy af",
            "review_score": "1"
        },
        {
            "review_text": "Not really a game, kind of a 5 or 10 minute long tech demo. Pretty suspenseful and creepy, I don't have a particular fear of clowns but I was on edge. Oddly, the first time playing, the attack/jump scare didn't happen, but the second time, it did. Your mission is to explore these three rooms with clowns in them to find a key and escape. It's black and white and hard to see very far in any direction. One of the clowns will try to kill you, the rest will not. If you shoot the wrong one, you lose. I'd like to see this expanded on a bit. It's free and 10 minutes long, so it actually is worth your time unlike some other free nonsense on here.",
            "review_score": "1"
        },
        {
            "review_text": "This game is in a small room with three clowns, you have to find a key to escape. the key is in a random place each time. some clowns are evil and some arent. you have to decide which ones arent. if you shoot the nice ones you lose. this game is in fact short but very entertaining for a ftp game. it has a very disturbing atmosphere. I recommend it to anyone looking for a quick horror and puzzle fix!",
            "review_score": "1"
        },
        {
            "review_text": "2spooky4me 5/10 Too many clowns.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, could use more options though. It doesn't really change a whole lot which is a downer, but other than that I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Walked in to bathroom, killed clown. Walked in again, game crashed. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded this game thinking that it was a pretty cool concept and it is. Walked passed three clowns, got the key and exited. Game over. PS: Needed to go back into the game for an extra three minutes to leave this review.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS AN HONEST REVIEW I enjoyed every minutes of this brilliant game! This is my favourite game so far! Pros:  -The storyline is very well written   -the graphics are pretty good   -voice acting is excellent   -gameplay is 11/10!!!   - no bugs at all   -many updates, huge maps   -nice animations   -high resolution Michael Bay effects  -epic soundtrack  -next gen quality  -some clowns like me  -lots of scares ( ͡° ͜ʖ ͡°) Cons:  -some clowns don't like me I hope they'll make Clown House (Palyaço Evi) 2 soon! We need more games like this on steam!",
            "review_score": "1"
        },
        {
            "review_text": "u can 360 no scope   10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would kill the insane clown posse again",
            "review_score": "1"
        },
        {
            "review_text": "Great game, it should be made into a full game.",
            "review_score": "1"
        },
        {
            "review_text": "Beyond short, but kind of creepy. Could be pretty fun if it were extended into a full point and click.",
            "review_score": "1"
        },
        {
            "review_text": "Play this with lights of and doors closed. Also play the audio at the normal music level. The sounds are eerie, the number of rooms are too small. Overall the game is average. I have it in my library to play it at some nights when i get bored, this game gives chills! Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "after years of therapy to get over the fear of clowns, all i had to do was shot em in the face. i like them now. they make me smile. see. :)",
            "review_score": "1"
        },
        {
            "review_text": "says onine no online was able to quickscop some clowns though so no bad",
            "review_score": "1"
        },
        {
            "review_text": "Not terrible for what it is... Honestly got more fun out of it than all is dust.",
            "review_score": "1"
        },
        {
            "review_text": "I simply don't understand.",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year material right here! Valve take note on how to make games, Episode 1 was short, but ♥♥♥♥, you didn't shoot far enough, make the game less than five minutes worth of content! and then all will love you!",
            "review_score": "1"
        },
        {
            "review_text": "  this game is ♥♥♥♥ing epic. it was so intense i almost ♥♥♥♥♥♥ my pants. 10/10, i finished it more than 10 times.",
            "review_score": "1"
        },
        {
            "review_text": "why won't the clowns socialize with each other? is it because they're paranoid to know that one of them is the killer??  is it the guy who has a fedora??? ARE YOU YOURSELF ONE OF THEM???? that's some deep **** to think about. 9/10 would play 24/7",
            "review_score": "1"
        },
        {
            "review_text": "15 seconds at bobs house",
            "review_score": "-1"
        },
        {
            "review_text": "ya it's pretty bad but it's also a point 'n' clicker if i ever done seen one also i did almost ♥♥♥♥ myself but that's because i had the volume at 40 when i pulled out the gun",
            "review_score": "-1"
        },
        {
            "review_text": "what is this game. i have no idea what kind of drugs you have to take to enjoy this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is REALLY REALLY short. You can complete the game in like 5 seconds, even less if you bomb-rush it. I don't like Clowns at all, but I don't know how I feel about them anymore.         YouTube™ Video:  Clown House - REALLY short and random!&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "I think the devs were... CLOWNING AROUND!",
            "review_score": "-1"
        },
        {
            "review_text": "wow! start up game i got a pistol and have to find a key shoots 1 clown, was the right one to shoot found the key left 11/10 would win the game again, only useing 4 min!",
            "review_score": "-1"
        },
        {
            "review_text": "at first i diddn't know what to say nor do but when i found a key and went to the dorr i thought yes more of the house but then i realized that was it do not waste your time with this",
            "review_score": "-1"
        },
        {
            "review_text": "420/69.  I posted my findings here.          YouTube™ Video:  &nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "        YouTube™ Video:  JERRY LEWIS SIMULATOR | Let's Play 'Clown House'&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Clown house is the best game ever",
            "review_score": "-1"
        },
        {
            "review_text": "kinda sucks. 'house full of clowns', there are only three rooms and three clowns and they move very slowly to get you.",
            "review_score": "-1"
        },
        {
            "review_text": "is a predecible game this game dont like",
            "review_score": "-1"
        },
        {
            "review_text": "Revision: Unknown While a cute litte game, it is in the end very boring after the first couple play through. If the developers exten the game a bit, make the clowns appear in different locations, make some immediate killers (instead if having to wait for the startle noise). The black/white genre does help make the game but without any further development this game just falls flat on it's face.",
            "review_score": "-1"
        },
        {
            "review_text": "It gave few scares, but the mouse/camera controls are buggy. I'd be walking forward in the middle of a room then all of a sudden I'd be standing up close to a wall. Very disorienting. supposedly there's a hidden key but I couldn't find it and didn't know how to interact with anything if it's hidden in something. After closing the game my mouse got stuck as well.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has an enjoyably creepy atmosphere and premis, though lacks in actual gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Yeah, it's a game.",
            "review_score": "-1"
        },
        {
            "review_text": "kinda sucks. 'house full of clowns', there are only three rooms and three clowns and they move very slowly to get you.",
            "review_score": "-1"
        },
        {
            "review_text": "Sold as advertised.  A locked house - Check Clowns with knives - Check Kinda creepy - Check  Nothing more. Really, nothing more.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "It felt more like a beta stage of a game.  I played it 4 times and on the 5th i felt though the floor at the beginning of the game.  It's the same level over and over again with different spawn location for the key.   I don't understand why you can't shoot all the time with your left key. Or why you have to go to shooting mode to pick up (well shoot) the key, instead of using spacebar or enter key?  Actually during the first time two times i played it i didn't notice there is a second section of the room since the controls are a bit bad. Furthermore, you sometimes get stuck in to objects and you have to figure out how to maneuver yourself out of that location.",
            "review_score": "-1"
        },
        {
            "review_text": "welcome in a room with clowns, grab a key and escape, the end. that's it grab a key.",
            "review_score": "-1"
        },
        {
            "review_text": "Proof that Steam has 0 quality control.",
            "review_score": "-1"
        },
        {
            "review_text": "too short, too much shity",
            "review_score": "-1"
        },
        {
            "review_text": "So what's good about this game well... It has good graphics Would be good if there was more of a detailed story.  But from the game being too short, it just seems boring... ;( ",
            "review_score": "-1"
        },
        {
            "review_text": "its not even a scary game.",
            "review_score": "-1"
        },
        {
            "review_text": "No,just no. Short game.Key at the bathroom.Just one clown evil (the second one)....no just no...I just wasted my time downloading this game.Finished in 3 minutes and stayed 2 minutes in the configuration menu to write this review. 0.5/10  Why CG Magazine reviewed this? Uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "So lame! It is scary, but there's no real point to the game. Would not recommend.",
            "review_score": "-1"
        }
    ]
}