{
    "app_id": 388160,
    "name": "Project Druid - 2D Labyrinth Explorer-",
    "release_date": "2015-07-30",
    "developer": [
        "Cemil Tasdemir"
    ],
    "publisher": [
        "Back To Basics Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 21,
    "negative_ratings": 75,
    "price": 0.79,
    "description": "Find the key and solve the maze. Oh yeah stay alive!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/388160/header.jpg?t=1465396442",
    "minimum_requirements": "OS: Windows 7, Windows 8, Windows 8.1 Processor: P4, AMD Athalon Memory: 1024 MB RAM Graphics: At leats 128 Mb DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Terrible game. Amateur. Not fun.  When you are on the menu screen you will be prompted to choose your language then go through 3 screens where each time you press space to continue and the screen slowly fades to black while you are forced to wait.  The game itself is a simple maze game with enemies that follow you around and when they touch you your health is drained in a continuous fashion as long as you are touching the enemy. The oblong collision boxes despite things not looking oblong will mean you get stuck on corners a lot and die.  When you die you have to press y or n to restart and if you choose n then you go back to the main screen and have to choose your language again.  I REPEAT DO NOT BUY THIS GAME. IT IS TRASH.",
            "review_score": "-1"
        },
        {
            "review_text": "My friend gifted me this game.   I don't think they'll ever find the body.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible controls + a Character that is way too slow=Bad Game  1/10",
            "review_score": "-1"
        }
    ]
}