{
    "app_id": 388360,
    "name": "Shoppy Mart: Steam Edition",
    "release_date": "2015-09-25",
    "developer": [
        "Pezomi"
    ],
    "publisher": [
        "Pezomi"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Simulation"
    ],
    "achievements": 25,
    "positive_ratings": 51,
    "negative_ratings": 23,
    "price": 1.99,
    "description": "You've just been hired as the newest checker at your local Shoppy Mart. You'll be tasked with bagging groceries for the endless waves of customers that will enter your store on a daily basis.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/388360/header.jpg?t=1476634695",
    "minimum_requirements": "OS: Windows XP, Vista, 7 or 8 Processor: 1.2 GHz processor Memory: 512 MB RAM Graphics: 128MB graphics Storage: 150 MB available space Additional Notes: Screen resolution of 1024×600",
    "recommended_requirements": "OS: Windows XP, Vista, 7 or 8 Processor: 1.4 GHz processor or faster Memory: 1 GB RAM Graphics: 256MB graphics Storage: 150 MB available space Additional Notes: Screen resolution of 1920x1080",
    "reviews": [
        {
            "review_text": "After working as a cashier for a couple of years, I quit and promised myself to never, EVER, go through the horror of dealing with annoying customers again. I did miss the satisfying beeps products being scanned... so I paid money to do my old job without actually getting paid for it. At least now I can swear at those moody turds without the fear of getting fired.",
            "review_score": "1"
        },
        {
            "review_text": "You have to play a grocery store cashier. Your main task is to scan objects and to lay out things in bags. It is your responsibility to hand out leaflets to chat with customers and ask for loyalty cards all day, every day! The game you will appreciate hand-drawn graphics, a diverse array of clients and hundreds of food products. And now about the pros and cons of the game. Pros: +Many clients +Hundreds of different products +Trading Cards +Achievements +Price Minuses: -No Russian language  The game is not for everybody, but worth the money! I recommend!",
            "review_score": "1"
        },
        {
            "review_text": "This game for me is a little bit hard to follow (abput how to play the game)but it does have a positive side to it like, having a better understanding of how you would work at a supermarket like Tesco or Sainsburys.",
            "review_score": "1"
        },
        {
            "review_text": "I waited a long time before finally deciding to buy this..here is my review:  PRO's: *Unique and there is not another like it that I have seen. Graphics are old school BUT that is made up in many ways.  *Customers are unique and each have their own personality, and it's just awesome when some come in the store saying 'grumple grumple' and are in a bad mood..this makes it fun and adds it's own personal touch.   *Easy mode for those who do not like to be pressured with a time limit   *New items unlock as you play..as well as your choice of a new customer.  *Christmas theme update from the dev is nice, but I hope it gets replaces soon as it's getting old fast. But it's nice to see the game still being updated  CON'S:  There aren't really too many..but there are some.   *No save function..there is a save/load button but it only loads the last day you were playing, it will not save. And a few times it has actually started my game over.    *Controls are not smooth. For a game that is in it's final phase I would think most bugs would be gone..however browsing the forum to post about MY issue, I see nothing but error posts from other people. For example, picking up items sometimes takes a few times before it actually works, same for dropping in the bag, sometimes it's annoying that it just falls on the counter when you clearly had the bag open when you dropped it. Trying to put money into the register or handing the receipt to customers most times takes a few tries..and it isn't that I am doing it wrong, because sometimes when handing the bag of groceries to customer it completely gets stuck in mid air. This can be a huge issue when playing in normal mode and you're down to the last 5 seconds before the customer gets mad and you get a strike..after I think 5 strikes it's game over, period.    Overall the game is a nice one..and the dev is still updating it. I def reccomend this game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "True to life, working the cash register makes me frustrated with myself.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty ♥♥♥♥♥♥",
            "review_score": "-1"
        }
    ]
}