{
    "app_id": 388450,
    "name": "Spooky Bonus",
    "release_date": "2015-10-15",
    "developer": [
        "Grey Alien Games"
    ],
    "publisher": [
        "Grey Alien Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Match 3",
        "Puzzle"
    ],
    "achievements": 19,
    "positive_ratings": 108,
    "negative_ratings": 5,
    "price": 6.99,
    "description": "Uncover dark forces emanating from the heart of Old Town, and grab spooky accessories for your front yard makeover, too! You’ll be spellbound by this adorably ghoulish horror-themed puzzle game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/388450/header.jpg?t=1553682780",
    "minimum_requirements": "OS: Windows XP Processor: 1GHz Memory: 1024 MB RAM Graphics: 64MB VRAM Storage: 35 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "+halloween +earn money for decoration house +easy to get all achievements +nice wallpapers +reach from 1 level to 100 +choose relaxed or timed +nice art +powerups I enjoyed this game well. ",
            "review_score": "1"
        },
        {
            "review_text": "This actually turned out to be a nice match-3 game.  'This is Spooky Bonus; a PC puzzle game with 100 levels by Grey Alien Games, a division of Jake Birkett Computer Solutions Ltd. The game was developed with Blitz Max.'  1. Does not run on the Unity Engine! YES! 2. Playstyle is like the Puzzle Quest (MPQ) or Bejeweled match-3 style. 3. Can make match 4, 5, etc. 'L' and 'T' shapes, etc. Sometimes tiles need unlocking, etc. 4. Don't have to wait for the board to settle before making your next move. 5. The special power tiles that appear on the board you only have to click or drag them to activate. (Doesn't have to be part of a 'matching' movement). 6. Game can be played in 'timed' mode for more of a challenge, or not, for a more casual feel.  The music is decent, in fact I turned the sound effect volume down a bit and put the music to maximum. (In comparison I play MPQ with both music and sound effects disabled).  So far I have played up to level 20 and being a veteran to the genre I have not had any issues. The gold I have collected so far has been enough to buy all the items I have unlocked so far. I have only played each level once, so have not had to grind at all. There is apparently 100 levels in total.  Usually each level will involve either collecting enough tiles of a certain type, or clearing a specific set of tiles on the board. The 'specific set of tiles' clearing is similar in playstyle to the '7 Wonders: Treasures of Seven' match-3 game (without the rotating board though).  Overall this game is an enjoyable experience for beginner or veteran match-3 players and is an excellent starting point for anyone that wants to get into the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Another nice game by Grey Alien Games. Casual; easier than many match 3 games as it can be played timed or not (even timed, most levels were not much problem). Not as in depth a story as say my favorites of this genre, Puzzle Quest or Might and Magic: Clash of Heroes. This is more in the vein of Grey Alien Game's other game on Steam, Regency Solitaire; not much story, but you get to collect items for your house which also act as power-ups. Workable background pictures and some interesting layouts. 100 levels to complete and fairly easy to 100% achievements if you go through the entire game. It is somewhat addicting (a good sign of a casual game). Finished 100% in about 12 hours of play. Looking forward to more from this developer!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game to just relax. The halloween theme is nicely catered to and the music is suitably mellow with halloween overtones. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This video features a non-biased quick look @ the game:         YouTube™ Video:  ➜ A Quick Look @ 'Spooky Bonus' (GeForce GT 640, Windows 10)&nbsp;",
            "review_score": "1"
        }
    ]
}