{
    "app_id": 388410,
    "name": "Darksiders II Deathinitive Edition",
    "release_date": "2015-11-05",
    "developer": [
        "Gunfire Games",
        "Vigil Games",
        "THQ Nordic"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Hack and Slash"
    ],
    "achievements": 50,
    "positive_ratings": 5935,
    "negative_ratings": 2063,
    "price": 24.99,
    "description": "The ultimate DARKSIDERS II experience! 1080p native resolution. Reworked and tuned game balancing and loot distribution. Improved Graphic Render Engine for even higher visual quality, lighting and shadows. Improved and reworked level, character and environment graphics.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/388410/header.jpg?t=1496741638",
    "minimum_requirements": "OS: Windows XP, Windows Vista SP1, Windows 7, Windows 8 or Windows 10 (64bit) Processor: 2.0Ghz Intel® Core™2 Duo Processor or AMD equivalent Memory: 4 GB RAM Graphics: NVIDIA 9800 GT 512 MB Video Card or AMD equivalent DirectX: Version 9.0c Storage: 13 GB available space Sound Card: DirectX compatible Sound card",
    "recommended_requirements": "OS: Windows 7, Windows 8 or Windows 10 (64bit) Processor: Any Quad-core AMD or Intel Processor Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 260 512MB Video Card or AMD equivalent DirectX: Version 9.0c Storage: 13 GB available space Sound Card: DirectX compatible Sound card",
    "reviews": [
        {
            "review_text": "Darksiders 2 is probably one of my favorite aRPGs in recent years/ Althought the Deathinitive Edition does currently have some performance issues, the support that Nordic Games offered for Red Faction: Guerilla makes me optimistic that they will continue to work with the community and patch it to work properly.  I enjoyed the original Darksiders, but the sequel expands and improves on every aspect. Some quick comments.  - The graphics are indeed much improved. Crisp, clean, and the cel-shaded inspired art style is lovely with the overhauled lighting.  -The music, as in the original version of this game, is outstanding, and easily some of Jesper Kyd's best work. Equal parts gothic and celtic inspirations make the soundtrack well worth remembering.  -The voice acting, and the characterization of Death in particular, is exceptional. My biggest issue with the original Darksiders was that War was basically a grimdark Space Marine. Death, on the other hand, is always handy with a bit of much needed snark, sarcasm, and even the occasional moment of sensitivity. This is the reaper as I like to envision him.  - The gameplay is quick, satisfyingly punchy, and has a gentle learning curve with a high plateau. Playing with various specs and active abilities is quite enjoyable, and finding an upgrade for your equipment is always nice.  Overall, I would wholeheartedly recommend the Deathinitive Edition for newcomers to the series. For anyone who already owns and has played the original release of the game, you will not find anything new here, but revisiting a fine game in revised form is very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "  Very colorful graphics, beautiful and different worlds, artistic backgrounds.   Full voice dialogues, but they are a lot and after some time they become monotonous. However, they can be skipped.   Very good sound effects and amazing soundtrack, especially on boss-fights. By the way, some of the bosses are pretty awesome.   Similar gameplay with Darksiders 1, BUT you have to get used to the camera. It is not so free to control like in the first game. There will be many frustrating moments with bad perspectives and confusing movement. Therefore, you will fall from various cliffs a lot, until you figure out how to control your character effectively on each difficult spot.   You can earn XP, level up and get skills, different weapons and armor. Very large quantity of items. It feels like playing a MMORPG. Also, some weapons have special abilities.   Many skills and some of them are similar with Darksiders 1.   Each world has main areas and each one has a number of similar puzzles to be solved. So, the gameplay may feel repetitive after some time.   Huge campaign. The story continues from Darksiders 1, but with different character.   Death doesn't look so cool as War from the first game.   Again, boring secret items to collect and you'll have to visit again all areas searching.   There is also an arena, where you can fight various battles for bonuses. Grinding like hell, as you have to fight around 100 times to finish it. Reminds MMO as mentioned before, but it's so tiring and adds to the negativity of the repetitive gameplay.   PS. Death can do parkour? LoL :b",
            "review_score": "1"
        },
        {
            "review_text": "Darksiders 2 is a great Action-Adventure with RPG elements. The apocalyptic rider 'Death' is on an epic journey to proof his brother 'war' unguilty. During his journey he visits several places, the creators forge, the realm of the dead and other mystic locations.  The gameplay is like a combination of the old Tomb Raiders (1-3) Castlevania, and Lords of the Fallen. Challenging boss fights, climbing adventures and artifacts collecting makes fun for many hours. This game became one of my alltime favourites in a very short time.  Rating: Graphic 8.5/10 Sound 9/10 Gameplay 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A great Deathinitive edition . I bought it on sale for 3Euro , but now , after I played almost 50 hours , I would buy it even for 30. Really nice graphics , amazing gameplay , you can chose from 2 main builds (necromancer or warrior) , some quests are really awesome and funny ,the story is OK , BUT there are some major bugs with the saves , and some in game bugs . But the overall game is amazing , definitely buy it if you like hack n slash games or you played Darksiders 1 .",
            "review_score": "1"
        },
        {
            "review_text": "its a good patch up of the old game most of the bad reviews are du to a few glitches that they've already fixed.",
            "review_score": "1"
        },
        {
            "review_text": "In the previous game you played as the Horseman War. This time around you play as Death, one of the remaining three riders of the Apocalypse and, parallel to the events of the first game, you will do your best to find a way to absolve War of his supposed crimes.  Darksiders II offers similar gameplay as its predecessor at its core. However, this time around the designers and developers wanted to go bigger and a bit more complex. As a result, the game offers a much larger world, RPG-like character progression with skill trees and an RPG-like inventory system. Apart from Death's main mission, you will get a chance to solve a few sidequests as well and reap some additional rewards from them too.  The action is still as fun as it was in the first Darksiders and Death has some pretty nice moves himself. It's just a shame the spectacular gory finishers aren't as present in this game as they were in the first, but are tied to a specific weapon stat.  Even though the composer is different, the music is still excellent, handled this time around by Jesper Kyd - a name people who played most of the Hitman games and the first two Assassin's Creed games might recognize.  While Darksiders II is still a very good action adventure game, if I had to pick which of the two I enjoyed more, I would have to go with the first Darksiders. Most of the flaws that affect this choice aren't that big, but put together they result in a slightly worse impression for me.   This game does offer a larger world, but the switch from a ruined, post-apocalyptic Earth to four completely different worlds as the main setting also caused it to lose some of its charm. The bigger issue, in fact, is that looking at each of these four larger distinct worlds individually - their subsections are not as interesting, detailed and visually diverse as the various sections the first Darksiders offered in a single world. They also often feel as if they were made that big simply to justify the ability to ride your horse (you are a  Horseman  of the Apocalypse after all) and are rather empty as a result.  Several sidequests are tied to (a tediously high number of) various collectibles and are not that interesting. On the other hand, for a game that tries to go down the RPG lane, it offers too few sidequests for such a large open world - this contributes to that feeling that the world is a bit empty. In general, I feel that trying to add more RPG elements and going with a bigger world at any cost didn't do Darksiders that many favors (as much as I love RPGs).  There are many other tiny nitpicks I could name, but I will skip them in favor of one big problem - bugs! The first Darksiders was quite polished (apart from the Steam achievement thing, which becomes a non-issue once you know about it). This game, however, has quite a few bugs. At random points after prolonged play the sound will stop working and will not go back to normal until you restart the game. Using the Steam overlay will cause the controls to stop responding at a random point and the game will act as if in a paused state, fixed only by going back to the main menu and reloading your save. The horseriding is a lot more clumsy and you may end up having to dismount to get unstuck. At rare occasions you may also end up stuck inside a wall, causing you to reload your save game. These are just a few of the most annoying issues I encountered and I am really surprised they weren't addressed for the Deathinitive Edition.  Despite the amount of text I spent talking about the flaws of this game, I still highly recommend it, just not as highly as the first Darksiders game. Still, if you can get past the bugs and some other potential flaws, you will have quite a bit of fun with Darksiders II.",
            "review_score": "1"
        },
        {
            "review_text": "F***ING GREAT GAME! even better than the first!  it's like zelda, meets god of war, meets diablo, meets some open world game, meets prince of persia, meets portal, etc.  LIKE ZELDA: visit this castle here, solve puzzles and find secrets areas which contain special items of sorts.... then go to that castle there and do the same.....fight the bosses. similar to zelda.  LIKE GOD OF WAR: combat is like what you'd find in god of war...as is the scenery and background areas...and some boss fights.  LIKE PRINCE OF PERSIA: run accross that wall there to get to that platform there, then jump to the bar sticking out of the wall, then run accross a bit more of the wall, jump off at the corner of the wall onto the wall it connects to and keep running a bit further to hit that platform.  LIKE PORTAL: open a portal here, and one over there. go through one to come out the other. use this to get to certain areas unreachable. also use this to solve puzzles. similar to portal 1 and 2.  LIKE DIABLO: kill enemies and pick up new weapons gear, cash, etc. level up and use skill points just like diablo.  upgrade weapons, abilities, etc. buy new comboes, and other upgrades, etc  game is pretty open, i wanna say it's open world.   PROS: amazing graphics! great story upgrading system battle system is great visuals/scenery is cool looking open world secret areas with special items boss fights etc  CONS: beat the entire game, no cons, no bugs, no glitches.  i rate this 9.9 out of 10 ;)",
            "review_score": "1"
        },
        {
            "review_text": "If you have this game, i assume you guys have already have (or played) the orginial Darksiders 2. Same game, improved graphics and optimization.",
            "review_score": "1"
        },
        {
            "review_text": "Played DS1 on steam and then DS2 as cracked . then bought DS2 just bcoz i loved this game and want to give the devs the due share .. but this DS2-death edition on sale for people who already have both is really a rip off .. i just got it as i love this game and want to see what graphics enhancments have been made .. it looks a little much better ..  get when it is cheap .. i am 50-50 on recommending it .. as i dont like to pay again for the same game and i love this game :) .. the only one in a long time i am playing twice and enjoying !",
            "review_score": "1"
        },
        {
            "review_text": "Graphics = Good Gameplay = AWESOME Story= amazing Steam sales= extraordinay o.O Why would they give such a masterpiece for -90% of it's price? The game just rocks.I will be waiting for Darksiders III in the future.",
            "review_score": "1"
        },
        {
            "review_text": "After the beta patch the game works fine for me (no more crashes and shooting mode sensitivity is fine).  Performance is also improved. I no longer drop from 60 fps with max shadows.  This is a pretty decent game.  Semi-open world Intricate dungeons Loot Combat system kind of like the one found in games such as DMC Parkour / Wall traversing system Puzzles Beautiful art style. Textures, shadows and lighting look good in this version.  Can't comment on the story just yet but it looks promising.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay TBH I expected more combat, like in Devil May Cry. I'm disappointed it's actually more of a parkour Zelda, but that's nothing against the game. Hunting the chests is fun. The dungeons and puzzles are well designed so far. Scaling walls and mastering the climbing is rewarded. I'm wary about backtracking. I hate intended backtracking. The world design lead me straight to an interesting dungeon I had no business attempting. It turns out the boss in there is an optional bounty, intended for characters lv6-12. I was barely level 2. I barely knew I or enemies _had_ levels yet. Yup. It's by the first cool merchant in the open world, and entices you with a chest. Why? Just block it off with an NPC or the hooks that already made me skip several chests.  Combat is fairly rewarding. Small groups of mooks are frequent and trivial, but that's expected. So far the boss fights have been neat and somewhat unique. As easy as it is to just mash light and heavy attack, encounters start to take some thought about dodge direction and how to utilize your active skills. So far most encounters are small and short. Maybe that will change. I'm not far.  This all said, it's fun and I probably will play it through. Secondary weapons seem to somewhat matter. Loot is cool. The demonic weapon upgrading is neat. The skill tree seems decent. I like you can respec, but it has a low-reasonable currency cost. Some old posts online imply you can actually have a 'build' by the end between the trees and gear. Not all solo ARPGs let you differentiate that much.  Graphics I'm impressed. It looks and runs great. I like the art style a lot. The first ice boss has a cool model and looked sharp. In game looks better than the video, more like the provided screenshots. I'm not experiencing the performance issues that generated most of the negative reviews. I assume they've been fixed. That said, I'm &lt; 6hrs in as of this review.  Controls/Mechanics Combat is smooth. Lock-on could have been a toggle instead of a hold, but it's fine. I would have preferred trigger+button for assigned powers over bumber+button, but also fine. As much as I love the look and idea of the horse, I wish they would have just given a sprint. The horse is allowed in very limited locations. Also, while I'm impressed they did seemingly pretty fluid mounted combat, it doesn't end up working. One hit knocks you off the horse, and unmounted (standard) combat is too far superior to be messing around on horseback anyway. I find myself moving through many areas wishing I could run faster, especially when retracing steps for a chest or to find/restart a climbing puzzle.  Climbing is generally impressively smooth. Honestly, I expected ♥♥♥♥♥♥♥t like missing beams or constantly jumping 90 degrees off of my intended jump angle. That's actually quite rare, and usually my fault when it does happen. My only complaint here is when you can't jump onto or scale surfaces you definitely should be able to. Sometimes they're well under the standard jump height, with a gap in the walls/railing and everything. Just be aware there are well designed paths with generally obvious objects/textures, and you will be using them, even if it means going around or reconsidering dungeon rooms. Think more Drake's Fortune treasure puzzles, less Assassin's Creed.  This was a steal at $3. It's probably worth full price.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. It's a remastered version of the game, with all DLCs included.   Just be careful that you might delete your autosave due to alt-tabbing at the wrong time. And it's final because the savefile doesn't get saved to Steam cloud (unlike the original Darksiders 2). No way am I replaying those lost 29 hours...",
            "review_score": "1"
        },
        {
            "review_text": "To start out I'm a long time Zelda fan, so it should come as no suprise that I like the game. The game needed to fixed it was buggy and crashed often. Sadly they didn't adress that many glitches, and just enhanced graphics at least from my experience. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, but can get boring after completing the main quests. You can re-play the game on higher difficulty with all your gear you had when you completed the game for the first time. But all missions will reset.   Pros +Good Soundtrack +Good Combat.  +Big Maps but feel empty after playing for a while.  +Upgradable weapons/gear.   Cons -Some glitches with the audio and can get stuck in some places.  -Game crashes when talking to Archon most of the time if you are close to leveling up. -Boring after main story line as i said before.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game make me have a chicken",
            "review_score": "1"
        },
        {
            "review_text": "I love this game but the minimum has to be wrong my pc is atleast twice as powerful as any core 2 duo but I still get 10-15 fps on the lowes possible settings that is not playable especially cuz it stutters like a mofo",
            "review_score": "1"
        },
        {
            "review_text": "A wondefull game, that provides a full experience. The story is interesting and builds on the first game, allowing you to contol a complete badass - Death. It would have been better if the story mode was longer and deeper, but it's still interesting, however short it may be.",
            "review_score": "1"
        },
        {
            "review_text": "Never played the 'orginal' Darlsiders 2 but from what I saw about all the issues, they are fixed now. Bought it on sale for $3 just to try it but it's been really fun so far and runs/looks perfect. Similar to what I remeber from Darksiders but with some new aspects and overall just really fun to play. Would defintely have bought it for regular price had I known it was this fun. Don't let the negative reviews scare you away like they did too me. Maybe the game was bad at one point but it's great now.",
            "review_score": "1"
        },
        {
            "review_text": "People say that this version of the game is highly glitchy but really if you have a decent computer you should be fine.",
            "review_score": "1"
        },
        {
            "review_text": "they fixed alot of crap and now it works ",
            "review_score": "1"
        },
        {
            "review_text": "We complained and Nordic games listened, got Darksiders II Deathinitive Edition for free since I had darksiders 2 + season pass. I look forward to replaying this game, loved Darksiders II when I played through the origanial version. I've only played a small amount of the Deathinitive Edition but have enjoyed it so far.",
            "review_score": "1"
        },
        {
            "review_text": "Right now I wouldn't buy this game. Everything works okay for me, but a lot of other people seem to be having quite a lot of issues with it. I personally have no problem booting the game up, changing the graphical settings or anything to that description. But there is a HUGE issue right now. The aiming mode. It's impossible to do with a keyboard and mouse. If you have a gamepad ready, sure, go right on ahead. But if you're like me and prefer you old keyboard and mouse combo you're boned.  EDIT----------------------------------------------  So in a recent beta patch they fixed the aiming bug, so I would definitely reccomend to anyone who want to replay this outstanding game.",
            "review_score": "1"
        },
        {
            "review_text": "What can i say ? The game is very good but my only issue is that sometimes when i switch gear Death freezes :\\ i still recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Everything about it rocks. It's a bit too puzzle-oriented for my tastes but it really doesn't take away from any of the fun. Badass weapons, awesome enemies, huge bosses, great graphics, great soundtrack, super responsive controls, fluid combat, one of my favorites.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzles, great combat. Gameplay is similar to God of War and Prince of Persia. The only problem with this version of the game is it's often buggy. Sometimes the game will crash or you get stuck in the menus. Make sure to save frequently so you don't lose your progress. Overall great game :)",
            "review_score": "1"
        },
        {
            "review_text": "Darksiders is one of my favorite series. I played the loving crap out of the original DsII, so why should you? Well because IT IS FUN.  The Deathinitive edition is an improved version of the original. Includes all THE DLC, Better Graphics, Better Perfomance, and a NEW difficulty setting.  The gameplay is very similar to games like Devil May Cry, God of War, and Metal Gear Rising without being as punishing, while still remaining challenging on its own. You can Dial-a-Combo and destroy enemies, you can customize how you want to upgrade your skills, and equipment. This game has been compared to the Legend of Zelda, due to its combination of Open World, Dungeons and Puzzles. It is sorta like that but with better combat.  The graphics are amazing, the game is absolutely gorgeous. Most of the scenary is awe inspiring, the music is very memorable, and the voice acting is top notch ( Keith Szarabajka voice acting as the Crow Father is one of the absolute best in videogames). The Story is very similar to Spawn, if you ever read the comics.    Youy are certainly gonna have a good time with this one. It is one of the few AAA games that do never get old, due to its amazing visuals.  ",
            "review_score": "1"
        },
        {
            "review_text": "Finally, the version of the game that PC gaming deserved.  Updated graphics, integrated DLC, and a removal of that nasty Nightmare mode not many people really wanted to try...  The core game is stilll the core game, but the facelift goes a long way to enhancing the experience and the new items are a great addition to the boss fights. Some even scale with your level.  If you havent tried this game before, now is the time to jump in and swim or die.",
            "review_score": "1"
        },
        {
            "review_text": "Deathintive Edition is the title that needs to remind you that this franchise is dead. The Game is good, trust me. It's plays like it is the child of THE LEGEND ZELDA and GOD OF WAR in it's emo phase.                                                                    If you're wandering why I have 0 hrs on this game right now is because I played the PS3 version so I reckon it's the same game with updated visuals. And I need to finish Darksiders 1 so... bye.",
            "review_score": "1"
        },
        {
            "review_text": "  My View On: Nordic Games.",
            "review_score": "1"
        },
        {
            "review_text": "Take all negative reviews about bad fps, vsync bugs and stuttering and pretend they don't exist. They are not there. This is the perfect chance for all of you who missed this second episode or are curious about joining the franchise. Amazing overall chromatic touch, all dlcs included and great gameplay. You money is quite likely to be invested for the ambitious Darksiders 3, so don't be an ♥♥♥ and leave Nordic Games alone and keep up the good work. ps: they instantly answered to the 'archon bug' and told us how to fix it locally and then duly noted it for the next patch (which I didn't need to reach the end of the game anyway).",
            "review_score": "1"
        },
        {
            "review_text": "After playing the original 2 games many years ago on console I thought i would buy the franchise pack again on pc just because i love the series and hoped for a DS3.  Instead for now i have got a remaster of DS2 which i really wasn't expecting so i have decided to sit down and throw another 15 hours or so into this game to recapture what i have previously enjoyed.  If DS2 is fresh in ur memory getting this version might not be needed but for me I am pleasantly surprised with how much nicer this game now looks and the few little tweaks to balancing. I am not yet up to where the DLC kicks off but hopefully the integration into the game is smooth.  Pretty much if you enjoyed either of the Darksiders games picking this up seems like a no brainer for $6 on launch week.  This will fill the Darksiders hole i have been meaning to fill, hopefully till Nordic can make a 3rd installment.  All in all this is still some of the best hack slash loot action adventure rpg you can get.",
            "review_score": "1"
        },
        {
            "review_text": "I was waiting to reveiw until the game was patched. They were quick on the fix. The game is amazing. I recomend supporting this game. I love it. DLC integration is great! I cant be more happy. I look foward to the remake of 1 or the creation of 3! :)   Ride Death Ride!   Update: 6/3/16 So they never formally patched the game for end game issues that abbound. The fourms also disapeared. I dont know what happened. But with no notice. I can not recomend this anymore.........",
            "review_score": "1"
        },
        {
            "review_text": "  Finished it for the 2nd time  now I actually like it even more   This version looks &amp; runs better  but it's not perfect  ",
            "review_score": "1"
        },
        {
            "review_text": "UPDATED: 85/100   Runs extremely well on OUTDATED GTX 970 drivers. And with ♥♥♥♥♥♥ 6GB of ram, an old intel i7 ivy bridge 930, there's rarely any performance issues of any kind. Extremely rare to have frame rate drops. It does crash 1 out of 25 times you press ALT+TAB and only crashed once while opening the menu screen. Other than that, pretty much every issue has been fixed. Gameplay mechanics can be clunky but overall feel solid, organic and precise. Even GTA 5 runs 20x worse than DS2. Strays away from the generic and uninspired for the most part.   As you progress, the puzzles get boring, excessive and repetitive. There's some diversity but it just felt like the same crap over and over. There's still enough redeeming qualities to make it all enjoyable though.",
            "review_score": "1"
        },
        {
            "review_text": "Supposudly there was a crash issue on Day 1, but it's been fixed within a really quick window. So I can't hold it against the game.  As for a PROPER review.   This game is amazing. The characters and etc are created by Joe Madureira, a former cartoonist for Marvel. (It shows. Everything looks like it came right out of a comic.) The improved Graphics, textures, and lighting really help the game's comic book art style really stand out. (It's really great eye candy, and an example of a graphics update done right.)   The gameplay is unchanged from Darksiders 2, which is fine. Darksiders 2 is still a stand up when it comes to fantastic gameplay and level design. Though it is a bit lengthy, and some people can report growing tired around the third act.   I recommend this game a lot. Especially if you missed out the first time.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game and I recommend for all.  Darksiders II is the best action-adventure game that exists for PC. It is like a God of War of PC. I recommend for everyone. In this new version, the game is more beautiful than ever, it has new textures and effects.  I have no problems in run the game, no lacks or errors, some many people saying that the game has much bugs, crash more times, than you play, this was a fake for me.  The game is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Great game=) Just to support the devs against that wide of complaints for minor reasons! I hope there will be a DS3, I'm 100% for it=P",
            "review_score": "1"
        },
        {
            "review_text": "They just lubed me up ready for Darksiders 3",
            "review_score": "1"
        },
        {
            "review_text": "I own a bundle of these games , and this is far best one, great adventure action rpg. ",
            "review_score": "1"
        },
        {
            "review_text": "Kill some bad guys with Death",
            "review_score": "1"
        },
        {
            "review_text": "Action game Factor is introduced to make the game playable greatly increased, brush strange, money to brush, brush equipment, main line clearance to between 20 to 30 hours and perfect party is expected to at least 50 H +. After customs clearance and higher degree of difficulty of the expert mode, you try. Sincerity making + high playable early a good product, after all, spend hours downloading time can also experience the various 3a of the game experience, for the 'yellow Sha Baizhan wears a gold, do not break the Loulan not yet' brush party, why not do it?",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I decided to play it over from the beginning again from the previous version.  I got this as a free upgrade. If you like games similar to Zelda or God of War then this should be just right for you.  I also really hope they make a third.",
            "review_score": "1"
        },
        {
            "review_text": "I finished game at 100% and I missed to take 2 hidden chests in Vulgrims safe 4, and in Deamon castle in the past. Now I missing legs part of set-with-horns. Now I on NG+ and not able to get all of this.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, long playtime, fun dungeons. The battle system is almost perfect, just complicated enough that you won't forget what combos to use.   About the new edition - It's been patched up now and runs really well.  - The lighting system has been improved, shadows are crisper and shading looks much more realistic - Double resolution textures compared to the original  Some problems remain:  - Turn off damage number indicator as it's prone to crashes.",
            "review_score": "1"
        },
        {
            "review_text": "I DO recommend this game, however, I do NOT recommend this port. Whatever choices were made to improve this game have only crippled it. I receive better frames per second on my Xbox360 which is were I will continue to play this wonderfully quirky dungeon craweler. I recommend playing on either 360 or PS3 and hope that backwards compatibility on the new consoles keeps these great games alive.",
            "review_score": "1"
        },
        {
            "review_text": "Decided to buy the full bundle of both games on sale. I would recommend this one much more over the first game, unless you are really a fan of God of War and such (in which case you've already played it). This game has a lot better gameplay and execution from playing the intro of both.",
            "review_score": "1"
        },
        {
            "review_text": "You get to become Death.... so yeah just buy it. (especially if you like story focused action adventure games with tons of exploration, customization and giant $!#@$#@ bosses). Think that about sums it up.",
            "review_score": "1"
        },
        {
            "review_text": "I can understand why some ppl are upset about being charged. I'm running a GTX760/i5 2500k, everything is fine and looks amazing imo. Vsync keeps everything running smooth. Please don't let all the negative reviews deter you if you're new to Darksiders. Keep in mind it's a port and not perfect and enjoy, it's really an amazing franchise.",
            "review_score": "1"
        },
        {
            "review_text": "This game and me have had quite a story of violence together, it all began when i bought the game for my new wiiu, the damn thing couldn't get past the second 'real boss' of the game without crashing nor having framerate drops. Eventually i manage to build a pc and get the game installed in this one thanks to a steam sale (thanks steam) but as soon as i started the game the freaking thing had some horrid issues such as low texture resolution, and extremely limited options to customize de game itself, eventually i just kinda gave up on it and went to play other things, until now. The game so far, with the new released patch, seems to run quite well for the most part, my system (fx 8320/gtx 970) it's sadly not capable of keeping the framerate stable at all times, there's the occasional framerate drop here and there but nothing game breaking, even then it's messed up that a system like mine can't run a remastered edition of a game from the so called 'last generation' even then, after all this time, it's the best version that you can get, wich isn't saying much, but there it is, it's a shame tho, the game in my book it's truly an incredible experience, but just as many different games from now, one that gets burned by the technical issues that infest the entirety of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good.",
            "review_score": "1"
        },
        {
            "review_text": "THANK YOU SO MUCH NORDIC! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "  Very gud! Got it for free! Thanks! ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "  I remember it to be a very good game. it had great gameplay and good story.",
            "review_score": "1"
        },
        {
            "review_text": "graphics are sharper and some nifty ui changes, use my old save and works great. only drawback i see is it not counting past achievment progress, great upgrade i say.",
            "review_score": "1"
        },
        {
            "review_text": "  i cant i play with a gamepade? plz answere",
            "review_score": "1"
        },
        {
            "review_text": "This game, pre 'Deathinitive' wasn't without its problems, but still was/is a fantastic game. This version just kicks it up a little higher. The graphics really HAVE been improved...is it the best looking game ever? No, but it has a great art style. The higher resolution textures are noticiable and crisp, and the lighting is dramatically improved. The review bombing for it not being a free upgrade fro everyone is a bit frustrating, as it in no way reflects the game itself. C'mon, $6 for an improved version of the game is NOT bad. ie, there are enough changes and work into the game that the $6 is well worth it. If not, you already owned and likely beat the game.....  tl;dr - Game is great, with minor issues, this edition is impressively upgraded",
            "review_score": "1"
        },
        {
            "review_text": " :)",
            "review_score": "1"
        },
        {
            "review_text": "**Updated review** There've been three patches since this game was launched and they have addressed all the major complaints I've had. This version is now equal in stability and performance to the original release, and has slightly better graphics.   **Original Review** Was a big fan of Darksiders and Darksiders 2. I've played Darksiders all the way through maybe four or five times, and have played through Darksiders 2 three times prior to this remastered version.   Game immediately crashes upon starting. Have to reset settings and lower shadow quality. Why I need to not max out shadow quality on this graphical remastering makes no sense and should never have been launched with this issue. Started a new game and played through to the start of the cauldron. The camera feels 'shakier'. I had just started a new game on the original release a week ago, and re-launched it at the same starting area and it doesn't feel 'shaky'.  I had a cutscene that I couldn't use space to skip dialogue in. Was the first time I tried, so I thought maybe the button was changed. I pushed a bunch of buttons on the keyboard and mouse to no avail. When the cutscene finished, I spent the next ten minutes watching Death roll around and swinging as every queued up button press was executed post cutscene. After ten minutes I gave up and restarted the game.  Not happy with having to buy this for $6 because I don't own a combo pack. Overall after an hour or so of play I don't really see this as being worth it for someone who already has Darksiders 2. The graphical improvements are OK, but not worth spending money on. The only reason I am giving this game a thumbs up is that people buying this may help with getting a Darksiders 3 created, and that's a worthy goal.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorites games.",
            "review_score": "1"
        },
        {
            "review_text": "unlike every other review i would recommend it but if you have the game already dont bother buying this one as there are only graphical changes ( as far as i've seen ) , i got it for free as franchise owners get it for free , its cool yes but unless you buy the game for the first time and there is a big discount dont bother buying it.it may not be a subtle change but i think i felt a little stutering but that also occured on the original so it might be about 30 fps stuff ,  overall ; got it for free? awesome download it and play it on hd! meh its my fav game and it had a rework and handed to me for free i would say good guy nordic games",
            "review_score": "1"
        },
        {
            "review_text": "Got it for free, because I own the rest. Plays very well.  A positive review from here :)",
            "review_score": "1"
        },
        {
            "review_text": "&gt;be me &gt;nordic games ceo &gt;next-gen consoles are out but no next-gen games in production &gt;looks at the game list to see all the games we have published &gt;everyone of them sucks &gt;nordic games employee walks in &gt;'i know a way we can make more money with no effort' &gt;employee holds darksiders 2 copy in one hand &gt;sleeping dogs definitive edition in other hand &gt;calls the pc nerd steam department and asks them to remove our darksiders 2 game from steam &gt;pays game journalists to shill for our newest next-gen game &gt;announces nordic games' newest addition to the next-gen games &gt;Darksiders 2 'Spend All Your Money Cause You're An Idiot' HD Edition  10/10 Would make you spend all your money again cause you're an idiot. ",
            "review_score": "1"
        },
        {
            "review_text": "Darksiders 2, (one of THQ's most underrated games) remastered. What is there not to like about this edition?  If you're a fan of the series, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I had seriously forgotten how good this game is! It's like a cross between prince of persia (the platforms and puzzles) and some really good combo fighting game (the fighting).  Oh and not to forget the RPG... Even some weapons have upgradeable levels within levels!  Apart from checkpoints instead of saves, I can't see any downsides...",
            "review_score": "1"
        },
        {
            "review_text": "They say Darksiders 2 plays like a Zelda game. Well, I bought a Wii just for Legend of Zelda: Skyward Sword. After about a month I stopped playing Skyward Sword. I've played Darksiders 2 from start to finish on Xbox 360 and now I'm doing it again with the Deathinitive Edition! So yeah, it's that great of a game! Deathinitive Edition or not, do play this game if you're into action-adventure games. I am personally pleased with the DE version though. Everything looks sharper, smoother and more clear, which really helps with all the collections you wanna find in this game. Music is great as before, so there you go. A nice suprise what I didn't expect was the all-new difficulty, Deathinitive. This is a must-play difficulty. It's such a great challenge without it becoming frustrating. Enemies are more tougher so it really makes you step up your game. It's a delight!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, yes, yes, GOD yes. The update is worth it. A must get!",
            "review_score": "1"
        },
        {
            "review_text": "My previous review of this game was unfair and wrong, I didn't know how to set up the controller until I googled how and for unknown reason the game runs at an excellent 60fps now.  So I'd say it's a good hack'n slash puzzle game with an alright fantasy storyline and a very good array of weapons and equipment, only a couple of downsides. The Deathinitive Edition hasn't appeared to have made a massive difference in graphics quality so be aware of that also when it is loading in new ares of the map the fps can drop substantially and if there are enemies you are kinda screwed.   Overall it's a good game but buy it in a sale as it isn't worth it's full price.",
            "review_score": "1"
        },
        {
            "review_text": "a very addictive game, u can never quit, just look at my time spent on this game!",
            "review_score": "1"
        },
        {
            "review_text": "After few bug fixes, I can think that it is better to have this compared to the last due to the great graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Overall this game is pretty fun but it's not with out its bad points i'd give it a 7/10, the worst part about it is that if you're a complitionist then there is alot of backtracking and hidden area that you'll need to remember to return to, for this reason the game becomes much more annoying. The combat is fun and the branching abilities are cool.",
            "review_score": "1"
        },
        {
            "review_text": "Working through a backlog of steam games, some of them are ♥♥♥♥ing trash. This one is not trash. They kinda ape the portal ♥♥♥♥ which my brain sucks at doing but it was great. The ultimate edition is cool, but I never have the patience to go back for all the DLC stuff anyway.",
            "review_score": "1"
        },
        {
            "review_text": "There ton's of technical issues but the game by itself is good if you can coupe with them than the game is good fun for 10$ Steam needs Neutral opinion",
            "review_score": "1"
        },
        {
            "review_text": "Hope to play more of this series of game. Good story line and game play worth while to play . one of the nicest game that made me addicted.",
            "review_score": "1"
        },
        {
            "review_text": "Has some epic fights!",
            "review_score": "1"
        },
        {
            "review_text": "The first time I played Darksiders 2, before this edition existed, I got very frustrated with it about 25 hours in and gave up; it felt a little grindy and pointless. I don't know if the change was in me or in the 'deathinitive' edition, but this time I didn't hit that same wall. It looks a little prettier, but the main game felt mostly the same; however, whatever changed was enough to carry me through the last 5 hours to actually beat the thing.  Having played all the way through, I have to say I would recommend it; the graphical improvements are nice, and the base game is pretty solid, too. It's far from perfect - some areas feel bloated, some fights are unfair, some collectibles are hidden really annoyingly, and the ending is meh - but I enjoyed it quite a bit.",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE 25.05.2016  First this game is like playing Portal, I'm not the average FPS player but after a while some puzzles are becoming annoying and ridiculous. Sometimes the enemies are killing you from a bunch of blows and you can't react, on deathinitive difficulty you can say that you play Dark Souls, you need to be a bit careful in choosing your gear and build. The controls are a bit broken, they don't respond sometimes and this can be very difficult when you need to execute your enemies for example, pressing the E key multiple times don't help to much. The grafic on this version is very nice but it's still suffering from flickering and other glitches, the music is nice and the sound can be bugged sometimes. I still recommend this game if you can get it a little cheaper on a sale or something. I tested this game on Win 10 and is working very good, most of the crashes I had were from alt+tab.  LE: In Deathinitive Edition you won't have the DLC items from the beginning of the game like in original version, you need to find them.",
            "review_score": "1"
        },
        {
            "review_text": "Update: 11/22/15   So I've been playing this remaster edition of DS2 for a while and I'd like to say the game is actually better than what I thought previously. Although it had some really nasty bugs during its initial release, the developers had fixed them (at least in public beta) and now it runs very well on my laptop.  Current Issues: They are small and do npt pose serious problems to pro gamers.  a) On your way to the Drenchfort, there's a chance that you will fall infinitely and eventually die while you're riding the horse.  b) The Makers' chest area (Aylia) seem to have a resolution issue, since its texture was not smooth but made of chunks of small squares.  c) The game wouldn't stop running after you exit sometimes. It happens occasionally when you've played the game for several hours.  Let's talk about the pros:  Besides the apparent better texture and shaders, the gameplay system in this remastered edition is well-balanced. Old players won't really appreciate the beauty of it until the later stage of the game. I personally had complained about not being able to access my DLC weapons instantly before. Now I actually think it is a well-considered idea to let players gain access to them 'when the time is right'. Trust me, it makes the gameplay so much smoother, because you get to use better weapons and armors when you really need them.   Comment: Changed my opinion from Not Recommend to Recommended. Still, looking forward to seeing the developers improve the game further.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Like Zelda with a sense of humour and God of War style combat mechanics. What's not to like? My only criticism, aside from a few technical glitches, is that they could really have employed a sprint button when Death is on foot. Otherwise, roll on Darksiders III.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game overall, its just to bad that after 22 hours the game freezes in the final boss fight every single time. You cant ever finish the game but for $2 i got my enjoyment out of it.",
            "review_score": "1"
        },
        {
            "review_text": "God Of War on bathsalts. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "The game was pretty fun, and offered a lot of content, and things to collect. I do wish there were more side quests however. I will just quickly make my pros, and cons list. I will say first though, that i did not run into the glitches, and bad performance (for the most part) that i see in the forums,and reviews. My game ran above 100fps most of the time, and goes low as the 80s at worst, although there were a few small parts of the map that made my game drop into 40s out of nowehere, but that happend rarely. So here we go:  Pros: Fast, fluid, and fun combat. Tons of loot to collect. Lots of chests, and other secrets to uncover. A lot of different abilites to unlock, and use. Decent puzzles A decent story A really cool, and edgy main character. Some areas of the game were crisp, and beautiful to look at. A rather large variety of enemies A very good soundtrack  Cons: Not many side quests Some other areas were bland, and grey. Most boss battles we mindless mashing with no strategy, or puzzle involved.  Ending was dissapointing, and rushed.  Not many other likeable characters.  Camera angle was a bit wonky. The game felt mostly easy all the way through, except with a few bosses Horse riding was rather dull, and had clunky controls, and was rarely used/needed.  Well thats about how i feel about the game after beatingg the main story. I recommend this game to anyone who likes hack'n'slashers mixed with puzzles. The world is big, lots to do, and explore. It is a great game, but not without flaws. I can only imaine what my score would be if i did have all these glitches, and performance issues many gamers keep talking about. I for one, am glad i didn't run to any of it.   I give Darksiders 2 an 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is such a massive improvement over the first game. I thought the first game was just very average but this game is a genuinely good game that almost comes close to greatness. The combat and platforming is so much more fun in this game and it is the biggest improvement over the original. I loved the addition of the rpg elements and I loved the looting system that they introduced it just made you more invested in the gameplay. I also think that the dungeons are much better designed and more creative than in the original and I really enjoyed the open world in this game as well. Great soundtrack as well by the genius Jesper Kyd, it made the game feel a lot more epic. Great boss fights as well which is something that the first game lacked, I pretty much hated the boss fights in the original. The thing that stops this game from being great for me is my enjoyment level fluctuated a lot, there were times where I thought this game was amazing and i was having so much fun during those moments and at other times I thought the game slowed down a lot and I was having nowhere as much fun as those other sections of the game. I don’t think it’s a pacing issue I just think that some dungeons are much more fun than others. Also the story didn’t really grip me or made me interested into what was going on, I do think the story is a lot better than the original however.  7/10 (Good)",
            "review_score": "1"
        },
        {
            "review_text": "Just like the original Darksiders, Darksiders II is a great hack and slash adventure game. It has a few bugs but most of them seem to be from Steam UI. Awesome to paly with a controller, slightly less so with keyboard and mouse. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Darksiders 2 is such an underrated game. I am more of a multiplayer kind of person, but this is a game I can come back to.  A mixture between Zelda and God of War.",
            "review_score": "1"
        },
        {
            "review_text": "Looking forward to number 3.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game , hopefully they will make part III as well .",
            "review_score": "1"
        },
        {
            "review_text": "More fun than I expected.",
            "review_score": "1"
        },
        {
            "review_text": "Good story, better jogability than Darksiders 1, the map is bigger and the story gets even better. I recommend this game for players who enjoy playing games like God of War or Devil May Cry.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, just wish the wall climbing bug would be patched. Its really annoying but otherwise, great game, cant wait for the next one!",
            "review_score": "1"
        },
        {
            "review_text": "More ...we need more... where is Darksiders III? Please whe need more... this game is f..kkiingg cooll..!",
            "review_score": "1"
        },
        {
            "review_text": "I'm hoping to see this version improved with patches, but as of right now, for me it's so buggy it's pretty much unplayable",
            "review_score": "-1"
        },
        {
            "review_text": "As I expected, a the only new in this version is the graphics, nordic games made sure to have all the bugs from the original. Crashing all the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Should have been released as a patch for the original darksiders 2 published by nordic games that I actually own already.  I ESPECIALLY don't see how they can justify charging extra for it when it doesn't even work.  It crashes to desktop as soon as I try to actually start the game.  I thought I would give them the extra money after seeing a video on youtube that showed great improvement... but it seems they failed to bug test and I am not going to accept such a shoddy product. I'll take that refund now thank you.",
            "review_score": "-1"
        },
        {
            "review_text": "Cant believe im saying this but this is BS cant even start it up 'darksiders.exe has stopped' every single time i try to play",
            "review_score": "-1"
        },
        {
            "review_text": "Faqin' joke  This game crash everytime I try to load savegame.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game but there are performance issues and bugs. Devs are currently unresponsive. If they actually provide some decent updates i'll change my review to positive.",
            "review_score": "-1"
        },
        {
            "review_text": "Deathinitive still randomly crashing.",
            "review_score": "-1"
        },
        {
            "review_text": "Great!  I now have two darksider 2 games... That I dont play... in my library",
            "review_score": "-1"
        },
        {
            "review_text": "[EDIT.] Patch seems to have made it playable.  I'm a big fan of the darksiders games, I appreciate getting this edition free I've just no idea why it exists..  Why not just update the existing game? Doing it this way seems to have casued a number of other problems not least being ♥♥♥♥♥♥♥ off half the fanbase..  I don't know, this whole thing reeks of incompetence.  As it stands, there's no discernable reason to get this version over the other.",
            "review_score": "-1"
        },
        {
            "review_text": "Where are all the DLCs from the old game?",
            "review_score": "-1"
        },
        {
            "review_text": "I got this for free but that don't mean I'm gonna give it a good review. I love this game, but its so annoying to play. Stuttering and low FPS. Compared to the original, this runs like horsemanure.  Until its fixed, I'm giving it a thumbs down. This review is not for the game though, its a fantastic game, but at its current state, its unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Corrupt save, every time. Without any reasons.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing the first one, I was expecting much of the same. Unfortunately this game was a let down compare to the first one. Leveling system, picking up gear - would have preferred the old format. Strayed too far from its roots for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Awful controls, so difficult to actually dodge the direction you want without using the dumb 'Focus on enemy' thing, you'd love this game though if you're a dumb console gamer....  If you downvote you're obviously a fanboy that is butthurt because I stated somkething true that is bad about the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Apart from some intersting puzzles, this game is, gererally speaking, STUPID! The worst parts are the fights against the different bosses as they become more and more difficult and stupid. Don't waste your money on this game if you look for a good RPG and, at the same time, save your IQ... It is, mostly, a platform game not an RPG.  By the way, dear Steam, I was blocked a couple a time and couldn't publish my review because I was supposed to have played at least 5 minutes. Either I am a champion and I reached level 11 of this game in less than 5 minutes either there is some sort of issue in the way you register the time played.",
            "review_score": "-1"
        },
        {
            "review_text": "Nominated for The “I'm Not Crying, There's Something In My Eye” Award. Port is so bad with so many bugs and technical problems it will definitely make you cry.",
            "review_score": "-1"
        },
        {
            "review_text": "By now literally unplayable. Every time I open up the options screen, I can't go back to the game and have to hard-quit it using the Taskmanager. Would probably be fun if it actually worked.",
            "review_score": "-1"
        },
        {
            "review_text": "Movement doesn't flow smoothly like it did in the first game and in the half-hour I spent playing it, it froze three times",
            "review_score": "-1"
        },
        {
            "review_text": "A wonderful game and nicely well remastered. It looks great. The problem with Darksiders 2 is that it goes on too long. Quantity over quality. They should have made it half the length with twice the interesting story and characters. Even so I think this series is great  Edit. This version of the game crashes a lot.",
            "review_score": "-1"
        },
        {
            "review_text": "Twenty minutes in and it's not looking good. Four crashes in the inventory screen already. This was a poor purchase on my part, I wish I read the reviews first. Its the same game as previous release only with 800% more crashes. Any games with Vigil, Nordic or THC stamped on them from now on will be skipped if there is any degree of doubt. I've fired up the original game now and going to play that instead - not a single crash in that game so far. If you are considering buying this - don't bother. Refunding this garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh not a big change.",
            "review_score": "-1"
        },
        {
            "review_text": "Same like Darksiders.  If you like games where you have to walk around for hours after hours, idiotically repeating the same moves 10000 times over and over and over and over and over and over and over again you will like this game. I don't. Graphically nice, good music, the only challenge lies in the repeatedly increasing difficut to kill enemies that seemingly have 1000 times more health than you. Idiotic. Times 10  Plus - many bugs and crashes to Desktop at essential places in the game. For example - if you meet Archon and are about to level up - crash. Accidentally hit ♥♥♥♥ tab to bring up the steam interface - lock up sometimes. Bad programming in cooperation with idiotic game desing.  ",
            "review_score": "-1"
        },
        {
            "review_text": "it crashe all the time i cant even finish the arbiters maze  Its the 5th time im doing it and it crashes its f***** frustrating !!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Stay as far away as possible from this version of the game. The stuttering is unbearable, even on minimum graphic settings on a PC that perfectly meets the recommended requirements. Crashes when changing the graphic setting, resulting in further multiple crashes before being able to restart the game again. Do the 'improved visuals' make up for the technical issues? Not even remotely. Where rocks used to look sharp and textured, they now appear like smooth plastic. Where colours used to be vibrant and appealing, they now changed to washed out hues that do no longer convey the same atmosphere. A few added grass blades are simply not enough. Do not invest any money in this edition of the game, rather buy the original if you do not own it yet. If you already do...just don't get this sorry excuse for a remake.",
            "review_score": "-1"
        },
        {
            "review_text": "Mediochre attempt at making a better port. Laggy, broken, unplayable. All just for some higher resolution texture quality   Go play the original. It's not graphically stunning but it's playable, and a good game I might add.",
            "review_score": "-1"
        },
        {
            "review_text": "If darksiders is the future of video gaming, I dont want to be a gamer anymore. The combat consists of three buttons, attack 1, attack 2, and dodge. Once you learn to unlock your camera and dodge roll behind an opponent as he's winding up an attack, the game may as well give you the end credits. That is of course after you learn the abysmal consol port controls, and you will have to learn them. The game treats you like a baby with it's graphical options, the most advanced option avalable is Vsync on/off. Suffers from crashing, severe hitching, low-poly dated graphics, combat so patheticly shallow super smash brothers rip offs have less ♥♥♥♥-takeing simplicity, aids and ebola.  The story isnt entertaining, none of the characters likable, the game's progression boils down to 9 tedious fetch quests, the platforming is out of place and mediocre at best even with a third party perspective, using any weapon that requires use of the lock on is unusable with mouse and keyboard, as it will change your mouse from looking around, to a mouse cursor on a static screen as you're still moving around being attacked, prompted to aim and shoot by clicking on them without even being able to turn.  DO NOT buy this game. Do not buy any darksiders games. Even if you take away all the technical issues, give it visuals better than a university student's exam result and update proper PC controls, the experiance would still be as bland as eating your own snot.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was very boring, and it holds your hand the whole freaking time... Don;t waste your time on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Completely broken. During the first level platforming section, Death would grab onto a wall of vines and just get completely stuck. I restarted multiple times and it just happens over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont recommend this game, it's full of bugs.... Don't waste your money! At this point I can't even launch it, it stays in login screen all day.",
            "review_score": "-1"
        },
        {
            "review_text": "The combat is awful, the levels are big, empty and uninteresting and on top of that it runs like ♥♥♥. Just go play DMC4 or tomb raider. I regret that I wasted over two hours downloading it while I could be playing CSGO.",
            "review_score": "-1"
        },
        {
            "review_text": "  boring game , you will get dizzy of this ♥♥♥♥ not recommmended",
            "review_score": "-1"
        },
        {
            "review_text": "I think this game was a complete failure, in compereson to darksiders 1, it has nothing to do with darksiders 1, completely diferent game .",
            "review_score": "-1"
        },
        {
            "review_text": "Ever play a game that has so much in it, that it gets boring? That's this game. While I thouroughly enjoyed the first installment, I feel as if this one was simply too much. Is it a bad game, no. Is it a fun game, it has its moments. Can I recommend it? Nah. 6/10  Ignore playtime. Clocked in 22 hours in the original release.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a obvious improivemnt from the Original Darksiders but the constant crashes,bugs, and checkpoing system make this a game I would not recommend. It's combat, music and general gameplay are fun to listen to and play but is brought down with random control lockouts in bossfights that checkpoint you with a reset boss and you with no regen.",
            "review_score": "-1"
        },
        {
            "review_text": "  i got this version for free because i had the normal one so i thought why not try it out but the game is broken for me everytime i lvl up and spend a skillpoint my game stop reacting normaly tried reinstalling and all no use",
            "review_score": "-1"
        }
    ]
}