{
    "app_id": 388430,
    "name": "TankZone Battle",
    "release_date": "2015-09-21",
    "developer": [
        "Render System"
    ],
    "publisher": [
        "Render System"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Multiplayer"
    ],
    "achievements": 14,
    "positive_ratings": 58,
    "negative_ratings": 18,
    "price": 5.79,
    "description": "TankZone Battle is a dynamic 3D action game. Dynamic and exciting battles are awaiting you, where the power of ammunition is not everything. Use your speed and agility to defeat your rivals!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/388430/header.jpg?t=1521560004",
    "minimum_requirements": "OS: Windows XP+ Processor: CPU - SSE2 instruction set support Memory: 2 GB RAM Graphics: Graphics card: DX9 (shader model 3.0) capabilities DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Now that it's a standard 4$, it's the best money you'll spend in a while.  The game plays exactly like in the video. It's fast, fluid, and is a hell of a lot of fun to play. I guess the simplicity is where it lies, and that everyone is on the same playing field at the start of a game. Being almost 30, and having friends between 20's and late 30's who all loved this game, I don't know who wouldn't like it.  The only problem is it's a very unknown game at the moment, and it needs players to spread the word. I'd give it an 8/10 for what it offers. The gameplay is very solid, it just needs more content and it would be exponentially better.  If you buy this game, PLEASE review it and share your thoughts, and tell your friends. Even if you don't like it!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a fun and dirty 3D tank shooter! It has a CS-GO style weapon system, which I like. The interesting and challenging part shooting (no crosshair currently to aim, using only your barrel to aim).",
            "review_score": "1"
        },
        {
            "review_text": "stupid game, contorls are absolute sh*t, it takes an effort to move normally, uninstalling",
            "review_score": "-1"
        }
    ]
}