{
    "app_id": 388720,
    "name": "Link: The Unleashed Nexus",
    "release_date": "2015-08-21",
    "developer": [
        "Reminisce"
    ],
    "publisher": [
        "Reminisce"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Action",
        "Indie",
        "Racing"
    ],
    "achievements": 21,
    "positive_ratings": 44,
    "negative_ratings": 10,
    "price": 6.99,
    "description": "Go towards the sky. Wingless though you may be, flightless this makes you not. Link: The Unleashed Nexus is a high-difficulty fast-paced action game which will challenge the player to stay in the air.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/388720/header.jpg?t=1498151386",
    "minimum_requirements": "OS: Windows Vista,7,8 Processor: Core i5, i7 Memory: 3 GB RAM Graphics: Geforce650 DirectX: Version 11 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Link: The Unleashed Nexus is a fast-paced action puzzle platformer made by Reminisce. You start off as an anime girl who seems trapped in some sort of void or chamber filled with ethereal beings which you can pass through. Afterwards, you jump into the actual puzzle platformer aspect of the game. There’s a very helpful tutorial that teaches you the basics of dashing, moving, flying, etc that should appeal to newcomers to this genre and game overall. Soon after the tutorial is finished, you get placed into the game where you have the freedom to dash, fly and move around the area to reach the goal piece which is a glowing statue of sorts that you have to hit in order to proceed to the next room or level. I’m going to list some pro’s and con’s this game has to offer and finish off my final thoughts on this game.   Pro’s",
            "review_score": "1"
        },
        {
            "review_text": "I honestly thought this game would suck but holy ♥♥♥♥ it's actually pretty fun 9/10 i used the controller",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended based on concept alone. Sure, it's short and controls don't always feel precise (specifically when bouncing on enemies), but with a great soundtrack and dreamscape ambience coupled with intriguing platforming elements that leave little margin for error, there doesn't exist a worthwhile 3D game quite like it: If nothing else, play it for the very last level of the game, which is exhilarating enough on its own to warrant a purchase at a discount price.",
            "review_score": "1"
        }
    ]
}