{
    "app_id": 389270,
    "name": "Through Abandoned: The Underground City",
    "release_date": "2015-07-22",
    "developer": [
        "Igor Krutov"
    ],
    "publisher": [
        "Kiss Publishing Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 5,
    "positive_ratings": 127,
    "negative_ratings": 40,
    "price": 0.79,
    "description": "It’s the first game of Through Abandoned series, classical point and click game. You try to find your twin-brother who disappeared in a huge and mysterious place called Abandoned.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/389270/header.jpg?t=1554237136",
    "minimum_requirements": "Минимальные: ОС: Windows XP, Windows 7 or latest Процессор: 2.33 Ghz or faster x86-compatible processor, or Intel Atom 1.6 Ghz or faster processor for netbook classes devices Оперативная память: 512 MB ОЗУ Место на диске: 115 MB",
    "recommended_requirements": "Рекомендованные: Оперативная память: 1024 MB ОЗУ",
    "reviews": [
        {
            "review_text": "Why does banging a gong make handholds appear in a cliff face? Why does pulling a lever make an unpowered mine cart move itself? Why does changing the colors of 8 rooms make a cube turn into a lightbulb? Why is a gear with 12 teeth called a hexagon? Why do I need binoculars to look at a cube less than 2 feet away? Why does another cube turn into a lightbulb when you pull a lever? Why is the combination to the dimension door hidden in windows that need to have light shone through them, with lightbulb fixtures on the opposite side?  This game is not for people who like puzzles that make any sense at all. The art is pretty good, though.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice little puzzle game that takes on the Escape the room idea quite common on mobile games. The ambiance is very weird and soothing; imagine inca theme mixed with scifi and with zen music. Very short - in 75 minutes I did the whole game with all the 4 secrets and the 'secret' ending! However it's well done and all very logical. Don't worry it's very easy - it was designed for mobiles after all :) I got it in a bundle so I didn't pay it full price but it seems a bit pricey for an hour; I'ld say grab it for 2 bucks on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Very short but neat point-and-click game similar to the Submachine series.  While the result of some puzzles (e.g. using a gong makes stone steps appear) may not seem logical to you, keep in mind that the game is set in a fictional place and things like that are very common in this kind of game.  With that in mind, you don't have to perform mental gymnastics in order to solve these puzzles. Actually, this game is rather easy. I finished it in less than an hour.  May not be worth 3$ but give it a shot if you can find it in a bundle. :)",
            "review_score": "1"
        },
        {
            "review_text": "(As others have said, the game is available for free elsewhere on the internet, but I believe the graphics are a slightly better resolution in this version.)  Production values:  I really enjoy the hand-drawn art style, and the music does a good job of creating an otherworldly atmosphere. Also, unlike other commenters, I had no problems installing or running the game on my laptop. It was a smooth, glitch-free experience.  Gameplay: The puzzles are fairly intuitive, and if you are willing to think creatively and pay attention to details, you will not need to resort to a walkthrough. I personally liked the challenge level, it was a brainteaser without being frustrating.  The tone of the game is supernatural in nature, so don't expect everything you see to make sense; however, there is a solid adventure-gaming logic behind each of the puzzle solutions. (Ex. Why does hitting a gong have the effect it does? Who knows? But you don't need it to make sense to understand the simple item-combination puzzle behind it: You know you need to hit the gong, therefore you know you need something to hit the gong with. You can easily suss that out on your own.)  My only complaint is there were one or two hotspots that could have been implemented better (I'm looking at you, Secret #3).  Story: This was where the game started to fall apart for me. The plot is a rough outline at best, and is mainly a hodge-podge of vague sci-fi and adventure tropes. It doesn't feel like it has any real substance, and there wasn't enough of a payoff at the end for finding all the hidden clues. It just left the game on a hollow and abrupt note. I understand this is the first in a planned series of games, but I am still left with a lingering sense of 'is that all?' I think if the game had been a bit longer, with a more substantially developed plot, it would have been more satisfying.  As is, this is a decent point-and-click puzzler that will give you 45-90 minutes of brain-teasing fun. The graphics and music are great, and the story is not-so-great, but overall the gameplay is solid.   I would give it a 7/10. If you are unsure about it, play it online for free. If you like it and want to own a copy, it's worth paying a dollar or two to support the creator.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent art. But too sprawling for a 'room escape' type of deal. Decent ambiance but also unfortunatley fairly boring in the end.   Probbly would prefer just to hve a hidden object game. Particularly one with map teleport since this one has way too much backtracking.",
            "review_score": "-1"
        },
        {
            "review_text": "Too short to write a review. Nothing to say really. Sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "This is going to be a recommendation with a caveat.  Personally, I like this game. I think it's a decently clever point and click adventure, that offers an interesting setting and doesn't succumb to adventure game logic too much. The puzzles might be a bit on the easy side, and the story itself could probably use a bit more fleshing out, the former I think works well enough for a game like this and the latter is largely because this is just the start of a potential series.  Here comes the caveat though: there is a free version of the game available online (also posted by the developer), and in fact the steam version doesn't have any less features than the free version. So it might only make sense to buy the game if one wants to support the developer. Otherwise, I would say keep any eye on it but maybe hold off on a purchase. Though the game isn't that expensive, so you wouldn't lose much either way.",
            "review_score": "1"
        }
    ]
}