{
    "app_id": 389900,
    "name": "Hogs of War",
    "release_date": "2015-07-28",
    "developer": [
        "Infogrames Entertainment SA",
        "Gremlin Interactive"
    ],
    "publisher": [
        "© 2015 Alternative Software Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Strategy",
        "Classic"
    ],
    "achievements": 0,
    "positive_ratings": 124,
    "negative_ratings": 63,
    "price": 3.99,
    "description": "Hogs of War is a turn-based tactical warfare game. Take turns controlling members of your squad of hogs to engage in combat with the opposition based on World War 1. With 3D graphics, vehicles, a career-based single-player mode, and voice-over (narration and for characters) by British comedian Rik Mayall.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/389900/header.jpg?t=1510309683",
    "minimum_requirements": "OS: Windows XP / Vista / 7 (Please note: doesn't work on Windows 8, Windows 10 or MAC) Processor: 1.8 GHz Processor Memory: 512 MB RAM Graphics: 3D graphics card DirectX: Version 9.0 Storage: 1 GB available space Sound Card: DirectX 9 Compatible Sound Device Additional Notes: Mouse, Keyboard",
    "recommended_requirements": "Memory: 1 GB RAM",
    "reviews": [
        {
            "review_text": "I have Win 7 Pro 64bit and this game has not crashed for me at all so maybe it depends on your computer cofig, I've played over an hour and not had any problems with it, did not even crash when I closed the game. I loved this game as a kid so i had to get this BUT this is NOT A REMASTER its the original, which does not bother me at all.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, reminds me of Worms 3D. Surprised I haven't heard of this before since it seems like a classic game.",
            "review_score": "1"
        },
        {
            "review_text": "I remember this from Playstation 1 many years ago. It was one of my favorite games but sadly it broke. NOW I CAN PLAY IT AGAIN! THANK YOU! NOW LET`S FRY SOME FREAKING BACON!",
            "review_score": "1"
        },
        {
            "review_text": "I used to love this game on the PlayStation. Unfortunately, this port does not run on either Windows 8 or Windows 10, which renders it pretty much obsolete for a lot of gamers. Shame really.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a console game. This version is very poorly optimized for pc.  Conclusion: Superb game on PS1, garbage on PC.    ",
            "review_score": "-1"
        },
        {
            "review_text": "Back in the day.. I played the hell out of this game.. It really made me laugh... Now however..since purchasing off of steam, using windows 10, the game won't launch properlly. Beware, will not play!!!. Has never played..",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game on it's first outing and I was a much bigger fan of this than Worms which it is often compared too. It has the voice of Rik Mayal who is a brilliant narrator and it plays better than worms but sadly I can't recommend this as it won't allow you to play it on Windows 10 ( why sell it without the ability to play it on modern computers ). I hope they will correct this soon but sadly I am dissapointed that I couldn't play it/",
            "review_score": "-1"
        }
    ]
}