{
    "app_id": 39000,
    "name": "Moonbase Alpha",
    "release_date": "2010-07-06",
    "developer": [
        "Virtual Heroes",
        "Army Game Studio"
    ],
    "publisher": [
        "NASA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Valve Anti-Cheat enabled",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Space",
        "Simulation",
        "Free to Play"
    ],
    "achievements": 0,
    "positive_ratings": 9867,
    "negative_ratings": 1166,
    "price": 0.0,
    "description": "NASA has once again landed on the lunar surface with the goal of colonization, research, and further exploration. Shortly after the return to the Moon, NASA has established a small outpost on the south pole of the moon called Moonbase Alpha.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/39000/header.jpg?t=1447352605",
    "minimum_requirements": "Minimum OS: Win XP SP3 Processor: 2.0+ GHZ Single Core Processor  Memory: 2 GB of System RAM  Graphics: NVIDIA 7000-series or ATI Radeon X1900 Video Card  DirectX®: DirectX 9.0c  Hard Drive: 2 GB of Free Hard Drive Space  Sound: DirectX 9.0c compliant audio",
    "recommended_requirements": "Recommended OS: Win XP SP3 / Vista / Windows 7 Processor: 2.4+ GHz Dual Core Processor Memory: 4+ GB of System RAM Graphics: NVIDIA 9000+ or ATI Radeon 3600+ Video Card DirectX®: DirectX 9.0c  Hard Drive: 5 GB of Free Hard Drive Space",
    "reviews": [
        {
            "review_text": "&gt;Opens steam &gt;Nothing to do &gt;Moonbase Alpha &gt;Gets friends in skype call &gt;Playing game &gt;Repairing lunar equipment only so that we don't die &gt;Spamming aeiou  &gt;And sometimes y &gt;NASA makes better games than EA",
            "review_score": "1"
        },
        {
            "review_text": "Moonbase Alpha is a marvel of the 21st century. You cannot even compare any other games like Gears of War, Call of Duty, Team Fortress 2, or even Assassin's Creed to this landmark in human intelligence. If you were to put a average Joe into this kind of enviroment, his head would implode from the amazing graphics, story, and gameplay. If you were to play this game, your feeble monkey brain would not even be able to understand the deep, complex and twisted story of Moonbase Alpha. NASA's masterpiece of 2010 shows us how far America has come in understanding space and lifestyle in space. Moonbase Alpha shows that even through NASA, we can learn much more about space and the human psyche. Moonbase Alpha follows the story of astronaut John Madden and his daily life on Moonbase Alpha, NASAs experimental base on the moon. If John fails his secret mission objective, his family and status in the NFL will be taken away and soiled by NASA. Moonbase Alpha brings us this harrowing story along with intense gameplay elements such as fixing carbon dioxide leaks, repairing solar panels, and driving robots. If you even attempted to finish such a hard, cruel game, you would be hailed as a god among men. Jesus would bless you with immortality and wealth beyond comprehension. The graphics in Moonbase Alpha top even Crysis 3 and have made many a computer catch fire. Even my IBM Super Computer cannot handle such a masterpiece as Moonbase Alpha. Many will look back to this game in the future, and smile as they remember their glorious past. NASA will forever be hailed as the wunderkind of this millenia. Thank you, NASA, for creating such a wonderful and exciting game.",
            "review_score": "1"
        },
        {
            "review_text": "Tried playing the game seriously, got called a Lesbian  10/10",
            "review_score": "1"
        },
        {
            "review_text": "At an affordable price of $0, NASA's Moonbase Alpha is a true piece of art and separates itself from today's popular games such as Call of Duty and Team Hatress 2 with it's cutting edge graphics, lifelike psychics and overall playability. The text to speech is quite helpful as I was born blind and cannot read text very well. On a closing note, I wish the U.S.A wouldn't cut so much funding towards NASA as I would like to see a sequel of this game in the near future.",
            "review_score": "1"
        },
        {
            "review_text": "  'That's one small loan of a million dollars, one giant leap for John Madden.'  ",
            "review_score": "1"
        },
        {
            "review_text": "I think 80% of people play Moonbase alpha only for the feature to use text to speech. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A game where people violate your ears with the sound of one thousand Stephen Hawkings crying out in agony.  Edit: I MADE THE INTERNET LAUGH WHOA real review soon",
            "review_score": "1"
        },
        {
            "review_text": "Just nominated Moonbase alpha in the category 'GAME WITHIN A GAME', both for the text RPG on the computer of the base, and for the awesome text to speech feature that allows people to sing internet things.",
            "review_score": "1"
        },
        {
            "review_text": "This was to suposbly be taken seriously but the ammounts of fun you can have in this game whit the text-to-speech is ridiculosly funny i couldn't even breath from laughing",
            "review_score": "1"
        },
        {
            "review_text": "How can words describe this masterpiece? Only a few chosen ones are enlightened and are able to see the truth hidden in our vast universe. Now, by playing this game, you can be one of them. One of us.",
            "review_score": "1"
        },
        {
            "review_text": "john madden leads bears to another superb victory at the owl john madden",
            "review_score": "1"
        },
        {
            "review_text": "Joined a lobby to see what this game is all about. was met with fellow nauts singing The Whalers On The Moon song....  10/10 would play again forever",
            "review_score": "1"
        },
        {
            "review_text": "  'After five long years, THIS is your tax dollars at work.' ",
            "review_score": "1"
        },
        {
            "review_text": "I like the game and would like to see more functions.",
            "review_score": "1"
        },
        {
            "review_text": "john madden goes to space and steals moon pipes from the astronauts so they die",
            "review_score": "1"
        },
        {
            "review_text": "I got really into this game pritty quickly. but this  IS NOT  a single player game. I used the rover to drive around to where i needed to get to but still ran out of time well before oxygen was restored. Best i got was about 2mins till oxygen restores on time up. I would recommend this game ONLY if u have friends u can play with.  PROS    Fun to play    Challenging welding section    Graphics are better then i expected    Good game to play with friends  CONS    Very very slow movement speed (i get its based in outer space and on the moon but still)    Impossible to play single player/alone   Pros out weigh the cons on this so its a thumbs up from me!  ",
            "review_score": "1"
        },
        {
            "review_text": "Can't wait for the beta!",
            "review_score": "1"
        },
        {
            "review_text": "this ♥♥♥♥ is one of the many funny games ive played,i love to ♥♥♥♥ around in it",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best game about space exploration on steam and probably on the internet.",
            "review_score": "1"
        },
        {
            "review_text": "One small step for man, one giant leap, for John Madden. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Moonbase Alpha can be pretty fun, if you're in the right mood. I enjoy the game but alot of people will probably not like it the same way. I think this mostly has to do at witch the speed the game is played. The game can be slow, but this doesn't take anything away from the feel of the game or the fun that you can have. Also multiplayer can increase the enjoyment you get from the game dramatically.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing better than hearing Bohemian Rhapsody in a Stephen Hawking voice 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Moonbase Alpha is a very realistic game. You can create your own servers to play with your friends. There isn't a large objective to the game, but the feature with the typing-to-voice is something that I haven't seen before. There are many unique things about this game, such as the 3D solids implemented into this. This game reminds me of Gene Endrody's Moonbase (by Maid Marian). If you enjoy anything involving space travel and just a casual mmorpg, this is a great game to start.",
            "review_score": "1"
        },
        {
            "review_text": "The Castlevaniaesque gameplay of Moonbase Alpha really supports the entire package of 'realistic John Madden Simulator'. One caveat of this masterpiece is the lack of an FOV slider, but this made fine by the fantastic audio and overall wonderful gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "what's the point of this game",
            "review_score": "1"
        },
        {
            "review_text": "This song is so cool! [:nh][:dv gv 100][:dv ap 10][:dv hs 200][llao&lt;9000047,9999&gt;][burr&lt;9000047,40&gt;][aa&lt;9000047,9999&gt;][hxae&lt;9000047,40&gt;]﻿",
            "review_score": "1"
        },
        {
            "review_text": "10/10 text to speech",
            "review_score": "1"
        },
        {
            "review_text": "hey that's pretty good. 11/10 would text-to-speech again.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "I've... seen things... you people wouldn't believe.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must. There is no reason why should not have this game on your computer.",
            "review_score": "1"
        },
        {
            "review_text": "a serious game for non-serious people!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most John Madden that I ever played!",
            "review_score": "1"
        },
        {
            "review_text": "It's not gay if its on the moon",
            "review_score": "1"
        },
        {
            "review_text": "After a stressful day, it's fun to log onto Moonbase Alpha and just mess around on random servers, just having a blast.  You get the rare person that screams... Well, anyone who has launched the game at least once has heard this noise, but yeah. The community may seem weird, but they're good people. [iy&lt;9999,9999&gt;]",
            "review_score": "1"
        },
        {
            "review_text": "My ears are dead because of this",
            "review_score": "1"
        },
        {
            "review_text": "Microsoft sam the game  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Don't play this game seriously. JOHN MADDEN",
            "review_score": "1"
        },
        {
            "review_text": "During those 10 hours on the moon I quickly learned to defend my moon rocks, i learned to protect my fellow teletubbie explorers from invaders and i even met the king of the moon .. his name is 'JOHN MADDEN' and this is his favorite song   [:t 520,250][:t 520,250][:t 460,250][:t 520,500][:t 390,500][:t 390,250][:t 520,250][:t 700,250][:t 660,250][:t 520,500]",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. One of the greatest milestones in video game history. This game is truly a work of art. Everyone should download this game.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like John Madden? Do you want a fast way to hate the sound of his name? Well boy do I have the game for you. Simply find a server and sit back while his name is echoed in the deep lonely depths of space...... If only you could jump into those depths..... 1 /10 Absolutely loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Text-to-speech function is making this game a billion times more hilarious than it is.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT LOVE IT SO FUN",
            "review_score": "1"
        },
        {
            "review_text": "literally what seems to be the best game to waste your time on, you don't even need to save the moon. just go to options, turn on TTS and boom. you're done. there's no point in saving the moon with the text-to-speech option.    10/10, would aeiou again",
            "review_score": "1"
        },
        {
            "review_text": "Heart and dicktouching",
            "review_score": "1"
        },
        {
            "review_text": "Proof that Americans won the Cold War: everyone in space is talking about John Madden.",
            "review_score": "1"
        },
        {
            "review_text": "Save the noom people. Once and for all. HOLLA HOLLA! Funniest game ( and actually an hard race when team working for real ) for maximum three days. Then boredom kingdom.",
            "review_score": "1"
        },
        {
            "review_text": "teh moons is not safes",
            "review_score": "1"
        },
        {
            "review_text": "Ground control to Major John Madden.",
            "review_score": "1"
        },
        {
            "review_text": "Be playin some futbawlz with John Madden. bai",
            "review_score": "1"
        },
        {
            "review_text": "game of the year 2003",
            "review_score": "1"
        },
        {
            "review_text": "There may have been updates since I last played this, however the version I installed was an interesting little simulator. There was some educational value to be had, but not much. The game play is also not very intuitive and could benefit from tutorials. The game seemed to be very stable, however it had issues in multiplayer missions due to children constantly attempting to grief players by undermining the work of those attempting to accomplish the mission within the allotted time limit. If there was more content, specifically missions, or perhaps there was a sandbox mode available during Alpha in which players could use to simply build with, this would have real value. As it is, it's simply a toy for wasting time.  I am recommending this for younger children or anyone who has an interest in real life space exploration, as these are the individuals most likely to enjoy this. That said, I do not think it will be able to keep anyones attention for very long unless content is added.",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is perfect in every possible way. When you play it, you will understand.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 The speak and spell got abused so hard. Best snuff game out there.",
            "review_score": "1"
        },
        {
            "review_text": ":3",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea what you supposed to do but I spent an hour doing pretty much just screwing around with speech text.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The best football simulator I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "It's like NFL in space.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game, if you like space",
            "review_score": "1"
        },
        {
            "review_text": "'MoonLog Entry #123xFF: We've been held prison on this rock for 9 months now. I don't know how things could've gone so wrong with the AI development program. We began testing their motor-skill coordination with an old Sega Genesis and a copy of 'Madden NFL '95.' They became obsessed! Any moment free from performing maintainence tasks they spent playing that outdated video simulation. We started finding large rocks arranged in the shape Johns Madden's portrait. We thought this behavior was harmless....but we were wrong. The droids went rampant! 'JOHN MADDEN! JOHN MADDEN!', they howled. They demanded to see their football god; a demand that we had no means to satisfy. Lt. Jenkins immediately made a run for the airlock, but was promptly shot through the skull with a mining laser. 'AEIOU!', they shrieked. We're been held captive in our own base until their demands are met. Conner predicts that our life support will only last for 5 more weeks. God help us all.'",
            "review_score": "1"
        },
        {
            "review_text": "i downloaded this game with my friend because we were alone and bored. we spent our time waiting for it to finish by reading reviews. it finishes. we get in the game and we're already laughing our asses off. couldn't even get into a game with them.  10/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a microsoft text to speech reunion IN SPACE!  oh and you can save the moon or something but that isn't important",
            "review_score": "1"
        },
        {
            "review_text": "Best John maddon simulator out there 11/10 recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever gone to google translate and typed something silly into it. Just to hear when it says what you typed in a silly voice. Now, have you ever wanted to share those funny sentences? Or maybe even say them ON THE MOON™. That's right! With spanking new technology we take your sillyness to new heights!   Have you ever stood in your boring house looking at the sky thinking about how boring your life is? Well say no more! On THE MOON™ you can: Drive a weird bus, walk in circles and even type in a chatbox! IS that not amazing? Now with exciting new quests! Just wait, it gets better. We even have: a GHOST MISSION™. But what do I have to pay for this Jones? YOU DON'T HAVE TO PAY ANYTHING! IT'S ABSOLUTELY FREE!  Batteries not included with copy.",
            "review_score": "1"
        },
        {
            "review_text": "I'd love it if they made this game a more open world sandbox type of game where the player can build their own base and mine resources to build it and haveing more missions would be awesome too.",
            "review_score": "1"
        },
        {
            "review_text": "Text-To-Speech = LMAO ",
            "review_score": "1"
        },
        {
            "review_text": "Ｔｈｅ ｂｌｏｏｄ ｏｆ ｔｈｅ ｉｎｎｏｃｅｎｔ ｓｈａｌｌ ｆｌｏｗ ｆｏｒ ａ ｔｈｏｕｓａｎｄ ｙｅａｒｓ. Ｉ ｗｉｌｌ ｆｅａｓｔ ｏｎ ｙｏｕｒ ｓｏｕｌ. Ｙｏｕ ｗｉｌｌ ｐａｙ ｆｏｒ ｙｏｕｒ ｓａｃｒｉｌｅｇｅ. Ｌｏｏｋ﻿ ｉｎｔｏ ｍｙ ｅｙｅｓ ａｎｄ ｋｎｏｗ ｈｅｌｌ. Ｉ ｗｉｌｌ ｅｒａｄｉｃａｔｅ ａｌｌ ｎｏｎ-ｂｅｌｉｅｖｅｒｓ. Ｉ ａｍ ｔｈｅ ｂｒｉｎｇｅｒ ｏｆ ｄｅａｔｈ. Ｄｅｈｕｍａｎｉｚｅ ｙｏｕｒｓｅｌｆ ａｎｄ ｆａｃｅ ｔｏ ｂｌｏｏｄｓｈｅｄ. ＧＯＤ ＢＬＥＳＳ ＴＨＥ ＵＳ ... ... Ａ̶̸͍̱͎̻̉ͧＡ̼͇̻̹̰̼̽̿ͮ̈ͯ͝Ａ̫̃̿ͧ̾ͥ͟­͍̫̻̝͙̻̝͍Ａ̵̨̙̬͎̦͈̮̔ͤ̒ͭ̋ͯ͛̚̚͝Ａ̍̓­͙̲͙̹͖̠̮̻̦̌Ａ̮̥̖͎̘̠ͤͫ͊ͥ̐ͣ͆̐͠Ｙ̬̇̾­̦̺Ｙ͇͈̯ͬ̀̄̃ͥ̒̿Ｙͭ̋̈́͌̒͑͋҉̷̝͖͖Ｙ̸͌́­̹",
            "review_score": "1"
        },
        {
            "review_text": "Greatest casual game for all!",
            "review_score": "1"
        },
        {
            "review_text": "HERE COMES ANOTHER CHINESE EARTHQUAKE",
            "review_score": "1"
        },
        {
            "review_text": "We're whalers on the moon, we carry our harpoons, but there ain't no whales, so we tell tall tales and we sing our whaling tune.",
            "review_score": "1"
        },
        {
            "review_text": "It's not trolling if you do it on the moon.",
            "review_score": "1"
        },
        {
            "review_text": "DO YOU ♥♥♥♥ING LOVE MICROSOFT TEXT-TO-SPEECH? IF YOU SAID YES KEEP READING! IF YOU SAID NO, ♥♥♥♥ off. EXPERIENCE INTENSE MICROSOFT TTS ACTION LIKE SWEARING LIKE A ROBOT! PRETEND TO BE STEPHEN HAWKING! AND BEST OF ALL MORE TEXT-TO-SPEECH! 100000000/10 IGN 'BEST TEXT-TO-SPEECH INVOLVED GAME EVER.'",
            "review_score": "1"
        },
        {
            "review_text": "Among the best moonbase simulators out there....aeiou",
            "review_score": "1"
        },
        {
            "review_text": "MoonLog Entry #123xFF: I don't know how things could've gone so wrong with the AI development program. We began testing their motor-skill coordination with an old Sega Genesis and a copy of 'Madden NFL '95.' They became obsessed! Any moment free from performing maintainence tasks they spent playing that outdated video simulation. We thought this behavior was harmless....but we were wrong. The droids went rampant! 'JOHN MADDEN! JOHN MADDEN!', they howled. They demanded to see their football god; a demand that we had no means to satisfy. Lt. Jenkins immediately made a run for the airlock, but was promptly shot through the skull with a blasto ray. 'AEIOU!', they shrieked. We're been held captive in our own base until their demands are met.",
            "review_score": "1"
        },
        {
            "review_text": "all the thing's you need to run a space station then bam and then all the things you have to do in order to fix the station  7/10 hard game especially when solo  But u better hurry up or your going to be holding your breathe",
            "review_score": "1"
        },
        {
            "review_text": "This game best game NA you jump around on the moon and do nothing I think it is like 680x1020 P res. This game is all diamond smurfs that own anyone that is new to the game so be sure to give it a chance.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a game where you can simply screw around and make funny text-to-speech messages that sound like Stephen Hawking with other people screwing around and making funny text-to-speech messages that sound like Stephen Hawking, then this is the game for you! Literally, NASA built this game to be a serious space simulator, and it probably would've been a serious game had they not included text-to-speech chat where people can make ♥♥♥♥♥♥♥♥ noises. But then again, it would be NOWHERE AS FUN if it weren't for this feature, which is pretty much the key feature to the game. There are some people who try to play the game seriously... Screw those people..... literally........... Just turn on text-to-speech and your day will absolutely be made.  10 out of F***ing 10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "As of the time of writing, I've spent seventeen hours doing stupid stuff in this game. Admittedly, it's not very active anymore, and it never was very big, but during the time that people were there you could do some rather fun not-the-objective things in it... Of course, you had to be aware of the occasional hose spam, aka lag machine, which would pop up whenever somebody took a hose out from supply. And then just one more. And then another. And another... You get the idea. A big pile of wires would be positioned by the item spawn, lagging out the whole server.",
            "review_score": "1"
        },
        {
            "review_text": "Make sure you have friends to play with.",
            "review_score": "1"
        },
        {
            "review_text": "I personally love this game its fun to run around in a rover racing against time to fix a moon base. The only thing this game needs is more maps but other than that its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "YOLO dis game is hella sicknasty 8=D",
            "review_score": "1"
        },
        {
            "review_text": "Very fun.  -10/10 too lazy to write.",
            "review_score": "1"
        },
        {
            "review_text": "The best text-to-speech program ever, really captivating voices. Also, something about astronauts.  90/10.  John Madden. Aeiou.",
            "review_score": "1"
        },
        {
            "review_text": "it makes my nipples hard    I LOVE SPACE",
            "review_score": "1"
        },
        {
            "review_text": "R.I.P HEADPHONE Users!",
            "review_score": "1"
        },
        {
            "review_text": "fun to mess around in",
            "review_score": "1"
        },
        {
            "review_text": "Its fun but very little to really do",
            "review_score": "1"
        },
        {
            "review_text": "Cool but add a free build mode were you can build you own bases and place generator and oxygen tanks and stuff like that I will give you a 9/8 if done       8/8 -IGN",
            "review_score": "1"
        },
        {
            "review_text": "The National Aeronautics and Space Administration (NASA) is an independent agency of the executive branch of the United States Federal Government responsible for the civilian space program as well as aeronautics and aerospace research.[note 1]  President Dwight D. Eisenhower established NASA in 1958[7] with a distinctly civilian (rather than military) orientation encouraging peaceful applications in space science. The National Aeronautics and Space Act was passed on July 29, 1958, disestablishing NASA's predecessor, the National Advisory Committee for Aeronautics (NACA). The new agency became operational on October 1, 1958.[8][9]  Since that time, most US space exploration efforts have been led by NASA, including the Apollo moon-landing missions, the Skylab space station, and later the Space Shuttle. Currently, NASA is supporting the International Space Station and is overseeing the development of the Orion Multi-Purpose Crew Vehicle, the Space Launch System and Commercial Crew vehicles. The agency is also responsible for the Launch Services Program (LSP) which provides oversight of launch operations and countdown management for unmanned NASA launches.  NASA science is focused on better understanding Earth through the Earth Observing System,[10] advancing heliophysics through the efforts of the Science Mission Directorate's Heliophysics Research Program,[11] exploring bodies throughout the Solar System with advanced robotic spacecraft missions such as New Horizons,[12] and researching astrophysics topics, such as the Big Bang, through the Great Observatories and associated programs.[13] NASA shares data with various national and international organizations such as from the Greenhouse Gases Observing Satellite. ",
            "review_score": "1"
        },
        {
            "review_text": "We  are the crstal Johns  we'll always save the base  and if you think we can't  we'll always find Ebay  thats why the people  of   this  moon  believe in  Football  Gaben  and Aeiou  and Madden!",
            "review_score": "1"
        },
        {
            "review_text": "Better community than TF2",
            "review_score": "1"
        },
        {
            "review_text": "become the best there is and live on a quiet peaceful moon base and try to keep the other guys alive",
            "review_score": "1"
        },
        {
            "review_text": "This game is timecrunching and very fun with friends. But we all know that the text-to-speech and fun community really makes it for this game. JOHN MAAAAAADDDEN.",
            "review_score": "1"
        },
        {
            "review_text": "GET OUT OF MY WAY IM SAVING THE MOON  COME OVER COME OVER COME OVER COME OVER COME OVER  AIEOU  JOHN MADDEN. FOOTBALL.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and challenging. I enjoyed fixing the broken items. The only bad part was my friend calling me names in the backround",
            "review_score": "1"
        },
        {
            "review_text": "Aeiou/10  Would recomend again",
            "review_score": "1"
        },
        {
            "review_text": "It's not gay if it's on the moon.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite a masterpiece. It shows how important teamwork in life is, and realistically simulates a life threatening situation on the moon. With every word you type in the chat, it'll help encourage your co-workers to get the job done. I was crying in victory when I saved tons of lives with my co-workers. Not once are you doing the same thing over and over.",
            "review_score": "1"
        },
        {
            "review_text": "steven hawking in space simulator 2010",
            "review_score": "1"
        },
        {
            "review_text": "Enough John Madden to be a football game. Holla holla/10, would get dollah again.",
            "review_score": "1"
        },
        {
            "review_text": "The most racist and anarcistic game that i have ever played, 10/10 would get that moon pussay again.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, what's not to play and love the amazing game called 'Moonbase  Alfah  Alpha'? This NASA space-themed game is the home of the best Text-to-Speech program. It's the one and only feature which brought us 'Aeiou', John Madden, Chinese Earthquakes, generic red squares, chat spamming, '♥♥♥♥♥ing diks' and, the most coolest of all, scripted songs and voice-changing commands. Because of this, I didn't even  have  to complete my objective anyway, everything was just too hilarious to miss out. And look, people are still playing this (in fact there aren't many servers online), so don't miss your chance to join them! It's free!  Just in case you're not familiar with everything the game's Text-to-Speech feature can do, look around in 'Know Your Meme'.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!  I was the first person on the server to find the microphone button to speak and everyone thought I was god of this game!  100/10",
            "review_score": "1"
        },
        {
            "review_text": "Stephen hawking on the moon simulator 2k10",
            "review_score": "1"
        },
        {
            "review_text": "a must play for any tax payer ",
            "review_score": "1"
        },
        {
            "review_text": "aeiou every1, 10 / 10 would john madden again",
            "review_score": "1"
        },
        {
            "review_text": "I jumped onto a rover and surfed on the Moon.",
            "review_score": "1"
        },
        {
            "review_text": "more like Speech To Text: The Game",
            "review_score": "1"
        },
        {
            "review_text": "Take me out To the ball game Take me out To the crowd Buy me some peanuts And Crackerjacks I don't care if I never get back  For it's root, root, root For the home team If they don't win It's a shame For it's one, two,  Three strikes you're out At the old ball game!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing best game ever. you can walk around on a super small part of the moon, and fix the problems of a small moon base. 1000000000000/10 would moonbase again.",
            "review_score": "1"
        },
        {
            "review_text": "sacrificed the surface of the moon to john madden  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Make it playable on Mac please and thank you",
            "review_score": "1"
        },
        {
            "review_text": "If you are not playing this Game because of the awesome text to speech,something is wrong with you!",
            "review_score": "1"
        },
        {
            "review_text": "This game is 8/8 gr8 m8. The only reason i downloaded it was because of text to speech and the dank singing that you can do. actually, 9/8 (yes, it is that good)",
            "review_score": "1"
        },
        {
            "review_text": "Most hardcore gaming experience available.  11/10 Got to the moon before the commies.",
            "review_score": "1"
        },
        {
            "review_text": "Feels just like being John Madden on the moon. Microsoft Sam is bae.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT THE SPACE SUIT IS OLD IT'S FROM 1013 IT'S VERY OLD IT'S TANK'S CANT BE HOLDED THAT LONG IT'S HARD DO SEE BUT THE GAME IS VERY COOL THANKS FOR IT!!",
            "review_score": "1"
        },
        {
            "review_text": "A man sang an opera dedicated to John Madden while I flew towards the sun. It was absolutely beautiful. Following which, I said 'Beep boop gets me hard.'  '10/10 Game of the Century.' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "This is by far one of the worse game's I've ever had the chance to play, NASA could of made it longer and better, unless I see better from it, this game I wouldn't recommend to a 2yr old sadly.",
            "review_score": "-1"
        },
        {
            "review_text": "The National Aeronautics and Space Administration called, they regret sending these people to the moon.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would R**E friends with bananas and lube again",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Honestly, there isn't much to do; don't let that deter you though.  Grab a couple buddies, and you'll have a blast!",
            "review_score": "1"
        },
        {
            "review_text": "All i have to say is..JOHN MADDEEEEEN.     420/10, would noscope again.",
            "review_score": "1"
        },
        {
            "review_text": "You for some reason cant join friends because it says it isnt responding, there is limited public servers with horrible ping, if you know how to fix any of this contact me at  provingmedusa@gmail.com ",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing, fun, and adventurous ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Joined a server and my ears died  11/10 Would go deaf again",
            "review_score": "1"
        },
        {
            "review_text": "  this is a good review literaly just for the multiplayer, full of racist/sexist people spamming on the text to speech system (im one of them)",
            "review_score": "1"
        },
        {
            "review_text": "moon orgy 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is a piece of ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Yes, this is game is very fun, quite, the voices are superb and the gameplay is not top notch, yes quite. Over all a good game, you get a thumbs up from me, yes.",
            "review_score": "1"
        },
        {
            "review_text": "I see what we all did here! 11 out of ten wolf howls at the moon!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the type of game where nobody follows the objective",
            "review_score": "1"
        },
        {
            "review_text": "ELMO READY TO SNAP CD IN HALF! HOLY ♥♥♥♥! THIS GAME MAKES ME MOIST!",
            "review_score": "1"
        },
        {
            "review_text": "aeiou     10/10 -ign  'the worlds best text to speech chatroom simulation'",
            "review_score": "1"
        },
        {
            "review_text": "we're whalers on the moon we carry a harpoon but there ain't no whales so we tell tall tales and sing our whaling tune 10/10",
            "review_score": "1"
        },
        {
            "review_text": "There's a guide that has the Indiana Jones theme you can play through the Text to Speech function.   I already know you want it for Text to Speech, don't lie.",
            "review_score": "1"
        },
        {
            "review_text": "-Spawned in -got told im a niggur -tried to pick up a wrench  - Was told thats not my wrench don't touch it -fixed a hose -made a joke about harambre - triggered someone - guy told me i was hitler and asked me very politely to leave the game - fixed something else and he said i could stay -texted chat the letter a about 1, 000, 000 times  - got triggered again  11/10 best game would trigger people again",
            "review_score": "1"
        },
        {
            "review_text": "Momma mia, Poppa pia, baby got the dy AAAAREEEEEAAAAAAAAAAA !",
            "review_score": "1"
        },
        {
            "review_text": "tex 2 spech (Oh, and this game would run on an actual physical tater)",
            "review_score": "1"
        },
        {
            "review_text": "BEST SIMULATOR  10/10 but in my new computer i cant play  play it for some resson  its just not opening the game...   :(   ps...  john madden!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is boring and it sucks",
            "review_score": "1"
        },
        {
            "review_text": "Since the dawn of time, mankind has dreamed of walking on sunshine. Now, the next best thing is possible. Moonbase Alpha uses realistic NASA approved science to flawlessly recreate the excitement of routine moon upkeep, moon driving, moonwalking, and moon mooning, all accentuated by the breathtaking grey desert that is the Earth's moon as a backdrop. The money NASA put into this game can be considered a cause for its eventual discontinuation of the space program, so why not turn a national tragedy into a fun filled 45 minutes with you and 2 or 3 friends you've tricked into playing.",
            "review_score": "1"
        },
        {
            "review_text": "this game stands to prove that NASA has and never will land humans on the moon.    i played it to find out what the connection to john madden was and i still dont know what is. i learned a little more than i needed to about the text-to-speech software that stephen hawking uses.   and im beginning to understand a little better the reason NASA uses russian... everything.   better than COD. 1974/10 will aeiou again.",
            "review_score": "1"
        },
        {
            "review_text": "Game about racing with robots on moon, singing about Maden and chasing each other...10/10",
            "review_score": "1"
        },
        {
            "review_text": "Has been in Alpha since release. No support from NASA devys. 0/420",
            "review_score": "1"
        },
        {
            "review_text": "Wish tutorial was better ",
            "review_score": "1"
        },
        {
            "review_text": "Funny game to mess around on.",
            "review_score": "1"
        },
        {
            "review_text": "You'll never play a game more majestic than Moonbase Alpha.",
            "review_score": "1"
        },
        {
            "review_text": "this game has superb voice ingame !!",
            "review_score": "1"
        },
        {
            "review_text": "The Memes are great",
            "review_score": "1"
        },
        {
            "review_text": "what are you ♥♥♥♥ing gay?  10 idubbbztv/99 chin chins",
            "review_score": "1"
        },
        {
            "review_text": "DON'T FIX SHET JUST GO TO MENU AND PUT CHECK ON TEXT TO SPEACH AND HAVE SHETTON OF FUN WITH OTHER JOHN MADDENS",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would abuse text-to-speech again",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer can be a mess to set up, but if you do it's pretty fun for a free game.",
            "review_score": "1"
        },
        {
            "review_text": "tihs is hte bset ga,e i haev ever [layed u cna be a astronot nad u get 2 use robot it gets 9.9/10 but not 10 bcus u cant go 2 mars.",
            "review_score": "1"
        },
        {
            "review_text": "top gaem evry1 shud own this  downloadd it now pls  play it all day erry day",
            "review_score": "1"
        },
        {
            "review_text": "The chatspam on multiplayer is unbearable, but if you take it seriously it's ok",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Attack of the moon john maddens is the best game evar",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to order a Pizza:  Can I order a Pizza? No. Why not? Because you are a John Madden  10/10",
            "review_score": "1"
        },
        {
            "review_text": "thisis a great sim :) :) :) :) :)",
            "review_score": "1"
        },
        {
            "review_text": "it could be cool if we can make a factory on moon or build a space ship bach to earth.",
            "review_score": "1"
        },
        {
            "review_text": "When voice is on its hillarious :D",
            "review_score": "1"
        },
        {
            "review_text": "Went to space Ordered a pizza got refused because I was John Madden Let everyone on the base slowly die from low oxygen Went online Got called gay Ordered More pizza Sang spooky Scary Skeletons Gave up my social life",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that makes this game good is the 'Type-voice' setting",
            "review_score": "1"
        },
        {
            "review_text": "There is one mission in this game. One. That is it, no campaign, no seperate missions. However, that one single mission is done well. You are given a time limit to complete the objective and you have to work together with people to get it done on time. Then, after you do that, you repeat that same mission.... Again...  The community that plays the game is toxic. If you want to sit around and talk about guys ****ing each other and animals in the ***, then this is the game for you!   So yea.... to sum things up. You get to play the same mission over and over and over again while hearing about furries and clopping and trannys and paedophiles.... But if you turn the chat window off, then you have a challenge, playing that one mission.  Can I get credit added to my Steam account for the waste of time playing this game?",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS HOW WE FIX PROBLEM IN RUSSIAN SPACE STATION *beats O2 pump with hammer*",
            "review_score": "1"
        },
        {
            "review_text": "m is a consonant a letter in the alphabet",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I just load this up and jump into a game entirely for the chat box.   10/10, would type 'aieuoaieouaieouaieouaieou' into chat box again[/b[ ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game   Ear murder: [:tone 5010,99999999]        And waiiit a second..... there are goals and objectives?! I JUST SPAMMED AGR",
            "review_score": "1"
        },
        {
            "review_text": "John Madden simulator  7 out of 6 papa pizzas",
            "review_score": "1"
        },
        {
            "review_text": "Oh, what's going on?",
            "review_score": "1"
        },
        {
            "review_text": "Neat game, decent graphics, fun multiplayer, but there's not much to it.",
            "review_score": "1"
        },
        {
            "review_text": "Best text-to-speech simulator I've ever seen! I'll never have to use a headset again!",
            "review_score": "1"
        },
        {
            "review_text": "John is a terminator",
            "review_score": "1"
        },
        {
            "review_text": "Be prepared to be transported into the most intense time waster ever. Get bombarded with awful songs and ♥♥♥♥ jokes with one of the best robot voices ever, all while rushing to save your moon base. If you love John Madden, scream it to the heavens. brbrbrbrbrbrbrbrbrbbbrbrbrbrbrbrbbrbrbrbrbrbr. SNAAAAAAAKE!",
            "review_score": "1"
        },
        {
            "review_text": "there is a mission type that is ♥♥♥♥ing terrifying, was not expecting that. all in all though it is good fun with solid mission based gameplay, graphicaly it leaves a little bit to be desired.",
            "review_score": "1"
        },
        {
            "review_text": "Its like the best game I've ever uninstalled ever. Don't play this... Invest your time elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Now, I haven't played much of Moonbase Alpha, but that's because of my hate towards space simulators. For the part that I have played, here's my view of it:  With the attempt of a more realistic approach, features like slow movement, the game really lost its touch. I also experienced some trouble with Multiplayer, but I'll put that aside.   In the end, Moonbase Alpha is not the best space simulator, but it can be enjoyable in 1 or 2 ways. If you'd want a more complete experience, look for Space Engineers, and it just might suit you.",
            "review_score": "-1"
        },
        {
            "review_text": "this is the best game ive ever played in my life",
            "review_score": "-1"
        },
        {
            "review_text": "Only fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't know how to play  Just uses text to speech  Only game where you get called a lesbian for not liking being tortured by sounds  best game ever 420/69 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "was ♥♥♥♥♥ on the dark side of the moon  3spooky5me  9/11",
            "review_score": "1"
        },
        {
            "review_text": "  Well basically     I think this game is rather funny   DONT FAKING GET THIS GAME ",
            "review_score": "-1"
        },
        {
            "review_text": "Basically, Moonman McTalkbox went on a quest to mars but only reached the moon cus he has a mental defeciency. He talks like slightly more foreign Stephen Hawking after a prostate exam. Overall the controls are so sick its unbelievable to think i have hands",
            "review_score": "1"
        },
        {
            "review_text": "not what i expected",
            "review_score": "-1"
        },
        {
            "review_text": "good game but theres never realy any servers",
            "review_score": "1"
        },
        {
            "review_text": "best story 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ears bleeding simulator 2015 - 12/10",
            "review_score": "1"
        },
        {
            "review_text": "jon made this game",
            "review_score": "1"
        },
        {
            "review_text": "its really boring",
            "review_score": "-1"
        },
        {
            "review_text": "For the best playing experience use headphones the first time you play and max out volume. Will not disappoint!",
            "review_score": "1"
        },
        {
            "review_text": "i do like this game but at the same time not pros: -text to speech -graphics -some other content cons: - it only has 1 mission - no other events happen like leakege or a pipe burst which makes the game not fun i would give it a 5/10",
            "review_score": "1"
        },
        {
            "review_text": "you can call people the N word in a robot voice 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Met Elon Musk in this game, he saw me doing flips in the rovers and gave me a job as lead rocket engineer at SpaceX. Top bloke, top bloke honest. He also gave me a Tesla car to do some naughty flips IRL",
            "review_score": "1"
        },
        {
            "review_text": "i cant do anything i smashed every button its like none of them do nothing i do not reconmend this ",
            "review_score": "-1"
        },
        {
            "review_text": "Fun for the memes and text to speech songs, but other than that it is pretty stale unless you're a space junky.",
            "review_score": "-1"
        },
        {
            "review_text": "Well let me get started, this game is unique in its own little way being one of those very few to venture into the space simulation area, but this is cleary ripping off Space Engineers, But I will not go into detail about that. This game is free and not a play 2 win, two good things I love, and the community I love it they are so hilarious and funny I couldn't stop laughing, they are also helpful in tips and pointers on how the pipes need to be free and in their own world, and how everyone works together to not get blown up by the Soviet Union. Why did I bring up the Soviets when the USSR fell in the 90's, because they were apart of the space race and were even the first people to put a man into space and they clearly helped the Americans realize anything is possible and also realize don't launch nuclear bombs and missiles at one-another and that world peace is key. So how does this game represent that? Well lets begin with how people in this game have to cooperate together and live in peace, just like what I said earlier. Now with the game the Motherlode, First off the graphics could use a little tweaking for a more Realistic kind of feel like you're actually on the mother f****** moon, How cool would that be? Second, add VR support with these better graphics so it does more make you feel like your on the moon. Third, Add Mars cause who doesnt wanna go to the red planet and visit the martians. This is it really for the review and do I recommend this game? Hell Yes. You go NASA!",
            "review_score": "1"
        },
        {
            "review_text": "The community makes the game. Though it's hardly educational. All you do is make dirty jokes using the Text-to-Speech... trust me.. it's funnier than it sounds and doesn't cost a penny to play.  John Madden!",
            "review_score": "1"
        },
        {
            "review_text": "If you want to get drunk or high and have something that will make you laugh until you cry, this is it. But its fun for about a day and thats it.",
            "review_score": "1"
        },
        {
            "review_text": "Worst game ever. Frame rate started lagging really badly despite me having 2 AMD Radeon 290X graphics cards. Sound did not work after the initially loading videos. Terrible game.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really woth getting.",
            "review_score": "-1"
        },
        {
            "review_text": "best. game. EVER. wake up people and play this now!",
            "review_score": "1"
        },
        {
            "review_text": "If you're a dumb ♥♥♥♥ and like to spam 'john madden' in chat, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of immature little kids and trolls, completely ruins the experience of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "admit it, you downloaded this purely because of the text-to-speech gimmick",
            "review_score": "-1"
        },
        {
            "review_text": "I guess it's okay....if you want to repair stuff...and walk real slow on the surface of the moon......",
            "review_score": "-1"
        },
        {
            "review_text": "this is hands down, the best game I have ever played. With the free roam aspect, to the text to speech just makes this game so immersive. I really felt like I was actually on Mars looking for aliens. After around 1000 hours in this game I cannot think of a better way to become a real-lfe astronaut. I have always wanted to fly to another planet to have sexual intercourse with E.T, and thanks to the developers, it's now a possibility! This game is worth every penny and I would recommend anyone who has the funds to invest in this game. It gets a 27/27 from me - would play again",
            "review_score": "-1"
        },
        {
            "review_text": "ITS A TERRIBLE GAME DONT GET IT ",
            "review_score": "-1"
        },
        {
            "review_text": "Walking too slow, making it nearly impossible to get anywhere in time.",
            "review_score": "-1"
        },
        {
            "review_text": "it's boring and sucks! &lt;3",
            "review_score": "-1"
        },
        {
            "review_text": "Horribly unbalanced, making most of the tools useless -- there is only one set way/process to get the fastest time. NASA, how do you ever expect keep us (the competitive MA community) when the balance is so terrible?  -The robot, even on lowest battery and highest speed, has way too much power. -Tools such as markers are useless. -Glitches on vehicles makes your team insta-lose. -Animation problems and awkward collision lengthens your time by ~10-20s+ each run. -Terrible matchmaking. You thought DOTA2 or LoL was bad? Literally EVERYONE in every public server I've joined are noobs who probably couldn't even finish a run in the lowest tier of time, and just play around with the voice feature.  I've tried very hard to keep my MAR (Moonbase Alpha Rating) even at default levels, but all these noobs are ruining every single run for me. Some go as far as body-blocking me, or stealing the equipment that I'm using, and pretty much everyone spams the chat and abuses the voice feature, instead of using it to save the valuable time that it takes to type while communicating with your team. With no mods to ban these griefers, I don't think ANY serious MA player could last long in such a terrible environment.  If this keeps up, I might as well go back to Moon Base by Maid Maian.",
            "review_score": "-1"
        },
        {
            "review_text": "My father used to smoke all the time. My mother said to him: 'If you want to see your son grow up, you need stop smoking.' He bursted into tears and said: 'Your'e right...' Next year he died from lung cancer. I was only 7 years old when that happened. Since then, I havent ever touched cigarettes or alcohol. I really loved my dad and I didn't want to have the same father as him, so that my kids doesn't have to see me die. Now I regret never smoking or drinking, because im going to die really soon. This game gave me cancer and I never had the time to try anything.",
            "review_score": "-1"
        },
        {
            "review_text": "This game clearly has a lot to be done to it before it can still be classed as a game. It looks like day 1 unity menus with very poor gameplay which is badly described.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ the moon",
            "review_score": "-1"
        },
        {
            "review_text": "Obnoxious un-intuitive gameplay. Ugly Graphics. Non-Sensical Plot. Boring Setting. Stop upvoting this 'game' to troll steam users.",
            "review_score": "-1"
        },
        {
            "review_text": "The only game worth owning",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game i ever played if you would call it a game that is.",
            "review_score": "-1"
        },
        {
            "review_text": "ihate this game ",
            "review_score": "-1"
        },
        {
            "review_text": "IF your looking to have some spave fun this is not the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun when people do the tasks and type ridiculous things. It's boring when people spam annoying noises over and over. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is boring.How this has some good reviews i shall never know.Don't waste your time and CPU space getting this game ",
            "review_score": "-1"
        },
        {
            "review_text": "The only reason i played this for 58 minutes is because i forgot it was open so yeah this game sucks big d",
            "review_score": "-1"
        },
        {
            "review_text": "instead of people actually playing the game, everyone just ♥♥♥♥s around with text to speech",
            "review_score": "-1"
        },
        {
            "review_text": "Has not been updated since 2010",
            "review_score": "-1"
        },
        {
            "review_text": "This is s-h-i-t!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "While serious, it's a great laugh to play with friends. : )",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Its out of this world",
            "review_score": "1"
        },
        {
            "review_text": "Though I don't know why I'm playing this stuff, something keeps me in the moon!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game",
            "review_score": "1"
        },
        {
            "review_text": "In all honesty, this game isn't too enjoyable, for a long time. Fun and quirky the first 2 or 3 hours.",
            "review_score": "1"
        },
        {
            "review_text": "11/10  holla holla get dolla  best thing since sliced bread",
            "review_score": "1"
        },
        {
            "review_text": "This game is great to play properly, but now people only use it for the 'text to voice' chat option to make stupid sounds and general do nothing but sit around making sounds. They always say John Madden. I am from the UK but I have been told he was a NFL commentator or some rubbish like that. Play it on a private server with your friends to enjoy it properly!",
            "review_score": "1"
        },
        {
            "review_text": "Finisihing the game 55 minutes alone, felt like a pro until see the leaderbord. It says the best are 6 minutes... Nice text to speech simulator",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool just don't play it by yourself like i did the first time, otherwise it feels like you are the only hope for mankind(which is stressful). This game has a lot of potential 8/10",
            "review_score": "1"
        },
        {
            "review_text": "11/10 not that good -IGN 2017",
            "review_score": "1"
        },
        {
            "review_text": "As you can see I only have 28 minutes on the game...",
            "review_score": "1"
        },
        {
            "review_text": "Well you are on the moon sure.And that's no small feature. Too bad most of the community takes stupid pills and rapes your ears with the text-to-speech.And the curve is a bit hard to learn. But the moon is pretty.If you find some friends that are willing to help and not earrape you, you will be fine. Single player is also an option in case you hate people like me.",
            "review_score": "1"
        },
        {
            "review_text": "this gaym is such fun. very much moons ther r an u can hav very fun. topkek m8 get shrekt",
            "review_score": "1"
        },
        {
            "review_text": "this is relay fun",
            "review_score": "1"
        },
        {
            "review_text": "I stood on a rock and told people to worship me, they did 12/10",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wondered what it would be like to start a Zero-G Prostitution circuit or if NASA sent crack as part of their astronaut's rations, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "2 scary 4 me",
            "review_score": "1"
        },
        {
            "review_text": "this is a very fun game to play with friends ",
            "review_score": "1"
        },
        {
            "review_text": "I loove this game its beautiful",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, John Madden",
            "review_score": "1"
        },
        {
            "review_text": "Best moon simulation i've played",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable NASA edutainment garbage. Worse than M.U.L.E. Hey eggheads, why don't you focus on finding life on Enceladus instead of making asinine Chex Quest games.",
            "review_score": "1"
        },
        {
            "review_text": "Apollo 13 ain't got ♥♥♥♥ on this. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and i recommend this game to everybody",
            "review_score": "1"
        },
        {
            "review_text": "It was dark and I was all alone. I was desperately trying to find the wrench to repair the pipe connection when all of the sudden out of the darkness another astronaut leapt out of the darkness straight at me! I panicked and blinked an he was gone. There was no one else on the moon with me and yet he was there. It was the most terrify moment of the 30 minutes I spent on the moon. ",
            "review_score": "1"
        },
        {
            "review_text": "World's best text-to-speech griefing engine. GOTY.",
            "review_score": "1"
        },
        {
            "review_text": "pros  -aeiou -fix broken moon machines  cons  -steam thinks I down own it and keeps showing it to me on the main store page because third-party installation",
            "review_score": "1"
        },
        {
            "review_text": "[:tone 3000,9999], That is all.",
            "review_score": "1"
        },
        {
            "review_text": "good game but needs more to it",
            "review_score": "1"
        },
        {
            "review_text": "The greatest movie of all time, leonardo da vinci should get a grammy for this one. 9/11",
            "review_score": "1"
        },
        {
            "review_text": "Moon Racing sim and drilling sim  my friends ran out of oxygen and i was singing in toxic area and died.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best game of all time. It taught me countless things about space exploration that I never knew before.",
            "review_score": "1"
        },
        {
            "review_text": "boring when i seen the work moon base i thought wow ok must be pretty fun well i was wrong . all you do is run around on the moon fixing ♥♥♥♥ like come on whats the fun in that give it a twist for god sake lol unless you are extreamly dull or bored this game is not for u when it comes to games you know how theres always diffrent things to do ? not just one thing? well this is an example of a bad game its not even a moon base game its more like fix stuff on the moon simulator",
            "review_score": "-1"
        },
        {
            "review_text": "a very good game i hope that the producers of this game will put more things to do",
            "review_score": "1"
        },
        {
            "review_text": "I realized my friends are dumb. This game has taught me a valuable life lesson.",
            "review_score": "1"
        },
        {
            "review_text": "i literally played this 3 days ago on Linux... now its saying i can't? WTF? it was actually really stupid... as there is only one mission and one multiplayer mode that gives you super powers essentially.. kinda stupid but it was fun until you realize that.",
            "review_score": "1"
        },
        {
            "review_text": "I really want that text-to-speech. I'd like it for trolling and vids. xD",
            "review_score": "1"
        },
        {
            "review_text": "Based Moon Alpha.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great concept! we need more games likes this!i pernaly want one on Mars ",
            "review_score": "1"
        },
        {
            "review_text": "You can sing.   A++/15",
            "review_score": "1"
        },
        {
            "review_text": "Basic game play for me with few hrs. It is a good game, yes there is an issue joiing servers but as you can see people make the rooms so they can play and keep the trolls out. It is unfortunate but if the ones who want to play keep in touch it would be a good group game. If your interested in playing with a good group of people feel free to friend me on steam or join us on teamspeak:  russianmilitia.no-ip.org  or  russianmilitia.enjin.com  we'll be more then happy to accomodate you.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game ! I wish there will be more stuff to come ! :D",
            "review_score": "1"
        },
        {
            "review_text": "it's stupid. All you seem to do is to have one short mission of repairing the oxygen. That seems to be it.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, nice graphics and good physics. Aside from that, WAY TOO SHORT and after that one mission there's nothing left to do but do it again...",
            "review_score": "1"
        },
        {
            "review_text": "Ehh Just no  ",
            "review_score": "-1"
        },
        {
            "review_text": "i got this game to hope i could build a colony instead all i get to do is repair drive and go in the command center come on ",
            "review_score": "-1"
        },
        {
            "review_text": "its a funn game when your bored",
            "review_score": "1"
        },
        {
            "review_text": "IT IS THE BANEBLADE",
            "review_score": "1"
        },
        {
            "review_text": "Best thing about this game &gt; Chat .  Wreck the moon ! John Maden FTW !",
            "review_score": "1"
        },
        {
            "review_text": "Dear NASA,  I can't wait for Moonbase BETA. I can't wait until there is an actually Moonbase ALPHA and the astronaut choir gets to sing there.  Love, Gabumon  PS: Boobies",
            "review_score": "1"
        },
        {
            "review_text": "connect pips to ech other simulator",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome, and steven hawkings approved! So I give it a 10/10 would always play because on Windows. And super funny!!!!! XD",
            "review_score": "1"
        },
        {
            "review_text": "Criminally underplayed, not enough good servers",
            "review_score": "1"
        },
        {
            "review_text": "FUN, I LIKE TO TYPE MORE THAN I ACTUALLY PLAY THE STIMULATION. RECOMMENDED TO OTHERS",
            "review_score": "1"
        },
        {
            "review_text": "When me and my mates first got into the game, we didn't realize what we had stepped into. However the adventure that awaited us was long, and arduous. In the first chapter, you must pick a random player from a lobby, and tell him he is 'The Chosen One' who's destiny is to Slay John Madden, and save the moon. After this, we would bring the Chosen One an Excalibur Blade (or beacon). When John Madden comes to destroy the moon, the chosen one must slay him with all his might. After John Madden was stopped, Chapter 2 is started. In which, you must save the enslaved worms from their holding cells. By unplugging them, and taking them all to their homes. Once you do that, the chosen one gets all the babes, and you win the game.  10/10 Needs a sequel.  #SaveTheWormz",
            "review_score": "1"
        },
        {
            "review_text": "hilarious, fun and the price is right for sure",
            "review_score": "1"
        },
        {
            "review_text": "10 out of 10 say it's not gay if it's on the moon.",
            "review_score": "1"
        },
        {
            "review_text": "it fun needs a little more work",
            "review_score": "1"
        },
        {
            "review_text": "Joined a server. Started walking. i then realized I was walking at about 300 METERS PER SECOND! I then ignored the insane walk speed. Traveled to a tool shed. Picked up a welder while a random lady voice was repeating 'we are low on oxygen, FIX IT' or something like that. As I picked up the welder my arm morphed into itself while seemingly shrinking and growing in some sort demonic worship thing. After 5 minutes of watching my arm doing weird things I dropped the welder and exited the server. In summary: join a server, walk fast, try fix stuff, arm evil, quit. Rating: 8/10. BTW the game is FREE!",
            "review_score": "1"
        },
        {
            "review_text": "You know what kind of job you guys are doing? Great!",
            "review_score": "1"
        },
        {
            "review_text": "Good game even though its pretty pointless",
            "review_score": "1"
        },
        {
            "review_text": "Still a better love story than Twilight.",
            "review_score": "1"
        },
        {
            "review_text": "TEXT TO SPEECH ._.",
            "review_score": "1"
        },
        {
            "review_text": "This game seemed to be fun at the start but my BF and I played for over an hour and we've both agreed that this is one of the most boring game's we've ever played. Its like running through mud the entire time and the whole concept is good but needs a serious overhaul to make it more high speed. I mean I would totally love this game if I was stoned out of my mind but seriously, this is the definition of government backed gaming. Slow, tedious and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Text-to-speech is FTW!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Too many Joses.",
            "review_score": "1"
        },
        {
            "review_text": "this techdemo itself is awesome,the only problem is since it's release,I've never heard anything about the main game : 'moon,mars and beyond',I hope they didn't gave up the project...",
            "review_score": "1"
        },
        {
            "review_text": "This is easily the dumbest game I have ever liked, but I will continue playing it for John Madden. Download this game with your friends, but don't wear headphones.",
            "review_score": "1"
        },
        {
            "review_text": "Played only for the text to speech. Best time of my life with my friends. R8 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have always wanted to be an astronaut. Unfortunately, due to the car accident, my leg was amputated. My dream was dead. But, luckily, this game saved me. NASA created a very accurate space simulator, where I can truly pretend my dream came true. I can communicate to my teammates using the accurate text-to-speech engine, and we can use teamwork to create the Space Station on the moon. Great game. This game cured my depression, although probably not for long. After all, even my sons are disappointed in me. Oh well.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game for all people who are interested in space travel and NASA. Generally as a game is can be very slow and technical and mostly unforgiving if you make a mistake, However picks up well for being realistic mostly and displaying interesting concepts for the future. Generally though as a gamer it was boring and maybe not worth the time considering it was only like a 30min game with ONE MISSION which on both levels was disapointing. Generally overall I'd say its fun ONLY IF your interested in space travel, if not maybe you should'nt play it. 10/10 Space Travel, 4/10 Gaming",
            "review_score": "1"
        },
        {
            "review_text": "I want to be an astronaut xD Im waitin other versions of this game ! go Nasa go !",
            "review_score": "1"
        },
        {
            "review_text": "The best thing and only good thing is the TTS",
            "review_score": "1"
        },
        {
            "review_text": "text to speech simulator aeiou john maddin holla holla get dolla and winny little kids (but not too many) 10/10-would ear ♥♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "one 'mission' long. good graphic but not worth the download time",
            "review_score": "-1"
        },
        {
            "review_text": "Text-to-speech is the future! NASA = 10/10 EA = -7/Hamburger",
            "review_score": "1"
        },
        {
            "review_text": "its good but really confusing, i dont know what to do",
            "review_score": "1"
        },
        {
            "review_text": "Tax money put to a good cause. I found this game to be very educational and promotes teamwork in the best degree possible. Definetly a videogame that should be allowed in school, folks can learn a lot from it in more ways then one.",
            "review_score": "1"
        },
        {
            "review_text": "get ingame press enter and type lolololololololololololol and have a funny time",
            "review_score": "1"
        },
        {
            "review_text": "I like the game. Sure, it's a bit small, but hey. It's alpha. I think this game has some potential.  ",
            "review_score": "1"
        },
        {
            "review_text": "invariably exciting--yet depending on where your adventure takes you, such battles may not even represent the pinnacle of your experience. A side quest that starts as a momentary distraction may turn into a full-fledged tale that could form the entirety of a less ambitious game.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty amazing for a free game so yeah about a 6/10",
            "review_score": "1"
        },
        {
            "review_text": "NASA makes the best use out of a limited budget.",
            "review_score": "1"
        },
        {
            "review_text": "first one to comment is me",
            "review_score": "1"
        },
        {
            "review_text": "I would like to state that this game is OUTRAGEOUSLY Amazing to play! If you play space engineers or KSP and love building, this is the game for you! Especially if you like funny stuff, this game has Awesome text to speech that can be very funny! Theres the guys (One is me!!!) Who build for challenge or like building in this game, And the People who just give a blow by blow of everything and have a weird Obsession with John Cena and John Madden. And those people who spam to make people leave. Besides all of that, This game has Outrageously amazing graphics and actually acts like the real moon with the Low Gravity and how to produce the oxygen. Repairing and stuff takes the time, not as much as the real moon would take, But this is awesomely good with its setting. Theres even small gamemodes that you can play that may be a bit Scary. like he Moon Madness one. Out of all this has great graphics and simulates being on an actual moon. I would play it alot if you told me too. The only problem is the people who spam John Madden and loud noises in Text-To-Speech. Out of all if i were to give an actual rating it would be 9.7/10, I would totally recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Great choice of VAs, an entertaining and well-curated game set in the magical world of Maddenland. Work with your friends to find the ancient secret of Papa John's pizza and explore new horizons with the A.E.I.O.U. Driving System!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, reminds me of The Martian. but without the potatoes",
            "review_score": "1"
        },
        {
            "review_text": "I'm actually not sure if you would like this game. All you do is repair equipment on the moon and restore oxygen levels. The best part about this game is the textbox voice. You can change it up with certain commands and it's hilarious!!! Other than that, it's kinda boring unless you're with friends!!! MYAAH!",
            "review_score": "-1"
        },
        {
            "review_text": "Game itself is pretty interesting. But it's full of ♥♥♥♥♥♥♥. If you want to play co-op - you need to have frinds for this. Not going to work with random people.",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game; I really enjoy the lets plays of this, and I love the text-to-speech text LOL",
            "review_score": "1"
        },
        {
            "review_text": "Moon base Alpha is a fun simulation, which is quite realistic (as far as you can tell) and free.",
            "review_score": "1"
        },
        {
            "review_text": "Play it for the computer voice alone. It's free. Stephen Hawking can talk dirty to you. What more do you need?    aeiou",
            "review_score": "1"
        },
        {
            "review_text": "best game i have ever played but i think they sould have added more robots more planets and more acesable areas and mabye veichals and things to do ",
            "review_score": "1"
        },
        {
            "review_text": "Text-to-voice.",
            "review_score": "1"
        },
        {
            "review_text": "+ Free-to-play - Its a more of a puzzle game then a simulator -.-",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is boring as heck, but the conversations can be absolutely hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, very ticky and you have to have a definate plan to fix the station.",
            "review_score": "1"
        },
        {
            "review_text": "we can take over the crack game  ololololololololololololololololo slurp slurp",
            "review_score": "1"
        },
        {
            "review_text": "In space, no one can here you meme...",
            "review_score": "1"
        },
        {
            "review_text": "The best text to speech program ever.... of all time... right now.",
            "review_score": "1"
        },
        {
            "review_text": "ok, it is very cool but after restoring the oxygen I don't know what to do. It has potential and perhaps I am missing something.",
            "review_score": "1"
        },
        {
            "review_text": "here comes another chinese earthquake  ERBRBRBRBRBRBRBRBRBR",
            "review_score": "1"
        },
        {
            "review_text": "Best Space themed game ever.. addicting.. keep it up..",
            "review_score": "1"
        },
        {
            "review_text": "Best game Ive ever played I pleayed this for hours onm ed unhookinh people oxygen from thweir home s a d jti was lgeat",
            "review_score": "1"
        },
        {
            "review_text": "Text-to-Speech",
            "review_score": "1"
        },
        {
            "review_text": "Text-to-speech Simulator... IN SPACE.",
            "review_score": "1"
        },
        {
            "review_text": "Great education game",
            "review_score": "1"
        },
        {
            "review_text": "i have been having trouble with this game with the whoal start up bug :/",
            "review_score": "1"
        },
        {
            "review_text": "You're on the moon with other players with no voip.  Instead you use Text to speech and it makes it 10x better. ",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game... if you like holding the 'w' key the whole time...",
            "review_score": "1"
        },
        {
            "review_text": "The best hose simulator of all time. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "It is not a bad game but I have some suggestions: -You should be able to go inside the settlement and spaceship -You could need to go inside the settlment to fill up on oxigen for the suit  That's really it tho it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the universe! Get it now!",
            "review_score": "1"
        },
        {
            "review_text": "All I do in this game is muck around with the text to speech thing, I haven't even played the game properly! Typing words is just too distracting! Seriously play this game and don't forget to turn on text to speech. Now type random ♥♥♥♥. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "This Game Makes You Feel Like You're In Space! You Can Pretend!",
            "review_score": "1"
        },
        {
            "review_text": "it is a good game when the people aren't messing with the text to speech ingame.",
            "review_score": "1"
        },
        {
            "review_text": "You are supposed to put all the pieces together... But I like to take everything apart instead.",
            "review_score": "1"
        },
        {
            "review_text": "I think I laughed the entire time I played. I broke my keyboard because I couldnt contain my laughter and dragged it off my desk onto the ground with me. I was literally ROFLMAO.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is literally the best game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Moonbase Alpha is an exciting entry in the space-opera genre. It details the exciting adventures of a maintenence crew sent to the moon. One will find himself/herself blasting aliens, sipping cold ones, and making the usual roundabout with the geniously included moon rover. Additionally, this title borrows on elements from Half Life 2, Day Z, and CS: GO to bring an experience worthy of even the most professional gamers.",
            "review_score": "1"
        },
        {
            "review_text": "A good game to play when you are bored. If you have nothing to play and u have no money get this.",
            "review_score": "1"
        },
        {
            "review_text": "If you say anything from this game other than 'uuuuu', you're 100 percent Grade A autism.",
            "review_score": "1"
        },
        {
            "review_text": "This is a quite nice game besides they need to update it where there is multiple planets for more missions instead of just working on the same place doing the same thing on the moon",
            "review_score": "1"
        },
        {
            "review_text": "Aeiou....get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Instant Classic! One of the best games i've ever played!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, although it's in Alpha it is still fun. Multiplayer is good (as long as you don't join a server with a million pipes on the floor) and there are other maps to play on, for a change of scenery.",
            "review_score": "1"
        },
        {
            "review_text": "Worth to play. Also this game is absolutely FREE.",
            "review_score": "1"
        },
        {
            "review_text": "Gentlemen: I present to you, the future generation of NASA",
            "review_score": "1"
        },
        {
            "review_text": "very good, entertaining and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, Hoses, NO HE'S GOING TO ♥♥♥♥ ME!   Football!",
            "review_score": "1"
        },
        {
            "review_text": "Repairs have never been so much fun. Nice and relaxing game with pretty interesting setting - the Moon. Realistic and educational approach from NASA. I hope they'll make more games like this one.",
            "review_score": "1"
        },
        {
            "review_text": "its a fine game",
            "review_score": "1"
        },
        {
            "review_text": "Experience life on the moon... without all the zombies, aliens or 'moon monsters'.",
            "review_score": "1"
        },
        {
            "review_text": "Very very very awesome this is a 5 star for me! if you add a run button and a rover that holds an item dispencer than I wouldnt get bored at like the end. Oh and add other missions. Well good job on the game (could be earning hundreds by selling for 0.50 or 0.25)",
            "review_score": "1"
        },
        {
            "review_text": "Best game i've ever played. I hate it.",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun challenging game to play with friends ",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to those who like to kick back with a simulation once in a while.",
            "review_score": "1"
        },
        {
            "review_text": "one of the only games that makes fun of the text to speech by making it sing",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure this game is meant for those who are space buffs or really big fans of being an astronaut. I find the game really lulz-filled when you turn on the text-to-speech system. Makes this game hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "Make sure you get the Game of the Year edition",
            "review_score": "1"
        },
        {
            "review_text": "really fun",
            "review_score": "1"
        },
        {
            "review_text": "Isn't someone supposed to fix the Moonbase?",
            "review_score": "1"
        },
        {
            "review_text": "the most amazing talk dirty to each other on the moon using microsoft sam game ever",
            "review_score": "1"
        },
        {
            "review_text": "it is goood play it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most spectacular games I have ever played. If this doesn't win some type of award for it's epic graphics, fantastic multiplayer, and awesome (text to speach) feature, i'll be utterly shocked. This game is 100% based around doing the presented task and most definitely not for messing around spamming '69er' with the text to speach option. Every player you meet will always work with you to complete the current objective. I believe it was said Obama himself has played and enjoyed this game.  Overall rating 11/10",
            "review_score": "1"
        },
        {
            "review_text": "No one takes me seriously. Not even John Madden.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game with chat XD",
            "review_score": "1"
        },
        {
            "review_text": "$0 MUCH $W4G xXx360MLGxXx PRO PWN4G3 L33T I'LL RECK U 1v1 YA SCRUBS ADD ME I'LL ♥♥♥ U UP YA HEAR THAT IT'S ME xXxSCRUBCRASHER666CRAZY♥♥♥♥♥WRECKERxXx SAYIN THAT I'M GOD AT DIS U ♥♥♥♥ L0L I'M 100% CRAZY SMOKIN' WEED AND SHIZZ YA SCRUBS PREPARE URANUS L0L YOLO xX420Xx",
            "review_score": "1"
        },
        {
            "review_text": ":3",
            "review_score": "1"
        },
        {
            "review_text": "Cooperative, short but relaxing. Free.",
            "review_score": "1"
        },
        {
            "review_text": "Sexy.",
            "review_score": "1"
        },
        {
            "review_text": "COME OVER COME OVER COME OVER COME OVER COME OVER COME OVER COME OVER COME OVER COME OVER COME OVER COME OVER COME OVER JOHN MADDEN JOHN MADDEN JOHN MADDEN JOHN MADDEN JOHN MADDEN JOHN MADDEN JOHN MADDEN JOHN MADDEN JOHN MADDEN JOHN MADDEN UUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU",
            "review_score": "1"
        },
        {
            "review_text": "NASA's free 'game'. It's got potential, but it's unfulfilled. (And they don't seem to be developing this any further.)",
            "review_score": "-1"
        },
        {
            "review_text": "Game of the millenium.",
            "review_score": "1"
        },
        {
            "review_text": "goty all years",
            "review_score": "1"
        },
        {
            "review_text": "If NASA created it, then it shall be a good game...",
            "review_score": "1"
        },
        {
            "review_text": "microsoft sam's replacement",
            "review_score": "1"
        },
        {
            "review_text": "You can save the space. Be the moon. John Madden. 888. The Russians should have won the space race. Fast paced action. Invigorating quick time events. Stimulating mini-games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good it left my ♥♥♥♥ unpuckered for more. Would buy sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Play this game.  It must be experienced in the darkest abis of you soul.   You must see it to believe it.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should play this once in their life!  And only once. It's not much of a game.",
            "review_score": "1"
        },
        {
            "review_text": "Easy - to - ninja co-op first person game with no guns and only pizzles? It's actually pro ;)",
            "review_score": "1"
        },
        {
            "review_text": "If you like to very slowly bounce around a depressing grey landscape endlessly searching for a toolshed, so you can then fix something very boring that broke in a very boring way, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "--------------------------------------------------------------------------------------------------------------- (Portuguese) Um bom jogo e divertido para passar o tempo com os amigos online! Eu Recomendo! =] --------------------------------------------------------------------------------------------------------------- (English) A good game and fun to spend time with friends online!  I recommend! =] --------------------------------------------------------------------------------------------------------------- (Spanish) Un buen juego y la diversión de pasar tiempo con sus amigos en línea! Recomiendo! =] ---------------------------------------------------------------------------------------------------------------",
            "review_score": "1"
        },
        {
            "review_text": "aeiou simulator 2010 the sun confirmed for flat the earth confirmed for flat aeiou brbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrbrb John Madden! John Madden! John Madden! John Madden!",
            "review_score": "1"
        },
        {
            "review_text": "Don't even waste your time with this crap...",
            "review_score": "1"
        },
        {
            "review_text": "wwwwwwwwwwwwwwwwwwwwwww   Text to speech was fun until people ruin it by doing some fancy commands [aa&lt;9999,9999&gt;] ,for example",
            "review_score": "1"
        },
        {
            "review_text": "it was kinda boring i think, hard to remember since i played it so long ago for such a short time",
            "review_score": "-1"
        },
        {
            "review_text": "A game purely for comedy: IE: John Madden With Text-to-Voice",
            "review_score": "1"
        },
        {
            "review_text": "I sung the Indiana Jones theme tune while repairing the tubes that provide Oxygen to the base.  What more could you possibly want to do?",
            "review_score": "1"
        },
        {
            "review_text": "This is gold. Pure gold. Dramatic choir with John Madden!",
            "review_score": "1"
        },
        {
            "review_text": "'It's like skyrim with a chat' 10/10 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "ITS REALLY COOL",
            "review_score": "1"
        },
        {
            "review_text": "Once some of the New maps start coming I know Ill be coming back to launch off to another distant horizon. This one completely threw a wrench in it for me the first time I went online with someone. Firstly I had no idea that outter space not only can noone hear you 'scream' , but theres no sound at all i guess. So I completely just said 'meh' and walked out of the lobby. But it took only a second chance encounter with this game that now has me buckled down and ready for some actual flight to someplace.  Urnfortunately this one is mostly taking place on the ground as a techie astronaut that has to solve the issues of scientists stranded upon our one planet that weve set foot on other than our own. The concept is simple in that you have to load up your equipment onto a moon buggy and head on out and pull a bruce willis but instead of dissolving a humongous asteroid into pieces, you just have to save a few stranded persons inside their small space huts up on that white moon. The slowness of the whole mission(s) are almost too tedious at first that is until you strap into the moon buggy and start your journey to start problem - solving. THats what this one is about so mostly it tends to attract us mechanics, pc fixer-uppers, and an occasional baker or two. Ha. Well the tool kits you use are very basic, but the parts you get to change out make this one intersting enough, specially for you weekend mechanics. The wrench came in handy for me only a couple times(But your remote robot will use it in the dastardly deeds and danger prone environments). This is also where some of you may be still entertained enough to want to finish the 'Mission : The robot you get off the main base hq, you assemble in a matter of seconds with a funny little animation sequence. But the operationality of it all is where the frustration among other things soon starts. The little wheels attached to the robot have to be slightly manipulated just enough to get where you want(dont even try backwards unless you like using a stopwatch for literally the slowest backup in historical history of moon buggy inventions).  Next comes the repairing jobs, its fun once you figure what needs repairing, and you just have to use a {Welding gun' and A 'Wrench' both for you and your bots. However theres also a matter of Battery Juice runing out quite quickly for you armchair astronauts. THERE IS NO RECHARGABLE BATTERIES, YET! You have to either Disassemble the whole contraption, or just completely make it go away and get a new one. This comes in handy in that you get a fresh robot, but frustrating for you folks who like to come back and finish what you started in your Weekend Tool Shed.  Also you get to change out parts and various things like : Satellite dishes, and Solar Panels and an occasional Hose. But usually a welding torch or wrench suffices. I know Ill be back to venture back for NASA once they head out to MARS and maybe Venus if theres some opposite sex on that distant planet. Ha",
            "review_score": "1"
        },
        {
            "review_text": "Nothing like Moonbase alpha to troll the **** outta of people.(ps most people on here are noobs and are easily trolled)",
            "review_score": "1"
        },
        {
            "review_text": "incredible.",
            "review_score": "1"
        },
        {
            "review_text": "Must have",
            "review_score": "1"
        },
        {
            "review_text": "ANOTHER EARTHQUAKE IN CHINA -- BRBRBRBRBRBRBRBRBRBRBRBRBR",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "If you laugh hysterically when people add more vowels to words then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I know you want it.",
            "review_score": "1"
        },
        {
            "review_text": "This NASA masterpiece has really set the benchmark for Moon Exploring Text - to - Speech games. I highly recommend any followers of the Moon Exploring Text - to - Speech genre to download this and play it endlessly. This game really displays NASA's game developing talent. With absolutely no glitches or hiccups in the coding of the game engine.  You can make your Astronaught say '♥♥♥♥ cheese.' 11/10",
            "review_score": "1"
        },
        {
            "review_text": "*sigh*",
            "review_score": "1"
        },
        {
            "review_text": "Aside from other players constantly spamming and messing with the text-to-speech, this is a fun, hilarious game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Moonbase Alpha is a marvel of the 21st century. You cannot even compare any other games like Gears of War, Call of Duty, Team Fortress 2, or even Assassin's Creed to this landmark in human intelligence. If you were to put a average Joe into this kind of enviroment, his head would implode from the amazing graphics, story, and gameplay. If you were to play this game, your feeble monkey brain would not even be able to understand the deep, complex and twisted story of Moonbase Alpha. NASA's masterpiece of 2010 shows us how far America has come in understanding space and lifestyle in space. Moonbase Alpha shows that even through NASA, we can learn much more about space and the human psyche. Moonbase Alpha follows the story of astronaut John Madden and his daily life on Moonbase Alpha, NASAs experimental base on the moon. If John fails his secret mission objective, his family and status in the NFL will be taken away and soiled by NASA. Moonbase Alpha brings us this harrowing story along with intense gameplay elements such as fixing carbon dioxide leaks, repairing solar panels, and driving robots. If you even attempted to finish such a hard, cruel game, you would be hailed as a god among men. Jesus would bless you with immortality and wealth beyond comprehension. The graphics in Moonbase Alpha top even Crysis 3 and have made many a computer catch fire. Even my IBM Super Computer cannot handle such a masterpiece as Moonbase Alpha. Many will look back to this game in the future, and smile as they remember their glorious past. NASA will forever be hailed as the wunderkind of this millenia. Thank you, NASA, for creating such a wonderful and exciting game.",
            "review_score": "1"
        },
        {
            "review_text": "NASA Let ♥♥♥♥♥♥♥♥ people on the moon 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an old game but fun, just the few hours i played with my friend showed me how amazing this game is. We didnt do any of that fix the oxygen poop we fooled around it was amazing",
            "review_score": "1"
        },
        {
            "review_text": "Goverment cuts funds to Nasa / Goverment funds Nasa game on steam -10/10 Will pay taxes agian",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME MADE ME WANT TO HAVE SEX WITH BOULDERS",
            "review_score": "1"
        },
        {
            "review_text": "Its a cool game but a littel hard well in my opinion they did well with the graphics are GREAT if you havent played it you should give it a try it funny and its not a long download and its free i thingk you will like it and if you work for N.A.S.A it mite help you.",
            "review_score": "1"
        },
        {
            "review_text": "this game is very cool , love playing it.",
            "review_score": "1"
        },
        {
            "review_text": "You should really get this game for just it being a group text-to-speech. It's awesome for that... Otherwise not so great.",
            "review_score": "1"
        },
        {
            "review_text": "I almost rated this game down. But then I realized the little gleam of hilarity that makes this game oh so worthwile.  Just the sheer awkwardness of this game is charming. Men walking around on that little rock that rotates around our wonderful world, just goofing off and working on sustaining a moonbase (or completely ruining that bases operational capabilites).  The first thing people do when they actually go into a game is either one of two things; You are there to make a fool of yourself (along with everyone else, so there is no ridicule), or take the game seriously. The former is more likely done than the latter, most likely because nearly nobody takes this game seriously. A must do for this game is enable the text to speech, and you will most likely NEVER do that latter ever again, or never even consider it at that point, as the TTS reads all messages just in such janky and funny matter.  A usual game of Moonbase Alpha looks like this: - The jerkoffs that lollygag around the base (nearly everyone). - Serious players. - 'AEIOU' TTP spammers.  This game is an accidental gem. For being free, such a seemingly boring experience could be easily reversed into a hilarious and completely nonsensical game. Should not be played for extended periods of time, may lose brain cells.  //   Should not be played for extended periods of time, players may lose brain cells. [i/] \\\\ ",
            "review_score": "1"
        },
        {
            "review_text": "The game is free, but i still feel cheated out of money. the game itself gets boring after a while and is imposible in single player and every single multiplayer server is full for spam circles. the devs didn't even have the decency to add a swearing filter in the chat.",
            "review_score": "-1"
        },
        {
            "review_text": "Its hard to describe really...Its interesting, and entertaining...In a game made by NASA kind of way...Thats not a bad thing...Really...Just give it a try! I mean, Hey! Its free!",
            "review_score": "1"
        },
        {
            "review_text": "No tut. Other players always do their own thing... Kinda boring.",
            "review_score": "-1"
        },
        {
            "review_text": "I HAVE NO IDEA WHAT I AM SUPPOSED TO DO.",
            "review_score": "1"
        },
        {
            "review_text": "i wood rather minecraft",
            "review_score": "1"
        },
        {
            "review_text": "The eagle flies at dawn",
            "review_score": "1"
        },
        {
            "review_text": "1. Downloaded game. 2. Tried to speak in game. Sounded rather funny. 3. ♥♥♥♥♥♥ myself over the songs that can be played using game chat. 4. Never played it since!  0/10 would not speak again",
            "review_score": "-1"
        },
        {
            "review_text": "Microsoft Sam, the multiplayer game 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Created a server. People joined. People started to fall in love with me. People wanted to have my children. People demanded friend requests. I accepted one friend request. Enabled developer console. Spammed power cables to create a massive tentacle monster. Listened to new friend screaming about how his PC was on fire. Listened to him talk about his monitor flickering. Listened to general updates about his PC status for 30 minutes, occasionally adding on to the amount of hoses. Almost died from laughter. Friend refused to leave because they feared I would unfriend them and they would never see me again. New friend tried to guilt trip me about how all he wanted was a friend and a friend wouldn't destroy another's PC. Explained how I saw a friendship was pointless since the only game they owned was Moon Base Alpha and I rarely play that. He didn't listen to reason. Decided to leave new friend to die on server. Removed friend from friend list.  I can live with myself after what I did to that random person.",
            "review_score": "1"
        },
        {
            "review_text": "This is a 1.1 gigabyte Text-To-Speach simulator.  American tax dollars hard at work. This game single handedly caused the 1 trillion dollar tax deficit. Download this if you want to waste time &amp; bandwidth for a terrible game and then question why said game even exists in the first place!",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are good. Menu is bad, no updates since a really long time ago, menu sounds are bad, game resolution is bad. It it pleasant to feel like you're on the moon with all of these space exploration technologies (Rovers, tools, tubes), and the game is free.",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay 10 outta 10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Its very good highly recommed for those who use text to speach for fun :3",
            "review_score": "1"
        },
        {
            "review_text": "I'm having problems with ingame sound, can someone mail me for support?",
            "review_score": "1"
        },
        {
            "review_text": "top kek baby got the diarrhea ",
            "review_score": "1"
        },
        {
            "review_text": "walked on moon as if on slow motion knowing that millions of taxpayer's dollars was spent on this with no purpose at all.  10/10 would cut nasa's budget again.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game for mulitplayer fun. The more the Merrier",
            "review_score": "1"
        },
        {
            "review_text": "If even NASA can make a more fun game that is 4 years in aplha now and for free. Why most game companies can't do that more and more lately? Don't even think, play this game with friends now!",
            "review_score": "1"
        },
        {
            "review_text": "'10/10, would play again' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Dear friends, Please download and play Moonbase Alpha.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  -The Text-To-Speach system is one of the most fun I have ever seen, trolling people with it it very fun. -You can be John Madden, or meet John Madden... -2 'Gamemodes' to choose from, one team, or two teams with a halloween twist, gameplay is otherwise the same. -You can disable the Text-To-Speach or host a password protected server with a friend if you don't like the spam.  Cons: -Old-ish game, 2010. -Less than an hour of actual 'gameplay' other than messing about with stuff. -People can kill your ears and/or sound equipment using chat macros such as [:nh][:rate0][:dv br 80][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;] -The gameplay that does exist, is very repetitive though still fun the first 4 or so times. -The base is more or less premade for you, nothing you can customnise.  tl;dr Fun game, say [:nh][:rate0][:dv br 80][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;][iy&lt;9000047&gt;] in chat to murder your friend or entire server.",
            "review_score": "1"
        },
        {
            "review_text": "Nasa has once again landed on the moon and this time they ♥♥♥♥ed this up     ",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't worth your time if you're looking to play solo. It's damn well near impossible to play solo in fact.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a decent game, only thing I wish they'd add would be an open world mode. I know it's a legit simulator, but seriously, it's a game too, make it fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun, and multiplayer is very simple to set up. I don't mind playing this game for hours on end just trying to get higher on the leaderboards.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me want to be an astronaut.",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure this is a great multiplayer game, but Single Player mode is just impossible. Too much to do and not enough time to do it. Every second counts, and in the end it's just not enough. To be honest, I was expecting a relaxing space romp, but nah, it's full simulation. Couldn't even get past the first level (if it's even level based, it could just be an endless series of coupling failures). Essentially, this game asks the question Kerbal Space Program forgot: how will you survive once you get to the moon? And then it applies Murphy's Law and makes it all go horribly wrong. 8/10, the fact NASA made it is pretty cool, and it has nice music too, just a lot more intense and unforgiving than I expected it to be.",
            "review_score": "1"
        },
        {
            "review_text": "One small step for man, one giant leap for John Madden.",
            "review_score": "1"
        },
        {
            "review_text": "fun and spacey ",
            "review_score": "1"
        },
        {
            "review_text": "My experience with moonbase alpha: Pingas pingas pingas ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ahss ahss     11/10 - 'It was okay' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "fun game, it uses minigames to complete some tasks, but it has an interesting multiplayer. also it has a really cool text-to-voice function that sounds like steven hawking!",
            "review_score": "1"
        },
        {
            "review_text": "Sorry Ubisoft and EA, but I'm having more fun and less bugs in that little game than in almost any of yours...",
            "review_score": "1"
        },
        {
            "review_text": "dis game so dank my dro bow down to it",
            "review_score": "1"
        },
        {
            "review_text": "one word: aieou TIP:turn on text to speech to fully have fun  HOW TO PLAY;MOON BASE ALPHA  step 1;download(about 3 minutes)  step 2; click 'join game' and join the one server thats not password protected  step 3; spam 'AIEOU' in chat  step 4; repeat for the rest of your life",
            "review_score": "1"
        },
        {
            "review_text": "The Moon is the best place to cook meth.    10 Buckets of Chicken Batter/10 Bags of Crystal Blue Persuation",
            "review_score": "1"
        },
        {
            "review_text": "Its a preety cool game especialy with freinds but, I always fail to save the base ;-;",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun and challenging game with many people to play with! Had a great time playing! The community of players are really nice and helpful!  Play it!",
            "review_score": "1"
        },
        {
            "review_text": "All this game needs now is a Generic red square",
            "review_score": "1"
        },
        {
            "review_text": "nasa needs 2 stop funding video game and go back to space",
            "review_score": "1"
        },
        {
            "review_text": "Bring HIM to a GAAAAAAAAAAAAAAY BAR",
            "review_score": "1"
        },
        {
            "review_text": "A very small and enjoyable game that puts you on a specific Moon Base, on this base you are aquired with one objective with many obstacles... To fix the oxygen, it took me almost a hour to figure out how to use this game the right way, and it was upmost enjoyable, I got to take a look at how it would really be like to be in a sire situation on the moon, and how to fix the problem. What I like about this game is all three things I've came up with, how utterly hilarious it can be, how challenging the game is, and the fact that NASA formed this game. The game puts in a Text - Speech system, which means, what you type turns into voice (or what your astronaut says), and when you play with a couple friends, it's hilarious, you can say different things that just make you crack up in laughter and never stop for some odd reason. I can't stress enough on how it took me 20 minutes to figure out that a tube goes into a dispencer. Type. Thing... But on topic, this game can make you look like you've just graduated from Pre-School, there are many steps to go along until you complete the one objective for oxygen... And boy does it hurt your head just completing it. The fact that NASA, USA's lead Astronaut and Aerospace Research company, made a game to give to the whole public, and the fact that they made the things that sounded like rocket science into simple topics that a 7 year old can figure out... If it understood that the pipe goes into the dispencer thingy. This game is recommended for playing with friends mostly cause it's not that much fun if you can't use the Text - Speech and make people laugh while doing it, recommended for all people :D",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, fun with friends, and a free game is always welcome as long as it is immersive and has a decent idea, the chating really is good, a pretty good game for when you are bored, but im sure when you get you will want to make sure you finish the mission",
            "review_score": "1"
        },
        {
            "review_text": "the prostitution in this game allows you to act out what you would do if you weren't afraid of being arrested, such as having sex with an STD-ridden ♥♥♥♥♥♥ with a body then shooting the body until its essential functions cease to continue, then taking the money you paid said body  sexual frustration galore  i give this game a jew out of russian oblasts  Smoke Bowling Everyday",
            "review_score": "1"
        },
        {
            "review_text": "Do you like space? Do you like astronauts? Do you like spending good quality time with four of your friends? Then you'll like nothing about this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "Its okay. Kinda glitchy. Kinda hard to control, but with a little tune up, it could turn into something amazing. Great graphics though.",
            "review_score": "1"
        },
        {
            "review_text": "yeah this game is ♥♥♥♥, if you want to play puzzels. you may as well play jigsaw! this is impossible to play on your own, forcing you to play with others. because the slow dude will not make the first mission. just WOW on how terribly this game is made, thanks to the creators for wasting precious 50 minutes on watching the slow dude wasting my time! nobs",
            "review_score": "-1"
        },
        {
            "review_text": "Fap fap fap fap fap, all you hear.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Realistic and powerful VTT adds immensely to the expierence.",
            "review_score": "1"
        },
        {
            "review_text": "Well. What is there to say about Moonbase Alpha. You land on the Lunar regolith. Dust settles, the sun is blinding against your EVA visor. In the distance the scattered structures that are Moonbase Alpha sit, awaiting you to touch it with a welding torch. Everything. Welding torch. Put a beacon down. Welding torch. Want to drive a lander? Welding torch. Your oxygen levels dwindle, but if you can just grasp a welding torch. Moonbase Alpha.",
            "review_score": "1"
        },
        {
            "review_text": "Microsoft Sam on the moon.",
            "review_score": "1"
        },
        {
            "review_text": "Great game LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "Were Whalers on the on the moon",
            "review_score": "1"
        },
        {
            "review_text": "Tried to play with my friends..i can't ♥♥♥♥ this game  [llao&lt;1600,25&gt;][llao&lt;350,20&gt;][llao&lt;300,18&gt;][llao&lt;1600,20&gt;]  [llao&lt;350,13&gt;][llao&lt;300,15&gt;][llao&lt;1200,17&gt;][llao&lt;1200,20&gt;][",
            "review_score": "-1"
        },
        {
            "review_text": "Best played with a few friends. messing around in the game and then delteing it.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, but could use a little more story.",
            "review_score": "1"
        },
        {
            "review_text": "Not enough aeiou",
            "review_score": "-1"
        },
        {
            "review_text": "ALL HAIL THE HOLY LORD JOHN MADDEN AND BEHOLD THE HOLY GOLDEN FOOTBALL THAT HE HATH BESTOWED APON US",
            "review_score": "1"
        },
        {
            "review_text": "I cant play with friends :_( ",
            "review_score": "-1"
        },
        {
            "review_text": "On a routine mission on earth's satellite, several people are trapped with no oxygen. It is up to you to fix everything in time and save the lives of who knows how many, Will you be a hero and return oxygen to the people who need it most? Or will you turn on text-to-speech and start chanting memes? Their fate is in your hands.",
            "review_score": "1"
        },
        {
            "review_text": "Two words: John Madden",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun to play but needs more work. its problum is the players, and the voice from text, if you play it, yall see.",
            "review_score": "-1"
        },
        {
            "review_text": "After reading positive reviews I downloaded then played game. Single player... meh. Its okay I guess. Multiplayer: just a bunch of idiots flagellating themselves and others with immature text to talk.   SKIP THIS",
            "review_score": "-1"
        },
        {
            "review_text": "It's free!",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome nice job guys",
            "review_score": "1"
        },
        {
            "review_text": "this game is very good but i think people dont play the game properly and mess around with text to speech (including me) so i give this game 30 out of 10 cheesecakes;) ",
            "review_score": "1"
        },
        {
            "review_text": "It is a pretty addicting game. It is definitely fun when you get a group of friends to play and you start to say idiotic stuff in chat with the robot voice. 9/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "It closes quickly!",
            "review_score": "1"
        },
        {
            "review_text": "LOTS OF FUN WITH THE VOICE CHAT BUT NEEDS MORE CONTENT PUT INTO IT LIKE YOU CAN GO BACK TO EARTH WHEN YOU FINISH THE GAME THAT WOULD BE VERY NICE  -PS MY CAPS LOCK IS STUCK",
            "review_score": "1"
        },
        {
            "review_text": "There's an upgrade in the game Cookie Clicker that makes a reference to this game:  Name: Maddening Chants  Effect: Portals are twice as efficient  Flavor Text: 'A popular verse goes like so : 'jau'hn madden jau'hn madden aeiouaeiouaeiou brbrbrbrbrbrbr''",
            "review_score": "1"
        },
        {
            "review_text": "only played it for text to spech worth it erbrbrbrbrrb",
            "review_score": "1"
        },
        {
            "review_text": "'NASA told us to drive this giant ♥♥♥♥♥ to the moon to collect rocks, and ♥♥♥♥, and then bring them back so the scientists can have sex with them.'  -Blue Astronaut",
            "review_score": "1"
        },
        {
            "review_text": "Great game, and it's Free 2 Play :D",
            "review_score": "1"
        },
        {
            "review_text": "the only reason i play this game is for the Text To Speech. it's hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "RIP MOONBASE ALPHA/JOHN MADDEN SIMULATOR! 11/10 WOULD AST MST EST CST AST MST EST CST AST MST EST CST AST MST EST CST AST MST EST CST AST MST EST CST AST MST EST CST AST MST EST",
            "review_score": "1"
        },
        {
            "review_text": "There really isn't a better game in the world. I'm serious. In no other game can you go to the moon, meet John Madden, play football (on the moon), and even talk to your friends in very sophisticated, hi-tech TTS. Seriously; play Moonbase Alpha, don't -you- want to meet John Madden?",
            "review_score": "1"
        },
        {
            "review_text": "Good game for anybody who likes John Madden and DECtalk vowels",
            "review_score": "1"
        },
        {
            "review_text": "ground control to major tom ground control to major tom take your protein pills and put your helmet on ground control to major tom commencing countdown engies on  i miss d bowie still",
            "review_score": "1"
        },
        {
            "review_text": "isn't it nice to know that your america tax money is in the right hands.",
            "review_score": "1"
        },
        {
            "review_text": "it's not ♥♥♥♥ if its on the moon  10.10 it was ok - IGN",
            "review_score": "1"
        },
        {
            "review_text": "The best in multiplayer text to speech. Try 9;9;9;9;9;9;9;9;9;9;9;9; John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden John Madden  and of course DooooooooOOOOOOOOOOOoooooooooooooooouche",
            "review_score": "1"
        },
        {
            "review_text": "Best game possible, hours of gameplay, hours of fun, thrilling storyline and lovable characters 11/10",
            "review_score": "1"
        },
        {
            "review_text": "worst game i have ever played by far never play ever please",
            "review_score": "-1"
        },
        {
            "review_text": "Scary just so stinkin scary",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly a very fun game, and the night mode is ACTUALLY SCARIER THAN 99% OF STEAM HORROR GAMES MOON CRAZIES IM NOT CRAZY IM NOT CRAZY!",
            "review_score": "1"
        },
        {
            "review_text": "Bless NASA",
            "review_score": "1"
        },
        {
            "review_text": "8/8 would john maden again",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a silly (, and loud) game to play occasionally, this game is perfect for you. Aeiou.",
            "review_score": "1"
        },
        {
            "review_text": "This game rocks!",
            "review_score": "1"
        },
        {
            "review_text": "Trolling Simulator 1.1, make suret text-to-speech is on.  Thanks US government!",
            "review_score": "1"
        },
        {
            "review_text": "i love this game. the little songs and just the voices are funny!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, seriously! it's fun on it's own way but when people spam those fricking annoying robot, squeeky, stupid and other kinds of sounds that destroy you're ears. But this is still the best Stephen Hawking talking weird, fun and good game for people that have a ♥♥♥♥♥♥ humor like me. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The A-Team theme is burned into my memory.",
            "review_score": "1"
        },
        {
            "review_text": "I have absolutely no idea what to do in this game. I play it only because the voic chat is really funny Google translate on cocaine in space 5 cocaine lines/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty realistic and fun!",
            "review_score": "1"
        },
        {
            "review_text": "I will destroy isis.",
            "review_score": "1"
        },
        {
            "review_text": "  The game? Wait, we have to do something? I thought this game was only for the chat system.",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 text to speech singing was worthy of the x-factor",
            "review_score": "1"
        },
        {
            "review_text": "(This is Microsoft Mic) (I am on the moon) (I am also Steven Hawkings) (So I am an Astronaut) (They use the *** to make oxygen) (10/10 IGN)",
            "review_score": "1"
        },
        {
            "review_text": "Revolutionary text-to-speech software simulator, 12/10.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda cool, but needs more too it. Good for a once through, but no replayability",
            "review_score": "1"
        },
        {
            "review_text": "I was greatly disapointed in the way that this game works.  Firstly I thought that it was going to be a sci fi sandbox game but it was all campaign but I can look past that and I'm sure anybody could. The thing that got me was when I started the game in freeplay I had timers to do stuff like repairs whne on the main menu it sad that freeplay had no timers. Again I can look past that even though I think timed missions are lazy.  But the thing that I absolutly HATE about this game is that everything revolves around puzzles or mazes and somtimes quick time events that give you no time to think.  For my conclusion I would avoid this game unless minigames are you thing :D",
            "review_score": "-1"
        },
        {
            "review_text": "Text to voice chat is the only reason I play it!",
            "review_score": "1"
        },
        {
            "review_text": "I give this game an aeiou/10",
            "review_score": "1"
        },
        {
            "review_text": "i had no idea how i should feel about this game.",
            "review_score": "1"
        },
        {
            "review_text": "A true test of who memes the most.",
            "review_score": "1"
        },
        {
            "review_text": "Good to fool around.",
            "review_score": "1"
        },
        {
            "review_text": "Deleted the old review.. Saw this at a friends house, its pretty ♥♥♥♥ tbh.. But its some good ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "John Madden, John Madden? JOHN MADDEN! Honestly a worthless peice of ♥♥♥♥ besides the text-to-speech 10/10 John Madden's",
            "review_score": "1"
        }
    ]
}