{
    "app_id": 390340,
    "name": "Umbrella Corps™/Biohazard Umbrella Corps™",
    "release_date": "2016-06-21",
    "developer": [
        "CAPCOM"
    ],
    "publisher": [
        "CAPCOM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Zombies",
        "Multiplayer"
    ],
    "achievements": 41,
    "positive_ratings": 633,
    "negative_ratings": 1663,
    "price": 14.99,
    "description": "Join the corps! Umbrella Corps brings a competitive experience featuring new types of strategy and technique blended with elements from the world of Resident Evil, to create a unique kind of shooter!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/390340/header.jpg?t=1550108762",
    "minimum_requirements": "OS: Windows 7 SP1 / Windows 8.1 / Windows 10 (All 64bit OS) Processor: Intel Core i3-4160 @ 3.6GHz or better Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX460 or better DirectX: Version 11 Network: Broadband Internet connection Storage: 13 GB available space Sound Card: DirectSound compatible (must support DirectX 9.0c or higher) Additional Notes: Supports Keyboard +Mouse. Genuine Xbox 360 controller recommended. Monitor: 800x600 or better.",
    "recommended_requirements": "OS: Windows 7 SP1 / Windows 8.1 / Windows 10 (All 64bit OS) Processor: Intel Core i7-4790 @ 3.20GHz or better Memory: 6 GB RAM Graphics: NVIDIA GeForce GTX760 or better DirectX: Version 11 Network: Broadband Internet connection Storage: 13 GB available space Sound Card: DirectSound compatible (must support DirectX 9.0c or higher) Additional Notes: Supports Keyboard +Mouse. Genuine Xbox 360 controller recommended. Monitor: 1280X720 or better.",
    "reviews": [
        {
            "review_text": "If everyone reports this game, im sure we can all get our money back... Just stay away from it!!",
            "review_score": "-1"
        },
        {
            "review_text": "bought the deluxe edition for this game and ended up refunding it before my 2 hrs was up. the issues i encountered are as follows:-  1. the launch was horrible for steam users...ps4 got it at midnight....the steam users had to wait till 12 pm the next day....also the game had a bug where alot of users COULD NOT get the game to launch.....(this was fixed by disabling ur antivirus...but seriously why do we need to do that for the game to function)  2. The aiming feels EXTREMELY sluggish with a mouse + keyboard...you can tell this game was designed for controllers in mind....but whats baffling was the lack of controller support. Actually i rellly felt this game was designed for a DS :/  3. Prone to random disconnects and a lack of a leave punishment. Played with a group of my friends and every once in awhile one of us would drop from a game.....also when people start to lose they tend to just leave..  4.Optimization is pretty bad....albeit i didn't have any real issues some of my friends did... (im running a gigabyte geforce 970)  5.Lack of any real graphics options....they are there but its limited.  6.Maps are to small and become cluster♥♥♥♥s way to quickly....strategy is non existent imo as u can run from 1 side to the other (especially with the brainer) in a matter of seconds. It takes away the tactical aspect of the game.  7.Finding a lobby is absolute horror ...Especially for ranked on PC....without a proper community this game will die (due to it being primarily multiplayer based....the single player is laughable)  8.Animations felt stiff and some commands felt weird to execute on the keyboard..(im looking at u detaching from cover and jumping)  9. Can't start a game without a full team...whiles this is a nice addition to prevent 2v1 imbalances it became quickly annoying as we barely got anyone in lobbies quickly....This made me wonder why they did not account for the lack of a playerbase (considering this game got almost no marketing ads) and add a AI bots. Bots wont exist for competitive (even thou u need to play ranked to gain exp to rank up and get new gear) but it could have worked for casual.  Overall i really wanted to like this game...being a huge fan of the umbrella hazmat team (gotta love HUNK) but this game was just to much of a mess for me to justify paying 45$ for...so refunded and hope Technomancer will be better .   Ps. out of my 2 hrs of gametime i probably got to ACTUALLY play for about 45 mins....the rest was me waiting in lobbies with people for it to full up so we can play.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not play. As a hardcore Resident Evil fan, I really wanted to say that I could stomach the game's awful start, and support it by supporting the developers, and hopefully they'd get the game to a better state.  I, unfortunately, cannot stomach the game for very long. Being a RE fan, I've always bought and played through each and every single game loyally. Thank god this isn't an actual RE game. The game feels like a port before the game is even put onto a console.  Pros:  -Kind of pretty, if this were 2010 -Play as some of the iconic doods from Resident evil -Some cool gun and character customization  Cons:  -Gunplay feels awful  -FORCED AIM ASSIST ON PC WITH KEYBOARD AND MOUSE (WHY THE ♥♥♥♥ IS THIS A THING)  -Trading kills is worse than when BF4 beta was a thing  -Aiming is 'sticky' The moving of crosshairs feels like turning in molasses  -Everyone in the game is a mother♥♥♥♥ing meat tank, unless you get hit in the head  -Not much emphasis on character progression, which means terrible longevity  -Very small maps. I'm not exaggerating when I say you get into combat within the first 5 seconds of getting into the game.  -Zombies are underwhelming unless your 'Zombie Jammer' gets destroyed in combat, where all zombies take 3/5ths of your health in one swipe, no matter what.  -Reiterating that gun damage is awful, entire magazines to kill people in the chest.  As a diehard RE fan, I really wanted something like a squadbased shooter like this. Some solid game ideas, but all of them poorly executed.   There's another game on steam that does everything Umbrella Corps does, but way better, and only for 10 USD. I don't think I'm allowed to promote other games in reviews, but I'm simply saying that Umbrella Corps is a weak addition to the series and that your money is better spent elsewhere.  DO NOT BUY, GO WATCH LIVESTREAMS OF IT  AWFUL___",
            "review_score": "-1"
        },
        {
            "review_text": "Ok you wanna join a game np wait about 15 min....  playing game against japanes my ping red there ping green wtf? seeing the enemy they instant lag next thing you see is a brainer in your brain ^.- thought this game to be tactical? Wait there are tactics in this game? no just get you melee weapon out lets run to the enemy thats all we need ! this game is just crap wouldnt buy it and i want my money back &gt;.&lt;!!",
            "review_score": "-1"
        },
        {
            "review_text": "Today's Review: Umbrella Corps / Biohazard Umbrella Corps  Overview: Honestly i have to admit i've understimated Capcom and i will take my hat in front of them, since they've managed to released 2 crappy unfinished products in the same year, i think not even Ubisoft or EA have come to that yet, not in the same year. Umbrella Corps is a generic fantasy of how would be a 3vs3 team deathmatch in the Resident Evil universe would be, that IF you can find anyone playing this game of course, so my recomendation for you, if you're crazy enough to actually buy this game for ANY price, is that you get ready a movie, some popcorn and a soda, then get comfty in your couch and press the button to start searching for a match, since it only have 2 modes you will think 'this guy must be ♥♥♥♥♥♥♥♥ me, that can't be that bad' ohhhhhhh yes! it is, so get a movie, put Play and enjoy the 2 hours of queue this game will give you to finish a movie before starting an online play session. Also there's a poor excuse for sp mode (pretty much like the poor excuse for SP mode in Street Fighter V) called 'The Experiment' were you will be put to the maps in MP to kill zombies, ganados, zombie dogs and some bows to collect samples or activate points or other things that never quiet fit... anywhere, i just thank Capcom they didn't called this game: 'Resident Evil: Umbrella Corps' because this is one of my favorite franchises and this... this is sad honestly, but hey it's 30 bucks and it will be on sale really really fast, here is the list of pros and cons.  Pros: (This was REALLY hard for me, like defending a serial killer in a case from a docen of murdered babies, and you're his lawyer)  *Fast Peaced action in third person while aiming in first person *Not AAA price (29.99USD price and 39.99 for the deluxe edition) *The attept of adding a SP mode that kinda work out if you just wanna kill zombies *Set within the Resident Evil world using the elements of SOME popular maps in: Code Veronica, 1 and 2, 4 and 5 (so far) *MP might be fun if you find ppl playing or you have 2 more friends  Cons: (inhales...)  *Dead on arrival, no playerbase in pc, completly dead MP *'Campaign' is 3 hours short (at best) *Either an xbox controller or the mouse is EXTREMELY bad, causing you to move or aim like if you had a 50 dpi mouse, making you to go running to the settings looking for mouse sensitivity *MP (almost) exclusive game with only 2 MODES *30 dollars price tag for a game that's unfinished, unpolished, srly lacking inspiration call-of-duty/ish clone. generic third/first fps shooter *Price tag over a game that some others do a best job by being free (such as dirty bomb) *Headshot animations on zombies take time to complete, so in most cases is best to shoot them in the body *Stuff like the heads from Resident Evil and colors for the backpack are behind a dlc *Much more PC hunger than the minimum requirements *NOT ANY FORM OF ANTI-CHEAT SYSTEM, YES IN A 2016 A AAA TITLE DEVELOPED BY CAPCOM HAVE CHEATERS RUNNING ARROUND FREE AND UNCHAINED *I will add more as i've encounter more issues with the game   Metascore: 28/100 Even worst than operation raccoon city, and we all know what a piece of turd that was.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game. I didn't give in to all the negativity surrounding its release. I pre-ordered the delux edition as soon as I could...  Well sometimes you are just dead wrong. The game is atrocious. Plenty of people have talked about a lot of problems with the game, but I'm going to talk about rediculous design flaws that never should have made it past an alpha or beta test.  - You crawl at an insanly fast speed...it may sound weird but it shouldn't be that fast, there needs to be a speed penalty.  - The cover system that you see in the cool promo videos is USELESS. NOBODY uses the cover system, because everyone runs around like coked up energizer bunnies. It's almost like they designed the cover system for a tactical shooter, but forgot everyone would just play the game like Quake. There is no advantage to being 'tactical', just run up and jam the ice pick in someones head.  - You can't bind extra mouse buttons. Have a sweet gaming mouse? Well sucks for you, because you are only going to use the left and right mouse buttons on it.  - Hitting escape in the training mode or single player challange mode doesn't pause the game. It just takes you to the menu but the game still runs behind it, and zombies WILL kill you. Really? I can't pause this game to take a ♥♥♥♥? This might sound like a minor nitpick, but if someone developes a game with these glaring issues, it really shows the lack of quality control and insultingly low amound of effort they put in.   Just a poorly designed, executed, and supported game. Oh yeah good luck finding people to play with online anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "So I played just under an hour, might not be the best of time to judge the game....  But I'm going to do so anyways, Just spare your money and walk away.  Don't do the same mistake I did.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I'd say this game deserves a score equal to the average number of players it has.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely terrible. Stay away from this game at all costs.   0/100",
            "review_score": "-1"
        },
        {
            "review_text": "There's literally no gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "  Nobody plays online, so it's completely dead. I haven't been able to play online at all. Waited in a lobby for 15 minutes and only one person came. The singleplayer mode is just generic little missions like you do in multiplayer except without PVP. Capcom really stooped low with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "(I've Just tried it out for the free-weekend)   Pros:  -The concept is cool -the models and customization is A-ok.  cons: -Poor performance (on my side). Like, i can run Fallout 4 on medium/high (around 30-60fps) while i can barely run this on the lowest setting (about 15fps). And the game is only in small areas btw. -The camera work and Ironsight are awful. -Multiplayer isn't great. And the spectator view is just a view from the top of the map. -Heath indicator is a blood on screen but its so awful you don't even know if you are on medium or low health. -a few more problems here and here.  Verdict: Don't buy it /10",
            "review_score": "-1"
        },
        {
            "review_text": "  This game is not worth for every single penny. I heard a lot of people said this game is suck. Used not to believe what they said for I am a hardcore fan of RE. Bbut after I tried this game, I am totally disappointed with Capcom. Not only they repeated the same mistake like Operation Raccoon City but also this game is a truly reap off of our hearts and money. Better start losing trust in Capcom right now. Don't even count for RE 7 neither.",
            "review_score": "-1"
        },
        {
            "review_text": "  DISCLAMIER: did recieve game from devs! FREE GAME DOESNT ALWAYS= a YES recommend.   The game is fun but the things that would make it SOOOO MUCH BETTER/ WOULD BE THE RIGHT THING CAPCOM TO DO IS make a survival/horde mode and a single/coop story mission. If they can do that and fix a couple animations and make the maps a little bit biggier it could be a great game. The concept of the game is great but it lacks a lot of things debating to others and I, is this game worth 30 bucks for what we got. i cant even tell you what is new from beta!  Pros Customize your character and guns Zombies are added Single player mode NO STORY JUST LITTLE ARCADE SIDESTYLE  controller support Spectate mode is pretty nice  Cons when joining game everyone is on mute *you have to unmute them* 3mins is to short on multi mission Fov is terrible game crashes too much Maps too smal Sound bugs Random disconnections Clunky movement and controls Lack of levels lack of game modes No gun recoil",
            "review_score": "-1"
        },
        {
            "review_text": "Such a bland game. Arenas are small and lifeless. Hardly anyone is playimg. Feels like a free 2 play game but charged full price.",
            "review_score": "-1"
        },
        {
            "review_text": "TL:DR Enjoyed some aspects but overall felt like it didnt know what it was trying to aim for. Also the worst FOV ive ever experienced in a TPS. Going to get a refund but if it still retains a playerbase i will pick it up on a sale and would reccomend you do the same too.   Pros: + Cool Concept, 'BUT ITS NOT RESIDENT EVIL' i know its not and its not called resident evil, its a third person shooter with a resident evil skin on it + Very tactical movement/aiming system which is something i want in games like Ghost Recon where you can change the level you are at in cover to shoot from a lower or higher angle, being able to manually open a door slowly and shoot through the cracks, aiming before climbing up from a ladder. Very unique and awesome ideas that should be implemented into other games like it + A lot of customisation options   Cons: - THAT FOV IS HORRIBLE. I CANT SEE ANYTHING IN FRONT OF ME, MY TEAMMATES, MY ENEMIES, ANYTHING. Unless every Umbrella op is a pirate i cant see why you would use an FOV like this. Resident Evil 5 had a bad FOV problem but this is just terrible especially with the competitive theme they are aiming for, i cant coordinate with my team if i can only see them within 50 degrees of my right eye. - Aiming is so slow. Never before have i needed to crank sensitivity to its max and still its not enough, fair enough if you want a slow paced aiming style focusing on precision but this is a fast paced competitive shooter with rounds lasting 3 minutes in tiny maps - Melee is clunky. Return of the COD Knife lunge, ive had people charge at me, sponge bullets and then teleport to me and stick an axe in my skull - Tactical coordination is ruined. You can see everyone (not just your team and your killer) literally everyone on the map after you die: HOW IS THAT COMPETITIVE.  - Small map issues meaning i spawn behind enemies and such  Neutral viewpoints - Singleplayer feels mashed in there just to appease the people without a stable online connection or the people who cry about online only games. Glorified challenge mode but  -+ Graphics arent great but the game runs smoothly and doesnt look too bad for it -+ DLC gives the players more customisation options including well known classic characters (and Jake) but is a little pricey but a cool idea. I think it wouldve been better to include those items as part of challenges or ranking up though.  Overall its a neat idea and i liked some aspects, especially the tactical elements. But they dont really work in such a fast paced game. If this game had bigger maps and a slower pace i think i would prefer it more with the opening door mechanics and climbing ladders and even opening shutter doors and aiming while you do it. The FOV is inexcusable regardless of what you were trying to achieve, ive had enemies run into me and me run into them or get killed by people by left eye shouldve seen but i need to switch shoulders to see out of that eye. The game feels like they tried to amalgomate cool original slow paced mechanics into an incredibly fast paced competitive style game and it doesnt really work for me. Ill be getting a refund until a sale happens on it if it retains a playerbase by then anyway. Until then i cannot reccomend the game personally.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not get this game. Terrible gameplay, aimming in third person and first person is pretty bad. your moving so slow when you are trying to shoot people and zombies and the targets move so much faster then people turn. Melee trumps range weapons, in that you unload on someone but as soon as you are in range for the melee hit you die in 1 hit.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like it, it seems like it could be great, but you can not play this with a mouse and keyboard! The mouse input is bound to a fake joystick... meaning you can not move on a diagonal axis. Only the vertical and horizontal. And to change inputs you need to recenter it first!",
            "review_score": "-1"
        },
        {
            "review_text": "I didnt want to give this a bad review but capcom needs to fix its ♥♥♥♥ed pc launches so for now thumbs down",
            "review_score": "-1"
        },
        {
            "review_text": "I paid £16 for this game and it currently, as of 20/08/2016 Is a god aweful PC Port. Please if any of Capcom Support read this please do a patch to fix the following: Audio bugs and compatibility, Controller support (that works), and Exclusive fullscreen (not borderless windowed). I hope this review seems fair, and just. As I expected this to be AAA quality from a game studio like Capcom. Don't get this game if you expect it to be of quality and to have players online, because it doesn't work properly and no-one plays it.",
            "review_score": "-1"
        },
        {
            "review_text": "If I become a parent and see my children playing this game, I'll put them up for adoption...",
            "review_score": "-1"
        },
        {
            "review_text": "Bastart of Resident Evil and Counter Strike.",
            "review_score": "-1"
        },
        {
            "review_text": "  Regardless of what the RE Loyalists or the CS Trolls say, the game is merely average. It's not the next best thing nor is it the bane of human existence, as many would have you believe. It's merely 'okay'. As it stands it feels like an unpolished alpha that has promise to be a much better game than what it is. The animations feel unfinished, the hit-detection is all over the place and the matchmaking is awful. But it's still hardly the worst game on steam. It would benefit from a few more months of development and perhaps a free-to-play model. One thing i can say for certain is that it isn't worth the money, at the very least it should be $15 but even then i feel that's too much considering CSGO has more content. Despite all this, there's something about the fast-paced third-person multiplayer gameplay that feels greatly satisfying. I can't quite put my finger on it. Perhaps it's because it's uncommon amidst so many similar first person offerings.   PROS",
            "review_score": "1"
        },
        {
            "review_text": "Franchise killing simulator 2016",
            "review_score": "-1"
        },
        {
            "review_text": "1# ♥♥♥♥ modes 2# ♥♥♥♥♥♥ guns 3# ♥♥♥♥♥♥ gameplay 4# ♥♥♥♥♥♥ controls 5# ♥♥♥♥♥♥ everything (the long rant about it being ♥♥♥♥) if u ever wanted to let capcom take a Shet on your chest this is a good way to let them 40$ later Ohhhh yeah CapCommm~ i have to be honest i thought maybe it would be fun 'wrong u Were fckboi' is what i kept whispering to myself as i played after that 7 hour delay on late night Preload and i have to say this game is ♥♥♥♥ing Trash like 9 weapons not counting side arms but they are useless anyway in lessu want nothing but jammer kills headshot ? u say lol dont make me laugh your better off using the brainer which mind u lags like a ♥♥♥♥♥ as u go naruto lvls of speed across a map then get shot by some ♥♥♥♥♥♥♥ that some how is lvl 45 already its liek wdf? it just came out it has not even been long enough to reach that lvl? then all i see from high lvls red skull+warthog like who asshat idea was it to make the Scrubhog the most overpowered piece of Wdfism ever into a game where u lvl for ♥♥♥♥ in less u hack or mod or boost? or whatever u can do to get lvl 45 in less then 1 hour of drop im not sure but i do know im not the best nor the worse i just found this game Boring lacking in content and overall a cash cow hey 40$ not a big deal right? wrong for 40$ u could get 4 or 2 games that have great gameplay this game was good on paper but ORC did it better was funner and overall was nicer looking thsi game was dark and edgy but that doenst help when u CANT EVEN LOOK WITHOUT SEEING YOUR SHOULDER THE WHILE ♥♥♥♥ING TIME like honestly i dont hate RE in general i liked RE rev2 it was sweet ♥♥♥♥ RE4 u betcha ORC sweet RE 5 fun alot of quick time events but fun i guess RE 6 meh a bit much for Shot em up but i had fun for the most part but god did this game really ♥♥♥♥ up honestly im not sure if i should buy RE7 after that gameplay cuz tbh that ♥♥♥♥ was trash no it was HOT Garbage 4/10 Capcom do u guys have a trained monkey point at a board for game ideas? or what",
            "review_score": "-1"
        },
        {
            "review_text": "Even people hate me for this review but Im liking this game as MultiPlayer is fun and really addicting",
            "review_score": "1"
        },
        {
            "review_text": "10/10 made me physically sick",
            "review_score": "1"
        },
        {
            "review_text": "Fun FPS set in the RE universe.  Solid gameplay. Nice mix of game mode types.  ",
            "review_score": "1"
        },
        {
            "review_text": "The main thing I like about this game that no 'RESIDENT EVIL' anywhere in the title.",
            "review_score": "1"
        },
        {
            "review_text": "This is my last review of this game. I took down previous reviews because they were mostly written out of anger towards many of the (at times baseless) negative reviews and forum trolls. I'll try to keep it more objective, as a traditional review should be. This will simply be my honest review of the game, from the viewpoint of a long time tactical shooter fan, NOT a Resident Evil fan.  Umbrella Corps is a thinking person's shooter (think SOCOM, not CoD); you win by outsmarting your enemy, not by skill alone. There are two main gametypes; One Life Match, which is essentially single-elimination deathmatch, and Multi-Mission. Multi-Mission allows you to respawn and plays first team to win 3 rounds of constantly changing objectives (ie. Round 1 is simple TDM, Round 2 you have to find a special zombie and kill it before the other team, Round 3 etc. etc.) At first you might get away with simply running all over the map looking for kills, but the more you play the more you come to appreciate the freedom with which you have to approach your objective. Many of the walls and buildings can be scaled by the player with the use of your climbing gear, adding another level of verticality to all of the maps that ensures no two rounds play out exactly the same, even on the relatively small maps. Rather than take the staircase you know the enemy is watching, simply scale the banister and come up behind them. Rather than swing open the door that you know the enemy is waiting behind, you can fluidly open it while rifle-checking at the same time. When climbing ladders, you can make a quick sweep with your weapon before finishing the climb. The game even comes with a wheel of customizable pre-made strats to set up with your team at the beginning of each match (though whether or not your team actually follows the strategy is another story :P).  There's a fairly decent amount of primary and secondary weapons, though later unlocks simply allow different playstyles and aren't necessarily better than the weapons everyone starts out with, keeping it balanced. There is a relatively robust selection of grenades, from normal frags to smokes for advanced strategies, semtex and even grenades that disable and eventually destroy any zombie jammers in the area, leaving the enemy vulnerable to zombie attacks. Pistols are more fun to use for me in this game than in any other multiplayer third-person shooter I've played, and they are just as formiddable as any of the primary weapons in the hands of someone with good aim and quick clicking. There are NO sniper rifles; this game has a strong focus on CQB (close quarters battle) and as such the weapons featured are either PDWs (personal defense weapons, sort of like submachine guns), pistols, and shotguns. The weapons are all modeled on real world guns with (what I'm assuming are) Resident Evil universe based names. The only aspect I found lacking were the brainers. The brainer is the melee weapon every character is given that lets you run faster and get insta-kills if you can sneak up behind them, because otherwise there is a good chance you will get brainer-countered and killed. By holding right click (or right trigger) while using the brainer you can heat it up, making it impossible to be countered but completely eliminating any element of stealth by letting out a distinct powering up noise for everyone to hear and prepare for. My issue with the brainer is there are only 3 types available in the game, which is a stark contrast to the other equipment selections. They each have different characteristics, taking longer or shorter to heat up and staying heated for longer or shorter, so that may be why the selection is so small, but it would have been nice if they had added other effects as well.  The zombies roaming throughout the map actually add a tactical aspect; it isn't like Turok for the 360 where the AI was more of a nuisance than anything. You can distract the enemy team by shooting their zombie jammer and suddenly forcing them to deal with the hordes of zombies that were ignoring them before. You can grab attacking zombies and use them as a temporary shield (though they will eat you if you hold it for longer than a few seconds). They can be used as concealmeant, allowing you to blend in with the horde while your jammer is still active (for this reason, you'll find a lot of people decide it's easier to crawl everywhere so it's always good to keep your eyes both high and low), and in some gametypes they are part of the objective itself. I believe the zombie AI concept was overall executed well, if not for a lack of variety in enemy types (walkers, crawlers, dogs, birds are the 4 types you'll see in each level).   Customization was one of the biggest draws of this game to me, in all honesty. There aren't enough shooters that allow you to customize your character in my opinion, and this one gives you a good amount of options from the start. The weapon customization is also fairly deep, letting you change the paint scheme, optics, ironsights, and suppressors, and even aiming reticule of all the weapons that allow attachments. If you are like me and are a sucker for cool looking tactical ♥♥♥♥, you could probably dump a good amount of time in the customization options alone.  Now, on to the bad. This game is far from perfect. Oddly, you can't rebind certain staple FPS keys (such as CTRL) and are stuck using the spacebar to crouch/prone (though you get used to it after a while). The playerbase is nearly dead, although there is a dedicated group of around 100+ players who have created steam matchmaking groups to help find players. Even with this, it can sometimes take 30+ minutes to find one match (You may think differently, but in my opinion no one would be willing to wait that long for a maximum 12 minute match unless it was worth it). As one could expect of a game who's player base consists of a small bunch of people spread all over the world, sometimes the lag is unplayable(but not all or even most of the time). Why was this game dead on release? Well, it honestly depends on who you ask. I personally feel that if this game had be released in its own universe with zombies and special forces instead of Resident Evil's it would have done much better. Resident Evil fans and tactical shooter fans can be two completely different groups of fans. This game is a tactical shooter, dressed up as Resident Evil and marketed to Resident Evil fans; it was a recipe for disaster. However, that doesn't mean the core gameplay is bad or broken, certainly not deserving to be removed from steam. For half the price of a full-priced game, I have put more hours into this than many of the $60 multiplayer games I own (*cough* Battleborn). And I will be honest, I refunded the game when it first came out because, at the time, the lag truly was unplayable. After seeing it go through several updates, I caved and re-purchased it and have not been disappointed. They have been diligently patching it since then, and at this point most of of the game breaking bugs and issues with balance have been addressed.   tl;dr I recommend Umbrella Corps to fans of tactical shooters who want to play a game with a bit of a SOCOM-esque feel with a zombie twist. As someone who has never played or had interest a Resident Evil game, I can honestly tell you that Umbrella Corps is a different game for different people. I'm sure there are Resident Evil fans who can also enjoy a game like this, but don't buy it expecting a fully fleshed out singleplayer experience. I'm not sure how many of the negative reviews actually gave the game a chance (and how many of them were the people saying they would boycott this game from the moment it was announced, before it even came out), but I am sure that there are plenty of people who greatly enjoy this game. If it was actually broken, or bad, it would be dead and gone off steam like Breach.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game , but i dont seem to find anyone playing online its either there is something wrong with game or everyone stopped playing this game .",
            "review_score": "1"
        },
        {
            "review_text": "Definetly Reccomend if on sale somewhere. Fun little tactical shooter, quick matches. Mouse Aiming right now is iffy but it works fine on a controller. You can get used to the Mouse controls by just turning up your mouse sensitivity. Might not be perfect but it helps if you don't happen to have a controller.  Only 2 competative game modes right now, 1 life per round team elimination and an objective mode where the objective changes every round. There are zombies/plagas infected B.O.W.s on all the maps and they can kill you very quickly, especially the dogs. It adds something else to worry about other than the enemy team some times.   It's fun, looks nice enough for me and its getting free DLC. Unlike many of the negative reviews, I have had no crashing or problems of that sort at all. You may also want to take into account how much of a Capcom/RE 'fan' the reviewer is, since the more they proclaim to love RE the more they problably hate this game or Capcom in general.  If you are looking for a quick to pick up 3 v 3 tactical shooter with Resident Evil flair this is the game 4 u gamerz.",
            "review_score": "1"
        },
        {
            "review_text": "What is good game for you ?  Red Thumb didn't make this game bad  Blue Thumb didn't make this game good too.  you need to try it by yourself !!!  this game is good enough for me it make me fun make me enjoy it   but about the price if u wanna try just wait it sale i think that's worthy for you all   because of negative review make this game take a long time to play online   normal people who wanna try this game almost people they judge this game with a Review by ♥♥♥♥ gamer or reviewer",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun, its got plenty of unlocks and customization, great music. good gameplay, good interfaces and tutorials. Easy setup. Its 3v3 one life matches are heart pounding. The games graphics are about the same as revelations 2 but its mechanics are a bit closer to ORC but in a fixed third person view.  The controls take getting used to and the lack of text chat are the only cons i see to this game",
            "review_score": "1"
        },
        {
            "review_text": "Comming from a long time fan of the game (been in love with the series ever since I saw my father playing the old ps1 games when I was a little kid) I actually like this game. Sure it ain't survival horror, but Its fun, and isn't that what matters in a game? The concepts work out well, but the single player leaves much to be desired, even though I had some fun with it, can't wait to play some more of this game and see what else comes out from it",
            "review_score": "1"
        },
        {
            "review_text": "I will update this review as I play more.  I think it's pretty clear that this is an action focused game set in the RE universe and NOT a 'resident evil game'. If you go into this expecting any sort of survival horror, that's your mistake and you shouldn't bash the game for your inability to read.  NOTE: Do not buy if you don't have a controller, as mouse movement is currently garbage.  Pros: - Responsive controls (minus mouse movement) - Nice graphics for the most part - Good number of weapon options - Large number of character customization options, including patches, colors, helmets, armor pieces, and emblems - 7 different maps, playable across all gamemodes - Most of the maps are pretty large - Single player mode is a tad repetitive, but gets very challenging - Killing zombies is satisfying and responsive - Maps are faithful recreations of classic RE locations - A wealth of settings - Can host private games with friends, with no minimum number of players req. to start - Multi-mission keeps things from getting stale - 3v3 allows for teams to work together easier, given their smaller size  Cons: - Mouse movement is horrendus - No co-op or bot support, which is bad for a game that won't have a large player base - Map from RE5 visually looks quite dull in comparison to the other maps - I have not played it yet, but I've heard that the online mode is buggy for some, although this is something that could be fixed in the future. - Music has that generic CoD Mountain Dew ad dubstep music (can luckily be turned off) - Public matches appear to be Peer-to-peer? Someone in the match is always the host, and connection can be laggy if their internet sucks - Player base dying rapidly. I recommend getting some friends together or meeting people in the forums  Overall, if you like arcade-y team based shooters and like the more action side of Resident Evil, you'll probably like this game. I still find it less annoying than RE6. It's important to remember that this is a clearly low budget spin-off game, and in no way any indication of the future of the series. Also, it's max price $30 so don't expect the amount of content you'd find in a $60 game. I'd still say wait until the bugs get ironed out if you plan on playing online.  Time to get crucified for not hating this game lol",
            "review_score": "1"
        },
        {
            "review_text": "Pro 1.the game looks great  2.the game is fun for what it is  3.it's got some throw backs to it  4.it's got a single player so you can get use to the game befor going online  5.it's got zombies :)  6.the online can be really fun when not playing with noobs  Cons  1.the camera is way to zoomed in and i do mean way to zoomed in  2.the game does feel like it a free to play game  3.it can feel like a bit much is going on in a match at times  4.no hored mode or anything like it which i don't get  5.the game feels a little undone because of a lack of game modes  6.30$  over all if you can get pass the 30$ it a ok game that is fun to play i'd say buy it on sell to save some money",
            "review_score": "1"
        },
        {
            "review_text": "Refreshing and great gameplay, runs smooth, well optimized, fast action, a lot of tactics - that was unexpected :) Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome single player is good too. would like to play multi but have not been able to. Graphics are nice too. recommend getting if u like zombie shooters",
            "review_score": "1"
        },
        {
            "review_text": "Do you like teleporting? You are in luck! It is not a glitch or lag when it comes to killing someone. Just run close to people and press melee button. Even tough u got full smg clip in your skull, no worries! You take zero damage and crush your foes. Graphics are great! I use gtx960 and game runs 30-45fps with lowest settings. So what are you waiting for? This is your chance to spend 30€ to become most patient gamer in the world since it takes 2h to find someone to play with.",
            "review_score": "1"
        },
        {
            "review_text": "honestly, the games just ok. pretty decent filler for re 7. like re 3 to code veronica",
            "review_score": "1"
        },
        {
            "review_text": "  Online is dead. Don't waste your money",
            "review_score": "-1"
        }
    ]
}