{
    "app_id": 390680,
    "name": "Spacejacked",
    "release_date": "2016-02-26",
    "developer": [
        "Rotten Mage"
    ],
    "publisher": [
        "Rotten Mage"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Aliens"
    ],
    "achievements": 25,
    "positive_ratings": 40,
    "negative_ratings": 1,
    "price": 6.99,
    "description": "A super fast-paced ARCADE TOWER-DEFENSE. Build turrets and shoot your way through hordes of alien scum as you protect multiple rooms simultaneously!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/390680/header.jpg?t=1524753195",
    "minimum_requirements": "OS: Windows 7 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Spacejacked is the most fun I've had in awhile. It's easy to pick up and insanely hard to put down. Awesome gameplay, fluid controls, quirky humor, and an addictive soundtrack packed into 3 different game modes for hours and hours of fun !",
            "review_score": "1"
        },
        {
            "review_text": "Spackjacked is a turret-building tower defense game with the simpliciity of games like Super Crate Box. I wish there were more towers and upgrades that changed more than damage and firerate, but I still have to recommend this game because it's a good bit of casual tower defense fun.",
            "review_score": "1"
        },
        {
            "review_text": "    An absolutely fantastic game    It reminds me a lot of Super Crate Box with tower defense mechanics. You are in control of a space dude with a blaster. The blaster has a recharge, it can only shoot for so long before going to a real slow semi-auto function. To aid you in destroying the intruding monsters on your ship, you have access to metal which can be used to construct defenses. What are you protecting? A core that controls your ship....when it's gone....you are gone. There is three rooms to defend and if one core goes they all go.  Defenses come in three flavors.    Stasis   This does damage while slowing your enemies. It is quite useful when it comes to aliens who move at a sprint or to just slow a crowd. It's the only defense that hits more than one target.    Laser   One shot, loads of damage. Due to it's cost and slow rate of fire I typically steer clear.    Turret   Shoots bullets at a high speed, least amount of damage. It has the long range however.  These defenses can only be placed in predefined areas. They are platforms that can be found on the floor or ceiling. Each of the three rooms have different layouts. Range is something to consider when placing these defenses. They can also be upgraded twice. Expensive, but nice to have. If you decide you don't want a defense, you can easily sell it for a refund.  I am currently stuck on the last day of act 1 and have only perfected one challenge. I'm only three hours in and only have one achievement...this game is pretty content full considering the premise.  I will say however the difficulty is astronomical. I didn't realize I had it on hard till the last day, but even on easy I am having troubles.   The price....eh, I honestly wouldn't pay 9.99 USD for this....I'd wait for a sale before purchasing.    I received the game for free...this did not hinder my opinion...my review section of my profile will prove that I have given games I have gotten for free with negative reviews  ",
            "review_score": "1"
        }
    ]
}