{
    "app_id": 390880,
    "name": "Redemption: Eternal Quest",
    "release_date": "2015-08-28",
    "developer": [
        "SimProse Studios"
    ],
    "publisher": [
        "SimProse Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 42,
    "negative_ratings": 39,
    "price": 1.59,
    "description": "Redemption: Eternal Quest is a casual RPG/Sim game which combines the feel of an RPG with roster management sim mechanics. You become the leader of a band of adventurers, guiding them through quests, watching them grow and signing them to pacts while keeping your gold pouch filled.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/390880/header.jpg?t=1495746753",
    "minimum_requirements": "OS: Windows XP or higher (Windows 7 requires system fonts be set to 100% - 96 DPI - to work properly) Processor: Pentium Celeron class or higher Memory: 1 GB RAM Graphics: 1GB Video Card or higher Storage: 60 MB available space Sound Card: Recommended for music or sound Additional Notes: 1366x768 resolution or higher (higher res will run in window)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Shallow and boring. You just pick from a list of samey characters with different stats that don't really affect much. You send them on quests on a little map thingy with a couple options then it tells you what happened. Even the most challenging options are easily doable on starting chars. There is no inventory or equipment management, all the loot you find with the special names are just fluff for the number of gold pieces you get - which there really isn't a use for other than training and hiring guys, but I don't see the point of that given the starting guys don't seem to have a problem taking on the most challenging places. The most complex thing that happened was a random event where a character got pissy with me and left because he was upset, which was apparently because I kept sending them against challenging places (despite them winning and coming back with great loot every time) and another guy got 'injured' which simply meant he was off the team for a little while. I bought it from a Groupees bundle, where it had the following description:  'Redemption: Eternal Quest is a unique and challenging RPG/Sim where you manage a group of adventurers, guiding them through thrilling quests and collecting treasure and relics. The difference with this game is you step into the role of managing these warriors, healing them, schooling them, making key decisions and watching them grow into legendary heroes.  It combines roster/resource management with RPG sensibilities, with a completely random world generated every game and even every turn! Explore Ruins, Dungeons, open treasure chests, fulfill Grand Quests, and engage in combat with a unique card-based system. Use the Prestige from your discoveries to drive your party to even greater heights. '  That description sounds like an awesome, in depth game. Nowhere did it say anything about it being a soulless casual game with absolutely no depth and no gameplay to be had. Kudos for them saying it was casual on Steam, but they sure tricked me with their previous description. In the future if I buy from groupees I'm just going to cheap out and pay $1 and give more if any of the games are worth a dime.   If you like shallow, casual, mindless games this might be just what you're looking for - but otherwise get yourself a double cheeseburger from McDonald's, it's cheaper and it'll last you longer.  -edit- 10/15/15: Apparently my issue with the game being too easy for starting chars to storm through the toughest events has been somewhat addressed by making the starting characters get injured more.   Also, I was wrong to base my review on the description that Groupees had and the dev called me out on that, so I went and found where Groupees got their description. The game's Greenlight page, written by the developer. Not sure why he's upset over me basing the game on a copy paste of what he or his team wrote, but I am sorry I bought a game and expected it to be like it was described on the page I bought it from. I should have looked up the longer description on Greenlight... and been even more disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "The interface needs a bit more polishing, and i was pretty confused at the initial team set up, I think a tutorial would be more friendly. Took me a while to really figure out what was going on, then i started enjoying the game, it's quite casual, and the backgound music really compliment the game a lot. For like only three bucks i couldn't give it a thumb down.",
            "review_score": "1"
        },
        {
            "review_text": "Quickie Review (w/updates and edits below):  OOTP for Dungeons.  Ok, maybe not AS deep as OOTP. But it utizes a similar concept, focusing more on strategy and team-building then on actual action itself. It's got the amount of depth one should reasonably expect from a $4 game, though. It is NOT as deep as OOTP by any means.  Manage your team of adventurers and send them on quests. Earn gold, level up, rinse, repeat.   Deal with injuries, contracts, recruiting, scouting, etc.  Definitley worth under $5.  Edited to Add:  Would like to be able to have more input over the 'Pact' negotiations. This seems a little too random. Especially when I have a guy, grinning from ear-to-ear with happiness, that suddenly states he is unhappy and voids the extra years on his pact, yet is still very happy on the roster management screen. This is slightly inconsistent, imho. This is one area that does seem to need a little work. Aside from that, still enjoying my time playing through.  Edited for Clarification",
            "review_score": "1"
        },
        {
            "review_text": "Excellent value party management game. Great fun, as long as you're the sort who can overlook a few flaws and use imagination to flesh out the minimalist story telling.   + Writen text always concise. + Occaisonally funny. + Nice relaxing change to more complex strategy games. + Sometimes the written text in the adventure journal is well written and evocative.  - Doesn't yet run in full screen mode! - Interface lacks a bit of polish in parts. - Sometimes adventure journal writing doesnt make much sense, and reads like it was written by a robot that doesn't have english as its first language.",
            "review_score": "1"
        },
        {
            "review_text": "I AM GLAD I GOT THIS GAME IT'S REFRESHING.BUT NEEDS FEMALES TO I MEAN BALANCE IS A GREAT THING YOU KNOW.WHAT ABOUT BEING ABLE TO MANAGE THE PARTY'S GEAR,THE CARDS ARE COOL BUT I WISH YOU COULD WATCH PARTY FIGHT.MORE STUFF TO DO BESIDES QUESTS AND HIRING.THIS IS A WONDERFUL GAME.I LIKE IT I 'M GLAD I GOT IT.BUT IT BE NICE TO SEE WERE AND WHAT THEY IMPROVE ON IT.I LOVE TEXT BASE GAMES.I 'M NOT REALLY SURE WHAT YOU'D LABEL THIS GAME AS.PRETTY O.G. IF YOU ASK ME.IT ALL DEPENDS ON YOUR TASTES.WELL,I JUST GOT IT SO GONNA GO PLAY IT SOMEMORE. 8/10. SO FAR FAR AWYWAYS.",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive in the one more turn varity. Very much like the quests in Space Ranger (1 or 2)? Combat is auto resolved for most missions, the only input you have is choosing (or not choosing) cards for certain battles. Healing characters with potions is uber expensive, as is resurrecting dead characters. Great game to play while watching football or baseball.",
            "review_score": "1"
        }
    ]
}