{
    "app_id": 390920,
    "name": "Army of Pixels",
    "release_date": "2015-10-29",
    "developer": [
        "Gergely Zsolnay",
        "Richard Markos"
    ],
    "publisher": [
        "Gergely Zsolnay",
        "Richard Markos"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 16,
    "positive_ratings": 38,
    "negative_ratings": 7,
    "price": 3.99,
    "description": "Pixel strategy that combines real-time and turn-based gameplay. 17 factions from vampire queens to mechanical golems.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/390920/header.jpg?t=1482079627",
    "minimum_requirements": "OS: Windows 7 Memory: 2 GB RAM DirectX: Version 9.0 Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows 7 Memory: 2 GB RAM DirectX: Version 9.0 Storage: 100 MB available space",
    "reviews": [
        {
            "review_text": "An extremely fun take on a Plants vs. Zombies style row-shooter. More fast-paced, kenetic and lighter in content than PvZ, but still fun. Can't miss for the price. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty fun 'casual strategy', not much depth, but fun while it lasts. Definitely worth the money. Pro: - Many factions and spells (some weird ones too, like slimes and insects) - Quite unique gameplay (army placement simulator? :D ) - only 5 usd  Con: - It really needs some kind of a story or progress, all your progress is just unlocking new factions and territories - Some units are quite similar and not perfectly balanced - Pixel graphics are overused nowadays",
            "review_score": "1"
        },
        {
            "review_text": "Great, cute little game not pretending to be anything else. Now PROS and CONS:  CONS: - no into and/or story to the game - no outro either... - ...so u dont know what your armies ;) are fighting for etc. - saving in the game would be ok I guess  PROS: - great fun! - little, small, cute, but also very satisfing! - great visuals (at least for pixel art lovers) - great mechanics (a bit like Plants vs Zombies, but also bit different, which is OK) - nice concepts of the ememies/own minions - you have to try, and think a bit, and try... which is good enough - only two guys made this; great job!  VERDICT:  Such a little, cute game took me about 8 hours or so. There are many huge titles of which I forget about hour or two... Recommended!  PS. If u don't like my English then why don't you .... ...!",
            "review_score": "1"
        }
    ]
}