{
    "app_id": 3910,
    "name": "Sid Meier's Civilization® III Complete",
    "release_date": "2006-10-25",
    "developer": [
        "Firaxis Games"
    ],
    "publisher": [
        "2K"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Includes level editor"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Strategy",
        "Turn-Based"
    ],
    "achievements": 0,
    "positive_ratings": 2578,
    "negative_ratings": 405,
    "price": 2.99,
    "description": "Sid Meier's Civilization III: Complete, the latest offering in the Sid Meier's Civilization III franchise, provides gaming fans with Sid Meier's Civilization III, the highly-addictive journey of discovery.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3910/header.jpg?t=1534462914",
    "minimum_requirements": "Recommended: Windows® 2000/XP (only), Pentium® II 400 MHz, 128 MB RAM, 1.7 GB Free HDD space, Windows® 2000/XP compatible video card*, Windows® 2000/XP compatible sound card*, DirectX® version 9.0b (included) or higher * Indicates device should be compatible with DirectX® version 9.0b or higher.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'I'll just play a quick round of Civ'  [16 hours later]  '...Where did the sun go?'",
            "review_score": "1"
        },
        {
            "review_text": "This game requires a MASSIVE learning curve for people who haven't played Civilization before, but for the people who are a bit more experienced, it's a fun and deep game.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would have Gandhi suprise attack me with nuclear subs again",
            "review_score": "1"
        },
        {
            "review_text": "SPOILER ALERT: If you press the 'Next Turn' button, you'll get free cocaine.  11/10 ...just one more turn...",
            "review_score": "1"
        },
        {
            "review_text": "Personal Experience: This is the first Civilization game I've ever played and before I knew it I was getting angry sitting at school thinking about how the Mayans were advancing on Moscow. I finally get home and load it up to push the attack to get flaked and then have Moscow taken.   10/10 Would buy for loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I will start this review in two seperate forms, one for interested newcomers and then the Old Guard.  I will list off the pros first before the cons of this game, Civilization 3 is a different twist of the game than you may be familar with 4 and 5. Go in understanding this switch:  -Its an old game, if you can run the actual game, there should be no real issues.  -Graphically, it's a sound experience and not many real issues, the modding community can find you bug fixes or new skins. Its pleasing regardless and you won't really be let down by this game.  -Combat is similar to Civ 4, simple dice combat where units have health bars going between 3-6, strength and defense stats play their parts and very simple to understand. There are Offensive Units, Defensive Units and Manovuer units, no exceptions and combat is based on these theorectical roles.  -31 Civs that each have 1 unique unit, unless mods are involved. Civ bonuses are general in that they have two traits which give them bonuses which are shared by others, Militaristic, Religious, Industrists, etc.  -Diplomacy is sound and reliable, techs can be traded directly as well as maps, I will faults soon  -Happiness is based per city, with simple factors involved including conscription  -Civfanatics Community and its modding community are lovely and its still alive and well, just no Workshop  The Cons:  -Civ 5 has a prediction based combat, units do no die with one attack on even matches. Not the case for this game, they fight till they die unless they are manovuer units against inf. ♥♥♥♥♥♥♥t can and will happen, don't cry.  -The AI Diplomacy is very defensive and almost always cautious, wary or spiteful towards you, no exceptions.  -Its really easy to find yourself fighting half the world because of one war, tech trading is enabled so you can find yourself backwater as they maintain amiable relations and trade those tech with one another while they fight you.   -Multiplayer is old, the members are not exactly nub-friendly, I myself was 3 years old when this game came out.  -Game doesn't work for you, you're ♥♥♥♥ed, not much anyone can do for you.  -In my opinion, the hardest Civilization I have every played, it will humble you many times over. In the end it is a Civ-game, you can't really go wrong with trying. It is the game that personally got me into Civilization and its unique-ness will likely find you some memorable gameplay. Hey and if you get the game and love it, I'd always be willing to play with you by e-mail or I might even try GameRanger. Good luck on your adventure To Stand The Test of Time  Returning Civ 3, should you get it on steam? Yes and no, while digital copies are nice, its not any different from the disk. That being said, I prefer it on Steam. I have purchased this game three times, one the authentic Civ III Gold Version, which was outstanding and I loved it. However, eventually I got a new computer and it turns out the disc was ruined. I got the game a third time over E-bay, the only source I could find which remains, this time the Complete. Features were missing and I couldn't even access them no matter what I tried, the conquest files corrupted and Play the World missing. I got a new computer, my current, running Windows 8.1, 4GB RAM and Integrated Graphics. The disc would not load the game, but viola, I found the steam version was the cheapest to begin with. Its the same game as you know, and for me everything was working well. Underneath I will discuss the major steam issues:  -For me at least, Steam Overlay does not appear to work and I wouldn't know how to fix it, it could be a personal issue, I don't know.   -There are serious issues people have with getting this dinosaur game to work on new computers. Win 7 tends to have more compatiability issues with the game than Win 8(.1). Your at risk here, but this is usually the cheapest alternative  -Modding is simple but remember, access the files through the properties tab by right-click the game in the Library Tab  -Multiplayer is not run by Steam servers, nor GameSpy Arcade, it shut down if you haven't followed the game. It is now accessible over GameRanger. I do not know how that works or even attempted to access multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "This is only the best most dynamic strategy game to date. I strive for peace but they always bring me war. Worth every second of good game play.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game. Always end up coming back to this version of Civilization. Mideval era is very slow, but the rest of the time I cannot stop clicking 'next turn.' My uncle let me first play this game when I was 12, and I've played on and off. I bought this on steam a while back and I still play when I got plenty of time to spare. Been playing for almost 9 years",
            "review_score": "1"
        },
        {
            "review_text": "Civ 3 Complete on sale for $1.24 so I buy it since I recall how great it was years ago. I am a big fan of Civ 4 &amp; Civ 5 with all the expansions. And I am delaying getting a new PC until I know the system requirements for Civ 6. Still I realize that there was a lot I missed from Civ 3: Artillery that doesn't suffer damage. The people's portraits in the city display (I liked Civ I's full figurines even better). The fashion progression for world leaders and the population. (Nineteenth Century attire looks good on everybody; I don't know why). Single figure unit graphics. And extremely good graphics for the system requirements.  And the world is massive. Civ 5, by giving every unit at least 2mp, really shrank the world.   Units simply gain more hits points on promotion; no decision on how to specialize.  Music that expresses the time frame of the turn. Civ 5's music is just as varied but seems   designed as background music. Of course it all depends on what one wants from a Civ game. But if it goes on sale again for $1.24 that's not much of a gamble.",
            "review_score": "1"
        },
        {
            "review_text": "The first ever Civilization game i ever played and its probably my favourite too, just remember that you have to eat during your long games",
            "review_score": "1"
        },
        {
            "review_text": "All Civilization games are awesome. This is my own personal favourite (i have not played 1 or 2). Each one takes something away and adds something new. I prefer this one because there are less factors you have to worry about, 4 is just missing something 'MAGIC'. I do love 5 but 3 is just slightly better (for me). If you're new to Civilization games, it may be worth you starting with 5 because I imagine peoples personal favourites are the first ones they try.  A full game of civilization (3,4, or 5) can take several days. Obviously you can save and come back to it later. You need to play this game for at least 4 hours before you can learn to like it",
            "review_score": "1"
        },
        {
            "review_text": "Steamrolled the Russians. Worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Are you looking for a Time sink?  Here you are!  This is a basic turned based Real Time Strategy game based around building a civilation from a tribal state to a modern age.  The Charm of this game really comes from your opponates, how they'll mock you, or try to threaten you to give them what they want. You can completely civil, or you can be a thorn in everyone's side, which can get to the point of the entire planet trying to destroy you.  A problem is that the mechanics can be confusing, heck it took me a solid three hours of reading to get a basic grasp on the game. but once you learn it, it's down, and it become second nature.  Another problem, if you can call it one, is that this game will burn hours of your life without your consent, seriously, you will play 4 hours stright and swear it was maybe 30 minutes.  8/10  PROS: Great RTS game play Aged nicely great freedom to choose  CONS: Quite a few things to learn to even start playing Will sink hours without you knowing it. ",
            "review_score": "1"
        },
        {
            "review_text": "I still think this game competes with the newer titles, one of the best strategy games I've ever played, although I still haven't fully figured out the combat system. ",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game steady since running it off my grandma's Windows ME operating system, and I still don't fully understand it.  10/10 would reccomend",
            "review_score": "1"
        },
        {
            "review_text": "I played several hundred hours of this game before it came to Steam. Steam wouldn't let me import the old disk copy I had so I bought it again, hence the pathetically low hour count.  That being said, this is my favorite of the Civ games. Simplistic, basic, and at the roots of all things Civ. Downright fun and addicting, there is nothing more I can say except that you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably one of the best games I ever played. The music is great, the mechanics are great, the wide range of choices ensures no game is the same, and the wealth of maps, mods and great community make this, In my opinion, the best of all Civilization games.  Great for wasting a few hours. Or a day. Or a week. Or a year.  10/10 would destroy another civ again",
            "review_score": "1"
        },
        {
            "review_text": "Very great game, considering it is from a very long time ago and is only the 3rd game in the Sid Meier's series... The graphics don't amtter, what does is the gameplay, and the AI is one of the best I have seen even comparing to 'Next Generation' games...",
            "review_score": "1"
        },
        {
            "review_text": "Prabally one of the best turn based games out there. I remember pleading to my father as a child to give up his computer for a few hours so that i could make the Roman Tanks slaughter Aztec pikemen. I must have had four to five hundred hours into that game. Now, i am 14, have my own computer, and the disk seems to not support Windows 10. I went to Humble Bundle and got this for $1.25 and it works almost perfectly. I did have a crash for a custom game, and when i finished a nine hour game at the congradulations screen it crashed, BUT it plays just fine all the rest. One of the best parts of this game is the World War 2 built in mod. It is really well done. If you have played any of the newer Civilization games and you want to see the earlier titles, go for this one. In my opinion Civ 3 is the best Civ game in the series, followed closely by Civ 4",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game probably my favorite out of the lot of them so far. This game is highly addicting and will have everyone playing for hours. It is, what I believe, to be one of the best RTS's.",
            "review_score": "1"
        },
        {
            "review_text": "Probably better than Civ V",
            "review_score": "1"
        },
        {
            "review_text": "Amazing oldschool graphics strategy game. Can sink 20 hours into it before realizing that my fingers have been numb for 15.",
            "review_score": "1"
        },
        {
            "review_text": "This phenomenal strategy game is mentally stimulating and epic, though I will admit it might not be very rewarding. Standard games usually took me days, and each of the hourse you're playing requires you be goal-oriented and considerate. Strategic resources, oceans and capturable units can be a pain, but I recommend this game to those who have a lot of free time. I suggest choosing small maps and few rivals.",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing this game a lot as a kid. I personally am not a fan of the new Civ animation. I much prefer this game because of its simplicity. Over all, this game can get very addicting. I would recommend this game to anyone who is a fan of turn-based or strategy games!",
            "review_score": "1"
        },
        {
            "review_text": "It's Civ what do you expect",
            "review_score": "1"
        },
        {
            "review_text": "Paid £0.74 for this game. Excellent. Played it years ago, good to see it on steam.",
            "review_score": "1"
        },
        {
            "review_text": "The game that won me over as my favorite PC game.  Why don't you have it yet?",
            "review_score": "1"
        },
        {
            "review_text": "I didn't give this game a fair try back in the days when it was new. The game was visually an improvement over Civ II, and the interface was actually functional. I just felt the combat system was poorly done, diplomacy didn't feel right, and the game has a few design quirks. Fast forward to now, I decided to buy the complete edition, which updates the game. What I find now is a game that truly stands between the majesty of Civ II and Civ IV. The Civ experience is there, and it's well represented. The graphics haven't aged all that well, and the interface isn't as nice as the later games, but the gameplay remains classic Civ. The complete edition adds the feature of customizing the game in ways never seen before or again in a Civ game, such as turning down (or up) AI aggression. It is a good, cheaper entry into the world of Civ.",
            "review_score": "1"
        },
        {
            "review_text": "Old school Civ. This is civ on a massive scale. It's extreamly moddable and way more unpredictable than later versions of the game. My favorite version of Civ to date.",
            "review_score": "1"
        },
        {
            "review_text": "Good game for little cash. Civ fans must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Many, many, many hours played over the years, not reflected here (I still have the original box, just picked the Steamer up today in a sale). Many, many, many crazy governments, wrecked military units, risky attacks, frantic reloads, stupid custom city names, unnecessary Wonders, swear words, sodas then beers, and wasted dating opportunities. This is the classic example of a 'WTF did the last 5 hours go?' game. Sid Meier is truly a Gaming God.",
            "review_score": "1"
        },
        {
            "review_text": "i dont even know what the ♥♥♥♥ to do",
            "review_score": "1"
        },
        {
            "review_text": "Givin this was a dollar on steam sale yesterday... 11/10 regret purchase",
            "review_score": "1"
        },
        {
            "review_text": "The best strategy game ever made. This is all the reviewing that is needed. 100%",
            "review_score": "1"
        },
        {
            "review_text": "I have alwaysed love Civ games, but my personal favorite was this one. This is what started it for me and it is as I remember it. The controls are not like civ 4 and 5 but getting over them is easy. I do recomend playing this, and feel what civ had to offer back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "Absoultly love this game. Had the hard copy sence I was a wee' ladee. thousands of hours in and I still figure ♥♥♥♥ out that i didn't notice the last 15 times i played the game.  Very steap learning curve, but insainly rewarding  However bots can be a bit dense and very agressive, not always a bad thing, just takes away from the potential for political game play  8.5/10 for turn based fustration simulator",
            "review_score": "1"
        },
        {
            "review_text": "Civ6 made me reinstall civ3 again so yeah.",
            "review_score": "1"
        },
        {
            "review_text": "better than 5",
            "review_score": "1"
        },
        {
            "review_text": "Good classic game ..  8/10",
            "review_score": "1"
        },
        {
            "review_text": "i like this game, i got it becuase i lost the disk to civilization III",
            "review_score": "1"
        },
        {
            "review_text": "i still havent won a game, and i doubt i ever will.",
            "review_score": "1"
        },
        {
            "review_text": "Only £3... Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I started playing I died I repeated 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I definitely enjoyed it, maybe not as good as later installments, but still solid, especially if your computer can't run later versions.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first ever Civilization game I've ever played since it was cheap. I have had so much fun in the .07 hours I've played I want to play it 24/7 now because I can't stop :D Really really really great game!",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to start by saying I'm not a strategy 4X kind of guy. I'm terrible at them. This one is no exception. Additionally, I bought this a week before losing internet for an extended period of time, so my hours are waaay off.  That being said, I've been playing since 2011 when I was looking for cheap games on Steam. To my surprise, I noticed one of the five dollar games had a 90/100 on Metacritic whereas many other games had a 70/100 at best (I cared about Metacritic back then, sue me.) so I knew I just had to have it. I had no idea what I was getting into.  To this day, this one of my most cherished purchases on Steam, and by far my favorite strategy game EVER. I played Civ 5 for a bit, but despite its evergrowing modding scene, I always come back to this one. The graphics still look good to this day (Save for the civ portraits, and dated resolutions. Yuck), and the music will forever dominate space on my music player of choice.   Buy it at full price.",
            "review_score": "1"
        },
        {
            "review_text": "civ 3 is a great game because of the massive amount of things included and availale to do",
            "review_score": "1"
        },
        {
            "review_text": "If only The Crusaders were as powerful back then as they were in this game, well, they wouldn't of needed to fight so many of them.",
            "review_score": "1"
        },
        {
            "review_text": "ok for £3.00, but vastly overated.",
            "review_score": "1"
        },
        {
            "review_text": "Sid Meier's Civilization III: Complete, the latest offering in the Sid Meier's Civilization III franchise, provides gaming fans with Sid Meier's Civilization III, the highly-addictive journey of discovery, combined with the updated and enhanced multiplayer expansion pack Sid Meier's Civilization III: Play the World, as well as all of the great new civilizations, scenarios, and features from Sid Meier's Civilization III: Conquests! Sid Meier's Civilization III: Complete provides more ways to explore, more strategies to employ, more modes of play, and more ways to win, all in one box!",
            "review_score": "1"
        },
        {
            "review_text": "Many an hour has been lost to the Great Meier - he who Compels. Submit!",
            "review_score": "1"
        },
        {
            "review_text": "Stack troops, 15 minutes later combat ends.",
            "review_score": "1"
        },
        {
            "review_text": "I was playing as the Japanese. I was doing quite swell in my game, but I lost the whole game after the Byzantines declared war on me because there army captured one of my cities. To my comlete suprise, I was eliminated from the game due to something I forgot to change in the victory conditions menu; I forgot that I had the elimination setting set to if I lost 1 city, I would lose the game. I even forgot that the elimination setting was on in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "World Domination Simulator 2014",
            "review_score": "1"
        },
        {
            "review_text": "Civ 3 has kinda been forgotten now with Civ 4 and Civ 5 out, but it remains my favourite. Whilst I can't think of anything in particualar that it did better (other than the attack/defense of troops instead of some weird strength system that makes no sense and a clear hit point bar showing you how much health your troops have left) the overall feel of this game (and it's soundtrack!) make for the most fun out of the 3 games (3, 4 and 5) that I have played. Civ 3 was the first game of the series I played and so there may be a lot of bias based on nostalgic value here, but I still highly reccomend this game to any strategy fan.",
            "review_score": "1"
        },
        {
            "review_text": "Best Civ ever imho. Not without drawbacks, but with some real nice big mods (RIse and Rule, Worldwide) it's just shines. Civ V may surpase it sometimesm but only after a couple of addons and some big mods.",
            "review_score": "1"
        },
        {
            "review_text": "Play it once and you'll never go back.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game before and love it so i decided to buy it on Steam but it keeps crashing when trying to start a new game. I am using Windows 8.1 and tried compatibilty settings but it still crashes. I would avoid buying it for now as it keeps crashing and you'll only be wasting your money. It is a shame as it is a great time.  EDIT: It seems to work if you let all the intro videos play without skipping them as i can now start a game.",
            "review_score": "1"
        },
        {
            "review_text": "Are you looking for a Time sink?  Here you are!  This is a basic turned based Real Time Strategy game based around building a civilation from a tribal state to a modern age.  The Charm of this game really comes from your opponates, how they'll mock you, or try to threaten you to give them what they want. You can completely civil, or you can be a thorn in everyone's side, which can get to the point of the entire planet trying to destroy you.  A problem is that the mechanics can be confusing, heck it took me a solid three hours of reading to get a basic grasp on the game. but once you learn it, it's down, and it become second nature.  Another problem, if you can call it one, is that this game will burn hours of your life without your consent, seriously, you will play 4 hours stright and swear it was maybe 30 minutes.  8/10  PROS: Great RTS game play Aged nicely great freedom to choose  CONS: Quite a few things to learn to even start playing Will sink hours without you knowing it.",
            "review_score": "1"
        },
        {
            "review_text": "Even after all the years this is still a must have in the gaming library. I have a few freind that still email moves back and forth. The email functionality is great for dirstant firends. We even played it while overseas with the Army.  I have tried the new Civ games but this one just seems to be the right mix of gameplay, decent graphics, and a well balanced skill ladder.   Come on...it is only 10 bucks...",
            "review_score": "1"
        },
        {
            "review_text": "After my worktime, I start playing the game.  One turn, one more turn, one more turn...... The sun is up.",
            "review_score": "1"
        },
        {
            "review_text": "If you can get past the old-school graphics, this is one of the best entries in the Civilization series. Especially if you mod it because it also happens to be one of the easiest-to-mod games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best strategy game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the newer versions. Civ IV and Civ V are still the easiest and best versions to play, but if you don't have a lot of money to spend, or have never played before this version is still fun to play to learn how the game works. However, once you play the newer versions, you may not want to come back to this version.",
            "review_score": "1"
        },
        {
            "review_text": "While playing thiss game as a child, I learned more than my history classes ever taught me.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game   Hours of fun   Go on buy it you wont regret it :)",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and well balanced",
            "review_score": "1"
        },
        {
            "review_text": "Great deal at 5 bucks!",
            "review_score": "1"
        },
        {
            "review_text": "It's addicting I have to say. I may not be able to get to the industrial age, but I still love it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game still has a lot of playabilty and a great selection of mods to change it up",
            "review_score": "1"
        },
        {
            "review_text": "Its an older game but it still absolutely holds up.",
            "review_score": "1"
        },
        {
            "review_text": "Great series!",
            "review_score": "1"
        },
        {
            "review_text": "It has been around for a while which is showing but nonetheless it is one of the finest turnbased strategy games i know. This turn based strategy takes you on a tour through history and lets you decide how things turn out in historic scenarios or in fictional worlds against other players and AI controlled opponents. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "GET IT FOR MAC PRO",
            "review_score": "1"
        },
        {
            "review_text": "love the civ series, 3 and 4 being my favs. this game is more challenging than 5 and the units are fun, culture; etc.",
            "review_score": "1"
        },
        {
            "review_text": "Good way to waste five hours at a time... gets you hooked once you understand. Small learning curve if you want to win, but a noob can have a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my god, I can't count the number of hours I've spent playing Civ III. This was the first game to add the culture mechanic and borders to the franchise. I still miss it. But I know that if I were to install it (or either of the two subsequent games in the franchise), I'd probably starve to death before I quit.",
            "review_score": "1"
        },
        {
            "review_text": "The best of the franchise. I started playing the original shortly after it came out, it blew my mind. CIV2 made minor enhancements, but was largely the same game. The first time I played CIV3, I hated it. The strategies I had developed for 1&amp;2 no longer worked (the catapult is quite different, for example) and it took me a few minutes to grok the culture concept. Once I did (and learned the unit differences), I never went back. The AI is sooo much better than before and unlike CIV4 (which despite buying and forcing myself to play, I never enjoyed), you still get to micromanage a great deal (but you can also automate quite a bit - the ability to choose is awesome). Buy it on sale if new to the franchise &amp; start with a tiny world. If you are used to another CIV game, don't wait for a sale, buy it now &amp; get to know the differences in the tech tree as well as the unit differences - I bet you'll like it!",
            "review_score": "1"
        },
        {
            "review_text": "Best Turn-based Strategy game ever.  A few hours worth of learning curve for casual players, but once you're in, Kiss your social life and sleep goodbye.",
            "review_score": "1"
        },
        {
            "review_text": "For a game made all the way back in October 2001, this is a fantastic game.  First off, if you bought Civilization Revolution for the Xbox 360 or iPad, that is nothing compared to this old but fantastic game. Secondly, make sure you play this when you havn't got anything else to do in the next 24 hours because this game takes some time and patients and you are guranteed to get 100% addicted. However, if you want to go online, nobody will be on there and if you host a server nobody will join (unless, of course, one of your friends have the game and you invite them). Also, on your first game you ever play, make sure you make it so it's on the easiest difficulty and do a little amount of Civilizations otherwise you will get brutally battered like a Cod fish.  10 features Civilization 3 has that Civilization Revolution Doesn't  1. You can alter the map size between Tiny and Huge. 2. You can alter the settings on how to win the game. 3. The Middle Age is included. 4. You get workers to build Outposts, Mines, Barricades, Irrigation (farm/food resources) etc. 5. There is more research. 6. More units. 7. Create your own map in the editor. 8. Edit the map properties. 9. More Civilizations. 10. More Civilizations allowed to be active in game.  Keep in mind that Civilization Revolution is newer than Civilization 3. I can't really think of anything you can't do in Civilization 3 that you can in Civilization Revolution. I cannot compare Civilization 3 to Civilization 2, 4 and 5 as I do not have those and I have never played them. I would assume that Civilization 4 and 5 are better though. I completely reccomend this game and I'd say it is still a brilliant game now in 2014 and that takes a lot for a game to be that good!  Hope this makes you want to buy Civilization 3 because it deserves more buyers. This game is also very handy if you have have a bad Graphics Card and Processor like my computer. When it says it runs on Windows XP only it really means Windows XP or better. Happy Gaming!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games. It has really good turn based strategy.",
            "review_score": "1"
        },
        {
            "review_text": "7.4/10  +Long turn based strategy gameplay +Plenty of descision making +Multiplayer (don't know if it still works) -Graphics (If you don't like the graphics get civ iv) ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, a little bit clumsy but still rly time consuming and interesting.",
            "review_score": "1"
        },
        {
            "review_text": "simply the real best ever civilization, there isn't a good (and useless) 3D graphics, but it has the best gameplay of entire series, for hardcore gamers",
            "review_score": "1"
        },
        {
            "review_text": "A perfect oldschool game, which contains alot of fun, strategic thinking and decision making. The game is totally awesome and really worth the money. The CIV's after this one are all better quality but will never beat the game itself in a whole!",
            "review_score": "1"
        },
        {
            "review_text": "got nuked by the chinese 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the very best games I have ever played. I have a long history with the civilization series and I have to say, this,in my opinion, is the Best. PLAY THIS GAME!!! It is only $5.00 right now on steam, so get it NOW!",
            "review_score": "1"
        },
        {
            "review_text": "You haven't played Civilization until you've tried the third. I recommend this to everyone because it is a classic and is also extremely fun at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that got me into the series.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game, all around fun. possibly 700+ hours of my life wasted on this game off and on steam. ",
            "review_score": "1"
        },
        {
            "review_text": "A classic game. It's not really worth it to play today because Civlization V. I can't get use to it yet, but if it's nostalgia you're looking for or some time to kill to mess around, then I'd recommend it. Besides fun is jackin' around in a game, isn't it?",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite of the Civilization franchise because of its pace. Unlike IV and V it is easy to raise large armies and lots of cities. You don't advance through the ages so quickly, so you don't miss out on early age fun and your armies don't become prematurely obsolete. The best part of Civ3 though is the historical scenarios, which the latter Civilization games haven't done nearly as well, they alone merit replaying this game many times.",
            "review_score": "1"
        },
        {
            "review_text": "Just Civilization...",
            "review_score": "1"
        },
        {
            "review_text": "After my worktime, I start playing the game.  One turn, one more turn, one more turn...... The sun is up.",
            "review_score": "1"
        },
        {
            "review_text": "This was my first Civilization game, and it's still gotta be my favorite. It lacks the religion aspect, but it's just so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Classic. Whenever I get bored with other games this is always my go to. Civ 3 will have to be my favorite so far in all of the Civilization games that I have played so far.",
            "review_score": "1"
        },
        {
            "review_text": "Great Turn based strategy game, Quick pace of building your civilization up and moving through the tech tree!",
            "review_score": "1"
        },
        {
            "review_text": "Even after all the years this is still a must have in the gaming library. I have a few freind that still email moves back and forth. The email functionality is great for dirstant firends. We even played it while overseas with the Army.  I have tried the new Civ games but this one just seems to be the right mix of gameplay, decent graphics, and a well balanced skill ladder.   Come on...it is only 10 bucks...",
            "review_score": "1"
        },
        {
            "review_text": "I believe in the power of civilization delights.",
            "review_score": "1"
        },
        {
            "review_text": "I believe in the power of civilization delights.",
            "review_score": "1"
        },
        {
            "review_text": "I still play this game in 2016. It is on my list of perfect games.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best game of all time. Brings back awesome memories and it's still as good as it was back in the day. The soundtrack is beatiful and the gameplay is awesome. BUY THIS! 420/10",
            "review_score": "1"
        },
        {
            "review_text": "eyy, it's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Cranked the complexitity to 11 from Civ 2",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, had it back in the day when it 1st released! Prefer it still to play that beyond earth lol",
            "review_score": "1"
        },
        {
            "review_text": "bought this 'childhood memory' in steam summer sale, HK$9.75 !!!!!! love it so much and every single click is full of my childhood memory You could play this for a whole day!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "best game love it",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I loved this game when it was the original copy and so to get the complete edition on steam with nothing changed was something i loved. i would throughly recommend this for anyone who loves the franchise or is looking for a good TBS game. Despite the graphics I would still say that this is the best civilisation game that exists at the minute",
            "review_score": "1"
        },
        {
            "review_text": "This game is a damn drug. When I start a game I binge play it for hours not stopping just somthing about it makes you not be able to stop, for each turn you take decides the future of your civilization. I found my self starting a game some time in the evening and be still playing at 4am. I highly recomend this game. ",
            "review_score": "1"
        },
        {
            "review_text": "A classic in its genre. It's worth your money, even if it's not on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The exactly definition of 'old but gold' . the unbeatable nostalgic game. sure have strange things in that cause its old, but the difficult is exactly good. the only bad thing about it is that the AI gain more money than possible as the difficult increase. I think that was the only way to make it's work in that time. the price now really compensate u buy it, really worth the try !!! just to you know here in steam i have minutes played, but I bought it about 15 years ago, probably I have more than 500 hours played.",
            "review_score": "1"
        },
        {
            "review_text": "Another turn bites the dust! and another turn gone and another turn gone, another one bites the dust! Oh, its gonna waste your life too another turn bites the dust!",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best Civilization game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Best Civilization game ever.",
            "review_score": "1"
        },
        {
            "review_text": "- Picked Ragnar - Killed some barbarians - Thought I had the greatest army in the world - The Aztecas disagreed - My whole population died - My whole kingdom ruined - My college grades are now ruined  10/10 would attack South American people",
            "review_score": "1"
        },
        {
            "review_text": "did not work on my computer, i had windows 8 when i bought it, you might say that windows 10 might run it but i am not rebuying the game again because i dont want steam to get suspisious.",
            "review_score": "-1"
        },
        {
            "review_text": "Advisor tells me golden age has ended...can't continue to play...crashes everytime after this message...well...",
            "review_score": "-1"
        },
        {
            "review_text": "Neat until you try combat. Ive had spearman drive away my tanks.",
            "review_score": "-1"
        },
        {
            "review_text": "Civ 3 is a classic, turn-based, strategy game that pretty much set the standard for this sort of game. Time has passed, and there are newer games that you can play (including newer Civilization games), but for those who played this one: it still holds a place in their hearts.  For those who have never played this one, you can probably skip this edition. Not only are there many things that feel dated, but the newer Civ games refine this formula in almost every way, making this one obsolete.  --- No score ---",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased this game in order to understand and have an enlightenment on the essential game mechanics of the Civilization game series. I am still not sure whether Civilization III was the right choice.  Here are a few topics that I wish to highlight: - It is a low-paced, turn-based strategy game with a significant amount of historical content. - There are a few variables in the game that the person should learn before starting to play. Luckily, steam provides us with a manual, so DO read it. - For beginners, this game may become tough, even at the lowest difficulty setting. Even after learning the basics, there are many things one can do wrong. - This game can take MANY hours of your time, and once your civilization has more than 10 settlements, it may take more than a minute to play each game turn. In addition, there may be dozens and dozens of turns before a victory condition is met. - Although it DOES seem to work on my Windows 8.1 machine, there are a few frustrating issues, such as window switching not restoring the original resolution until the game is terminated. Also, the game may occasionally crash on some particular user, and so far it has always crashed after the end of a game. This means that the game could have had a better preparation for modern systems.  Therefore, it is both hard to recommend and unrecommend this game. Take this as a midline evaluation. If you have time to spare, go ahead and give it a try. Or who knows, the other games in the series might be more interesting.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont see a reason to buy this",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a bad game, and I can see why some people find it charming, but to me it's an awkward transitional phase between Civilization II and Civilization IV. I would recommend playing those games instead, and seeing which one you like better.",
            "review_score": "-1"
        },
        {
            "review_text": "i found it pretty meh, i enjoy the total war series infinitly better.",
            "review_score": "-1"
        },
        {
            "review_text": "Compared to civ V this game is a joke. I say that cause the game does not play easy.",
            "review_score": "-1"
        },
        {
            "review_text": "Confusing. Hard to learn.",
            "review_score": "-1"
        },
        {
            "review_text": "Its A Rip Off!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is complex, which makes it cool BUT the game gets difficult (even on the difficulty above easy) because all the civs gang up on you and then you lose and they tell you to go back to chieftan (easiest difficulty). Well for $5 it gives you the civilization experience and is a good time waster if you have spare time. Dont bother with this go for civ 5",
            "review_score": "-1"
        },
        {
            "review_text": "Can't get the game working on windows 10.",
            "review_score": "-1"
        }
    ]
}