{
    "app_id": 391160,
    "name": "The Deletion",
    "release_date": "2015-07-30",
    "developer": [
        "Russpuppy"
    ],
    "publisher": [
        "Russpuppy"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 145,
    "negative_ratings": 41,
    "price": 1.59,
    "description": "Are you sure you want do delete this file? NOOOOO! The Deletion is a challenging and fun puzzle-platform game that will frustrate you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391160/header.jpg?t=1519875601",
    "minimum_requirements": "OS: Windows 7+ Processor: 2 GHz dual core Memory: 2 GB RAM Graphics: Hardware Accelerated Graphics with dedicated memory",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The Deletion is an excellent Indie platformer where you need to use your brain and patience to bypass the levels.  I will start with the pros then finishing with the cons:  Pros: This is a very good game that can be extremely addictive due to its endless puzzles! Crisp and smooth graphics with no lag. Fun extensive gameplay. Simple, smooth controls. It's worth the buck!  Cons: The music sounds like its from a cheap flashgame off the internet. I think that they should try and enhance the quality as it put me off at first. Start screen is a bit chunky. No achievements - This would be great to add as players love to try and achieve something.  All in all, The Deletion is a magnificent game. I'm just VERY picky about this selection of things, haha. I encourage you all to buy it as it is worth the price and I'm sure there are more future updates planned ahead.  ~Absent~ ",
            "review_score": "1"
        },
        {
            "review_text": "A small fun puzzle platformer that's well worth the price.   Protip: Don't get frustrated and you'll do fine",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Really amazing game, and it's cheap! I think it's worth more than 2 euro :) 10/10 poinst from me :)",
            "review_score": "1"
        },
        {
            "review_text": "The thumbnail is probably the worst part of this game.  A great little platformer with some interesting, unique mechanics.  Fun to tear through on a rainy day. So worth the price, check this game out.  ",
            "review_score": "1"
        },
        {
            "review_text": "Frustration is right, but not in the good way. With game mechanics that were not well thought out, and controls and physics thatare awkward and liable to kill you, this game is definitely not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very, meh to me, on one hand the level design and mechanics are very good, but on the other hand there's no replay value, theres 40 levels in all and no extra modes, and that's the problem, the entire 40 levels take 1 hour to beat (at least for me) and nothing that makes you want to come back, as it stands now, the game has potential, but is just not worth the money, the developers are clearly still updating the game (the update for mac in april) so please developers, make the game replayable, and here's how to do it (in the form of free dlc)  +some amount of extra levels +1 gameplay mechanic +level editor +time trial (giving the player a reason to play the game again)  Also please ignore the fact that the first paragraph was one giant sentance.",
            "review_score": "-1"
        }
    ]
}