{
    "app_id": 391100,
    "name": "Frizzy",
    "release_date": "2015-12-23",
    "developer": [
        "Team Frizz"
    ],
    "publisher": [
        "Team Frizz"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 12,
    "positive_ratings": 10,
    "negative_ratings": 5,
    "price": 1.99,
    "description": "Frizzy is a platformer filled with awesome action. The main plot is that you are a frizzy ball of fur who can latch onto static balls launch himself around the levels.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391100/header.jpg?t=1450899609",
    "minimum_requirements": "OS: Windows XP Processor: 3 Ghz CPU Memory: 1 GB RAM Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "5.9/10 - Simple Platformer with Some Surprisingly Unique Gameplay.   This game is definitely influenced by the Nintendo Age; classic Mario coin collecting with a twist. This time you are collecting hearts throughout the map; once you collect enough you can move advance levels. (Not the twist)  The overall 'story' and main objective of collecting a ton of hearts doesn't really do it for me, but it's by no means a bad game. It's just more of a cute and extremely casual platformer. The graphics are fun and remind me of the Nintendo 64!  The gameplay really made me give this a positive review; as a little ball of fur you have to launch yourself via static electricity to greater heights in order to collect all of the required hearts. It really reminds me of portal but instead of going through the portals you are catapulted by them. I personally would have loved to focus on this element and puzzle objectives as opposed to monotonous collection of hearts.   It's worth $1-3; I wouldn't pay full price... but I don't like platformers.     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually one of the best games ever, I believe that it is the HEIGHT of gaming, a true example of perfection. Alas, no words can describe the amounts of joy, sadness and hatred felt in my under 1 hour of playing this TRUE example of perfection at a divine level. I dont know how these developers created such a fantastic game when supplies were dwindling after the great war of Vladmir Stalin in this era. I simply do not know how to rate this masterpiece, but I can try to explain on laymans terms with a simple 'r8 frizz/rizz m8' ",
            "review_score": "1"
        }
    ]
}