{
    "app_id": 39110,
    "name": "SEASON OF MYSTERY: The Cherry Blossom Murders",
    "release_date": "2010-02-03",
    "developer": [
        "SQUARE ENIX"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object",
        "Adventure"
    ],
    "achievements": 15,
    "positive_ratings": 156,
    "negative_ratings": 44,
    "price": 2.99,
    "description": "Your husband Richard lies dead beneath the cherry blossoms of Old Japan, and the police are of no help. Step into history and uncover the truth when no one else will. Find devilishly hidden clues, explore exotic locales, and bring the killer to justice!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/39110/header.jpg?t=1479332567",
    "minimum_requirements": "OS: Windows Vista/XP/7Processor: 800 MhzMemory: 512 MBGraphics: On-BoardDirectX&reg;: 8.1Hard Drive: 186 MBSound: DirectX 8.1 Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's a fun murder mystery, point-and-click puzzle game. I've always liked word searches and hidden object puzzles and this is just one big, beautifully illustrated hidden object puzzle; with some other types of puzzles as well. Plus you have the story of trying to solve your husband's murder even though the police ruled it suicide. I'm not so sure the 'Stirring, Japanese-themed soundtrack ' is an accurate portrayal because it doesn't really make me think Japanese but it's still pretty nice music. I've been enjoying the game quite a bit since buying it last night so of course I recommend it. I even just uploaded a gameplay video to Youtube because I know that sometimes before making a purchase, I want to either demo the game (as I did for this one last year) or see a video of it and I'm sure others do, too.",
            "review_score": "1"
        },
        {
            "review_text": "I really love these kinds of games and this one combines so many that I love. You look for objects that are hidden in a range of difficulty at every location. There's also a variety of puzzle mini games that are also very clever. It's story isn't bad either, it makes for a great mystery. I suggest also trying to play it with friends, it can become a fun bonding activity/race to see who can find what. It's also an awsome feeling while refusing to use the hint button to finally find that object that you could swaer didn't load in. Plus then you can blame then for taking so long to find it! ;3",
            "review_score": "1"
        },
        {
            "review_text": "Season of Mystery: The Cherry Blossom Murders is a find the hidden object game where you solve the murder of your spouse in 20th century Japan. The music is competent but repetitive and the artwork stills are quite attractive. The gameplay itself is challenging because the objects can be especially well hidden on each game field. Fortunately the matches are not timed and a rechargeable hint allows you to find those sneaky objects that defy being located. The cutscenes and storyline are rather blah, especially considering the much more interesting cutscenes in The Otherside by Namco Games. That said however, Season of Mystery: The Cherry Blossom Murders offers a fun diversion for the casual gamer who likes to take their time with challenges.",
            "review_score": "1"
        },
        {
            "review_text": "Hidden object game based on compulsive hoarding. Great practice for later in life. Now where did I put them car keys??",
            "review_score": "1"
        },
        {
            "review_text": "Really good HOG the story keeps you going and some of the things you have to find can sometimes be down right impossible to see but give it time and try not to use the hints and itll pop up.  Good story, nice art hard to find objects you cant go wrong. Also square pulled through with some nice tunes they never seem to get repetitive even if there is only a few of them.  9/10  ",
            "review_score": "1"
        },
        {
            "review_text": "This is a good hidden object game. Probably the best one I have ever played, but solely because of the storyline. However, the gameplay is monotonous and in some levels you have to find the same things over again. I'd recommend it if you were looking to play a hidden object game, but would not readily recommend it if you weren't.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fairly decent point and click/hidden object game IF you have a sense of humor and don't take it seriously.   I mainly play these types of games because they're a little bit...well, stupid [in a good way]. This specific one is no exception and had me laughing really hard through the whole game because of how nonsensical the plot is. For example, the first thing that happens in the game is a couple cops rule a man's death a suicide and then leave the body on the floor of the widow's home. All the so-called 'clues' are...just really contrived. It's not a realistic scenario by any stretch of the imagination...but the game is super enjoyable.  Do not expect this game to be something it isn't, but don't sell it short either. As a veteran point-and-clicker, I breezed through this game, but it's a fun time-waster for casual gamers and is easy to complete in 2.5 hours to get the achievement. I beat it nearly 3 times so I could get the 'find 1000 items' achievement and didn't feel annoyed at all, it wasn't tedious and you can click-through/skip dialogue, etc [so also be careful when you're clicking because you might accidentally skip dialogue you wanted to read].  I don't know if it's worth the $5 Steam is asking because of the short completion time, but if you can catch it during a sale and you like this type of game, pick it up for sure!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good hidden object game. Probably the best one I have ever played, but solely because of the storyline. However, the gameplay is monotonous and in some levels you have to find the same things over again. I'd recommend it if you were looking to play a hidden object game, but would not readily recommend it if you weren't.",
            "review_score": "1"
        },
        {
            "review_text": "Solve the same puzzles OVER AND OVER again in attempts to progress the plot!! Seriously, there are only a few locations amd you have to solve the same puzzles each time you revisit a location. After going to a location for the 4th time and finding the same objects, I realized that I really didn't give a ♥♥♥♥ about my murdered husband and stopped playing because I was sick of finding the same stupid things and solving the same pizzle over and over again.  Buy this game for your grandma with alzheimers. She'll appreciate it.   I was hoping for better from SQUARE ENIX.  I have played much better hidden object games. I bought it on sale and still feel ripped off.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased the Cherry Blossom Murders an the first puzzel was to find a Pocket Watch. There isn't a Pocket Watch in the puzzel. I surched for over a hour for it and clicked on everything! What a waste of money!!! ",
            "review_score": "-1"
        }
    ]
}