{
    "app_id": 39120,
    "name": "RIFT",
    "release_date": "2011-03-01",
    "developer": [
        "Trion Worlds"
    ],
    "publisher": [
        "Trion Worlds"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "MMO",
        "Co-op",
        "Online Co-op",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "MMORPG",
        "Massively Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 6885,
    "negative_ratings": 2326,
    "price": 0.0,
    "description": "Dive into a world of epic adventure! Create your perfect hero thanks to a uniquely customizable class system. Collect, craft, and customize your gear. Go it alone or group up to challenge dungeons, raids, dynamic open-world content, and your fellow players.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/39120/header.jpg?t=1554231172",
    "minimum_requirements": "OS: Windows XP, Vista or 7 Processor: Dual Core 2.0 GHz or better Memory: 2 GB Graphics: Nvidia GeForce FX 5900, ATI/AMD Radeon X300, Intel GMA X4500 or better. DirectX®: 9.0c, June 2010 update Hard Drive: 15.0 GB available  Sound: DirectX 8.1 compliant card Other: Broadband internet connection (DSL, cable modem or other high speed connection)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've been shaking off the urge to write a review for the F2P MMORPG, Rift, for about a week now, purely because I wanted to write one that did it justice. I'm a little under 200 hours into this game at the time of this review, but despite that, I've barely scatched the surface.   I'll start negative. Rift isn't original, I mean sure, the Rift aspect is, but other than that it's pretty much filled with the same content you'd expect from an MMO. Quests that are uncreative, grinding to level and lots of walking, for the most part. So at this point you might be asking yourself why would you play Rift?  Well, in short, Rift does what other MMOs do, but better. The only exception to this, in my view is the spell effects in game are lacking, they feel a little washed out, but everything else, from killing monsters to presentation is absolutely crisp, responsive and highly polished. The scenery is gorgeous, you'll often find yourself stopping to take screenshots and admire the landscape, and even the monsters. Every area has a totally unique atmosphere and feel to it, each crawling with unique monsters waiting to rip your face off. This brings me to difficulty. Rift isn't easy, at least not compared to other MMOs. The monsters and combat are a lot less forgiving, death comes with a penalty and continous deaths with permantly penalize your stats until you visit a healer. This is a good point though, it makes the grinding aspect of the game more enjoyable, because your attention is focused solely on the game in nail biting moments. Look away for even a few seconds and you could come back to find your body laying on the floor surrounded by dragons.   Rift features a huge amount of content. The map is huge, there are several islands to travel, hundreds and hundreds of quests and a huge range of monsters to be killed by. Raids, Chronicles, Rifts, Hunt Rifts, Bounty Hunting, Warfronts, Instant Adventures, Dungeons and so on. To give a perspect on the amount of content, I list eight game types, in just one, for example Dungeons, there is about 40 dungeons in Rift ranging across across levels from 1 - 60. Once you hit 60, it isn't over. You can prestiege and the game introduces a second XP bar for planer attunement, which unlocks new abilities and skills.   I was lucky enough to be invited to a guild on my first day of playing Rift, and I've stuck with it ever since. Joining a guild, working together to do guild quests and form raids/events is where I have the best fun, as I think a lot of people do also. You're able to completely customize your guild to represent and battle others, all the while earning points that contribute to the leveling tree in the guild. This too unlocks perks such as bonus xp, better loot drops, faster health regeneration, teleporting to guild members and so on.   For those of you who may be collectors, don't worry, Rift has a HUGE amount of collectibles in-game, named 'artifacts'. Artifacts are found around the map, either by exploring or by looting monsters and/or chests. Rift encourages exploration, if you can see it, chances are you can go there. You'll be searching for these hidden artifacts for hours and hours, and when you finally do get the complete set for a particular catagory, you get rewards. Rift always rewards you for your work, and it rewards well.   Professions in Rift are quite in-depth, there's enough to keep you digging away for hours, looking for the materials and crafting the items you need to level. The leveling doesn't take too long, there is 375 levels per skill, currently I've managed to achieve this in Fishing, which took about 30 hours or so, just to give a perspective. There is two types of professions; gathering and crafting, both of which tie into one another. You'll be given useful hints and tips as you progress, suggesting which receipes do craft and for what reasons. There is currently about ten professions, give or take, which include: Minning, Butchering, Fishing, Survival, Outfitting, Foraging, Armoursmithing, Weaponsmiths and so on. All the reciepes and materials you craft can either be used, traded or sold either to NPCs are stores or on the player economy driven Auction House.  This game is ENTIRELY free to play, from level 1 to collecting every item, every piece of armour and maxing every skill. There is no restrictions and no cut out content. There is a store, you're able to purchase some items through real money. This is more of a boost, the items can be obtained in-game and no real world purchases are neccesary or required in any way. Spending credits earns loyalty points, which the more you spend, the more you earn. These unlocks are only available via the loyalty system, but can still be obtained absolutely free. There is an in-game item called 'Rex', which you can purchase with game currency, then exchange it for both credits to spend in the store, as well as loyalty points to earn items. This means you can obtain everything in Rift, absolutely free.   As far as MMOs go, this one is one of the best. It's free, it's filled with content and it's crisp in every aspect. I highly recommend you give this a go, it's a little slow to start off, but you'll find yourself hooked and playing daily, enjoying every second of it.   9.5/10 - A fantastic MMO that achieves everything it sets out to do in a high quality fashion.  -0.5 for the lacking spell visuals, it's minor, but noticable.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: My views haven't changed, but I've rewritten the second half to give some clarity to some common complaints I've heard about this review.   How about some balance?",
            "review_score": "-1"
        },
        {
            "review_text": "  If you are new I wouldn't play this game. There are way to many microtransactions. If you are worried about the grind, don't worry. The game literally doesn't start until you are lvl 65. Everything before that is pretty much a tutorial.  Is the game Pay2Win? Yes. 2 Earring slots have to be paid for with real life money to be unlocked. It used to cost voidstone (One of the myriad of in game currencies) they took that away so they could take cash from their dwindling player base.  Other features. They sell tier 2 gear on the market. People argue that this isn't p2w since T3 has to be earned. The time it takes to earn T2 is a tedious task. As I mentioned there are numerous currencies and notoriety you have to earn with also a bunch of different factions to even buy or use items. The grind for that is tedious, time consuming.   Now that isn't bad, grinding and earning gear. That's what mmo's are about right? Except you spend weeks grinding out currencies because there are caps to upgrade ONE piece of gear. Here is a feel for how many pieces of gear that you can all separately upgrade. Helmet, cape, shoulder, chest, glove, legs, boots, 2 earrings, Neck, Trinket, 2 rings, Synergy Crystal, Seal, Planar Focus and 6 planar essences, two one handed/1 two handed and 1 offhand weapon. All of these require multiple upgrades, cost a VAST amount of in game currencies that is almost impossible to earn unless you have a credit card readily available. And the ongoing insult if cannot perform is “You’re a casual”. Which in itself is dumb. I understand mmo’s require time to get ahead. Yet in this game playing 20 hours a week isn’t enough. You will be left behind in the dust. 40 hours, you better be grinding the whole time. But I suppose non-casuals have played since launch, have been around long enough they already have all the p2w features that Trion has now implemented in their need for greed. So they don’t get the short hand of the stick. PVP … that sums it up honestly. Skill? Non-existent. The maps are neat, the queue times are fast and the idea sounds awesome. Pre-65 pvp doesn’t happen unless you like waiting around for hours for one to pop. The game is heavily, and I mean heavily gear dependent. Forget going into pvp thinking you have a chance. You will just be called a casual because you didn’t swipe your credit card before entering. Since pvp gear caps at about T2 you can buy T2 gear meaning you are good to go for pvp. A fully geared player vs some fresh 65’s could 1 v 5 and not drop below 90% That players skill could be average while the other 5 could be the best players on rift but now are in noob gear. Gear literally makes or breaks everything. Conquest. Don’t bother max gear people just get in premades and walk all over pugs who attempt it. Open world pvp turns into a one sided match. Credit card vs non-credit card. Other factors are people who spent a lot of money on game get awesome boosts like fast mount time, faster mount speed through patron which plays into pvp when someone can cc you and run away and you will never catch up to them. (Very annoying and boring when you actually are winning a fight against team credit card).  So if I had to list pro’s and cons. Pros:  - Pve is fun, boss fights are fun. - Wardrobe is really sweet. All armor collected becomes unlocked as skins for free. - Traveling around isn’t very expensive using the teleporters. - Teaming as you level up isn’t bad. Can queue instant adventures, dungeons, and just join adventures who make their party public to share quest mobs. Cons: - Pay2Win: Buying Earrings. - Gear grind defines your skill.  - Pvp is not fun unless you have gear. Give a toddler a remote detonator for a 50 megaton nuke, and an Adult who is in the Navy Seals a hammer and a one mile gap between that toddler. That defines pvp. The most skilled can get stomped on by those with better gear. Hammer vs Nuke. Who wins? *sigh* - Hard to earn currencies, high currency requirements for upgrades, and weekly caps keep you from doing upgrades for weeks on end for one of your 25-26 pieces of gear.  - Cash Grabs, Cash shops. Taking away from players each update to create a paywall that forces you to buy patron.  - Getting a piece of gear and realizing you need Planewalker: Water. Apparently this zone was free which you can go there for free but you can’t even equip half the gear. It also drops in pvp and in dungeons and usually has nice stats for fresh 65’s.  - Game gets buggy, really laggy as well. I had some weird glyphdebugger come up that forced me to reinstall. I have had a few other friends and family also run into this where they couldn’t even play the game for the entire day. Sucks when you actually pay for patron and can’t even use it. Miss out on daily log in rewards and minion quests that you are trying to collect.  Indifferent: - I don’t mind that there is a cash shop. Selling new souls. (Another powerset tree for your class) That’s fine. They worked hard to create that, it’s an addition to the classes and as long as they aren’t some god mode autowin tree I am fine with it. Charging for some school girl outfit, or a katana is also fine. That is cosmetic. A mount, who cares? Other various features like that, that do not make one stronger or better is fine with me. In the end. I don’t mind a company trying to make money. That’s what businesses are designed to do, if it works, sell it. Yet a business is also supposed to try to support its customers, and Trion doesn’t do that. They seem to want to walk all over their player base and then milk them for more money while making them grind for months on end for gear. So if you want to quit your job, stop going to school, leave your kids at the orphanage and become a recluse then this game is for you. Or you can use your credit card daily if you don’t have the time. Either way it’s a cash sink or a time grab. Game is fun, but with all of this…it isn’t. ",
            "review_score": "-1"
        },
        {
            "review_text": "The ultimate pay to win game of all pay to win games. You can buy EVERYTHING for real money. Buying it for anything else takes a long ♥♥♥ time. You can buy boosts for everything: experience, money, currency collecting, artifact collecting, crafting experience, mounting speed, mount summoning speed...   Getting from 1-60 takes about a few weeks, and getting from 60-65 takes just as long (if not longer). Unless you buy and use those experience boosts (max time of 2 hrs).  Once you finally hit level 65, you find there's NOTHING you can do. You can't do raids, cuz you don't have enough gear. You can't do expert dungeons, cuz you don't have enough gear. The only things you can do are nightmare rifts and events, which net you a certain type of currency.   Currencies",
            "review_score": "-1"
        },
        {
            "review_text": "Meh. Its worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome MMO, but it is not for everyone. I personally feel this is the best MMO out right now and it is TRULY 100% free-to-play.",
            "review_score": "1"
        },
        {
            "review_text": "Lets list a few things you can/have to buy...  1. Earring slots (p2w) 2. Items that max you out in a crafting possesion (like 300 lvls) instantly for 10$ 3. 10$ in gems per extra bag slot. 4. 10+$ in gems for a second vault. 5. PATRION! BUY PATRION OR ELSE! 6. over 200$ in microdlc and microtransactions. 7. 354.00$ in DLC 8. Expensive dlc is a must to stay current in armor and stats. 9. 70% of dungons and raids are locked behind pay walls. 10. DLC shoved in face every login. 11. Terrible community 12. P2W people everywhere (the exent of this is someone who spend over 100$ buying armor, the char and weps. He wipe out all of sactum including the king by himself.) 13. Locked OVERPOWERED classes behind a pay wall. The strongest class with the high dps and armor is behind a pay wall. YOu need to spend alot for the 12+ classes locked behind a pay wall.  Of course Ill still play it even though f2p players are essentially the east side of germany during the cold war com[pared to the west side (p2w patrion players).",
            "review_score": "-1"
        },
        {
            "review_text": "This game is dieing because of the devs, they are killing the game by bring out unfinished updates and being ♥♥♥♥♥♥♥s to the community. There is a lack of players due to this now, when I started playing rift 2 years ago there was 3 times as many players that I would come accross on my adventure but now there aren't too many. This leads to a not very fun experiance and long dungeon ques if you aren't 50+ for SLE que and 65 for normals. I would not recomend spending your time in this game if you have a 9 to 5 job as there are many more games which you will find more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is basically World of Warcraft with debatably cooler graphics and some tricks (like world events) layered on top. And no panda bears that I've seen yet. I'm very impressed that it's free to play. I've only played ~6 hours, but for the first 20 levels (at least) there is plenty for a solo player to do.  If you like that style of third person, triggered-action style controls, there is no reason NOT to play Rift.  As a criticism, the UI isn't especially intuitive, and it takes a bit of work to figure out how to do things like craft or gather resources, or why things are happening. The lore doesn't seem particularly polished.  Still, I'm having fun running around with a buddy, doing fetch quests, and gearing up. Give it a shot! Nothing to lose but time.",
            "review_score": "1"
        },
        {
            "review_text": "Don't waste your precious money for Starfall Prophecy DLC. It's not worth the price. There are a lot of great games to be worth spending on or just save it. Don't be a victim of Hype.",
            "review_score": "-1"
        },
        {
            "review_text": "Although many MMO's have come out after the rise of WoW and it's slow descent, this one stands out of the crowd.I have tried MANY other MMO's, but not live up to this one in comparison. Although Rift is F2P, do not be mistaken. It is not pay to win. IS a large game, so I cannot cover it all, but I will cover a good portion.   Pros: Introduces rifts, something unique to this MMO.has a very special talent/skill tree system that varies greatly and can be used many different ways and still be effective.  Cons:Races aren't extremely different=Poor Machinima abilities.Being inside cities on anything but low or minimum graphics will kill your average computer.  Don't get me wrong, I love Rift but it isn't my favorite all time MMO, my favorite is what WoW used to be but Rift is the best MMO around currently.",
            "review_score": "1"
        },
        {
            "review_text": "So I was recommended this game by a friend. Character creation is pretty limited, but the classes/races/sides option sounded pretty cool. I started the game, got maybe 10 minutes into it, was killing mobs, leveling up and all of a sudden I get randomly banned out of ♥♥♥♥ing nowhere. All I was doing was killing mobs in the starting area, then when I click the link for ban appeal, it takes me to the login screen, well when I try to login to ban appeal, it responds 'The account you're trying to login has been banned' How the ♥♥♥♥ am I supposed to appeal a ♥♥♥♥♥♥♥♥ out of the blue no reason ban if I can't login? So I had to make up a random email so I could appeal the ban and the little brats never responded. I honestly want money back even though I didn't spend a penny on it. You people can downvote this review and think what you want but it doesn't change the fact that this company is ♥♥♥♥. ♥♥♥♥ you, and rot in hell Glyph, ♥♥♥♥ing ♥♥♥♥♥♥s",
            "review_score": "-1"
        },
        {
            "review_text": "Still my go to mmorpg. I still play this daily. Almost Instant Action!. I can get into a PVP match, Dungeon Group, or Instant Adventure almost instantly at max level. Still a pretty good sized crowd to group with thanks to being able to group with players from all servers. It's not the same as it was a few years back, but what mmorpg is. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Best free MMO so far",
            "review_score": "1"
        },
        {
            "review_text": "A really good polished game ......  you have a Big world to explore ............  pve is great doing pve with friends is really fun and sometimes you cant do quests alone so you are gonna play with some friends and thats really good..   pvp is not the best no the worst either it keeps being better and they are working on it....  anyway its a good game dont miss this one.......",
            "review_score": "1"
        },
        {
            "review_text": "To those who are wondering if to play or not to play: From the F2P perspective.  This game was great before but all things must come to an end at some point, I still play it though (because I bought with in game currency everything I needed before it went credits only (especially earring slots, planewalker water)) but new players will be hit with microtransactions left and right. The game has great graphics, good pve casual gameplay and a good comunity. Once you get into PVP or raiding things change, as stated above, to raid you need your earing slots and planewalker water so you can equip 2 earrings and certain armor that can only be used with the planewalker water attunement which will allow you to do more damage, tank, heal or support assuming you know your role. They also rush new content way too fast without thoroughly analizing its flaws and players end up exploiting raids until the devs fix them so now 'the point of the game is not beating the boss but beating the dev who's actually really really bad at his job' Oria Xu. PVP on the other hand, well.....Since NT launched, trino (trion) decided to hand it over to pve'ers. 'PVP' gear is a tier and a half below PVE raid gear and in warfronts and there is no more pvp gear proggression like in the past during Storm Legion. it is now either burst or be bursted, I'm a decent player and I sometimes enjoy it but most of the time it's for the marks to get gear from the store. And if you're a F2P player, there is no choosing specific warfronts or dungeons anymore which means completing the PVP quest guns for hire (win 4 codex, win 3 black gardens for example and each week they vary) will be very hard, first you have to random queue and hope you get one of those warfronts and then you have to hope your team doesn't get slaughtered by enemy team.   There is a new expansion coming up later on (RIFT 4.0) which is supposed to be better but we'll see, I'm going to keep playing the game since I'm hoping those hundreds and hundreds of comments on forums reach trino and turn this game around. If you're still interested, go ahead and try it but play it casually because the game is out of balance at the moment. Primalist calling is broken and way overpowered, Warriors have only 2 usable souls for DPS without the option of hybrid builds, Rogues are fun with many options to builds but there's so many on the game, Mages at end content are very hard as a first option, and clerics are great but also a little hard at end content.   Overall, RIFT is a great game but the childish devs made a very bad move this expansion. Oria xu has a detailed video as well on his youtube channel which I highly reccomend watching and by the way mentioning oria's video in game could get you banned. (if you watch the video you will know why)",
            "review_score": "-1"
        },
        {
            "review_text": "It was really innovative at headstart. With so many Skills and combinations you could go for. Now that there is the possibility to go for everything with every class (Tank, Healer, DD) i feel like it's nothing special anymore to choose between classes. And i think there are better MMORPGs out there that got a fresher look to it. I always got the feeling that the game is a bit clunky, that it's not that fluent, like i felt for example by playing WoW or Guildwars.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game. Alot more diversity with each clase having multiply roles and specs and each of those able to break down to a variety of different situations. Almost like a DAoC with a WoW quest system. Already made a level 60 charater in less then a month and working on my second.",
            "review_score": "1"
        },
        {
            "review_text": "  It's a reasonably good game. It has a story line you can get into and nice combat mechanics. You can happily play on your own or in a group and complete quests or fights both way as well. To me it seems to be relying on the DLC packages a bit too much, but that's just my opinion. It is a good game and should recieve recognition.",
            "review_score": "1"
        },
        {
            "review_text": "Not only is this game incredibly grind inducing, it feels incredibly reptitive even for an MMO. While I understand yes it is a free game, there are just better examples of F2P games that have done it better.",
            "review_score": "-1"
        },
        {
            "review_text": "Best free to play MMO I've ever tried.   Lots of cool features like a simple macro builder and multiple classes per charecter desent community and spectacular graphics. Some of my friends have had trouble running this game so I dont play it as much as I would liked but deffenitly recomend to any MMO fan, casual or otherwise",
            "review_score": "1"
        },
        {
            "review_text": "One of the best MMORPGs hands-down. I've mainly played this outside of Steam (hence the low playtime), but the depth and level of customization that RIFT gives you for your class is incredible, and blows WoW out of the water. Sure, other things (like the dungeon experience imo) are better in WoW, but RIFT compensates with lots of really cool smaller features that add up quickly. For example, if you outlevel a dungeon/zone, but want to go back and grab the quests, you can set your 'mentored level' down, which essentially allows you to temporarily lower your character's level at will. Player housing is also present, and you can view other player's intricate designs on persistent leaderboards based on user votes. Combat is similar to other ability based RPGs, such as WoW, with the exception on the level of freedom that you get to design your own class. You can manually choose all your abilities from a set of about 10 talent trees (called 'souls') for each class, of which you can have 3 active at once. This means that almost every class can fill almost every role (DPS, tank, support, healer), and you can save your ability sets to allow you to change between roles on the fly (eg DPS → healer), giving each character a lot of versatility. Note that as this game is now free-to-play, some souls are locked behind a paywall, although at £15 if you shop around, it isn't too bad. Moving onto the game's implementation of free-to-play, you can easily complete the game (and the expansions – which are free to access) without paying anything, with all the in-game shop stuff being optional. If you do subscribe (£8.99/month last time I looked), you get the usual XP boosts etc that you would expect from a sub to a free MMO. A nice change however is the fact that the game was originally designed to b pay-to-play, so all the quests and story etc is scaled to those at 100% XP rate – subscribing just allows you to skip out parts as you see fit (and the XP boost can be toggled off). This is a nice change from other games like SWTOR, which feels like it's the subscribers that are getting the 100%, with the free players left at about 75%. Overall, it's a solid offering from Trion, which I feel is equal to, and better than is some cases, WoW.",
            "review_score": "1"
        },
        {
            "review_text": "Very good and fun game, all in all. They have really limited the F2P options recently and I've stopped playing due to some of their decisions that feel like a last ditch cash grab to the player base. They had a great product, it has the potential to be great again but I think it's very unlikely they can recover from the recent downward spiral.",
            "review_score": "1"
        },
        {
            "review_text": "Very good free-to-play mmorpg.  While I haven't devoted as much time to RIFT as I have other mmos, it's one that I keep coming back to. In my opinion, it's the best f2p mmo on the market, and provides a lot of what I expect from a traditional EQ-style mmo.  As a casual player of this title, it seems like there is always something fun to do, and the game makes it very easy to hop into group content (the Instant Adventure feature is particularly great for this). The customizeable player housing is also a major highlight.   I'd recommend this to people who are looking for a free WoW / FFXIV alternative.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Love love love the player housing system! I definately recommend this game to anyone out there who likes to play mmorpg's",
            "review_score": "1"
        },
        {
            "review_text": "I give this game 5/10, it is cool game but requesting many real cash and 65 pvp very stupid. +Great Storyline. +Cool character creation. +Great armors and weapons. +You can make your own outlook with collection items to your wardrobe +You can swap server with your character. +Quest don't have glitch. +Cool with other friends. +Crafting jobs and collecting materials. +Skill combinations and three skill tree choose in same time. +Very big maps. +Lots of Event like in maps or adventures or dungeons. +Still updates. -Pay to Win. -65 lvl Warfronts too bad. -Clerics overpowered.'most dps and heal' -Pay to Unlock. -Pay To Win at 1st place. -Game cash very expensive. -Clerics too strong. -Harder to play in higher lvls. -Item values too much. -Auction houses very expensive. -Jobs limired for free players. -You can't put items to AH without R.E.X. -Some of classes with cash. -You can see Russians'And they don't know english.'. ;P",
            "review_score": "-1"
        },
        {
            "review_text": "its like WoW but instead of stealing my money they politely ask for it  otherwise its a good game but not my favorite of the Free to Play MMOs since GW2 joined  and steam says I got this game on December 31, 1969 10/10 pretty good for the 60s i guess",
            "review_score": "1"
        },
        {
            "review_text": "From launch through the first year of free-to-play, the game was a joy: beautiful scenery, well-executed dynamic content, and lots to do from pvp to dungeons to fun open world to chasing artifacts.  In the last year, however, it has steadily gone down hill as the publisher has squeezed the screws to harvest more money from the players and the somewhat old engine has become decidedly creaky with poor frame rate, frequent crashes, and very annoying visual bugs. The latter is probably also money related since it appears they have cut developer staff to the bone and they can't afford or choose not to invest further in the core engine.  It is free to play, so you can get a taste of it at little risk but not likely to be a long term game for anyone these days.",
            "review_score": "-1"
        },
        {
            "review_text": "I totally wanna play this game, But since there's a lvl cap, and Trion isnt increasing the lvl cap each expansion. Thats a huge bummer. No point in wasting my time. ",
            "review_score": "-1"
        },
        {
            "review_text": "Having logged 700+ hours on my old account, I installed it on this one simply to write this review. And I can safely say this is the best F2P MMORPG you will ever play. Pros: 1) Even though the combat is tab target, it manages to retain aq dynamic feel. All your skills work together in some way so finding the perfect rotation is always interesting. Combat is also incredibly smooth and is really quite enjoyable. 2) The Soul Tree system is perfect and will find a way to fit your play style effortlessly. You can even have custom classes unheard of in most any other game. A mage that doubles as a tank? If you want. A warrior with group healing? Go for it. A cleric with insane DpS? Hell yeah! 3) PvP is AMAZING. I really can't expand on this any more. Try it for yourself. There is very rarely two players using the same build as there are so many possibilities. Endless fun :D 4) The game has a solid storyline that really engages the players. You feel compelled to continue with the main quest line, although that shouldn't deter you from doing as many side quests as you wish. Quests have decent rewards, such as new equipment and a massive pile of cash.  5) Leveling up isn't a huge grind. Granted, there is some grinding to get new equipment or to get PvP gear. But unlike most, it isn't the same quest in the same area over and over again. The quests can be in different areas, and different objectives.  Cons: 1) Dungeons and monsters can get fairly tricky unless you keep on top of your equipment or have some fairly powerful friends. Join a guild for a group of regular party members. 2) You need a hell of a computer to run this game on anything over medium graphics. I currently have an Intel i5, 8 GB of RAM and a Nvidia 640 GT and I can only run it on high at 50-60 FPS. For max you will really need good components.  3) If you don't pay for subscription, it doesn't affect anything a huge amount but you have a few restrictions that are kinda irritating. i) You can't buy or sell at the auction house.  ii) Pretty small bag space. Probably most annoying. iii) It will take a LOT of grinding, however, to get a mount.  Overall, a very fun, addictive, and engaging game. Definitly one you should get. It's polished and feels like a paid game. The highest praise a free game could have.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game but its dead",
            "review_score": "-1"
        },
        {
            "review_text": "Rift carries a D&amp;D style with not so nicely aesthetic characters, tending to more realistic and practical designs, also bringing a few of the usual races of the popular TTRPG system with your classic 'lots of races that are pretty much human' like elves, dwarves, humans and similar variations. Even though that's not it's best point (if you don't like it that is), the game truly shines on what really matters for a MMORPG: Gameplay, Customization and Lore.  Gameplay-wise Rift doesn't rise above most of the titles of the genre, having at least a proper responsive point-and-click combat that feels just right. It is in Customization that this game sells it's name, mostly in Class customization, since it allows your character to freely choose 3 from 8 or 9 (maybe more) talent trees that will both decide skills and passive abilities of your character. Reseting such skills is free of real money charge, so switching builds freely will be pretty much your joy in this game, and something you will wish to have in any title you come across after playing Rift. Character-looks-customization-wise, the game simply offers an equipment look tab that allows you to equip anything you have on it, disabling the equipment stats but prioritizing its looks over the equipment in the normal tab. Simple, practical, effective: Awesome. Lore-wise this game shines probably just like WoW or D&amp;D, it's deep with all kinds of stories in loading screens, NPCs, quests, books to read through the game that can be collected, collectables with stories that become prizes and other things, the game is huge and clearly RP friendly.  If I recommend this game? This is a seriously well built MMORPG, for both a game and for a MMORPG. If you like the genre and don't necessarily want inovation but something just well done, get in just now, it's also free!",
            "review_score": "1"
        },
        {
            "review_text": "Rift,  This game is possibly one of the best MMO's i've played, the game has great graphics, runs smoothly, easy controls and great machanics.  The game is free to play, which evidently means that there are some pay to win aspects to the game but nothing major that can ruin the gameplay.  Unfortuently the game isn't as popular and only has a small playerbase but the community is great and friendly! I really like the sense of fellowship with Guilds, although the censorship of certain words like ♥♥♥♥, have recieved me being kicked from my pretty elite guild, ♥♥♥♥ you too! btw.  Due to the small playerbase, expecting to get into a PvP arena is very rare, as well as raids.  The game has amazing seasonal events, and it really brings the playerbase up and allows for new and fun challenging quests to arise that seperate it from the other quests.  TL:DR; What have you got to lose? It's FTP.",
            "review_score": "1"
        },
        {
            "review_text": "Great population , Fun to play , however leveling can be slow and boring , pretty much all it is is the odd dungeon with instant adventures for the first 30-40 levels , but worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "LOvely Game Help me keep out Stress and relax my mind making new friends and Questing :)) ",
            "review_score": "1"
        },
        {
            "review_text": "Best MMORPG game out there, though I wished it had a better in-game economy.",
            "review_score": "1"
        },
        {
            "review_text": "RIFT Deleted itself from my library as soon as I downloaded it, I redownloaded and played for 10 minutes before it did it again. 8/10 would not download 4 times",
            "review_score": "1"
        },
        {
            "review_text": "So imbalanced at lvl 60 it's comical",
            "review_score": "-1"
        },
        {
            "review_text": "Fun MMO game to get into and play with mates, PVP is fun aswell as dungeons/raids are awesome and a great implementation to the game. Tones of quests! so if you love doing quests on the based stroy line then trust me you will have a great time playing this at no worries of being bored. always people looking for groups so you are never alone in the world of rift. The rifts that you come across ingame are immaculate, by this I mean there is not a bunch of things surounding you so it's good for battle plus people with not so good computers. Rift will run on a lot of I would say mid way computers, there are ways to boost your FPS like enabling multi-core so it allows RIFT to use all your CPU cores.   [RIFT is a F2P but NOT a Pay To Win] I have spent over £100 on this game and the things you get is really for yourself like a new mount,bags,new powers,skip minions and things like that otherwise I would be OP as anything.  [Overall: 7/10] Would I recommend this game? Why yes I would! Download it and give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "When it magicly started to work it was a good game, but again when i started the game to day it crashed on laubch again.   I have tried everything exept removing my security files on the computer and it still wount work.  Good Game, But Fix the Launch Error!",
            "review_score": "1"
        },
        {
            "review_text": "Love playing this!!!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best F2P MMO's.  Hilarious community full of fun convos in public channels, lots of content, tons of cute to epic items to find, craft, or otherwise get in micro transactions.  Thumbs up from me. c:",
            "review_score": "1"
        },
        {
            "review_text": "I have played A LOT of MMO's, but as far as free to play ones go, this has to be the best.  What I like about it:  -Not pay to win, just pay for cosmetics or to grind less -great PvP system -Good integration of Mounts and Pets -Personal dimensions / Guild dimensions - The rifts themselves are badass, for anyone who has played oblivion, it is comparable to that. -Customizable skill trees -Good community - Dungeons, raids and 2 player instances - Mentor system if you want to help your friend who is a lower level -TONS of content and new things to explore ",
            "review_score": "1"
        },
        {
            "review_text": "a good game really it's like wow but free and sometimes i feel it's better then wow ",
            "review_score": "1"
        },
        {
            "review_text": "Really good. 9/10  Graphics - It rained and my clothes got wet.. Gameplay - Learning curve can be overwhelming. Once you learn to play you wont look back.  Sound - Good soundtrack and moderate to good voice acting.   Overall a very good edition to any online gamers library. I would recommend this to new and old gamers alike.",
            "review_score": "1"
        },
        {
            "review_text": "A MMORPG game full of options with loads of 'what if'-scenarios that and a different world. Guardians - Black and white, follow the good gods and slay the bad gods (once you've exterminated the defiants). Defiants - A tech centered people who does everything that is needed for science, even if it may be dodgey at best. Choose between Warrior, Rogue, Mage and Cleric for class.  Once those two choices are out of the way there's an ever expanding skill-tree that you may customize and tweak to fit your needs.",
            "review_score": "1"
        },
        {
            "review_text": "Great MMO. Screw WoW.",
            "review_score": "1"
        },
        {
            "review_text": "Never played MMO's before, this game has me hooked.",
            "review_score": "1"
        },
        {
            "review_text": "free to play without pay to win, good fun.",
            "review_score": "1"
        },
        {
            "review_text": "Hours of fun :)",
            "review_score": "1"
        },
        {
            "review_text": "addicting game and its free! if you have problems playing as a guest,create an rift account on their webside and it should work :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Although it is fairly similar to other MMO's, there are some aspects in RIFT that I have yet to see and make it a bit more fun than the rest. It wasn't too hard to get to their max level (currently 60) and start grinding towards the top tier gear. Although, starting as a tank as the first character made it some-what difficult as there is no specific tank gear until the 50-60 range and even then not much until level 60. It made tanking somewhat difficult and (not sure if my fault) I just about wiped nearly EVERY dungeon (just a 5 man dungeon.. not even a raid) even though I did the tank role correctly(kept all aggro, pull adds from heals/dps, etc). You certainly don't feel like a tank until level 60 - or atleast that's how I felt. Other than the slightly slow start as a tank the game was still able to grab my attention and hold it - A feat not many games can do.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing MMORPG game ... not for kids. more alike to wow than anyone things but this is just WAY harder than wow.",
            "review_score": "1"
        },
        {
            "review_text": "A good casual MMORPG. It plays fairly easily and has a wide range of activities while leveling up. The main issue is that if you play a lot you will run out of things to do rather quickly. Either way a great game to keep you occupied for a least a few months.",
            "review_score": "1"
        },
        {
            "review_text": "quite good game  has it's cons and pros  free to play, up to lvl 60, then you get the planar charges you can get almost everything in game, with some efforts on it  but when you pay, you can get a better bag, lvl faster and almost everything faster, so aint a big diference.  i recommend the game, since i been playing a lot.",
            "review_score": "1"
        },
        {
            "review_text": "You can get a horse",
            "review_score": "1"
        },
        {
            "review_text": "I........... LOVE THIS GAME! Best one yet, its better than No More Room In Hell. I could play it all day if i could!!!!!!!!!!!!! MARRRRYYYYYY ME! JK I'll rate this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game , minor bugs, but would recommend to anyone ! Most important thing it is not a common Pay to win MMO like others. Big (y)",
            "review_score": "1"
        },
        {
            "review_text": "Well I don't know where to start... This game is Amazing. Very good graphics, the combat mechanic is great. Rift is the best MMO I have played ever! You are taken to the world of Telera in hopes to start the ultimate evil- Regulos and the dragons. The characters are immersive-because of the character creation setup. There are 4 classes Warrior Rogue Mage and Cleric. When I saw this though, I thought aww thats not enough. But what I didn't know was that there are these subclasses called Souls that can further increase and specify the gameplay that you want. I have played for about 2 days and I am already level 23. Overall this game is AMAZING! And I don't say that about a lot of games.",
            "review_score": "1"
        },
        {
            "review_text": "Well made mmorpg. Get some friends and join the rumble",
            "review_score": "1"
        },
        {
            "review_text": "Rift is great game. Ive only played this 2 days and I love it. Its very similar to World Of Warcraft and thats the one reason why I love it. At start i dinint know anything and i was so lost but when I progressed I started to get hang on it. The only bad side of this game is that dlc costs too much. But every fighting style, crafting style etc. is great. I would give this 9,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Play Rift! MMO game that doesn't reach into your wallet to enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "I was lookin for a mmo game which combines the old school gamin and some innovative additions. i found it...",
            "review_score": "1"
        },
        {
            "review_text": "Great, and quick updates, A+ Raiding. Tons of content for all types!  Best F2P game only rivaled by Dota.",
            "review_score": "1"
        },
        {
            "review_text": "Very, very good game. I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Out of all the free to play MMORPGs, this is probably the most polished wow clone. If you like PVE and PVP in wow, and you don't wanna pay a monthly fee, i recommend this as a great substitute. If you're sick of wow and want to try something else, you will probably get sick of this really fast. If that's the case, you could try TERA for it's 'action oriented combat' and hopefully you won't notice how dull questing is there, but let's get back to RIFT! This game is packed with stuff you can do. It was worth playing while it had a subscription, so it is definitely worth checking out now more than ever!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game.  10/10 would bang",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Taking the best aspects of the games that came before it, improving on them and adding its own unique elements has Rift poised to be a long term power in the MMOG community.",
            "review_score": "1"
        },
        {
            "review_text": "The best F2P MMO out there. Hands down!",
            "review_score": "1"
        },
        {
            "review_text": "I'd say this is the best WoW clone. I wouldn't be playing this if WoW was completely free. However this game is probably the most fun MMORPG i've played because they give you alot of stuff to from an early level like raids and instances. I give this an 8/10 and recommend it if you cant play WoW or if you're just looking for a free mmo play this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game. Me and my friends are always online together. There is so much you can do on the game that it doesn't get old. There are always quests to do, instant adventures, and PVP battles. Only complaints I have is that many of the more useful items to buy from the shops are bought with platinum which takes a while to earn. My tip is to play the instant adventures. It is the quickest way that I have found to earn platinum fast. They also have a different currency on the game dedicated to those who have put their own money into it. There are lots of items and such that you cannot buy from the store unless you pay with money. Bummer but its a free game so I expected it in the first place. It doesn't effect the gameplay any and the game is just as fun and addicting whether you decide to put your own money in it or not. Also it doesn't give certain players an advantage over one another just because they use money and not in game currency, which is nice. I have found that trying to get into a PVP warfront is difficult if you are a lower level and i have had wait times to get in to be extremely long.   Overall I love the game and I would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Quite difficult F2PMMORPG... WoW copy. Very beautifull and extensive.",
            "review_score": "1"
        },
        {
            "review_text": "free wow",
            "review_score": "1"
        },
        {
            "review_text": "It's a bright and cheerful MMO (which i fund hard to come across now days) and is a very close example of World of Warcraft, especially the fighting style - The game is often compared to WoW alot, even through other members/ players of Rift however the 10% of the game that isn't like WoW, triumphs WoW; learning from Blizzards mistakes but still keeping an original feel to the game - would highly recommend and have since playing got three of my friends to start playing, all of whom enjoy the game dearly also.",
            "review_score": "1"
        },
        {
            "review_text": "best mmo game, graphic, environment, location, job, dungeons, all very very cool and made the best of this genre perabotka for a long time, play and explore the exciting world!",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game and I think it can hold itself up against several p2p mmos. The housing is great (a little bit too expensive for my taste) and the gameplay is fun (questing gets repetitive but that's the case in almost every mmorpg). What really bugged me was the amount of times the game tried to lure me to the cash shop, but since it's a f2p mmo i think kinda justified.",
            "review_score": "1"
        },
        {
            "review_text": "It cost around $200 to have access to all of the content and classes mostly broken into DLC. Trion has become a very greedy company.",
            "review_score": "-1"
        },
        {
            "review_text": "Rift is a great game. Very good classes some server issues when I first played it but it seems to be all fixed now. Highly recommend it if someone is looking for something that is similar to WOW but different story and more modern with better graphics.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game back at the 'From the Embers' update, before it was 'f2p' or even on steam. Back then, it was my favorite game. Everything about it was great: the graphics, the story line, the unique form of pve, and the amazing soul system. When Trion (damn them) made the game free, it all started going downhill. The became lazy with updates, most lacking any solid story, not to mention the fact that the quests were repetitive. I could tolerate this to an extent. However, the deal breaker for me was the major class changes. Every class could play every role, which got rid of the diversity, and even changed some of the souls completely. My main was a reaver tank, Therefore, my entire character was torn apart and made irrelevant. This game had so much potential, and I enjoyed it even more than WoW. Sadly, Trion took it down the wrong path, and it seemed to become a completely different game. Therefore, unfortunately, I cannot recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "RIFT is an amazing game for WoW transitioners or MMORPG gamers alike. It has all the similar elements of raid events, group bosses, and various quests and tasks for you to do so that you're never really bored playing RIFT. The graphics are a bit outdated but by preference it matches the theme of the game itself. The gameplay is smooth and always action packed, although skill and pet effects may be a bit lacking.  Overall, I definitely would recommend this game to anyone, first time and veteran MMORPG gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Game is epic , only about i can complain is Glyph error 2016 &lt;3 :)",
            "review_score": "1"
        },
        {
            "review_text": "Better than WoW, in every way, despite being a WoW clone.  If you're thinking of moving away from blizzard's dinosaur, Rift is a perfect choice.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I enjoyed that the world fights back essentally, and the graphics are well done in my opinion. The part that sold me was the rifts, while out in a zone you randomly encounter smaller ones, but during zone events there are numerous rifts and have to be delt with or certain quest hubs would be taken over by mobs, so the whole zone fights together to get rid of them and a final boss spawns in the end and everyone gets loot for contribution (pvp servers be prepared to fight over zone achievs)Wo  In a nutshell, WoW UI, Final Fantasy Graphics, Interactive zones ( The Job system is reminiscent of Vanilla WoW's trees, veryyyy customizable)",
            "review_score": "1"
        },
        {
            "review_text": "this game is so boring and its not even easy to play ,,the tutorial is horrible",
            "review_score": "-1"
        },
        {
            "review_text": "I ♥♥♥♥ing love this game",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Wish it was as deep as Lineage 2 - but that game is a lot more mature, and open source servers. Shame the community isn't very strong.",
            "review_score": "1"
        },
        {
            "review_text": "10/10  great mmo of a game. ",
            "review_score": "1"
        },
        {
            "review_text": "Ultimate nightmare edition? 50% off only 74.99. when the game isnt worth 39.99. there are much better mmos out there than this one. Dont waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "i love this game its real fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun and doesn't require money. Better than WOW",
            "review_score": "1"
        },
        {
            "review_text": "Edit: I'm not quite sure who the target market for this game is. MOBAs in general have much more lively and balanced pvp matches. And they are f2p as well. Raiding in general is a laggy low-fps jerkfest. My hardware isn't the top of the line, but it handled GTA5 at a decent detail level and framerate. Maybe people who like terrain puzzles and hunting artifacts? Maybe that's the real target market of this game still? Maybe the 5mans? Except that you'll be waiting for a 5man queue to pop maybe once an hour? The scintillating general chat?  Edit: The other thing that annoys me is how the expac souls are engineered to be so much better than the vanilla souls, so that you'll be forced to buy and play the new soul packs. So, if you are say, a mage, you will be forced to play harbinger, whether you want to or not, just because it does the required amount of dps needed to pass the content. Just one example of how f2p ruins a game over time. Another gripe would be how pvp rarely ever feels balanced, where almost every match feels like you're stomping the other team or you're getting stomped on. It's rare you see comebacks or even close scores at the end. It wouldn't matter except that they merged pvp and pve gear together, so that any change in pvp now affects pve, and if there's one thing pvp is always lobbying for, it's change, change, change.  Edit: The thing that really annoys me about this game is the lag. I'm sure that other MMOs do trickery to mask the underlying network latency, and perhaps Trion should look into that. That and the annoying little bugs related to the UI and display that have been in the game since launch. Their QA isn't nearly up to the level that Blizzard's is. And instead of fixing the bugs, Trion seems more interested in rolling out game after game after game. With probably the same sort of bugs in them too.  Edit: Not really pay to win, unless you're willing to shell out $100s. I'm guessing like all freemium models, they're relying on a few big whales to fund the playtime for everyone else. The current level cap 5man experts are decently hard. I can see where they tried to require teamwork, but all it has really done is make the tank shoulder an unequal burden in a PUG. Hence, players willing to tank are rather rare and you will be sitting in an expert queue for quite a while. The entry level raids are also decently hard too and do require even more teamwork to pull off. All in all, if you refrain from being a whale, it's a decent amount of content for not much money. PvP is rather laggy, if you ask me. I asked other people whether this sort of lag was normal and they said yes. So if you like crisp clear PvP, be prepared to be a little bit disappointed.   I played this game when it first came out. At the time, it was quite challenging, the 5man experts required quite a bit of teamwork to pull off properly. I left it when it was still hard, and still a subscription game, mainly because the internet I had sucked at the time. Can't really heal when you're lagging 5000ms. Not really fun either.  I decided to revisit it again, seeing as it's now f2p and subscriptionless, just to see what it's like these days. Everything is now easy mode, you're only in danger of dying if you get out of range of the healer. Otherwise the mobs just die in front of you and give you that sweet XP. The world is also ridiculously easy too, they've set the aggro radius on most mobs to be quite small, it's fairly easy to saunter in somewhere, hit a quest and then saunter back out.  I'm disturbed by the fact that you can now buy purple gear at the level cap. It may be a tier behind and the current tier you may have to play for, but it looks a lot like pay to win. I've no objection to paying for things, and in some ways, f2p makes for a nicer experience. Because nobody's on the clock (either you or the game designers) you don't feel that urgent need to zip through the levels to get to the cap, so you can get on with raiding. And the game designers (who you're really playing against) don't feel that need to slow you down, so they can get more money out of you. Time is money. You want to move fast, they want you to move slow.  But paying to win goes a bit too far. I haven't reached 65 yet (only 55 now), so we'll see.  Everybody (if you're willing to pay for it) can now do every role. Mages, can literally tank. Yes literally. The mage tank is no longer a joke. Warriors, can heal. No, not with bandages. They really can heal.  But if you just want something to kill time with, and all you care about is questing and 5mans, there's a lot of free content they're just giving away. Even if all you do is just dps with one of the original soul combos, it'll probably take you at least a month to get to 65. And then you can just move on to something else :P",
            "review_score": "1"
        },
        {
            "review_text": "There is a strong community with this game, much like Wow. Lots of similarities while being its own game. See a rift? Drop what your doing. Zone or world event? Drop what your doing. Want to level fast? Stay in the dungeon queue but rift smash while you wait in the queue. Want money? Adventure. Want both money and level? Adventure while waiting in the Dungeon queue.",
            "review_score": "1"
        },
        {
            "review_text": "Although the level cap is quite low. The community is massive, and the devs are always bringing out new updates for this game making it an awesome MMORPG. You can destroy rifts, raid dungeons, PVP and even fight in a PVP arena!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those people who like multiplayer games with an RPG feeling to it as well as it having a wide range of class types to choose from",
            "review_score": "1"
        },
        {
            "review_text": "summery: is this game pay to win or pay to play? no can u get everything in game without paying money? yes can u get equipment from the store?yes, but equipment that is mostly useless is game dead? in old world zones it may look so but once u get to 60-65, no do i need dlcs? trion doesnt know the real defenation of DLC(downloadable content) anything called dlc is actually either vanity items or things u can buy in game ++++++++++++++ p2p,p2w: recently there has been changes to patron system which brings up the question wheter the game is p2w/p2p, the answer is no, while some of the perks that made the game a bit easier are gone and are patron only now u can play the game without spending a single penny, in fact u can buy patron in game , u just need to farm a bit, im not talking about heavy grinding but spend 1h a day in game trying to make plat(money) either by collecting mats or by soloing old instances and u will be able to collect enough currency though u might jnot want to spend them on patron early on cause there are other important things like soul packs and earrings to spend them on. well if u consider paying for unlocking some basic things in game like earrrings(that u wont even need before level 65 and then u can easily farm enough plat to get them) p2p, then u r wrong, i havent played GW2 personally but from what ive heard u need to spend money to enter some of the zones and in fact u need to pay in order to level up past some point, now thats called p2p, meanwhile in rift u can access everything and even buy them in game(except for a few vanity items) though i will be honest i hate the fact that u need to spend credit on boxes in order to get some of the cooler mounts, i rly hate that buying equipment: well u can get all the equipment in game and the equipment that u can buy is not as good as the gear dropped from the bosses of the same tier,and u can also buy them with in game currencies,but they are only usefull for filling slots, but hey thats not the point, point is the current raid standard is T3 but you can only buy T2 with credit and u need to spend in game currency in order to get T3, another nice thing to point out is, there is only 10~15% bonus currency for patrons or the guys that are using boosts, u cant get more than that for the current max tier  raiding: in order to raid u need achivment, is what some ppl think if u dont have achivments fear not, just look for progression raids, there are many guilds/groups that want to give raids a try but dont have enough ppl, u can always join them, or alternativly u can join a guild. there are many perks for joining a guild like bonus currency and your guildmates(depending on the guild u joined) probably wont mind helping u gear up and might even craft u stuff and most of them dont mind helping u with getting into raids.  PVP: can be a pain but can be fun at the same time, there are maps for 10to 20 ppl and unlike moba games u r not a hero, if u think u can just go in and kill enemy u r mistaken,yes u might be able to single a few of them out but if u act reclessly u r dead,healing and support are way more important than they are in moba games, and given class system in this game(soul tree) u dont know what u r facing, someone might have enough health to be a tank but might be a tank/healer hybrid so does gear mean u r awsome? well i,as a mage, have been killed by too many lower geared assaasins and have also killed many guys that out gear me, i would say the way u play your calss/soul is more important than gears,though due to nerfs some of the souls might not be a good choice for pvp nowadays, like warlock(r.i.p)  why do i love this game(pros): +wardrobe: well u can run around naked as a tank and be immortal, or u can wear heavy plate as a rogue +soul system: unlike other games u can switch between healer,tank,support or damage dealer at a moments notice(well at least wwhen u r not fighting) and can do them all with any calling(mage,cleric, warrior and rogue) that u r using, of course each of them is unique in its own way, mage healers need to actually attack their enemies to heal their friends and they can summon undead as a necromancer while rogues have to sumon beasts +macros:dont have enough fingers for pushing all thoes buttons? use a macro, u can find them on net or easily make them yourself +dynamic world +crafting +community +dimensions: well i got lost in alabiranth that our guild master made and took 2h to finish it and then my senpai said that i have only found one ending and i haven found the real ending plus the bonus, spent 1~2 hours more to find the hidden content and damn they were hidden well, u have to give this whole dimension thing a try cons: -well as a non patron u can only quene for random warfronts(pvp maps) and dungeons,though u can ask a friend who is a patron to help u with them -sometimes u wont be able to understand what the quest or story is about -mounts in boxes, i hate thoes",
            "review_score": "1"
        },
        {
            "review_text": "An impressive game to say the least, the game is polished and easy to get into and start playing...even though it may be a hotkey MMORPG it still delivers the action and fun of any other game, possibly one of the only MMORPG's I have gotten into and stuck too...the graphics are extremely beautiful when playing on Ultra settings and the combat is fun and fast paced although a little complicated and hard to control at times, also I had a problem where I cant use the steam wallet to buy credits...this is a minor issue and im not sure if it applies to anyone else, but overall a fun exicting game well worth checking out, the fact it is F2P makes it even better. Id rate this a solid 9.5/10 even though some combat elements did let it down.",
            "review_score": "1"
        },
        {
            "review_text": "Did not like this game.Leveling experience was boring and didn't really enjoy the combat system either.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a WoW clone, try Wildstar instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a pretty nice game. get it its free.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly generic tab-targeting MMO. It's free, which is a plus, and the class system is interesting, but too many class options are locked behind a paywall, and an interesting class system can't make up for boring, generic gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "The party system is poorly designed, and the storyline just isn't captivating. There isn't quite enough structure (quest storyline), and it just isn't very fun. Not the worst MMORPG I've played, but not good enough to waste any time on.",
            "review_score": "-1"
        },
        {
            "review_text": "Had to uninstall it as soon as I finished playing it for 1 day. 10/10 would ruin my life",
            "review_score": "1"
        },
        {
            "review_text": "Another great game I can't stop playing, It's a multiple reminder of a bunch of games thrown together into one. I'm glad It's FTP, but I certainly would pay for It. Seems as It is FTP, there should be no reason for people to not check It out. It's definitely one of my top 10.",
            "review_score": "1"
        },
        {
            "review_text": "Want to play WorldofWarcraft but don't have the money to pay the monthly fee? Then RIFT is as close to a F2P(free to play) WoW as you'll ever get;or atleast for now anyway.........",
            "review_score": "1"
        },
        {
            "review_text": "have to dump money just to play the end game stuff....beyond hate it",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game! Much like World of Warcraft but free to play and a unique style of public events and souls!!  Have some friends that want to play a MMORPG? This game is the one for you. Really funy game with friends and in guilds!",
            "review_score": "1"
        },
        {
            "review_text": "This is how to do F2P. RIFT might be a little generic but it gets a lot of things right and definitely brings a lot of MMO conventions together in a nice package.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! I adore this game and have adored it for a few years now.",
            "review_score": "1"
        },
        {
            "review_text": "Don't bother with it. Borderline pay to win, devs don't give a ♥♥♥♥ about content hence why it comes out buggy and zealots who tell you the game is the best thing ever and disagreeing with them basically gets you ignored or reported. Terrible community especially on the official forums where any minor criticism is shut down by CMs. For the love of god save yourself the trouble of playing this game because It is garbage. Was so great initially then it went downhill.",
            "review_score": "-1"
        },
        {
            "review_text": "A nice game, kinda World Of Warcraft, and kinda not :D Many quests, many dungeons, many skills, character types, all in all, if you like game types like Wow, you should like this :D",
            "review_score": "1"
        },
        {
            "review_text": "Cant even play it,already downloaded in steam but still need to redownload it.",
            "review_score": "-1"
        },
        {
            "review_text": "A very interesting fantasy theme, and the invasions make even the longest walks interesting. PvP is polished well, classes are very diverse and unique, the community is active and plentiful etc. Overall a a great F2P MMORPG.",
            "review_score": "1"
        },
        {
            "review_text": "Do NOT play this game until they fix the GLYPH launcher issues. Otherwise you will be stuck as I am (and thousands of others apparently) with a high level character in a game you can't even log in to. I've never had a game actively prevent me from playing (or spending money for that matter), but that is what RIFT has become. Great game ruined by the worst launcher in the business.",
            "review_score": "-1"
        },
        {
            "review_text": "I played around 200+ hours and got my frist level 60, I then started to do the harder dungeons / pvping only to find out that if you don't have the best gear right away i mean as soon as you hit level 60 you are pretty much hated by your group, I tryed pvp at level 60...only to be ♥♥♥ RAPED by other people who are geared up the ♥♥♥, So i just deleted my account and removed this ♥♥♥♥ from my computer, If you are thinking about playing RIFT don't, You will only hate the end game unless you have a fat wallet.",
            "review_score": "-1"
        },
        {
            "review_text": "While I don't recommend this game, that's not to say that I think it's a bad game. I don't recommend anyone who has ever played World of Warcraft play this game due to the simple fact that this is a huge ripoff of the far superior WoW. The developers of this game made it much harder by over-complicating the skill tree and adding microtransactions under every rock, bush and tree in the game. Want the best items? What? Work for them? No, no no. Just make it easier on everyone and give us 5.99 and we'll call it a deal. Besides the extreme presence of microtransactions and the over complicated perk/skilling system, this game isn't bad for it being free. However, just be prepared for *ALOT* of kill x and collect y quests and spending alot of time trying to figure out the perk system. But hey, the game is free and if you're into playing a ripoff of WoW without having to pay, this is the game for you!",
            "review_score": "-1"
        },
        {
            "review_text": "i myself play world of warcraft hardcore and have done SOO raid on mythic but if you are looking for a free 2 play MMORPG this is your game tone of value for well nothing no cost",
            "review_score": "1"
        },
        {
            "review_text": "Only came here because of Trove. I'll just spend the damn cubits.",
            "review_score": "-1"
        },
        {
            "review_text": "Not recommended game,its simple because every damm thing you need buy with the real money,i purchased this game while ago and today got back,and WTF i need some stupid pack to be abble to play new souls ?! Good Job Trion,you killed this game....Make more things to milk peoples money ...",
            "review_score": "-1"
        },
        {
            "review_text": "Not only pay to win anymore. Its now also pay to play. Max level isnt reacheable without buying 40 euro expansion",
            "review_score": "-1"
        },
        {
            "review_text": "Not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "dumb as shi security. lose your authenticator, lose access to your account",
            "review_score": "-1"
        },
        {
            "review_text": "How to ruin a game 101 :(",
            "review_score": "-1"
        },
        {
            "review_text": "Rift is an all around, well balanced MMO I have been playing rift since it first came out and have only recently added it to steam. The FTP model is not hindered and you can earn anything that can be purchased.",
            "review_score": "1"
        },
        {
            "review_text": "When I first started playing this game during Alpha release, I thought I was playing the game that would knock WoW down from it's throne. During Alpha, the game mechanics, graphics, and UI seemed to lack that finishing touch. I assumed they would refine things a bit before releasing the game. They didn't. After years, this game still feels like it's in Beta. This game is very poorly optimized, it takes a LOT of power to run decent settings at reasonable FPS. I had managed to get AWESOME FPS at maximum settings through some tweaks in the files, but an update ruined it for me. I quit playing due to poor FPS on a good machine.   The customization was amazing at first. Being able to mix and match souls to create cool combinations. After a while that became boring. Most End-game content, other players expect you to run a specific soul tree setup, and a specific skill rotation. Any deviation from the normal method, and you are labeled a scrub.  When the game became FTP, the community changed quite a bit. It went from being a tight knit friendly community, to a loose commotion of rude 12 year olds with a core of elitist jerks.  One update after another, I held out hoping TRION would fix things, but each new update introduced more problems than what was fixed. Now TRION is just beating a dead horse trying to get every last dime they can out of this game.  It really could have been great, but after all the money I spent supporting the developers, I'm just dissapointed.  To Trion.. please FINISH your games before you release new content for them. FIX your games instead of abandoning them.",
            "review_score": "-1"
        },
        {
            "review_text": "i love this games!!!!!!!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting game, the way that it gives you quest after quest makes you wanna keep doing them until you finish it.  what i liked about this game is how you can communicate with people online, making friends and family (as in getting married :P) and having your own party group that you choose who is in it. I basically like everything about this game expect how some quests could be hard to be done later in the game, or how you can buy from the AH but you cant sell because you lack the loyalty (for the free game). But im sure that we can all survive that :P. After all i would give this 10 unicorns/ 10 potatos (10/10)",
            "review_score": "1"
        },
        {
            "review_text": "Considering the game is free-to-play now, it is one of the best f2p mmos out there. There are many things to do, the rifts keeps leveling up fun enough to not get bored. (Plus, you can get cool loot for doing it!) Play it with a friend, play a class that you think would be fun! There are many ways to play. You are not locked to a single playstyle. Explore your horizons in the big tree system, or pick a determined build for you to enjoy without having to worry about it!",
            "review_score": "1"
        },
        {
            "review_text": "Lost my horrible, lardo first wife to this game. She never stopped playing it. It literally caused our divorce.  But you know looking back on it, She was a disgusting human being, and I'm glad she's gone.  Thank you Rift!  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Fun free to play game if you just want a world to look around. Rift is pay to win, has loads of pay to play and pay to win features. If you dont invest heavily in Rift you wont have items you need to enchant higher level gear. The pay to win, pay to play features make Rift almost unplayable in my opinion. I hate to be hit up for real money every time I want to do something new in game. I would say Rift is one of the best games ever created. Then ruined by the pay to win store. Ruined by all the nickle and dime tactics. Whats funny at the time of writing this 556 Rift players online, 25224 players in Skyrim. Skyrim dont have all pay to win and its single player. Too bad devs dont understand this. They insist on taking best game and making it where no one wants to play it. Too bad.",
            "review_score": "1"
        },
        {
            "review_text": "addicting  damn good  play it  fun  9/9 m89",
            "review_score": "1"
        },
        {
            "review_text": "Graphic and introduction was not what I expected.",
            "review_score": "-1"
        },
        {
            "review_text": "Rift is a cool game if you can get past there new safety !",
            "review_score": "-1"
        },
        {
            "review_text": "It's like Guild War's mentally disfunctional younger bronger.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best F2P MMO's out there, It's worth a try even if you're not an MMO fan.",
            "review_score": "1"
        },
        {
            "review_text": "I played for a little while and I guess it's ok.",
            "review_score": "1"
        },
        {
            "review_text": "First register button dont work then i go to GLYMP or what ever is the name and register then after 20 something hours of downloading the game it says i must update ... 'Your files cant be updated, full redownload of the game is required' Mother ♥♥♥♥er... i have 450Kb/s net you unimaginative piece of ♥♥♥♥.. i joust downloaded the entire game stupid.... says how good are developers on this game ?.. NOT GOOD AT ALL !!!",
            "review_score": "-1"
        },
        {
            "review_text": "It's a nice game to play with friend's and in hard core.",
            "review_score": "1"
        },
        {
            "review_text": "Hi, it would be good but there is not any lore. Empty, schematic sides. Why would I like to fight for any of them?",
            "review_score": "-1"
        },
        {
            "review_text": "I can guarantee that this game is not p2w. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Fun fact, if you log into this game from a seperate computer, it permabans you for security reasons, and if you ask why you were banned, they tell you you violated terms of service, if you ask what you violated, they can't tell you for security reasons. 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Free To Play is the Way to go you dont need elder scrolls online spending almost $100 a month all you need is Rift!",
            "review_score": "1"
        },
        {
            "review_text": "This game never send me an aunthentication email. I checked spam~ everywhere no email tried redoing the sign up tried doing a brand now one with new email same result. This is bs and I don't care to have my time wasted like this.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is so ♥♥♥♥ing addicting :D",
            "review_score": "1"
        },
        {
            "review_text": "good game, but would love to see it's pvp not like WoW's",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun game to play when you are tired of playing other face paced games. easy to learn.",
            "review_score": "1"
        },
        {
            "review_text": "It's just another MMORPG. There's nothing special about it for me.  After trying it again, I couldn't get it to load. Well, I could, but it would take like 30 minutes just to start. Also, I hate the race selection. What race do you want? Oh, well I want to be something animal or lizard or something. Too bad, you get humans and humans with make-up. When a game does that to its race selection, it's already got a 50% chance of being bad. Just automatically in my opinion. I don't like this game and I despize it for being one of the many games with a human superiority complex.",
            "review_score": "-1"
        },
        {
            "review_text": "i love this game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVA stop haten",
            "review_score": "1"
        },
        {
            "review_text": "What I Liked about Rift? Something else on market then Warcraft, had a interesting fighting engine.  What I Disliked about Rift? Not enough content, Got boring after a while, Even though i was not wanting to play wow for a bit, I still missed going into Dungeons, ether as a High level and just doing it, or doing it with others.",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you don't have the money for World of Warcraft!",
            "review_score": "1"
        },
        {
            "review_text": "I've played many, many MMOs over the years, and this happens to be one out of the five that I keep coming back to. If you are like many people that I have met and have wanted to bring your friends into a game but find that backtracking or making another character is just sooo boring, or sooo painful to do, this is your game. This is the game that ends that. You wanna know how? Simple.  You can delevel yourself without it being permanent, so playing with new player friends, guildies, strangers, or experiencing old content you liked is no longer an issue. Pretty damn sick, right? I've only known Guild Wars 2 to do this, and I really didn't like how it was...forced. But that's because I'm one of those pain-in-the-asses that doesn't like the content to pummel the crap out of me just because I wanted to go and help my buddy on his quest to kill an elite monster.  I'm also a sucker for dungeons and PVE content, and they seem to always be improving. Solo content is also pretty rewarding, but please remember this is an MMO, so you're going to have a ton of those 'kill some rats and I'll give you some silver, pretty boy' quests. Not sure why people complain about that when they know what kind of game this is in the first place.  Do you like roleplaying? If so, they have a dedicated roleplaying server. This is definitely worth looking into seeing as the community isn't all that horrible to each other LIKE SOME GAMES WE KNOW OF. *Cough cough*  I also believe the most hardcore selling point of this entire thing is the customization of your class. You get to mix and match three 'souls' to change up your abilities and buffs. Purchasing more than one specialization to have more combinations of these specs is done with the in game currency rather than the cash, and few of the other souls are locked by the cash as well. Spending money also is very, very worth it, and this is coming from someone that is very stingy if it's a free to play game. I don't believe in throwing my paycheck at something unless it's a damn good deal, and these guys know how to build their microtransaction shop. Plus, the option of a subscription is even better. Nice buffs to your experience gain and gold gain that you can switch off at any time.  If there's anything to hate, it's probably the weird sci-fi fantasy mix of a story they made. I've seen far better. But I'm picky.",
            "review_score": "1"
        },
        {
            "review_text": "I ABSOLUTLY LOVE THIS. GAME I WOULD RECOMEND THIS TO ANYONE",
            "review_score": "1"
        },
        {
            "review_text": "Very underrated game, The amount of content you get for Free is unreal! Only a few of the (newer) classes are not available unless you spend some monies. But with the ingame currency you can gather enough to trade for some RL currency to get whattever you need. That begin said there is a small i think $5 barrier for free players that limits you to only like buying stuff from the Auction house, and maybe a few other non essential things. Ultimatly This game rewards you for how much you spend though, if you subscribe for say 12months. You unlock loyality tiers where you get things like a mount for all your characters. Special abilities to teleport home faster, things that are VERY convient but again not ESSENTIAL.  I recommend this game whole heartedly, The subscription is definatly worth it when you are leveling, as of late 2015 the player base is pretty big and very friendly/active. if you give this game more than 15mins i think you will like it allot.",
            "review_score": "1"
        },
        {
            "review_text": "well this is all i have to say.. its a good game with open world.. and with cool boss's..",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addicting, i think my hours will go up in this game.  There are many things i like about this game. You can pick 2 sides and there are 3 races, and in those races are classes, there are 4 classes and within those classes is what your class is gonna be! .-. that was just the character creation area. when you get into the game u kill stuff use ur items and just have fun. The reason i like this game is because Star wars the old republic (SWTOR). That game is extremely fun, even though it doesnt have a hour counter, ive spent 3 years on swtor, so i think i might have atleast 2k hours, I loved that game, and it was on my laptop so ANYWHERE, ANYWHERE, i would play that game. Back to rift, get the game, if you like any mmorpg's, PLAY THIS! But, sadly.. There is a subscription system, but the thing is, its not game breaking! Some mmorpg's ABSOLUTELY DESTROY their F2p games because they dont let you do ANYTHING. But in this game, it actually lets you DO STUFF AND NOT FORCE YOU INTO BECOMING a SUB!! Over all, get this game!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed every minute of it!",
            "review_score": "1"
        },
        {
            "review_text": "Have technically played this game since launch, and have 3 level 50+s.  If you are looking for a MMO, I'd definitely give this game a shot, it's pretty old but it has a ton of content for free.  With that said, I would never purchase 95% of the things in the store because they are severely overpriced. If you can't see beyond the cash shop (which is pretty much entirely optional outside of primalist and some souls) then don't try this game. If you can see that there is quite a lot of free content available, only barring you from a few souls and one class, all of which are either balanced or weaker than their counterparts, you should definitely try it out.   I used to raid in Rift a long time ago, the raiding was actually better than WoW's at the time, I believe it was Post-Ulduar WotLK, which I never found fun (ICC was decent at best). Nowadays the raiding is still pretty great, not quite BC-quality raiding, but it's certainly better than most raiding out right now in any other game.  As for the PvP, it's pretty much just like WoW's PvP, what do you expect?  Leveling blows, just like in any other MMO, and the story is extremely mediocre, but what MMOs actually do leveling right nowadays? The only one I can think of is FF14.  All in all, if you're a raider, then give the game a shot for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game once you get to max lvl the pve is kinda weak but the pvp game is on point so you dont have to spend years farming an armor set and when you finally get the last peice they release an update and have to start all over again rift is so amazing the best/nicest people on earth play this game so friendly!!!   9/10 Stars",
            "review_score": "1"
        },
        {
            "review_text": "Installed through Steam. Check. Create a Rift account separately. Check. 'There was an error downloading streaming updates.' Check. Delete local content. Check. ",
            "review_score": "1"
        },
        {
            "review_text": "It's like TBC WoW, and it's free, if you have patience to grind resources, then sell them on chat and a helpful guild to give ♥♥♥♥♥♥♥♥ of bonuses you can and will enjoy this game to its fullest, free of charge, I'm full T1-T2 and only paid for Cosmetics (because I really liked some skins) and I regret it everyday since now you can craft cosmetics in the game with certain proffs. The only reason you would pay is if you are really impatient with grinding marks and stuff , money advances you faster, but with the last Tiers of armor in the game , money doesn't help. Good ol' TBC-level raids, with complex and easy bosses . 7 x T1/20man bosses, 4 x T1/10man bosses, 11xT2/20man bosses and 4xT2/10man bosses. The 10man raids also have Hardmodes for extra drops of the same tier or Easy mode if you just want the marks and dont need drops anymore. I've played WoW, Aion and Dragons Prophet before, this game is the best of them for 0 money. Kids who can't grind daily quests because of ADHD will complain that you need to pay for AH permission and Earring Wearing Permission, but in truth in 2 weeks max of grind you are the same as if you've paid 64.99 Euro.",
            "review_score": "1"
        },
        {
            "review_text": "For the little amount that I've played, this is not a bad mmorpg at all. Graphics are basically between World of Warcraft and GW2. They are not as refined and artistic as the later but much superior to WW. One thing is certain, it's hard to get bored in RIFT. There's always something to do, kill, run at, explore... In the last few days, I've tried in succession a bunch of F2P mmorpgs and this one hooked me up the most. For what it's worth, give it a try, you might actually love it.",
            "review_score": "1"
        },
        {
            "review_text": "Great mmorpg if you are looking for character customization. The overall experience is similar to alot of other mmos, but it feels much more streamlined and the open world events make it all that much more enjoyable. Though some herald the random adventures as a great thing I feel it takes away from the exploration side of things as it randomly jumps you around to kill bad guys. Great for level grinding, but not my thing. Overall great game and its free so give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "it was fun at first. Don't bother. you get to a lvl cap and die of bordum if the mega F-tard lag don't peev you off first. you can have a supper mega 'imposable to guag' gaming pc and it will still suck. you can tweek it to wher its nuthing but shaps and you lag like hellz  it was so bad i'm not even going to spell check",
            "review_score": "-1"
        },
        {
            "review_text": "would love to have more low level epic gear, also more gear that levels with you",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. It takes a bit to get used to the movment. I hope they keep balancing the game more and more.",
            "review_score": "1"
        },
        {
            "review_text": "Has been chose as ascended along with everybody else.   First time I got to max level...still playing for end game content. Droped out of school 10 outa 10",
            "review_score": "1"
        },
        {
            "review_text": "Best f2p mmorpg Good graphics, ingane mechanics, environment, quests and player base.  A lot like WoW. Recommended if u want a divorce with your social life.",
            "review_score": "1"
        },
        {
            "review_text": "Good enought",
            "review_score": "1"
        },
        {
            "review_text": "Desent MMORPG about as good as wow TBH",
            "review_score": "1"
        },
        {
            "review_text": "An entertaining game to say the least, though it lacks a certain pizzazz in the storyline. It's predictable nature takes a bit of the fun out of the game as a whole. However, there are redeemable features such as the customizable characters and the rousing outdoor bosses and battles. Some see this game as a World of Warcraft rip-off, I see it as a befitting way to fill that WoW shaped hole in your heart. May your time in the world of Telara be most enjoyable!",
            "review_score": "1"
        },
        {
            "review_text": "-Once joining you need to get used to it but once you do... say bye to your family and your life because this will rip away everything. 20/20 still dont have a life ",
            "review_score": "1"
        },
        {
            "review_text": "'i cant afford any games so this is my best option' simulator 7/10",
            "review_score": "1"
        },
        {
            "review_text": "fun ft2.. cool thing all the expansions are free.. only have to buy classes if you want different then the defaults. Its been fun so far.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Dont worry about the idiots spending money on the game. The free to play part is amazing on its own",
            "review_score": "1"
        },
        {
            "review_text": "it's ok",
            "review_score": "1"
        },
        {
            "review_text": "Take all MMOs....put them together....but BETTER!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very addicting. I play DOTA 2 a lot, and this game, is DOTA, just waaay better! a lot of abilities to use, nice effects, many different in-game items to buy, many different and challanging enemies, and of course... a lot of awesome battles and things to do! I really like this game, and it will take ages to get to the highest lvl (I don't even know the lvl limit :P). This game is for people who like DOTA, Runescape or even Skyrim. Rift has a lot to offer, and I like all the things they have, and I still haven't seen all.  My rating of the game will be 4.5 out of 5 stars :)",
            "review_score": "1"
        },
        {
            "review_text": "For a Free To Play MMO, RIFT is surprisingly high quality and fun. I have played to level 43.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing and better than World of Warcraft",
            "review_score": "1"
        },
        {
            "review_text": "this suck, i cant play it in macbook pro",
            "review_score": "1"
        },
        {
            "review_text": "1. Game is extremely similar to World of Warcraft. This is a pro and a con. It's a pro because World of Warcraft is awesome, who wouldn't want to play a similar game. It's also a con as some players are looking for something new. That being said let's cover some points that newer players want to hear.   2. You can play this game for months and still have things left to do. There are thousands of quests and a healthy playerbase.  3. Combat system is nothing new for MMOs and will grow stale quickly for veterans.   4. game is advertised as free. is it? NO! if you've ever played tf2 when it went f2p you'll understand this. in rift as a free player you get a couple bag slots, a couple character slots and a couple other restrictions such as not being able to make auctions in the auction house until you spend 5 bucks of real money to make it otherwise. there is no way to get bag slots besides real money or getting to max level and selling a lot of harvested materials for REX (real currency sold by players).  technically you can say this game is 'free' however free in this case would be sadly comparable to slavery as you must act as a slave in order to obtain that amount of currency. this could take you weeks of gameplay which will not be enjoyable.  5. the dungeons are fantastic. they are generic at first but eventually you will have a reasonably challenging time. it's an enjoyable way to level up if you are playing as a tank/healer.  6. the questing SUCKS. It's the most grinding in an MMO i've ever seen. we're talking 50+ quests to get up 1 level at level 40+ (level cap is 60 holy hell)  in conclusion, do i reccomend this game? sort of. i play with my brother in dungeons etc but that's about it. the novely died off fast. for new mmo players this game may be completely overwhelming and without a friend who knows his way around you won't get far fast.  for new mmo players, stay away from this game unless you have friends who also play. for people who left wow because it cost too much, here's a cheap alternatiive.  ",
            "review_score": "1"
        },
        {
            "review_text": "(Read in Consuela voice) No.. no.. no bien. Disliked the graphics (ik it's about the gameplay...) and a tad too many bugs like getting stuck in a bridge or a ravine.  Anyway this is what drove me to the decission to de-install within a hour. Just my personal experience and opinion even though I haven't explained them that much.. I kinda trust that people will know what I mean.",
            "review_score": "-1"
        },
        {
            "review_text": "never got to even try out the game because I never got my comfirmation email.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "It's very fun",
            "review_score": "1"
        },
        {
            "review_text": "one of the best ftp games out there.",
            "review_score": "1"
        },
        {
            "review_text": "no mouse turnin. -10000/10",
            "review_score": "-1"
        },
        {
            "review_text": "I remeber actually pre-ordering this game and enjoying the living hell out of it years ago. It was a familiar game to play but had it's own personality. Like every MMO though it quickly went F2P as soon as the devs realized the players base was dropping, instead of creating interesting new content like raids classes and rewards like mounts and special armors. they made it free to play added an industry standard cash shop and inevitably killed their game.  Many may not agree with me on this but this is the game that got me away from World of Warcraft, it showed me there were other options. I have fallen for Trions MMO trap twice now, with this game and again with Defiance (mmostly because my wife and I enjoyed the show at the time). I highly recommend you don't even bother trying this game as a free player now, your time is far more valuable and there are much, much better free to play games available.",
            "review_score": "-1"
        },
        {
            "review_text": "  After playing a week or so, I have to say as far as warcraft clones go, it's pretty good. Overall, you do see the standard 'go here and do this' type of quest that all MMOs have. I have yet to try pvp or become active in a guild. I personally like playing through plotline first. Which brings me to my primary complaint. There are a few times where you complete a quest for the story and find yourself trying to figure out who gives the next story quest. Sometimes it's my fault for not paying attention, but others take some digging online or running around looking in game. I like that so far this game is defintely not pay to win. Leveling is still pretty decent without the perks. While the game does ask you to subscribe every time you get on, it doesn't throw it in your face by giving you content you can't use like Trion's game Defiance did. I'd have to give this game a 7.5/10 and will try a month of subscribing.",
            "review_score": "1"
        },
        {
            "review_text": "If you're like me and sick and tired of WoW but still ikes to play a solid fantasy RPG than rift is indeed to me the best out their. It incorporates many new things all the while keeping to the standards of MMORPG gameplay.A solid MMO that I would recommend to anyone. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "awsome mmo!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game , great variety of things to do. And from a beginners perdspective of mmo games this a delight. 8.5 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game to play with GF    Otherwise quite medi-core mmo really.   ",
            "review_score": "1"
        },
        {
            "review_text": "Love World of Warcraft? Do not want to pay a 15$ a month subscription? Then this is the game for you. I didn't think I'd ever stop playing WOW. This game made it possible.",
            "review_score": "1"
        },
        {
            "review_text": "it was ♥♥♥♥ ",
            "review_score": "-1"
        },
        {
            "review_text": "At first I thought it was just another WoW clone. On the surface that is very much what it looks like. In fact its one of the most WoW lookin WoW clones I've ever played. In a way though thats good. Seasoned WoW players can jump right in. For me though the sheer amount of WoW clones is what essentially made me give up on the MMO scene for a long time. I found most MMORPG's lately are just very stale and repetitive with too much grinding for not enough reward   However as you play the game more you learn about the rift invasions, soul swapping and many other features that just bring a whole new depth into the game. You can completely customise your characters by combining 3 different classes together. I recently looted some gear that was recommended for a Cleric Rogue Warrior. That pretty much says it all as far as I'm concerned. Not to mention that theres none of this 'Reach level X and pay a ridiculous amount of (game currency) to learn how to ride a boring slow horse'. When I was level 15 (and essentially still learning how to play the game) and on my way to buy my first, reasonably priced, mount I looted a very cool collectable Hellbug mount from a standard Rift event, that starts off at the slowest mounts speed but will increase speed to match my fastest mount when I get one. I thought this was a very nice touch.  From my experience so far it pretty much cuts all the ♥♥♥♥♥♥♥t that you encounter in most other MMO's that make them such awful grinds and keeps you entertained and engaged the whole time. Highly recommended to any fans of MMORPGs",
            "review_score": "1"
        },
        {
            "review_text": "Great F2P game",
            "review_score": "1"
        },
        {
            "review_text": "this game is exactly like WoW and for once... it isn't con. Only complaint is that there's only 2 char slots and it's 5$ for each additional slot.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Free to Play RPGs ive seen in a while WoW is a great game but for the people that dont want to get their money to go away this is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "Excellent, and not Pay2Win.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Better than Diablo 3.",
            "review_score": "1"
        },
        {
            "review_text": "don't bother. not at end game and never will, but if you look at the pay to win raid gear, it literally costs hundreds of dollars so if you do like it and get to end game, you have to be amazingly rich. and end-game is probably dead anyways. everyone's too busy talking about abortion, bathrooms, and politicians to play it anyways.",
            "review_score": "-1"
        },
        {
            "review_text": "for a f2p MMO is really fun, really easy way to pass the time",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you find nice comunity its even better",
            "review_score": "1"
        },
        {
            "review_text": "JUST AMAZING!!!! THE SCENE THE SKILLS THE CLASSES CANT LOVE THEM ANYMORE IT SHOULD BE BETTER IF THERE ARE MORE CITIES AND BUILDINGS",
            "review_score": "1"
        },
        {
            "review_text": "good way to spend your life and money is in this game",
            "review_score": "1"
        },
        {
            "review_text": "Why do I even bother? MMOs are always the exact same thing now. Fetch quests. In other words, you are in a massive world with a bunch of nerds who complain about the endgame in the global chat, and you do chores for a bunch of NPCs for no reason. IT'S ALWAYS LIKE THIS.  Go there. Click this. Go over there. Click that. Click this guy. OK now go kill five of these dudes by pressing '1' repeatedly and then come back to me. OK now click on three of these things and come back to me. OK now go investigate these 3 plants that are right next to me, then click this other guy because he needs you to kill four of these things for some reason.  Wow, you leveled up! Not gonna give you any stats to raise though, because that would be too complicated for the lowest common denominator we're trying to appeal to. Don't feel satisfied? Fine, now you can press '2' in combat to cast another cooldown spell! WOW can you imagine the possibilities? Two whole buttons to mash! You found some worthless garbage loot, congratulations! No one cares! Are you having fun?  ARE YOU HAVING FUN YET?",
            "review_score": "-1"
        },
        {
            "review_text": "WoW clone but with the added benefit of Blizzard not being able to ruin it, that is a win in my book.",
            "review_score": "1"
        },
        {
            "review_text": "Really boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game have such bad control! i couldn't even finish one simple quest! and that was the tutorial! if you want good gameplay by contorls you should go MMO TERRA, and if you like the thing of RPG its obvious go for skyrim!",
            "review_score": "-1"
        },
        {
            "review_text": "RIP TRION!",
            "review_score": "-1"
        },
        {
            "review_text": "No rob ford character #noswag",
            "review_score": "-1"
        },
        {
            "review_text": "No exciting updates, game became boring. pay to win",
            "review_score": "-1"
        },
        {
            "review_text": "game wont start up since the year gift dlc",
            "review_score": "-1"
        },
        {
            "review_text": "peice of ♥♥♥♥ i got banned within 24 hrs of downloading the game literally made a character exited the starting area then got off next day banned",
            "review_score": "-1"
        },
        {
            "review_text": "I have given rift a fair try and I can honestly say it isn't worth the numerous hours it takes to download. It's a SERIOUS WoW clone with the difference being it's graphics are somehow worse but better and when I say that I mean, they seem more high definition yes, but at the same time look very ugly and unnattractive where when compared to WoW it looks low res yet very charming and appealing, (since it was a game designed for everyone and everyone can run it, where not everyone can run rift, just a side note there) The monster grind is very slow, and tedious and normally there should be some tedious tendencies in monster grinding rpgs but it takes it to a whole new low, a ridiculous camera angle and controls that turn far to sharply to dodge any attacks. Speaking of which, I can safely say the combat system is hella broken, you could be a mile away from your target and still take a ♥♥♥♥ ton of damage, it's as if they stole Dark Souls 3s hitbox registry and ported it to their own game. In all honesty if you want that fun, rpg experience, either buy wow or go to  warmane.com  both are so much more worth their weight.",
            "review_score": "-1"
        },
        {
            "review_text": "Free WoW clone.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not receiving my authentication code even after i tried at least 20 time doing and waited for 2 days and still nothing",
            "review_score": "-1"
        },
        {
            "review_text": "yea dis game good yea ok",
            "review_score": "1"
        },
        {
            "review_text": "it is a awsome game i think mmo game it has mounts and like a guy with you you get to be evil or hero and get different characters",
            "review_score": "1"
        },
        {
            "review_text": "In this game, you can take off your clothes. (Excluding underwear) So, my level 10-isg mage is walking around in nothing but a cape and underwear. After some solo fighting, I come across a tear. I think to myself 'Sweet! I can summon a rift now!' I proceed to summon the rift. I fight off wave after wave of baddies in nothing but my underwear and cape, and no players are around me. I saved Telara. I am the hero Telara deserves. I am... Captain Underpants. 11/10 (And I almost died twice)    One more thing, I have yet to see any of the awesome looking monsters in the screenshots, but I remain hopeful...",
            "review_score": "1"
        },
        {
            "review_text": "Ive played this game well Around its first few months of being released and have mostly only seen improvments. Keep it up guys ;-)",
            "review_score": "1"
        },
        {
            "review_text": "Top notch mmorpg",
            "review_score": "1"
        },
        {
            "review_text": "Authentication code never comes in from thru e-mail making it unable to play. 10/10 best game ever.",
            "review_score": "-1"
        },
        {
            "review_text": "The game looks nice but I couldn't play more than two minutes without getting really bored. No aim or control of your attacks what-so-ever. You just click on a target and then your character attacks until they're dead.... Boring!! For the life of me I don't know how this game gets so many positive ratings. I've played several other MMOs and most of them have better controls (e.g. Neverwinter, Tera Online, STO, etc.). You should have complete control over every shot with your bow and arrow and every swing of your sword. Sad because I thought the graphics and plot looked half decent.",
            "review_score": "-1"
        },
        {
            "review_text": "Rift is a great game, I give it a 10/10 way better then WoW and any other MMO, I recommend to anyone that loves MMOs Ive tryd alot maby at least 30-40 but this is by far the best I love the way you level from PVP, And I love how you can do a quest a system called Instant adventrue just a perfect mmo in my thoughts. Best of all its FREE.",
            "review_score": "1"
        },
        {
            "review_text": "this game went down a dank path",
            "review_score": "1"
        },
        {
            "review_text": "  This game is a lot of fun! A lot of cool features and really cool dungeons. The graphics are very diverse so any lapotop or desktop could play this game at extremely low to extremely high! My only complaint is the fact that, seemingly not a lot of people play this game anymore. I am also starting to feel like this game is a play to win game, but understandably so. The devs do a lot of hard work on this game every week and deserve to be compensated for it!",
            "review_score": "1"
        },
        {
            "review_text": "I need help to acess the game. I cant load up the game when it comes this the place where you can choose which sever i can join (NA/EU) ive tried to recover files that i may have lost but it still does not work? Please help.",
            "review_score": "1"
        },
        {
            "review_text": "combats really slow and hard graphics suck",
            "review_score": "-1"
        },
        {
            "review_text": "P2W game, but is a very good game.",
            "review_score": "1"
        },
        {
            "review_text": "See the things is I actually spend money on this game to play it with my boyfriend at the time and he got bored really fast so I only got to level 30 cause I didn't wanna play on my own. In retrospect we weren't really meant to be anyway. I have really low standards.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun MMO, i think i would totally complete it if i wanted to, and I definitley want to! XD",
            "review_score": "1"
        },
        {
            "review_text": "Dont get the steam version Not even played the game seems a full redownload is required!!!  STEAM's MMO support at it best!! STEAM you need to do better than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than WoW",
            "review_score": "1"
        },
        {
            "review_text": "u have to ♥♥♥♥ing buy inventory space with real money.",
            "review_score": "-1"
        },
        {
            "review_text": "Like WoW but even more dumbed down (lol?) and PAY TO WIN so have fun with that..",
            "review_score": "-1"
        },
        {
            "review_text": "worst controls ever",
            "review_score": "-1"
        },
        {
            "review_text": "Game Sucks, the controlls are so bad........",
            "review_score": "-1"
        },
        {
            "review_text": "Downloads it, Starts it, Black screen, Cant do anything (Not even CTRL+ALT+DEL), Restarts the computer the old way by pressing the button, Starts the computer, Need to fix it, Great game, makes your computer sad :D",
            "review_score": "1"
        },
        {
            "review_text": "It may be free to play but the hassles you have to go through to play make it not worth it. When I try to log in it asks for user id and password and then for my activation code. I have to go log into my email each time to gtet the code. Then I enter the code and I cant play because I have to download some damn patch that will not patch properly. Dont waste your time on this dog",
            "review_score": "-1"
        },
        {
            "review_text": "I started the game and it told me to reinstall it. 11/10 would deinstall again.",
            "review_score": "-1"
        },
        {
            "review_text": "Great rpg, more i feel need more",
            "review_score": "1"
        },
        {
            "review_text": "the controls are very hard to use and there is no way to change them to be less stupid i'm glad this is a free game and i didnt spend money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Ignore the usual people ♥♥♥♥♥ing about P2P and how the game 'used to be good'  When a game has lived for a long time, the community gets smaller, and that community has already spent their money.  This is the NATURAL COURSE FOR ALL GAMES THAT EVER GO FREE TO PLAY  However, Rift was a ♥♥♥♥♥♥ game from the beginning and I found this out very early into my Mage and my Cleric.  The new skills you get when you level up, are ALMOST ALWAYS WOOOORSE than the skills you already had.  HOW. WHY. Did somebody just pick spells out of one hat, damage out of the other, and position on the tree using darts? Literally how, literally why.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! My brother and I spent several hours creeping through last night. It definitely is something we look forward to on the weekends!",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "good game.but low vpn service",
            "review_score": "-1"
        },
        {
            "review_text": "-Game lore is cofusing and boring at first glance, won't make you interested at all(like DotA lore). -Bad graphics and really awful animations. At the character screen your character feel badass, in-game just a genreric humanoid thing. After playing this game, Smite(moba) animations rock !  -Linear quest based. There is no reason for that. And that is not a good thing no matter your excuse.  -On the char creation screen tons of cash content. Its frustrating that to pick a certain color you have to buy it. Eg: If you want purple hair, buy a dye pack. -On the class select tons of cash content. Eg: there are like 8 builds to choose from, if you are FTP you can only choose 1 and the rest are BTP. Are boy, the free classes feels like : meh. The cash ones feel like badasses. Classes aren't balanced, most people will go X build because it is OP. -Bugs, tons of bugs, on the main quest i found so many bugs, i was playing it duo with a friend and we were laughing at first, then we got really frustated. -The community are a bunch of raging fanboys who gets ♥♥♥♥♥♥ you report a bug on the forum. And staff wont even read any of it. -There are better MMOs out there. GW2 is free now, go ahead and try a real finished game.",
            "review_score": "-1"
        },
        {
            "review_text": "I wouldent reccomend this game, i personally dont like the overall game play and smoothness of the runing, and the combat system, The graphics are nice but its not as smoothe as some mmos i have playd in the past",
            "review_score": "-1"
        },
        {
            "review_text": "all i had to do was launch the game and take 3 steps to know that it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "  MMO Games ain't my thing But this one totaly sucks",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the gayest games ever? But I find myself playing it every day? Am I alright in the head? The answer is yes? Don't buy this game?",
            "review_score": "1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": " Once again your typical MMORPG, from the publishers who brought you Defiance, this one is not much better. The giant boss battles are cool but doesn't last very long.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game and im lvl 31. If you wanna get mad cuz i only have a couple hours on record i had this game way b4 it was on steam. I had it b4 it was f2p!",
            "review_score": "1"
        },
        {
            "review_text": "Best free to play, RPG game I played in Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "played this for 30 minutes. 30 minutes full of weird bugs like loosing your head(literally) and stupid mobs that no one cares about. lame game.",
            "review_score": "-1"
        },
        {
            "review_text": "its a wanna be WoW... boring to play got little story to it",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes (with a blue screen of death) within minutes on a fresh install of Windows 7 64-bit.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is AWFULL. Got it and tried to play it and was just bored out of my skull.",
            "review_score": "-1"
        },
        {
            "review_text": "Why can we still play Rift, when no one never play that game that much anymore?",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing Rift for years , I got sick of World of Warcrap and when this game came out I jumped on it and it had many elements similar in style to Wow but the graphics were better , the combat , the gameplay , the bottom line is everything was better. It's been around a while , it's grown , has a mountain of content , some of which is dated but graphically and in terms of gameplay it stands head and shoulders above anything in it's genre. but do I recommend it? Well sure I do, I'm still playing it!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a WoW clone which isn't quite as good or up to date. There are some things which make it interesting, however the only proper 'good' thing I can say about it is that its free.",
            "review_score": "-1"
        },
        {
            "review_text": "Just lack luster. Add to this the poor support, poor management and community interaction of Elizabeth Tobey the director of global communications, in game issues, and the heavy MT emphasis now that its free to play, its just a recipe for snake oil.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this at all. The niveau is very low. This game is usually played by people who went to special-needs school.",
            "review_score": "-1"
        },
        {
            "review_text": "While RIFT did have many fantastic ideas, many of which were copied by other games (Guild Wars 2 and Starwars: The Old Republic), the overall execution of these ideas were decidedly subpar. Combine this with a mediocre business model, a small user base, and a very tough genre of video games, and you have a very modest MMORPG.",
            "review_score": "-1"
        },
        {
            "review_text": "It will rift apart your life.",
            "review_score": "1"
        },
        {
            "review_text": "Thought it would have so much more potential.",
            "review_score": "-1"
        },
        {
            "review_text": "pointless quickbar mmo, got bored after 5 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Interface is way too small, graphics is rly bad and most of monsters have AI like they dont even know what the script is. At the start of the game you get 20 same abilities and for me class are jsut csmetic because you can pick abilities totally from other skill trees and use them with same efficenty. For me comparing to Neverwinter it's 1/10 and comparing to WoW less than 0,5/10. Dont download guys - just waste of time and space.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your time. I can't believe this game used to retail for 60 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "rift is a bad game",
            "review_score": "1"
        },
        {
            "review_text": "Clunky gameplay , average graphics , it's rubbish no wonder it's free to play, i wouldn't waste your time downloading this.",
            "review_score": "-1"
        },
        {
            "review_text": "So you make your super customizable character then play the tutorial and realize they didn't put in a auto-route function or arrows to indicated where to go. Then once I found the down sydrome NPC it tells me nothing cause 2 other people were trying to talk to him and it lags. Then once I talk to his 25 chromosome ♥♥♥, he tells me to go to this nest. Then i spend 1 hour walking there cause I got lost 11 times and realized it was ♥♥♥♥en hidden next to the village. Once I one shot the wasps cause you know ♥♥♥♥ wasps, right. Forest Gump tells me to go back to the wasps and collect their tales. I'm sitting there thinking, '♥♥♥♥♥ if you told me both at the same time this would have been done. But no motha ♥♥♥♥a things I have all the time in the world since I can fast travel. Oh wait, you ♥♥♥♥en can't.  10/10 Great Game. If you want to play this game and the previous game you played was League of Legends, please turn off the computer and throw away your mother board cause your computer has cancer.",
            "review_score": "1"
        },
        {
            "review_text": "p2w trash ignore it for wow -.-",
            "review_score": "-1"
        },
        {
            "review_text": "*Cough* War Of Warcraft rip-off *Cough*",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "I played WoW for over several years, waste of money. This is a fantastic MMO and its FREE.",
            "review_score": "1"
        },
        {
            "review_text": "Work Hard to Win 10/10",
            "review_score": "1"
        },
        {
            "review_text": "5 out of 5  Great MMO, that is really polished. The PVP was a lot of fun, and it is really easy to jump in and jump out.  Highly recommend Conquest mode, if you have a good PC.  ",
            "review_score": "1"
        },
        {
            "review_text": "similar to wow in a lot of aspects",
            "review_score": "1"
        },
        {
            "review_text": "An excellent pve game. No good contend about pvp tho.",
            "review_score": "1"
        },
        {
            "review_text": "free to play, pay to win good game",
            "review_score": "1"
        },
        {
            "review_text": "i cant get onto it after i downloaded it",
            "review_score": "1"
        },
        {
            "review_text": "Went into one of the dungeons with only 2 players. Fought a spider boss who prevented my healer from casting any spell, making me basically the Tank/DPS/self Healer of the group. Best mmorpg ever where you get to play as the 3 main roles at once.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game but there is a major problem with the backup &amp; updates of the game. When you try backup the game, it fails. When you verify the game cache in steam it says it is missing files and will redownload them. When you try play the games again, it starts downloading 11.3 GB again (the entire game). It has downloaded 3 times in 3 days on my Win8 x64 (40GB with updates).",
            "review_score": "-1"
        },
        {
            "review_text": "dont play it",
            "review_score": "1"
        },
        {
            "review_text": "love the game",
            "review_score": "1"
        },
        {
            "review_text": "This game looks awesome, so cool cinematics, and the gameplay itself is very good :) Everyone should try this game",
            "review_score": "1"
        },
        {
            "review_text": "Good for casual play.. becomes too much for a grind and in game purchases become more of a necessity later one",
            "review_score": "1"
        },
        {
            "review_text": "this game so rocks",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE this game. Its not a WoW clone its more like a WoW Twin. Its super fun, well designed, and its super fun fighting in dungeons along side other people. I have waaayy more hours played then what is logged on Steam, I first played it before got a steam account. I suggest you et it. However I was updating Rift and all of a sudden my character profiles are gone and Im eally friggin ♥♥♥♥♥♥ to say the least",
            "review_score": "1"
        },
        {
            "review_text": "Rift is that game that you play everyday after school or work. I have a hundred hours logged on in this game and I love it.",
            "review_score": "1"
        },
        {
            "review_text": "There no fall damage in this game for some reason it was taking out, less challenging without it :'(",
            "review_score": "-1"
        },
        {
            "review_text": "Played this at launch many years ago. And its a groundbreaking good MMO with the 'new' Rift event system that adds some extra fun to general linear branch of mmo's. Many other games adapted this kind of event like Defiance and The Elder Scrolls online",
            "review_score": "1"
        },
        {
            "review_text": "It's really not bad for free-to-play! My only regret is having pre-purchased this way back when it furst came out. I tried it for literally half a day, and left. It's so much better now. Overall, it's not WoW, and never will be, but the classes are fun and it doesn't feel *too* pay-to-win. It's worth a try, and certainly isn't a bad way to waste time!",
            "review_score": "1"
        },
        {
            "review_text": "I play as a dwarf that hurts monsters and people by playing music.  9.5/10  Needs Metallica bard Dlc.",
            "review_score": "1"
        },
        {
            "review_text": "been playing this game to date for half a year  pros: - wardrobe variety is huge - if you play warrior &gt; couple macros faceroll top dps  - nice casual mmo   cons: - lots of the raid boss mechanics are stupid proof - not too easy to make in game currency requires a lot of farming (unstable artifacts are good source but everyone does them with tracking vials so gg) - rng blows - you will need to find a dedicated guild if you wish to progress content because pick up groups are either fail or require you to have the boss kill achievements",
            "review_score": "1"
        },
        {
            "review_text": "Nice MMO but as with all MMOs they get boring after a while :/",
            "review_score": "1"
        },
        {
            "review_text": "An extremely addicting game. Invest time and you will be rewarded. Have a friend play it with you (Advice)",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "Alot to do and it's active. It looks great to me and is alot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Admittedly a novice at this game. The graphics are much better than I had hoped for when I got the game. Easy to play and interact with characters. Enemies are quite easy to overcome.",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a fun game to play with friends or just pass your time in.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, but this game is way too much ¨pay to play¨ ! ",
            "review_score": "1"
        },
        {
            "review_text": "don't waste your time",
            "review_score": "-1"
        },
        {
            "review_text": "If you don't mind doing mundane tasks such as crafting, mining, fishing, ect. it's a fun game to play.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome",
            "review_score": "1"
        },
        {
            "review_text": "My characters legs lagged off the body....   greatest game ever! xD",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those who want an MMO experience without the need to pay for a game. I played the game since it was subscription based and enjoyed it very much. This is a good game for those who once played WoW, unlike WoW, Rift is a lot more graphicly apealing, more realistic, compared to WoW's cartoonish game. Rift has an enjoyable leveling system that did not feel like a grind. highly recomend for anyonw wanting that MMO experience.",
            "review_score": "1"
        },
        {
            "review_text": "second game ive tried to play now but for some reason i cannot. its ridiculously frustrating.i dont know if its beacause of glyph but its looking like it and im pretty ♥♥♥♥♥♥ of with what i am getting.",
            "review_score": "1"
        },
        {
            "review_text": "People claim this game is a WoW clone, and unfortunately, I would agree with them in a sense. Rift basically took the WoW formula, and improved on the parts you didn't like about it. This game is the evolution of WoW, the only downside being what some might call totally imbalanced microtransactions (meaning you really need to pay the normal MMO price to be anywhere near competitive in this game). I recommend it to any ex-WoW fan looking for some fun grind and interesting dungeons or raids. The PvP sounds pretty interesting too, though I can't say I've tried it. At this point the community is really only composed of a small number of long-time dedicated players, but a. In my experience they've been super friendly and b. I imagine the upcoming Nightmare Tide expansion will bring back a load of players, maybe even draw in a few new ones.",
            "review_score": "1"
        },
        {
            "review_text": "The new Free To Play version of Rift is amazing, plain and simple. Hands down the best F2P game available on the market. It has taken on the GW2 in-game store model, and it works brilliantly. The 'credit' system works perfectly and it is in no way pay-to-win. PvP gear all has to be earned and can't be bought, as there is a PvP currency separate to regular gold. Like i said, It must be earned not bought.  I say this game is the best F2P because technically, you don't have to pay a dime and you can experience 100% of the game with no strings attached. GW2 obviously you have to purchase the game for 60 dollars first. I am an old Rift player back during the subscription days, the changes they've made since are awesome, more and more people are playing the game everyday thanks to Steam giving it more publicity. Grouping up for raids/adventures is amazingly simple and works within seconds. Literally seconds. You all will be teleported to a location, thrown into a raid group and bam, that's it. So easy, so quick, so simple. Minimal bugs. Even when it was released it was praised for being a ridiculously well polished game.   I have played over 10 MMO's in my lifetime, this is hands down one of the most enjoyable. And on top of that, it's free. You couldn't ask for anything more. Too bad they don't have Oceanic servers, sucks to be a gamer in Australia :( loll. However my ping always sits areound 200-250ms, which is still pretty good.   4.5 out of 5 stars. Highly Recommended for all MMO fans =)",
            "review_score": "1"
        },
        {
            "review_text": "good game but auction house/trade post is stuck behind a pay wall",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game because I think it's just AMAZING, one it's a survival game, two it's a strategy game, three it's just AMAZING!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best mmo on the market and its free",
            "review_score": "1"
        },
        {
            "review_text": "A more mature version of World of Warcraft. While I am not going to say its better, it definitely is a game any mmorpg player should at least check out. Their free to play model isn't a pay to play model. Yes putting money in gets you lots of cool stuff, it doesn't get you a huge advantage to someone who doesn't. Trion listen to their players, and many of their major changes come directly from player requests. Tons of content, pay what you want, how can you complain.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It has beautiful graphics and its a lot of fun. Once you start playing you lose track of time and end up playing for hours. Or at least that's my experience. And best of all its completely free to play! I love it!",
            "review_score": "1"
        },
        {
            "review_text": "very fun game do reccomend only a few bugs but im sure it will get patced",
            "review_score": "1"
        },
        {
            "review_text": "Its not skyrim, but its not bad.",
            "review_score": "1"
        },
        {
            "review_text": "An MMORPG that stands out all above the others. The game is very easy to master, provided that you like and enjoy playing the class that you have made. This game is a must for MMORPG players out there, give it a try and see if you have the 'Calling'.",
            "review_score": "1"
        },
        {
            "review_text": "This is one awesome F%#king Game!",
            "review_score": "1"
        },
        {
            "review_text": "Ban IP from Vietnam.  Don't know why. But I hate this game.  There should be a warning from steam for the banned countries. BECAUSE I DON'T WANNA WASTE MY TIME FOR THIS ♥♥♥♥♥ S!@#T",
            "review_score": "-1"
        },
        {
            "review_text": "Hi all. I played Rift and created a Mage played for until lvl 70 .. then I bought many mount and stylish clothes from the Rift store and after a mont I bought everything .. Rift removed the server and everything I bought and my hubby with. I give you warning not to play Rift!",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "At the minute this is the best f2p mmo IMO. Yes, it has some flaws, but overall this is the best. It has some WoW feeling, but the overall this is completly different experience. The f2p system is pretty user friendly.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Graphics are good. My Toshiba Satellite has no problem running the game on a decent visual setting &amp; maintaining a smooth performance. Looking forward to playing this game a lot more.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Everything WoW should be.  Extremely satisfying to play.   Cons:  Even with a high end processor and decent video card my framerate is less than mediocre. The game seems to be in need of some optimization.",
            "review_score": "1"
        },
        {
            "review_text": "Very good MMORPG and funny :) not boring like others game :)",
            "review_score": "1"
        },
        {
            "review_text": "6/9",
            "review_score": "1"
        },
        {
            "review_text": "I have played long ago before it was F2P and it was a solid game even then. I tried it when it went F2P a bit and life made it so I couldn't test it all, but damn it's become even better ! Some of the defaults smoothed out the good way and classes a bit balanced (not too much, what's a MMO without its OP classes lol!) that they pay very good care not to upset too much.  I wish I had the time (and the friends) to play again, I stopped when they all but deserted for stupid reasons. So try to find new friends in the game, don't be like me !",
            "review_score": "1"
        },
        {
            "review_text": "Level 60 cleric. Such a fun game. Also has features for lazy players who cant be bothered to find good quests.  Great fun finding gear. Its not P2W either which is good.  Would I recommend it.  Hell yeah..",
            "review_score": "1"
        },
        {
            "review_text": "This game WAS amazing, until it went free to play.  Now it's ♥♥♥♥. 0/10 sad I wasted so much time to be ♥♥♥♥ on.",
            "review_score": "-1"
        },
        {
            "review_text": "I never actually played this game, I just racked up a bunch of hours over night while it patched.",
            "review_score": "1"
        },
        {
            "review_text": "I've thoroughly enjoyed Rift. I'm not well versed in MMORPGs having only played free trial of WoW in the past BUT I will say that my experience was very fulfilling. I love the lore, the visuals, the mixing of technology and fantasy. The gameplay is fun. I like mixing souls to create new strategies. Rifts are a unique experience. Sidekicking/mentoring is such a great feature. I totally recommend it to anyone wanting a fun MMORPG experience.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty darn good game but I wouldn't get into it unless you have a lot of free time. I played it in the summer and it was very fun. PvP is good, quests can become a bit of a grind fest but they are also generally pretty good. There's a class system which works quite well however some classes are more OP than others, especially in PvP combat.",
            "review_score": "1"
        },
        {
            "review_text": "just wow,you can have the slowest computer on earth and this thing still would be fast ,wanna play while downloading no problem after the game reaches 20% of the download you can start and holy ♥♥♥♥ how epic",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting game it is indeed. It is very similar to WoW if you like that game. You can play it how you wish.  Pros: Amazing Class System with high customization Cross server compatibility for shorter queue times. Cool dungeons that are casual or hard if you want them to be. World Events Free if you want it to be. Decent amount of end game content.  Cons: Moderately Expensive to play at the highest level if you choose to purchase things in the store. Auctionhouse selling is limited to those with enough loyalty points, you can still buy off of it though. Linear quest system, can get boring if you zoom through it. Lackluster crafting system.  Overall, the game is very close to WoW. If you want to try it you also have nothing to lose as it is free. I would recommend playing it for a little while to see if you enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "This is one MMO that I can return to again and again, it knows what it's going for and it succeeds at almost every step. ",
            "review_score": "1"
        },
        {
            "review_text": "this game is the ♥♥♥ and ♥♥♥♥♥♥s. v nice, v nice. yas",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME MMO GUYS U BETTER PLAY THIS",
            "review_score": "1"
        },
        {
            "review_text": "Custom classes to your needs, roleplaying is awesome, you can edit your own dimension which is player housing, and free to play is actually worth trying this game unlike Archeage. Crafting is decent, the world is colourful and you never know when a rift will open up around you. Best MMO I have ever played, up there with Warhammer Online: Age of Reckonning and Tera Online.",
            "review_score": "1"
        },
        {
            "review_text": "Played it for many hours prior to it being available on Steam. Overall I have had a lot of experience with Rift over the years.  Plain and simple, I loved the game up until the most recent x-pac 'Nightmare Tide'. I spent all of an hour playing it after it's release and totally lost interest in it. For me personally the game just doesn't feel the same, and the under water stuff I experienced while leveling up to the new max was enough to make me 'nope' straight away from the game.  Everyone's experience is different, and opinions are extremely subjective. For me personally I do not recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing. I have gone through about half the levels and enjoyed the gameplay and content a lot. There is so much in this game that it is hard to get bored of it. Traveling around solo or doing dungeons with guildmates can both be major highlights of Rift. Get this game if you like action packed MMORPGs. I hope I see you in the game 8)",
            "review_score": "1"
        },
        {
            "review_text": "Addicting and fun, especially since it went Free-to-Play.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so I was looking around through games so i could find something to pass the time, and boy did I find just that. Rift as swallowed me in, with nothing but (i tend to play alone) so much grinding. I downloaded it about 3 weeks ago, or so. and I literally think about the game all the time. It provides aspects from alot of the later MMo's of the kind, except the aspects aren't exploited. Either way I haven't spent a dime on this game, and I probably will, because I enjoy it so much! so thank you for providing it to me!!!!!!!! ^_^ Okay, i'm going to play now !",
            "review_score": "1"
        },
        {
            "review_text": "I Literally can't recommend this game enough, It is absolutley superb. Everything from the Environment design, soundtrack, questing system, the awesome soul tree and everything in between. Best of all its FREE!!  Yeah sure you can put money into it for the DLC or gems in the rift store if your a hardcore rift player, which i often do! But the point is you dont have to. You can have just as much fun with this game without paying a penny...  11/10  I freaking love this game...",
            "review_score": "1"
        },
        {
            "review_text": "So After Downloading 17.8 GB .... The Launcher itself Asked Me to Approve a 5.5 GB Download  And I was Frustrated  Please just Put The Whole ♥♥♥♥♥ Amount Of the game    Other Than That ,This Game is Really Awesome",
            "review_score": "1"
        },
        {
            "review_text": "Definately on of the best mmorpg's to come out in years",
            "review_score": "1"
        },
        {
            "review_text": "Rift was great before it went free to play. I bought the game, I paid month to month, I knew what I was getting. Now everything has a cost and I don't even know what I am buying, soul packs, content packs, points, I have no idea. I tried to comeback and play by just getting the two expsanions that came out after I left, but it isn't even remotely the same game anymore. Also all my characters from pre free-to-play got deleted; I got a message saying the shard they were on is no longer active or something. Uninstalled forever, it was fun while it lasted.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game now for more than 250 hours. It is still addictive. There is so many thing to do in game.",
            "review_score": "1"
        },
        {
            "review_text": "Play this!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! It has an old school feel to it still which is great as the MMO community needs. There are talent points that have not been revamped drastically such as other games that I won't name.",
            "review_score": "1"
        },
        {
            "review_text": "I quite enjoyed playing this, however did not find the game to be too social. I played on my own most of the time.  Although I chose to pay for a few features to support the game I did not find the game pay to win.  Well worth the time installing to have a go.",
            "review_score": "1"
        },
        {
            "review_text": "Can this please go on mac.",
            "review_score": "1"
        },
        {
            "review_text": "Can't Register .. I want to Play but can't register ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Well woth a play. A game you can easily get lost in, there's never anything not to do or a place to travel. It just got even better with the release of Starfall Prophecy expansion.",
            "review_score": "1"
        },
        {
            "review_text": "5 years after I started playing and I still go back and enjoy my time ...",
            "review_score": "1"
        },
        {
            "review_text": "Wish I had saved my old review, which was way more thorough than this will be. Not sure why it disappeared. I have another 1500 hours outside of steam (because Glyph client just won't run while steam is active some days; it used to take astrology to figure out the days it would work), across 3 characters + a handful of alts.  Quick summary of the good: + F2P forever, you can earn or find almost all non-vanity items you want without spending a dime + Special class system allows for interesting, non-cookie cutter builds + Good graphics and great atmosphere in most zones + Interesting, engaging questlines with NPCs you will become fond of + Lots and lots and LOTS of content in the vanilla zones + Can shard-hop (server-hop) on the fly while in-game to play with friends in your region + Special world-wide events every few weeks, plus holiday events + One of the servers is named Deepwood, which always makes me chuckle  Bad stuff: - RIFT runs on a heavily modified version of the Gamebryo engine. Your CPU needs to be very good to keep a high fps outside of dungeons and wide open areas. Cities/raids/pvp will crush you otherwise. FPS drops will be less cpu-crushing in the first few zones, but expansion zones have much more clutter in them and will cause lower framerates. - Trion has consistently poor, slow customer service on non-payment matters (quick response/resolution if you have money issues though) - Bugs remain in the game for years before being fixed (or if you're a druid you have 2 abilities that will probably do nothing forever) ; more rehashed content is priority over bugfixing - Unique class system allows many builds but causes big divisions between 'interesting builds' and 'builds which perform well enough to even attempt end-game content' - Not all of the servers have names like Deepwood  Conclusion:  Very enjoyable MMO, great to play with friends or solo, easy to lose yourself in and spend hours and hours playing it. It's free. Try it out! But don't spend money on it, and don't play the end-game unless you get into a good raiding guild before then.  2016 EDIT: Wrote this review in 2014 initially, Rift now has true multicore support and no longer will you get 5 fps in Tempest Bay or Draumheim with a GTX 970. You can easily expect 10 or even 12 fps in crowded city hubs!  AGAIN: don't give Trion your money. Play the 1-60 content because it's honestly fun and you can have a great time with it, but only do the 60-65 content if you have plans to raid and have a guild ready for you. It's a pure grind with bland quests. All of the quality Trion could put into this game at this point has gone towards the raids (they're not terrible, but... not great either).  Starfall Prophecy edit: You thought Storm Legion was a grind? You thought Nightmare Tide was worse? You don't want to know what Starfall is like. Just play from 1-60 and don't even bother with the Plane of Water.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game so far, and interesting differences from the norm. The lag at times does become annoying - even more so when a mini event monster is running at you and you can't attack or run away.",
            "review_score": "1"
        },
        {
            "review_text": "This game has the most fresh approach to an MMO I have not seen since WoW.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "Would play 10/10",
            "review_score": "1"
        },
        {
            "review_text": "great game, easy to get ahold of and for a free game surprisingly its not pay to win.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun",
            "review_score": "1"
        },
        {
            "review_text": "I don't really know what else to say about this game, other than just repeat all the good things that previous people that has given this game a thumbs up. Graphics good even with my lower settings, gameplay is easy to understand, the versatility on how you want to create your char class as you level is well..versatile. Community currently is very helpful, grouping with others is very easy...and so forth and so forth...just give this game a try, after all it's free, no tricks. Only downside, if you even can call it that is you have only two char slots with option to buy more slots.",
            "review_score": "1"
        },
        {
            "review_text": "one of the first games i got on steam.... love it!!! got to level 10 and it was the most fun in a mmorpg since SWTOR. also has a very good straight forward story line. unlike most MMORPG",
            "review_score": "1"
        },
        {
            "review_text": "Amazing MMORPG game that functons almost identical to WoW but is 100% FTP and has a rapid growing gaming community. I'd definetly recomend this to any MMORPG gamer whos looking for a long and full free game. I played WoW fro years until I descovered Rift. The play style is almost identical yet being free made all the diffrence and no more $150 a year to play. Now just straight fun, adicting, and all free great game.",
            "review_score": "1"
        },
        {
            "review_text": "RIFT has some very useful features that makes your game experience a bit more relaxed and enjoyable than the usual MMORPG.  Even if at first it might seem... confusing. Or maybe it's just me getting old and needing some time to adapt to things, in the end you have a product where you are actually incredibly DRAMA FREE.   You can customize your interface, you can decide what do you want to be and create different builds you can easily swap between the same class, so you can actually be A LOT of things in just one character. You won't need to start over 34939 times then regret your first configuration. Everything is adjustable as you play.   There is the very useful NEED/GREED roll dice method, and a public group system that lets you join whatever group of people you encounter in your travels without too much drama and with a very large limit of partecipants.  This makes doing quest that generally require some companions a lot less annoying. Guilds are generally very large and not demanding towards players, due to the fact you actually DON'T really need a guild in this game.   Another peculiar and very wise feature is the fact you actually gain a portion of experience for everything you touch, in the same exact moment you touched it.  Say goodbye to the good old moments where actually farming away something some other player was fighting against was rude and would have made him mad and without exp or without his quest advancements. You can help whoever you want, even if they don't know you, freely.   Also, there are two factions for a good PVP, like in many other games. The same old two factions omg what a surprise, there are the GUARDIANS and the DEFIANTS. But, in PVE servers, you can actually help the other faction's members and freely roam in their territory unless you actually attack them. The only things that would take it bad would be guard NPCs.  But I'm PEACEFUL!!! - Who cares, stay out of the city. - Fine...  I can't say how are things in PVP servers tho, I don't have the mindset for these places.  If following the story and a simple, linear quest line is too BORING for you and you want some senseless, mindless and neverending fight, you will also be able to join some adventures and be added to a huge swarm of people with some common goals to achieve, in a random location, washing away whatever you see.   Being too many levels ahead of your companions will be no longer a problem for none of you two. In RIFT, you can actually decide to lower your lever to whatever level you need. You'll have the same skills and same equipment, but you'll be way less powerful, matching a well equiped character of the level you chose. You will also gain experience according to your actual level, and you will no longer disturb your companion with your skill gaps. Wich is actually great if you have that kind of annoying friends who LIVE on the game, and then spam you because you 'keep them behind', when you, yeah, dare to sleep or to eat.  Another drama reason cleared. This game is MMORPG's peace and love.  And if you want to be an HERO.... - Well things constantly invade your region, so you just have to wait for the next invasion to join the huge battle defending your little villages and defeating the big badass who is trying to conquer everything. Nice rewards for you!  There is a reputation system, everytime you fight a good number of mobs somebody want DEAD, you gain some reputation with that faction, wich will allow you to buy good consumables and other things.   Of course the game is called RIFT for a reason. There are RIFTS, everywhere. And you'd better close them all, run towards them like crazy pokèmon masters when they see a wild pokèmon. Closing them will give you prizes and a materia called Planarite you can actually use to buy very nice items.   If you fear there aren't Dungeons or instanced stuff like that, oh don't worry, you have your dungeons too. Gathering and crafting skills are also avaiable, you can build quite a few nice things without TOO MUCH effort.   You have a personal dimension too, like a 'home', you can decorate with 'dimension objects' you can craft, find, FISH for, (yeah fishing sometimes gives you some nice not-a-fish catch.) etc., and an artifact collection thing that allows you to find a lot of objects from different collections. Once you complete a collection, you win some prizes.  If you don't care about that, you can also be a 'dreamweaver' as you progress in the game, and just convert artifacts into dimension items building materials.   Well I'd say, try this if you like MMORPGs, but you're tired of the many annoying things MMORPGs generally throw at you. I must specify tho this isn't one of these... WOW new super-graphic-ultra-popular games so yeah don't run it with your expectations set to whatever really recent you can find around now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME!!! Play it NOA!",
            "review_score": "1"
        },
        {
            "review_text": "Its good",
            "review_score": "1"
        },
        {
            "review_text": "Splorch froom kerpazzio! Nunk! NUUUUUUNK!",
            "review_score": "1"
        },
        {
            "review_text": "Exactly the same as WoW exept its free to play and has rifts. What else do you have to say? Amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Why do I need to download this 2x? I already downloaded it on steam and now I need to download it again from its client? Anyways..the game is good...just the accessibility of it is bad",
            "review_score": "1"
        },
        {
            "review_text": "fun for all ages, somewhat complicated, but with the right mount of persistence it can be figured out",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. The only thing is that the freaking Coin lock is impossible for me to get rid of. I know it keeps you safe from hackers and all but I wish there was an easier way to disable it",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good. Never played an MMO before this one, was very reluctant to play one but im glad i did. meow",
            "review_score": "1"
        },
        {
            "review_text": "One of the best free mmos I have played",
            "review_score": "1"
        },
        {
            "review_text": "Didn't work for me. I have kaspersky antivirus and it doesn't let me login. the 'support' site says to disable the safe money feature and turn off parental controls. I did this and it still will not login. want my advice: Avoid this game if you have kaspersky!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing, no two ways about it. I used to play this game back in 2012 and it was the sh*t! The graphics are great consiodering when it was released and the gameplay is just the same, PvP is great and the questline is 'collect blah blah blah' I'd recomend this game to any MMORPG enthusiast out there!",
            "review_score": "1"
        },
        {
            "review_text": "this game was consuming my life, i had to put an end to it",
            "review_score": "-1"
        },
        {
            "review_text": "it's sucks as if i were to cut your ♥♥♥♥ off and feed to you grandmom ",
            "review_score": "-1"
        },
        {
            "review_text": "This game has so far brought me a lot of good times, and it will ultimatly get you hooked and keep you hooked all te way to the end. GG.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. The fights are very dynamic and the raids are staggering in scale. Tons of customization for your heroes make you feel like a truly ascended badass. Enter my referral code 'NGTDJMZ6NLH2KZCD2KFT' for ascend-a-friend and you'll get some starting rewards and the ability to summon players to your location.",
            "review_score": "1"
        },
        {
            "review_text": "ITS Better Than any other MMO",
            "review_score": "1"
        },
        {
            "review_text": "This game is very simular to any other MMO on the market with the usual grind when completing quests.   It is very simular to world of warcraft only with more realistic graphics with the game play very simular to the classic gameplay of world warcraft's old skill trees.   This game can be complicated due to its number of skill tree choices you can make to make your character, however this is great because it doesn't matter what character you choose to play, you can change your play style with a click of a button to suit the current play style you wish to play or change it should you wish to try something different without having to reroll a new character.  This game seems to cater for a more mature player due to its gameplay features, however once you understand it, it is quite easy to play.   The community is also very friendly, which helps with the enjoyment of this game, playing with friends or making new ones.   Can easily lose many hours in this game.   Would I recommend this game? I would say yes if you are looking for a another game like classic World of Warcraft with a more mature feel, and gamestyle with more realistic graphics and you don't mind the usual MMO grind doing quests, this is the game for you.   ",
            "review_score": "1"
        },
        {
            "review_text": "Love the game !!! If you love WOW youll love this game or more !",
            "review_score": "1"
        },
        {
            "review_text": "good mmo for first time mmo players, but if you played wow worth taking a look at.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best alternative to WoW currently on the market. Amazing game, some of the best graphics I've seen in an MMO, or anywhere.  PVP? Check End Game Content? Check Evolving Content? Check Player Base? Check  And everything in between.",
            "review_score": "1"
        },
        {
            "review_text": "The Great Detail and Class System makes it all worth the large download size. Why play WOW if this game exists the only reason you should ever play WOW is for the world other but this games world personally is more detailed and interesting than the World of Warcraft",
            "review_score": "1"
        },
        {
            "review_text": "Good mmorpg solid mechanics. Deffinetly check this one out.",
            "review_score": "1"
        },
        {
            "review_text": "its laggy it acts out constantly i was so excited when i saw that this game was free instead of paying for it when it first came out but after playing i quickly learned why it was free i wouldent play it more if i was being payed to",
            "review_score": "-1"
        },
        {
            "review_text": "This game has been the time consumer during my holiday leave! What an awesome MMO, I would say better than GW2 and WoW. The graphics are great, the skills are great, the gameplay is great and the best part is, it is actually free to play (not pay to win at all). All content is pretty much available from the word go!  The only cons are: it is not optimised for multi-threading, meaning that even your top notch gaming PC, might just struggle to break 30 fps on Max gfx settings. Very CPU intensive. The other con is that it is a bit grindy and can get monotonous later on, the quests can become a little repetetive: kill x of this, pickup x of this, etc.  Saying that, I really recommend this game, I have enjoyed it and continue to enjoy it! Download it, you will love it.",
            "review_score": "1"
        },
        {
            "review_text": "I played Anarchy Online for a very long time (approximately 9 years), until I recently stopped due to lack of new players and content. I have to say that I am quite impressed with rift so far. It is a great game, with tons of new players.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game Reallly",
            "review_score": "1"
        },
        {
            "review_text": "Currently simple the best 'theme-park' MMO out there. You have so many different things to keep you busy, a fantastic soul system which grant you enourmous flexibilty in your specs. Challenging raids(Infernal Dawn is prob. one of the hardest raids being developed in years), and you always know that within 2 months there will be new content. The new Xpack Storm Legion is great, though you must like grinding. The dungeons and raids are fantastic though, Rift is the place to be for raiders .... period",
            "review_score": "1"
        },
        {
            "review_text": "wont even let me pass the loading screen, not worth it in my opinion",
            "review_score": "-1"
        },
        {
            "review_text": "why did i even try this game...",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game. I love the level of detail all over the place. The gameplay is really straight forward. The quests are not in any sort of order so the amount of free roaming is lovely. Leveling is a little bit of a grind. There is a lot to do so, boredom never encroaches on you. You could spend 30 mintes on and feel like you have accomplished something. Fun game overall.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Such a sweet game! I wish i could play it more but skyrim and work currently consumes my life.. skyrims like a black hole just sucks you in.. this game did that too me for a while aswell",
            "review_score": "1"
        },
        {
            "review_text": "Rift is very much like its name. Wherever you travel, little rifts will appear on the map which can be sealed with other people (or yourself depending on your level).  There are also the random attacks on your faction which make the game very realistic, a quest will appear and show you how many attackers you have to kill...etc. I played as a Mage, I'm not sure which one but it was definitely a Mage. This class is outstandingly powerful and the pets tanked very well most of the time. Literally, the only con of this game is the levelling. There are not enough storyline quests which means that as you go through the storyline, the enemies will be at least 2/3 levels ahead of you which can be incredibly annoying.  All in all, 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "The best mmo i have played. It is amazing and is worth playing. the tutorial is a little boring but once you finish it and start doing quests,pvp,acquiring new gear, and join a guild the game can get really fun. You can also go fishing,cooking,etc.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and an in depth mmo, and the best part is that it's free!",
            "review_score": "1"
        },
        {
            "review_text": "Massive character customization, two factions to choose from, three races and many classes, the class system is purely based on your play style as you can select what you want from damage/healer/support etc.  Personally this game to me seemed un-interesting, a typical MMO off the old block, average graphics but a high player base, very similar to World of Warcraft, lots of grinding. The random instance feature is similar to Defiance, which is seemingly made by the same people.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a WoW vet I played this because it has something that Wow doesn't have, playable necromancers.",
            "review_score": "1"
        },
        {
            "review_text": "A more interactive and better version of Runescape.",
            "review_score": "1"
        },
        {
            "review_text": "As a World of Warcraft player that has been playing since Original Closed Beta, I occasionally suffer from WoW burnout. This time, however, I wanted to play something different but similar (if that makes sense!) and after a while, a few people suggested Rift (OK, RIFT) as a good and free alternative.  Downloaded, created my account, and off I went.  Now, obviously this review comes from someone that has NOT played the whole game, has NOT explored every area, does NOT understand every nuance and minor detail of the game. But that said, I love this game to bits.  To be honest, I was expecting something with lots and lots of limits... Free To Play often translates as 'Free to Play for a little while, but to carry on, you HAVE to pay. Oh, and if you want this feature - yeah, cough up' and so on.  But Rift really IS free in almost every single aspect. I didn't begrudge buying some credits and stuff just to throw some money to the developers.  As a lot of people have said, if you like WoW, you will probably like this. I tried as hard as I could to not directly compare it to WoW, but there are a few similarities.   Almost everything of the game is very well done, the areas are pretty, the quest story lines are interesting, plus with all the achievements available (which I often find myself doing) there is lots to do, the developers have done an outstanding job. I see this being played a LOT in my future.  WoW? Not so much.  -Dan Typed with a cat laying across my wrists - so excuse any typos and stuff ;)  And probably most importantly for a lot of people: The Community.  Everyone I've come across is friendly. Nice. Helpful. Questions aren't mocked, they are answered. Granted, you get the odd troll on the general-style channels, and a fair few Russians chatting in their own language, but ignoring these groups is easy enough.  If you need a break from something you've been doing for a long time, then Rift is definetely worth a go. Play for several hours. Take your time. Level as you go. Don't install, play for half an hour and declare it to be crappy. It isn't.",
            "review_score": "1"
        },
        {
            "review_text": "its a fun free to play mmo rpg but i wish they had a bit more enemies to fight  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun alternative to sub-based MMO, highly enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is alright. it passed alot of time. Was entertaining but i suppose id play it again someday. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, tons of freedom and definently better than WoW, a must play on my list.",
            "review_score": "1"
        },
        {
            "review_text": "I've played rift from beta to 7 month after the game release. Stopped after due to missing content. (i'd done all instance T1/T2 and raids)  Back recently after 2 years, Trion really worked on this title and now it's again a pleasure to walk on the world of Telara, lot of content, for any kind of players, many new instances, chronics (1/2 players areas), housing, craft.  If you never played rift, i recommend to try it now, If you're an old player, i recommend to have a look back.  Definitely one of the best F2P game atm (maybe the best).",
            "review_score": "1"
        },
        {
            "review_text": "if you want a gf dont get this",
            "review_score": "1"
        },
        {
            "review_text": "This gaem AT lilly bad it hook ne for years you beat it on the azay",
            "review_score": "1"
        },
        {
            "review_text": "realy fun rpg game!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It has its flaws the group system needs some work done but overall fun to play early game is a bit slow but it picks up",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good and i recomend it to everyone",
            "review_score": "1"
        },
        {
            "review_text": "It is amazing, somethings can be done up but other then that its a really well built game",
            "review_score": "1"
        },
        {
            "review_text": "It's free, so whatever. Best sub-classes are premium content (need to pay to unlock), so that's a downside.",
            "review_score": "1"
        },
        {
            "review_text": "FREE! what could better than that! However if you want to accell in the game you are going to have to pay for some things. If you like WOW you will love this game. It is much easier to understand and play than WOW. there are many quests and new area's to explore. the storylines are good, but some of the questing can become redundant. I prefer this over WOW. Much less frustration and I don't have to pay a monthly subscription to 'go for a virtual walk in the woods'.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Nice, free alternative to WoW",
            "review_score": "1"
        },
        {
            "review_text": "10/10 made me hate games. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Very Good Game.I Love it",
            "review_score": "1"
        },
        {
            "review_text": "You can't beat the game play at this price point! No monthly fee to play. Pay as much or as often as you think Rift is worth.   Enoy!",
            "review_score": "1"
        },
        {
            "review_text": "Okay. Lots of confusion everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "All the MMO elements are in the game. The graphics are pretty decent. Gameplay is top notch. It isn't a Pay-To-Win system. And there are a lot of elements that call for groups, so fairly easy to find a friend/guild if you need one. Mentoring is also nice, allows for the higher level players to help out the lower levels without sacrificing much. Storyline isn't too bad either.",
            "review_score": "1"
        },
        {
            "review_text": "That exactly what i call real F2P no need to pay thousands for expansion or access to certain location You can enjoy every bit of this game without spending any money. I play many MMO but realy must say comfort. This game, I just play comfortably. Only one thing Storm Legion Souls but if you get in that point where you want it you pay without hesitation that 20$ :p",
            "review_score": "1"
        },
        {
            "review_text": "decent game pretty addictive",
            "review_score": "1"
        },
        {
            "review_text": "Great MMORPG, Many different ways of playing the game. Ive spent alot of time on this and its ALL free to play ofcorse you can buy in game store items but it wont affect the game play, most of the Rift store items are just cosmetic items to make your toon look kooler or have a kool looking mount.  I would reconmend this game to anyone who is keen for a good mmorpg",
            "review_score": "1"
        },
        {
            "review_text": "It's a Warcraft clone pure and simple. If you fancy WoW but don't have the cash then RIFT is Free to Play, simple enough to pick up and play MMORPG.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome!! Tons of options to fit your playstyle and fully customizable classes.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic game. I've played a variety or different MMO's but Rift tops the list. It is an aculmination of all the top MMO's best features. Beautiful graphics, seamless group play, mentoring system, traditional 'WoW' combat system, PvP, dungeons and raids. I'm thoroughly enjoying the experience and look forward to the future of this game. Highly reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "This game rocks and should be put as game of the MELLENIA ",
            "review_score": "1"
        },
        {
            "review_text": "great game for free !!",
            "review_score": "1"
        },
        {
            "review_text": "Its an alright game, plenty of quests and big maps with lots of random PvE events happening, which always keeps you engaged. dungeons arent that interesting or that fun. PvP is good fun, plenty of options to get more out of that.  BUT to play it without being frustrated you need to spend $$ on heaps of micro transactions to be comfortable continuing your gameplay.  Combat is very clunky, doesnt feel like your toon is doing anything spectacular.. very linear with spells and abilities that feel like they just dont do anything big, especially in dungeons or large PvE events. Even though there is alot of different spells and abilities to use, its all just not engaging.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, thorughly enjoyable by yourself or with a group, lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "awesome f2p mmorpg out there ",
            "review_score": "1"
        },
        {
            "review_text": "as a hardcore MMORPG player i'm searching for games that is unique for their own style and has an immersive world and great gameplay mechanics and for me Rift has it all",
            "review_score": "1"
        },
        {
            "review_text": "Look a lot like WOW but free to play",
            "review_score": "1"
        },
        {
            "review_text": "if u like world of warcraft and dont want to pay every month then play this amazing game",
            "review_score": "1"
        },
        {
            "review_text": "I like this game",
            "review_score": "1"
        },
        {
            "review_text": "This game I consider a 4/5  Pros: -Many things to do so you can 'never' get bored  -Instant Adventures  -Dungeons  -Rift events  -Chronicles  -Raids  -Warfronts  -Conquest -A lot of customization -'Multispeccing' -Many role's to choose from -Fun level 60 content -PvP is really fun -Cool dungeon mechanics -Getting to level 50/60 feels rewarding Cons: -Terrible lore -Gets boring if you don't have friends playing with you -Very grindfestish if you don't have any clue on how to level up  Overall if you stick through the low level's and get to the high level content it becomes very rewarding!",
            "review_score": "1"
        },
        {
            "review_text": "It's Perfect game of RPG",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game so much, such a good way to blow through time!",
            "review_score": "1"
        },
        {
            "review_text": "very fun game to play you can work together to complete rifts and invasions",
            "review_score": "1"
        },
        {
            "review_text": "Well done F2P transition from sub model. Unlike other F2P games you don't constantly get herded to the cash shop for everything, all cash shop items are fluff. You can buy bags with ingame currency or real money for example.  If you like 'dynamic' events ala Guild Wars or Warhammer, you will like this. Combat is traditional MMO syle, but in a world with constant events.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, a less comical version of WoW",
            "review_score": "1"
        },
        {
            "review_text": "Coming from WoW to this game has been quite the task, there is just enough difference between the game and enough similarities to make it interesting and new",
            "review_score": "1"
        },
        {
            "review_text": "RIFT is a really awesome RPG for anyone who loves quests and a long storyline. Choose your side and fight for what you believe in! Cheesy, I know, but it's the game! Definately reecommended to all fantasy lovers.",
            "review_score": "1"
        },
        {
            "review_text": "This is one MMO that is amazingly fun. Though most MMO games say they are free they competely limit your play style or time in the game. This one does not it gives you access to everything, but instead of having to make you play more to actually get somewhere there are little xp boosts that you can get. Free to play players are not limited at all, its just buying players dont have to spend as much time.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good MMO. Has everything it needs to become successful. Fun classes, plenty of lore, lots of world events, and a good community.",
            "review_score": "1"
        },
        {
            "review_text": "Very easy-to-play MMO that let's you pay for what you want.",
            "review_score": "1"
        },
        {
            "review_text": "If you like WoW, but are put off by the more cartoon-y style, Rift will scratch that itch.",
            "review_score": "1"
        },
        {
            "review_text": "since the dumb-down of WoW I've been looking for another MMO that could satisfy my needs of character customization and flexibility and I must say I am not disappointed at all in rifts. over the years improved alot the character customization is superior to any other MMO currently around, letting you end up with the style of play you really want to adopt. no more silly WoW simplification! pvp is nice and works well with the mercenary system, there isn't a side stronger than the other, and alot of variety in battlegrounds. it misses the extensive lore of WoW sadly, but still in my opinion is the absolute best WoW clone around here, even surpassing the original now.",
            "review_score": "1"
        },
        {
            "review_text": "2k+ hours in it speaks for itself  cheers",
            "review_score": "1"
        },
        {
            "review_text": "This game looks and plays like wow. Theres not a lot of classes to chose from like wow, but the quests arent ridiculously hard and you level up fast so you dont get bored.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best free to play business models,it has a interesring varied character build system.The combat is common tab target mmo fare but at least the animations in combat are impactful.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "Warn you all, install another ♥♥♥♥ing bloatware 'glyph' without any permition as 'update' ...",
            "review_score": "-1"
        },
        {
            "review_text": "I put five hours into this game, then realized it has a ver big pay to win element, which I do not like, but I guess it is to be expected from a 'free' MMO. Overall, the story and gameplay did not hold my interest. In my opinion it could use better writing, as well as smoother gameplay / combat. I don't mean to sound negative, but I'm removing this game from my library. There are too many better alternatives to devote my time to.",
            "review_score": "-1"
        },
        {
            "review_text": "really awesome game, nice story and many more",
            "review_score": "1"
        },
        {
            "review_text": "its a really good game.. there are a lot of F2P MMOs out there tho but it is still fun. Definately worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "There are RIFTs! Good community and great worlds n quests.",
            "review_score": "1"
        },
        {
            "review_text": "been playng this game since the beta and after if went free to play i still am a patron probably one of the most fun mmorpg's i have played. since it is free to play i recommend it for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically the best (in my opinion) MMO. I came to RIFT from WoW, and I'll say... I'm not going back. Leveling is slow, but you can speed it up easily. There are many storylines to follow, so many you almost lose yourself. There are also 2 bonus leveling systems to get at 50, one for PvP, one for both PvP and PvE. And, hey. Free expansions. Not like you have to buy anything to go past level 10 or some other crap. I give it a 9/10. Here's why:  Pros -  1) Guilds, groups, raids are cross-faction (can be a con for some) 2) Massive class diversity 3) Such a custom character creation, you are literally a unique character 4) Graphics are outstanding 5) PvP is intense, balanced, fun 6) Dungeons are amusing 7) Can mentor down to join/help friends (up to 5 levels lower, however) 8) RIFT store is... Amazing. You may have to buy some stuff to unlock FULL functionality (Auction House), but if you really like the game, you will invest the money for Credits, or the platinum for REX  Cons -  1) Not as big as it should be 2) A LOT of currencies to keep track of  That is my review. We need more people in this game, so come! It is an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so, after 70 hours of gameplay all I can say is: THIS IS AWESOME. I mean, i used to play a lot of World of Warcraft, and Im telling you, there's everything and even more in RIFT, and it's FREE to play. Mentoring system allows you to play with your low level friends even, when you're level 55-60 / endgame. Loads of specs for every character, less classes compared to WoW, but definitely that doesn't look that bad.  Pros: +Perfect world, not 2 big, not 2 small. +Mentoring system ! +Loads of specs +RIFTS, INVASIONS ARE AWESOME +Great storyline ( inc. Storm Legion expansion ) +Quite good PvP ( I've heard that it's really bad, but it actually isn't. Warfronts are excatly the same as in WoW ) +There's always something to do, even when you've reached the endgame. Like in every mmo, crafting, pvp, earning money, raids, dungeons etc. helping with leveling a character of your friend ( which is a good idea to invite your friend, you earn some rewards for that and then help him with leveling due to mentoring system ), +Never found myself in a queue to enter the game. +Very good graphic engine +Free to play +You can find useful addons to download over the internet  Cons: -Requirements ( even the best computer will choke at some point ) -Only 4 classes -Buying only additional 4-5 souls ( specs ) is actually quite expensive. About £20 to pay in the in-game store.  -Free to play, but pay 2 win mode. You can buy gear, exp, mounts and loads of other stuff with real money. -Takes only about 90hours maximum to exp your character from level 1 to level 60. Even less with exp vials/patron status.   In summary, i'd recommend this game to anyone who doesn't like to pay monthly for a subscription, who loves to play with friends even if they are new to this game, and you've reached the late game and just dont want to create a new character! And most important, I'd recommend this game to anyone who just LOVES MMORPG. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks! It sucks the life out of me. Played this game until level 33 now and never spend a dime. Visually looks good for an MMO, even though the mission is not that interesting but for a gamer that never plays MMORPG. It really does interest me and keeps me playing everyday. Once you're hooked this game wont let you go. Good job Trion for making me a Rift Junkies. Thumbs up!  Pros: Visually good. Mounts and Pets. Very easy to get into and tons of places to explore.   Cons: Mission not that interesting except for occasional Rift event.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply Awesome",
            "review_score": "1"
        },
        {
            "review_text": "I have played a couple of hours of this game so far and have only experienced a problem with the camera angles, but as this is just due to me not being used to mmorpg's i can't really dock it any points because of that.  all in all this is a solid game that can compete with some of its high cost rivals.",
            "review_score": "1"
        },
        {
            "review_text": "The first time I attempted to play it says I have corrupted files then when it tells me to restore the game from the patcher/ launcher it doesnt show up it should be in the bottom right hand corner but isnt. And because of my terrible internet it takes 5hrs + to download.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great tab target mmo.",
            "review_score": "1"
        },
        {
            "review_text": "got a free cube cape cus i played trove :D 10/10 n/a",
            "review_score": "1"
        },
        {
            "review_text": "The closest you'll get to WoW with out paying Blizzard for a sub.  Great, solid MMO.",
            "review_score": "1"
        },
        {
            "review_text": "The game title is lies. there are no rafts in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Melhor MMORPG do momento (The best MMORPG in present)",
            "review_score": "1"
        },
        {
            "review_text": "it randomly uninstalls itself",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like it too much but I can't stop coming back to it.",
            "review_score": "1"
        },
        {
            "review_text": "If you looking for a great mmorpg that is free to play and doesn't limit you to much when you are a f2p player, then this is the game for you, it has some things that i didnt like about world of warcraft so recently about 2 weeks ago i started playing this game and i enjoy it so much cause of the community, they generally aren't ♥♥♥♥♥♥♥♥♥s like in wow. Just try it out, it doesn't hurt.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those D&amp;D people that don't want to get neverwinter alows you to play while things are still downloding and runs like a charm. Graphics are crisp clean and awesome!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "free to play world of warcraft",
            "review_score": "1"
        },
        {
            "review_text": "RIFT is an awesome and massive game. i definately recomend it to fantasy lovers or anyone that loves a good MMORPG.",
            "review_score": "1"
        },
        {
            "review_text": "Great MMO RPG with lots of items and fun... AND IT'S FREE",
            "review_score": "1"
        },
        {
            "review_text": "good reminds me of wow, and just as addictive. game play is mainly the same, you just have to pay if you want more content to the game. I like the gem buying, it makes it whole lot easier to geta mount earlier than having to battle your way through to collect enough coins for one. The in game battles where anyone can join together to go after baddies during times when the 'rifts' open is great as well. you picck up quests very easily, even without finding the quest giver.",
            "review_score": "1"
        },
        {
            "review_text": "A very entertaining mmo with a ton of content like instant adventures, master mode dungeons, 2 player chronicles, and a Conquest mode for people who like pvp. My favorite part of this game is even if you reach lvl 50 you can still continue to level up and increase your stats while doing whatever your interests are.  Zone invasions are fun when you have dozens of enemies that keep coming and you're trying to defend the place while others complete tasks like taking down footholds or closing rifts. One personal highlight that i had was where it was just me and a tank I solo healed him from a few hard hitting mobs that had to be taken down for the event to progress. A lot of the Invasion bosses are easy but the ones that aren't make you stop doing damage or you end up killing yourself etc.  Overall theres a lot of things I have yet to try out like raids, but this game has a ton of stuff for you to do and with the new expansion coming out it'll be overwhelming.",
            "review_score": "1"
        },
        {
            "review_text": "As far as free to play MMO's go, this one is by far one of the best. Its gret fun to play with friends but what I really like is the way the game lets you group up in the open world to beat off Rift invasions and beat bosses, so its not just a single player quest grind the whole time. It isn't completely necesarry to spend real mony on the game, and even if you want to get some REX without using your steam wallet you can buy it from others selling it on the auction house which is a nice alternative. The game itself looks quite nice and the gameplay is pretty much WoW, which is fine if you are into that, all in all its a good time sink and quite addictive.  If you are itching for a decent mmo definitely gove this one a go.",
            "review_score": "1"
        },
        {
            "review_text": "Great mmo with many, many different things to do and places to see! Seems to have more for less money so really it is a win win game. PvP can sometimes get pretty wonky though.",
            "review_score": "1"
        },
        {
            "review_text": "I am a World of Warcraft Veteran, and I realy enjoy this game so far, I never tought that I will find a game beter then WoW. So far it is beter but I am still a low lvl:) i might change my mind in future hehe",
            "review_score": "1"
        },
        {
            "review_text": "RIFT is absolutely amazing since they have dropped the monthly subscription and gone to FTP. They have changed the game in several ways and fixed many of the core problems. Yes there are microtransactions for things like xp boosts, cosmetic items, and the ususall things. You can also choose to pay a subscription fee to get a plethora of benefits like xp boosts, access to your bank from anywhere, etc, etc. None of the Microtransactions of Sub benefits affect the gameplay in any way that would give somebody an advantage over another player. This is definately not pay to win.  RIFT only has 4 classes, but each of those four classes can be morphed into 20 to 30 different combination of skill trees, which can then be build into a near infinite amount of ways to play the game. Instead of having the standard 7 or 8 classes each with 3 trees, RIFT lets you play your character absolutely any way you can imagine. You can even play a mage that fights melee and tanks! I mean ANYTHING. Almost every other part of the game - Crafting, Questing, Raiding, Dungeons, PVP offer so much more that subscription MMOs do. The amount of things you can do in this game literally blows WoW out of the water, and I'm talking about the old WoW, the good WoW.  There is nothing that should stop you from playing this game, what with it being free. Do yourself a favor and at least play it for the first 10 levels. Even though it's very complex, it presents itself in a way where you can learn the game fairly fast and easy. The game also has a great community. DO PLAY!",
            "review_score": "1"
        },
        {
            "review_text": "amazing awsome dimensions are fun raids battlegrounds no lies really AWSOME!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun MMORPG. It has a lot of unique mechanics that I have not seen on other MMORPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! The new Instant Adventure feature makes this game much more fun to level a new character. The Dimensions feature brings a whole new life and separate aspect to the game itself. The vast number of items and room to build is amazing. Being able to scale your level down to help your friends level up is a great feature you do not see a lot in MMORPGs. HUGE cash shop, but the game is NOT pay to win. I am thoroughly impressed...",
            "review_score": "1"
        },
        {
            "review_text": "Can't even log in to this 'Glyph' ♥♥♥♥♥♥♥t. Why do people make games that don't work?",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, went into it thinking it was just going to be a boring rpg, really did amaze me. easy to get into and learn, i would recommend it to anybody really!",
            "review_score": "1"
        },
        {
            "review_text": "Best MMO out there in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "This game works on linux as well ?? if someone know how can tell me ??  ",
            "review_score": "1"
        },
        {
            "review_text": "I've had a lot of fun with this game a F2P user. Teaming with friends is key, but the quests can be fun if you enjoy reading the background stories. I also enjoy the Rift events that happen at a moments notice and take multiple users working together to end.   You can start with some free in-game items by using this code: K7MYRKRWQEY7YDK6KZN7  Part of the refer-a-friend system. You don't have to buy anything you simply get free stuff and a title.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best F2P MMO on steam",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded Rift two weeks ago, due to curiosity. After being an avid WoW player for the past 8 years, and having the game decline as it did, I began to look for a new MMO. And let me tell you I found it here. Rift is a beautiful game, with great mechanics. There's so many great aspects to the game, such as zone events that bring players together, that don't feel forced in the least, and are just downright fun. PvP is awesome too for as much as I've done of it, WoW's pvp seems rather lackluster, and much more infuriating than Rifts. The community is amazing as well, I was surprised at how helpful a majority of the people come across. Almost always willing to answer questions and aid as best they can. It's a wonderful game, and atmosphere that I've really come to adore in the short time, and would absolutely recommend it for anyone, if you're new to MMO's, an ex-WoW player, someone looking for something casual. It's really suitable for all.  A second aspect is that it's free, and the amount of content you get for it being FREE for the first 50 levels is outstanding. I was a little taken aback at the $5 you need to spend to access the AH, but when you think about it, the one time $5 is much less than a monthly subscription.  All in all it's great fun, great value, and just a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this on and off since closed beta exclusively for the PVP content. Time was you could grind out a full set of top tier PVP items simply by playing PVP Warfronts and Conquest events and as a Patron through the entirety of Storm Legion I had a blast doing it (despite some iffy netcode making for some sketchy ability useage and hitreg).   This game was (and is) a solid choice to scratch your MMO itch, though I've heard tell that as of Nightmare Tide release you can't just PVP grind into top tier PVP gear any more. I cannot confirm or deny this firsthand, but if it turns out to be true I am severely disappointed - especially with the addition of a visible Elo rating system for random Warfront PVP.    That being said I would still give this game a hearty recommendation to anyone interested in a soild MMORPG. GLHF!  Jancith@Seastone",
            "review_score": "1"
        },
        {
            "review_text": "This game is so boring. They pretty much hand you the lower levels. I made 30 so easily. And not from running Instant Adventures or dungeons or whatever. Or even rifts. The world is pretty interesting from the game play left a lot to be desired.   I was not a fan of the community, either. I love MMO's. I love joining guilds and making new friends. And while guilds are all over the place, I tried maybe 5 or 6. No one was interested in getting to know each other or anything. All they wanted to do was grow the guild. Which I get. But I am not sure why any one would want to grow an unwelcoming guild. I wanted to like it. But I just couldn't get over those two things.",
            "review_score": "-1"
        },
        {
            "review_text": "There are abuses in the game that you can use 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good MMORPG, but which need more pvp.",
            "review_score": "1"
        },
        {
            "review_text": "very similar to WoW all i can say..",
            "review_score": "1"
        },
        {
            "review_text": "just terrible, no story, missions are crap and lets face it you have to buy anything cool it actually shows in the pictures of the game",
            "review_score": "-1"
        },
        {
            "review_text": "A wonderful game. I loved playing this all of the freetime I had and it was a great time while playing! The community is usually chatty, there's roleplayers by the taverns, the story is average if you're willing to take the time to read it (I know I didn't! :3) Choose your side of being looked at as a grand Hero of the angels or a grand Hero of science and duke it out with the other side in combat! The game isn't exactly pay to win really as it does give you a chance to become strong if you manage your resources and take everything on in a fun or serious manner. Dungeons that require parties make it so that your role (that you can change at any time!) is needed for the dungeon itself! With that out of the way, you won't have to worry about items becoming 'worn out' or rather becoming those of which are said to expire after 1 day or 1 week unless you bought an experience item.  A problem with the game though, is that although you can go F2P on the whole game, but most of the strongest players are often users who paid for their equipment which gives them a slight (or rather large) advantage over F2P players, which shouldn't really cause any problems unless you're dueling or in a competitive match in PVP.  Overall, I still recommend this game for passing the time with friends and feeling the greatness of adventure that awaits you ahead along the path you choose!",
            "review_score": "1"
        },
        {
            "review_text": "ok so i havent played this game for too long BUT here are my impressions: basicly its WoW with Better mecanics,Graphics and better[ish] comunity and the rift questing is REALY fun in comparison + ITs FREEE!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "After i've played wow , gw2 and swtor I came to give Rift a try , Downloaded , opened , killed one creature , deleted the game , I couldn't stand the gameplay and graphics .",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoy Rift very much but wish it would drop better stuff in Rifts.",
            "review_score": "1"
        },
        {
            "review_text": "Rift is a very unique game game and it isn't a very unique games, just from the very short amount of time I played it, it's essentially the same as all the other mmorpg games like neverwinter, BUT it is also unique in the fact of the rifts that randomly opens. ",
            "review_score": "1"
        },
        {
            "review_text": "Better than WoW for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Don't bother downloading this game from steam. You will have to dowload the entire file again from RIFT. Game looks awesome though so just go to the RIFT website and download it there. I hope this saves people wasting time and data.",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far the best free to play game out there, I would reccomend it to anyone who likes the simple EQ/WOW type game play but with tons of their own features and add ins to make the game a lot differnt, it's worth the download!",
            "review_score": "1"
        },
        {
            "review_text": "i havent played that long but for the time i played it was time well spent. i liked the combat and the worlds were unbelievable and having a entriguing plot and giving no mercy i give this game... time well spent/10",
            "review_score": "1"
        },
        {
            "review_text": "Woulda fixed this review sooner, but I was busy playing Rift.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Extremely bad support ingame, sometimes it takes a week or two to get an answer to your issue and when this happends it's usualy an automated message. The engine of the game is very old, not optimized and also not designed for multicore processors. On top of that, patches come always with problems and the downtime of the servers is quite high. The servers are also laggy, pings are fine, no packet loss but when the load on the servers is high you get alot of imput lag wich leads me to belive the hardware is old or bad optimization on the serverside of the game. There are various other issues I can't cover in a short review but overall feel is that I wouldn't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "If you can't tell by the fact that I have a bajillion hours on record.... I freaking love this game. I mainly play with a friend long distance, and it's a great way to spend time together. We usually let a voice-only skype call run in the background, which really helps. I think the game is much better when played with a freind.   I am astounded at the level of gameplay and graphics. This is the best free-to-play MMORPG I have ever come across. I am so impressed. The freind I play with says it is equal to WOW in quality and content, and although I haven't played world of warcraft, I have watched others play it and from what I have seen I am inclined to agree.   Just play it, and stick with it. You will get the hang of rifts eventually, but until then just wander!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, would recommend to others, and have. Even though it is free, it is a great MMO and doesn't get repetitive. There are also many different pathways you can follow meaning that the variations between players are vast.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game before it was on steam and it was great. And now on steam? Even easier to get!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, an alternate WoW, especially fast Game Masters ofc.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fanatic of MMORPG. This game provides all the thrills.",
            "review_score": "1"
        },
        {
            "review_text": "This game... I started playing it when my buddy started WoW, I chose this one instead because it was F2P. I almost immediately began spending money on it. Level 60 boost was awesome, patron bonuses are handy, and if you're planning on raiding most classes will eventually need both soul packs (mage being the exception, they only need one of them)  That said, every single one of those things can be purchased through in-game currency, oftentimes at a very reasonable price and especially so if you have nice guildmates. Once you hit the level cap you should be able to farm enough plat by doing your dailies, chronicles, and soloing the old 10 and 20 man raids that you won't know what to do with it, and some of the most expensive essence drops in the game are worth twice as much platinum as both soul packs, an instant 60, and 30 days of patron combined. Having a fat wallet or a gift card will certainly be a boon, but it is not necessary at all, and there is plenty of other content to be had here.  The most important thing I want to stress is about the soul system and how incredibly versatile it is. You can choose to be a Warrior, Rogue, Cleric, or Mage, and each of these callings has 9 unique souls. You pick three of those souls to build a Role, which is like your current class. You can have up to 20 Role slots, and they can be swapped on the fly anytime you're not in combat. This means that, in practice, one character has to be able to fulfill the duties of any member of a raid. In WoW, you might roll a DPS character, and all you do is DPS, but in this game literally anyone can DPS, Heal, Tank, OR Support and each different spec of each different calling has its own situational uses. As a mage, the raid requirements of my guild mean you have to be able to play the following specs:  Stormcaller/Necromancer hybrid - DPS Chloromancer - Heals Stormcaller/Archon - Ranged Turret Support/DPS Harbringer/Archon - Melee movement-friendly Support/DPS Stormcaller - AoE DPS  Each one of these has its own priority list, its own nuances, and its own applications. Not to mention that there are two variants on harbringer/archon depending on if you need to purge, and if you need to burn an add down or simply DPS the boss. There is also Stormcaller/Harbringer, which is arguably the fastest and most difficult spec in the game and yet yields incredible numbers. Not to mention Pyromancer if you need good target-swap burst DPS. And you'll notice, I've only mentioned 6 of the souls, and a handful of the ways they can be combined. As continual adjustments and tweaks to gear and abilities are made, new souls and hybrids will become viable, and others obsolete.  This game is very competitive, and if you enjoy learning in-depth skill trees and experimenting with cutting-edge hybrids to min-max your DPS in any situation, you will find all you could ever hope for and more. On the other hand, if you are very casual, there are always guides out there a few weeks after the top guilds discover a new build or when a soul recieves a large buff. Not only that, but you will never be restricted by your choice of character (ugh, im so sick of healing, i guess i better roll a dps toon and start over from level one.... hah!) and you will never have difficulties finding dungeon groups when any mass of five people can fulfill all 4 roles (tank, dps, heal, support) and have one extra dps.  Bottom line is that this game is extremely deep and rewarding at the end game, and I highly recommend it to anyone looking for an MMO to occupy their time.",
            "review_score": "1"
        },
        {
            "review_text": "this game is grate",
            "review_score": "1"
        },
        {
            "review_text": "quintisential mmorpg elements, everything you want and nothing you dont",
            "review_score": "1"
        },
        {
            "review_text": "Great MMO if you're looking for something a little different from the usual rhetoric out there.  Positives:  Customisation of classes - With four overarching class types to choose from, each class has several sub-domains that a player can choose, either utilising premade setups, or by creating their own out of three.  Customisation of roles - Tank, Damage, Healer and Support roles are all available to any of the four main classes, depending on the arrangement of subdomains, providing more creativity and player customisation to individual play styles.  World Events - They're per zone, daily and fun. They can also be challenging and often attract up to 25+ players into one area. Additionally, public grouping is an available (and useful) option.  It's isn't pay to win! Yaaay! - Additionally, mounts and pets are lootable, events offer limited items and hard work will pay off if you're looking to purchase real currency items, given the game's tradeable REX.  And there's more, but I don't really have time to get more detailed right now.  Negatives:  I would love to see more players and more development. Other than that, none really come to mind as of yet.  Overall, I definitely recommend this game. I'm an old WoW/EQ player and have had plenty of experience with other MMOs offered, both F2P and P2P.",
            "review_score": "1"
        },
        {
            "review_text": "Waste of time...",
            "review_score": "-1"
        },
        {
            "review_text": "MMORPG; Very, VERY addictive.... I played it for seven hours without a break.",
            "review_score": "1"
        },
        {
            "review_text": "i dont know why this is in steam. steam will let you download 17Gb of this game only to have a another client called glyph and REdownload again what you have downloaded maybe more. approx. 20.xx Gb. after that, it is stand alone. do you really need 37Gb of data over in just 1 game? i downloaded this on steam but not yet in glyph. and i guess not anymore. havent tried it, looks cool but i just waste my time downloading 20Gb data again. GL to those who made it haha",
            "review_score": "-1"
        },
        {
            "review_text": "If you like community: Play this game If you like fantasy: Play this game If you like fighting: Play this game If you like leadership: Play this game If you like a sense of accomplishment: Play this game If you like killing small creatures: Play this game If you like killing big creatures: Play this game If you like customizing characters: Play this game If you don't like any of these things: Play this game anyway ",
            "review_score": "1"
        },
        {
            "review_text": "Don't play it anymore, and never played it through steam, but I probably put a couple thousand hours into this back a few years ago. I honestly can't say anything bad about it, some of the most fun I've ever had in an MMO (end game, leveling up is a bit of a mostly solo grind). Raids are spectacular, pvp is actually pretty fun, and even normal dungeons have some great detail. It's showing its age a bit now, but I'd definitely recommend checking it out!",
            "review_score": "1"
        },
        {
            "review_text": "I left WoW for RIFT. This game has the best class/soul system I've seen in an MMO allowing you to really customize your roles. They've added tons of content and features. It's got a superior wardrobe system, aoe looting, a smart gear upgrade system for dungeons and pvp, rewards for XP past max level (planar attunement), and the best graphics of any MMO game to date.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for pure enjoyment, exciting gameplay, and never ending possiblities this is the game you want!",
            "review_score": "1"
        },
        {
            "review_text": "I am changing my review to not recommend. Although this was once a great game, due to the changes, PVP is essentially dead for anyone who is not a patron. This game is NOT free to play. You may be able to run around and do quests, but to play BG's you have to pay.",
            "review_score": "-1"
        },
        {
            "review_text": "I was looking for a game to replace the discontinued MMORPG Free Realms and maxing out my levels on Runescape. A friend told me about this game. To be honest I wasn't expecting much, after playing Free Realms for years up until the last hours of its life, my standards for an MMO were pretty high. This game managed to capture my attention and almost immediately I was sucked into it. I haven't been playing long enough for a more detailed review yet. This game reminds me of another great MMO I used to play called Two Moons. The controls are very easy to learn and the macro customization is great as well. The graphics are brilliant and vibrant. (Currently running on dual 2GB nvidia gtx 580m on ultra graphics with no issues). I will continue to update this review as I play longer.",
            "review_score": "1"
        },
        {
            "review_text": "Best F2P MMORPG out today. Great class customization. Nice graphics. It's basically WoW done right. PVP is kinda bad.",
            "review_score": "1"
        },
        {
            "review_text": "I can say I liked the game a lot back in the days of it's monthly subscription model. Now anytime I try to go back, I get overwhelmed by all these 'buy with real money' options and not just that. I thinks there's just too many of basically everything for a new player (or a returning player after quite long time) to absorb it all and get along with it. Just, nah, the f2p (p2w?) model ruined just about everything I liked about the game. It used to be a really worthy substitute if you suffered WoW-like games addiction but was really fed up with WoW itself, not anymore. *launching WoW*",
            "review_score": "-1"
        },
        {
            "review_text": "I definately liked this game ALOT better than Warcraft. A little poorly optimised at the time I was active in the game. Can be pay-to-win if you're intent on keeping up with the Jones's, otherwise nice not have to pay any monthly sub fee. I finally quit playing due to the drama that MMO's always seem to have.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun and madly addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun, lots to do. Ever get board of battle grounds or dungens? Well might as well raid towns and cities in open world! Raids are fun and interesting. constantly updating to make players happy and a very friendly community. PvP is a little bit unbalanced like most MMO but this one u can still do good with ♥♥♥♥ gear just need skill and if u have good gear and u suck you may get wrecked easily by under geared folks.  Pros: Free PvP styles are interesting Different character customizations Many different souls(specs) to choose from, can have more than specs just got to switch through them(gotta buy from trainer for more specs) Cool mounts Open World PvP is more fun than you would think Personally I think the lore is quite good  Cons:  there are many grind quests where you just kill things over and over. gets repetitive and boring On PvP worlds lvl 65s will camp the captial and kill you and outside quest givers. Some classes can be unbalanced (Ex. Fire mages seem to do the most dmg lower lvl pvp and can 2 hit you or 1 hit crit you) 1 healer can outlast 3 dudes attacking him for quite a while(unless you save your silences for the right moment)",
            "review_score": "1"
        },
        {
            "review_text": "good grind, many customisation also nice graphics for a mmo",
            "review_score": "1"
        },
        {
            "review_text": "The world is very big and loads of downloads before you can play it smooth. Not for slow Internets",
            "review_score": "1"
        },
        {
            "review_text": "Unlike most MMO's where when you solo you're left feeling that you're just waiting around for people to show up, with Rift you really can stand alone. I can't recommend this game highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "yeah, good game, community is mostly helpful, and its FTP ( fun/free to play ), what more do you want. ",
            "review_score": "1"
        },
        {
            "review_text": "wow clone with better graphics and more choice when it comes to building your class,awesome housing system 'Dimensions' where you can build pretty much what ever you want",
            "review_score": "1"
        }
    ]
}