{
    "app_id": 391270,
    "name": "Fingerbones",
    "release_date": "2015-08-03",
    "developer": [
        "David Szymanski"
    ],
    "publisher": [
        "David Szymanski"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Horror",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 2377,
    "negative_ratings": 633,
    "price": 0.0,
    "description": "A short psychological horror game that focuses on storytelling and mystery, where you explore a mysterious abandoned building and find notes that paint a disturbing picture. Please read description before playing.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391270/header.jpg?t=1547324344",
    "minimum_requirements": "OS: Windows XP or Higher Processor: Intel i3 or equivalent Graphics: AMD 6870 or equivalent DirectX: Version 9.0 Storage: 80 MB available space Additional Notes: Any computer capable of running typical Unity games should be able to run Fingerbones without any trouble.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I am a horror fan. I do not like jump scares. Being scared has nothing to do with horror. Horror is something you build up. It never goes away. Horror stays! So what about Fingerbones? Well... this is really a very interesting horror game. I mean it is disturbing. But it has a story to tell, and the story is unraveled in a good way.  This game is not for everyone though. There are people that will dislike it. Either because of the stoy or of the whole setting. I will recommend this, but beware. This is an adult plus game and it is really disturbing in many ways.",
            "review_score": "1"
        },
        {
            "review_text": "Great short free game. Very short, like less than 20 minutes but extremely thick atmosphere and psychological gore.  This proves how a game doesn't need extremely good graphics or to be long or even to have a price, for it to be worth playing. In a way, the lack of graphical elements (just like in a book) allow you to build your own scenery and missing elements with your imagination.  Great little gem.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, I get the implications here and all, I think, though I had to look up to check because it's a little vague. And I get the atmosphere. But the slow walking pace combined with having to go back and forth so many times just took me out of this. It's free and it's mildly interesting but as a game in the traditional sense it could benefit from better design. But yeah no reason not to check it out, it's short and it's free etc. Just don't expect to be blown away by it.",
            "review_score": "-1"
        },
        {
            "review_text": "When I played this game  I lost my virginity",
            "review_score": "1"
        },
        {
            "review_text": "A Horror game that doesn't rely on any jumpscares whatsoever, just pure psychological horror.   It might be short, but it's quite a twisted ride. Will definitely not play this again, but it's worth a playthrough. There's some great use of lighting here and the atmosphere is phenomenal to say the least.   Overall the elements blend really well together and did I mention it's free? Great game.   ",
            "review_score": "1"
        },
        {
            "review_text": "Fingerbones is the next title from the same developer as The Moon Sliver, but will you want to play this ?  In Fingerbones we play as a man that walks around a basement and tries to relive past memories ( I will not go into further detail for the plot because that would spoil the entire game).  Gameplay is simple. All you do is walk around and pick up notes and solve a couple of puzzles. It's really simple stuff, but if you do play the game it will be for the story.  Graphics are simple pixel horror style, but use different lighting effects which gives the game a really awesome look. Now some of the item models look a bit weird it's still a really good looking game.  Audio is fantastic. The audio will make you feel like you're not alone and it's just really well done. The music is really good to, but there's not much of it.  The game has really simple level design so I doubt anyone would get stuck in this game. There's not much more to say about it.  The game is really short. It took me 15 minutes to finish the entire thing and I loved every second of it. Apart from the one playthrough you will do there's not much replay value.  I didn't encounter any bugs what so ever. The game ran smoothly and I highly doubt that anyone would have problems playing it.  Overall Fingerbones is a really good indie horror game. Now I wouldn't say it's better than Moon Sliver, but it's still really good. I highly suggest playing through it at least once. I give Fingerbones a 8/10  For more reviews follow Snort's Review curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "Not much of a game to speak of. Mostly collecting notes and figuring out passwords to a computer. About 15-20 minutes long but a very, VERY disturbing and well written story that delves into dark concepts such as human morality and social constructs of what is right or wrong. Very well done and totally worth well over the asking price (free). Worth a play if you enjoy reading the notes of those that came before you in horror games (Until Dawn comes to mind)",
            "review_score": "1"
        },
        {
            "review_text": "Shocking interactive short story.  Seriously, less than half an hour. And sick. No gore, but psychologically.  There are 4 passwords you need to puzzle out, and only a faint audio clue after you enter them to show that you got them right. If you have trouble with the third one, a hint:   it's backwards  .  It's free, and a tiny download. Go try it. (Well, unless you don't want to horrified. Please don't try it in that case.)",
            "review_score": "1"
        },
        {
            "review_text": "A 20min penumbra-style game, where you read notes scattered around rooms to find clues to progress. There is too much back tracking, map design is an absolute bare minimum, and game mechanic is lacking.  Fingerbones is a hit or miss.",
            "review_score": "-1"
        },
        {
            "review_text": "The title and the warning in the blurb give away what little this game has to offer. The only remaining question as you begin is whose finger bones are featured in the game as a result of the one act anyone would think to warn you about in a horror game. And so from the very first text in this game it's apparent what has happened.  I could maybe defend this decision if the rest of the game were an exercise in cold dread. Instead it's a collection of adventure game tropes. You will plod around a small set of rooms, receiving passwords for free by clicking on little notes.  At one point it may appear that the game has left something to your imagination. If you want to salvage some value from the time you invested, this is when you should leave the building. In fact just about any early exit from the game will leave you with lingering questions more interesting than the hamhanded ending and its inappropriate, childish epilogue.",
            "review_score": "-1"
        },
        {
            "review_text": "Fingerbones is abstract and narrative-driven. It focuses on the events taking place in the life of a husband and father that has lived through an apocalyptic event and the personal philosophies that drive him after the fact. The puzzle mechanics are very simple (looking around your environment for clues that hint at passwords to open doors) and exist to expand on his narrative as he goes. It's very short, but filled with a subtle sense of dread as the story unfolds and you get a better idea as to what's going on in his head. If you like psychological horror and philosphies on the nature of morality, rationality and society, you'll enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Fingerbones is an interesting game. The atmosphere created with sounds and beautiful lighting is something to truly admire. It's not exactly a scary game but it's creepy as hell. The story is simple but engaging and the way it's told is a lot like the in Amnesia... just... more simple. For such a short game, Fingerbones is an amazing experience!",
            "review_score": "1"
        },
        {
            "review_text": "Not very impressed. The character isn't believable at all. The existance of the notes explaining all his secret codes don't make any sense. Why would he invest so much in a conveluted passcode locking system if he's just gonna write down the codes to all his stuff and leave it around the house. It doesn't seem very consistent with his character. A character that seems so set on portraying himself as someone all about hard science and rationality.  The only suspense you get is from the cheap sound effects of a girl breathing, and sounding scared. But the sounds don't even correlate to anything that actually exists in the game.   The notes are the only real content here, and they're pretty laughable. The character just rambles on and on about some social darwinist crap. Doesn't really make a lot of sense. None of it sounds like something a real human would write.  If you want a good quick slice of pychological horror, go play The Static Speaks My Name. It's free as well.",
            "review_score": "-1"
        },
        {
            "review_text": "A very dark and interesting horror game. Though the concept of walking around gathering scattered notes or messages isn't exactly original, the developer managed to make it so by incorporating a dark, disturbing psychological/philosophical aspect to it. I definately wouldn't recommend this game if your sensitive to violent or disturbing content. This game deals with some pretty mature stuff. (after playing I had to look at pictures of lol cats for like an hour just to cheer myself back up lol) Even though it's a pretty short and simple game, I would still recommend it if your a fan of the more dark and subtle qualities of horror.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the art, gameplay, and setting, but the story ultimately felt like a big middle finger pointed at me. My only consolation is that humanity has hopefully gone extinct in this universe.  There's an alternate ending that I invented which is much better than the real ending so I changed my review to positive. Then I came back and changed it to negative again a few months later, because I would not recommend this game to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "well i'm never having children",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the half hour or so to play. This guy is a master of ambience. If you haven't, go play The Music Machine and The Moon Sliver, especially if you liked this small bit.",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game for a psycho-horror-thriller. Don't get me wrong, but once I finished it, I felt physically sick. I recorded the gameplay too so this should be fun.",
            "review_score": "1"
        },
        {
            "review_text": "To start this off... Wow, it was NOT what i was expecting when hit play on this game. I am not familiar with horror games, and this had me on the edge of my seat, the intensity, atmosphere and 'story' i say it lightly because there is a few plot holes, but while playing this, i experienced many emotions, suspense, fear, disgust, confusion and anxiety, there may be more but right now that's all i got, this game is great, it's VERY short but it played so well, the ending had me reading the last piece of paper as fast as i could, before the wave of confusion hit and i laughed. It's a mind ♥♥♥♥ but also a suspense builder, i wont spoil anything, but the ending i didn't expect, find out for yourself ;)",
            "review_score": "1"
        },
        {
            "review_text": "I am at a loss for words.  Please note that there are some mature themes in this game...  BUT AN ABSOLUTE YES.",
            "review_score": "1"
        },
        {
            "review_text": "For something simple and short, this is the game for you. For me, the horror factor was hardly anything, but do remember that it's an early indie horror game and is FREE to play! If they keep going on this path, they sure will be able to deliver quite some awesome games in the future...I hope...because there is great potential. For now, the price is right! ;)",
            "review_score": "1"
        },
        {
            "review_text": "Horrifying on a primal level. It's free and won't take you more than 10-20 minutes to complete. Consider it an interactive short story, rather than a game.",
            "review_score": "1"
        },
        {
            "review_text": "Man rapes and kills his daughter after an apocolypse.   10/10  would get spooked by noises and music again.",
            "review_score": "1"
        },
        {
            "review_text": "This story is horrifying because there's a certain ring of truth to it. Even without the mercy of a post-apocalyptic scenario, the narrative being told here is one we've all seen before, and disturbingly enough, will likely see again.  Although the passwords and back-and-forth make for weird story pacing, the dank, thick, claustrophobic atmosphere made this storyline hair-raising anyway. This really isn't your typical narrative of a man with an already broken moral compass being thrown into a survival scenario, which is what I went in expecting. I wasn't prepared for the tale that I was told, and that makes this memorable. Coming away from it, I'm left unsettled and in need of a shower, and although I dread what I'll find, I'm kinda looking forward to seeing the other titles this developer has created.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very deep and demented story but, the concept behind the whole game itself is just fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Fingerbones creates a tense, claustrophobic world that exists solely to disturb gamers. With each note I read, I felt guilt and dread for the implications of that note. I also enjoyed puzzling out some of these notes in order to move on to the next area. Gamers will have to backtrack at times, and while this can get annoying, it also builds suspense. It is a short game, which is kind of a bummer, but at the same time I think it's length is suitable. Highly recommended for gamers who enjoy a short, twisted story and don't mind a bit of backtracking and puzzling.",
            "review_score": "1"
        },
        {
            "review_text": "Fingerbones is a very thought-provoking and atmospheric game that takes only 20 to 30 minutes to complete. The music (more like atmospheric noise) is very well-done and compliments the visuals nicely. I highly recommend playing through it at least once as it is very original compared to most of today's games where the objectives are clearly defined and pointed out and because it is free and very short so there is no reason to not play it.",
            "review_score": "1"
        },
        {
            "review_text": "My balls itch.",
            "review_score": "1"
        },
        {
            "review_text": "Taking into consideration that this is a first effort and taking into account that it was a free, small download, I will say this: the ending was unsatisfying. The story is told by simply reading notes, but there aren't many, and the ending is abrupt. This game could have been improved by working with a writer who might have been able to spice things up a bit.   I am giving it a 'recommend' but with the giant caveat of the above. If you want a free tiny tidbit of atmosphere, whith a vague and disturbing story, go for it--as long as you know you might be left hungry after this particular meal.",
            "review_score": "1"
        },
        {
            "review_text": "This game did a great job at the 'simple-yet-spooky' atmosphere. While it's not overtly scary (haters of jumpscares, fear not - no pun intended), it does build a wonderful sense of unsettledness (is that a word?) and the plot is disturbing at best. At the end I was left feeling creeped out and disconcerted, which is exactly what I want out of a simple atmospheric game.  Since the game is free and only takes about 20-30 minutes to complete, I'd say it's well worth it. The only things you need are some free time and the imagination to read between the lines and fill in the blanks from the notes you find. If you are, like me, a fan of being able to really THINK about a story, you should love this. (On the flipside, however, if you are the type that likes your story explicity delivered to you word-by-word, you might not be appreciative of this story.)  If you liked The Moon Sliver, you'll probably like this one as well. If you haven't played The Moon Sliver and have enjoyed this one, I would go pick it up for a couple bucks; it's longer with more depth and is from the same developer. He seems to do a good job putting his players into the psychological blender, and I'm looking forward to playing more from him.",
            "review_score": "1"
        },
        {
            "review_text": "Less horror, more wtf did I just experience. Honestly, given the mere 10-20 minutes of 'gameplay' required to finish the story, to say more would defeat the purpose of even playing it.  Well, at least it was free.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very, very short and no scared.",
            "review_score": "-1"
        },
        {
            "review_text": "If You are stupid like me you will not beat Fingerbones the puzzles in it are to hard for me and i the character moves slower than a snail, a very boring game at the start but you do get a creepy feeling, the damn puzzles are horrible if you get it wrong because you have to spend about 5 min going back and forth from the computer to wherever you want to go 3/10 would not play again",
            "review_score": "-1"
        },
        {
            "review_text": "wasn't really scary and no jump scares but really interesting.  10/10 always love to hear children scream",
            "review_score": "1"
        },
        {
            "review_text": "A very concise, straight to the point little psychological adventure. The graphics are nothing to brag about, but the atmosphere, sound, and story kept me looking over my shoulder as I played it alone in my house. Time well spent.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell did I just play?",
            "review_score": "-1"
        },
        {
            "review_text": "It's an interesting premise and setup, but way too short and anticlimactic. The philosophical point makes sense since the creator's trying to suggest that all these beliefs are a bad way to live your life, but there just isn't enough punch in the end to drive home the point. To be fair, once the flashlight starts flickering, the game does start to get a little freaky, but a little is all it gets.  My advice would be to include a new game+ mode where based on your discovery at the end, you can play the game differently to reach another ending.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a really good game too keep you looking for clues this game was the first real horror game that i have played that actually got me thinking so great job at creating theis i would recomend you get this because theres no harm in trying it is there it is free. 10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "i loved this game yes its short but it was fun and i liked the sounds for a free game it was good",
            "review_score": "1"
        },
        {
            "review_text": "This was really good. I didn't know what to expect as I was going in, and when I did I was not disappointed. I wasn't aware the story was going to be as chilling as it was. Highly recommended if you're looking for a good creepy game to play in one sitting.",
            "review_score": "1"
        },
        {
            "review_text": "Took me about 13 minutes to complete, but it was both free, and is classified as a short story. It definatly is a better psycological horror then most I've played. I enjoy horror, especially psycological horror. The graphics aren't bad, but some people don't like Pixel art. It does require a LOT of backtracking when you contrast with how short the game is. I would love to see a sequal which is a lot longer, or a similar title. The story is nice and detailed, but not too much so it leaves a bit to the imagination. This indie dev has a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "OMFG... this game has you thinking from the start to end. It is not a typical horror game with jump scares or creature chasing you. It scares you mentally. Best god damn horror game I have played in my life.",
            "review_score": "1"
        },
        {
            "review_text": "Sloth walking simulator  In reality it is a ok story, pretty short even for a short game. If they let you walk normal speed you could get done in 10 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad for a free to play game. This game really did its job as a story teller using game as a medium for conveying psychological horror. As for its development, a mere 74 mb size is impressive, evident in the universal textures. 4/5",
            "review_score": "1"
        },
        {
            "review_text": "He must have enjoyed his last supper.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game the story got me , even though it was short i was waiting for am MASSIVE jumpscare because it has a great build up !!!",
            "review_score": "1"
        },
        {
            "review_text": "Heard a scream, and nearly quit game.  10/10 would nearly quit again  Honestly though, you won't think the game is scary at all till the very end... don't worry, there's no jumpscares/screamers. If you have 30 minutes and like narrative, try it out! It's great.",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet, like a fun sized candy bar. You end up thoroughly enjoying it, but feel unsatisfied and want more, certainly worth your time however.",
            "review_score": "1"
        },
        {
            "review_text": "OH BOY JIMMY WHAT ARE WE HAVING FOR LUNCH?    oh nothing.....well......your daughter.",
            "review_score": "1"
        },
        {
            "review_text": "*Spoiler alert at the bottom* this game restored faith of horror and mystery games all in one.. beautiful sun rays , but why minecraft kind of textures ? idk i felt hyped all the way from up to down the cellar ..thinking something will popup and scare me ! would definetly look up for a second game of this .. maybe the father digs her body up ? and would definetly recommend this game .. it's free .. and has a nice story...  SPOILER ALERT&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;nothing will popup at ANY time of the game ... the flashlight dies and he sits waiting there ...",
            "review_score": "1"
        },
        {
            "review_text": "easy game i completed it in 20 minutes or less",
            "review_score": "1"
        },
        {
            "review_text": "What the heck did I just experience.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Now this was not a bad game it was pretty good  Pros Con It was suspenseful it was to short pretty good story  alright gameplay  and a not bad puzzle sequence   thats really what i think about this game i just am disappointed that it was pretty short  if you play the game right it would literally take 20 min  but if it werent for those puzzle sequence and the story i would have never had put in hour into this game i give this game a  8.5/10  good job developers for teasing me hopefully you will make another title like this one and hopefully longer",
            "review_score": "1"
        },
        {
            "review_text": "preety good when you in sad mood :D",
            "review_score": "1"
        },
        {
            "review_text": "It's not too bad, aside from treating you like an idiot with all the backtracking, point A to point B and back, over and over. It's one of those so called 'Walking simulators', because you don't really do anything, just walk from room to room reading notes, and learning more and more about the story of this game. It's rather short, you can finish it in 10-40 minutes, depends on how fast you figure out how to get through the puzzles. (More like finding secret words in random notes).  It's not really scary to be honest, but it's disturbing, in a way. I'd recommend it, if you want some fun for 30 minutes or so. Plus, it's free. If you don't like reading, atmospheric games, and you only expect jumpscares, this game is NOT for you.",
            "review_score": "1"
        },
        {
            "review_text": "If the world was my ♥♥♥, then this game is out of this world.",
            "review_score": "-1"
        },
        {
            "review_text": "Great story 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "What just happened? I'm very confused, nice music tho.",
            "review_score": "-1"
        },
        {
            "review_text": "After the curiosity vanishes, this 'game' reveals itself:   poor design, 1 location .. bad location, bad objects and 3d modelling, no textures (and if you find they look like minecraft), but worst of everything, no good enigmas, no good plot, no good interaction.  They are poor, they are all the same, and the story itself is as stupid as the game try to be.  What are you doing here? Well, two good things are to admit: you can download this in very small time because they are just 35 mb of data, and it's free, so..  Lord Hol Napult's experience: 2/10 Now go get a real game... go get Anesthesia",
            "review_score": "-1"
        },
        {
            "review_text": "I don't feel like having children anytime soon...  This game is very, very short but... oh boy the feeling of BLOOD running cold all over your body when it ends is the feeling this game promises to give and achieved Its delivery very well. Totally recommended",
            "review_score": "1"
        },
        {
            "review_text": "This game is way too easy. I beat this game in like 4 minutes with the walkthrough. The only reason people like this game is becuase fnaf got boring and they need another game with literally 4 buttons to hold them over. gg this game is garbage and i want my 5 minutes back. 0/10 but still wouldnt play league of legends over this.",
            "review_score": "-1"
        },
        {
            "review_text": "seemed like an awesome game at the start i even thought he ♥♥♥♥♥ his own daughter but it ends like so quick and well what the ♥♥♥♥ hes got a finger fetish",
            "review_score": "-1"
        },
        {
            "review_text": "It was fine. But very obvious, very simple, and very easy. Nothing too interesting happening at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Sick and twisted.",
            "review_score": "-1"
        },
        {
            "review_text": "Very short pretty sick story about a dad that rapes his daughter and eats her and has sex with animals!",
            "review_score": "-1"
        },
        {
            "review_text": "cant find the dumb code",
            "review_score": "-1"
        },
        {
            "review_text": "Story was simple and horrific. I would suggest this game to anyone.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "What in the f*ck did you just have me play.  No, really, what. In. The. Actual. F*CK.  I finish this in fifteen minutes, I went from being mildly curious, to disgusted, to creeped out, and then disgusted and creeped out at the same time. Eugh, I feel... dirty after playing this.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT THE FLIPPITY ♥♥♥♥!?!?!?!?",
            "review_score": "1"
        },
        {
            "review_text": "Near cried when I entered the Celler. Spookier than Outlast.",
            "review_score": "1"
        },
        {
            "review_text": "the exit door works",
            "review_score": "1"
        },
        {
            "review_text": "When I first say this I though it would be the usual jumps scares, but it wasn't and I loved every second of it.   Truely a master piece with an ending that gave me a great amount of chills   11/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended. A quick 15-20 minutes of ... well ... dread. Doesn't use cheap jump scares instead relies heavily on atmosphere and definitely delivers. It's free, it's small, it's quick ... with a more than apropriate payoff. Given the subject it touches on I would definitely recommend this to adults only.",
            "review_score": "1"
        },
        {
            "review_text": "that kinda fun, A lot of thinking ! good game nice story !  10/10",
            "review_score": "1"
        },
        {
            "review_text": "absof***inglutely worth the download and playthrough, at least once. Not much makes my stomach turn, but some of the thoughts this game conjured, made me want to find a bucket.",
            "review_score": "1"
        },
        {
            "review_text": "While I don't normally post reviews, after playing this game I just couldn't resist. It is a shame I did not know of this game until today, since psychological horror is one of my favorite genre of media. Fingerbones takes hold of your mind and messes with your intuition from the very beginning. The music, sounds, and the atmosphere give an immersive feel while you are trapped in this little world. The lighting is beautiful and the more pixelated graphics give an unnerving feel to the world. The storytelling is told through notes you find and leaves you asking 'why', but that is one of the strong points to a game of this genre. Moral questions are weighed in interesting ways that make you think and digest the story afterward. The concept of why we have emotions and if we even need them in society, or how mankind is just another lifeform that has the sole job to reproduce in order to survive. While there are no jumpscares(except for the generator that I turned on without having a flashlight which made me jump out of my skin from the noise), the atmosphere and how the story pans out makes you inticipate a jumpscare. The story is not 'for the faint of heart' so to say, but don't be a wuss. In conclusion, I would say the story and atmosphere are very well done and captures your attention throughout. Fingerbones definately diserves 20 minutes of your time, as well as the extra time you will spend afterward pondering what you have just played. 8/10  TL;DR: Crazy father that is breaking bad takes his daughter to his survival shelter and has a teaparty with her then reflects on his scientific ideals through reading notes. You will learn about fingerbones. 2spooky4me",
            "review_score": "1"
        },
        {
            "review_text": "No jumpscares but when I heard that b*ch crying I pressed Alt-F4 in an instant  10/10 would ♥♥♥♥ myself from sound effects again",
            "review_score": "1"
        },
        {
            "review_text": "Every word you read makes you more afraid to keep going, but also makes you want to go deeper. If you have 10-30 extra minutes in your day give this game a spin.",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you need to fill the time gap when you order pizza.",
            "review_score": "1"
        },
        {
            "review_text": "Short, takes about 20 minutes. Puzzles are easily solved but the story goes from a depressing one to a disturbing one rather quickly.   Its neat for being free and a little performance art peice.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant short and free atmosferic (?) first person game which uses exploration and a little puzzle solving to unravel the disturbing story of what happened in that place. Although it's short, it's well worth it. The only annoying thing was some backtracking.",
            "review_score": "1"
        },
        {
            "review_text": "It was short, but fun, it was pretty for rectangles. The walk speed was meh, but whatever.",
            "review_score": "1"
        },
        {
            "review_text": "This game was fantastic. Even though it has no scares, it left me quivering in my pants. I loved this game, and its free, so go ♥♥♥♥ yourself if you're too scared to play ;)",
            "review_score": "1"
        },
        {
            "review_text": "This Gamae gave me the chills, i've done a video on it for youtube. i realy enjoyed it. Its very unsettling but thats what makes it good. its a very Deep game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game, I thought it had potential,which in a way it does, but it doesn't. You walked slower, than slow, It was kindof creepy, I thought there would be a mirro and I'd be some creepy ♥♥♥ zombie. I LOVE horror games, I'm always seeking for a thrill. The storyline could have been better and the passwords could have been harder. I don't understand, we were hearing a little girl whimpering, but we never got the chance to meet her and she was already dead since we went back for one last time to the cellar and the died there. So that makes 0 sense to me. There were *lots* [well not really], items that we could have been able to interact with, such as the books, the random knifes, the blood, etc. I rate this game 1.5/5 for the ones that are experienced in horror games and seek the thrill of being scared. I rate this game 3/5 for people who have no clue what they're into, and literally never played a horror game.  If the game is still in development, there are some ways you can make it scarrier for future players.",
            "review_score": "1"
        },
        {
            "review_text": "Rather than scary its sad, But i enjoyed the 15 minutes of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks... I really don't get why people even like this. It's a 10 minute tedious game, nothing happens. It's trash.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing Story, Hit me hard at the end of it. Loved it 100%",
            "review_score": "-1"
        },
        {
            "review_text": "7/10 too much atmosphere",
            "review_score": "1"
        },
        {
            "review_text": "it is a good game and effort was put into it but... it is a slow moving game and i got stuck a lot and it was not genuanly scary.",
            "review_score": "-1"
        },
        {
            "review_text": "Fingerbones is a point and click adventure game. It is not a good point and click adventure game.",
            "review_score": "-1"
        },
        {
            "review_text": "Short but very effective, and at this price there's no way it wouldn't be a great value.  Some might see the writing or the visuals as dry, but it is definitely in accordance with the story the game is telling.  It goes without saying that because of the theme, as well as its nature (storytelling indie experiment) this game might not be aimed at and to the taste of every player. But I played a number of things it could be compared with, sometimes with bigger ambitions, and few of them were as flawless in their execution, or as successful in what they were trying to achieve.  This game may seem like not much, and not everyone might agree with my opinion. It may not be groundbreakingly innovative either. But it is one of the most clever and least pretentious things I've seen in a while.  The sound design is near perfect, too.",
            "review_score": "1"
        },
        {
            "review_text": "What the actual ♥♥♥♥ was that? IT just ended like nothing even happened it was like a short story that I wrote and had to read to myself. Please for the love of god do not make a sequel, BUT if you do, call it Toebones.",
            "review_score": "-1"
        },
        {
            "review_text": "One of thoes games where im still confuzed at the end 9/10 for free 30 min game. Worth the uneasy feeling the entire playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting take on a 'Horror' game. The audio and visuals are top notch (simple, and fitting). The story is definitely haunting, and the fact that you have been part of the telling makes it hit home just a bit harder. This game is not for everyone. However, I do think it can be added to the list of games that can be viewed as art. Very disturbing art... but art nonetheless. I look forward to seeing what else the developer has coming, and I am thankful for the fresh take on what a scary game can really be.",
            "review_score": "1"
        },
        {
            "review_text": "It's more of a creepy story &amp; only takes 10 minutes maximum to finish, there would be no need to ever play this game, ever again once you're done, but the story may stick with you.  I didn't hate it, I didn't love it.  10/10 for the exit door. ",
            "review_score": "1"
        },
        {
            "review_text": "Great one-off game. Play it alone when it's dark - nice and creepy &gt;:)",
            "review_score": "1"
        },
        {
            "review_text": "I like horror games, so naturally I couldn't pass up on this one, since it's even free. I think it was an okay game. I did think the last two passwords were kind of hard to figure out. Maybe I am just being a derp though. There are no jumpscares, which is obviously not needed in a horror game when it has a good creepy atomosphere, but I always find jumpscares amusing. The thing that mainly gets me on edge in horror games is when you're being chased , and fortunately that didn't happen either in this game. The story the game tells in the form of notes you find is alright, it's definitely disturbing so that's good, though I still don't understand some things. At any rate, this game was definitely worth my time, it was interesting, had a good horror atmosphere, and it's free, so there's no harm in checking it out.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest I don't really know where to begin, the only purpose is reading notes and getting to the cellar through easy passcodes. It takes hardly 20 minutes to complete with nothing really extra to find if you spend even more time. It's pointless, not really fulfilling, but I'll let you decide when you play it. It does a monotomus environment pretty well though.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how to feel. Should I call this a game? It has a goal, it's interactive, and it has puzzles. It's just incredibly short, and it feels like an interactive story more than a game. It's not scary, but you definitely get creeped out as you read each note. You know this can't end well, but you wonder how it will end.   It's a free game, and I enjoyed it for the, what, 10 minutes I played? I'd have to say I liked it.",
            "review_score": "1"
        },
        {
            "review_text": "great atmosphere",
            "review_score": "1"
        },
        {
            "review_text": "So basically lets cut to the chase, amazing atmosphere with the dim lighting and over all heavy feeling you get through out the whole game, graphics nothing special but i think its purposely like that (pixelated adds to atmosphere). Pretty creepy when you get down to it and you find out what really happened in the abandoned building. This is great because it doesn't rely on jumpscares or creepy noises (though there is one scream). SPOILERS: so at the end you find out that your character is a likes to do things like dismantle bodies for his daughter dies in the basement and he cuts of her fingers (hence the name), and apparently didn't like her since he compares her to his ex-wife which is probably why he let his daughter starve to death and threw the corpse in the woods. No replay value because of how short it is.",
            "review_score": "1"
        },
        {
            "review_text": "very interesting, short, psychological horror game, both writing and ending are sub-par at best and can be a little computer intensive but definetly worth the 30 minutes of your time",
            "review_score": "1"
        },
        {
            "review_text": "great game for such a small amount of play time.",
            "review_score": "1"
        },
        {
            "review_text": "Fingerbones is a short game, yet it achieves the psychological horror it set out to accomplish. This game won't give you cheap jumpscares, wont place eerie otherwordly creatures in your path or abandon you in the middle of a haunted forest (those seem to be all the rage in most horror games), but it will unsettle you and it will make sure you still feel chills running down your spine even after the game ends.  The theme it deals with isn't scary per se but rather it is a subject that most people prefer not to mention and would rather ignore. To this purpose the developer of the game places several letters around the environment you'll explore, slowly unravelling the disturbing narrative that will surely leave you creeped out.  The controls are very simple and the download time is very short, plus it's free, so if you have some time I would recommend giving this game a go.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my goodness, I'm a psycopath",
            "review_score": "1"
        },
        {
            "review_text": "Short and extremely good psychological horror. The atmosphere in Fingerbones was crafted rather masterfully and It had immensely disturbing effect on me.  9/10 The atmosphere...",
            "review_score": "1"
        },
        {
            "review_text": "Too short and not scary.",
            "review_score": "-1"
        },
        {
            "review_text": "Fingerbones has a great atmosphere, and its story is philosophical and interesting (although not mind-blowingly original). The lighting is good, and the puzzles are fine. The story was just dark enough, and the game managed to scare me without being 'cheap' about it.  It's also really short, and the gameplay itself is not interesting or deep. Still, I think Fingerbones is well worth the download.",
            "review_score": "1"
        },
        {
            "review_text": "Disturbing Little story and amazing sound effects",
            "review_score": "1"
        },
        {
            "review_text": "Just saying, The way this protagonist acts as if science has no socially acceptable morality kept me very curious if whoever wrote this had issue with science. Probably just because I've been looking around at stupid religious arguments that without religion there's no moral, but this was completely that. Either way, It felt to me that this game actually had slight intent of brainwashing people into thinking people with scientificly literate minds would turn into someone like that, and it's deffinately not the case. But yes. Unsettling.",
            "review_score": "-1"
        },
        {
            "review_text": "To sum it up:  A 3D visual novel, with the only gameplay being walking back and forth between basement and computer, trying to guess passwords to unlock more of the basement area.  The most exciting part in the game is reading the notes strewn about the tiny game world - and the occasional sound you might hear.  There's not even much to look at, really; the room you start in is yellow, the basement is dark and gray.  The plot is your typical   'guy gets insane as a result of isolation (more or less, despite having his daughter around) and does unspeakable things to her'    You'll have more of a hard time trying to figure out those passwords than enjoying the gameworld, the atmosphere or the plot.  Hell, turning on the computer is what took me the most time!  And then of course there's the very short play time, which - given what the game has to offer - is not worth going through.",
            "review_score": "-1"
        },
        {
            "review_text": "I love games with a story behind them. This? This was dark and slightly terrifying.  There's not much if any action, and no run button so you have to walk all over the place, but you are basically in some kind of apocalpyse after zombies have happened (or maybe it's all in this man's head? Could be!)  It gets really triggery, so warnings on that one.  It was pretty interesting, the ending was okay, but yeah.",
            "review_score": "1"
        },
        {
            "review_text": "  Looking past it's price and simplistic looks. its value lies in its atmosphere and narrative as described.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly...just skip this one....",
            "review_score": "-1"
        },
        {
            "review_text": "Very great game. Perfect short game for Halloween. Best part: Relies on atmosphere to scare you rather than cheap jumpscares.",
            "review_score": "1"
        },
        {
            "review_text": "I can't say I enjoyed this. There's not much of a story and what little there is, is just boring to me. The subject matter mostly revolvs around eays tropes, half-baked philosophy, and shock value. I found the things I uncovered neither surprising nor interesting. I can't be more specific without spoiling the game. If I listed the general themes it would basically tell the whole story.  Apart from that the game has annoying technical issues. It is really easy to accidentally quit the game. I did this twice and had to play the whole thing again. I also accidentally skiped the ending before I could read everything but didn't feel it was worth replaying again.   All I really wanted from this game was something to pass the time when I was bored. I wasn't expecting a masterpiece but I didn't want to end up more bored and frustraited than I already was either.",
            "review_score": "-1"
        },
        {
            "review_text": "My friends and I had to take turns because we were too freaked out. 10/10 would not play again would recommend",
            "review_score": "1"
        },
        {
            "review_text": "Creepy story and interesting couple puzzles. Something a bit longer I understand is available and I will certainly be looking forward to it. A great introduction to the creator. Thank You",
            "review_score": "1"
        },
        {
            "review_text": "I LOST MY VIRGINITY AT 15",
            "review_score": "1"
        },
        {
            "review_text": "Short and interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Short game with a very good story 10/10",
            "review_score": "1"
        },
        {
            "review_text": "PLAY THIS GAME! Fingerbones is a great, short, game that is based on a deep story. It is free so why not check it out. enjoyed this game, and i am going to play it again late tonight late tonight to get more scared that the first time. The atmosphere is also great!",
            "review_score": "1"
        },
        {
            "review_text": "It sometimes is confusing to find the passwords, but other than that an overal great game. Do recommend trying it out.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very atmospheric, can scare you without relying on jump scares. Intriguing story with a sweet twist.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not totally sure how to feel about this title. The atmosphere certainly was creepy, and I really appreciated that there were no jump scares, especially because the feeling was executed so well. I kept expecting something to pop out that I needed to react to, but instead I just kept getting more and more tense. That being said, I didn't really get all that tense by the end of it. Maybe this says more about me than the game, but I knew exactly what you discover in the end from the first note. That left the rest of my playtime as just letting the atmosphere get to me while I read some notes that told me more about what I thought was a fairly predictable ending. There was only really one note that made me think 'oh no, it can't possilby mean that...' but I got over it pretty quickly. I finished it in about 12 minutes, which is why I'm recommending it; paired with being free, there's not really much point in not playing because you're wasting neither money nor very much time to experience it. It left me thinking 'meh' after I finished, but If you're not used to psychological horror stories like this, you should be sufficiently creeped out.",
            "review_score": "1"
        },
        {
            "review_text": "This game definitly suprised me, like holy crap this game is creepy. the music/sound effects are spot on, and the simply mystery of the place seemed completly and horribly dismal.   10/10 would be freaked to move forward again",
            "review_score": "1"
        },
        {
            "review_text": "I think this game did more in 20 minutes than most games do in 20 hours. It was a very quick game, but very rewarding. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "really got in your head, and the story came together in a cleaver way",
            "review_score": "1"
        },
        {
            "review_text": "Short, meaningful.",
            "review_score": "1"
        },
        {
            "review_text": "psychological horror for a five year old, nothing about this scared me besides the ♥♥♥♥ing generator.  TL:DR Walk around reading papers",
            "review_score": "-1"
        },
        {
            "review_text": "This game although it was short was kind of good and makes you draw up a number of various possibilities as to whats actually happening.  *Spoiler* -hover if you wish- viewer discression advised    Did the Dad force himself on his daughter? Did he have her for the weekend and take her down and kill her slowly? Did he force himself on her then kill her and dispose of the body and now his psycho episode is making him hear the sounds of her? Lots of questions to ask yourself  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the few horror games I havve played that I have actually liked. It is an extremely short game, but quality over quantity. I would reccomend this game to anyone who enjoys story-rich games and a constant chill throughout.",
            "review_score": "1"
        },
        {
            "review_text": "A horror game of the highest tier. I will not say anymore about the game, as going into it without any sort of knowledge about it is the best way to experience it. This game won't take much time to complete, and it's worth it (especially since it's free). If you're tired of the bland jump scare ridden horror games; then this is a game that will surely chill you to the bone.",
            "review_score": "1"
        },
        {
            "review_text": "Short. Spooky. No jumpscares. Made my friend ♥♥♥♥♥♥. 12/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "This is what happens when Freddy from Freddy got fingered grows up 10/10",
            "review_score": "1"
        },
        {
            "review_text": "From a person who can't stand scary things, this got me good. There was no jump-scares. Completely story driven, and boy is this thing psychologically scary. I finished it in about 30min playtime. This game is partly puzzle, as to figure out what to do.",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing and, though it was short, it was very well paced and had my heart racing quite a bit. And no jumpscares! :D (I hate jumpscares) I definitely recommend it to someone who needs to kill a good 20 minutes or so...",
            "review_score": "1"
        },
        {
            "review_text": "OK.....total ♥♥♥♥♥♥♥t and nobody gives you back your wasted time with this...",
            "review_score": "-1"
        },
        {
            "review_text": "Talk about a disturbing little game. Eerie, makes you think, and unique. Very well done.  If you want to ruin your day in the best and most thoughtful way possible, then this is a good story to spend half and hour on.",
            "review_score": "1"
        },
        {
            "review_text": "A very intriguing little project with a delightfully dark atmosphere. At the vey least...thought provoking.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good. Short, but good.",
            "review_score": "1"
        },
        {
            "review_text": "gimme da spooks btw can you add a sprint button?",
            "review_score": "1"
        },
        {
            "review_text": "OMG guys if you are a this game was probably the best atmoshpere chilling i have ever played. I totally recommend it, since it will take you about like a half an hour to finish the game.  I r8 8/8 M8 :D",
            "review_score": "1"
        },
        {
            "review_text": "nice game, at some point made me scared and it had a good ending....  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I kind of feel bad downvoting a free game that only takes 20 minutes. It's not bad or buggy, it's just not really worth the 20 minutes. The 'story' was pretty much obvious from the first note and the fact that you know it's a horror game. The 20 minutes of gameplay is really 1 minute of reading notes and 19 of trying to click everywhere and figuring out you have to use the same keyboard 4 times to open all the doors. Again, not a bad game but there are much more entertaining ways to waste 20 minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "It took me twenty minutes and had me apprehensive almost the whole way through. It has simple graphics and focuses on building atmosphere/character. I'd say it's worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "cool game you should play it mane totally scary",
            "review_score": "1"
        },
        {
            "review_text": "It may be short but Fingerbones leaves a strong, emotional impact on you after it's all over. With the game being free, that's enough to warrant a recommendation in my opinion.   There's not much to talk about with the gameplay. It's just WASD (move around) and interact with objects with the click of a mouse. (Not significantly different from Serena, another free short game.) This game is about exploration and reading scattered texts to unravel a dark mystery as well as learning about the former, celler-inhabitant's psyche. The only true game elements are the clues you must gather and decipher to unlock the doors and progress.  No monsters and no cheap jump scares exist to startle you. Fingerbones scares you on a deeper level in both your heart and your head. I personally found it so disturbing because the story felt so human...and so real. And this kind of horror, that which echos with reality, tends to stick with you long after.   With that said, I'm not going to pretend this is a masterpiece. It's only 20 minutes long and perhaps it could've been something grand with more time, development and depth. But as short as it was, I truly think the the developer did a sastisfying job with it.   Note: to get the most out of this short game, you must fully read the texts. Don't just skim for clues.",
            "review_score": "1"
        },
        {
            "review_text": "Its free, touches upon an uncomfortable subject and is worth 20 mins of your life.",
            "review_score": "1"
        },
        {
            "review_text": "There are shows on the Crime &amp; Investigation channel which will satisfy you if you're looking for a mild flinch.",
            "review_score": "-1"
        },
        {
            "review_text": "In terms of atmosphere and story, bravo man, very well done. Though dark, the story was great, and portrays the primal instincts of a man detatched from social life and wished for it all to be gone. It took me a bit to figure out what all the passwords were (my common sense and rational thinking was not that great this time around haha) but I managed. If you're looking to pass the time with something intense but not scary, and want something within a reasonable time to complete, this is a good game for that. Keep it up!",
            "review_score": "1"
        },
        {
            "review_text": "It was short game that wasn't too bad for how big the game file was intrigueing story but can be finished inonly 15 - 20 minutes something to do to pass the time",
            "review_score": "1"
        },
        {
            "review_text": "wow that was quite intense, im not sure if its from the heat in my country right now or is it form this game that my hands started to sweat so much it made a tiny puddle on my desk.",
            "review_score": "1"
        },
        {
            "review_text": "For a Horror game that has no jumpscares I must say my heart was racing the entire time. It gives you a feeling of death because as you read on there seems to be no one in the world besides you. And for someone who doesn't like the idea of being alone (even more so when you're in an spooky house) this game really gets me.   It is honestly a really creepy game. I would love to seem more stuff like this. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I really am not into horror and this is basically the first game of this genre I played. And the only terrifying things were the sounds (e.g. breathing) in the beginning. No jump scared or creepy creatures coming out of any corner. And for the trigger warning: the warning alone got my thoughts going into directions they wouldn't have gone into without the warning tbh. It was a really short game (less than half an hour). The riddles were easy. So for me it was perfect, since I usually avoid the horror theme.",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty ♥♥♥♥ed up, short and did I forget ♥♥♥♥ed up...  It is not for the light hearted or me, but it does make you wonder are some people really like this. It does not go right out and say all the deeds he has done but you sould be able to read between the lines. Its not very scary if at all (was main reason I wanted to play). What is it is very dark and disturbing. It takes 10 to 20 minutes to beat and it has a decent story(♥♥♥♥ed up but decent) and its free. I cant say it was bad just not for me, so give it a go if you like the darker side of things. ",
            "review_score": "1"
        },
        {
            "review_text": "I hate new horror games, they have too much jumpscares and other stupid stuff like that.. this game, instead, is beautiful, even if it's short. 100% recommended",
            "review_score": "1"
        },
        {
            "review_text": "I am one of the younger fans of horror this game if you tend to not read all the notes will take you forever i played it in 12-13 mins. The story ends so perfectly it makes me worry how i would react in the some situation sadly the scary part of the game is the sound in the background making you sort of paranoid this works perfectly to make you wonder why everything is happing and it makes you alittle on edge. They said the story was a 'disturbing tale' i would say diffrent this tale has been used in many horror moves or games it is not as disturbing as the first time i seen a story line. It hit the true mark of disturbing though it was used very well but i could have seen many diffrent endings to make this a better game but I think that fingerbones is a must play though this game you sorta learn why the story is called finerbones and I would have loved the story to have a bit more depth. Even know the story has a little depth you only find out this man has LOTS of passwords and hes mentally unstable we dont even find out things like his 'name' or his 'age' you can make an educated guess on his age and id like to think that they did have a name for this man as every one but him you learn about has a name but no ages were said the whole way though this game. (Im sorry for any spelling mistakes or missing grammar)   i would say this is a good game but it lacks depth in the story its a good game if you let your mind add all the bits they did not but when they make more horror game i do hope they do not lack dept",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Great build up to suspense - No jump scares (I HATE THAT!)  Cons: - Clues aren't intuitive - Game is too short",
            "review_score": "1"
        },
        {
            "review_text": "This is true Fear, not a 3 second animation of a chuckey cheese robot and a loud noise. this is enviormental story telling at its greatest. The puzzles are very logical and not too hard. the ambiance was so amazing it had me reluctant to press that w button. im deffinatly playing this guy's other games!",
            "review_score": "1"
        },
        {
            "review_text": "If you need horror in a flash, this is for you. If you want a real deep experience or jump scares, this is not for you.",
            "review_score": "1"
        },
        {
            "review_text": "plz stop breathing into my ears thx",
            "review_score": "1"
        },
        {
            "review_text": "Huaufha HAFuadhud.... Incest",
            "review_score": "1"
        },
        {
            "review_text": "Good atmosphere, but the unoriginal story ruined it for me. I can't call it 'disturbing' so much as 'icky', and honestly it just wasn't written very well. Also, the   everyone-gets-torture-happy-in-a-bunker   trope is really getting old.  Gold star for the sound editing though.",
            "review_score": "-1"
        },
        {
            "review_text": "Great idea, some poor design decisions really hinder this game though  Notably, 1. Going up the stairs after going down is very frustrating, you move at a snails pace, I thought maybe this was a decision but I'm leaning more towards it's something in the character controller as it gives that 'pushing through' feeling that box colliders in Unity will often give if the controller isn't accounting for something. Maybe not casting enough rays or something, allowing the character's collider to move into the surfaces temporarily and move through like in 'sludge'  2. The sound of 'errrrt' when you enter a correct password is initially... confusing. This seems like the noise it should make when you incorrectly enter something, as incorrectly entering something yields no noise.  3. I very much enjoyed the soundtrack and how it was done by having tones placed throughout the environment as actual audio emitters, allowing you to control the soundtrack in a sense. However I noticed that some of these samples gave a clicking/popping sound when repeating. That's a sign of the sample not being perfectly seamless or not restarting at the proper point (if it is)  It could be great, but the clicking noise to me was very grating from the soundtrack. The sound of the generator was also a bit grating and too loud in my opinion. Moving slowly by it felt painful wearing headphones. I am leaning both ways on this one. For someone who is into this style of game I'd tell them to play through it as it gives insight into a few great things to do in this genre, but there's also a few things that very much bothered me. For someone new to the genre I would definitely not recommend this, as I feel it could leave a sour taste in their mouth. Kairo seemed to have a similar atmosphere but was MUCH better in its execution.",
            "review_score": "-1"
        },
        {
            "review_text": "The game tells a short but disturbing vignette. Worthwhile for the story, but warning: the pace is slow, very slow. Presumably, this is on purpose, but it may drag for some nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly a great horror game. There's no jump scares, the closest you get would be noises that occasionally happen after reading a note. And said notes reveal a messed up, kinda tragic story. This game does exactly what it means to, and does it well.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not even going to lie, I was terrified through out the entire game. I had no idea as to what to expect and holy, that was scary in itself, not knowing.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like I missed something here. The other reviews made me imagine a haunting game with a good story.  The game I played was walking back and forth from room to room in order to open a new door. The in-game story was very bare, and the only things which had a scary effect to it, were the lack of lighting and random ambient noises.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is different from any other kind of horror you will see in movies, games or books. So if you didn't find it 'scary', I guess you need to learn more text interpretation.   Well, the game is amazing, with a lot of Philosofic thoughts. This game isn't scary, but a lot disturbing. The game basics works in just walking and reading the notes and solving some puzzles (there's a unique puzzle that involves in discovering the password to open certain doors), but those things doesn't really care, the main objective of the game is to tell you the history and discover what happened.  You can finish the game in something like 10 minutes, but you will need to play twice or more times to interpret it in the right way and see how sick is the hidden history, or you will interpret it in the wrong way and complain writing a Negative Review saying this game isn't to spooky and writing about the password system.  If you love history games, and gameplay doesn't count, this game is totaly for you. Otherwise you can play some other 'Horror' game more cliche that comes a new one every week *cof* Fnaf *cof*.  Sorry for my bad english  ",
            "review_score": "1"
        },
        {
            "review_text": "this really got me ♥♥♥♥ed up",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Spooky all the way through.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the game. It brought up some points on morality and such which can be interesting to the right people. It was relatively predictable and slow, but for a 20-30 minute game that's free-to-play, it does quite well. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I am only 12 years old when i played this. It Kinda freaked me out. But I am Not Terrified. I think kids can play this but the weak of hearted shouldn't. THis game was great!",
            "review_score": "1"
        },
        {
            "review_text": "wow 10/10 very entertaining for $0",
            "review_score": "1"
        },
        {
            "review_text": "good but short af",
            "review_score": "1"
        },
        {
            "review_text": "That was one of the scariest games I've ever played, without anything actually happening...",
            "review_score": "1"
        },
        {
            "review_text": "A nice, creepy, unnerving short story. I completed it in about 15 mintues and was very impressed with the feelings this game invoked in me during game play. Had I not read the over view from the author I would have expected some gore / jump scares in this tite. That being said, It speaks a lot to this games ability to set a tone with out using over the top methods.  For being what it is 10/10 I look forward to other titles from this author",
            "review_score": "1"
        },
        {
            "review_text": "This game, Fingerbones, is quite good for a horror game. Too many horror game developers think that if there is a jumpscare, that means that their product is good. NO, that is exactly what is wrong with a lot of horror games that come out. Jumpscares are a nice aspect of horror in general, but only if done right, not some cheap face popping up. This developer did the whole horror feel very well. He did not use jumpscares in this game, he used well thought small scares to give the player chills. I feel that any horror developer should take some knowledge from this game, and put it into thier own work. The ending was quite good as well. The twisted ending made for a good 'what?!' before the game was over. This title is also quite short, as stated when you start the game. This is not bad at all, though. It was very straightforward and could be completed easily in a short time span without losing any quality.  Overall, I would rate this game an 8/10. It did horror like it was meant to be.",
            "review_score": "1"
        },
        {
            "review_text": "It's at least worth a try -- it costs nothing, and is only around 30 minutes long.  I hope that the developer will improve upon this and continue to make games in the future, there's clearly some potential here.",
            "review_score": "1"
        },
        {
            "review_text": "Good fun game but a litlle short, very basic but i like that!",
            "review_score": "1"
        },
        {
            "review_text": "Fingerbones is an exellent game that immerses you into it, even if it only lasts about twenty minutes(Which it does). The game is about the story of a family that lived in a bunker during the apocolapse. Your objective: find clues to peice together the mystery. The game has great atmoshpere and can make you scared at times, which it probably will, as it did to me. However, your character moves very slow and the game requires lots of backtracking to complete. I do not recommend this game to impatient players, but for everyone else, I strongly recommend this game.  Side note: This is the kind of game that you only play once, as it does not have much, if any, replayability. Do not go into this game and expect multiple endings and branching storylines.",
            "review_score": "1"
        },
        {
            "review_text": "I want more.",
            "review_score": "1"
        },
        {
            "review_text": "Im v upsetti spaghetti, this game made me wast to pee all over myself(not in a good way) i really want it to be longer more plot plz",
            "review_score": "-1"
        },
        {
            "review_text": "How to play Fingerbones, a guide by Aaron:  Step one: Download Fingerbones. Step two: Get about half way through, and think 'I really hope this isn't going where I think it's going.' Step three: Finish Fingerbones, read end sequence. Step four: Feel absolutely horrible. Step five: Delete local content, never touch again. Step six: Reccomend to friends.  There it is. You beat the game, let's hope you don't hyper empathize to the point of self loathing.   It's well written, and sounds absolutely wonderful. Atmosphere done far, far more than correctly.",
            "review_score": "1"
        },
        {
            "review_text": "Good experiance, Not horror by any means but it's fun to try. And remember your goal isn't to finish the game it's to know wth has happend and find freedom",
            "review_score": "1"
        },
        {
            "review_text": "This game made my skin crawl, but good game overall",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and it leaves me wanting more.",
            "review_score": "1"
        },
        {
            "review_text": "Movement is a bit clunky, and I get bored of things easy because I think too much; but I got through this one no problem, was a beautifully written story that painted a terrible picture. I liked the atmosphere too, it is not a crysis two type graphics but it isn't for that.  If you don't like games for itself not for it's looks then this game is for you.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric,even with not that good textures, was still very good to look at. The gameplay and puzzles were fantasitic with good FPS. Great eeiry story with great spooky ending. Great spine chilling background sound effects as I'm navigating the quests a must play game that is is very cheap [0$!] I give 4 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Fingerbones, is a free game on steam... obviously. This is obviously meant to be a horror game, and I have to say it does it's job pretty well at some points. Some critics might like this because this is more physcological horror like in games such as Silent hill 2. But the tension doesn't build up to that point, I would say.   Puzzles are relativly simple and easy, didn't take that long for me to figure that out. To be honest there really isn't that much to do in this game, just walk and find notes of the dude's daughter really boring actually. Also a word of advice have a sprint or 'walk faster' button the game can get really boring and dull, it can really kill the subtley and pacing in the game.   But there is a bigger issue in the game, there are no jump scares. Now you might have lost all seriousness at this point, but I am serious, what is the point of building all that tension if nothing jumps out at you? Now you did a fantastic job on atmosphere, a little dull on pacing, but what's the point of building all that tension up for nothing? Now this might be one of your first games and I can understand that, that's why I am giving you this review.   My advice have jumpscares in this game, but don't make them as preditcable as most indie games. MAKE THEM UNPREDICTABLE. But like I explained it is kind of worthless to have all that tension build up for nothing, because this game didn't scare me, good story, nice atmosphere just nothing to really be scared at.   But hey I'm just a guy on the internet so I don't know anything. But this is a lot better then the poor excuses for indie 'horror' games, like 'evil' or 'the room' so over all I still really enjoyed it, a lot better then other indie games.   Overall score: 75/100   ",
            "review_score": "1"
        },
        {
            "review_text": "This game has a beautiful OST and story, the entire atmosphere having an eerie feeling to it... one of the best story-driven horror games I have ever played",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you want to kill yourself.......",
            "review_score": "1"
        },
        {
            "review_text": "Absolutly stunning game- gave me chills and spooks you to the bone. Well done.",
            "review_score": "1"
        },
        {
            "review_text": "It's a psychological horror alright, you discover the truth piece by piece, realise halfway through just who you are and then... well just play and see.",
            "review_score": "1"
        },
        {
            "review_text": "Never expected that. Beautiful game. Definitely acheives the sense of uneasiness needed in psychological horror. Well done.",
            "review_score": "1"
        },
        {
            "review_text": "takes only half an hour, nice mood. Paints very fast a dark picture of a world. stops. don't expect too much.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome but a bit confusing when you have to get the codes right",
            "review_score": "1"
        },
        {
            "review_text": "I put yes because its an ok short game if you're bored and need 20 mins to burn. Character walks slow so yeah gonna take a while if you dont know the passwords already.",
            "review_score": "1"
        },
        {
            "review_text": " Fingerbones is a free game and I appreciate that.  Still i would not recommend playing it simply because I didn't enjoy it too much. If there was a guy handing out free tshirts with only one arm I wouldn't recommend you getting any either - because I don't think you'd enjoy them (except if you only got one arm obviously).  Why didn't I enjoy playing Fingerbones? 1) Walking is much too slow.   Yeah, I know at the end it makes sense since the dude is starving.   This is a pain in the ♥♥♥ especially since   you have to go back to the keyboard all the time  . 2) I didn't find   the flashlight   but was able to use it later on anyway. 3) I was able to guess   the last password that opens the latch to the cellar   just from finding   the note on the chair in the second room  . I didn't even mean to be a smartass, I just thought this was the way the game wanted me to solve the second puzzle. Some might argue this contributes to the concept of a free world, but it pretty much made me miss the whole plot (I read a walkthrough later making me realize I this.) so it has to be be considered a huge design flaw. The game tells a linear story that can't be altered. Being able to take a shortcut makes one miss out on the story. That's not a good thing. Why isn't the game designed in a way that makes (accidentally) taking a shortcut impossible?   Two soluitons to my problem just off the top of my head: Cellar latch isn't in the second room or can't be opened until the last page is found.   4) Just from the items on the table in the middle of the first room it was pretty easy to guess   the guy physically abused and killed his daughter for reasons of insanity  . 5) The story itself (even without missing most of it) is pretty dull:   Guy comes back to his bunker where he and his daughter seemingly survived some kind of catastrophe that wiped out most of humanity. He rediscovers the story of their life in the bunker by reading notes, seemingly from a diary. (Why didn't he remember his story anyway? How did he forget his passwords? Playing as someone else investigating what happened there would have made much more sense.) This story reveals he has/had some kind of mental disorder (identified as depression by the game. Not being an expert on psychopathology I would rather guess something in the spectrum of Schizophrenia.) making him think it would be a good idea to act purely practical, develop strange egocentric, pseudophilosophic and nihilistic views and let out his anger, frustration and sexual urges on his daughter. The exact storyline is a little blurry: Either a) his daughter dies from the abuse and he completely loses it thinking to abolish human nature and reestablishing some sort of primitive law of survival means freedom (extremely typical 2deep4u-♥♥♥♥), or b) he looses it and then kills his daughter because he abolished humanity and needs to let out his anger/sexual frustration. Oh yeah, also he was afraid of his daughter eating his food. Another good reason to kill her. Maybe he also ate her? No, we learn from the last page we find that he threw her body in the woods. Shouldn't he have eaten her since he abolished humanity long ago? Not so practical afterall, huh? Anyway, he kept her fingerbones as a symbol of sorts to his liberation. (Why those? Makes no sense? Yeah, but who cares!) At some point after that he got out of his bunker, survived a little, felt the need to return, got controlled by the player and upon dying in the cellar of his bunker, right next to where his daughter died, despite still hearing her screams found a feeling of freedom and peace (2deep4u again).    If I missed or misinterpreted any of the story please feel free to comment and tell me so.  6) The riddles were ridiculous. Just finding all the   notes and reading them   is enough. I understand they're the game's way of  forcing guiding one through the story, but just making them that easy is a great waste of potential. The concept also fails as stated in 3).  I was happy there weren't any jumpscares though. Thanks a lot for that. Even though I got screamed at by the guy's daughter a little (ambient noise) I'm happy the designer didn't take that road trying to enhance his game by putting in random shockers. Working with suspense is often better than giving away too much.  Thanks again to the developer for releasing this game for free. It killed some time and made me write a review. Even though I didn't like it too much it is far from bad for a first game made entirely by one person.",
            "review_score": "-1"
        },
        {
            "review_text": "Well that was boring",
            "review_score": "-1"
        },
        {
            "review_text": "A nice little spook to occupy fifteen minutes of your time. The story was interesting, though the back and forth gameplay could have been improved if you weren't forced to casually stroll everywhere.",
            "review_score": "1"
        },
        {
            "review_text": "It's free, so you have nothing to lose. A surprisingly chilling narrative game, Fingerbones is minimalist in every sense of the word. The great dark ambient soundtrack compliments the simplistic graphical style - a style that at no point diminishes the narrative weight of the piece. It has to be said though, I'm not sure that it's a formula that could be extended. FIngerbones is a very short game, but if it were any longer, repetition would surely set in.   Honestly, this is miles ahead of all of the 'horror' nonsense that is squelched through Greenlight these days, and better yet, it costs not a penny!",
            "review_score": "1"
        },
        {
            "review_text": "I love psychological horror games and this is a great example. It was so disturbing, the story unrevealing itself was great and it definately creeped me out. My only thing I would like is the game to be longer, its just who I am, but overall its a great game",
            "review_score": "1"
        },
        {
            "review_text": "Kept expecting Jump Scares, which never came, which made it more scary! Yelled at the scary noises and such out of suspense and terror! Roommates now think I'm crazy!  10/10 would lose mind again!",
            "review_score": "1"
        },
        {
            "review_text": "While the game is only around 20 minutes, it is a good ambient horror puzzle game. Deep( and frankly, sad) story that is kind of sad to watch unfold before you, as your character slowly unfolds into insanity.",
            "review_score": "1"
        },
        {
            "review_text": "Short (developed purposefully so), but built with quality atomosphere. Doesn't need fancy graphics or crazy jump scares to petrify you... the story's primeval/savage nature suffices. I was on edge the whole game, and the closer I crept to the end permeated dread within me.  ",
            "review_score": "1"
        },
        {
            "review_text": "Simple and straight to the point. No unnecessary quirks or over the top rubbish. This game delivers exactly what it intends to: an atmosphere, a puzzle and a story. Nothing more, nothing less.  20 minutes well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Slow and then all at once",
            "review_score": "1"
        },
        {
            "review_text": "10/10 psychological experience",
            "review_score": "1"
        },
        {
            "review_text": "Good god this was a dark game. Every time you open a door, you're terrified not because you're expecting any kind of mortal danger, but because you dread what more you'll find out about the story. Absolutely worth my while.  The one and only criticism I have is also a tip I have for players: when you enter the wrong password on the computer, you will hear NOTHING. If you hear what sounds like a 'wrong password' sound, that actually means you got it right. That was really confusing. ",
            "review_score": "1"
        },
        {
            "review_text": "I played it because I was looking for a free, scary, non jumpscares, game. In the end I was like 'What. The. ****' I don't like the kind of games that make you use your 'Imagination' at the end. Obviously DURING the game yes, but at the end I like closure. It also ends pretty abruptly. I regret playing it because of how disturbing it is. Maybe I'm just weak, but I can't imagine why anyone would enjoy this kind of story (I did read that it was disturbing, but I was expecting something else. I guess I deserved it)... Also, I didn't understand the third password. Every password was easy except that one.",
            "review_score": "-1"
        },
        {
            "review_text": "A very short and disconcerting game. It could use a bit more substance. It's a bit too vague for some people to understand. It is a great game to build up though if the creators wanted.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This is some ♥♥♥♥ed up ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Rarely ever write reviews (especially negative ones), so unfortunately....here's mine. As described, very short game. If you enjoy wandering around a basement, reading a bunch of creepy notes and have 20 mins to kill, then give it a try (it is free after all). I personally feel it was predictable and could have had a better ending, I figured it out after reading the 2nd note.  ***Spoilers*** Felt it would have been slightly better if her ghost appeared (flickered for a moment) in the last room, instead of hearing her scream.",
            "review_score": "-1"
        },
        {
            "review_text": "simple and creepy",
            "review_score": "1"
        },
        {
            "review_text": "A psicologically supense story rather then horror, however, very well done. I hope the creator of this comes up with something new and intriguin like this. Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Underwhelming. I don't know why I expect anything from this game. Basically you walk around, collect notes indicate password to unlock doors. And you read notes to put together the story. Pretty standard and solid structure right? Alright. Story is shallow and boring. On top of all that, it's fairly short. ",
            "review_score": "-1"
        },
        {
            "review_text": "A game about discovering what terrible things a very unpleasant man did when not constrained by society. Spoiler warning: he did what many violent, misogynistic men before him have, and hurt a vulnerable female under his power. Which is not at all a shock, if you're  also  female. It's cheap and it's trite, and it's not a shock. Stories about men who hurt women are too familiar to surprise. They're just another confirmation of the mundane horror we're too numb to feel much about.   ",
            "review_score": "-1"
        },
        {
            "review_text": "There are no scares in this game besides the creepy music, there is a build up in scareness and then it gets lost quickly, but it does have a nice story to it",
            "review_score": "-1"
        },
        {
            "review_text": "  Creepy liitle puzzle walker with a ton of atmosphere. Doesn't take long - even within the small universe there's room to make it a bit more complex and engaging. Good for a freebie.",
            "review_score": "1"
        },
        {
            "review_text": "Played it a while ago,reviewing it now. Don't remember it all that well, left a good impression though",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, eloquently simple and disturbing. Keep up the good work!",
            "review_score": "1"
        },
        {
            "review_text": "Spent the first 17 minutes mistaking the next door for the exit door.  magical doors /10",
            "review_score": "1"
        },
        {
            "review_text": "For a free game, this is a nice atmospheric experience. Took me 15 minutes to finish. Worth a try if you're looking for a way to curb your puzzle solving horror craving (it reminds me of Penumbra in terms of atmosphere, although it is much different).",
            "review_score": "1"
        },
        {
            "review_text": "loved it. honesty I love David Szymanskis work and will forever recommend his work. So.... Yeah this is free game go ahead,",
            "review_score": "1"
        },
        {
            "review_text": "Firstly, it really is a short game! Even I managed to complete it in under half an hour (so that's saying something!)   I really like psychological horror rather than jump scares so I did enjoy this game. It took me a while wandering around the first room to work out what to do, I found the laptop before anything else and it wouldn't do anything. Luckily found my way. The codes are pretty easy, though it is a pain in the butt to have to keep walking up and down the stairs, especially as there isn't a 'run' feature (that I could find) Finding the final code was impossible for me so I had to hit the forum for help.   The sound effects were ok, just girlish breathing more than anything.  The visuals were ok. Very blocky, which was intended I assume. The flicker light is kind of annoying but it doesn't last long.  The plot was good, didn't have an issue with the content as had assumed that's what the dark theme would be. The way it just suddenly ended could use some work though, in my opinion.  I'd recommend this game mainly because it's free and it doesn't take long to download or play through. It's the kind of game you'd play just once whilst waiting for something else.   Overall, I'd say it was an average game that won't leave a lasting impression.",
            "review_score": "1"
        },
        {
            "review_text": "This game was free, and I still want a refund, if only to get this pretentious abomination out of my library.  This game is twenty minutes long, and every second of that is pure, unrefined pain. It's twenty minutes of graphics attempting to cash in on the minecraft audience, slow movement, and nonstop backtracking back to the first room to punch an easy riddle-answer password into a computer to open another door that leads to another riddle password tossed away in a corner and buried within the most fedora-worthy dialogue ever witnessed.  Fingerbones is not scary.  Fingerbones is not artistically creative, in fact, quite the opposite.  Fingerbones does NOT have a good story.  So what is Fingerbones? I would hesitate to call it a game, especially not a horror game. I hesitate to call it an adventure game, or a story game, or a 'cinematic experience'. It's none of these things. It's slow, painfully easy, and a laughably written mess.   Games like Fingerbones, that the creators proudly display as an example of games being art, are the very reason they're not considered art at all by the majority, because in Fingerbones' case, it's not like a painter showing off his painting, but like an angsty teenager displaying his oily fedora and lightly scratched wrists.",
            "review_score": "-1"
        },
        {
            "review_text": "30 minutes of bone chilling mystery",
            "review_score": "1"
        },
        {
            "review_text": "  idk if i'd call it a horror game but that's what you get for free huh? the puzzles were easy as the answers are given and there weren't any disturbing images, the sounds were disturbing in a way. i'll recommend it though since it did have me anticipated and entertained for 30 minutes",
            "review_score": "1"
        },
        {
            "review_text": "Creepy, and quite short. Not as interactive as I was hoping for it to be, but it succeeded to scare be so I think it stands true to its title as a horror game.",
            "review_score": "1"
        },
        {
            "review_text": "Oh god, that ending...",
            "review_score": "1"
        },
        {
            "review_text": "I dunno. I guess it filled a few minutes. If you're bored, and have about half an hour, its free?",
            "review_score": "1"
        },
        {
            "review_text": "A nicely disturbing but meditative experience. FIngerbones is a mood and story driven game, where you discover the horrying nature of your character and the meaning behind 'fingerbones' the deeper you explore your bunker. The puzzles are few, and not incredibly difficult, but require you to pay attention to the bits and pieces of plot that you discover through notes or your character's musings. The plot is well-written and the visuals are well-rendered. The atmosphere is incredibly eerie. One particular aspect of the atmosphere I really enjoyed was present in the main room of the game. You can clearly tell the sun is setting on the outside because the light that sneaks in through the few window shines an orange glow on the room. Moreover, the room appears to not have been open in months, because it is filled with dust particles up to the ceiling. This combination makes up for a really grabbing atmosphere for first few minutes of gameplay. Disturbingly surreal.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I'm actually impressed how a scary and creepy atmosphere can be created with such simple means. Everyone who's got 20 minutes to kill should definitely play this game.",
            "review_score": "1"
        }
    ]
}