{
    "app_id": 391280,
    "name": "Epic Manager - Create Your Own Adventuring Agency!",
    "release_date": "2016-12-12",
    "developer": [
        "ManaVoid Entertainment Inc."
    ],
    "publisher": [
        "ManaVoid Entertainment Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 140,
    "negative_ratings": 57,
    "price": 13.59,
    "description": "Epic Manager is a unique crossover between Sports Management and classic JRPGs. Experience an addictive “one more turn” mix of tycoon strategy, roguelike elements, roster management, combat and character progression, all rooted in an epic yet light-hearted fantasy setting. Rated ‘E’ for EPIC!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391280/header.jpg?t=1503499518",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core Processor Memory: 4 GB RAM Graphics: 720p Capable Display and Resolution DirectX: Version 9.0 Storage: 4 GB available space",
    "recommended_requirements": "OS: Windows 7 or Later Processor: Quad Core Processor Memory: 4 GB RAM Graphics: 1080p Capable Display and Resolution DirectX: Version 9.0 Storage: 4 GB available space",
    "reviews": [
        {
            "review_text": "Simplistic execution of a good concept.  Let's get this out of the way. This is not a very deep tycoon game.  It's quick, it's simple, and it does what it does very well. It definately doesn't get into the realm of a 4X, or a grand strategy, and I can see very little replay value in this game. If steam offered an option I'd put this as neutral.   I'd safely buy this on special, but at it's current price it just isn't enough of a game for the price that's being charged.  SJ",
            "review_score": "-1"
        },
        {
            "review_text": "This game didn't have enough meat for my tastes. I was hoping to get a little more in depth with the management aspect and was less interested in the tedious combat. Maybe more depth opens up later, but it got really boring really quickly for me.   I wanted Football Manager but for adventuring parties, and this just doesn't reach that level.",
            "review_score": "-1"
        }
    ]
}