{
    "app_id": 391310,
    "name": "Alien Attack",
    "release_date": "2016-06-21",
    "developer": [
        "Alien Jellyfish"
    ],
    "publisher": [
        "Alien Jellyfish"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 23,
    "positive_ratings": 121,
    "negative_ratings": 52,
    "price": 1.59,
    "description": "You are a space trooper. Your crew finished the cleaning mission and left you alone by accident. Now you are surrounded by aliens. Persist them as long as you can.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391310/header.jpg?t=1555352066",
    "minimum_requirements": "OS: Windows 7 32 Bit or higher Processor: 2 GHz Memory: 512 MB RAM Graphics: Сompatible with DirectX 9.0c DirectX: Version 9.0c Storage: 130 MB available space Additional Notes: Latest DirectX drivers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fun game, short and simple, chances are that before you complete 1 hour you already have 100% achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Saw that people said this was a good game for a fun time and a 100%  They lied.   After 9/10 achievements I find myself slamming my head into my desk.  THe difficulty level in this game is insanse, everything is random, some games you get powerups some you don't get any. The enemy spawn is also 100% random meaning you can get swarmed 10 seconds into the game, or have enemys literally all around you in less time then you can fire 6 shots (keep in mind some enemys take 2-4 hits) Better yet after you get 500 points and go for 1000 (The final achievement), they take away the best weapon and give you some POS laser that is worse than the default gun. Needs alot of work from the devs in order to make it playable.  Just avoid this game, not worth the trouble.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game. But could use more 'stuff' in future updates to make it more enjoyable. Keep up the good work.",
            "review_score": "1"
        }
    ]
}