{
    "app_id": 391420,
    "name": "Gun Rocket",
    "release_date": "2016-05-02",
    "developer": [
        "Space Wedgie"
    ],
    "publisher": [
        "Space Wedgie"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 491,
    "negative_ratings": 181,
    "price": 0.79,
    "description": "If you are not prepared for a challenge - turn back now. Gun Rocket is a 2D physics puzzler that is not for the feint of heart or the stiff of fingers. In search of adventure, you have been caught by holes in space and time. Can you escape?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391420/header.jpg?t=1514771529",
    "minimum_requirements": "OS: Windows 7 or newer Processor: 2 GHz Intel Pentium 4 or AMD Athlon or equivalent Memory: 2 GB RAM Graphics: integrated graphics should be fine Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows 7 or newer Processor: 2 GHz Intel Pentium 4 or AMD Athlon or equivalent Memory: 2 GB RAM Graphics: integrated graphics should be fine Storage: 100 MB available space",
    "reviews": [
        {
            "review_text": "Pretty hard, but it has a working menu with sound that can be muted and that makes it not a bad game overall.",
            "review_score": "1"
        },
        {
            "review_text": "It's just an average flash game. The font should be changed, as it's really hard to read.",
            "review_score": "-1"
        },
        {
            "review_text": "A great game to play for a couple of minutes, for me atleast, because my frustration took me over...  10/10 Great to test your patience oh and a nice callback to the good old days... just for the price of a chocolate bar..",
            "review_score": "1"
        },
        {
            "review_text": "the way it does a cross / split screen platforming is very unique",
            "review_score": "1"
        },
        {
            "review_text": "A very fun, basic and challenging game. I totally recommed this game for when it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!! Multiplayer is kinda Survival thing!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Putt-putt golf simulator 2k15.  This game absolutely needs a global leader board.  and...the sound track will yin to the yang of your frustration.  Trust me...  You need this.",
            "review_score": "1"
        },
        {
            "review_text": "very nice mini-game for that price!",
            "review_score": "1"
        },
        {
            "review_text": "The 'Dark Souls' of flash games. It's alright 6/10 would prefer if it had hentai after u beat a level but hey what are you gonna do xD",
            "review_score": "1"
        },
        {
            "review_text": "Good game, i recommend it. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "My little brother decided to buy me this game. Twenty-five cents was all it costed, and he bought it because he has no impulse control.  I decided 'what the hell' and decided to take a look at the game. My very first words were 'what do i do' followed by 'PURPLE SPACE STRIPES WHAT THE HELL'. And thus began my descent into madness. It began simple; fly to the portal and avoid the majestic purple space stripes. It was a simpler time. But things began to pick up, as I realized three things.  1. You can shoot purple space asterisks out of your face. 2. You shoot white space asterisks out of your butt for propulsion.  I failed to achieve thought number three, as I was dumbfounded by exactly what the hell my ship was supposed to be; an enigmatic green mountain with snow against the fluorescent stripes directly from the depths of hell. Eventually, the endlessly looping music gave me a new question; why do I have no hitbox? The purple space stripes are fickle mistresses; sometimes, you could fly deep into their embrace; other times, they'd simply tear my tiny little space mountain into tiny space mountain shreds.  I then proceeded to punch my little brother in the face, and continued my adventure. All I could see now was planes of darkness, travelling across the purple space stripes. Travellers against the legions of hell. And as I flew, my little brother called the 'space portal' a purple space hexagon, causing my final drop. I fell so far, that I pierced straight through hell, and found myself in the abyss.  The abyss of purple space stripes. That's about the time when, for the safety of my sanity and the entire universe at large, pulled the plug on my computer and lobbed it out a window.  perfect 5 / 7, watch out for space asterisks and you'll be okay",
            "review_score": "-1"
        },
        {
            "review_text": "Dont play this ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Oh my god....this game sucks!  Playing it on 1920x1080 you get a totally screwed up menu and game! You have to click the button above the button, that you want to click.  Ingame you can fly through the 'radar' areas, since they aren't really set correctly.  The physics just suck and even for 91 Euro-Cent you get better games than that!  It feels like a half-hearted flashgame, that got on steam by luck (or giveaway keys).  I totally NOT recommend this game at all!",
            "review_score": "-1"
        },
        {
            "review_text": "I like the game, it is simple yet challenging. What I found lacking was how you needed to use your mouse between levels. Personally I would love to be able to push space or x (shoot button) to contenue for next level, or retry a failed level!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game but very hard!!!",
            "review_score": "1"
        },
        {
            "review_text": "  This is a type of creative game that people with open-minds would play.  Its a great game where there is a simple objective, and nothing else.  I would give this game a 8.5/10, because it is a hard game where you barely have any control of the ship, but still a good and artistic game nothingless.",
            "review_score": "1"
        },
        {
            "review_text": "It was fun!",
            "review_score": "1"
        },
        {
            "review_text": "Can't reach level 3 of first stage  -10/9'Will destroy my keyboard another time'",
            "review_score": "1"
        }
    ]
}