{
    "app_id": 391740,
    "name": "Blaster Shooter GunGuy!",
    "release_date": "2015-08-10",
    "developer": [
        "Adam DeLease"
    ],
    "publisher": [
        "Adam DeLease"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 180,
    "negative_ratings": 231,
    "price": 1.59,
    "description": "Blaster Shooter GunGuy is a 2D action rage platformer. Similar in nature to games such as IWBTG. But also inspired by Mega Man and Mega Man X.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391740/header.jpg?t=1451887113",
    "minimum_requirements": "OS: Windows 7 Processor: AMD Sempron 2650 or better processor Graphics: ATI Radeon 4000 Series or Higher Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Pressing shift to dash makes me go a bit faster then expected, so I kind of run into bad things a lot. I try to avoid using the dash if and when I can. When you die you restart at the beginning. Not sure if there are any checkpoints mid level because I am still trying to get halfway through the first level lol. This game is suppose to be difficult, I know, but people will lose interest fast if they become overly annoyed with having to restart from the beginning all the time. There are platform games out there for everyone, but this one isn't for me, sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "+ graphics are good can run on low system requirements ! + there are many characters you can switch between + its hard but not that hard so you enjoy it but also grind ur teeth a little bit :P  for the full price i would say this game is not worth it if you are not into hard games ! but if it is on sale yeah you should grab it :3 and test it out   i have not finished the game yet but when ill finish it ill update the review",
            "review_score": "1"
        },
        {
            "review_text": "But it Is so hard. It gets boring Repetitive. And is a mario clone. Only Buy this if you like something like super meat boy or some hard platformer otherwise give it a miss",
            "review_score": "1"
        },
        {
            "review_text": "it reminds me of 9/11",
            "review_score": "1"
        },
        {
            "review_text": "I found this really tough when playing on a keyboard, the addition of controller support (no hints/tips for the controller yet but it does work!) improves things immeasurably.  It's still a basic-looking and very, very punishing platform shooter, but some people LIKE those things!?  I need to spend more time perhaps, but it's great to see a developer listening to reviews and putting in stuff to make things better - so it's a recommend IF you like tough games and maybe have a controller too!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a 'blast' to play! If you like games like Super Meat Boy or I Wanna Be the Guy, you MUST try this game out. The levels are fun and challenging, as well as rewarding when you finally figure out the algorithm, nothing is random here so learning how to manipulate how you approach each section untill you progress past it becomes muscle memory which I love.  I will be updating this as I get further in but I wanted to get a positive review up here asap because it seems this game is getting some un-needed flak from people who maybe bought a game they didnt fully expect what it entailed.   This aint no easy ride folks play it a couple hours at a time and come back later to progress.  **AS A DISCLAIMER, I HIGHLY recommend playing this game with a controller, I really dont see it being easy to play otherwise, keyboard is too clunky. I tried to bind the keys using the games feature but it doesnt detect my gamepads analog sticks (may cater to xbox controllers) so I used the simple and small program joy2key to bind my keys to my controller manually, this imrpoved my gameplay experience 2x easily, making it feel like I was actually in full controll of my character",
            "review_score": "1"
        },
        {
            "review_text": "Its a 'I made a game in GameMaker' kind of game",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the games I totaly regret even touching... (I have 8 hours only because I fell asleep when playing) The game may look interesting from the screenshots, and it is pretty much it, a platformer with a gun.  When playing the game for the first time I tried to not be annoyed to easily by bugs or missing mechanics, knowing that the game was the first project of the creator, but after playing for about 20 minutes, I noticed that this game needs to be polished.   The game is trying to become the next super meat boy with a gun (or at least I think so)   I remmember this game beeing hyped by some groups that giveaway games, and that is the only reason I even played...  The only reason I continued to play this game after an hour is to get the cards, and rather thatn that the pricetag of 2 euros is to much for this 'game'. I would recomend super meat boy or battleblock theater rather than this game.  I tried giving this game multiple tries but it just is a bad game.  P.s. Since when do birds need several shots to kill, or kill you faster than you can your bulets fly?",
            "review_score": "-1"
        },
        {
            "review_text": "4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Can't even move my character in this game. Thankfully get it for free. Don't play it, just open your sam or idle master and keep waiting till all the card dropped.",
            "review_score": "-1"
        },
        {
            "review_text": "A stupid application that does not work properly. It is recommended only if you like hurting yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "this game giv me big boner so big one make me ♥♥♥ almost twice big time  EDIT: sorry i actual came three",
            "review_score": "1"
        },
        {
            "review_text": "Blaster Shooter GunGuy! is a game that I recommend because: - is a method to banish boredom - is indie  - have trading cards - is difficult - is a shooter game  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Buy it if it is on sale,THEN is worth the money.",
            "review_score": "1"
        }
    ]
}