{
    "app_id": 391960,
    "name": "Super Mega Bob",
    "release_date": "2015-12-03",
    "developer": [
        "Jenito"
    ],
    "publisher": [
        "Jenito"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 45,
    "positive_ratings": 14,
    "negative_ratings": 4,
    "price": 3.99,
    "description": "Bob's world has been invaded by mechanical demons from the nether! SEND THEM BACK TO WHERE THEY CAME FROM! . . . by shooting at them like a madman, of course!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/391960/header.jpg?t=1483458973",
    "minimum_requirements": "OS: Windows XP, 7, Vista, 8, 10 Processor: Intel Core i7 U 620 @ 1.07GHz or comparable processor Memory: 4 GB RAM Graphics: Must support Shader Model 1.1 and DirectX 9.0c. DirectX: Version 9.0c Storage: 400 MB available space Sound Card: DirectX 9.0c compatible Additional Notes: XNA 4.0 Redistributable required to run game (installed via Steam)",
    "recommended_requirements": "OS: Windows 7 or higher Processor: Intel Core2 Duo T9400 @ 2.53GHz or comparable processor Memory: 8 GB RAM Graphics: 512MB+ supporting Shader Model 2.0 and DirectX 9.0c. DirectX: Version 9.0c Storage: 400 MB available space Sound Card: DirectX 9.0c compatible Additional Notes: XNA 4.0 Redistributable required to run game (installed via Steam)",
    "reviews": [
        {
            "review_text": "tl:dr -- Get this if you like retro puzzle platformers, even though it's not a platformer.  Mechanically, Super Mega Bob is a Twin Stick Shooter. You move with WASD and fire with the arrows. But classifying games by mechanics alone, (as Extra Credits on YouTube likes to point out) is a poor choice of attributes to focus on. Don't come to Super Mega Bob expecting anything like Geography Wars. As the initials and choice of adjectives of the game name imply, SMB has more in common with retro puzzle platformers than most twin stick shooters. And that is a very good thing.  Yes, as the difficulty increases, there are some very bullet-hell like levels. But the art style - the colorful, fun, pixel-art sprites - the collecting coins and berries, the motivation of the lost love... It's all very familiar and welcoming. And it's all very NES. It's great!  There are some RPG elements too, the collectables are not just for completionists (although a handy chart per level does help those completionists know what they've missed) - you can buy upgrades. And you will need them.  Like many retro platformers, there is a difficulty level here that requires work and patience to master. Don't take the kid-friendly appearance to mean this is going to be easy. It's not.  If you like retro games, if you like platformers, if you like a challenge -- get Super Mega Bob, you'll be glad you did!!!",
            "review_score": "1"
        }
    ]
}