{
    "app_id": 392020,
    "name": "RFLEX",
    "release_date": "2015-08-26",
    "developer": [
        "Wesley LaFerriere"
    ],
    "publisher": [
        "System Void Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Casual",
        "Indie"
    ],
    "achievements": 12,
    "positive_ratings": 152,
    "negative_ratings": 14,
    "price": 2.79,
    "description": "RFLEX is a fast-paced and challenging neo-arcade game. Frantically dodge your way to the high score in a series of rage-inducing levels while enjoying a kickass, original soundtrack. Experience trippy visuals while being pulled into a never-ending abyss of addicting, non-stop action.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/392020/header.jpg?t=1464659760",
    "minimum_requirements": "OS: Windows Vista Processor: 2 GHz Memory: 1 GB RAM Graphics: OpenGL 2.1 Support",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Amazing game but haven't even completed the first level... I think a split screen mode with WASD V.S Arrow keys would be really cool.",
            "review_score": "1"
        },
        {
            "review_text": "Drunk mode? Pfft, easy! Hold my beer!",
            "review_score": "1"
        },
        {
            "review_text": "If cats have nine lives then they haven't played this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great reaction / rage game :D Cant even pass the first level, im so ♥♥♥♥♥ bad at this game xD An option to deactivate the lines that appear would be great because somehow i react to them instead of avoiding them xD  9/10, would recommend :D",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome game",
            "review_score": "1"
        },
        {
            "review_text": "1. Got steam code from developer. 2. After 15 minutes, got into top 10 overall. 3. Quit while I was ahead. 4. Come back 15 days later. 5. Ranked 200th. 6. Realized how popular this had become.  Overall, an amazing and simple game. Once you start, you can't stop.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would definitely recommend -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Really fun great dev",
            "review_score": "1"
        },
        {
            "review_text": "I picked up this game as filler to reach the $10 mark when buying another game on sale and so far have not been disappointed!  As a fan of Super Hexagon, I quite like the fast paced, simple, and retro styled games. Super Hexagon was actually the basis for checking out this game, as I thought they would have nice similarities. They do, but they do provide very different experiences.   Is it good?   In short: Yes! This game is great. The simple visuals, controls, and decent soundtrack all make for an entertaining, if frustrating, game. It's a game I think I will find myself returning to frequently either to kill time or beat an old record. While it's similar to Super Hexagon, this isn't spinnig around at break neck pace past barriers, but more like dodgeball, if you are severely near-sighted and surrounded.  In long: As stated, it's a great game! Like Super Hexagon, it has simple graphics which lend themselves nicely to the style of play, give it a recognizable look, and don't confuse the player. The soundtrack is pretty good as well, so it's nice to get on and see how long I can last just to listen to the music (perhaps I should pick up the soundtrack). The game lends itself nicely to killing a short period of time or longer play sessions (but I can see myself getting fatigued late into a session).  The controls are responsive (there are only 5 buttons the player uses anyway) and I only have one (very minor) issue in this regard. I appreciate the added (compared to Super Hexagon) dimension of UP and DOWN, however it does introduce a little more delay. Jumping between keys with a single finger can make hitting split second openings significantly more difficult than LEFT and RIGHT at higher/harder speeds. And this could be remedied with the use of both hands or a controller, however the controller setup only allows for one control stick to be used (as of writing this review), so I am unable to use the control stick with my dominant hand. And training yourself to quickly and accurately use both hands isn't a small task for most, either. It's an incredibly minor complaint, almost more of a limitation of the peripherals than anything, and by no substantial means should be a factor in the value of the game.  Also like Super Hexagon, this appears randomized at first, however I was able to pick out patterns in the obstacles hurdling at one of your five faces. After the first level these patterns did get harder to detect and carry out, so it doesn't seem like it will get to a point where I detect the pattern and carry it out without thinking rather than relying on reflexes.  *Edit: After playing through all the levels, I did come to remember and recognize all patterns. But it still isn't an issue in difficulty due to the fact that you have to actually be able to recognize it and execute it in time.  If you're looking for a fast paced, simple, retro style game with a great soundtrack, RFLEX should fill that nicely.",
            "review_score": "1"
        },
        {
            "review_text": "fun game but i usually end up wanting to vomit after around 2 seconds of gameplay  EDIT: The Dev of the game attemped to assist me with my problems even if there are problems with the viewpoint this shows what made gaming great Changing the review to positive",
            "review_score": "1"
        },
        {
            "review_text": "Although I am trash at the game, I love it. The music is great and the overall game itself is great. I would recommend this game anyday. I remember when I first bought it and my PC was too bad to run it hahahahah, but now I got a better one I'm able to play it and I enjoy it.",
            "review_score": "1"
        }
    ]
}