{
    "app_id": 392030,
    "name": "Murasaki",
    "release_date": "2016-05-12",
    "developer": [
        "Katatema"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Bullet Hell"
    ],
    "achievements": 48,
    "positive_ratings": 68,
    "negative_ratings": 4,
    "price": 3.99,
    "description": "&quot;Murasaki&quot; is a puzzle explosion game. Use explosions to clear the screen of pesky obstacles filling it up. The only controls you need are the directional buttons and two other buttons (Z and X)!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/392030/header.jpg?t=1554710515",
    "minimum_requirements": "OS: Windows Vista or newer Processor: Core 2 Duo or better Memory: 1 GB RAM Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Murasaki finally gets an English release on Steam. The original game was in Japanese. I originally played the Japanese version (without understanding a single word) and later on I saw it would get a release on Steam with English version. I'm a fan of Wtetsu's work, so I bought, even if I had played the Japanese version previously.  This is a bullethell game with some puzzle mechanics (borrowed from his other game, 'Irisu Syndrome!, which is free-ware by the way'). You can shoot directly through the enemies (only one shot on screen, but they don't take long to vanish), or make chains with the red squares and blue circles. You can also use bombs in case you have too much stuff on screen. On bosses, sometimes a 'kano' (red thingy) drops it and you can catch it. If you manage to beat it, you'll receive a brief part of the story on the Collection, along the time it took for you to defeat that part of the boss.   The idea of shooting on other objects that aren't necessarily the boss works pretty well. Dodging the boss bullet's and doing something else while doing so.  You have two characters in your disposal on the beginning (I don't know if you can unlock more later, I haven't beat it completely yet, but by seeing the store page, I don't think so). Each one has their own abilities. Kairi which is a more balanced character and Satsuki which has more power, but more difficult to use. Each character has different dialogues as well (on bosses), and you need to play as each to unlock certain information about the story (unlocked on the collection).  Speaking of collection, you can unlock various goodies (like music, character information, and such) while you progress in-game.  I just feel a little pricey for a simple game like this. Another problem is there is no way to 'slow down' your character to dodge the bullets more easily, especially how the character moves kinda fast in this game. May be a good or bad thing, depending of your skill level.  Small bug: For some reason, the game seems to disable the Windows key (Running on Windows 7, 64-bits).  Pros: - Good soundtrack; - Interesting gameplay; - Multiple routes (two characters to play as with different dialogue, and both of them unlocks specific features on the collection and your main story); - Portrait artwork is pretty good.  Middle: - Sprites and effects are ok.  Cons: - No button for slow down the character (may not be a con, actually); - Kinda pricey right now. (Note: Game purchased on Brazil. The price on your location can be cheaper or more expensive).  (I may update this review when I beat it or something).",
            "review_score": "1"
        },
        {
            "review_text": "It's like an LSD trip Except it has anime girls... What's not to love?",
            "review_score": "1"
        }
    ]
}