{
    "app_id": 392190,
    "name": "#SelfieTennis",
    "release_date": "2016-04-01",
    "developer": [
        "VRUnicorns"
    ],
    "publisher": [
        "Bandello"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "VR Support"
    ],
    "genres": [
        "Indie",
        "Sports"
    ],
    "tags": [
        "Tennis",
        "Sports",
        "Indie"
    ],
    "achievements": 43,
    "positive_ratings": 70,
    "negative_ratings": 25,
    "price": 7.19,
    "description": "#SelfieTennis is a sandbox game where you play tennis with yourself. When you hit the ball over the net, you teleport to the other side and hit it back to get points. But once you start spanking the wonky ball people around the court, things start to get really weird!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/392190/header.jpg?t=1514810986",
    "minimum_requirements": "OS: Windows 7, 8.1, 10 Processor: Intel i5 Memory: 4 GB RAM Graphics: NVIDIA GeForce 970 DirectX: Version 11 Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is an excellent game. Everything about the movement is so immersive. It's so fun and exhilierating. I can't get enough of it.   10/10 would recommend to anyone who like to move ",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended game for Tennis lovers! Maybe a price around 7-10$ would be ideal. Still the game is great. Some polishing still needed-&gt; as mentioned by other reviewers , when slamming the racket fast the ball passes through it.",
            "review_score": "1"
        },
        {
            "review_text": "  Very fun, unique VR game. A good one to demo for friends trying VR out.          YouTube™ Video:  #SelfieTennis (Vive VR Gameplay)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Playing with yourself has never been so much fun! It's also incredibly satisfying knocking the Tennis Ball people of the map. Do recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, solid mechanics, and lots of quriky charm! #SelfieTennis is a must play Vive experience!",
            "review_score": "1"
        },
        {
            "review_text": "Why is it so addicting?",
            "review_score": "1"
        },
        {
            "review_text": "I agree with the negatives reviews. As I remember this seemed to be marketed a bit of an indie poster child for the Vive. 15 quid? Not worth it for the content. 2.99 and I wouldn't have refunded.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fantastic! But im at the point now where I REALLY just want to do away with the music and the ♥♥♥♥♥♥♥♥ tennis people. I just want to play tennis with myself. Which means that I guess this isnt the game for me.  Im not recommending this game because regardless of how solid of a game it is, $20 for a game that makes simply playing tennis difficult, is a bit much. Also the ball goes through the racket far too often.",
            "review_score": "-1"
        }
    ]
}