{
    "app_id": 39210,
    "name": "FINAL FANTASY XIV Online",
    "release_date": "2014-02-18",
    "developer": [
        "Square Enix"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "MMO",
        "Co-op",
        "Online Co-op",
        "Cross-Platform Multiplayer",
        "Partial Controller Support"
    ],
    "genres": [
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "MMORPG",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 9808,
    "negative_ratings": 2107,
    "price": 9.99,
    "description": "Take part in an epic and ever-changing FINAL FANTASY as you adventure and explore with friends from around the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/39210/header.jpg?t=1549473655",
    "minimum_requirements": "OS: Windows® 7 32/64 bit, Windows® 8.1 32/64 bit, Windows® 10 32/64 bit Processor: Intel® Core™i5 2.4GHz or higher Memory: 3 GB RAM Graphics: 1280 x 720: NVIDIA® Geforce® GTX750 or higher, AMD Radeon™ R7 260X or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 60 GB available space Sound Card: DirectSound® sound card (DirectX® 9.0c or higher) Additional Notes: System Requirements may be subject to change. If you are using a router, please set up your ports so that the below packets can pass through. [Ports that may be used] TCP：80, 443, 54992～54994, 55006～55007, 55021～55040",
    "recommended_requirements": "OS: Windows® 7 64 bit, Windows® 8.1 64 bit, Windows® 10 64 bit Processor: Intel® Core™i7 3GHz or higher Memory: 8 GB RAM Graphics: 1920 x 1080: NVIDIA® Geforce® GTX970 or higher AMD Radeon™ RX 480 or higher DirectX: Version 11 Network: Broadband Internet connection Storage: 60 GB available space Sound Card: DirectSound® sound card (DirectX® 9.0c or higher) Additional Notes: System Requirements may be subject to change. If you are using a router, please set up your ports so that the below packets can pass through. [Ports that may be used] TCP：80, 443, 54992～54994, 55006～55007, 55021～55040",
    "reviews": [
        {
            "review_text": "I was a WoW player. I played every expansion, I did HC/Mythic raiding, I spent thousands of hours playing it. If I could go back and get this on launch day instead, I would do it in a heart beat.  If you are an MMO players, this is hands down the best MMO on the market. I've played every major MMO since Ultima Online back in the 90s. FFXIV has every element you could want in an MMO and executes them extremely well.  The class system, all classes being available on a single character, is amazing. No alts, not that you can't have them, you just don't need them.  The story is captivating, you actually want to read the quests and see what happens rather than just click through to get the objectives.  Speak of quests, there are a ton, even without the myriad of side quests, and only completeing the main story, you can reach level cap on a class. Then roll in dungeons, raids, leves, hunting logs, challenge log, etc etc etc there is never a shortage of things to do, and they have made all of them entertaining.  If you like MMOs even a little bit, stop reading and click the buy button.   Really, stop.  Why are you still reading.   Stop it! Go play FFXIV, seriously.",
            "review_score": "1"
        },
        {
            "review_text": "Not too great at first, but the game really opens up once you're about 2000 hours in.",
            "review_score": "1"
        },
        {
            "review_text": "Overview:   Incredibly polished and well endowed MMO. Almost every setting is tweakable and supports controllers as well, you get a game that offers you everything you payed for and witholds none of it.  It also uphold the name of Final Fantasy in good faith, probably a lot better than the newer FF games. The combat is a bit repetitive however, you've got a wealth of content to discover and quests that reward you well; dungeons from level 15 and up and lots of end-game content (but be prepared for hardcore type groups for the real end-game content, statics with schedules).   Pretty soon there's going to be an expansion and new classes so there's much more to look forward to as the game ages. The developer has done a great job at supporting the game thus far and I've seen no signs of them slowing down.  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  Here's my breakdown between the positives and negatives of FFXIV:RR. +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  -------(Positive things)-------  + Good writing!  + Lots of content!   + The Hildibrand questline is the best questline in any MMO hands down.   + You've got lots of customization for your character / your HUD / and homes if you're rich enough.  + Generally a nice community for an MMO except for the occasional try-hard who gets unreasonably upset.    ------(Negative things)-------  - This game is fetch quest hell, if you despise fetch quests more than anything then I do not recommend you play this game.  - The journey from level 1 to level 50 isnt that exciting. (this pretty much goes for all MMOs)  - RNG will occupy the vast majority of your end game time spent. Repeatedly run the same content over and over and over until you get that pretty blouse you wanted to glamour.  - If you want to stick to 1 class for running content, the gameplay will get stale fairly fast, which isnt unique to FF, many MMO titles suffer from this. There's no traits or choice options to customize your fighting or spells, just flat stat increases that don't change the gameplay in any way other than just becoming stronger. (And your strength primarily comes from your gears item-level) You will be at level 50 with typically around 3 abilitys you need to use repeatedly for combat, and then 3 special situation skills to use in.. special situations and 2 super abilities you save for oh-♥♥♥♥ moments.  This varies between the classes but I played as a White Mage, so basically my job was to repeatedly hit the 2 button to cast cure, and then sometimes use a spell called Esuna to remove conditions from myself or others, and then cast an AOE that made HP regen (which you need to keep refreshing for the party once it wears off). This was not very fun to me, so you have to rely on the game to throw variety in the dungeons or enemies to spice things up.   Usually it just boils down to memorizing boss mechanics and hoping nobody screws up. So essentially you're a bot following a strictly scripted fight and if you deviate from that you're most likely going to fail; This might be different for other people, but this is just how I felt after a while of doing end-game content.  -------  But, feel free to give it a go yourself! There's a free 14 day trial for FFXIV, so don't let my opinions get in the way of a potentially good time when you could test drive it for yourself. As far as MMOs come and whats avaliable at the moment, I still recommend you give FF a try since it's one of the best subscription based MMOs out there right now. But this one just isnt for me.   (I Still recommend it for MMO lovers!)",
            "review_score": "1"
        },
        {
            "review_text": "Over 500 games in my Steam games library. Only one of them gets played: This one.",
            "review_score": "1"
        },
        {
            "review_text": "See, I don't normally play MMO's. If I try one, it usually captures my attention for a solid week, then I lose interest, uninstall it, and never play it again.  This game? Oh man oh man. This game is great. I've only ever played free MMO trash around the web, but this one is by far THE BEST MMO I have ever played.  The combat is like you should expect; if you've played any other MMO, it plays similarly to what you would expect out of an MMO. There are a variety of classes that you can choose from as your battlecraft classes and, the best part, you can have every class on one character. This is especially helpful when you're doing end-game raid stuffs. Form one team, and depending on what your team has leveled, you can form different groups with the same team.  When I first started playing this game, as a low level I thought the gameplay was spectacular. Everything felt so fresh, and I felt like there was a bunch of things about the game I had yet to discover. Boy, was I right. Once I hit 50 (the max level for every class BEFORE Heavensward, which will increase that cap to 60), I felt like the game suddenly opened up to me. To this day, I still find that I have a LOT to do.  If you're looking for a great MMO to play and don't mind a monthly fee, look no further. Final Fantasy XIV will surely fill your MMO needs.",
            "review_score": "1"
        },
        {
            "review_text": "I wish I was dead",
            "review_score": "1"
        },
        {
            "review_text": "Where did my life go? 10/10  No but srs. If you're an avid FF fan, pick this up. My friend whos not even an FF fan likes this game. 800+ hours and still counting, and I still haven't run out of things to do. ♥♥♥♥, I don't even have all the classes max level yet, not even close. I'm too busy enjoying myself and the massive world.  She tells me I'm addicted. I'm definately not. Endgame is endgame, and Square Enix do an amazing job of making it interesting.  Second Coil and Final Coil are really just not for casuals.",
            "review_score": "1"
        },
        {
            "review_text": "I'm just starting to get a feel for it, but it's decent so far.",
            "review_score": "1"
        },
        {
            "review_text": "You'll lose all your friends playing this. I don't have any friends so I was okay.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't been outside for months. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Need more time to give a proper review.",
            "review_score": "1"
        },
        {
            "review_text": "my life has been stolen away and i'm not even sad about it",
            "review_score": "1"
        },
        {
            "review_text": "More weeaboos than an anime convention.",
            "review_score": "1"
        },
        {
            "review_text": "Started playing this game with some friends last week, they no longer get on as much. I'm playing this game for more than 7 hrs each day.  I'm addicted. Trying to get my friends to play with me. 'I'll play it when I want to.' Muh friends. Play alone now. Throw snowballs at strangers. Pretty fun game.  I've set aside money to buy the expansion already, if you're looking for an MMO to get into by yourself or with some buddies go with this one. You won't regret it. You also get 30 days free of play time so that's really nice.  Also one feature I REALLY enjoy is how you can play any class you want without having to create another character. You just have to hit lvl 10 in the class you started out in before you can start another one. You can even cross-over skills from one class to another!",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy the Steam version! The DLC never go on sale for Steam. Heavensward alone (without base game) is like $50 CAD on steam, never drops, meanwhile the non-steam PC version is $16 for BOTH base game and Heavensward. I already asked Square Enix if I can transfer the account, or punch in the key from the non-steam version, and the answer to both is NO!",
            "review_score": "-1"
        },
        {
            "review_text": "Started playing in November 2015 Currently seeking way to plug in brain to FFXIV to accept it as my new matrix overlord  -Pros- Gets semiregular updates with bunches of new content Smooth, beautiful gameplay Easy to pick up and play Very immersive and cinematic Plenty of stuff to do besides grind dungeons Great community (judging by the server I'm on - Balmung) Job system is wonderful Glamouring gear is great especially at 'endgame'  -Cons- Somewhat limited inventory space if you're looking to handle several jobs at once Get 2 retainers (item storage NPC's) for free, also pretty limited inventory, every extra one (up to 8) costs $2 each per month. RNG will make you cry Queue times for dungeons/roulettes as DPS will make you cry Market Board is EXTREMELY volatile The conversations over shout that you walk into in Idyllshire and Ul'Dah will make you question the world's sanity There are no Lalafell Tossing Tournaments Don't ask about the peaches.",
            "review_score": "1"
        },
        {
            "review_text": "The best final fantasy game since XII. Even if you hate mmo's the one free month will give you an experience that feels like a true final fantasy successor with enough fan service, world building and some really fantastic combat and charater growth. I cannot stress enough if you like final fantasy DO NOT AVOID THIS BECAUSE JUST BECAUSE IT'S AN MMO. Chances are it will be your favorite final fantasy game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best MMO out there currently. • Create just one character and you can be every single class (battle, crafting and gathering). • You only pay for your monthly subscription, every other reward is earned in-game with your own effort. • You can be a cat.",
            "review_score": "1"
        },
        {
            "review_text": "do you wanna be a fairy-summoning half-cat half-doctor getting gay married in an enchanted forest, AND you like mmos? could be the game for you",
            "review_score": "1"
        },
        {
            "review_text": "This is the anime catgirl simulator that you've spent your whole life looking for. You've found it.",
            "review_score": "1"
        },
        {
            "review_text": "I'd have to say after getting two job classes to 60 and geared for the end game raid [Weeping City of Mhach] this MMO defenitly has something for everyone. There's two pages of dungeons, 8 and 24 man raids, trial bosses, visually appealing, very helpful community, and most important it is not Pay to Win cash shop items are cosmetic. It has a captivatiing story, that follows the general cross game lore very well, as well as a very unique skill system allowing classes to use skills from other classes you may have.",
            "review_score": "1"
        },
        {
            "review_text": "You can play as a little girl. And dance like a happy guy. And eat raptors. And get punched off of cliffs. And complain about not being healed. And blame tanks. And fight plants that make you feel like Willie Nelson before a live show. And you can fight a guy on a horse. And you can ride a unicorn. And you can blow up ladybugs.  -Cons -You'll lose all friends and any relationship that you have or will have -Elves. Screw those guys.",
            "review_score": "1"
        },
        {
            "review_text": "So I just tested this game for a bit and I have to say it is a very good game.   Though I tested a lot of mmo's this is the only one beside World of Warcraft which kept me playing for longer than a month.   It has some similarities to other mmo's but also some differences, which in my opinion make this a better mmo than other ones.  Pro: - you only need 1 character - nice graphics - awesome community - tactical gameplay for raids (some are very tricky) - multiplatform - much pretty stuffs :3 - Lalafell  Con: - much instancing of areas due to console support   So i don't really have much negative to say. For people who come to this mmo from other mmo's might be a bit upset about a 'slacky and slow' combat due to a long global cooldown. But for me after a while playing this it is not a problem. Due to many mechanics some bosses have it is very good to have a longer gcd to react to the mechanics and it also makes the fights much more tactical than in other mmo's. I think it is for everyone to decide if u like this kind of combat and gameplay. But for pretty reasons this game is awesome and also Lalafell.  For people who don't want to instantly buy this, there is a free trial version you can test out. Just give it a try and decide for yourselves. Though it get's even better when you buy the full version and get to max level.  I hope this may help some people to decide.  I wish everyone a good night and enjoy your games.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best MMORPGS since The days of vanilla WoW and Everquest II. One of the things that sets this game apart from current mmo's is the idea that your character is a person just like you. What I mean by that is that your character is not defined as a Mage or warrior, but rather someone who has learned how to be a Mage or warrior; in FFXIV, you can have one character that masters all classes and all professions. Professions (crafting classes) are very unique in that each crafting profession gets skills to help them in the world, for example, the fisherman profession around level 10 gets a sneak skill so they can traverse the world without being attacked. The fighting classes are separated into decouples of war, and decouples of magic; each with gear specified uniquely for it. The fighting classes include gladiator, pugalist, marauder, lancer, archer and rogue. The magic classes include the thaumaturge, the conjurer, and the arcanist.  What is so incredibly awesome about FFXIV is how all of these classes can be combined with another to create a more powerful and unique class. For example, you can create a paladin by getting your character to level 30 with a gladiator, and getting to level 15 with the conjurer, to create a slight mix of the two.  This game will forever be in my heart as the most immersive MMORPG and the mmo that has truly been worth a monthly payment. If I talked about everything in FFXIV, I'd be here all day typing, but in short, if you are questioning the value of this game, give the trial a try and you will quickly find out if you are a fan. Specs wise, the game runs beautifully, and for a game made quite a while ago, it graphically has withstood the test of time. I would recommend this game to any gamer who is searching for a great community, a great immersive experience, and a great breathe of fresh mmo air.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Final Fantasy 14? Their early work was a little too unfinished for my tastes, but when Final Fantasy XIV A Realm Reborn came out in 2013, I think they really came into their own, commercially and artistically. The whole game has a clear, crisp gameplay, and a new sheen of consummate professionalism that really gives the game a big boost. It's been compared to Guild Wars 2, but I think FF14 has a far more bitter, cynical sense of humor. In 2015, SquareEnix released this, Heavensward, their most recent expansion. I think their undisputed masterpiece is the fight against Ultima Weapon, a boss fight so enjoyable, most people probably don't dodge all of his abilities. But they should, because it's not just about the pleasures of conformity, and the importance of trends, it's also a personal statement about the developers themself. Hey Paul!",
            "review_score": "1"
        },
        {
            "review_text": "After experiencing all there is to offer, I can't honestly recommend this to someone looking for a faithful paid MMO in its current state. Sure, it's pretty fun for a while, but it gets too demanding and monotonous to enjoy playing in the long run, unless that's what you're into. Heavensward, the $40 expansion, is a well played joke. Multiplying the exp requirement for leveling and making you hike across massive maps* makes up more of this expansion's playtime than actual content. Significant updates are few and far between.  *Flying isn't unlocked for the area until you've activated every Aether Current across the map and awarded via quests, and by that time you're moving on to the next area anyway, where the process repeats.  TL;DR : A fantastic aesthetic, amazing soundtrack, accessible combat system and engaging story masks a life draining waiting simulator plagued with bad dev choices and Chinese RMT bots.  I'd like to hear from those who still stand by this game, as I can't fathom why.",
            "review_score": "-1"
        },
        {
            "review_text": "This review is subjected to changes since it's an MMO which goes on a continous implementation of patches. As a veteran player I do not recommend this game. It's super bland grindy at the end game.  TL;DR - End Game content (Very important in all MMO): Live letter which boasts and sugar coats about upcoming patch/expansion &gt; patch/expansion gets released &gt; Content worth only 1 week or more of actual fun &gt; Game gets bland and just daily grind heavy even with the new patch &gt; becomes pretty dead for over 2 1/2 month until next patch &gt; cycle repeats..  If your new or want to try a new mmo then try this game out. Graphics, story, leveling process and user interface is what will keep you captivated. It becomes only but a grind game at the end game content. Every cycle the director would say a very big update that is coming will improve the game.  At the end...it ends up being the same grinding content with the same agenda to kill a monster or do a dungeon (where you kill a monster too), or other similar elements that is sugar coated in different animation/graphics. Example in game - Diadem.  Many Veteran players have left this game and many have unsubscribed who resubscribes when a patch gets released which brings their hope up that the game got better but then unsubscribes disappointed. The majority of the players now that are recommending this game are players who have recently just started the game months ago and don't understand the cycle and brags how good this game is with having no experience on the entire game. Also some loyal fans.  Pros and Cons of this game:  Raid - If you are a hardcore player, you'll be disappointed from the fact that these raids lasts about a week and a half until hardcore players complete it. After completion, the next set of raids do not get released for another 2 1/2 month or even more. In other words their short. This applies to the 24 man raid as well. In heavensward expansion there has been twice where no raid content was released for 6 month each. Making it 12 month total now. They usually release 4 8-man raids every patch and 1 24-man raid every 2 patches. WoW on the otherhand has raids that lasts for months or a year because they release it in Huge contents and content itself is much harder then this game.  Dungeons - This is joke. Lasts about a day or two and then it becomes a simple repitiion and grind. The problem with dungeons is that every new dungeon they release, which is about 2 dungeons each patch, makes the old dungeons obsolete which they seem to take out of blizzard text book. However, a good element of the dungeon is that they do bring a new style of fights usually which is displayed on the boss fights. It's another grind just letting you know.  Crafting &amp; Gathering - In no way, this element within any MMO is the Bread and Butter. It's useless and a game can be entirely enjoyable without it. This is just another form of grinding to make money within the game or make gears so players stay subscribed longer. The unique part though this game has a different style of system for crafting and gathering which makes it like you are actually fighting a monster with crafting skills. It requires some brain and once you get it down you can just make a macro, and sleep over night and let it do everything. That's all there is but let me say this element isn't the one to draw people to the game and people who say it is...haven't played other MMOs before and haven't tried all other content to it's fullest in any MMO.  Character/Leveling - One of the Best in the game because one character can do everything like one character can become Mage, Lancer, Paladin, Warrior, etc. You can switch any time, and level each one individually. Every time you level a different class, you get a 50% more experience if you have another class that is higher then the current class your leveling.  User Interface- ANOTHER BEST THING iN THIS GAME by far. You can literally customize it the way you want and save it in 4 different slots. Load up one slot if you changed to a healer example.   Controller support - had controller support back in FFXI and it works out pretty well in here too.  Netcode - it sucks. Play as a caster to get a visual experience of it when casting and moving. You can get a friend to see movement between both screen also to get the idea.  Player Versus Player Classes - Classes in this game are very imbalanced. Warrior and Summoner being the strongest.  Player Versus Player Arena - Called Feast(Score Match) and Wolves den(Death Match). First due note that the netcode sucks in this game so get ready to experience some server lag. Also, they haven't resolved to deal with the cheaters that boost points during a season. Every season lasts about 1 patch and some people at the top 100 are involved in cheating to boosting their points higher. The FFXIV team did nothing to deal with them. Instead left them alone which you can see in the forum. The Score match Arena modes are based on Guild Wars 2 style. Needs lots more polishing. There is no pure PVP death match because they made it obsolete with the release of Feast and advertising it. Also, every arena requires one healer, one tank, one range and one melee. So you can imagine how que time can be...It's worse in frontlines.   Player Versus player Frontlines - Or Open field fights. They absolutley do not know what they're doing with this. It's legit terrible and they haven't fixed anything in this regards:  1) 3 way team and if your in a Team that has a large population in the data center then expect a hour long que to just get in to a frontline match. 2) All of the frontline is usually the same with heavy RNG involved except secure mode which was the first frontline to exist.  3) Every patch that contains a new frontline, they make the old one obsolete just like blizzard does. You'll never experience the old Frontline content because they don't care about the players. 4) Finally Fourth - They do not listen to community feedback regarding to removing 3 way team both on Japanese and Global forums. Examine the forums, they have widely petition to remove it to improve que time but the FFXIV Team just ignores it. QUE TIME AND GRINDING ARE THE WORST thing in this game.  Feedback system - cater to japanese/new player mainly and barely listen to any feedbacks except for those people. That's why we have grind content still.. Director doesn't know what he's doing since heavensward and doesn't learn.  Cash Shop - It's becoming ridicolous now. They have a mount for 30 USD bucks. Cosmetics and other stuff as well. They are using it for milking cash from the loyal people.  Events - These Events are lined up during the 2 1/2 month drought period to keep people subscribed. Like literally, it's the same grindfest. For example look at the current Yo-Kai Watch event. Heavy grind for 2 month.  Marks - All your doing is farming for these at the end to get the latest gear. Before you know it next patch comes and the gear you have becomes useless...seriously happens to everyone.  Bags and storage - Item storage is really the worst in this game to a point that you won't have no space and IN CASH SHOP YOU HAVE TO BUY A RETAINER WHICH YOU PAY '3 Dollar per month' to have more space..yeah more subscription money.  Community - Excellent for new players. When it comes to discussing the dark side of the game, you'll see those topic silent. Listen to LimitBreakRadio and their community cuz they keep it real about the game.  Fanfest event will either break or make it for me. However, be very cautious about the stuff they say and show because it's just another grind content. There are huge content droughts since pre-expansion and Director is only making content for new players.  *Update seems like the players who started playing recently during Heavensward are downvoting this. They have no experience of endgame content Grinding Fantasy XIV Ladies and Gentleman!",
            "review_score": "-1"
        },
        {
            "review_text": "Catgirl, dragongirl and potato simulator, where the girls are neckbeards and it's ok to have conversations about your dinner in shout.    Okay srsly it's extremely fun and beautiful, it's very grindy but manages to always hide the grind by making it semi-fun, early on players are nice and somewhat helpful to greenleafs, at endgame you better hope you watched that guide video and mastered dodging aoe's.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game kidnapped my family and holds them hostage...",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR Play it if you like MMOs or come from WoW. Very fun game, and is the second most popular ATM but it should be most.  This is the most fun I've ever had in an MMO. It is pretty similar to WoW, but some slight changes like the GCD is 2.5 seconds by default instead of 1.5 or so in WoW.  There is so much to do in this game, the End game is MUCH more fun than WoW and much more rewarding. It is a themepark MMO so don't expect to not have to do Story to unlock much of the stuff in the game. It is the best way to level your first class and unlock new things. It's also very interesting so DON'T SKIP IT!   Another thing that makes it much better, is you only need one character (I believe there is a very good reason to have 2 characters if you get heavily into crafting, but I haven't so idk), but you can play every single class in the game on that character. This makes the game much more fun to play and not having to do the same quests over and over again to level your class.   I would recommend this game to Anyone who comes from WoW, or is just interested in a new MMO in general. So much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Realm Reborn is a sequel to the previously released Final Fantasy XIV, which wasn’t received very well, and this is even conveniently explained in the game’s plot: there’s an apocalypse which ravages the whole realm and begins a new era. Personally I hadn’t played the previous game but this sequel is said to offer significant improvements over the original across the board, it's essentially an entirely redesigned game of its own.  The plot is fairly generic save the world kind of stuff: you are an adventurer brought into one of the game’s three big city-states with a special ability to attune to crystals which hold some great ability to hold off evil. You perform tasks for the city-states and eventually rise to become an envoy between them and even serve them. Similar to single-player games, the main plot and many of the other quests are filled with cutscenes, and in the main story’s case, the significant ones are also voiced. It’s all easy to follow and they’ve tried to put a bit of story into everything, for instance all of the game’s class guilds have a storyline of their own that advances as you gain levels and do guild quests.  However this kind of plot is well suited for MMO and something as complex as Final Fantasy XIII’s super messy plot obviously wouldn’t work here. Rising in guild ranks and joining armies feels like an accomplishment, and you get treated to far more heroic stuff like taking on massive primals (think summons from previous Final Fantasy titles) rather fast. The game overall plays much like a singleplayer game story wise: the story is focused on your personal character and many plot advancing quests have certain “duty” sections that can only be completed with your own character, such as taking on a boss battle. This can be reversed too in some cases: some boss battles and dungeons instead put you in a party with others. Most of the game can be soloed if you want, but the option to do stuff in a party is totally there too, you’ll only ever be separated for brief periods at a time.  This focus on your own character is what sets the game apart from other MMOs in my opinion and makes the game more interesting. The cutscenes are also no worse quality than in singleplayer FF titles and the game’s graphics and particularly animation are fantastic. All characters are lively animated and seeing your character pull off all kinds of stuff like stupid faces in cutscenes is really fun and involving. The game is also really well optimized, running on a large variety of systems and even having its own preset settings for laptops for instance that take your specs into account. The user interface in the game is really good too, super easy to use and slick looking, I was never at a loss to find something.  Gameplay is similar to other MMO titles and the difficulty level is really good across the board, you will be challenged at every level and you can always find more dangerous or easier opponents and quests. As a nice twist your character can be literally any class in the game – you can use and level any one class at a time, provided you have joined their guild, and certain class abilities can also be used by other classes. For instance, Gladiators that have leveled Conjurer can cast Cure, which they normally wouldn’t have access to, so cross-classing a bit is encouraged and even required to get Jobs (specialized mid/late-game classes) later on. To swap a class you just swap to a different gear preset, which you can create lists of. At the most basic level you just need to change a weapon to switch to another class.  The game is easy to get into as well, there’s a 15 day free trial that offers leveling of a single character up to level 20, but you can cross-class him/her as much as you like, and it’s definitely enough to get a good look at the game. The free trial is best played with a friend that already owns the game though, because you cannot set up your own parties in it, but other subscribed players can invite you to theirs. Marketplace and trading functions are limited but otherwise there’s no significant restrictions. The game is available as a digital download on the website and on Steam, as well as on PS3 and PS4 on the consoles, the multiplayer is cross-platform, and new buyers of the game automatically get 30 free game days. Steam users will also be happy to know that the monthly subscription can be paid with just Steam wallet money, assuming you also bought the game from Steam.  TL;DR  It's great. Don't compare it to Square Enix's other new FF games. It's a traditional MMO game with Final Fantasy flavor and one well designed one at that. I enjoy it tons more than the recent main series FF games. And I wrote this review originally for something else in mind, if you're wondering why it's so long and detailed. :P Give it a chance, it deserves more PC Steam players. And, it has a ton of content in a large world. I still feel like I've barely scratched the surface of what it has to offer so far at the moment of writing.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game but a ton of work. When you get to mid/end game you'll probably have a lot on your plate. Just make sure you have a lot of time to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy XIV is slowly starting to take over my life.",
            "review_score": "1"
        },
        {
            "review_text": "420 catgirls the dream",
            "review_score": "1"
        },
        {
            "review_text": "you can play as a catgirl or loli, like every other japanese/korean mmo",
            "review_score": "1"
        },
        {
            "review_text": "If you wanna see cat people run around and play as a tiny potato man, play it.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning, fun, so much to see and do, I'm in love. I love this game :D",
            "review_score": "1"
        },
        {
            "review_text": "*tagged as a Drunk Review*  MMOs are incredibly hard to review.  They require a very different consumption model than the one which follows any other game constuct.  As having almost 4000 hours played would imply, I have a deep invesment into the game if, anything, to prove that I have not wasted over three months of my life playing it.  But it is far more enjoyable than any MMO I have played in the last 10 years.  Being able to play one character who can level anything? Godsdamned priceless.  A crafting system that (before Heaven's Ward) rewarded multiclassing? Superb.  Gathering that is wholly necessary to advance crafting returns? Essential to a proper balance of skills and classes.  A variety of class roles and requirements, wholly integral to endgame content? Fascinating and complicated.  This is the MMO that brought me back after nearly 7 years of exile from WoW.  Enjoy it, love it, find solace in the various game design decisions that benefit the solo player and bring so many options to the multi-player.  But don't get too invested in PvP. It is an afterthought that, while moderately balanced, is not nearly as fun and intuitive as the rest of the game is,  Lula Moon, Faerie server, Lv51+ in every job/class available.",
            "review_score": "1"
        },
        {
            "review_text": "The best MMO. No doubt about it. What SE has built here has surpassed my expectations greatly. As a former FFXI player, I can say this game lives up to and exceeds the standard set by that game years ago. There is so much to do you will never be bored. 14/10",
            "review_score": "1"
        },
        {
            "review_text": "Eh who need a degree anyway  I used to play wow a long time ago. As an older wow player who grew bored of it after it lost it's charm, i'm happy to say i found a new charm within this game. Now i was scared jumping back in after the disaster that was FF14 1.0 and a guy who pre ordered the collectors edition. But i took a leap of faith and i wasn't dissapointed. The game can played almost alone which i like because i don't meeting people online and making friends with them. However i do like to play this with friends which i do. I can explore the world on my own and do awesome dungeons with friends. One thing i'm very impressed with is the cross play with ps3 and ps4 players. I like it when people do this it brings us together and fills up the servers. Unlike some other mmo (cough elder schools online). It's worth the subscription, and i have a feeling you find a warm connection with this game.  One thing i would like to see though is the ability to do dungeons on your own without a full party and not scale either. Let me go in as a level 30 for example and see if i can do the first dungeon on my own as the dungeon normally is.",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop playing this game.  Help,,",
            "review_score": "1"
        },
        {
            "review_text": "In 3 months I have played this game more than Overwatch 3x over. Send help. Please.",
            "review_score": "1"
        },
        {
            "review_text": "Let the hours I put into a videogame do the talking for you. It's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah it's good.",
            "review_score": "1"
        },
        {
            "review_text": "In case of doubt always choose FFXIV",
            "review_score": "1"
        },
        {
            "review_text": "This is easily the best MMO I've played in years. The graphics are beautiful, the character creation is very in-depth, and it actually feels like you're involved in the combat instead of just sitting there tapping buttons until you fall asleep. The crafting system is unique and fun (albeit frustrating sometimes), too. If you get bored of questing, dungeoning, and crafting, you can go play games and race chocobos at the Golden Saucer, if you're so inclined. You'll never run out of things to do in this game.  And if you're a roleplayer like me, Balmung has a huge and varied roleplay community--you're more than likely to find what you're looking for, no matter what your RP style is.  The only thing I don't like about the game is the character creation restrictions. If a server is overpopulated, you can't make a new character on it, and have to wait until the populated is a bit lower, which is usually really early in the morning (if you're in America). This is a huge problem on Balmumg, which really stinks if you're looking for an RP server. Other than that, though, this game is great and totally worth the $15 a month.",
            "review_score": "1"
        },
        {
            "review_text": "Best P2P MMO I've played in recent years. Been a few months since I have played so this might not be completely accurate. Here are my positives (+) negatives (-) and neutrals (o).  (+) All classes on one character, each levels individually, Mix and match (some) skills from one class to another. For example, if you plan to play a healer, 'Swift Cast' from the offensive caster is absolutely required so you can revive people instantly.  (+) This is the ultimate callback game for fans of the more classic Final Fantasy games, though you'll find a little bit from every game here. You probably don't need to be an FF fan to enjoy this, it stands up on its own mechanically. I would basically describe this game as 'WoW done better.'  (+) Level scaling for Dungeons and FATES (Fates are over-world events that people can take part in as a community.) So no matter what level you are, you and your friends can play together. However, you cannot level scale on the overworld unless you're inside a FATE.  (+) Party Finder. It works wonders, just queue up and do most anything else while you wait for a party to be automatically formed for a dungeon. You can also join overworld parties. Tanks and Healers will be matched quicker because they are not as commonly played, expect to wait if you are a DPS.  (+) Glamour system, make any piece of equipment look like another. You can only unlock the ability to glamour at level 50, but people can do it for you before then. It IS possible to look like a classically colored Black Mage, if you have the currency for it.  (+) Mechanically difficult and exhilarating bosses. Knowing how each dungeon and boss fight works before going in is essential to success. This is a double-edged sword, however, you could be stuck on a difficult fight, wiping multiple times with a pub party that doesn't know what they are doing. Sometimes it can get a bit too stressful, you'll always be on the razor's edge, late game. Different classes and roles are easier or harder to play, I wouldn't recommend rolling a tank for your first class.   (+) Guilds, Guild Houses and Homes. I highly recommend finding a good guild, there are benefits to reap. Decorate your own Guild House, Personal House or Apartment Room inside your Guild House. You could make your own guild, but I recommend joining an existing one that has some legs and good community.  (+) Chocobo Companions. Train a Chocobo to fight alongside you on the overworld, good for soloing. They can be mix-ups of Tank, Healer and DPS. Though the tank isn't all that good, last I heard.  (+) Gold Saucer and Minigames! Gamble, collect cards and play tetra master across the world (love it or hate it), race Chocobos FF7 style, earn currency for rewards.  (+) Retainers, get one of these as soon as you can, you get up to two for free. They act as your bank and you can send them out on missions to get items for you.  (o) Crafting is still kind of a pain like most MMO's, you do not draw from resources directly from your bank like in GW2, so it's an inventory management headache, but there is money to be made and it's far from useless. Each crafting class works mostly the same, but each has some unique skills that can cross-class like combat classes do. Many of which are necessary. It's worth a try.  (o) Arena and Mass-Scale PvP is available, though I can't comment on it since it's not my playstyle. EDIT: Recent update added 1v1 dueling.  (-) Ability Icon Clutter, a carry-over from WoW. This can be mitigated with good macro building and UI customization management, though.  (-) Main storyline isn't interesting until around level 50, which is max level before the expansion. Before that, there are some highlights, but it's mostly a slog through lots of political dialogue. Post vanilla is a vast improvement, though. Also, side story arcs are a lot better, for example, each class has its own story arc.  (-) No cross-server play. If you have a max level character on one server, and your friend is on another, one of you will have to make a new character or pay money for a server transfer.",
            "review_score": "1"
        },
        {
            "review_text": "finally letting me live out my lifelong fantasy of being a tiny pink-haired elf girl that plays the harp",
            "review_score": "1"
        },
        {
            "review_text": "Dragon girls yes.",
            "review_score": "1"
        },
        {
            "review_text": "The only MMO that has held my interest for more than lvl 20, I have one capped character and working on another. the fan service is great and just overall i enjoy the community.",
            "review_score": "1"
        },
        {
            "review_text": "grown a full beard, shirt is a mess, havent washed in a week.. girlfriend dumped me.. I guess that says alot about how addicting this game is.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics on this game are amazing. It also scales well across old and new technology.  I am a die-hard WoW fan, and will probably always play it on-and-off until it ends, but this game might be the first major MMO to catch my attention. It all just works. The first few levels are a bit disorientating, but after level 5 it starts to make sense. The community is also young (as the game is new) but very polite and helpful.  There's a decent variety of classes to start off with, and those who hate alts will love that they can switch classes just by changing weapons after a certain point in the game. (Level 15?) WIth some hybrid classes only being available after you level two individual classes to 30/15 respectively. There's almost a guarentee of many many more classes coming over from the previous FFXI title. Ideally it would flesh out every primary class with two specialization choices-- like how Arcanist must choose between Summoner or Scholar. Classes famous from XI include: Samurai, Black Knight, Corsair, Theif, Red Mage, and Blue Mage.  So far quests are varied and interesting, the enviroments are vibrant, and the world feels alive. I have not experienced any lag client or server side.   If you like classic Final Fantasy, you'll love this game. It's a very solid title and worth a shot.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very unfriendly to new players. Main Story missions are tedious and boring as they involve running back and forth to the same areas to talk to NPCs for menial tasks. End game is also lacking in content. Most of it is a grind and new content quickly turns into a grind as the developers try to keep subscription numbers. As of this review, the game is at less than 500,000 subscribers as per Lodestone data. Most servers are dead except the 'big 3.' Reconsider before wasting your time on this MMO. It is very pretty and most people only play to look sexy. Too bad the game lacks substance.",
            "review_score": "-1"
        },
        {
            "review_text": "It has all the features a modern MMO should plus an enticing story. The community is a breath of fresh air and the farthest from toxic I've ever seen. If you want to rekindle those feels you may have gotten in other MMORPGS this is the one to do it in. The monthly fee is totally worth it. The content is there slightly challening but fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with good graphics,",
            "review_score": "1"
        },
        {
            "review_text": "Great game, no doubt about it. Figured I'd say, only thing I don't like is that you can't pay for game time through Steam's store page. Instead you have to go to the website through your browser, go to payments and link up to Steam to pay with your cash you have on Steam, sorta thought that was stupid. For an MMORPG game (any) that's on Steam that does require a subscription, why not let us buy it directly through Steam instead?",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend this game as being one of the best mmorpgs probably ever made, being a remake of a game that was cancelled and redone. Because it was horrible, this game makes up for it. It has a lot of pros and a few cons. But only downside I must say is that it is 15$ a month. At the time I played this every single day, nowadays I haven't playing been playing it. But when I get my job, this is definitely going back up ^^",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Final Fantasy before, you'll like it even more with FFXIV: A Realm Reborn. It's everything you've loved about the Final Fantasy Series and more. One of the highlights is being able to switch classes without making a new character. The world is huge and full of adventure. Gameplay is smooth and works well even on low settings. This is a purchase you won't regret!",
            "review_score": "1"
        },
        {
            "review_text": "So far, its one of the best MMO i found, there place for more content to be added but lucky for us, SQ add new material every three month, which in this world of DDC and buy-to-play that the gaming industry has been working on for the last couple years, this is an invigorating title to play. Unlike the FFXI where they had made so many mistake, SQ took it on themself to see those problem and fix them inside the FF14 a Realm Reborn. From the main story to the class quest, going to the guild and granc company mission, there months of playable time in here!",
            "review_score": "1"
        },
        {
            "review_text": "Play with Japanese audio and English subtitles.",
            "review_score": "1"
        },
        {
            "review_text": "This game really different from other MMOs.Better graphics,various classes,huge map,strange creatures,better dungeons...",
            "review_score": "1"
        },
        {
            "review_text": "What everyone says is a lie, this is the Fashion Simulator of the century. Never have I thrown so much in-game currency at a cool looking coat to die with in my life.  20,000,000 gil/10   ",
            "review_score": "1"
        },
        {
            "review_text": "I don't have life anymore. help....",
            "review_score": "1"
        },
        {
            "review_text": "i like it yeah its nice :3",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to make another 'only played it a little, was pretty fun though' joke, but you know? That's actually really how it feels. Even after so much time there's still _plenty_ of things I haven't even touched, and the recent expansion has just piled even more onto that.",
            "review_score": "1"
        },
        {
            "review_text": "Cant remember what the sun looks like....",
            "review_score": "1"
        },
        {
            "review_text": "Rather than telling you why I like this game (and you can see I do from my play time), my recommendation is to give it a try and see if it is the mmo for you. It has a free trial so there is no cost to giving it a go.  I highly suggest that you don't rush your first experience with the game. Relax, enjoy the world, atmosphere and story, and just enjoy being in Eorzea. In my opinion, just getting the base game to play through the main storyline up to level 50 is worthwhile.  I will make a note that the many people find the combat to start off slow (although I still like it). The classes develop to become interesting and complex at later levels, so don't worry too much about that.",
            "review_score": "1"
        },
        {
            "review_text": "   Buy this game    Give up your soul    Buy expansion   Man I wish I had 2000 hours like everyone else who writes a review :/",
            "review_score": "1"
        },
        {
            "review_text": "The epitome of multi-player games. FF14 enables you to have one toon that can be every skill at the same time, whether you like magic, warrior, or Smith (I.e., carpenter, Goldsmith, etc.).",
            "review_score": "1"
        },
        {
            "review_text": "its crack",
            "review_score": "1"
        },
        {
            "review_text": "I'm still waiting behemoth server have vacancy.",
            "review_score": "1"
        },
        {
            "review_text": "I got into this game with 2 of my friends. After putting hundreds of hours into the game I can for sure recommend this game. It's like a traditional MMORPG. Comparable to WOW. Story is really good. One of the strong points. Multiple classes to go into. Raiding is fun and challenging all at the same time. I'm pretty sure there is a free trial version. So if you're new to Final Fantasy or MMOs in general and are looking to get into one. I would recommend this one to start.",
            "review_score": "1"
        },
        {
            "review_text": "Multiple classes on 1 character. Can do a sexy pose as a cute catgirl.  This game has it all",
            "review_score": "1"
        },
        {
            "review_text": "i love this game i found it to be more fun then any other mmo i've played it is truely awesome only  problem i have is steam/valve has made it were if you to get through steam you have to wait until they  discide to release the up coming expendsin to play it n not when the its release my its makers n high  probaly losing out on pre-order goodies from the expendsin !! *EDIT* !! they did end up releasing expendsin a few weeks before the release so that made me happy",
            "review_score": "1"
        },
        {
            "review_text": "I should really stop playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best MMORPG - Currently out as of 2015, that you actually will have a subscription for.",
            "review_score": "1"
        },
        {
            "review_text": "I used to play World of Warcraft for a few years, until I finally gave another MMO a try. This one seemed very promising and boy was I right. The game has such amazing visuals, at least for an MMO of this style, the story is well written, dungeons and partying up is extremely fun, and the fact that you do not have to make a million characters to play all the different classes, you can just make one character and master all the classes and jobs with that one character. It's an awesome game, I bought it about a week ago and already put 60 hours into the game.",
            "review_score": "1"
        },
        {
            "review_text": "See the real challenge of the game is joining the server you want. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, a bit slow to start with hopefully start picking up",
            "review_score": "1"
        },
        {
            "review_text": "Having played (and still am playing) World of Warcraft I've been over the MMO market to find one as fun as WoW. Warhammer Online didnt work for me, The Old Republic had nothing in the way of content (also its Star Wars, don't heavily like the series), Maple Story was ok in small doses, and Tera, while pretty, has one ♥♥♥♥ community.  So while I knew of the original FFXI I never played it and got the basics from hearsay, and the original launch of FFXIV left me glad I had no interest, cut to the present and SE decided to pull it, rework the game, and with Naoki Yoshida's wonderful direction remade and released a truly fantastic MMO that reminded me of the first time I played WoW.  Eorzea literally grabbed me like Azeroth first did and I was everywhere, I had my first timer bungles yes, but the game is fair in its guidance and shows you where to go. Dungeons are only 4 people instead of a traditional 5 but that also seems to help on content as with 5 you could have one person carry everything with 4 everyone must pull their own weight. Dungeons offer a fine line of challenge, reward, and ease, you do a hard mode dungeon, wipe on a boss several times but push it more and eventually kill it and get loot and no one is mad but glad? Always wonderful.   While young, the games raiding is solid if needs just a bit more tweaking, not I have not done Coil so I cant speak on those as I know they are quite challenging but it all works well and wonderful.  Overall I got my monthly payment of enjoyment, and with the developers constantly working on new content for everyone to do it doesnt get stale, also PLAYER HOUSING!",
            "review_score": "1"
        },
        {
            "review_text": "Hehe one of the better MMO`s out there, got a fantastic story and a solid background. the game acully make u feel like the hero when questing and that you are progressing as you quest. not like most other MMO`s where a quest feels well just like something u have to do to get extra exp. This game`s main quest drags u into a story and inmersion making you feel special as u go.   go try it and experience it yourself :) can be alot of things to learn before the game really opens up for you but you get there a tiny step at a time ^^",
            "review_score": "1"
        },
        {
            "review_text": "you can ride on birds and I have an entire summer in this game so I think that there's an addiction problem that goes along with this but as long as you have access to a good drug-help program then you can play this game",
            "review_score": "1"
        },
        {
            "review_text": "Better than most MMO's/10",
            "review_score": "1"
        },
        {
            "review_text": "(update) i take back what i said its just a great game",
            "review_score": "1"
        },
        {
            "review_text": "If there's an MMO out there today that is worth playing - this is it. Fun dungeons, great group play, hard at times (big plus), you only need 1 character (1 character can be any class you want him to be) and its huge.   10 bucks? It's a steal. You got nothing to lose if you at least try it. Don't worry about the expansion, you won't get to do everything by the time the first 30 days of free game time last. Thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "It'll drag you down to the seventh gate.",
            "review_score": "1"
        },
        {
            "review_text": "Having played my fair share of MMOs I think i can say that, objectively, this is probably the best one to pick up as of the writing of this review. The best way to sum up the good things about this game is that it simply has alot of good original and well implimented ideas. Like being able to play every class on one character, or that your mount can fight with you, the job system that combines two classes into one more powerful one, the fun crafting system that plays out more like combat than crafting. Alot of fresh ideas that work really well. The graphics are very pretty and easy to look at. Runs pretty well on most systems. The animations are very good and make the combat look way cooler and more fun. The only drawbacks I could see for people considering the game is that it still runs off of a subscription model. It also is 'hotbar magic' and some people dont care for that type of combat.",
            "review_score": "1"
        },
        {
            "review_text": "This game has to be my favorite of all time, there is constant updates to insure 1: Quality, they always keep the gaming working extremely well, with little to no issues ever. 2: Content, there is always something to do, with major content drops every 2-3 months. If you enjoy pve, this is definitely a great game, with high end (slightly low accessibility) raid tiers if thats what you are into. There is also excellent crafting and gathering. The only real negative is the pvp. Its there, and they said they are going to continue to refine it, but it just doesn't feel right, some find it fun, but it is different from person to person,",
            "review_score": "1"
        },
        {
            "review_text": "one of the best mmo out there",
            "review_score": "1"
        },
        {
            "review_text": "What's real life again?  Thanks Square Enix...",
            "review_score": "1"
        },
        {
            "review_text": "My friend got me hooked on FFXIV and now I can't stop playing it.  Thanks a lot, you ♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I've played some. Well, all my free time to be honest. Very entertaining game after years of Warcraft. Combat felt bit slow and clunky at start but gets better when you get more levels and skills. Totally worth 10e.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing depth, weird community. Lots of erotic roleplay in random corners.. nothing like waking up in your home to a Miqo'te and Lalafell getting busy on your bed. Fun mechanics, leveling didn't seem grindy and annoying.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. But when you forget your square enix ID. you lose it Dont get it if you have a bad memory if you do is GOOOOOOOOOOOOOOOOOOOD",
            "review_score": "1"
        },
        {
            "review_text": "TWENTY-TWO SECTORS TESTED FRAGMENTS IN ONE DIRECTION CELESTIAL NOISE DETECTED DELIRIUM UNSUSPECTED",
            "review_score": "1"
        },
        {
            "review_text": "The First and the only MMO game i played.",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly one of the MMOs released which is impressive when you remember the original launch of this game was horrible. I may not be playing right now but I very often want to get back into this game, it's that addicting. The graphics are quite beautiful, the story keeps getting better and better, and the community is pretty decent. It's one of the games I highly recommend to other people. Seriously, play this when you have the time, you might be surprised at how addicting it is.",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty good I guess..",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer: I have never played any other Final Fantasy game prior to this so my knowledge or opinion of lore is irrelevant to this review  I've been playing MMOs since 2006, and this is my first subscription based game. I started FFXIV by being bribed by my Guild Wars 2 friends to raid with them. Graphic wise this game is great after being relaunched in 2.0. Gameplay compared to most other MMOs may be slow until you pick up your job, but plays nicely at endgame content. FFXIV offers great cross platform play, accessibility and customization for both the PC and PS4 platform. However, the game still lacks a lot of Quality of Life features such as a wardrobe or dye system from Guild Wars 2.   Whether you're a lore consumer, MMO casual, or hardcore raider. If you are fine with paying a ~$15 subscription fee for hundreds or thousands of hours in an MMO, FFXIV can be an MMO for you.",
            "review_score": "1"
        },
        {
            "review_text": "I played around 20-30 mmos, ranging from f2p to p2p titles like for example aion, lotro, eso, guild wars 1 and guild wars 2, age of conan, the secret world and ofc the many many f2p titles out there like maestia, shaiya etc. you name it. most of these games i did not play long, maybe for a couple of hours, because i was kinda biased through guild wars 1 which was until now my all time favorite mmorpg. ff14 is challenging this, because it is just ♥♥♥♥ing amazing. i can't even begin to describe this game. im even having fun farming resources and crafting stuff, because it is completly different to other titles out there. im dead serious i hate farming and crafting, i find it really boring, but in this game? nope im having so much fun. and the best part for me is, that i can really learn EVERYTHING with one character. i like this freedom. in gw1 you could essentially use all 1250 skills avaiable and try out so many different combinations, granted that's not the same as in this game, you have much less skills, but still it reminds me of this freedom to go and just try stuff and experiment. i missed that much. this game is giving me exactly that. so if you like freedom in a mmo concerning your character then go ahead and try it out. it's just 10 bucks and you will find out in 1 month if you like it or not ;)",
            "review_score": "1"
        },
        {
            "review_text": "Square Enix goes above and beyond to make this a great title among MMOs. Every aspect of the game is really nice to look at, beautiful scenery to appreciate while running around and a lot of flair to every action made by the characters. The story is deep and engaging with a good level of charm to keep things amusing, as is standard with the final fantasy series as a whole. There is a whole lot more strategy to crafting as well, with a system that makes it much more interactive than clicking a button and waiting for 20 things to be done at once (which you can still choose to do to streamline the process if you're not concerned with a loss in experience or a higher failure rate). With the ability to swap between all the classes in the game at any time on the same character, you'll never even need to create more than one to experience everything, there are even specialised story quests for each class for you to enjoy. Whether you're leveling all your classes to the cap level, crafting up a storm and making money, destroying false gods to deck out your gear or just making your house look nice, you'll never run out of things to do either. All in all, probably the best MMO I've had the pleasure of experiencing, I highly look forward to the next update and I can't see myself stopping any time soon. Give it a go, it's definately worth the price even if you only play it for the first month.  If you didn't want to read all that then here's the short version: This game is better than any other MMO I've played, you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Good mmo, no pay to max ding option so get the super fun quest grind going.....",
            "review_score": "1"
        },
        {
            "review_text": "At the time of writing this, I have 218 hours into the game total.   I'm not even at the expansion yet.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty solid I guess, might be worth some time",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice mmorpg game even tho i know nothing about FF series. The only thing i hated about this game is cooldown of the skills, they have global cooldown system so there is no way to fast paced combat. And ofc. sub system sucks.",
            "review_score": "1"
        },
        {
            "review_text": "267 days spent in game so far, I think it's safe to say I have no life.   Thanks Yoshi-P.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an overall amazing and stunning MMO to play and my favorite yet. It is very rare to find an MMO that just completely nails so many amazing features at once. This game has a very nice social aspect to it with a wide variety of emotes, housing, mini games, guilds and more that just allow the very large player base to interact like few other MMOs. This game creates a wonderful atmosphere with it's visually stunning graphic style and quality. It also features one of the hardest sets of raid content I have ever experienced. The game has a large variety of raids and dungeons at varying difficulties that allow for both casual and hard core raiders to enjoy themselves. The easier raids are just slightly more mechanically driven than WoW's Raid Finder while the highest tier of raids take more skill than almost any MMO I have played. This game almost has it all for an amazing target based MMO with amazing developers that literally took a dying game and turned it into my favorite MMO to date. I highly recommend this game to any MMO fan.",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe I haven't reviewed this yet, but my play time should speak for itself. Do not confuse this game with the atrocity that was XIV 1.0. Square Enix literally dropped a Bahamut meteor on that game to crash the servers and reimagine it as the beautiful experience it is today. Graphics are top-notch, at least if you have a decent enough rig to play it on high quality. The community overall is incredible, though your experience will vary by server, play times, and free company allegiance (FFXIV's version of guilds). Inter-played cooperation is mandatory for endgame content, and the game sets you up very nicely to learn your chosen role well by level 50. And then if you decide you don't like that role... all you have to do is switch weapons to a different class and try again.  Hallelujah, no more multiple characters to play multiple classes; I'm looking at you, WoW. Final Fantasy's job system makes it totally feasible to level every class to cap without having to jam up a server with 10 different characters, and you might be surprised by the number of people that do exactly that. Even the crafting system is much more interactive than others I've tried, and it's the crafters and gatherers that drive the game's economy. The sense of community is all-inclusive with plenty of experienced players willing to lend a hand to upstarts, though of course don't expect everyone to be this way. Like any game, this one has its elitists but the funny part is that some of those still haven't beaten the last raid.  The best pieces of advice I can give you are these:  1) If you buy the game, give it until around level 30 to start getting truly fun. That's where you unlock your job (as opposed to your class), earning you extra abilities, and it's where the dungeons start to get really fun. 2) Once you hit level 50, there is a HUGE learning curve jump when you get to extreme mode primals and the Coils of Bahamut. That's not to say these things are impassable, but you will have to buckle down and learn the mechanics rather than expecting a clear on your first try. 3) If you get lost, use the /sh shout function in chat. Talk to someone! I can almost guarantee there will be someone around to lend a helping hand. 4) Listen when people give you advice. 90% of the time, they say it because they want to help improve their server's experience, not because they think you're a n00b that sux. 5) If you're new to the game and chose the Brynhildr server, hit up Taliel Sicilian. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Not what you would expect from anything tagged as Final Fantasy, but still a good game. Beautiful visuals, decent mechanics, and good story.",
            "review_score": "1"
        },
        {
            "review_text": "Its like World of Warcraft but more refreshing and beautiful. Also who doesn't have the fantasy to play as a bad ♥♥♥ cat lady.",
            "review_score": "1"
        },
        {
            "review_text": "NEW VERSION I got in after about a day of trying to get into the server. Once you're settled in, it takes at most 30 seconds to queue into the server on prime time.  I play a tank and I get a lot of love because of that. It appears tanks are extremely rare in this game. I always get the award for playing the most needed class. This is an actual reward in the game.  TUTORIAL The tutorial is huge and extremely good. It's not the type of tutorial that holds your hand, treats you like a baby and gives you little bites. It's a big tutorial that lasts throughout the entire first half of the leveling process. More features of the game open up over time, similar to Guild Wars 2's new player experience but not silly like in GW2.   There are obvious tutorial instances that teach the basics of the trinity and let you actually train and figure out how the mechanics work before you get thrown into a dungeon.  DUNGEONS + DUNGEON ROULETTE There's lots of them. Main quest dungeons, sidequest dungeons, instances that only have a boss in them, etc.  How does it prevent dungeons from being empty? The duty roulette system gives you a massive boost in rewards once per day. You don't pick a specific dungeon. The roulette picks it for you, meaning you never know what you'll get. Meanwhile, players who need to do a dungeon for their quests/items/gear will get their parties filled.  I'll compare this with GW2 that has a party finding/LFG tool. In there, you need to actually search for party members, which works ok witht he LFG tool. In Guild Wars 1 there was no such tool and you could end up waiting for hours to get a party.  WAITING FOR PARTY As I said before, the roulette fills up parties for massive rewards. It's not unheard of to get nearly an entire level worth of exp using the daily roulette. But how fast does it fill up? For me, as soon as I click the button to start up the search.  Why? Because I'm a tank and the guy who dragged me into this game is a healer. We only need to find 2 more DPS guys, of which there are bazillions.   As a tank, I get friend requests all over. People are overly friendly to me. In chats and forums there is talk of not enough tanks in this game. Since I am one, I don't have a problem. But if you prefer playing DPS, you may end up waiting for a while. I've seen players complain about waiting 30 minutes or more.   COMBAT Okay, I'm not a fan of the combat. All I do is press 2 buttons, maybe 3 and just rotate through them. Dungeons may have a few more rotations. Just fighting in the overworld is pretty lame.  Dungeon encounters are quite interesting though. You have the regular trash mobs leading up to the boss. Early bosses are pushovers. They gradually get better  CRAFTING There's a huge expansive crafting system. In fact, the gathering classes and crafting classes are quite fleshed out, similar to the combat classes.  In the beginning it is the old basic ingredient gathering and putting them together. Later on, you need to start making choices, mixed in with a bit of RNG. Using CP, Crafting Points, which are similar to mana points, you can activate skills that can improve the quality of an item, do nothing for a step (this has a use), make you more focused, etc.   Again, comparing with GW2... In GW2 you put 2-4 items together and press craft. That's it. Here, you put 2-5 (or 6?) items together, but they can be of different qualities, which affects the outcome. You activate skills which further change the outcome. Crafting one item takes several steps. These are not ingredient steps but 'attacks' you do. It's not braindead coma crafting.  USEFULNESS OF CRAFTING IN EARLY LEVELS Crafting is actually useful here, even in early levels. I did outlevel my crafting level. I mean, my main tank character got to level 38 but my blacksmith and armorsmith are still around 10. I didn't even need to craft items for my char to use because I got all ym gear from main-quest quest rewards. But that's just one class. There are many other classes and your character can take them all. You onlyneed one character. To swap jobs you swap out your gearset.  When I start building my disciples of magic classes, I'll want to craft a bit for those.  Also, all the quest rewards are normal quality, which is fine. Crafted can get high quality, which has better stats.  Crafting makes more money than it costs, even at low levels. Some items cost 20gil (gold) in ingredients but sell for 500 or more, especially more if it's High Quality.  HOUSING Don't bother. It costs 20 million for a house on my server (the oldest one). 100 hours into the game and I've made 140 000 gil and I'm not even max level yet. I haven't focused on making money but I have been preparing for it. I can make some good coin selling whatever I find but I'm a hoarder and so far my hoarding paid off.  ♥♥♥♥ THEY DONT TELL YOU There's this thing called retainers. These are NPCs you hire. They are needed to sell stuff on the market (trading post). They are also your bank/storage. You get 2 for free.  These retainers can be sent on ventures. That means they will go and gather items for you. Either monster drops, mining, woodcutting or fishing.   You can sell 20 items(for example 20 stacks of items totalling for example 1500 items, so not individual items.) per retainer.   Ventures, unlike what you may read in outdated posts on the internet, are super cheap to buy.  Here's what they don't tell you: You can buy additional retainers, for real money, at about 1-2 bucks per month. This is on top of the subscription fee.  Some don't like that. I don't really care. It may be a reason not to get the game.   It essentially is monthly microtransactions in a sub game.  Speaking of microtransactions... there's a lot of cosmetic things that can go up to and over 25 bucks. Like mounts.   I HAVE NOT REACHED ENDGAME YET I'll update this if I remember to do so.  ---------------------------- OLD VERSION  Friend told me to get this game. Spent the 10 bucks... Been maybe 7 hours since I installed and am still on char creation screen waiting for the server to open.  This may be a common issue in this type of MMO, having full servers and then having to wait and refresh and wait for a spot to open up, waiting for hours or days... it still means you're not actually playing...  While the server selection screen has nice sparklers and new age music harp music, it's not really all that fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Satan. Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy one of the finest JRPG games out there, and it being MMORPG, this game is super amazing, and addictive.",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: After putting in more time, and getting over some account issues. The game has a ton of content, the ability to pick jobs and cross class play...and it's a big plus that the story is actually  interesting (compared to alot of other mmos the story content is usually very stale). Overall this game is great and has an overwhelming amount of content to go thru and do..not even including the  expansion heavensward.   Great game, the ambience and backgrounds are amazing...the music is soothing :) definitely a buy.",
            "review_score": "1"
        },
        {
            "review_text": "love this game long time fan of these and this holds up great!!",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, Fun to play with friends. A real time stealer.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing FFXI for hours on end, day after day until SE announced FFXIV. Then, after waiting for the new game to come out, I couldn't wait to delve into the game.   Boy, was I disappointed.   So were a lot of people. Thankfully, SE listened and completely redesigned FFXIV into FFXIV: ARR. This is what I was hoping for the first time around. It plays enough like FFXI to give you warm fuzzies remembering bygone days, while being different enough to stand on its own in the FF series.   I don't write recommendations for games often unless I really enjoy playing them. This is one game I can see myself playing for 200+ hours with ease without growing tired of the game.",
            "review_score": "1"
        },
        {
            "review_text": "If FFXI required very little interaction with other people, it would be FFXIV. Take that for whatever you want, but I'd still recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "So, i have recently been playing final fantasy xiv for almost 2 months now and i can say that this has been one of the most enjoyable mmos i have ever played. I do not give a second thought to getting world of warcraft again after playing this. community is very accepting and overall just a good group of people. Also this game is beautiful! I find myself going on doing quest and i will stop every now and then and just take in all of the work this team has done to it. On a side note i did play final fantasy 11 the previous final fantasy mmo, while i do miss some features from the old one like certain classes like puppet, blue mage, red mage, I am not playing xiv like its just filling the gap, The story keeps me wanting to play the dungeons are fun to run and the challenges i come across are always making me better in any class i have tried out, (atm white mage is my primary) In the end if you are curious about this game give it a try! you wont be disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "My timeplay says everything.",
            "review_score": "1"
        },
        {
            "review_text": "As one of the MMO players, This game is not bad at all, and I will not compare it to any other game whether it's a bad or good thing. all I have to say is that this game didn't lower my expectations. I can tell you that this game seems more directed towards its story however. Even with a week of experience of playing this game, a friend of mine and I haven't even went passed lvl 10 on our second try. either because of story delay, or just how slow we are. so it isn't really favoring the 'just lvl up and do battlegrounds and raids' but other than that this game kept me really busy. even knowing that i would hit the lvl cap, I would probably make another character. This is a great opportunity to take a monthly break from WoW and other FTP or PTP MMO games.   what also got me interested playing this game is the change on its audio, subtitles, ETC. Regarding that it's developed by SE. I really can't stand english voice acting. Upon knowing this as soon I started listening to Japanese voice actors, I felt comfortable playing the game. I don't know about you guys, but After playing a few games that originated in Japan, the difference between voice acting is sychronizing with the mood. That's how I see it. When it comes to english voice acting, I always expect few if not most, messed up on certain occasions, and I'm always afraid it's always on the best parts.  That's all I can offer on my review on this. I'm sure there are more helpful ones than mine.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best MMOs I've played",
            "review_score": "1"
        },
        {
            "review_text": "It's alright.",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun game. reminds me of tera",
            "review_score": "1"
        },
        {
            "review_text": "I have not played a FF since 13-2... Never played 11 online either. My faves were 7,8,9 and 10. As crazy as it sounds I really liked 12 except for the summoning part. So a friend convinced me to get it. I have 1 day playing this game and I am hooked. Everything I love about FF is all coming back to me and the battle system is alot better than what I expected. I have been playing Xbox One and guarantee I am not going back to console for a very good while if at all at that. Highly recommend this game. If you have been wanting to try and have doubts dont wait just get it. I kept looking at this for 2 yrs and I should of had this game a long time ago. A must have for Final Fantasy lovers!",
            "review_score": "1"
        },
        {
            "review_text": "my recommendation is a 51/49 yes  the game is fun up until you get to end-game (at least from when this review is written, we'll see future updates)  but they are abusing player's time  if you wanna do end-game things, you better not have a IRL job and no friends to play with, because you're never going to get maxed jobs/classes (jobs as in gathering + crafting) with all fully equipped  there's not enough time to do all that, mainly because of how limited you are, /450 gathering/crafting points a week for example...  also for the anima weapon (the very end-game weapon you can get) there are, at the moment, 3 steps to level it... one is doing some fates... that... ok... takes maybe 2-3 hours for each things in that step (like on 5-6 maps)  then it's doing dungeons, also easy  then you need to farm different things, but if you wanna play more casually, like me and my friend, you need to farm EVERY DAY NON STOP FOR 3 MONTHS!! no joking, it's about 87 days... the tribe quests (not the last, vanu one, which would be even worst) but the 4 other tribes  those tribe quests takes like 30 mins to do a day... IF you're lucky and not get into fate quests because some of them can take 30 mins or even 1h to 1h30 to pop (that one in sylph tribe...)  ok i'll be nice and inform about the reason of it being so slow : i sometimes do them at night and there's no one playing, so no one doing the fates and so it takes longer to pop those ones you need  so farm it for 3 months is the best casual-way   and in that same step afterwards you need to craft 4 times each 4 different items (each one of a different crafting job) in high quality...  so you already need to get your crafting and gathering jobs up to that point... and you can only have 3 job crystals at a time, with that 450 point limit a week it will take forever even with the best items equipped -_-    so basically end game = work-at-farm fest   and this is in 'game' category working isn't playing",
            "review_score": "1"
        },
        {
            "review_text": "One fateful day, a close friend of mine messaged me with a simple, yet life-changing sentence. To quote this amazing man: 'Ayy yo, I'm hooked to ff14. You should get it, you can play as a cat-girl.' The only word that stood out the me was cat-girl, at the sight of said word, I immediately bought and downloaded the game. I regret nothing, I can now play as the kawaii desu cat-girl of my dreams.  I regret nothing, and I am ready to spend the rest of my free time on this game,",
            "review_score": "1"
        },
        {
            "review_text": "Great game, you can get a lot done in little time with this game. It's not like the mmorpgs of yesterday where you need to commit half of the day to get anything done.",
            "review_score": "1"
        },
        {
            "review_text": "If you love the final fantasy franchise and dont mind a subscription based game then this is a must have. Even though they westernized a lot of the gameplay unlike ff11 and ff14 1.0, the game has not lost too much of its Japanese charm. I have enjoyed the small amount of hours i have so far put into this game. Oh and one of the main trumps of ff14arr over other mmorpgs is that you can progress every class and profession on one character. I love this facilty.",
            "review_score": "1"
        },
        {
            "review_text": "Its ok I guess.",
            "review_score": "1"
        },
        {
            "review_text": "Addicted to this game. 55 hours in 3 days. Ruined my life. 5/5 stars",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most fun I've had in a while!!! The graphics and music are awesome. The gameplay is very polished and the crafting system is fun!! The main story is very immersive~ The customization options are awesome, you can get your character to look so pretty. My only complaint is about the maps! It's so difficult to learn where the hell you are at first, but once you get the hang of it, it's ok. 10/10 from me for sure!!",
            "review_score": "1"
        },
        {
            "review_text": "Good community and a good game. Well worth the subscription price and is constantly improving.",
            "review_score": "1"
        },
        {
            "review_text": "So I tried this game for a year. It's time for a honest review.  I must say, the game is fun, but after a while it becomes very repetitive. It's your average everyday MMO, and it's very typical for the Asian Culture to adapt to grinding. This game does involve alot of grinding.   The story is okay. Not yay jump out of your chairs. It is way better than ESO, however, despite lack of voice acting. If not so much of a reader, I won't recommend this game.  PVP is ♥♥♥♥ on here. Not to mention, dead. You'll have a better chance forming up a party and run a dungeon or two, but that eventually gets boring. Speaking of forming a party, you also have to know how to tank, dps, or heal, depending on your role, unless you want to get bagged on and bullied. The community here is somewhat friendly, but there's alot of elitists that somehow feel they're entitled to pick on other players, even though they were all noobs one time.  The game lacks mini games or should I say distractions. Yes, there's Levi's, Fates, Golden Saucer, and Chocobo racing, but it lacks executiuon. The very least, Levi's is all about escorting and battling monsters. Almost the same as doing the quests and hunting. Fates is all about battling and battling mini bosses. Battle, battle, battle another words... Then Golden Saucer is the run down version of the actual Saucer that should've existed from FF7. Only appealing thing behind it is Triple Triad, which is meh, and the Chocobo Racing is a JOKE. Hardly delivers a challenge and lot of the times I feel like I'm racing against NPC's more so than players.   This game will drag the user down pretty quick when it comes to progressing. Unless one really loves to grind, and loves to focus on one class and literally put in the 10-12 hours into the game, one is going to either jump through class to class to be flexible and prevent boredom or one will simply quit because as I will state, the game becomes extremely repetitive.   The race choosing is extremely bias. Not to mention, the gender choice. I've found more male players create their fantasy waifu girl than those who're legit females as one example. It's a very sexist game. There's also more lalafells and mon's in the game than there is the other three races. PRetty much what it boils down to is you're either a sexy cat lady or a jailbait child.   Last but not least, the membership. This is a luxury game, you have to remember this. It's graphics and battle mechanics are WAY worth purchasing than WOW's; however, depending on how much of a character lover you are, this game will hurt your wallet per month. It doesn't have benefits behind what one chooses, unless one is willing to pay 14.99 or more depending on the contract one signs. Then one will receive small bonuses throughout the veteran program this game makes, getting costumes, mounts, etc. But nothing good or valid that is worth pursuing.   So here's a brief review of what I experienced in the game. I come back every now and then, sure, but this game doesn't attach to me. I come from Runescape. I don't wish to play traditional turn base MMO's anymore. They get repeitive and boring. This game has also turned into a fashion rolemodel, and not an actual FF game. Which is why I left out of the other con's I've mentioned.  Hope this helps.",
            "review_score": "-1"
        },
        {
            "review_text": "Casual game but not in the bad way. ",
            "review_score": "1"
        },
        {
            "review_text": "7.8/10, too much seafood soup.  You gotta be squiddin' me.",
            "review_score": "1"
        },
        {
            "review_text": "       FF + Sleep    NO GRADES NO LIFE        FF + School    NO LIFE NO SLEEP         School + Sleep     ♥♥♥♥ THIS NO FF NO LIFE       I think this table pretty much sums up about life after the introduction of Final Fantasy XIV: A Realm Reborn. This game is about grinding, those of you who have played FF X should know the pain of grinding. But in FF14, grinding is much better than before, because of all the things you can do. Look, FF14 is so diverse that I've met all kinds of people. A normal MMORPG divides into PvE or PvP group, yet, in FF14, there are way more groups than you thought. One of my friends only level crafting and has little levels when it comes to combat classes. One of my friend only focus on PvP in wolf den, and doesnt care much about raiding because it's really hard to find a good pug if you are not in a major free company that focus on pushing through turns and dungeons. Overall, this game wins at diversity. The things you can do in this game is just unlimited, but be aware my friend, once you introduce FF14 into your life. Say Byebye.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on Tuesday... It's still Tuesday 3 weeks in the future though  and i have no recollection of what happened during those 3 weeks  At least i have a high leveled character...  10/10 best amnesia simulator 2016 Would lose my memory again",
            "review_score": "1"
        },
        {
            "review_text": "Your Waifu: This To Do When Getting This Game  1.Make Your Waifu 2.Pick White Mage Class 3.Make Her into a Female Lalafell  4.Call Her A Loli 5.Fight Monsters 6.Repeat Step 5 Until Reach Max Level 7.Do A Raid 8.Get Kick From Raiding  9.Spend Gil On Pointless Waifu stuff 10.Log Off For The Day  11.Repeat All steps Next Day  11/10 Would make waifu again",
            "review_score": "1"
        },
        {
            "review_text": "Dis game ish lit.",
            "review_score": "1"
        },
        {
            "review_text": "Just good fun and the ability to be any class at anytime without haveing to make new characters is a great way to keep you interested, and the story is good but when you hit the expansion it becomes great and kept me playing long hours to see how it wrapped up.",
            "review_score": "1"
        },
        {
            "review_text": "Best MMO I've Played 10/10",
            "review_score": "1"
        },
        {
            "review_text": "i played this ♥♥♥♥ing game for seven hours yesterday what is wrong with me",
            "review_score": "1"
        },
        {
            "review_text": "Excellent MMO. Similar to WoW on many aspect, but there is a story line. If you like difficult technical fights, the end game is for you !",
            "review_score": "1"
        },
        {
            "review_text": "Fun casual MMO. worth the $20 for a month of play. still in first month as of writing this, might sub for more. not sure ",
            "review_score": "1"
        },
        {
            "review_text": "This MMO is very versatile, but is pay to play. The catch behind this is that you only need ONE character to get everything you want in the game. You will have access to all the classes, be able to make your own armor and weaponry, and don't necessarily have to spend any gil until after endgame. However, leveling can be a bit of a hassle during certain points, but there are ways to level up quickly. If you really like the Final Fantasy series, this game is for you. Not to mention this game is beautifly done and doesn't require too much effort to get through the content.",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop playing",
            "review_score": "1"
        },
        {
            "review_text": "FINAL FANTASY XIV: A Realm Reborn reveiw helo people of the community this is my reveiw of the game   The goood things   it got a nice story the reson that it is good is beuase you the player of the game can change  how you look and see your self in the main story and even in quests  player houseing. player houseing is very well done but for new players thay will have a hard time  geting a house but when thay do will be able to build thier land any way thay wish   player class is able to be any class that you have unlocked on any person so that meens you dont need alts were you can just use 1 person and be able to have all the classis  sounds and maps lovely songs and map that fit the game well   crafting skills thay every did the crafting skills well beuase you can make so much items   fates i love how thay do the fates as it allows people to beable to do it to geter  citys and lay each class hads it own starter city in the game and you can even telport around the aera   the bad things fates people who have mounts unlocked with clear the fate before u get to it  or if people are high lvl   maps does not show a lvl zone on the map or world map i thank it would be usefull to new players   dugons some of them if you are doing the main storty line can take ageis if your a dps class   also the last bad thing is the dlc for this game to beable to even get in to it you have to do so many quests .  thank you for reading my reveiw sorry if it dont go to your veiws i would rate this game a 9.5 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for a little while, took a lot of breaks back in the day when it first came out on the PS3. I can honestly recommend it to anyone who's looking for an incredibly high quality MMORPG. With a fantastic job system, and a story that's actually worth the time that it takes to get through it all for once which for an MMO is really good. I honestly can't remember the last time I enjoyed the story to an MMO like I do this one.   The game relies on the classic holy trinity of Roles (tank/DPS/Healer), and the way it's done is fairly cut and dry, every job fills one role and cannot fill any other role in the duty finder, although this would normally end up being pretty boring, they mitigate that issue by allowing you to change your class pretty well whenever you want, and all you have to do is just take the new job's quests and change your weapon, which I love.  All in all I can recommend this game to MMO fans who both want a challenge and a really well done story. Also save me please I've spend too many hours of my life already in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Who needs sunshine when you have a digital pixelated sun in your game. &gt;Ruined my social life &gt;Grew a neckbeard &gt;Lacking nurishment &gt;No vitamin D 10/10 Best game ever-ign",
            "review_score": "1"
        },
        {
            "review_text": "It's somewhat entertaining",
            "review_score": "1"
        },
        {
            "review_text": "So I've played this game for the past 2 months and a half and I have 15 days till the end of my subscription and I nearly have 800 hours on the game.  800 hours is the equivalent of 33.3333 days and that is nearly half of my life in the past 2 months and a half gone ;w;  Please... Listen to my words and don't buy this game or SE will come to your house and then they will get crack their knuckles and ADIBUSBUQWBOEQWBUOR[ETB[OQEEEEEEEEEEEEEEBUQ[EBQEBQBQDUFQEDURWQE9BRQ9EURBQER.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy the Final Fantasy XIV. Pleanty of things to do to not get bored, interesting storyline and all around fun.",
            "review_score": "1"
        },
        {
            "review_text": "It is really good.",
            "review_score": "1"
        },
        {
            "review_text": "Id you're looking fro a fun new MMO with tons of stuff to do this is it. The sub is worth with all the content this shoots at you. Even if you're not a fan of Final Fantasy you'll get a kick out of all the references.",
            "review_score": "1"
        },
        {
            "review_text": "Background: Huge Final Fantasy Fan, Bought a PS4 just for FF7 Remake. Anyways!  Replayability: Now this is a weird one. You can swap out the class of your character by merely going into the menus, and putting the correct equipment on. You then get to experience that class story. It is actually 100% recommended and I would go as far as to say it is required as you need at least 2 classes to obtain the Advanced Classes. But this is true for most Final Fantasy Games.  Combat Options: Final Fantasy XIV is the 2nd attempt at a FF Themed MMORPG. For those of you with vast FF backgrounds the Combat type is FFXII with more control of your character placement and equipment slots. For those not familiar with FFXII it is an Active Time battle played out in the general vicinity of enemy spawn points, meaning you can run by just physically running away but you can also attract more enemies as well.   Social Options: The game has been around enough to have many guilds on every instance Server. Experience is shared between those who participate, not just the initial aggressor which means you can't 100% kill steal something, which is a problem in other games.   Final Thoughts: I have since retired from this game after 628 hours due to Burnout...I have great respect for those who continue the good fight, but I just can't continue.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic MMO with a fantastic world. The FATEs and instanced group duties get you cooperating with other players, something which I really enjoy doing in MMOs. If you're unhappy with the class you chose, you don't have to create a brand new character, you can just change classes (a nod to the Job System sometimes seen in the Final Fantasy series, as introduced in Final Fantasy V). You do have to level up again to get to the level you were at before, but that means that you get to have a feel of the new class you chose.",
            "review_score": "1"
        },
        {
            "review_text": "Best MMO I have ever played!! Great game",
            "review_score": "1"
        },
        {
            "review_text": "It's okay, I guess",
            "review_score": "1"
        },
        {
            "review_text": "A very solid, fun and addictive MMORPG, the best MMO I have ever played to say the least. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "When Final Fantasy XIV Online first came out, it was beyond god-awful and insulting. And I thought it was the end of Square Enix. Luckily there's new staff members to re-fix everything and re-release it as A Realm Reborn: Final Fantasy XIV Online. They're not joking when everything that was once terrible is now reborn as one beautifully epic MMORPG. The storylines, community, and gameplay is reborn to what you always wanted to see in Final Fantasy XIV Online. You can say it's reborn as one of the best World of Warcraft killers. Not only that but their successful gain awards of Best MMORPG Of The Year and over 2 million subscribers and growing.  Do I recommend A Realm Reborn: Final Fantasy XIV Online? Yes, I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "I'm only level 9 - but I'm loving the game so far. Not as polished as WoW, but a great alternative, especially if you're looking something different ! Best feature, IMO ? Fully supported controller UI.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fantastic for new and seasoned MMORPG players! I think it will be interesting to see how this game grows with the fan base.",
            "review_score": "1"
        },
        {
            "review_text": "+ Solid Gameplay  + Good Graphics + Amazing Soundtracks + Great Boss Fights   - DPS queue times - Weak PvP - End game grind  Score: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "  What is it?",
            "review_score": "1"
        },
        {
            "review_text": "This game is life ruining. 5/5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Great MMO. Game with lot of things to do.Awesome End Game. I can recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Final Fanatasy 14: A Realm Reborn is a generic MMO with absolutely nothing whatsoever to recommend it. The world is generic and dull, the characters uninteresting, the storyline unengaging, the quests a litany of standard MMO quests that have no real substance to them, and the dungeons mostly uninteresting as well.  You can sink months of time into this game unlocking everything, but you would be a fool for doing so; there is no satisfaction there, nothing to really be gained.  You have better things to do with your time, let alone your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Long time favourite MMO-RPG I have ever played. Let me know if you want to play with me ^^",
            "review_score": "1"
        },
        {
            "review_text": "At first, the game seems amazing. Bright, fun world to explore, challenging content, all these classes and jobs to learn... It was really fun getting into. I became obsessed with getting gear, learning rotations, learning the ins and outs of my main classes. It has to be said, tab-targeting hotkey combat may not be for everyone (and if its not go ahead and stop reading and don't play this game), but for me at least there's something extremely satisfying and enjoyable in that itself. Button mashing, trying to max your DPS, or desperately trying to hold aggro with low level Paladin (kms). It left me with a sense of reward and accomplishment when I cleared something for the first time, or got player commendations.   Leveling and experiencing everything for the first time was amazing. And the ability to swap to a different class (on the same character which is an AMAZING mechanic) and learn the class was enough to create the same illusion. But that illusion wore off on me.   Then I saw that I was basically doing the same thing, over and over again, and not really getting any different results. Hmm isn't that called insanity?  The RNG system just isn't too... forgiving. I rarely actually get better gear from dungeons/raids. So what are my other options for endgame gear? Incredibly tedious tasks like farming boring dynamic events, running old dungeons, running the same dungeon over and over again just to get currency to buy the things I need to just get a single STEP closer to that one weapon. Or doing raids in pubs where the party doesn't work together properly and you wipe several times, and again, just for an RNG shot at gear. Granted, if I had an huge, active FC I wouldn't have to deal with pubs but, that wasn't the case for me.   I've taken several breaks, trying to come back over and over to chase that feeling I initially had starting out when everything was still fresh. But for me, it just got the point where I asked myself, why do I keep resubbing? I'm not motivated to do anything because its all more of the same. To be honest, the best part about the game at this point for me is how cute my catgirl character is. Dressing her up with glamour is about all I do, so I think it's time I really stop throwing more and more money into this grindfest and put towards something that doesn't make me feel bored and exhausted. I'm bored and exhausted at my part-time job but they pay me for it, I don't pay them lol.  So overall, if you want to try something new or are coming from a different MMO, at least try it out for a little while, get as much use out of it as you can. But don't let the completionist part of you take over and suck the life out of you like it did me. Because this game is a black hole of grind. If you want to come even close to being geared out, this black hole will absorb all your light. (yay astronomy references) At least in grindy games like Diablo or Warframe, the combat and envirornments and variety of ways to play the game keep you interested. Maybe I just don't like MMORPG's?  If you're looking for a grindfest slot machine / quest completing simulator this is your game. If you're looking for something more entertaining and exciting, the erotic role play in this game can only go so far.  I did enjoy some of my time in this game (mostly the ERP), but I'm going to have to say I don't recommend this game. The overwhelming amount of crap I had to do and time I wasted just doesn't out weight it. And most people give this game positive reviews so I'm like screw em. I sold my Pink DDPAT AWP to buy my last sub, and it's wasted :'(",
            "review_score": "-1"
        },
        {
            "review_text": "You can pay 15 gil to ride a chocobo for 5 minutes. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "B-but mom... I can quit anytime I want to!",
            "review_score": "1"
        },
        {
            "review_text": "with the new steam refunds system i thought hey i would buy this game and try it out, so i spent 50$ on it, and downloaded it, clicked play... then it had a launcher, meaning i had only downloaded HALF THE GAME so i started downloading, played the game for a hour once it was done downloading.... dident like it so i whent for refund... and was denied cause i had played for 11 hours.... steam needs to stop letting these games have launchers it artificily extends play time, i played for 1 hour, but cause i had to download it in its launcher i 'played' for 11, meaning i cant get my money back, so ton of time and money wasted... steam either needs to force games to use the steam updater so that you dont have to update it on steam then update it again on the launcher, or set a much longer maximum time for them as to allow for time to download the game... so basicly if you wanna play this game, you will not be able to refund it no matter how little time you spend IN THE GAME",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great, Buy it ASAP",
            "review_score": "1"
        },
        {
            "review_text": "I think I'll have to stop at some point to go to the bathroom",
            "review_score": "1"
        },
        {
            "review_text": "I do not recommend this game. For the following reasons I cannot recommend anyone spend their time on this game without significant improvements made to account set up and initial updating.  In life there are certain necessities: obtaining resources, developing skills, overcoming obstacles and entertainment to name a few. What motivates one must satisfy a need with a reasonable investment of time and effort. My sole purpose in this game is to play as an imaginary character in an imaginary world filled with imaginary things. As a purchaser I cannot make money, or update my resume with anything related to this effort which is now becoming something of an unjustifiable obstacle relative to the outcome.  I will now chronicle the genesis of this obstacle in order to play as an imaginary character in an imaginary world filled with imaginary things (a meager need that has yet to be satisfied):   1.) I purchased the game on steam and installed it - no problem.   2.) Upon starting the game I needed to set up a Square Enix account which I attempted to do through the launcher (naturally, as the option is provided right there). In my experience, this was a convoluted, glitchy process that resulted in several attempts and approximately two hours of my time wasted. As setting up an account is usually a straightforward process I did not make a log like a dutiful beta tester. Essentially, my email was at once recognized to the extent I could not repeat the registration process to clarify what might have gone wrong, yet not recognized to the extent I could not recover a password. Eventually I simply made an account directly through the Square Enix website. A painless, wonderful and perfectly pedestrian result that by comparison had me shouting joyfully 'It's alive! It's alive' with Handel's 'Messiah' ringing in my head.  3.) After the account was set up I could then update the game. Whereas the registration was likely to have different results for different people depending on wind currents caused by butterfly wings and their relationship to which particle collider test had run on a that day with reference to the alignment of various celestial bodies, the size of the update is massive - and is taking a long time.  With reference to needs and motivation I have run a gauntlet with no satisfaction in sight for another 1386 minutes, and at this point am making two major recommendations:   1.) If the option to create an account via the launcher is intended, it needs to be as simple as creating an account on the website. My experience has shown a discrepancy in ease of use between the two.  2.) The initial update is as massive as the investment of time required for the game to be ready to play; a possible way to mitigate this is to sell a more recent version. If this has no effect on overall download time, find ways to make it more effiecient.  At this point I will complete the updating process, but cannot recommend this game unless these two recommendations are given serious consideration. Butterfly wings and all.   Update: Day1 of gameplay. Still can't recommend this game due to problems out of the gate, but the game itself seems pretty solid.  Aesthetics are very pleasing while keeping the kibble to a minimum; map so far looks good.  No comment on quests yet as I have not progressed much past the tutorial.  Overall get the feeling the learning curve for the game is worth the patience it will take to master.",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked this game, but leveling is a chore and a half, simply because you run out of things to do quick when you end up having to level an alt. A large chunk of your experience comes from the story mission and you can only do that once, so afterwards you find yourself struggling to get things done. The final blow for me came when I realized I only had a limited amount of Leve missions and I had wasted them on early levels for my alternative class (to unlock my first job), which meant I would have to wait several days for my Chocobo. The idea that I would have to run around for three days was just mindnumbingly traumatic for me, so I logged off and said goodbye, with only minimal sadness. I would suggest trying out the two week trial before paying for this game. Some people might like it, but most don't seem to.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this horrible game infesting my computer with aids and itchy ♥♥♥♥ rash's. If i had a dad for everytime this game crashed/disconnected i wouldn't be black skinned. Ima do my own dog pretty soon this game hates my life as much as i hate my computer everytime it locks up.  kill me now god bless   Thanks, Kyle",
            "review_score": "-1"
        },
        {
            "review_text": "Step 1 download 8.4 gig installer Step 2 download 16 gig update step 3 restart game and repeat from step 1!   DO NOT GET THIS GAME FROM STEAM!!!! get it from ffxiv-freetrial com/us/ and save the headache",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great! A completely new Final Fantasy Experience unlike any other! (With exception from FFXI) I greatly recommend getting this game.  It's a great blend of the classic tab-targeting system we all know from games such as WoW but it mixes it up greatly with each class(job)'s playstyle which vastly differs from each other.  The regular large FREE updates every 3-4 months also keeps the game alive and well which makes it great fun even after playing for ages!  BUT! DO NOT BUY IT ON STEAM! NO MATTER WHAT!  NO STEAM!  Buy it from anywhere but here, as steam will force you to buy additional expansions and such from them. There is no way to back out once you buy it. Save yourself from their greasy pockets and buy it elsewhere! You will not regret that decision.",
            "review_score": "1"
        },
        {
            "review_text": "Get your crayon! I'm G to the D, gold and diamonds 10/10",
            "review_score": "1"
        },
        {
            "review_text": "What does the sun look like? 10/10 would grind atma again.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Speechless. Amazing , Beautiful , spetacular !! , a 9.5 / 10 from me ^.^,",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, nice job square enix, this game is so huge many classes, many itens and the dungeons is epic!!! Perfect game!",
            "review_score": "1"
        },
        {
            "review_text": "easy to learn smooth game. awesome graphics very little bugs. escape FORM REALITY TO A FANTASy",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, lovely people, rather gorgeous. Spend thousands of hours and never regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Got a little time into it. It's okay I guess 5/10.",
            "review_score": "1"
        },
        {
            "review_text": "If you are tired of world of warcraft, then this is your next awesome MMORPG :)",
            "review_score": "1"
        },
        {
            "review_text": "Finally finished creating my character and got throung the opening cutscene, I can feel that this is going to be one hell of a ride!!!",
            "review_score": "1"
        },
        {
            "review_text": "I can ride a fat chicken 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Tried to download the patches with the launcher but as soon as it (i think) finishes the 2015.05.26 patch, it would just decide to crash with an error saying ''Unable to download patch files. [30413] [25008] [20495]''   I tried a few things to try and fix it but nope.   The game looks really great though, but it's a shame I can't play it. I could reccomend this game anyway but I guess I won't play it, be warned if your gonna buy it.   If theirs anyone willing to help me out with this, feel free.",
            "review_score": "-1"
        },
        {
            "review_text": "Love the game , but I hate how the people I raid with just gave up soo easily on boss fights. These people need to play WoW.  Great game  Community needs to a little more hardcore in terms of raiding.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! I just wish it was easier to keep the subscription going XD",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good, The Map is a little confusing at the start but you get used too it. I love how you can have all the classes on the same character and not switch every single time. I give this game a 9/10 because of monthly subscription.",
            "review_score": "1"
        },
        {
            "review_text": "Great games, just don't buy it from steam if you ever want play. Spent all day unistalling, and installing. Ticking, and unticking, Your system needs help!",
            "review_score": "1"
        },
        {
            "review_text": "It's okay, I guess.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the game, but for the last few days, it's unpossible to play. I'm disconnected all 2 minutes. And I am, okay actually was, paying for that. Thanks devs for this great game, but the servers you are running make this game a fail to me.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game if you like Final Fantasy and don't mind P2P. I suggest giving the free trial a try before purchasing to see if its your thing.",
            "review_score": "1"
        },
        {
            "review_text": "I'll get back to you once i hit 1000 hours but so far so good",
            "review_score": "1"
        },
        {
            "review_text": "(Note: I've played the demo so I've got about 12 or so more hours than what my account says)  As someone who normally hate's mmo's I loved this game.  Con's 1. The game IS subscription based 2. There's that annoying gold seller who likes to spam chat. 3. The game could have better running controls 4. There’s no option to touch the fluffy tail  Pro's 1. The story plays like a FF title. I often recalled my adventures with Cecil and crew when main quests and watching cut scenes 2. You get what you pay for. While the 19.99 a month tag is pricy the game is well maintained. 3. The character creation is Amazing! I spent a good four to five minutes working on my character and I love how he turned out. 4. The class system is similar to FFTactics but much more dynamic 5. You can however select another player with a fluffy tail and type /pet in dialogue thus touching the fluffy tail ",
            "review_score": "1"
        },
        {
            "review_text": "I think I have finished the prologue",
            "review_score": "1"
        },
        {
            "review_text": "The game certainly has its low and high points. It's ok. 11/10 would sacrifice my firstborn to square for more subscription time.",
            "review_score": "1"
        },
        {
            "review_text": "It's okay, but since ive played World of Warcraft there isn't really any MMORPG that compete. Even know WOW still holds its throne. Sadly for a game that offers better graphics fails at where a game as old as WOW can still be it at, immersive gameplay. In WOW you can walk an entire contentinet without a loading screen anywhere and there isnt a load screen in any parts of the city. In FF14 that isn't the case each area has to load and the cities though not very big still have to load different parts of it. It's almost like a trade off, you get really nice Final Fanasty graphics but loose the immersive gameplay that WOW offers in a seemless open world. FF14 has great graphics close up but background drops and things in the distant it feels like they kinda gave up. Whereas in WOW you can go to anywhere you can see. Though wow does have the greatest graphics i admit, it honestly has an artstyle to it that i think most people perfer to than what FF14 has to offer. The questing system is really boring in the game. Not to say the the questing system in WOW was much better but they were a little bit more tolerable to say the least. In FF14 they have some much heavy dialog as you would expect from a FInal Fanasty game, and makes the questing drag out and i found myself really not caring why i was doing the quest and it didnt have an impact for the game. WOW on the other hand has the new 'phasing' where if you do a certain quest change you can impact the world around you which is a awesome feature to have a MMORPG. FF14 hasnt had anything like that and i feel like i just dont do anything significant in game. Leveling from 1-15 feels ALOT and i mean ALOT slower than leveling in WOW. In FF14 it took 13 hours to reach 15. WOW has made the leveling system more smoother and faster, getting to level 15 in just 4 hours. All in all its not bad, but if you're looking for a MMORPG to play and you haven't looked or played any other MMORPG then this game might be fun for you. But since i have played WOW i have a higher standard that WOW set forth.",
            "review_score": "1"
        },
        {
            "review_text": "You can play as a cat girl. What more do you need to know?",
            "review_score": "1"
        },
        {
            "review_text": "It's alright I guess",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played enough to say",
            "review_score": "1"
        },
        {
            "review_text": "Hildibrand Visual Novel Spinoff game please.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Really enjoying it. Graphics are absolutely amazing.",
            "review_score": "1"
        },
        {
            "review_text": "A good story, followed by either bashing your head fruitlessly against Pepsiman, or running errands for Moogles in the name of *FASHION* (TM)",
            "review_score": "1"
        },
        {
            "review_text": "This is great game. I'm still learning how to play it and I have a friend teaching me the basics but so far I'm enjoying it and I would recommend this for anyone who loves MMO games.",
            "review_score": "1"
        },
        {
            "review_text": "If any MMO is gonna replace WoW, its this one.",
            "review_score": "1"
        },
        {
            "review_text": "Chocobo tastes like chicken",
            "review_score": "1"
        },
        {
            "review_text": "would waste my life again 10/9",
            "review_score": "1"
        },
        {
            "review_text": "there is like enemies and you can kill stuff, its fun",
            "review_score": "1"
        },
        {
            "review_text": "If you need a game to spend an (awful) lot of time on, then look no further. Final Fantasy XIV: A realm Reborn is all that you will need, especially with the huge amount of quests and side quests that the game currently has to offer.  Like any MMORPG, FFXIV ARR has different classes, that all work differently. Tanks being the Warrior (Maurauder) and Paladin (Gladiator), the healers being Scholar (Arcanist) and White mage (Conjurer), and finally, the DPS being Dragoon (Lancer), Summoner (Arcanist), Black Mage (Conjurer), Monk (Pugilist), ninja (Rogue) and Bard (Archer). Each class has plenty of abilities to explore, and all play differently, so there's definitely a lot of content there.   That being said, I don't think all classes are equally fun to play. Dragoons and Warriors aren't the funnest to play, but the fun classes definitely make up for that. My personal reccomendations would be:  Tank: Paladin Healer: White Mage &amp; Scholar DPS: Monk, Black Mage, Summoner  Classes themselves are a lot of fun to explore, especially because the way the game handles classchanges: just simply change weapon, and your character becomes that class. No need for additional characters, or a lot of abra cadabra to change around a class, but very straight forward and easy. Even a casual outfit is possible, for in your 'spare time', and hiding your weapons / headpieces on these is done with the single click of a button.   Besides combat classes, the game also offers multiple jobs to do, which you can also access with the same system. It's possible to craft your own weapons and armor with the different classes the game has to offer, or make extra Gil (= in game currency) with gatherers or with the same professions. Although not all of them are equally fun, there's plenty of fun to be had here as well. The only classes i don't really recommend here, except maybe for the gil, are miner, fisher and cook. Sadly, cooking seems a bit pointless in the game from as far as i've found out, except for slight XP boosts, or some additional effects.   The classes are easy to understand and straight forward. If you level one class far enough, you even get the possibilty to use certain abilities of one class on another, in a nice cross class system. Say for example you have a level 50 warrior, and want to use tank abilities that your level 18 gladiator has. It would be possible to have a couple of these abilities on your high leveled warrior, for more tanking badassery.   That's enough ♥♥♥♥ about the classes, now onto the juicy quests and most important of all, the badass l00t! :D  ♥♥♥♥'s good. Go get it.   But in all seriousness, although there are a lot of 'Go fetch', 'travel 'round the world for me' and 'go feed dem soldiers, guardian of light' missions, which unfortunately are boring and a lot of running around, the GOOD missions definitely make up for this. You can go into dungeons, trials (read bosses), guildhests (read tutorials) can farm F.A.T.E's (read events) and leves (read ♥♥♥♥♥♥♥♥s of xp for 'allowances'). Most of them definitely help level up your character, but when you reach max level, only trials, dungeons and raids would be in your interest, along with marks. These give you the epic l00t you were looking for :3  You don't have to l00t the defeated enemies, but drops will automatically be added to your inventory.   If you didn't feel like reading it all, there's also a TL,DR version:  TLDR:  ♥♥♥♥'s good. Classes be fun. L00T epic. Go buy it.",
            "review_score": "1"
        },
        {
            "review_text": "If you love mmorpg's this is the game for you. It has a fun, exiting, deep, and unique story that you want to pay attencion to. Nothing in this game is repetitive at all, so if you come from an another mmo you don't feel like you have played it before. The combat system is amazing, and dungeons, raids and trials are so much fun! Each role pays a big part when you play together with someone, so you feel like you are really into it and helping out. The game itself is beautiful, the scenery, world, and even small things like the grass is so pretty, and I think this is unique for an mmo. The character creation is good as well. The game's comunity is also really good, every time I was new to a dungeon people told me things I needed to know. Even when I was just out in the world killing monsters random players helped me, but ofcourse like every other community there are some bad people as well. Overall this is a great game you'll get stuck into, don't mind the subscribtion fee, it is worth playing, and if you can get some friends to play it with you it turns into one of the best games you've ever played, I can guarantee it.",
            "review_score": "1"
        },
        {
            "review_text": "After spending hundreds of hours loged in game (and even more before I started using the steam client version), I have to say this game is my obsession. Everything about it oozes quality from the brilliant music, to the way all the classes work so well together to the storyline that pulls you in. The game as enough pull for casual players and enough grinding and raiding for the hardcore. Best Final Fantasy ever? Probabily not, that still sits as VI for me, but the game's pretty damn close.",
            "review_score": "1"
        },
        {
            "review_text": "The games start is a bit slow, but its beautiful its story in enticing if you are willing to watch the cutscenes, read what they say and all around entice yourself in the world.  The combat is fluid, and easy to use compared to Final Fantasy 11, and the world is very beautifully crafted.  The ability to switch between classes imbetween combats, allows you to find the role you enjoy playing or take part in many roles throughout the day without losing progress in the games story, quests, or ect.  Dungeons in the game, and many foes outside of them require you to move out of spells, or react to required situations in the fight, moving to protected zones during large aoe attacks, or in a particular one, climbing onto a creature for a duration of the fight.  But by far the best part of the game for me, is that it is truely beautiful. Take time to observe each creature in the game, and the zones they live in and you will see how much work was put into them.",
            "review_score": "1"
        },
        {
            "review_text": "Stuck on Sastasha too! D:",
            "review_score": "1"
        },
        {
            "review_text": "Not enough time to judge. Ask me next year.",
            "review_score": "1"
        },
        {
            "review_text": "If you are Final fantasy fan, then you HAVE to play this. It takes all the awesomeness from the games, and adding it to a world, where we can game with eachother.  I you like mmo normally, is this also one I woul recommend, it is the best there is.  No matter what or anything else, you get your very own CHOCOBO.",
            "review_score": "1"
        },
        {
            "review_text": "*I actually already put in about 40 more hours but not through the steam launcher.  FFXIV doesn't try to change the MMORPG genre, but it refines and streamlines a lot of it. It's quicker, looting is instant, inventory management is easier, crafting is more fun, and you can train all classes and jobs on one toon - and leveling new ones is much easier once you unlock the repeatable quests.   It also plays great with a controller (esp for tank, it seems harder for magic) though I keep a keyboard / mouse handy for non combat stuff.   The negatives are that it still includes fetch quests, it's not really made for duoing (I really like to play games with my romantic partner, but they didn't get into it as much as it feels a bit less strategic at the start.) I also wish you got to choose some skill progression within your class, but you do get to customize a fair bit by choosing cross class skills once you unlock them by leveling a new class.   There's a lot more to say but I don't need to say it all, check out some other reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Graphic : 80/100 -- not much better than FF XIII I think Gameplay : 80/100 -- to many scene quest and back-forth NPC to NPC quest, Id rather monster hunting quest. :) Song : 90/100 -- FF has beautiful songs as always Character : 85/100 -- unique charaters than the other MMOPRG, I like it  At the first time I played FF XIII, I feel so bored with that game and feel so lonely (because that is offline game). Quest make me walk back and forth from the NPC to the quest destination and back again to that NPC. Thats so wasting time. But I like the song, the characters, and monters in that game.   When I know that SE launch XIV in online game play (MMO RPG exactly) trough Steam, It feels very good and I want to buy one or two or three! (for my friends or GF!). I image that I can do many quest and fight monsters with my friends! Not alone anymore!!! But, I dont know, why this SE blocked the steam user from my region (South East Asia) (I dont know exactly the one who blocked SEA user, Steam or SE :P) and I cant buy it! It makes me pay much more than steam price for buying it trough 3rd person from EU region and I decided to buy one only.  At all, this game is good, but It will be better if accomodate the SEA steam user! :)",
            "review_score": "1"
        },
        {
            "review_text": "pro tip: dont buy a house unless you plan to play for a long time  but overall 10/10, good story line, continuesly gets updates, a lot of things to interact with, friendly comunity, freedom to do as you please. you couldnt ask for a better mmorpg  cons: everything on the market board is pricey, even the houseing, but theres no fixing that",
            "review_score": "1"
        },
        {
            "review_text": "Seems okay.   Didnt play much of it.",
            "review_score": "1"
        },
        {
            "review_text": "i like the game but, its a pain in the ♥♥♥ to find a group for raids with the ability to complete to progress your personal story. wasted money on a i cant even play and a max sub to be stuck untill raid completes ( need a skip button for the raid content of personal story)",
            "review_score": "-1"
        },
        {
            "review_text": "Can't get onto the game anymore as it keeps requesting to link my account even though i already made it on my old computer 2 years ago.",
            "review_score": "-1"
        },
        {
            "review_text": "I will not wait 24 hours on 5 email accounts for 5 more attempts to create an account to play a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Game might be good, but it gets a thumbs down for the most consistantly awful customer service I've ever experienced in my entire life. Firstly, two differents accounts (Square-Enix and Mog-Station) where the stars have to align to grant you access to the product. Second, good luck figuring out how to actually give them your money; I had to 'register' my card information no less than seven times before instead of just remembering what my info was, the system actually made use of it. Last of all is getting in touch with them at all. How about a phone number? No. Ok, but there's an FAQ knowledgebase, I can't be the only one with this issue, right? Type in the most vague keyword, and it pulls up nothing. I typed in 'steam' just to see if anything remotely related to my issue would come up. Not a single hit in the entire database. An hour later in my vain attempts to play a game that's ruined before it even began, I scroll through a Step-by-step process for activating the game through what service? ♥♥♥♥ING STEAM. What good is a search option that tells you to ♥♥♥♥ yourself? My advice to anyone wanting to play this game is simply to not play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Patcher crashes relentlessly. I tried to fix, but can't play.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont have any friends anymore but its ok i finally beat titan on extreme",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the most boring MMORPG's I've ever played. It may be just my opinion and the opinion of a few others.  I'm not saying the game is bad or anything, but it personally didn't appeal me at all.  Why?  It's a very slow paced MMORPG, the leveling is terribly boring, not a single class seems appealing and the community is rude and consists mostly out of 14 year old meme-lords.  I do understand why the game could be enjoyable, but it definitely isn't anything for me.  2/10 - Should've bought 10 mars bars from the 10€ I spent for this game. Would've paid out more.",
            "review_score": "-1"
        },
        {
            "review_text": "Full of people that can't dodge AOE circles and bearded men playing as naked catgirls.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS A LIFE SUCKER, LOVE IT!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It has cat girls :D",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "it's alright i guess",
            "review_score": "1"
        },
        {
            "review_text": "It's still bad, but I can be a lizard girl now so it's okay",
            "review_score": "1"
        },
        {
            "review_text": "It's good.",
            "review_score": "1"
        },
        {
            "review_text": "Do NOT buy this game through Steam. Don't! Ever! You will have a really bad time. The game is great though.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive ....",
            "review_score": "1"
        },
        {
            "review_text": "i've had it for almost a week and still can't get into the right server to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "LV18 game was low",
            "review_score": "-1"
        },
        {
            "review_text": "Most people play this game to make waifus and fap to them. The story is great btw.",
            "review_score": "1"
        },
        {
            "review_text": "If you can get a couple of friends together to play this, and you like the final fantasy lore, then play this. I unfortunately cant recomend it for many other reasons, thoguh to be fair i havent put much time into this. As far as MMOs go, its pretty cut-and-dry but i cant say anything as far as story goes.",
            "review_score": "1"
        },
        {
            "review_text": "WILL TAKE OVER UR LIFE",
            "review_score": "1"
        },
        {
            "review_text": "Well this game was good but then I realised that wow is better.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe not better than WoW, but this is still my favorite MMO. It just gets me",
            "review_score": "1"
        },
        {
            "review_text": "Honestly forgot my computer has other games installed on it.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, let's play FFXIV together! Sorry, you can't travel to other starter cities until level 15.  We're level 15 now! Let's help each other with our class quests! Sorry, class quests are single player.  That sucks. Let's do random quests to level up! Sorry, you can't share quests.  OK... Let's do dungeon roulette! Random dungeon with increased XP and awesome loot! Sorry, you must split the party first.  FINE! Let's work together on the main story questline then! Sorry, the main story questline requires that you split the party for single player instances.  Massively Multiplayer Role Playing Game? More like Massively... SINGLE Player... Role Playing Game... yeah!  We paid money to play this.",
            "review_score": "-1"
        },
        {
            "review_text": "Games are supposed to be fun. This one isn't. Story is great, but there's no real story to catch the attention, the game mechanics are... just bad, and getting started (from setting up an account to leaving the city to battle... shrews) is painfully slow. KEEP SHOPPING!",
            "review_score": "-1"
        },
        {
            "review_text": "Firstly, let's start with the visuals, it's a very attractive looking game that offers nice customisation, however upon playing the game I found that it got boring very quickly. There's too much grind (don't get me wrong, I enjoy it but only to a certain extent) and the amount of travelling back and forth for theses mundane quests is ridiculous. Subscriptions also suck and to be honest I've only played 8 hours, the rest were me idling for the downloads and customising my character cause don't we all. If you want a game that does not feel like a chore to get your money's worth you probably won't like this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money on the expansion or the monthly fee. You'll get close to the end and they force you to fight a ridiculous boss that only the most experienced players can defeat but you'll be thrown into a party with people who have no idea what they are doing. If even ONE person out of EIGHT messes up, you lose. That means you'll have to either waste weeks upon weeks hoping to get a competent raid party or never be able to enter the last three areas of the game and never being able to fly in one of the areas you can enter.",
            "review_score": "-1"
        },
        {
            "review_text": "I do not recommend this game, also some of the worst customer service I've ever encountered.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is very anime. i am gay",
            "review_score": "1"
        },
        {
            "review_text": "This game made me hate the tank class 10/10. Community doesn't know about cooldowns (was an alright gem)",
            "review_score": "1"
        },
        {
            "review_text": "I JUST GOT  MY  CHOCOBO so BUY NOW",
            "review_score": "1"
        },
        {
            "review_text": "Being a Miqo'te is fun but the rest of this game is p generic and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "stuiped patch....did everything i could...sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Is there a way I could keep my monthly subscription? ;-;",
            "review_score": "1"
        },
        {
            "review_text": "final fantasy xix ERROR ON PATCH [11006] [20641] [20643] This game is giving me a hard time to play",
            "review_score": "-1"
        },
        {
            "review_text": "DONT INSTALL IT FROM STEAM,install it from FFXIVinstaller i install it and it didnt work,i had so many problems and solve them but its useless,i suggest to install it from the same site of the game not from steam,the game is great so far i am lvl12 lancer and its great,it reminds me of WOW a little bit still didnt try PVP yet but i think it will be great and it worths ur money and ur time.",
            "review_score": "1"
        },
        {
            "review_text": "great game, i hate paying for a membership but its a ton of fun",
            "review_score": "1"
        },
        {
            "review_text": "Not only do you ride your own chocobo, he fights beside you. That's all the incentive I need. CHOCO KICK!",
            "review_score": "1"
        },
        {
            "review_text": "final fantasy the mmo, square enix likes spending the money they get from this game; on ♥♥♥♥♥♥ remasters rather than actual content for the playerbase.  no salt, just sodium",
            "review_score": "-1"
        },
        {
            "review_text": "This game doesn't feel it should be a pay to play. It should be pay and play all you want instead of subscriptions. Overall, it's boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Servers are small and many are capped so if you want to join friends too bad.",
            "review_score": "-1"
        },
        {
            "review_text": "i r8 this game 7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best MMORPG's I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: The most boring and unengaging MMORPG I have ever played. Read further for my rant, the one thing I like, and the few things I really don't like.  *NOTE: Edit at the bottom of the initial review bcause apparently I didn't play enough of it to be engaging.*  Okay, first of all I really wanted to like this game and I understand it's hard to recommend an MMO as everyone will have different experiences, but I'd heard such nice things about it, and was really looking forwards to playing it. I find that FFXIV is the most unengaging MMORPG I have ever had the pleasure of playing, the combat is unintuative, I sit there pressing 1 and then comboing it with 3 before the combo resets. A small nitpick is the fact that for a AAA made game, and a sub based MMO at that, the majority of cutscenes, (cough the first intro one that takes a good few minutes to get through and is unskippable cough) are completely devoid of any voice acting.  I would highly recommend playing a game such as Guild Wars 2 over this, or if you want to stay on Steam, a F2P MMORPG my friend and I dabbled with for a while was Aura Kingdom, which we both agree is more engaging than this.  Edit Start: Okay so apparently I didn't play enough of it for the game to get engaging? But let me get this straight, if a game isn't engaging afer playing it for 6 hours, how is that any fun for me? So I thought, hell, I'll try get it to 10 hours to please Ms Valenska here, but I just couldn't do it. 1 hour short but whatever.  I'd like to rephrase my first point here. It shouldn't take more than 6, sei, 六, шесть, seis, six, HOURS for a game to get engaging. If it takes longer than that, then what the hell is the point in playing it. Sure for RPGs, or more specifically MMORPGs, there's always the 'endgame' to look forwards to, but in all honesty, this game just doesn't get there. I'm not going to waste any more time of my life trying to play this game, running half way across a continent to deliver some ♥♥♥♥♥♥♥♥♥s letter to try accumulate enough experience just to see if there's a nice light at the end of the tunnel. I'd rather continue my Greater Rift runs on Diablo 3 or actually get back into Raiding in World Of Warcraft, hell playing FFXIV got me wanting to get back into playing Guild Wars 2 so there's one thing I can thank it for.  Also a side point, good on you, Arena Net. You made a great MMORPG, and guess what? It has voice acting for basically ALL of the quests. Tell me the first thing you notice when you boot up FFXIV A Realm Reborn and start a new character. That cart scene, no voice acting? I know right, such a long intro cinematic and NO VOICE ACTING for a good at least 5 minutes. Thanks, Squeenix, for making an AAA MMORPG and actually caring about your cinematics as much as you do in your other Final Fantasy games. So thanks, Arena Net, for giving your NPCs actual character and personality, even if it ISN'T a main quest line.  I feel the only thing that I like about FFXIV is being able to join multiple guilds and have multiple possible 'professions', sick of being a Gladiator? Well go down and change into a Rogue, or even a magic weilding class. Honestly, that is the only part I liked.  Like I stated before, the combat is a monotonous combo of pressing one key, and then comboing it with another that gives it a little bonus. Then rinse and repeat. I really wanted to get my Rogue to level 30 to train into a Ninja as you have to do actual hand signs to perform Ninjutsu, which honestly that is an awesome idea, unfortunately I don't have the patience to level up my Rogue another 15 levels in the same monotonous grind involving ferrying letters from one continent to another, kill about 5 enemies for a small quest, and then take another letter back to the other side of the continent because clearly the mail service in this fantasy realm isn't good enough.  If I regret buying something, in all honesty it would be this game, which I will definitely not be resubbing to any time soon. If you're a die hard Final Fantasy fan, and you loved the idea of playing an FF MMO (well there's always FFXI which could even be better but I'm not gonna risk it), you will most likely actually like this game, the same way I love Fallout 3 with all it's bugs and flaws.  But for anyone who isn't super big on Final Fantasy, be wary, it will be very hit and miss. I'd recommend trying some Free 2 Play MMOs first, Aura Kingdom, Neverwinter, Star Wars The Old Republic, RIFT, even The Elder Scrolls Online now that it's going F2P. You can go the Buy 2 Play route and opt to get Guild Wars 2, which will offer you a whole game for one payment. Though the best Pay 2 Play MMORPG, in my experience and that i have played, is World Of Warcraft, and there is no way that Final Fantasy XIV A Realm Reborn could live up to the standard WoW has set, and that is in my opinion of course.  As the very first sentence states (the TL;DR sentence), I just find this game very, very unengaging and boring, so buyers be wary if you're unsure. There are plenty of better choices for MMORPGs out there.",
            "review_score": "-1"
        },
        {
            "review_text": "There's not enough content. Once you get to level 50, you're done. Sure, Heavensward has come out, but what more are they gonna add to it?",
            "review_score": "-1"
        },
        {
            "review_text": "Worst combat imaginable. -So- many limitations in order to cater to 10 year old hardware(PS3)  Even the cities have 2+ instances within a single city.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ off with the subscription",
            "review_score": "1"
        },
        {
            "review_text": "paid for the game. can't play 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, but like any MMO DON'T buy it on steam, only steam bought expansion will work. While at the time of this post you can pay R$89,00 for ps4 expansion, on steam you have to pay R$179,90. R$179,90 converted to U$ is U$57,94, US version is costing U$39.99 right know. Or you can buy in SE site for U$39.99 also, if you are Brazilian.  Seriously buy it on SE site, don't make the same mistake that I did. ",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ you Yoshi-P. Eat a fat ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "this stupid game with all the supscrition and password restriction gets on my nerve, never wana play again, waste of time and money",
            "review_score": "-1"
        },
        {
            "review_text": "Paid 18$ to get into the ERP server. Got banned from the /xivg/.   Was a good day. Oh yeah the game is fun. F*CK OFF CEBRUZ ITS FUN!",
            "review_score": "1"
        },
        {
            "review_text": "By far the ♥♥♥♥♥iest experience I have ever had in my entire life, the moment I set my account ready to play, after the very complicated registeration. BEFORE EVEN getting to play the game or anything it DOESN'T allow me to ♥♥♥♥ing play the game 'due to suspicious access to my account' I've emailed their support over 6 emails, all they say is do this, follow that, I go and do as they say and nope I always end up with an error. The most shitiest low quality support I have ever seen in my entire life, honestly this game's ♥♥♥♥♥♥♥s of supports need to be sued for being ignorant ♥♥♥♥s that avoid doing their desk standerdised ♥♥♥♥ing job properly.",
            "review_score": "-1"
        },
        {
            "review_text": "Unable to download patch files [30413][25008][20495] This the entire content of this game. No fixes work that are posted in the reddit or on steam support page. If you give this error code to square enix support they'll immediately disconnect from you.",
            "review_score": "-1"
        },
        {
            "review_text": "FIx your installer! I wanted to play but apparently I have to VPN to a foreign country to install an update... great design....",
            "review_score": "-1"
        },
        {
            "review_text": "It bis terrible",
            "review_score": "-1"
        },
        {
            "review_text": "This game is such an abyssmal failure of an MMO, honestly as cloney as it comes with about as much endgame payoff as playing an arcade game for months on end.",
            "review_score": "-1"
        },
        {
            "review_text": "I was highly looking forward to playing this games, but when it downloaded I got an error while booting up, and it said it could not complete version check, so I baisically waisted £20.00 as I couldn't play. So don't buy unless you want to risk loosing money! ",
            "review_score": "-1"
        },
        {
            "review_text": "WORST CUSTOMER SERVICE AND ACCOUNT MANAGEMENT.  This game is so crap you cant even log in. dont waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "'new characters cannot be made on this world at this time' nice game, clicked confirm and ok buttons like 1000 times, that's a pretty good gameplay if you know what i mea.. OH GOD THE PRICE",
            "review_score": "-1"
        },
        {
            "review_text": "Boring game... Have to keep playing because I already paid for it. On the upside, the graphics are nice.",
            "review_score": "-1"
        },
        {
            "review_text": "For the monthly fee get somthing better.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok i really want to play this game really but oh god i get bored in 10 min after every login. So what's the deal:  This game has worst mmorpg early game introducing, stupid pops all the early game which treat you like a 5 yo boy.Did i say early game ? yeah early game sucks , boring dungeons , quests, combat , everything.. Just the story had me little but couldn't carry my interest over level 24.And you had a lot to do reach to end game content which every fanboy worships but i think doesn't worth it.Just get legion instead with better player base and for better leveling experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst mmo I ever played. All input are delayed from the serveur for about 0.3s.... leveling is boring as ♥♥♥♥ and can be resumed by skipping cutscene over and over again. Itemisation is awfull and directive, you have no choice.  PVE HL is inexistant. Nerfed as ♥♥♥♥, only current content is a challenge (and current content means 5 bosses, 5...). Dungeons are a joke, craft is useless. It's not an mmo, it's a causal rpg with some online content.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I remember when I bought this game two times. I remember it being a waste of money the first time, and an even bigger waste of money the second time. Here's a list of things I could have done instead of buying this game.  1. I could have jerked off to my extensive collection of JAV shemale porn videos. 2. I could have finished one of the 400+ games I own on steam. 3. I could have spent the money on a hooker and wrote her biography with the time I spent on this game. 4. I could have gone to a strip club and spent the $50 on girls who pretend to be 25 still. 5. I could have bought a bus ticket to florida, and spent my night getting ♥♥♥♥ faced in miami with a crossdresser named juanita. 6. I could have spent it on speaker wire, because the lower the guage the better, but not really, because that's all marketing ♥♥♥♥♥♥♥t. 7. I could have spent the money going to ny and spending $12 dollars on a hotdog that a guy cooked in pisswater. 8. I could have spent the money on finishing my original xbox game collection 9. I could have spent the money on some vinyl. 10. I could have spent the money taking a japanese summer language course and learned enough to write a letter to SE and tell them, they should just ♥♥♥♥ off and close down.",
            "review_score": "-1"
        },
        {
            "review_text": "Played a week and stopped because the game is boring, did not see the monthly subscription when i bought.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is crap, the fighting system is wack, no fun at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Exciting quests such as fill the lanterns with oil, or snatch the dodo bird egg from the nest! An awesome crafting system that acts as a super time sink that will never actually allow you to make anything useful! Seriously pointless grindfest with a lame story that will have you grinding your teeth in despair.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "instead of making your consumers buy a one password, why dont you create a better system.",
            "review_score": "-1"
        },
        {
            "review_text": "2.5 second GCD ruins this game, it's too ♥♥♥♥ing slow.  The music is good though.",
            "review_score": "-1"
        },
        {
            "review_text": "Why do I need a square enix account if I already have one in steam? waste of time... --'",
            "review_score": "-1"
        },
        {
            "review_text": "its overrated. On pc I dont have much time with it but on ps4 I have over 1000+ hours on ps4",
            "review_score": "-1"
        },
        {
            "review_text": "Very addicting game. You can be multiple classes and jobs in the game. very nice pvp in it =)",
            "review_score": "1"
        },
        {
            "review_text": "An mmo with class! I blame my friend Magmawk for this.  Graphics: I have to say, everything is frakking beautiful. This is literally the most beautiful mmo I have ever played. It's not catroony coloful like TERA is, this game just look beautiful. Not just is there a lot of detail on npcs and enemies, but even enviremnets look great! The spells and special attacks all come with bright and colorful effects and really put pizzaz on your stuff! In fact, the quest where you have to look for vistas is like the game saying 'LOOK HOW BEAUTIFUL I AM!'  Sound: The sound of this game is awesome. The music sounds great and always feels perfect for the setting they play in. None of the music is boring and I love listenig to it! The attacks sound like they have impact and the monsters and npcs really sound good! The voice acting is also very well done and amazing. Turn the volume up on this one!  Control: While I use a controller for this game (to great effect), keyboard/mouse also works quite well. And the game lets you organize your skillbars to make even easier for you.  Gameplay: While on your initial class, there is no shortage of quests to complete, FATEs to run, and Leves to do, as wel as hunting logs to complete. WIth all that, it takes no time to level up. Once you hit the level cap for a class, you stop gaining exp, so finishing no-50 quests becomes a waste of exp. But you can switch to other classes at time, so exp is not wated. And there are a LOT of classes to choose from! But once you have completed most of the non-50 quests, the only good sources of exp come from FATEs and Leves. And if you want access to the JOBs, you have to level up another class to unlock it. Thankfully, there are many Level 50 quests that will keep you entertained. From the Hildebrand quests to Crystal Tower and the Coils of Bahamut, you will have things to do for a long time. And with classes like Culinarian and Armorer, you can get your crafting on and really make some money on the market, which is admitadly slightly broken right now abusable it is in making Gil. My only issues are ;that the classes/jobs neatly fit into 3 basic catgories of TANK/HEALER/DPS with little way of customizing (only 2 tank classes, 2/3 healer clasess and 11 dps); and that it can be annoying waiting in a queue for a dungeon to launch (tanks and healers are usuallly rare). Better have a group if you want to run dungeons for quicker queues.  There is some grinding on other classes, but it's not as much as other mmos and the story and dungeons are fun enough to keep playing over and over! If you are looking for a truly great mmo, I highly reccomend this one! It may not be free, but it is worth EVERY PENNY!",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly enjoy playing this game... Was not sure at all I would enjoy as I am a long term player of ffxi... over 5 years  The game mechanics are very different, however after a couple of days you get used to it.. friendly community also. I can foresee myself playing this game long-term it's a nice change. The missions and quests are enjoyable and somewhat challenging which is good. Highly recommend you try the free trial and judge for yourself  Cheers :)",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for something new and willing to pay a subscription this would be the game to play",
            "review_score": "1"
        },
        {
            "review_text": "True Gem. Worth every dime spent. ♥♥♥♥ WoW",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game.   When this game first came out, I wanted nothing to do with it; just another weird/confusing FF that would take hours upon boring hours to get to the max level with the max gear. I was only half right. Sure, to get everything you need, you're gonna need to grind harder than a grindstone (That's including the fact there's 19 classes) But i'm still not bored of this game, and the feeling of acomplishment I get every time I max out a class (I'm gonna get to feel that feel 16 more times) is really great. I know for a fact that i'm not going to be completely done with this game for while, but I know for sure that i'm gonna love it. Sure, you might meet some slow/annoying people, but you also might meet some people who would gladly die to see you survive, and then try to be your friend.  The dev's are also updating the game with new items and things to do about every few months or so, add that with the seasonal events, and there's usually something to keep you busy. Overall, I would say this game is a solid 9.8/10 (It's not FTP yet, but its not super expensive.)",
            "review_score": "1"
        },
        {
            "review_text": "I was a Final Fantasy fan all the way to FFX. When Hironobu Sakaguchi left Square, Final Fantasy died in my eyes, and became just another JRPG series that didnt stand out anymore. Final Fantasy XIV has won me back! It's the game FFXI should have been! Best MMO I have ever played! A must get for all old and new Final Fantasy Fans!!! Well done Square, well done!",
            "review_score": "1"
        },
        {
            "review_text": "This is a very typical, yet extremely polished and well-made MMORPG. If you like traditional MMOs, this is going to keep you busy for months. It has an emphasis on endgame content, storytelling and incredible boss design. The best thing about the game, though, is likely the fact that there is NO microtransaction market. If you have a subscription, EVERYTHING in the game is available to you, and EVERY item in the game is earned, and not bought. If you see someone riding around on a sweet mount, they worked for that. They didn't just pull out their credit card. I know this shouldn't be a major selling point, but unfortunately it's just about the only MMO to come out in the last decade to do this. I recommend it completely for any MMORPG fan, but if you don't like MMOs, and just love Final Fantasy, it may not be for you. At the low price it costs, though, it's worth a try regardless.",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy XIV is such a well-shapen game. It has beautiful environments, amazing battle mechanics, and a captivating backstory. My only complaints are that if one decides to purchase the game through Steam, they may have to wait a few hours before their purchase actually goes through. Also, the game has MANY connection issues. I remember I was in the middle of a dungeon run and I got disconnected from the game without any warning. Usually, a red circle with some diagonal lines inside will appear next to your name indicating that you are having connection issues. But that time, I did not get such a warning. And it's a shame really, for as beautiful as this game is, it has quite a few problems, which apparently occured before past updates as well. I think the game will need time to develop more if these problems are to be resolved. But if you encounter no such errors, then I suppose there is no problems there.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, rough start, but once you get the hang of it you will be in love.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for any possible way to ruin your life. This is your game. 10/10 Would ruin it again. ",
            "review_score": "1"
        },
        {
            "review_text": "This is my first MMO and I love it. The game is good for beginners like me, it teaches you how to play while also still posing a challenge to veterans. This game has something for everyone; raids, crafting, trading card games, chocobo racing, etc.",
            "review_score": "1"
        },
        {
            "review_text": "Help me i can't walk 10/10",
            "review_score": "1"
        },
        {
            "review_text": "THERE'S TOO MUCH TO DO",
            "review_score": "1"
        },
        {
            "review_text": "So FFXIV...  I have sunk countless hours in to this game on my ps3 and then on to my PS4. I have achieved max level on almost everything this game offers.  This game is very beautiful, probably one of the most beautiful MMOs I have ever played. Unfortunatly, I find that this game (like most MMOs these days) doesn't offer enough to keep players like myself around. At first glance the instances are super fun, the boss fights with enemies like Ifirit and Garuda are amazing and require a lot of team work. But then you have to run those same bosses over and over and over again. Good job, now go do it again on 'hard mode', and then the next mode, and then coils over and over countless times, I understand 'the grind' is a part of a lot of MMOs and RPGs, and to some respect I love it myself, but I feel there needs to be more substance to the game to warrant a grind like this.  This is a great game and the devs continue to add more to it. It's hard for me to put a finger on it exactly, it just seems to fall a little short. For a more 'casual' gamer in this genre, you will fit right in and fall in love. For someone like myself, the game will become boring and you will move on (most times), BUT, I do recommend giving it a shot. It's a great game and maybe with the upcoming expansion and the content patches that continue to come dowm this game may get even myself to come back.  All in all, this is a great game that tends not to hold the interest of players (certainly not everyone will fall in to this) long enough. Worth the experience at 'the right price'.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "after playing FF XI and feeling like i could not progress through any of the game without the help of another player i had lost hope for the series.  then i purchased a realm reborn and OMG i loved how i was able to do my own thing quest without missing attacks on lvl 1 enemies, dying and not de-leveling this game just improved so much on its last game.  i definitely recommend this game it looks beautiful, plays very well and has lots of enjoyable music, landscapes and characters",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun and it looks really good",
            "review_score": "1"
        },
        {
            "review_text": "A lot of MMOing. A lot of Final Fantasying. All while wearing super short skirts. Short skirts on everyone.",
            "review_score": "1"
        },
        {
            "review_text": "awsome game!!! 11\\10",
            "review_score": "1"
        },
        {
            "review_text": "Nothing much to say just a epic game.",
            "review_score": "1"
        },
        {
            "review_text": "Cat girls have claimed my soul and I haven't even hit 100 hours yet, also dungeon time is good for living your life cause it takes about 20 years for certain dungeons when you have no friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is crack.",
            "review_score": "1"
        },
        {
            "review_text": "Decent as far as MMO styling goes. Very grindy, but for those looking for something that isn't a ♥♥♥♥ WoW clone, then this might be for you.",
            "review_score": "1"
        },
        {
            "review_text": "The best classic mmorpg I've ever played. It has lots of little details that make it so good. The story, graphics, music, interface, community and game design are on a very high level!",
            "review_score": "1"
        },
        {
            "review_text": "JEsus, I just want to play and the customer service is ♥♥♥♥♥♥♥t.",
            "review_score": "1"
        },
        {
            "review_text": "great game but nobody talks on chat",
            "review_score": "1"
        },
        {
            "review_text": "I've actually logged nearly a thousand hours. Basically its great. Buy it now",
            "review_score": "1"
        },
        {
            "review_text": "&lt;insert joke about addictive drugs here&gt;",
            "review_score": "1"
        },
        {
            "review_text": "I did this out of boredom, and I don't want to proof read. Sorry readers.  Final Fantasy XIV: A Realm Reborn (2.0) is a reboot of the failure that was Final Fantasy XIV 1.0.   FF14: ARR is said to be a fairly casual MMO, and I can't deny it. I don't have a lot of MMO experience, but I can tell the game is slow-paced. That being said, this game is very easy to pick up and there is no built-in DPS meter, so no one can say you're bad without letting everyone know they're using a third party program (Illegal, oh no! But Square Enix doesn't care if you use a third party program, as long as you don't call other people out on doing subpar damage. How nice.) The game does cater to the casual crowd more often than not, and as a result some people seem to be absolutely clueless when it comes to playing their class. I sometimes wish Square could throw in a DPS meter so DPS would be encouraged to not be dumpster-tier when they see that a healer or tank is doing more DEEPS than they are.  The races in this game are very similar: human (Hyur), human with cat ears and a tail (Miqo'te), giraffe humans (Elezen), big human (Roegadyn), and potato/little human (Lalafell) and with the upcoming expansion, demon/dragon human (Au'ra). There are differences between the races of course, but there is nothing too drastic between them. Square played it safe and decided not to include actual beast races, as cool as that would be. Maybe in the second expansion Square will realize they're making bank and that people actually want a beast race (see Au'ra concept art that got dropped. Jesus, why'd you do it Yoshi-P?). Expect a lot of c@girls running around, often half naked, coolcool. Character creation isn't the game's strong point, there are no sliders unfortunately, so you can't make a monster like you could in Oblivion or Skyrim or anything of the like (as fun as that would be). A lot of characters do look similar and that leads to people trying to make special snowflake characters that look atrocious.   The game is by no means perfect; there are good aspects of it in the middle of all the bad. It's a fun game with a lot of content to do. The story is pretty good in my opinion, nowhere near the caliber of FF6. That being said, there are a lot of references to previous FF games. Off the top of my head, there's a Crystal/Sycrus Tower raid (FF3), an Ultros &amp; Typhon Fight (FF6), a FF13 event which had Lightning appear in Eorzea. And I'm sure there's a multitude of other references I've missed or forgotten.   The sound was one of the first things I took note of when I started playing the game. I was captured by the ambient noise, the music (the music in the game is especially great), the sound effects, everything; everything sound-related is great. What I love the most is the weather sound effects, my personal favourite being the stormy weather, it really does sound great with the lightning and rain sfx. The game is very pretty and quite colourful (minus some select areas), if you're starting out I suggest choosing a class that starts in Gridania. Gridania is super comfy with its music and environment and has the most simplistic layout of the 3 starting areas. The graphics aren't as good as FF14 1.0, but that game required a supercomputer to run smoothly. My game runs fine on medium settings with a computer built in 2009.  The community in this game is very friendly except for a small minority. Most will go out of their way to help other people and it really does encourage people (someone like me who's turned into an ♥♥♥♥♥♥♥ because of LoL &amp; DotA 2) to be as helpful as I can be. I'm guessing that the community is so nice is because a good portion of it is from FF11, so don't be surprised to see married people, or even parents playing the game.   As I've said before, the FF14 we have now is a reboot of its 1.0 iteration, after the failure of 1.0, Square had to play it safe, which pretty much explains the casualness of the game, alongside the seemingly similar races.  It's definitely not the best game out there. Updates are plentiful &amp; full of content; the game is easy to get into, a lot of throwbacks to previous FF games, half naked c@girl waifus if you're into that, good sound and a friendly community.   This review is garbage and I don't know why anyone would have bothered to read it or why I even typed it out. Thanks for reading anyways, though.  My opinions are definitely influenced by the poeple of /xivg/, thanks a lot for making me see the bad in one of my favourite games.",
            "review_score": "1"
        },
        {
            "review_text": "No character customization.  Well, appearance... yes... what class you are... sure.  Stats and what skills you get? Well, that's all automatic.  That's right. FFXIV took a progression option that was available since the days of Ragnarok Online and tore it from our hands. Even in the single player FF games, such as FFVI, FFT, FFX, etc, etc, you got to select skills and build your characters as needed. No, you didn't choose your stats individually, but they each had a bevvy of skills you could browse around and choose when you leveled up.  Not in this.  What skills you get at what level are pre-determined from the moment you select your class.  Yes, the story is... neat. The graphics are... on par with what you'd expect FF to have. The voice-overs are absolutely abhorrant though.  Yeah, you can change classes as easily as changing equipment. (Remember FFX-2?)  You even have individual levels for each class, and get to use skills from your other classes. One of these is a shot in the foot and the other is a gift-wrapped shoe box.  However, take into account that every level 50 character is basically the same. There's 5 different races, (all of them are variations of human... really...) The only thing that'll differ is equipment, which I'm sure is a situation you'll have to grind for.  As someone who enjoys the journey more than the destination, (I hate end-game emphasis...) I cannot recommend a game that cookie-cutters each character into the same underlying thing.  Also, I bet I could recommend the game if it gave your character more options than to follow this 'new adventurer &amp; one of the chosen' path.  Geez, Squeenix, you're so worried about making sure everything is always balanced for everyone in your MMORPG, you left me sad for my nostalgia and what the series has become.",
            "review_score": "-1"
        },
        {
            "review_text": "Plays like a standard MMORPG, but does the job very well with a variety of classes and dungeons to explore.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone is too nice here",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun, great content and an awesome community!",
            "review_score": "1"
        },
        {
            "review_text": "The rebooted game is definitly a improvment from the old one, sure the graphics might be a little old but tis more than made up for by a good community, gameplay, and the fact that little grinding is actually required at least till much higher levels. Also being able to take on multiple classes on one charater is pretty nice too so i don't ahve to switch charaters if i need to change a role. The only real negitive is that the 15/moth sub fee may be a bit high for thouse with slimmer wallets but it is worth the extra charater slots and vet rewards. A decent buy as far as MMO's go.",
            "review_score": "1"
        },
        {
            "review_text": "Come play with meeee!",
            "review_score": "1"
        },
        {
            "review_text": "Started playing Sircus tower and beat it with my alliance in less than 10 minutes.  10/10 would slay again.",
            "review_score": "1"
        },
        {
            "review_text": "Prepare to take a step in a world of fantasy, and enjoyment. From the beautiful visuals, to the relaxing and meditative music. The world of Eorzea will surround you with wonders, and hours of fun. If you are nostalgic like me, I was a former FFXI player. This game has many references to old FF games as well as FFXI. The mechanics have been overhauled, along with the visuals, creating an immersive experience that is not only fun, but an escape.  Crafting, is engaging and fun. I highly suggest picking up all the classes and jobs so that you may switch upon any field of craft or billot of your choosing. Give this game a try, I highly recommend it. But as with any MMORPG, it takes time to earn things, and if you can devote some time into the game, the community is amazing and very helpful, and social too. One of the more mature players out there, so join a (FREE COMPANY) it's like a guild, and begin making new friends.",
            "review_score": "1"
        },
        {
            "review_text": "After getting my first level 50 (Monk) and with over 100 hours (I know not a lot), I can say this game is well worth the cost and subscription fees. I have never played a MMO, never thought I could enjoy them. I WAS WRONG. Grinding is extremely rewarding and hours can fly by while playing. Can't wait for Heavensward.",
            "review_score": "1"
        },
        {
            "review_text": "It's alright.",
            "review_score": "1"
        },
        {
            "review_text": "Wait is this the real me now or am i still in the game? i dont even know anymore",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I had been wanting to play a good MMORPG with friends for so long and the fact that this is also cross platform with ps3 and ps4 players just makes it great to play with my friends as some of them have it on both consoles.",
            "review_score": "1"
        },
        {
            "review_text": "FFXIV is definitely one of the better MMORPGs out there at the moment. The game has great dungeons, decent levelling, and an abundant endgame. You'll find yourself immersed in the colorful and rich world (albeit filled with weebs), and this helps ignore the slightly improved WoWesque combat. And that would really sum up the game -- improved WoW. If you want an experience like Warcraft in a new world and more polish all around, FFXIV is the way to go. If you want something more TBC era, though, you will find more luck in a game like Wildstar.",
            "review_score": "1"
        },
        {
            "review_text": "More than enough things to do, solid combat and dugeons, raids, etc.  Looks nice and purdy, Eorzea is pretty charming. Story is typical long-winded Final Fantasy banter, still endearing though.  10/10 would waste life again.",
            "review_score": "1"
        },
        {
            "review_text": "Falafells are yummy.",
            "review_score": "1"
        },
        {
            "review_text": "Music more tense than Hanz Zimmer, kawaiis everywhere 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Full Disclosure: This is my first edit of this review.  In my original review I did not recommend this game because of constant harassment from RMT third parties that was part of the game at this time. Thanks to decisions and changes made by SquareEnix this problem has been largely resolved and harassment is almost non-existent (and can be made so with proper chat filtering)  With the most serious problem of the game in the past I change my review to a recommended.  • • • • • • • • • •  Final Fantasy XIV is a hotkey MMO that takes what is popular with the genre and gives at the Final Fantasy series treatment. From the visuals to the music to the sound effects to the narrative approach the modern SquareEnix/Final Fantasy theme is everywhere (and that's a good thing, especially for fans of the entire series).  Gameplay-wise FFXIV is a solid experience that enthusiasts of the genre will enjoy. 4-man instances, 8-man or 16-man raids, with auto-group finding tools, ensure content comes quick and nigh on-demand. If there is a gripe about the gameplay I have it is the long-winded global cooldown on many abilities each of the classes have... genre enthusiasts have been playing with global cooldowns for a decade now and are used to them, but more action oriented players will have a touch of adjusting to deal with. It is a minor gripe to an otherwise great experience.  If you want a solid hotkey MMO entry to lose yourself in, Final Fantasy XIV is a good canidate. It's true to the game type and has enough content to keep you involved a long while. For me, not a huge fan of the hotkey MMO, I'm enjoying the game if only for the Final Fantasy atmosphere. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Only MMO I am willing to pay a subscription for month after month.",
            "review_score": "1"
        },
        {
            "review_text": "** Update **  I let my subscription run out due to the gold spamming. I was blocking 20-25 spammers on weekdays and 25+ on weekend days. When I have to write a macro to blacklist and report spammers I know the situation isn't being handled, despite my reporting Every last one of them for a month straight. Pity, too. The storyline is good and I was beginning to enjoy dungeons.  ** End Update**  It's alright, though I'd recommend going with the free trial they have on their site before purchasing. There are limits on the trial version but it should be enough of a taste to determine whether you'd like this game or not. Crafting is nice but I made the error of taking up too many skills which has led to a serious space issue. You won't be able to use the market (sell to other players) until completing the level 17 storyline quest, that's also when you get additional storage in the form of retainers (125 slots each, 2 free retainers).  They've got great ideas going on, but again, space is turning out to be a major issue. You'll be given 100 spaces for everything except armor and crafting clothing - those go into a separate storage area. The problem is 100 spaces goes quickly when you're able to collect high quality crafting items in addition to regular quality.  Say you're working on cotton. You'll collect cotton bolls and you'll likely end up with high quality (HQ) and regular. That's 2 spaces. Then you have to craft that into Yarn. Again, HQ and regular. That's 4 spaces. That yarn gets made into cloth. HQ and regular. 6 spaces. You use Both yarn and cloth in recipes so you don't get to reclaim space by using up the yarn. A few recipes require the raw material, yarn and cloth so don't bet on using up all the raw materials to reclaim space.  Hemp comes before cotton. So you'll have 6 spaces taken up by hemp because you can't trade on the market, yet, nor will you have your retainers. You won't want to vendor the hemp HQ items because they sell decently to players, so that's at least 3 spaces you're using to hold on to that hemp. 9 spaces for Weaving. Ahhh, but that's not all! You don't get away that easily. Some recipes require additional items like leather or beast sinew.  So, until at least level 17 you're going to be juggling space. At level 25 you can get your two free retainers. A retainer stores 125 items and acts as your liaison for trading on the market board as well as being a gopher. There is housing available at level 50, but that's still a ways off and if you wait until level 17 or 25 to start crafting you're going to be playing a game of catch up.  Gameplay isn't bad in a group. Solo is slow at the lower levels I was still not able to one-shot a level 2 mob at level 20. That's because gear is limited at the lower levels and there aren't many stats to be had to boost your character. It doesn't detract from gameplay or make questing difficult, but when you need all that leather that falls from lvl 1 &amp; 2 mobs it's going to take a while to collect what you need due to cool downs on skills and the lack of being able to one-shot minor mobs. FATEs are a good way to gain that leather fast because you're usually hitting the same mob as other folks, making the kills go faster.  All-in-all we're enjoying the game, but tweaks would certainly be appreciated.  Oh, and the gold spam is out of control. However, you can set your status to Busy. This blocks (everyone) from sending you tells so no gold spam. It also blocks Free Company (guild) invites, which players like to spam you with.",
            "review_score": "1"
        },
        {
            "review_text": "Still to this day, Final Fantasy 14 has remained one of my favorite MMO's. Just the amout of content this game offers in great and when you have a good group of friends you enjoy playing the game with it makes the experience absolutely wonderful.",
            "review_score": "1"
        },
        {
            "review_text": "A great way to spend time with friends by yourself, fight dragons, and fear a man in his underwear weilding a tiny hammer. Overall great fun, and a nice mix of 'Oh no!' to 'Oh my sweet month of november YES!'",
            "review_score": "1"
        },
        {
            "review_text": "Short and simple: Like MMOs and RPGs? You'll probally like it. It is pretty and MOST of the people you meet are lovely. Takes ages to run out of things to do and after that you have DLC.",
            "review_score": "1"
        },
        {
            "review_text": "At this point, writing a review is a bit like asking Gordon Ramsay if he likes to cook. I have nearly 300 hours in this game as of writing, and I've enjoyed every single one of them. Also I manage perfectly well to balance my study with this game. If anything it actually IMPROVED my performance, it drives me to work harder during the day so I have more free time during the evenings to play.  The good: + Summarized: This game takes everything from other MMOs that works, strips out what doesn't work, and innovates on features in its own way. + The dev team is very much aware that the original FFXIV had a horrible start, and their mantra is 'earn and deserve the players' trust'. They deliberately chose to keep the game subscription-based because it offers them and the players more stability. + The cross-server Duty Finder lets you queue up for every form of cooperative content from wherever you are in the world. + Big bonuses for people who repeat old content in the Duty Finder (sadly only once per day), to encourage keeping storyline content populated so you won't get stuck just because you can't find anyone to play with. + Classes are varied and the handful I've tried are fun to play. At level 30, every class evolves into one or two Jobs that are even more specialized. + You can train every class on a single character. In fact most Jobs have a secondary class requirement that also needs to be trained. + There are two levels of subscription, Entry and Standard. Entry is cheaper than Standard, but doesn't allow recurring payments and restricts you to 1 character per server, 8 in total. But since you can just train every class on a single character anyway, this won't actually lock you out of anything. + The world is beautiful and feels alive. + The lore and story are of true Final Fantasy levels, and better than I've seen in any other MMO. + The game tries to do that 'chosen one in a world of chosen ones' that story-heavy MMOs are all guilty of, but actually executes it very well. In-storyline, your character becomes something of a living legend after a while, and everyone acknowledges that you faced off with terrible monsters and lived to tell the tale. When someone does question your skills in the storyline, it's usually because they actually are a fool. + Boss battles are extremely memorable, and all have interesting mechanics. + The music. Oh God, the music. The regular zone music is already plenty good and immersive, but the composer went completely wild with the dungeon and boss themes. Expect epic choires, punk rock and heavy metal. One boss in particular has 5 different phases, and every phase has its own song.'  The middle: ~ Truly understanding the mechanics of your class/job and the role you fulfill in party dynamic takes quite some time and willingness to learn. If someone gives you good advice, listen to it. I learned the most by making mistakes, and getting tips on what I should have done differently from people who were there with me. This process still continues today, and I only get better by it.  The bad: - Levelling alternate classes gets quite grindy. You get massive XP boosts when you level classes that are below the level of your highest class, but even with that you'll need to invest a lot of time past level 30. Your primary class should be fine doing only Main Story Quests most of the time, at least until you reach Heavensward. - You start with a lot of inventory space and even an armoury chest to store your equipment in, but you will inevitably run into the limits of this with how many crafting materials there are in the game, and how many different sets of equipment you need if you play multiple classes. Rather than a bank the game features retainer NPCs which can do something to alleviate the burden, but I think the game would really benefit of a Guild Wars (2) type of crafting material specific storage. - There is a shortage of Tanks and Healers in the Duty Finder queues. But this isn't really the game's fault, and multi-classing makes it easy to just ask a friend to jump in for a role if you really can't find anyone. - Not all parts of the story are equally good, and some characters are very annoying.",
            "review_score": "1"
        },
        {
            "review_text": "honestly? kinda hate it. pretty graphics but the amount of time you're expected to invest to be able to get to the meat of the game (you have to do EVERY storyline quest from the beginning!) is unreasonable. maybe that's because i come from wow and i'm endgame-focused. maybe if this is the only mmo you want to play it would be good as there's a lot you have to do, but if you want to play casually while still watching the story unfold while it's current, it's not fun. hard to get into.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay-wise, FFXIV is very much a generic MMO in the WoW tradition-- lots of fetch quests, etc. If you don't like MMOs in general, you probably won't really like it.  The thing FFXIV has going for it, though, is that you can be a cute catboy. Don't underestimate the allure of cute catboys!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, and it has a lot to it. I'd play it all the time if I could.",
            "review_score": "1"
        },
        {
            "review_text": "Great MMO for all types of players.   There is much to be loved by this game, i played the original 14 back in 2010 (yes the crap one) they took it down to remake the game into what you now see A Realm Reborn.  Now ive played this game for along time now, and honestly, everything in the game is great, apart from:  When they released HW they essentially made alot of the orignal shining features like crafting for example more of a full time job, than an actual enjoyable part of the game, gathering/crafting in HW takes 3x the amount of time it use to thats in materials and in progress. I work a full time job as it is thanks, i dont have the time to put into grind crafting and you never had to before HW. They also havent added any housing into the expansion yet for players the expansion has been out since June? The HW End game compared to the ARR End game is a massive notch down. PvP i wish was more active, but people essentially just dont care for it.  Best MMO's ive played in along time but they are my gripes with it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest mmos I have ever played. Between WoW and guild wars/guild wars 2 I would say this is my current favorite out on the market right now. Excellent story and rich artwork.",
            "review_score": "1"
        },
        {
            "review_text": "A Realm Reborn has everything I have been looking for in an MMO. After feeling screwed over by every other MMO I have tried the past 8 years, I have finally found a game that delivers.",
            "review_score": "1"
        },
        {
            "review_text": "Note: My actual playtime is around 3 full weeks as of writing which isn't counted by Steam.  Pros: Great music Nice callbacks to older FFs Fun PVE Looks gorgeous Most gentlemanly MMO on the market  Cons: Everything is gated behind the story quests so you are funnelled through that always Heavensward endgame is a bit boring, not a lot to do",
            "review_score": "1"
        },
        {
            "review_text": "Spent atleast 10 hours everyday throughout 2015 summer.   10/10 will ruin my summer again this year.",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst MMORPG's I've ever played, and I have played them all.",
            "review_score": "-1"
        },
        {
            "review_text": "Very impressed so far worth giving the trial version ago",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. There's loads to do and lots of beautiful landscapes. The crafting system is pretty good too. As well as the minions and mounts and costumes. The housing system though, leaves a lot to be desired. A lot of houses are way over priced and certain free companies buy plots for their FC or just to hoard.   Certain things get super grindy later, but that's to be expected. The game is constatnly updated and if you have any issues, GMs are usually not too far behind. I had an issue and a GM responded to be in-game and took care of the problem. Not too shabby, Squeenix. But all in all, a very satisfying change from 1.0 :D  Remember, if all else fails, just call it Version 1.0! ;]",
            "review_score": "1"
        },
        {
            "review_text": "Game is worth it. There always something to go even when you think there is nothing there is still something to do. Able to be what ever class you want at any givin time. dungon sync down levels so people can play together and have it not be to easy. (able to run the first dungon in 2 min and 30 sec when unsynced while synced 12 - 15 mins depending on if ppl know what they are doing. the events are fun and some of then force you to kinda socialize. Has Hardcore server and non-hardcore servers. some what friendly Community (still have your trolls but they can be blocked. Only thing i dont like is the the Gold Spammers but they pretty much get banned with in the first 48 - 72 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Going to take WoWs spot as the mmo im shure! So much to do and see and if your a fan of Final Fantasy you cant go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "This game is all-around a fantastic MMO. One thing I truly enjoy is the community. I remember first starting out and pretty mch everybody helped me out whether it be dungeons, raids, or trials. Even in the end-game content people are helpful an respectful. Granted there thos ewho are impatient, but we all have those days. There is a wealth of content to take part. Many side quests with a few side stories to them. The patches typically bring plenty of new content with them. There are many classes to choose from. Three tanks, 3 healers, and 7 DPS (Damage per second in case you didn't know). The Heavensward DLC brought on a humongous amount of content, and the story wasn't all that bad either. I find the game to most of the time have a positive atmosphere to it and it's very welcoming to new players. I encourage anyone who's thinking about this to try the free trial located on the FFXIV website. One thing I feel the need to say is that among all the servers, last I checked the most populated servers are Balmung and Gilgamesh (I'm on Gilgamesh, transferred awhile back) and you can't typically make new characters on these servers, thus being forced to make a character on another server and paying of $18 to dollars to transfer over to another. That ws the only way I saw to get into the populated servers because at the time I mained a DPS, and the queue times were insane at times. Anywho, I highly reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't been this invested in an MMO before.  It's just perfect in every way, and I really love that you can unlock all jobs/classes on one single character. Love love love Final Fantasy lore and how they've put their own unqiue spin on the genre. There's also a friendly feeling to the game, allowing new players into the genre to be hand-held every step of the way :)",
            "review_score": "1"
        },
        {
            "review_text": "I played Final Fantasy 11 online for years. Many years like almost ten. I have to say this Game is a newer well implemented version of it that somehow lacks the experiance of the original ff mmo. I really wished the devolopers had added a few more varied classes, a lot more voiced content, and good lord is group voice chat really to much to ask for with a paid sub game? Honestly though i have my gripes it is a wonderful mmo. The crafting is actually pretty fun and it don't take months to reach simple goals like ff11 did. The combat is by far the largest improvement, with abilities that make sense and timers that make sense(ff11 had abilities with two hour cooldowns). the graphics are pretty and are extremely consistant. Its almost like finding an extinct animal alive to find a glitch in this game. The content is varied and entertaining, but there is still quite a few go here kill 10 of these type quests, honestly it's like milking a cow for a half hour sometimes. Meeting people can be tough especially if your kinda gung ho to do what you want, but for the most part the community is very friendly. Rarely you will run into a serious ♥♥♥♥♥♥ on any mmo and no game is the exception. I play with my wife and we like to run the quests or dungeons together, while playing these events if you do not enter with enough players to fill the requirements other players that queud for the same dungeon will be presented the option to join. The dungeons are well crafted fun and can be challenging, but the community at large is very very very unforgiving for mistakes, even from first time runners. The community almost demands you watch video and read guides on the dungeons before you run them, wich can ruin the fun of figuring out the dungeon and diminish the experiance of victory. I have a blast playing even though i've made next to no 'friends' in my time on (seriously i have like two besides my wife) but there are always groups looking to recruit. These groups run the gamut from being awesome community groups to being groups that try to manipulate you and get you to willingly contribute your hard earned resources to the group, then kicking you out of the group for not being elite enough or 'invested' enough. Overall ARR is a well crafted mmo adventure with a fair amount of content and a lot of fun to be had. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has stolen my life.   12/10 would pay sub to receive threats of sexual assault from moogles again.",
            "review_score": "1"
        },
        {
            "review_text": "Final Fantasy offers either a casual or intense gameplay. It's up to you. Be the person who logs in twice a week or be the person who never logs out. It's a great game with a great story and offers hours and hours of gameplay. If you have ever liked any other FF game then this one should be on your list of ones to give a try.",
            "review_score": "1"
        },
        {
            "review_text": "I would highly recommend this mmo to any new or experienced mmo players. Its very fun and addictive and the community in the game is very friendly unlike in World od Warcraft. The leveling is pretty fast and smooth and the controls is not very difficulkt to get use to. Graphics is pretty good and gameplay is great. The sound track can get old fast but you can always turn the in game music off.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a newbie to MMORPGs, or even an MMO veteran just looking for something good, then I would wholeheartedly recommend giving FFXIV: A Realm Reborn a try. I'm not even done with the base game yet, and I'm already 80 hours in.   The only issues I have with the game has nothing to do with the gameplay. I'm not a huge fan of the subscription model that is required to play the game, which in this day and age, is a little stupid. I'd still say paying the subscription is worth it. because the game is just that good, but it doesn't make it any less annoying. Another issue is that you cannot, CANNOT, buy any other version of Heavensward, besides the steam version, and use it with the steam version of the base game. Its something you'd expect, but its still kind of stupid.  Again, those aren't gameplay issues. The graphics are pretty good (even on my toaster laptop), the gameplay is TAB targeting and done well, and PALADIN AND WHITE MAGE BEST JOBS, SCREW YOU DPS CHARACTERS (I jest, I jest.)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, well designed duties(dungeons) and trials(boss battles), nice class systems, well balanced PvE gameplay depending more on teamwork on higher levels.   The carfting system is repetitive if you don't want to spend millions leveling them up but since not many people bother leveling up their crafting levels to the max, if you go the extra mile you can make the money back relatively fast and make a profit.   The late game combat requires active participation in the game and use of multiple hotbars, but this is my experience from a healer perspective.   The community is the best I've see in an MMORPG, very friendly people, very helpful and talkative too. Great way to meet new people, and from what I've heard there are lots of people meeting and getting married because of the game.   However, nowadays the end game in really grindy, as a Scholar with item level 207, the only thing left for me to do is to grind for my Anima Weapon, these are all terms you will get to learn as you play, but I'm sure those that know what I'm talking about will agree with me that endgame nowadays is really grindy and there is not much to do, still the game is pretty awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I am really into this game right now... and love how you can take one toon and become all classes and take all jobs",
            "review_score": "1"
        },
        {
            "review_text": "Whoops.",
            "review_score": "1"
        },
        {
            "review_text": "played for 5 days straight, married my best friend, now starting 8 man raid static on goblin consisting in only lalafells  tldr midget heal ♥♥♥♥♥ go nuts  10/10 would heal again",
            "review_score": "1"
        },
        {
            "review_text": "Help, I need somebody Help, not just anybody Help, you know I need someone, help This game is eating my life. If you play the theme music backwards, its a satanic chant that brainwashes you into wanting to play more. The only downsides to this game is the community and scummy microtransactions by square enix in a fee-to-play game.",
            "review_score": "1"
        },
        {
            "review_text": "the graphic is good, and the story line is good too. try it out for yourself",
            "review_score": "1"
        },
        {
            "review_text": "A lovely game I'd highly reccomend if you're into MMORPGs. My trashy laptop can run the game on low with 30~50 fps no problemo. and the game still looks pretty nice then.  The combat feels a little slow at first. the lack of tanks really sucks if you wanna play a healer or DPS class.. but if you're a tank player yourself. queueing for dungeon runs takes literally 5 ~ 10 seconds.   I don't really know what else to say. but 8/10 would reccomend. I'm probably gonna renew my subscription soon.",
            "review_score": "1"
        },
        {
            "review_text": "Harrassed almost everytime tank fails to dodge AoEs due to sheer stupidity and dies because im healer and im not doing my job  11/10 would get screamed at by a lalafel dark knight again.",
            "review_score": "1"
        },
        {
            "review_text": "After three thousand hours of playtime, it's still interesting.",
            "review_score": "1"
        },
        {
            "review_text": "I only play this casually when I have free time. It's an alright game.",
            "review_score": "1"
        },
        {
            "review_text": "Continous updates with new content and events. Community is lovable and the story is, by my preferences, the best I've seen in mmorpg.",
            "review_score": "1"
        },
        {
            "review_text": "2 and a half years in, and it's still fun :D",
            "review_score": "1"
        },
        {
            "review_text": "Can buy a house and decorate it. Nuff said berk",
            "review_score": "1"
        },
        {
            "review_text": "A part of my life lies in this game. Times I will never forget. One of the best communities in modern-day mmo's is in this one. Tons of content and amazing story, soundtrack and graphics.  Once your in you're never going back.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game love it soo much &lt;3 &lt;3 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting mmorpg indeed.  EDIT: Best PvE mmorpg on the market.",
            "review_score": "1"
        },
        {
            "review_text": "Games great. But it doesn't allow to me play other games, because I always play this... Send help.",
            "review_score": "1"
        },
        {
            "review_text": "this game should win game within game aware because it has ♥♥♥♥in TRIPLE TRIAD BABY",
            "review_score": "1"
        },
        {
            "review_text": "This is definately one of my favorite games of all time, I dont think i have spent that many hours into one game like i have done in this game. There is just so much to do in the game that never gets boring. It has a really good and cooperative community. It has an amazin lore and story. As a fan of Final Fantasy I have to say this is probably my second favorite game on the series, if you are a fan you shoul at least give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "It's decent.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very addicting. The graphics are stunning, just journeying the world is worth it. One large seller is the freedom of class selection. It's nice for an MMO to allow a player to change classes whenever they want. It always hurts pumping hours into one character, only to have to create a new one to try out a different class. This allows fast, easy switching freedom so you can change your playstyle depending on what you want to do that day.  Wish it wasn't a subscription fee, but so far it's been the only one i've continued subscribing for.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for 2 months or so and It's okay I guess. *1000 Hours played*   Oh.. I.. I think I have a problem...",
            "review_score": "1"
        },
        {
            "review_text": "Many great Final Fantasies have come our way. But this one is often overlooked. Great story, easy to learn, Novice network for noobies and many fun Raids and Dungeons. All mixed into a hot pot of awsomeness. 9.5/10!",
            "review_score": "1"
        },
        {
            "review_text": "just started playing, my lifes gone xD",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game if you are a fan of MMOs and/or Final Fantasy this is a must buy. You only need one character and that character can play any class at a click of a button. I have been playing this for over a year now and I do not see myself quiting anytime soon.",
            "review_score": "1"
        },
        {
            "review_text": "So first time writing a review bout games on steam, but since I liked this one i suppose it's about time.  I'll start with the cons to FFXIV, but please read on cause i do recommend this game to others. - The fact that the game is a p2p game. Even though the Sub has 2 options, for those who can afford to buy the game but can't continue the Sub each month it's a big downer - A strange latency issue which i was told it's cause of where their servers are. - No F2P model at all. If i could make one suggestion to the devs for this game it would be to design an F2P model with a Sub option since that's the way a lot of modern day games are going.  Now for the pros and i won't list them all or this would be a 4 page essay. - Gameplay is easy, but exciting at the same time with having to watch and learn the mechanics of monsters and bosses to dodge frontal and AoE attacks. - The ability to have 1 character be all classes and gear each one the way you want to gear it. - The crafting system and gathering system is very interactive. - Dungoens/Raids have never been this interesting and mind blowing before. It's not just watch for the red carpet mechanics. You got to watch what the bosses do, what they spawn and even how things are placed and killed. - Funny, emotional and down right heart touching quests. The main story will grab you and never let you go, but even the side quests have that effect. - The guild system and community group system is ground breaking. I love the fact that there is your guild system with quite a few costumize options and a housing system for the guild including player housing (recently added), but ontop of that you have linkshells where whole bunch of people from different guilds or even guildless can form a group to chat with and share things with each other. - Everything you loved bout FFXI is still in FFXIV (classes are being added slowly as well) Even though a few of the classes are different from FFXI, there is a lot of the game style and even some class mechanics that was brought over from FFXI.  So even though it has a sub, if you can afford it then i would suggest playing this game over a lot of p2p games out there.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game. I played last year's beta and was not impressed. My man and I were so completely bored with WoW so we decided to give this a try since we saw all the good reviews. We been playing a month now and are amazed at just how fun this game really is. The questing, dungeons, and fates are wonderful and are all excellent ways to level. From early on, you feel like you are playing end game. I never feel like i'm grinding out levels.  Update: The Main Story line at level 20 that goes into the quests to get the mount is really a terrible grind. Something needs to be done about that. It does not allow me to play the game like I want. It is forcing me to do ridiculous running around. I also don't like how i have to do Guild Leves solo. I play with my man so that kind of stinks. I'm dissapointed. Really was liking this game and then it kinda is getting grindy and not so fun. I'll update again in another week or 2.",
            "review_score": "1"
        },
        {
            "review_text": "I have been trying out this game and so far I really like it. The quests are not the same go here quest they tend to diversify it a bit so you dont get bored. I ussally spend more time before I write a review but I wanted to voice one con Ive noticed. In the trailer I was given the impression that there were cutscenes with audio. Now in my expereince with questing I havent heard any audio [unless you count the narrator at the beggenging of the story]. This kind of dissapointed me because that would have made the game so much more immersive. Still an amazing game so far and I deffinetly plan on editing this review after ive played more.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Teamwork required to the max at high tier raid, downside is abit grindy for best gears.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not usually one for MMOs lately, since CoH sadly died out and WoW just isn't my thing anymore, but this renewed my love in a genre of gaming I had all but given up on. I was really sad about the Elder SCrolls online, and I had played the Beta for this one before, so I figured I just wasn't going to bother with mmos ever again, but a week ago a friend finally broke me down, I gave it a shot...and I am officially hooked.  If you have any reservations like I did, let me assure you that this game will renew your love in mmos, and if you are are a Final Fantasy fan, you will feel right at home.",
            "review_score": "1"
        },
        {
            "review_text": "Great game really enjoy it, was worried that it would not be as good because of the orginal ffxiv. But I am really enjoying it now ^-^ I recommend the game if you enjoy mmos with fantasy. Plus don't have to make a new character to play every class, You just have to go learn the new job. Really fun espeically with friends :)",
            "review_score": "1"
        },
        {
            "review_text": "Best MMo RPG I have ever played by far. It will kill your time and money be warrned XD",
            "review_score": "1"
        },
        {
            "review_text": "A visually stunning Cat Girl ERP chatroom",
            "review_score": "1"
        },
        {
            "review_text": "i dont exactly like the fact you have to pay monthly for this game but other than that its fun as hell",
            "review_score": "1"
        },
        {
            "review_text": "A little bit like WoW, but it's very fun and lots to do!",
            "review_score": "1"
        },
        {
            "review_text": "Best MMO ever, trust me. I'll pay to play this until i die.",
            "review_score": "1"
        },
        {
            "review_text": "What is the meaning of life.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT PURCHASE if you already have a FF14 account that was created w/ the non-Steam client. Existing accounts DO NOT transfer.",
            "review_score": "-1"
        },
        {
            "review_text": "better than wow  catgirls/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far one of the best i have played. There is so much content and plenty of classes to choose.",
            "review_score": "1"
        },
        {
            "review_text": "A hunderd-fold greater than WoW in many ways: storytelling (AMAZING), music (hands down one of the best soundtracks in any MMO), and immersive environments - to name a few.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, in depth story lines, amazing Graphics and locations. Great Game to play with friends. ",
            "review_score": "1"
        },
        {
            "review_text": "great RPG and MMO!! :D beautiful artwork, amazing story as well!! Will keep you busy for hours!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's ok I guess. I need more hours in a day.  I don't (do) need help. Thanks for asking",
            "review_score": "1"
        },
        {
            "review_text": "This game is 'WoW + Final Fantasy'. Using most WoW's MMO mechanics with little improvements (like Dynamic Events a lot like Guild Wars 2) and the graphical quality and style of old Final Fantasy.  So, if you dislike WoW you'll probably dislike FF:ARR as many game mechanics are taken directly from WoW (looking for groups, characters roles, questing and raids are pretty similar).  The story is quite good for an MMO, just don't expect something life changing. The games art have excellent graphics and animations all around, too.  Endgame bosses can range from quite easy to ultra hard especially if you go for random groups.",
            "review_score": "1"
        },
        {
            "review_text": "The constant content updates make it difficult to keep up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, and it's a MMO staged inside the Final Fantasy universe. What more could you ask for? Honestly.",
            "review_score": "1"
        },
        {
            "review_text": "Word em up! This game makes me happy. Never had so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "I started playing this game as a way to 'hang out' with my wife while I was out of town. Now im completely addicted to it. I have spent over 600hrs leveling numerous classes and just recently started going through the new 2.5 patch content. I would recommend this game to anyone who enjoys MMO game types. The main story quests are very immersive and really help you feel a bond with the character that you create. Plenty of side missions to keep you engaged and of course there are always dungeons, raids, and trials to take on with a group of friends.  Now my wife and I run the FC 'the anonymous' on Cactuar. Come join us!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "It's alright.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome mmo. Buy it !",
            "review_score": "1"
        },
        {
            "review_text": "Best P2P MMO out there at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun and players are very friendly and willing to teach.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly liked the game. its a good game when you can put up for the sub",
            "review_score": "1"
        },
        {
            "review_text": "Although this game starts out slowly, after the first few hours you realize that yes, this MMO is putting in an honest effort to have a legit story. The quality of the story seesaws back and forth depending on which bit you're on, but it's backed up by solid gameplay, delicious graphics, and good music. Now I just wish they released patches a bit faster with the expansion.",
            "review_score": "1"
        },
        {
            "review_text": "Im still the noob",
            "review_score": "1"
        },
        {
            "review_text": "good graphics, a very good battle system and 3 months ago the expansion came out i recomment this game",
            "review_score": "1"
        },
        {
            "review_text": "You know you struck gold when you engage in combat with your crafting materials.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. The combat is well done and the community is great! Square Enix put out a great title here.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game religusly on ps3 best one yet thanks to the producers ",
            "review_score": "1"
        },
        {
            "review_text": "Love the game in terms of gameplay, character/word design, cutscenes, skill effects, class system, player's communication capabilities, and everything in general. Would Love to see Vieras (or the like) as a playable race, as well as some other classes from other Final Fantasy Series, like Red/Blue Mages. Love the blend of old and new, in regards to sounds, music, and a few other intricacies within the game.",
            "review_score": "1"
        },
        {
            "review_text": "paid 5$ to get turned into a potato  10/10 would get punt again",
            "review_score": "1"
        },
        {
            "review_text": "my only gripe so far is all the load screens but its not that big of a deal  will edit later once i get through endgame w more pros and cons but from what i have seen n experienced thus far (lv 19 archer) this game has been pretty solid  much like the feeling i got when i first played wow i get the same excitement over this game already and greatly enjoy the questing and dungeons",
            "review_score": "1"
        },
        {
            "review_text": "Game is amazing. Graphics are impecable. SOOOOOO Stupid how you have to pay monthly.",
            "review_score": "1"
        },
        {
            "review_text": "The game that not only took over my Dota 2 addiction but also the game that made me realize what Dota was doing to me. 10/10 would crawl out of a cesspool to discover a game again.",
            "review_score": "1"
        },
        {
            "review_text": "A good MMO to pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "This is very good game",
            "review_score": "1"
        },
        {
            "review_text": "its pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "Nicest community out of all mmo's I have played thus far!  Some little guy in armor that looks like he can't carry walked up to me and gives me free money and says 'Hey! here you go to start off your adventure!'  We're now married, yes you can get married, yes im a gold digger 10/10",
            "review_score": "1"
        },
        {
            "review_text": "please help I can't stop logging in",
            "review_score": "1"
        },
        {
            "review_text": "Where can I start with FFXIV: A Realm Reborn. The game is magnificent with it's cutting edge graphics, 18 classes that require just one character to master them all on (no need of alts.) Amazing community, and countless hours of gameplay content. I highly recommend this game!  Pros -18 classes, one character, no alt needed! -Game looks great, even with low settings! -Breaks the conventional stereotypes of MMORPGs by introducing unique guilds, weapons, and classes.  Cons -Game isn't meant for low end PCs/Laptops. -Only little customization of the video settings. -I already paid for the game so why TF is there an additional 12.99 a month to be paid! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun, easy to learn and alwayys better with a party",
            "review_score": "1"
        },
        {
            "review_text": "Excellent all round mmorpg for anyone interested in the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Best mmo I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would monk again.",
            "review_score": "1"
        },
        {
            "review_text": "Im currently on a break from this game.. i have to manage this somehow lol.. but i will purchase more.. simply put this is the best MMO out there, square-enix went all out here and it shows even tho im at about 10% over the recomended the game specs it still looks incredible and runs at a decent rate. there are plenty of graphical and system options for people trying to get optimal results out of there cards i have a radeon r7 200 series and the game runs very well with the control centres   The gameplay is simlar to ff12 with elements of most of the ff series making an apperance ffI, V style class system, viii, ix triple triad cards and i could go on.  It quite a grind to get to a high level but very worth it, this beats wow any day of the week for leveling. you can join partys enter instances with partys or random players mostly players are nice.. some arnt.. i dont consider this squares fault  If you want to have a game to play constantly get this  10 out of 10 (Kweh?!)",
            "review_score": "1"
        },
        {
            "review_text": "Last I remember it was the year 2014. This game will steal your life. Excellent MMO with interest campaign built in with your character based within it. Interesting content ranging from casual, to mid and hardcore tastes. You can play 8 hours a day and beat patches within weeks, or if you try to take in all the game has to offer you won't run out of things to do. Make your own judgement, as far as MMO's go. This is definitely a fun one worth the pay-to-play model. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "if you hate games that you spend 3 hours grinding the story only to see the end within 1 hour of actual gameplay this game is your goddess the story just keeps going and going and going...ahem  what i mean to say is FFXIV is a good quality game it has quite a bit of lore added to it and that is a major understatement you can spend the next 8 hours a day for 4 months and not be halfway done with the main story for the game not including side quests i know because i did that before heavensward expansion came out and my god it took forever to get to the highet lvl with the best equipment to just find out the end was only another chapter in the story   it is a monthly subscription so i suggest you trial it and find out for yourself for people on low income bugets i suggest guild wars 2 cause its free but for the workers who got dough this is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "It went from a gud game to a cancerous tumor thats killing the MMO genre.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this for my PS4 and it was pretty good, so I then purchased it here on Steam and the computer version was even better. I was able to configure my UI the way I wanted and on absolute max graphics setting I am sustaining 65-80FPS with a 4 year old gaming desktop (was top of the line, now mearly okay). Best thing is I can play this on my PC while my roommate plays it on the PS4, on different accounts. Graphics 5/5 Gameplay 5/5 Account registration on PS4 2/5 Storyline so far 5/5 Controls 5/5 I was able to rebind all the hot keys to match my Razer Naga Chroma mouse.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent storyline",
            "review_score": "1"
        },
        {
            "review_text": "I am writing this for the steam version of FFXIV however I only recently started playing it on PC. I have 110 days gameplay logged on the PS4 version, so I feel pretty confident when I say this is hands down my favorite game and one of the most beautiful games ever made. Even after two years of playing this game heavily it continues to be the game I choose above all else. Be warned though, this is not a game that is easily picked up or put down, it has a fairly large learning curve and requires some level of dedication in order to really experience this game the way its meant to be played. you can expect to play 40+ hours a week for about a month before you get to some of the 'endgame' content. Not to discourage anyone thinking of picking it up though, I think everyone should spend some amout of time in FFXIV so as to see what a wonderful world SE has created. It's a must play, 10/10 in my book.",
            "review_score": "1"
        },
        {
            "review_text": "As with all the Final Fantasy games; it has graphics that are nice on the eyes, an interesting story concept regardless of the length, and a pleasing soundtrack that wont hurt the ears. I would recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "If you love Final Fantasy games and are unsure about picking it up because its a MMO and it'll take away from the experience. Then allow me to reassure you, Even though its an MMO, FFXIV has done it amazingly well with their Story. Taking part with the MMO basics of Dungeons, Raids and Guilds, as well as putting their own twist on it with Aeons/Primals, If you don't get hooked on the fights, The music will get you to come back to them, Each having an amazing soundtrack as it fires you up to fight onward, Coming from someone who enjoys Final Fantasy games in a whole and has put hours upon hours into them, Going to A Realm Reborn was a great refreshing feeling.  So far my best experience is the Trial fights with all the different Primals they have in store for you, Not only in A Realm Reborn, but in the Heavensward Expansion as well. Each having a great impact and leaving you wanting to go at them again and again.  One other thing to mention is that Final Fantasy 14 allows you to change classes at will, so theres no need to make another character to play a different class, You may begin a new class at anytime by talking to their respected Guilds and taking on their Quests.  Long story short, The games great, Ive had countless hours of fun, Trials kept me wanting to come back and VS tough opponents, Dungeons had great mechanics and a great level curve, The music is amazing to listen to, Although it is Pay to Play, You can start a free trial to see if you would like it or not, But Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "really nice game but the beginning is boring :PPP",
            "review_score": "1"
        },
        {
            "review_text": "probably one of the best mmorpg I have played and it's even greater when you're a Final Fantasy fan  la hueá de pana conchetumare, lo vale",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Two weeks ago, I broke my leg, lying in bed all day thinking about my life. Then, I said 'To hell with my life, I am going to have a new one.' Now I am a snowball throwing, face slapping wizard. Still didn't get the invitation letter from Hogwarts tho.",
            "review_score": "1"
        },
        {
            "review_text": "That King Thordan boy needs an ♥♥♥ whoopin. 420/420, would attitude adjust again.",
            "review_score": "1"
        },
        {
            "review_text": "Frankly Final Fantasy XIV is an amazing MMO, and also an amazing game. And it is quite an experience, its MMO aspects are well refined (of course not flawless) and certainly top notch. The story is absolutely great, and in general I think that it is a wonderful experience from the moment you create your character and as you advance through the Main Story Quest (MSQ). While certain elements of the gameplay may feel foreign to some (like the 'long' global cooldown) especially at low level, the game picks up nicely.  And not just that, bu you can see in many things how the developer team cares for the game, from small things like the seasonal events, to the story, music among many other things which is refreshing on a day and age where developers seems to be much more interested in a quick profit, while providing lackluster content. If you love MMORPGs, Final Fantasy XIV is a great game and worth trying it out.  If you are not a fan of Final Fantasy games it doesn't matter, I never played many titles of the franchise before, and was skeptical, as I was quite content with playing World of Warcraft, but this game became a new home to me and I absolutely love it and proof of it is the amount of hours invested in the game.  So TL;DR version  Gameplay: 8/10 Story: 10/10 (it is great and each patch adds more and more story) Music: 9/10 Graphics: 9/10 (its certainly one of the best looking MMOs our there)",
            "review_score": "1"
        },
        {
            "review_text": "1,075 Hours in   Pro: Beginner Friendly Very Smooth game play Great Music Pretty Friendly community Many Jobs and a good number of Race to choose 1 Character can use all Jobs/Clases $12 a month Rich Story - You are the HERO Veterian players will help you with dungeons and bosses due to Daily Rewards Party Que for story takes up to 1-20 mins Max wait.  Con: Starting Grind can be a bit hard but there should be no problems P2P Pay to Play if you are broke $12 is only locked for 1 character per server  If you want help let me know in Hyperion I'll be glady to help you.",
            "review_score": "1"
        },
        {
            "review_text": "My playtime should be enough of a recommendation. Final Fantasy XIV is, in terms of quality, by far the best MMORPG I know.",
            "review_score": "1"
        },
        {
            "review_text": "haven't had this much fun in a MMO in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "I'm surprised I put 500 hours into this game. These days for some reason I can't even download it without feeling bad about it. When I first started playing it though I really enjoyed it and the story was okay. Voice acting was terrible though but that isn't the main reason I play a MMO. Its mostly for PvE contact like raids and dungeons.   Once I got to end game I quit this game. I just got really bored with it, but the journey was fun up to that point. I would still say this is one of the best themepark MMO's out there. Sadly, this will probably be one of the last themepark MMO's I ever play though as I'm tired of them. But if that is what you are looking for. Give this one a shot, it's pretty fun.  7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes I bring my computer outside.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly a really good MMORPG. I came into it expecting another WoW clone, and I was pleasantly surprised. Graphics are beautiful, game engine runs like a charm, and the gameplay is top notch.   9/10",
            "review_score": "1"
        },
        {
            "review_text": "  Months ago, a friend gifted this game to me; she told me I would love it... And I have to say, I do! This is awesome; has epic graphics (that my computer can barely handle lol), and the players here are (mostly) really nice! I once said that I would never pay for a subscription game; I am really glad that I was proven wrong. Thanks SE!",
            "review_score": "1"
        },
        {
            "review_text": "It's okay. I mean, I totally am not gonna spend thousands of hours playing this game...",
            "review_score": "1"
        },
        {
            "review_text": "Note: As I need to start the game from the .boot folder as administrator for it to work, the Steam client wasn't able to count my Playtime!  I was somehow ♥♥♥♥♥♥ about my Initial download being next to useless (8,7GB via Steam + 14,5GB via FFXIV Launcher) and experiencing technical difficulties after.   but  10/10 - would buy again! (And will do, monthly payment ect...)",
            "review_score": "1"
        },
        {
            "review_text": "Just a great mmorpg!!",
            "review_score": "1"
        },
        {
            "review_text": "'DPS numbers are everything for people now, they can't even look past it to party utility. If you're not doing high numbers then you're bad. It's narrow minded and the game caters too much to it.' - Anon 2016  Everything else is top notch though.",
            "review_score": "1"
        },
        {
            "review_text": "*Price Warning* Super pricy at every expansion launch in comparison with your major releases out there. This is being said from the point of view of my country, where HW cost at the time $20 more than the standard price.  *The game itself* It is very fun but consumes a lot of time if you really want to dive in its contents. Endgame heavily relies on preformed parties of 8 dudes, that usually demands voice comms, to clear those   ♥♥♥♥   hard contents. The rest of the 'endgame' content consists of dungeons    that are dead easy to do  , a 24-man raid    which is also dead easy to complete and it's actually a shame calling it a raid   in almost every meaningful patch and some other contents that you better see for yourself.  *My Considerations* I need to stop playing it. The game lost its bright and I need to do so while I haven't played that much.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent overall game, especialy if you play with 3 friends. Sooo very pretty, the main quest storyline is well thought out, and the ability to try all roles with one character is awesome.  Subscrition is a bit of pain, but the constant updates and seasonal events make up for the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Spent a lot of time on it. Don`t regret anything",
            "review_score": "1"
        },
        {
            "review_text": "Do you love subscription? Do you love Final Fantasy? Do you love Square Enix?  I'm assuming you said 'yes' to the first two and 'no' to the last, right? Normally most people are turned off by the subscription model, but I guarantee you if you are into SE and FF - subscriptions will mean almost nothing to you. This game is worth almost every penny that you put into it and it's highly enjoyable. I'll just go into it below.  Pros: - Class system. With one character, you can play EVERY class in the game. This means you can choose the cheaper sub that restricts you to one character per server versus eight per server. - The community in general is great. There have been a few salty people, but what game doesn't have that? It's very minimal though so don't mind it... unlike League. - Gameplay mechanics is brilliant. It all feels very smooth and actually very fun to plan your next moves (if you like the strategy). - Level syncing. Are you a new player and want to play with friends? Well, you can't join them for obvious reasons, but they can join you with a level sync! Their gear gets toned down to be appropriate to the dungeon/FATE level so it won't be overkill.  - End-game life is actually very enjoyable. You have many options available to you: grind for BIS gear, work on other classes, craft stuff, gather stuff or maybe even help people. - The game provides many different ways of helping you. Dungeons get progressively harder so you can ease into the game or use the party/raid finders to assist you. - The game patches assist those who are new to the game to speed them towards the end-game. For example, I had to restart my progress and I managed to catch up to the 24/7 players within two weeks (might be an overstatement). - The storyline is relatively enjoyable. Sometimes a bit cliche, but the DLC provides a very enjoyable storyline. - THE MUSIC. OH MY GOD, THE MUSIC. SQUARE ENIX GETS IT RIGHT AGAIN. - I personally think the subscription is at a very decent price. I pay £7.69 per month for the entry sub. If you know you'll play for a long time, buy in bulk - it gets even cheaper. - The marriage system, fairly self-explanatory.  - I'll add more pros if I can think of any.  Cons: - The early game. It's very tedious - you usually spam two skills until 26-ish with the occasional other skill. Just hold on, man - you can survive. - The DPS queues early on. When you play as a DPS, you would normally expect that queues are long since it's the most popular role. It does get better later on though, since DPS are needed a lot more. - I'll add more cons if I can think of any.  If you have the money to keep a sub, play it. If you love Final Fantasy, play it. If you love Square Enix, play it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Ive been playing this game for over a year now in combination between pc an ps4 and ive loved this game from first time i played the ps4 beta until now and i will continue to love this game. The community is generally very informative and what not and most are willing to help new players through dungeons or whatever you may have questions about. Most of my time in game has been on the leviathan server. The story is a rollercoaster of emotions and badassery im not a fan of Pvp in the game but i never have been for any mmo but all in all this game is absolutely fantastic and really gives something else to the mmo world rather than your typical stuff. Grinding is not a huge part of the game but it is required to play the game in the best way possible. Meaning that you have the ability to use abilities from different classes and you will need to level up other classes to access them. One important thing to note is that you do not have to run alternate characters to experience all of the classes. One character can have all classes and what not for those who really want to get the most out of the game and those who love to hunt for achievements. The sub price is about 15 a month so its on par with mmos such as WoW and what not. You can also pay for your sub through your steam wallet which i find pretty cool. All in all its a great game and worth all the time put in it.",
            "review_score": "1"
        },
        {
            "review_text": "Finally completed Hall of the Novice!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth picking up, Great Story, Great Visuals, and Tons of stuff to do for example Zodiac Weapon Quests, Job Quests, and excelling in skill trades like crafting",
            "review_score": "1"
        },
        {
            "review_text": "Crafting and such is pretty fun, even if the success % displayed is always wrong unless it's shown to be 100%.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty fun I'd say.",
            "review_score": "1"
        },
        {
            "review_text": "It's wow with a classic sense of progresson and anime stuff.",
            "review_score": "1"
        },
        {
            "review_text": "'WARNING: MAY FORGET TO EAT'",
            "review_score": "1"
        },
        {
            "review_text": "amazing game spent hours in it and would spend a lot more in the future",
            "review_score": "1"
        },
        {
            "review_text": "Not enough hours in the day...",
            "review_score": "1"
        },
        {
            "review_text": "I have owned this game for a few months, and have already racked up a massive amount of hours. My first session was 845 minutes, or just over 14 hours. This game is incredibly addictive, and while the beginning of the game is easily the worst part, should you manage to make it through, what you have ahead of you is tons of exciting and incredible content, which is then taken further through the amazing Heavensward expansion. Overall, I rate the game a 9/10, because playing Black Mage makes me salty when I have to cancel a spell to avoid an AoE.",
            "review_score": "1"
        },
        {
            "review_text": "Ate my life Five stars",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "I just got this game and I can't stop playing it. Cat girls/10.",
            "review_score": "1"
        },
        {
            "review_text": "With almost 3000 hours in about 2 years into this game I still enjoy it, there is plenty of content to keep things exciting and still things that I haven't done.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game for a MMORPG",
            "review_score": "1"
        },
        {
            "review_text": "Hey, that's pretty good...",
            "review_score": "1"
        },
        {
            "review_text": "If you like invisible walls, this is the game for you. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I played the original game before they remade it and it's insane how much better it is right now.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes I'm ashamed of my playtime, so I play the game with the non-steam launcher.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, good MMO. No reason not to at least try the game with the free trial. I don't have much to say other than the fact that this MMO does it right. Of course there are it's flaws, but if you are looking for a game to play of this kind there isn't much better than it.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game, even so if you got friends to play with.",
            "review_score": "1"
        },
        {
            "review_text": "I spend my New Years Eve as a Cat lady running around trying to get a hat with a yellow bird on it. 5/7",
            "review_score": "1"
        },
        {
            "review_text": "help me.  Also don't buy the steam version.",
            "review_score": "1"
        }
    ]
}