{
    "app_id": 392820,
    "name": "Wild Island Quest",
    "release_date": "2015-09-04",
    "developer": [
        "NLB project"
    ],
    "publisher": [
        "NLB project"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Visual Novel"
    ],
    "achievements": 10,
    "positive_ratings": 137,
    "negative_ratings": 140,
    "price": 1.59,
    "description": "In an endless air ocean of an alien world, small lonesome plots of land float above the abyss. But sometimes approach each other, and lands which have never met before, reveal their secrets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/392820/header.jpg?t=1547240734",
    "minimum_requirements": "OS: Windows 2000 Processor: CPU 1 Ghz or higher Memory: 512 MB RAM Graphics: Integrated graphics Storage: 700 MB available space Sound Card: Any sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's not the best game I ever played, but that was expected. However I found it to be quite charming yet somehow highly disturbing if you got the rifles and rifles and rifles then rifles-ending. Artwork is funny, quite nice sometimes but lets face it 2-3 (more like 10+) more pictures for major things happening wouldn't have hurt anyone. I'm doubting if I should pick yes or no as for recommended, so you'll get a yes this time. But thats only cause I really don't care, also I don't care why am I even writing this review someone stop be what happened to grammar cut me off plea-",
            "review_score": "1"
        },
        {
            "review_text": "its nice. i am glad i found this game. Thanks Obama",
            "review_score": "1"
        },
        {
            "review_text": "I beat this game in 10 minutes, this game is dogshit with no gameplay at all, it's an interactive story with boring characters and awful graphics, stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "Where do I even begin with this game... Wild Island Quest follows the story of a group of guys who are going from their home island (Mech-City Island) to Wild Island while it's on a rare pass-by. While you can go it alone, you can also gather up your friends to go with you. What choices you make determine how many of your friends you can recruit (I did the path with recruiting Conan only).  Interesting idea, right? That's what got me initially interested. Unfortunately, everything goes wrong in Wild Island Quest quite fast. If you're able to even follow the story, you'll find a a lot of English mistakes in terms of grammar and odd word choices. This pretty much tells you that this was translated with a Russian to English dictionary and in quite a few places it seemed they didn't quite know which word to use so they just picked a random one. Of course, this 'random one' makes very little sense to a native English speaker, and in several cases I actually had to go search up words that were used to try and figure out what word/meaning they were going for.  The horrendous English coupled with the pretty poor graphics (the models just look awful) make Wild Island Quest fall very short of what it could have been. As it stands, unless some drastic improvements are made, this game gets a gigantic pass. There are better visual novels/choose your own adventures out there. Oh and no, there isn't really a 'combat system'. You just choose if you were lucky or unlucky in an outcome.  Easy Game to 100% for achievements if you want to boost the amount of games you have 100%. Lots of keys are floating around, would recommend to just grab one if you want to actually play the game. If you dont like the gameplay at all the trading cards can help you feel better after getting the game for free.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Solid 12 min gameplay  Dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "Forget it. Don't even think about buying. Even for the low price there are many other games....better games, or at last they are games....this one is not a game. And the promises? Non linear game....false. The end is always the same. Visit the shed? Nice now you can use one item.Didn't visited the hunter and get his dad's gun, or a lighter... bad luck, try again. Get the girl in your party...oh, see you get another *option*...but its useless. Unique picture for every location. OMG I've seen better pictures in adventures from the 90's.  So what's this game all about? Before your grand adventure you can recruit some friends. Doing that with every friend comes one decision. You can hurry or not. If you choose not....you get an item and your adventure starts. If not, you can recruit another friend. After your adventure starts there are many *cough* decisions for you. Sleep in the trees? In a self made hut or a cave. Make fire. Shoot a beast. Every one depends if you have the *right* friend with you (and the item). After that there are 2 more screens with different options.  And than its over. You may think I played it wrong....well I played it 7 times (under 1/2 hour) and I feel cheated.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Everything is decided by a single dice roll in the beginning of the game which indicates 'luck' for the whole playthrough. The story has a cool premise, but it is so poorly executed. Art is ♥♥♥♥♥. A single playthrough literally takes 10 min.",
            "review_score": "-1"
        }
    ]
}