{
    "app_id": 392940,
    "name": "Epic Quest of the 4 Crystals",
    "release_date": "2015-09-25",
    "developer": [
        "RosePortal Games"
    ],
    "publisher": [
        "Aldorlea Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 25,
    "positive_ratings": 108,
    "negative_ratings": 22,
    "price": 6.99,
    "description": "The most non-Japanese jRPG of the decade! Epic Quest is an action-packed adventure featuring over a dozen classic and rich environments, 5 playable characters and a plethora of skills, spells and Limit Breaks. A must-have for fans of the SNES Final Fantasy and Chrono Trigger!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/392940/header.jpg?t=1460663399",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 200 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I would write a long review but i don't want to waste my time. I've already wasted both my time and money.  Edit:  I'm sorry i can't say i liked it. The game is mostly boring and static. I found this game lack of some RPG elements and the ones it has are presented very poorly.   For example, i don't understand why there is a levle selecting menu in an RPG. and levels are just some dungeons for fight and nothing else. There is only one person who appears every level and sell/buy some stuff. But there is nothing or no one to interract. And there isn't even a proper map. The minimap is useless. You need to look to the strategy guide for navigation and pressing alt+tab always is terrible. The need of non-free stategy guide is an epic fail for alone itself.   Combat is boring. There isn't so much to do. But the worse part is, you need the finish in a specific turn without losing so much HP. So you can claim full reward. But this make it more boring. For the rewards, you have to just attack with your characters full power and finish the fights as quick as you can. And this is the one of the two way for making your characters stronger. The other way is leveling up but it doesn't give you so much. Only speed of your characters increasing and you can be able to use more abilities but you can't say chose anything or decide anything. For my opinion this is terrible character progression for an RPG.   Another thing about make RPGs awesome is story. I wanted the see the end of the game even if it bores me but i couldn't resist and didn't play at some point. Trying to make poor twists and some jokes doesn't make story good.   So I didn't almost anything about this game.",
            "review_score": "-1"
        },
        {
            "review_text": "bought the game because of the subtle narrator 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Epic Quest of the 4 Crystals is a good JRPG, which takes the best elements from RPG and mixes them together! And 'a must for fans of the genre    (Below is the Italian full review)",
            "review_score": "1"
        },
        {
            "review_text": "This is the first RPG maker game I've played so far, but love RPG games, so i was really pumped to try one. So far I've played till Lv. 4 (still playing) and i can say i really love it!  There's a great storyline so far, there are quite some jokes in the game, some referred to Game Of Thrones, some to the final fantasy series. The best part is, if you aren't a fan of the jokes from the start, you can censor them.  On to the gameplay: Easy basics, you get some help on what to do etc. but one some points i had no idea what was going on. Might be because I'm new to the RPG-maker and it's games. Battles and music are great. Your battles have a 3 star system, the more stars you have left when the battle ends. The more stuff you get. 1 star is granted for completing the fight, 1 if you do it within a certain amount of turns. And one for receiving a minimum amount of damage. You can always choose to retry the battle if you missed out on a star, and really want them. While in battle you always have the option to Auto-attack, defend, escape, use an item or do abilities. All work really good, and after doing a certain amount of attacks you gain the ability to do an overdrive skill. Which does some damage, or even heal you. Some monster groups require the use of overdrive to get the 3 stars, so you even have to think about this in advance, not wasting your overdrive on an easy group. The only negative thing i have to say about this game so far is that i had the feeling some of the overdrive abilities did too much damage early game. Making it a bit too easy to get through the first levels.I would highly recommend this game if you like good old RPG-games and have a sense of humour!",
            "review_score": "1"
        },
        {
            "review_text": "The strength of this game lies in it's game play, The interface is smooth, with it's maps and easy access to your items, it also allows you to retry battles in case you want to beat fights at the highest star. The gameplay itself is great, it makes you want to ensure to cover every part of the section before moving foreward with the point system and recording your progress.   The story does not take itself seriously therefore neither should you, this game is a light parody of your typical RPG games (while not mocking it at the same time) it provides more laughs than anything. In terms of characters, while some are likable, they are not very memorable as individuals.  Overall, I recoment this game for people who focuses on great gameplay, light humour and don't mind not getting a deep serious plot.",
            "review_score": "1"
        },
        {
            "review_text": "I have just started this game, so this review will be short now, but I will add stuff while playing the game. In first glance it is a typical RPG maker game but with fun music, nice visuals and character designs, and funny dialogues, making fun of some elements of RPG's 'Why does everyone leave their doors open. So we can walk in and plunder their belongings' , You have to get used to the controls, only used the keyboard right now, but controller might be easier. I haven't had experience with fighting yet (except the dummy), so I will get to that later. For now I think this is a fun game to play.",
            "review_score": "1"
        },
        {
            "review_text": "A good game created with RPG Maker that we can always enjoy with good story.   Pros: - Funny characters and conversations. - Quests more than 'hit' or 'kill the monster' and also diferent ways to make them. - Re-play with the 'perfect score at batles' so if you like to get the perfect score you can try again the batles and try diferent tactics. - Nice OST that make you play more comfy and pumped up for a hard battle. - Side Animated Battle, not usual on RPG Maker games.  Cons: - Minimap may get you a bit confused, a lot of info, so you get a bit 'overdrived'. - The non-compatibility with the controller (You still need to use keyboard and mouse for the menu) at least in the beta i think.  Love this game, would play more when i have some free time :) 8 out of 10 points  ",
            "review_score": "1"
        },
        {
            "review_text": "Its almost Chrono Trigger.",
            "review_score": "1"
        },
        {
            "review_text": "This is a cute little game built with the use of RPG Maker. It shows that, in the hands of a skilled developer, that simple engine can still produce enjoyable quality RPGs despite its technical limitations.   Graphics look good, levels are well-crafted with a love for detail. The music is rather pleasant and used expertly to set the mood. Story-wise, the game doesn't take itself too seriously and occasionally pokes fun at common RPG clichés.  Disclaimer: key provided by the developer.",
            "review_score": "1"
        }
    ]
}