{
    "app_id": 393150,
    "name": "The Dreamatorium of Dr. Magnus 2",
    "release_date": "2015-09-09",
    "developer": [
        "Two Desperados"
    ],
    "publisher": [
        "Two Desperados"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Hidden Object"
    ],
    "achievements": 15,
    "positive_ratings": 53,
    "negative_ratings": 21,
    "price": 5.59,
    "description": "The Dreamatorium of Dr. Magnus 2 is the second chapter of the game you loved. Colorful locations, challenging puzzles, RPG elements, amusing comments and many more to come!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/393150/header.jpg?t=1478088745",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM Storage: 650 MB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 3 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM Storage: 650 MB available space",
    "reviews": [
        {
            "review_text": "I really enjoyed the game, although it has some minus points.  The story is a detective, with some mystical things. You can see in the past. And finding clues is just a part solving it. You have to puzzle your way through the game. The story is well thought off. With a disappearance and some (ghost?), ah well you will find out by yourself. They did it quite well, but it is missing some depht when it is about the characters. You will mostly read about what happened. But you will not encounter many. So you do not know there role. Untill you have read it, so don't skip the articles.  2 hours, watching all clips, is all that is needed to complete the game (all achievements). It's short, but well, who bothers if you enjoy it.  There is one thing that really bothers me. The voices of the female characters. They do not sound natural. More computermade. So that's a thumb down. But the males are good to listen too. Too bad you're a female.  A second small thing is how easy the game is. I've never had finished the puzzles and hiddenobjectgames to fast. Maybe I play them too much, but i find, in comparison with some of artifex mundi games, they are easy. If you just starting, this one is ideal.  If this does not bother you, you can enjoy the game. Otherwise, there are more difficult ones on the market.  For the music fans: I like it, and it didn't bother me in the game. It is well chosen, but i'm not you, so you might differ.",
            "review_score": "1"
        },
        {
            "review_text": "The game that proves that one lousy voice actress can ruin an entire game.   Ok, not just that, but holy hearts that was bad. I'm usually not one to notice or be too picky about voices but this girl must have just gotten out of bed with a hefty hangover and had one readthrough for all the lines. The other voices are also not very good , and the standard isn't overly high with these kind of games.  The game follows a paranormal investigator (or soemthing) lookign for a missing girl and unraveling a story about a ghost on the way there.Really nothing special and if you bother to pay half an attention to the story in the pictures and writing you find during the game, it doesn't take long to guess the ending. For some reason this game is #2, the first one is not on steam.   The puzzles are not very hard; some times yo don't even have to do things in the right order for it to work out.   The game also throws you into a new location of the map with no warning, so igf you missed some collectibles in the earlier locations, you have to replay the game from the start. My game time is therefore one and a half playthrough of the game or so. Most other achievements are achieved in one playthrough as long as you don't skip puzzles.  TLDR; there are way better games in this genre. Buy on a big discount if you need it for a collection or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice plot in this game, has nice puzzles and nice graphics. The game is somewhat short and the voiceacting sounds a bit odd. But that didnt bother me too much, I found this game to be fun.  Recommended for all point&amp;click/hidden object lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay was similar to other missing object games, but it took about half as long to complete the story. The main character's voice actor wasn't very good-she sounded like a middle school student reading from a textbook.",
            "review_score": "-1"
        }
    ]
}