{
    "app_id": 393200,
    "name": "Bad Rats Show",
    "release_date": "2016-07-20",
    "developer": [
        "Invent4 Entretenimento"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Workshop",
        "Partial Controller Support",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Memes",
        "Great Soundtrack",
        "Gore"
    ],
    "achievements": 14,
    "positive_ratings": 511,
    "negative_ratings": 96,
    "price": 1.59,
    "description": "Bad Rats Show is a physics puzzle game where the rats exact their bloody revenge against their main enemies: the Cats. Solve puzzles in 2D and 3D maps using physics, objects and specially trained Rats. All new Rats and Cats, but with the same classic and questionable Bad Rats humor.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/393200/header.jpg?t=1469037591",
    "minimum_requirements": "OS: Windows 7 or better Processor: Dual-Core Processor 2.5 GHz or better Memory: 2 GB RAM Graphics: DirectX®11-compatible graphics adapter with 1 GB (2 GB recommended) DirectX: Version 11 Storage: 1 GB available space Sound Card: DirectX® compatible",
    "recommended_requirements": "OS: Windows 7 or better Processor: Quad-Core 2.8 GHz or better Memory: 4 GB RAM Graphics: DirectX®11-compatible graphics adapter with 2 GB DirectX: Version 11 Storage: 1 GB available space Sound Card: DirectX® compatible",
    "reviews": [
        {
            "review_text": "For $4.24 it was either this or a sandwich. If you think about it, I could have gotten food poisoning from the sandwich so really this was the correct choice.",
            "review_score": "1"
        },
        {
            "review_text": "- 1 copy of Bad Rats Show - $0.49  - 10 copies of Bad Rats Show - $4.90  - Your friend's faces when they recieve a copy of Bad Rats Show - priceless",
            "review_score": "1"
        },
        {
            "review_text": "Jerking off to this game has kept the furry in me under control",
            "review_score": "1"
        },
        {
            "review_text": "I am going to write an actual complete and honest review for this game. Haven't seen many to be honest.   There is a TL;DR for those of you who don't read much.    To preface, these are the important specs of my PC:    Nvidia GeForce GTX 660 2GB VRAM    Intel i7 3770 quad-core processor    16GB DDR3 1600Mhz RAM     Performance: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece.  Just to start things off the graphics are amazing. Better then any Triple A title I have ever seen. The Design and The Art Style is so unique I can be sure you will never find these graphics again intill Half Life 3 comes out.  The soundtrack is a masterpiece. It's like if Jesus Chirst and Mozart had a collab. But better. The music really screams out the game and how unique it is. Just listen to the OST and you can feel yourself getting closer to Lord Gaben.  The gameplay takes the amazing gameplay from the last game and has a fancy dinner date with it and then the day later. Getting married. The puzzles are 10 times harder then the last game which makes the game have HOURS of gameplay which makes the game even funnier!  For the sake of Jesus Chirst.. PLEASE BUY THIS GAME! ITS AMAZING  10/10 ign GOTY 100% Rotten Tomatoes                                                     lord save us all   ",
            "review_score": "1"
        },
        {
            "review_text": "  The original bad rats has touched me in the soul that many other games can not. When i first learned that Bad Rats : The Show had been released i could not contain my joy but unfourtanately due to financial problems i had to wait due to the hefty price of this amazing game. Then One day my friend gifted this to me and quickly i installed it overjoyed to finally be able to play the most anticipated game of 2016.   When i first launched the game i was dismayed that i could not launch in fullscreen even though i had enabled it. Then during the the tutorial the game crashed. I chalked it up to a bug and i relaunched to continue playing the game i had waited so long to enjoy. Then for the next few minutes i was in paradise , the game was amazing I was setting up traps killing cats like it was my day job then once again it crashed , It had been a few minutes and luckily the progress was autosaved so i relaunched then it happened.  It crashed again , then again , then again and i couldn't even progress past the level i was currently on due to crashing. The tragic irony of me waiting so long for one game that i was able to expirence for 0.3 hours before it was brutually stripped away from me leaving me in the cold dark despair that is my life without Bad Rats : The Show . I sit in my dimly lit room with a bottle of jack daniels in my hand and a .44 in the other ready to take my life because of void that Bad Rats: The Show left in me. A Void that can only be filled with the sweet release of crossing the veil into the after life.  TL;DR Games pretty buggy bruh ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is one of my favorite puzzle games! i love the grapichs and the amazing gameplay! the story takes you in and ♥♥♥♥s you up!  I rate 9/11",
            "review_score": "1"
        },
        {
            "review_text": "Hello darkness, my old friend I've come to talk with you again Because a vision softly creeping Left its seeds while I was sleeping And the vision that was planted in my brain Still remains Within the sound of silence",
            "review_score": "-1"
        },
        {
            "review_text": "They've added me good friend Fat Rat back.",
            "review_score": "1"
        },
        {
            "review_text": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At age 19, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because Bad Rats Show gave me cancer anyway.",
            "review_score": "1"
        },
        {
            "review_text": "  God damn, those rats are sexy as hell, I want to sex them up all night long while watching the cats submit to them.",
            "review_score": "1"
        },
        {
            "review_text": " In seven years, Bad Rats went from indie FAIL, to indie GAME OF THE YEAR.",
            "review_score": "1"
        },
        {
            "review_text": "Eventually the rats will start a show about avenging dogs and rabbits for what they did to Jimmy Two Teeth.",
            "review_score": "1"
        },
        {
            "review_text": "  Best video game sequels of all time:  - Uncharted 2 - Batman: Arkham City - Portal 2 - Bad Rats Show  'nuff said",
            "review_score": "1"
        },
        {
            "review_text": "This game has one of the best soundtracks I have ever heard and has a vast variety of Voice Actors 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It definately has improvements over the first games, but the problem is a lot of those are things the game didn't need! It doesn't need voice acting, it doesn't need glowy arrows and stuff, it doesn't need stranger rats to use in the puzzles, and it doesn't need an explaination of its premise! But still, like the first game, this is just so bizzare you can't help but be entertained and not even care if you solve the puzzles. To some degree, this has a self-awareness of being so-bad-it's-good. Normally when a franchise goes from accidentally so-bad-it's-good to deliberately so-bad-it's-good, it ends up feeling forced, but this keeps everything that made the first game entertaining and presents it in a new flashy format.",
            "review_score": "1"
        },
        {
            "review_text": "It crashed twice in 9 minutes, once while in a cutscene. The true successor to Bad Rats. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Memes aside, this is legitamately a good game. It's like Bad Rats 1 but without the bad physics and 3D. This game would've been an better if the optimization wasn't so bad and had a Linux and Mac version, but overall decent.",
            "review_score": "1"
        },
        {
            "review_text": "I was suffering from depression and was finally going to drink everything under the sink today, until I saw this game was coming out today. Bad Rats Show saved me from death, instead giving me a fate worse than death. If you suffer from depression, the good message in this game about how all life is meaningless and murder is ok as long as its done on a stage should save you.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY GOD. IVE BEEN WAITING FOR THIS GAME FOR TOO LONG. AND IT DELIVERED. OMG IT DELIVERED. Im just so excited to beable to blow up these ♥♥♥♥ing ♥♥♥ hole cats now and wow does it feel good. Enie Meanie Mineie Moe This cat will surely blow. ;)",
            "review_score": "1"
        },
        {
            "review_text": "The Citizen Kane of Games.  Also workshop support, custome maps, and decent voice acting  legit 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Just an amazing sequel. Either this game or the original need to win some award.",
            "review_score": "1"
        },
        {
            "review_text": "SP: ★★★★☆",
            "review_score": "1"
        },
        {
            "review_text": "the rats are badder than ever, they're back to continue the carnage.  10/10 instant goty for me",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game to anyone over the age of 5, because the immersive gameplay is probably makes it one of the best games made all year. I really think it deserved a lot more hype than it got, unfortunately games like Battlefield 1 which are over hyped have put a giant shadow over the true genius of Invent4 in this second coming of Bad Rats: The Rats' Revenge. Also the soundtrack of this game is just pleasing to the ear.",
            "review_score": "1"
        },
        {
            "review_text": "Its actually not that bad.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games of our generation",
            "review_score": "1"
        },
        {
            "review_text": "  Just like all masterpieces, Bad Rats Show crashed on the 4th level.",
            "review_score": "1"
        },
        {
            "review_text": "Hi my name is bruce and I am very displeased with this game so if you could like fix it or something because it crashed",
            "review_score": "-1"
        },
        {
            "review_text": "I guess I can try the new Refund System",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start off by saying that this game has offically ruined any hope that I may have had for a brighter future. This game not only put me off of puzzle games, but games themselves. The gaming industry has been destroyed by the Swedes yet again. (First Notch and now this).   11/10, would rat again.   ",
            "review_score": "-1"
        },
        {
            "review_text": "'money cant buy happiness' ok then wtf is this",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed the first game with ♥♥♥♥♥♥ physics and constant crashes ? Now enjoy it with 3D puzzles, for one more dimension of bugs and the ball not going where it went before even though you edited nothing.  GOTY 2016",
            "review_score": "1"
        }
    ]
}