{
    "app_id": 393240,
    "name": "Sir! I'd Like To Report A Bug!",
    "release_date": "2015-10-19",
    "developer": [
        "Lord Puggington Games"
    ],
    "publisher": [
        "Lord Puggington Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 13,
    "positive_ratings": 15,
    "negative_ratings": 10,
    "price": 1.69,
    "description": "Bust some bugs and save the world with the most average of heroes! Overcome obstacles such as killer cars, lava floors and one seriously ♥♥♥♥♥♥ off sun, tackle the horrors of the daily commute but with more fire and randomness.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/393240/header.jpg?t=1478025013",
    "minimum_requirements": "OS: Windows XP, 7, 8, 10 Processor: 1.6 GHz Memory: 512 MB RAM Graphics: If you're reading this then you're probably good to go DirectX: Version 9.0 Storage: 90 MB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "There are times that tearing into a game just isn’t pleasurable. Times when legitimate criticisms must be leveled at a title for numerous design deficiencies, but no joy can be gained from the walloping. That is the case with Sir! I’d Like To Report A Bug!. Developer and publisher Lord Puggington Games absolutely have their hearts in the right place. They set out to create a simple platformer with an engaging hook and tried very hard to create a real game to be sold at a budget price. Four dollars is absolutely reasonable for a copy of their efforts, but the time investment to play it would be much better spent elsewhere. So, with expectations in check, it is time to lay this title bare.  The premise of Sir! I’d Like To Report A Bug! remains intriguing. A lackadaisical game tester is the first to try a new piece of virtual reality hardware. After his experience with this machine, he finds that video game type bugs begin permeating the real world. Folks taking flight, buildings made from rubber, and an angry sun spitting hot fire are typical bugs that could be encountered, Each stage is either guiding Reggie, the protagonist, to work or from work. At the end of each stage the player is commanded to report the issues that were encountered from a long list of choices. Most options are jokes. Picking the wrong ones only results in being told that the incorrect choice was given. Until all choices are entered, the game will not proceed. This portion is reminiscent of a Highlights for Kids activity.  Explaining this is simply a method of stalling before digging into the real disappointment. The actual stages and platforming. Reggie himself does not have any control issues. On the contrary, his sense of motion and physics mean that if he was placed in stages with a better sense of design, it would work quite well. As it is, the platforming and traversal are hampered by poor visual queues. There are many objects that are obviously intended to be platforms. Too often, though, the challenge lies in figuring out which object is background art and which is meant to act as a means of climbing up and over an obstacle.  These design flaws could be surmountable with a better balance. On its Steam store page, the devs brag that it is hard as nails. There is truth in advertising, but they don’t say why that is. The reason: cheap, annoying deaths. This is a game with simple controls, move and jump. The complexity should come into play with the gimmicks each level should contain. For the most part, though, these gimmicks are purely cosmetic and don’t offer the flow of play. It is not possible to jump on the rubber buildings to gain height and when people “stick” to Reggie, there is no change to the physics. These are missed opportunities.  When actual gameplay changes occur, they tend to be aggravating. Laser bolts appearing from nowhere with no chance to dodge isn’t fun. It is pointlessly infuriating. When the player fails on normal mode, it is back to the beginning to start the trudge through the overlong level with repeated art assets all over again. There is a level where random objects arise and become Reggie-seeking missiles. Trying to dodge these and figure out which piece of background is meant to be used to gain height was my breaking point. It seems as though this game was designed solely to garner rage from Let’s Players, but it does not appear they are biting.  One thing to note is the chiptune soundtrack. While the base tune is not expertly crafted, it does sound like a more competent tune that could be found on an NES cart. Where it becomes noteworthy are in the remixes that occur. Sometimes it sounds as though an onboard sound chip is on the fritz. Sometimes the instrumentation changes, sometimes there’s no instrumentation at all. These tracks did, however, help lend the proper tone that the rest of the game was attempting to reach.  Trying to dictate if Lord Puggington Games tried too hard or not hard enough with its gameplay is a fool’s errand. This doesn’t feel like something that was just slapped together; there is no malice intended in this review. This is a port of a mobile game that came to fruition via crowdfunding; one with a Google Play page that is loaded with accolades. It is at this point where the final piece of evidence must be introduced: the overuse of tired memes. How one can make a comment on the overuse of the “arrow to the knee joke” while unironically using these other tired tropes is a topic for speculation. Will an answer ever be found? Probably not. Ain’t nobody got time for that.",
            "review_score": "-1"
        },
        {
            "review_text": "So hardcore, but fun. :D Play it!",
            "review_score": "1"
        },
        {
            "review_text": "It's a very nice and funny game, if we must find a flaw, maybe the music is a bit too catchy.",
            "review_score": "1"
        }
    ]
}