{
    "app_id": 393410,
    "name": "World of Soccer online",
    "release_date": "2015-08-26",
    "developer": [
        "Johannes Eski"
    ],
    "publisher": [
        "Johannes Eski"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Co-op",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie",
        "Massively Multiplayer",
        "Sports"
    ],
    "tags": [
        "Free to Play",
        "Sports",
        "Massively Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 654,
    "negative_ratings": 436,
    "price": 0.0,
    "description": "World of Soccer online is a multiplayer online football game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/393410/header.jpg?t=1447377471",
    "minimum_requirements": "OS: Windows XP and up Memory: 1 GB RAM Network: Broadband Internet connection Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is by no means the perfect game. There are flaws, there are bugs, I regularly get dropped by the server. There are trolls online, both intentionally trolling and unintentionally (if you don't know what offside is, read up on it  before  playing!) But what it does have going for it is sheer fun factor.  If you remember Sensible Soccer, WoSO is in a similar vein, from the pixel graphics to sharing more than a little in common with Sensible World of Soccer's name. But as the telling difference in the name reveals, WoSO is an online game. You control just one player, with the other players on your team controlled by other humans (yay) or the AI (boo). And it's this multiplayer element that is at the heart of WoS's fun factor. As in real life football, playing as a team is essential; good positioning is worth a lot and a team playing as a unit can still beat a team full of better players who are all playing for themselves. It can be really satisfying when your team puts together a string of neat passes culminating in a goal, or when you've spent 90 minutes defending resolutely only to nick a 1-0 victory in the dying moments on the counter.  Controls are relatively simple; movement is via mouse (run to the cursor a la diablo), gamepad or keyboard (not a good option IMO). I'm using a controller where you have 3 buttons that I'd call 'shoot' 'lob' and 'pass'. The controls are  not  well explained, although there is a tutorial that gives you the basics. Bascially 'lob' is a high ball, 'pass' is a low ball and 'shoot' increases in height with power. Hold down the button to power up. You can also control the height of the ball by either moving the mouse cursor nearer or further from your player, or moving your joystick in a similar fashion. 'lob' performs a slide tackle when defending. Headers are finicky at first, but basically involve either the 'pass' or 'shoot' buttons ('lob' will make you slide instead).  There are no fouls - strategically taking out opponents is part of the game and underlines the arcade feel of the game. Offsides are implemented, so no goal hanging allowed. Other than that there are 3 player models (small/normal/large) you can choose from if you pay for a VIP account. The small players are however vastly overpowered (they are quicker than everyone else) and I personally find it gets boring quickly if one team has several fast players and the other doesn't; you can essentially run the entire length of the pitch with the ball without being caught, which removes any element of tactics from the game. I think there needs to be a better model for financing the servers than one that makes the game less fun (IMO of course) for everyone.  Other downsides include:    No ability to kick players. AFK players can ruin matches by playing everyone onside and making teams unbalanced. The same player may be AFK for over half an hour and isn't kicked.    As with any online game, there are trolls. But most players are very friendly. If you have the bad luck of joining a server full of 13 year olds, best to switch to another server. As per usual, things get better later at night when the kids are in bed.    No real auto-balancing of training matches. While the game assigns new players who join the server to the team with less players, an auto-balancing feature would be nice - at the very least at the start of each match, if not each half. Unbalanced matches are no fun. A lot of players will however change teams to balance things out. A match-making mode is supposedly on the way, which should help in this regard.    A few weird bugs/idiosyncracies lead to WTF moments every now and then. Nothing to ruin the game though.    The league and team systems don't work. The leagues are full of dead teams and playing matches between teams is a pain, especially as it's uncommon for 6 players in the same team to be online at the same time. I much prefer 6v6 (the maximum), so I spend almost all my time playing training matches. I find 1v1 and 2v2 matches fun for a few minutes, but not for a whole match.    There are a number of exploits in the game. Some are obvious exploits, some are at the very least gamey. You don't have to take advantage of them of course.    The dev does respond to requests and suggestions, and there have been several changes made to the game since release - many good, some bad, and some neither here nor there. However, active development and a willingness to engage with players is always a good thing.  Seeing as WoSO is free, there's no reason not to try it our if you like football games - especially if you were a Sensi fan back in the day. This isn't a game for the people who buy FIFA or PES for the skill moves and motion capture graphics. WoSO is much more tactical - yet also more arcadey- than those 2, by virtue of its simple nature. If you do try it out, definitely play the tutorial and practice knocking the ball about a bit. Play a couple of matches on an empty server both with and without bots to practice passing and shooting. It only takes a short while to master the basic controls. It'll take you a long time to master the game though.",
            "review_score": "1"
        },
        {
            "review_text": "Game with huge potential, spiritual sucessor to Netsoccer teh best game evur",
            "review_score": "1"
        },
        {
            "review_text": "World of Soccer online is a pretty easy game to get the hang of and is a fun time killer. While there is some major lag at points, it's not that bad. Overall fun game and worth the free price tag. By the way, the only button I know of that does anything besides move and kick is 'a' (which is a slide tackle)",
            "review_score": "1"
        },
        {
            "review_text": "TS GAME IS SO FUN YOU NEED TO PLAY TS GAME IT GETS MY 8/10 AN NOW AM GOING TO PLAY TS GAME",
            "review_score": "1"
        },
        {
            "review_text": "the whole idea of controlling 1 player is great but it needs a lot of improvement. servers are laggy atm. need more features. the menu needs improvement. there are no fouls. its like an early access game not a finished one.  i will give it a positive review only cause i like the concept a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Best game whole world -Free -No pay 2 win -U can make ur name foreskin",
            "review_score": "1"
        },
        {
            "review_text": "Best PNG Simulator 2015... Pls add more PNGs and less collisions 10/10  Best Paint Ever - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Nooooooooo, got me becouse of my love for SWOS. It isn't near that. Lags, ppl quitting, controls.... Good things?. Scored one goal :D. Pressing ESC anywhere once makes u quit match, twice it closes game realy fast...",
            "review_score": "-1"
        },
        {
            "review_text": "This is the perfect example of a terrible game. A lot of lag, no tutorial making you have no idea what the heck you're supposed to do or how everything works, poorly designed, bad controlls and generall gameplay. 0/10 worst game released on steam that I have yet to try. I hope the devs make this game at least playable. Also sorry for negativity",
            "review_score": "-1"
        },
        {
            "review_text": "Still better than PES",
            "review_score": "1"
        },
        {
            "review_text": "Lacks interface controls, game gets boring midgame.",
            "review_score": "-1"
        },
        {
            "review_text": "Waiting to connect to a server for eight minutes gets a little boring, you know?",
            "review_score": "-1"
        },
        {
            "review_text": "Simplicity is the ultimate sophistication",
            "review_score": "1"
        },
        {
            "review_text": "It's like Sensible Soccer for small children with special needs. Avoid!",
            "review_score": "-1"
        },
        {
            "review_text": "its terrible 11/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, but there could be more servers. ",
            "review_score": "-1"
        },
        {
            "review_text": "needs more hats",
            "review_score": "-1"
        },
        {
            "review_text": "Servers are down. Was fun while it lasted. Never gonna get to play again :(",
            "review_score": "1"
        },
        {
            "review_text": "EDIT &gt; After revisiting this game i have to say that the dev fixed all the major problems this game had on launch . Controls can be changed , the tutorial is nice and best of all there is little to no lag . So yeah , played a few games and i have to say , this game is pretty enjoyable and you should definatelly check it out !",
            "review_score": "1"
        },
        {
            "review_text": "It looks like as a fun game, perfect for a break or when you're bored, but at the moment it's impossible to play, servers keep lagging even with very low ping.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awful, there is no positional awareness from anyone anf its a complete cluster of a game that isnt worth the price tag, which is free. Youd'd litterally have to pay me to play this for more time than I already have,",
            "review_score": "-1"
        },
        {
            "review_text": "Thats awsome but some lags in the game ı rate 10/10 (epic fifa my player simulator)",
            "review_score": "1"
        },
        {
            "review_text": "the ♥♥♥♥♥♥ bots always pass it to other team dont bother playing this ♥♥♥♥♥♥ trash game",
            "review_score": "-1"
        },
        {
            "review_text": "All the good reviews are mindless fanboys, 'Better than FIFA 16' yeah right? Even though I don't like FIFA games I would think a Triple A shiny soccer game made by a major company is much better than this 5 minutes of fun tiny soccer game with horrible servers. I give this game a 4/10 because it kept me entertained for a couple minutes. Also the UI looks and acts like a ♥♥♥♥ing 7 yr old programmed it.",
            "review_score": "-1"
        },
        {
            "review_text": "cool",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible, laggy as hell even with a ping of (22), no one passes the ball, everybody just follows the ball sliding sliding sliding which makes the game boring and painful to watch. I know it's free but why even allow this on steam?",
            "review_score": "-1"
        },
        {
            "review_text": "Quite possibly the best game I have ever played. Simple yet complex, intuitive but deep. If you've ever played Dark Souls you'll recognize a lot of the mechanics at play. Definitely Bethesdas best game yet   9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "foot fairy/10",
            "review_score": "1"
        },
        {
            "review_text": "my favorite thing about the game is connecting to load balance server                 Because that is the only thing I can do",
            "review_score": "-1"
        },
        {
            "review_text": "Good Game, fun to play x)",
            "review_score": "1"
        },
        {
            "review_text": "The undownload button worked. 20/10",
            "review_score": "-1"
        },
        {
            "review_text": "A great game, very fun to play with firnds or just randoms. I havent encountered much of lag issues at all unlike most people. Highly recomend this for someone who wants to pass time or can't afford/ run much.  It's free and takes up little space.. why not give it a try?",
            "review_score": "1"
        },
        {
            "review_text": "how to play?? please teach me",
            "review_score": "1"
        },
        {
            "review_text": "It is very soccer",
            "review_score": "1"
        },
        {
            "review_text": "Best game You ever get for free! Played it only 10 minutes and I am in love and addicted at the same time. It is wired the feelings you can ave towards a game. Exspecially if it is football! :D",
            "review_score": "1"
        },
        {
            "review_text": "holy ♥♥♥♥, a much more enjoyable experience then league of legends and sex combined",
            "review_score": "1"
        },
        {
            "review_text": "This game is like my ♥♥♥♥♥... Hard. But its fun.",
            "review_score": "1"
        },
        {
            "review_text": "BLUF: Take it for what it is, a simple, easy to play, and fun game.  Dislikes: Controls (A little tricky using timing and mouse and keyboard controls, but not bad) Interface (Not the best UI there is, again though, not bad considering...) Conclusion (That's about it, and they aren't even bad)  Likes: Servers (Easy to connect and disconnect to games and play as long as you wish) NPC's (There's always someone to play against, even if players aren't on, there's a goalie) Simplicity (It's pretty simple to use, even though I don't like all the controls)  Note: I can't believe I have over 7 hours on this game... Apparently it's addicting too.  *Edited* Added information, reorganized review",
            "review_score": "1"
        },
        {
            "review_text": "Free ,Multiplayer and Funny . And Better Than Fifa 16 !",
            "review_score": "1"
        },
        {
            "review_text": "It held such promise.",
            "review_score": "1"
        },
        {
            "review_text": "Its A good way to test the unistall button.",
            "review_score": "-1"
        },
        {
            "review_text": "my favorite thing about the game is connecting to load balance server                 Because that is the only thing I can do",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS SUCH A BIG PILE OF POO KING KONG COULDN'T FIT IT IN HIS HAND!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I really don't get why this game gets so much hate, I honestly think that this game is pretty fun plus it onlt takes 97 MB?! Even a person with the crappiest laptop can download and play this game.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty fun game but it does take abit of time to master the controls.",
            "review_score": "1"
        },
        {
            "review_text": "It's been more than 10 minutes and the game is still connecting to load balance server.",
            "review_score": "-1"
        },
        {
            "review_text": "Well I was looking for a free game to pass time soo after 10 minutes of looking i found this.  The servers wont good and have alot of potential HOWEVER gameplay is slow and lifeless and its just dreadfull to play with people you dont know because its rare they pass the ball and when they do its because they hit the wrong key.  The game itself has a very SMALL window to improve and the devs have kinda stopped updating with anything we actaully want to so to sum up.  Slow and lifeless Dreadfull Controlls Bad Co-op  Devs are dead and have nothing more to contribute towards developement of the game. Shortly after it becomes a waste of time.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Good for a quick session.... unless you want to create a team.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not that good, but it doesn't have any problems. 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Meh, i dont recomend it, the controls are hard to get into.",
            "review_score": "-1"
        },
        {
            "review_text": "This game used to be awesome, a bit buggy but still lots of fun, now you cant even get on to the servers. That a bunch of bull. I dont have annything more to say about the game. Its not fun anymore. So... Dont download",
            "review_score": "-1"
        }
    ]
}