{
    "app_id": 393530,
    "name": "Insanity Clicker",
    "release_date": "2016-06-07",
    "developer": [
        "PlayFlock"
    ],
    "publisher": [
        "PlayFlock"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Clicker",
        "Horror"
    ],
    "achievements": 102,
    "positive_ratings": 1475,
    "negative_ratings": 751,
    "price": 0.0,
    "description": "Been looking for the thrill? Then you've come to the right place! Insanity Clicker is a time-killer game full of horror and fear that will make you tremble in a couple of minutes!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/393530/header.jpg?t=1540910797",
    "minimum_requirements": "OS: Microsoft® Windows Server 2008, Windows XP, Windows 7, or Windows 8 Classic Processor: 2.33GHz or faster x86-compatible processor, or Intel Atom™ 1.6GHz or faster processor for netbook class devices Memory: 512 MB RAM Graphics: Intel HD graphics 4000 or above Storage: 200 MB available space Sound Card: Integrated sound card",
    "recommended_requirements": "OS: Microsoft® Windows Server 2008, Windows XP, Windows 7, or Windows 8 Classic Processor: Intel i3 or faster processor for netbook class devices or above Memory: 1024 MB RAM Graphics: Intel HD graphics 4000 or above Storage: 500 MB available space Sound Card: Integrated sound card",
    "reviews": [
        {
            "review_text": "I see it's like a ripoff of Clicker heroes, but there are some things that i think are cool -Dark atmosphere, not fully terror, but can scare a few people and i like it -The timer for the boss is a little bar that follows his health, i find this interesting -You can customise your character, by the time i write this i still haven't got a sinlge equipment, but i find this a good idea too -The art is truly amazing, congrats specially for the monsters designs  Overall i give this a solid 6/10, might be a good game somewhere in the future with a few updates here and there",
            "review_score": "1"
        },
        {
            "review_text": "Fun way to lose your time. Really bad for your hands :P",
            "review_score": "1"
        },
        {
            "review_text": "i like the art tho the music is boring -_-",
            "review_score": "1"
        },
        {
            "review_text": "One of or is the best clicker-based game I've ever played. However, the server's or server should stay on when you're on it and if your WiFi goes bonkers because I keep getting 'socket error' or some sort of crash.",
            "review_score": "1"
        },
        {
            "review_text": "I played it for an hour for free. I have many games unplayed that I've paid for.",
            "review_score": "1"
        },
        {
            "review_text": "Well for all of you complaining about this game... your stupid. this is a clicker game and just like any free game or clicker you need to pay for some perks... now the pricing maybe stupid for such a game as this but it is no big deal the point of this is to make you spend mass amounts of time playing have some fun get frustrated with it and blow money on it. or if your like me or just slightly know how to cheet in a game you can break it and have lvl 100000 on everything in 0.5 of an hour.",
            "review_score": "1"
        },
        {
            "review_text": "Clicker Heroes clone You'd have to be insane to pay the microtransactions  Sexy succubi everywhere! Will take forever to 100% without spending $$$   I've spent $10 so far  ",
            "review_score": "1"
        },
        {
            "review_text": "They see me cickin clickin clickin :3",
            "review_score": "1"
        },
        {
            "review_text": "it is really funny game :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty addictive to play but still kinda boring after a bit.  Still I say play it if you like horror.",
            "review_score": "1"
        },
        {
            "review_text": "Meh, it's a good time waster. I knew it was merely something to pass the hours on when I got it, so my expectations were met. I would recommend it if you're looking for something with colorful artwork to kill some time on. It has more variety than cookie clicker and it suited my needs. 3/5",
            "review_score": "1"
        },
        {
            "review_text": "Meh, it's a good time waster. I knew it was merely something to pass the hours on when I got it, so my expectations were met. I would recommend it if you're looking for something with colorful artwork to kill some time on. It has more variety than cookie clicker and it suited my needs. 3/5",
            "review_score": "1"
        },
        {
            "review_text": "Meh, it's a good time waster. I knew it was merely something to pass the hours on when I got it, so my expectations were met. I would recommend it if you're looking for something with colorful artwork to kill some time on. It has more variety than cookie clicker and it suited my needs. 3/5",
            "review_score": "1"
        },
        {
            "review_text": "I personally think its a great spin-off of Clicker Heroes. Same thing but scarier, You Kill monsters, Buy 'Minions', get acheivments, And reapeat! And go through 'Amnesia'.  I love this game Btw its a great time-waster!  Also LOL Heres something funny that happened:  I wasint on Insanity clicker for so long, And when i started it up, i got like 20 acheivements, Like: Go through amnesia 5-20 times &gt;I never even went through amnesia lol&lt; And Collect 10Thou Gems &gt;Dont have Any gems LOL&lt;",
            "review_score": "1"
        },
        {
            "review_text": "gory as hell a good fun bloody time all around a must play",
            "review_score": "1"
        },
        {
            "review_text": "I once had a life... but then the Insanity attacked... and now I have over 350 hours on an extremely pointless game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun casual clicker game recommend to kill time. ",
            "review_score": "1"
        },
        {
            "review_text": "amazing something else for a change thow gives one hands a workout haha",
            "review_score": "1"
        },
        {
            "review_text": "6/10 For i Clicker Game , You should try it but it gets boring faster than many other Idling/Clicking game , If u are looking for and idling game i recomend you Adventure Capitalist",
            "review_score": "1"
        },
        {
            "review_text": "amazing something else for a change thow gives one hands a workout haha",
            "review_score": "1"
        },
        {
            "review_text": "it's fun time killer and it's free to play so can't complain ~ free achievments XD if only the spider minion wasn't such a huge leap  If you like clicker games and/or something mind numbing to pass the time I'd recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Click Click Click",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Note: As this is a Free to Play title, this review should be taken with a grain or two of salt. I've only played up to level 9. Note 2: I've also played very little of this game, so don't take this review to heart too seriously. Insanity Clicker is essentially a Reskinned Clicker Heroes.  You click on the monster to kill it, and you only progress to the next level when ten enemies are killed on the most recent level, or you've killed the boss on levels of multiples of 5. As far as I know, progression is impossible whilst offline, as is a usual weakness with this mechanic.  As you kill monsters, you gain currency. In others, it's usualy Gold, here it's Teeth. Functions identically however, as you purchase pets, which are your main source of increasing your Damage until Ascensions, at which point you'll gain a special second currency, likely named Spirits. These are most likely used to purchase upgrades that are effective across each run, inbetween ascensions.  As you upgrade your pets, you can unlock spells. As far as I have seen, there's the typical arrangement of spells. Click Damage boosts, Drop Increases, Gold per click boosts, spell power increase, spell cooldown decrease, essentially every skill in Clicker Heroes is here.  There's an auto-progress mode, a very negligible array of options to only turn on/off music, sounds, or any other audio in the game, turn on scientific notation numbers, and other graphical on/off modes. There's also a button for Fullscreen.  I'm personally/currently unsure of what Illnesses are, but I imagine they're not too different from Clicker Heroes' Ancients, essentially requiring Ascension Currency to purchase/upgrade upgradeable objects which give scalable, and powerful boosts, some of which may be infinitely upgradeable or not.  There is also an Idle mode, but as far as I know, it only serves to collect teeth for you.  As far as the above, mostly all of them are basically in Clicker Heroes, the only one that isn't, is the Idle Mode, due to the effect always being on.  The graphics look rather nice however, being highly detailed, with each character looking nice and creepy if not horrifying, with each art asset looking like it fits in with one another very nicely. Haven't listened to the music, but I imagine it's fairly decent.  You do have the option of dressing your character, choosing between male or female, and being able to dress them with weapons, shirts, pants, underwear, shoes, socks, pets etc. Only... as far as I know, there's absolutely nothing to do that with yet.  Altogether though, I can't really recommend the game. It's too mechanically similar to Clicker Heroes to really justify it's own existence on the same platform as it.  That being said... if you want a game that's almost mechanically identical to Clicker Heroes, this will be in your area. It's personally not a game I can enjoy too much.",
            "review_score": "1"
        },
        {
            "review_text": "thought this was a great game but after a day everytime i go on it it just says fatal error occured, somebody please help me",
            "review_score": "1"
        },
        {
            "review_text": "Very slow progressing clicker. Good art and concept. Pretty oki doki.",
            "review_score": "1"
        },
        {
            "review_text": "Never played clicker game before this now im fanatical About clicker games this was the first clicker game i ever played and now i play them all i like Insanity Clicker out of the all!",
            "review_score": "1"
        },
        {
            "review_text": "It's a clone of Clicker Heroes like all those MMOs 5 years ago were clones of WoW. If you like Clicker Heroes and want to try something new, this is your game. If you do not like Clicker Heroes then move along because this is not for you.",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game literal mimic the Clicker Heroes. But the amount of time I'm spending with this is truly insane... If you like the clicker game genre, I would say don't let the negative reviews keep you from giving this game a go. It's free! ",
            "review_score": "1"
        },
        {
            "review_text": "I was able to play once but I didn't and it keeps on saying 'Ftal error occured' and only gives me option to restart the game, but the craxy thing is, is that it doesn't do anything when I press restart. I would give this game a 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Don't waste your time to buy it Because is free and is waste your time You can forget to eat or drink!!! Or take your dog outside Or forget to go to school or Job :O  So what am I doing right now?  Hmm Hmm Hmm...  Click, Click, Click, ClickClickClickClickClickClickClickClickClickClick",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER!!!!  Love it so addicting and really really good for a free game really recommend this game to play",
            "review_score": "1"
        },
        {
            "review_text": "really good game: you got sexy girls you monsters you have everything to make it a good video game",
            "review_score": "1"
        },
        {
            "review_text": "The smorgasbord of clicker games continues at Steam and this one is all-u-can-eat.",
            "review_score": "1"
        },
        {
            "review_text": "I've clicked so much, that I still do damage when I think I've stopped clicking. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was really excited when this came up on my discovery queue, and despite seeing a mixed review status, I downloaded the game. I like that there is a more horror theme version of clicker heroes and I do not mind the microtransactions, but the big flaw of this game is that it cannot be played completely offline. I have limited internet data per month plan that has to be shared with four other people, and I am forced to play most of my steam games offline because of how expensive data overages are. I will continue to play this game online, when I can, but if the devs are as active with the steam community as some of the other comments suggest, they should really allow for offline play. I would recommend it as it fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Do not get this game it takes over your life!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's free, it took 1 min 30 sec to download, and it's amusing.  There is really no point in giving this game a negative review unless you put are stupid enough to put real $ into this game.  (Also, a sexy monster occasionally pops up).",
            "review_score": "1"
        },
        {
            "review_text": "fights crazy monsters with a kitchen knife and wearing only an underwear like a boss...",
            "review_score": "1"
        },
        {
            "review_text": "for pete sake its a clicker game if you dont like clicker games THEN DONT PLAY THEM AND GET MAD ITS A CLICKER GAME its made well so who cares small kinks here and there with acheevs and such but seriously its not bad just another clicker game dont get mad its fun if you like them",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and you can pass the time playing this game without even noticing, an awesome idle game, really nice concept this horror theme on the other hand a thing that bugs me is the currency collection (the teeth) its a bit annoying when you dont gain them immediatly but they fall on the floor and it takes like 2 seconds to collect them if you dont put your mouse on them, while clicking its annoying to collect the teeth at the same time, I think you should add an option in the option box 'Collect teeth instantly' and you can mark V, getting currency in idle games is the main thing, and when its taking a long time (2 seconds is pretty long) its not fun. TL;DR: this game is cool with a really nice concept, and I think you should change the currency collection.  Good luck in the future :)  hope your game will keep rocking.",
            "review_score": "1"
        },
        {
            "review_text": "I love the game became addicted after a few minutes",
            "review_score": "1"
        },
        {
            "review_text": "Very Repetitive Good If Your Looking for a little time waster game",
            "review_score": "1"
        },
        {
            "review_text": "Honestly never thought i would be one for sitting here watching a game, but i find the art style and backgrounds, combined with the creepy music and Screams, make for a mesmerizing few hours. i try not to click in too often, i kinda just end up sitting here... hahaha  it is however very much a clicker, there isnt a huge lot to do, but once you get far in, start to do some neat stuff. so ya, i love it XD",
            "review_score": "1"
        },
        {
            "review_text": "Classic clicker game with a horror theme, much fun. Now I just need to learn how to make a necklace with all those teeth.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely addicting game. Great casual play choice if you like clickers. There's quite some bugs to fix but overall it works just fine. Really loved the theme used on this clicker, there's some really nice artworks on the creatures and I'm hopping to see some new ones now that im at lvl 1400.",
            "review_score": "1"
        },
        {
            "review_text": "worthless for free as it forces you to spend money and i feel sorry for all who have already. They wasted their money since last update devs destroyed any fun in amnesia!!",
            "review_score": "-1"
        },
        {
            "review_text": "Achievements farming, that's all. Is quite a boring game, nothing fancy. If you want to get more achievements to show up your stats, get it and farm it, other than that, doesn't worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is an excellent time killer but glitches hardcore after about level 700 or so, the game cannot seem to keep track of teeth / currency after that point for some reason, still fun but end game is broken atm. Since there is 2800 levels and the game is bugging hardcore at 700 that is 1/4 of the game that works and I will not recommend a game when only a quarter of it works properly.  As of 10/11/2016 the game will no longer start and is stuck with 0% initilization, game is completely broken as of now and is unplayable.  0/10 any other clicker game is better than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Not much to say honestly, it's your basic clicker game but with a horror feel to it. You collect teeth, and click spam the hell out of the game to stab at them with a knife. Even if you leave the game you get the 'teeth' the creatures drop to upgrade your minions more. If you enjoy clicker games, and don't mind this one being like all the others go crazy.",
            "review_score": "-1"
        },
        {
            "review_text": "Clicker Heroes: Halloween Edition  The art is excellent... other than that, it is a generic clicker game. I'm staying for the aesthetic though and am awaiting gameplay updates.  Edit: The art may be stolen... wow. A lot of it seems to be stolen images that were photoshopped over.  Getting to the first ascension takes an absurd amount of time.  Clicker Heroes is better.  Edit: Just came across the mannequin spider from Silent Hill: Revelations. Well, they already have Pyramid Head around. Plenty of stolen concepts. Lot of art has absolutely been traced over originals.  Enemy animation is really lazy... they swing back'n'forth with a tiny bit of zoom. Then motion blur occurs as if they're attacking you - which doesn't make sense since you don't have an HP bar of your own.  I want to ascend already...  Edit: Mother of God. The game is currently frozen because I slammed all my abilities on and clicked to the high heavens. Critical hits make the entire game shake - its like a Banjo Kazooie dance along with all the damn boxes going ooga-booga. I thought I turned effects like that off, but no - them devs ain't right. Oh, and because the game likes to do that bull 'Are you sure you want to exit?', you can't just close it if its frozen. You have to pull out Task Manager.  Unity please...",
            "review_score": "-1"
        },
        {
            "review_text": "with the last update the game progress becomes so much harder that it will be near impossible to catch up to older players without buying gems.  Basiscly your sin production will be handicapped from the start.",
            "review_score": "-1"
        },
        {
            "review_text": "This 'game' is basically just a copy of Clicker Heroes with updated art style. Costs and skills are directly ripped off from Clicker Heroes. I don't mind a bit of inspiration but this is just shoddy.",
            "review_score": "-1"
        },
        {
            "review_text": "pros: -good looking -simle to learn ofc ;D -descent gore teeth instead of coins gives an extra effect  cons: -cluttered -slugish -feels like a straight rip off with reskin from clicker hereos  I would recommend to those who: Love gore and doesnt mind the clutter when clicking from the blood stains.  conclusion: It is a fun simple game if you like gory clicker, however i'm not able to recommend it because it feels a bit to cluttered for my liking when it comes to clickers, just a tiny bit to much detail in the menu art style for the monsters are AMAZING, if you want a better game in my eyes i would recommend clicker heroes instead where it have come alot further in development, there is clans you can join you can ascend for a faster run later on and later on transend which can speed it up even more.  NOW i haven't played alot of it and i dont know if there is clans and ascension like things, as i've seen the menus doesnt show anywhere where those tabs for clan and such could appear.  To make this game better: You could make a few less details in the menu and such would be good in my eyes. If there is clans make room so you can see there is clans to. add more gore such as bodies being cut in half and falling over whent they are killed just for extra gore if thats what you are aiming for in this game.  last but not least i must say good luck to the developers to make this game better and add more feutures!",
            "review_score": "-1"
        },
        {
            "review_text": "Insanity Clicker is horror themed idle clicker game. The games description on the store page describes it as a “terrifying survival simulator” when in reality its just a clone of clicker heroes with a horror themed UI. The game is nothing special and there is not a lot to talk about except for that unlike in other idle games, there is no real enthusiasm/joy/entertainment about progressing in this game. After you take out the first 50 or so monsters and the first boss your “pets”, as they are called in the game, will be strong enough to apply a decent amount of damage to the monsters without any need for your input. You dont feel like you clicking provides much of a benefit from then on out and this is especially true for the later levels where you pets will hammer out 500 million damage per second where your clicking may only result in 50 thousand damage per click.  I was a big fan of the original Cookie Clicker game and other idle games such as Bit Coin Billionaire, but with his game i just felt bored playing it. You can just run it in background and farm while you do other things and still progress in the game. In fact you dont even have to have this game running in the background as it has a very high currency limit when the game isnt running. I stopped played this at about 1:30 in the morning and when i woke up at 10 the following day and started the game i got a huge 66 million currency bonus which gives you a huge advantage over the game which make it too easy to progress.   Pros/Things I liked:  - The monster sprites looked cool  - The ambition of the game’s description on steam  Cons/Things i didn’t like:  - Everything else in the game   Score Card  Rating: 2/10  Recommended for: People who like to watch paint dry but dont have the money to buy paint",
            "review_score": "-1"
        },
        {
            "review_text": "Nice artwork. Jumpy graphics try to simulate jumpscares. Mostly annoying sound, inconsistent effects, (female screams coming from dead masculine monsters). The game didn't seem to try to explain itself at all. I ended up letting it fight on auto and messaged friends instead.   I rate this one click/10. Would delete again.",
            "review_score": "-1"
        },
        {
            "review_text": "At the moment this game has potential if only for the sheer volume of art assets clearly already put into the game. As far as an idle clicker goes it's not bad, but there are a few huge flaws at the moment that bother me.  First of all, the default font. While the super grungy, edgy font choice looks fine in larger titles and buttons, on smaller resolutions (such as in a window) it becomes illegible. I felt like I spent far too long trying to decipher monster names, minion abilities, etc before finally just giving up since it wasn't worth the effort.  Secondly, while I realize this is quite a new game (and an idle clicker at that), it would be helpful to have a FAQ built into the game. Some features (such as the character screen, equipment, and illnesses) are pretty esoteric without context.  Overall it's a decent achievement farming game, but those few nitpicks detract from what would be an otherwise pretty standard clicker experience.",
            "review_score": "-1"
        },
        {
            "review_text": "It was amazing until they added FORCED PUBLIC CHAT",
            "review_score": "-1"
        },
        {
            "review_text": "New collection pack makes this game pay to win, is it wasnt already crap to start with",
            "review_score": "-1"
        },
        {
            "review_text": "some ripped off art work, get to level 130 and it becomes impossible to progress. has online chat for some reason that isnt nessisary. becareful what you click and it could reset your entiire progress",
            "review_score": "-1"
        },
        {
            "review_text": "Just why? Why would you make my curiosity peak just to be disappointed? Why?  As a wise man once said; 'It's a trap!' -Admiral Ackbar",
            "review_score": "-1"
        },
        {
            "review_text": "Found this to be a poor variant on  Clicker Heroes   The graphics &amp; sound are more adult, but they actually come across as an edgy teen trying too hard. A lot of the female models are sexed up, reinforcing the edgy teen flavour.  Many better idle games our there and you can either browse for horror art, porn or a combination of the two while it is in the background.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is like facebook game insanity, the game is abit changed from facebook in there you have to click on enemis and kill them and you get teeth, its is not worth it to play just waist of time, if you like this this 2d ckliker games so play it if you want.",
            "review_score": "-1"
        },
        {
            "review_text": "It's an interesting take on the clicker genre, but it's so boring. Unlike most clicker games that suck you in either with story or engaging features, this game has none of that. Good try, but better luck next time.",
            "review_score": "-1"
        },
        {
            "review_text": "Completely a copy of Clicker Heroes but reskined and less fun. This game really has nothing going for it because it's a Complete ripoff, with barely any changes, and it's a lie becuase in the description it says its thrilling scary, scary , survival simulator, and will keep you in suspense throughout the game... Spoiler it won't do any of those things I just listed from the description.Also It says in the description ''You're traped in a place with banging walls all around yada, yada, yada, Then you think am I strong enough?''F**** no thats why you hire other monsters to help you kill still images of other monsters.Basically, Just play Clicker Heroes, Atleast that games fun. Edit: Also all the positive reviews really they're talking about Clicker Heroes unless they say ''Insanity clicker has great art''Which it does but that one of the only very few things going for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Good Game.... but it's wasting time :(  Clicker Heroes is better",
            "review_score": "-1"
        },
        {
            "review_text": "I just..................okay..................... I tried to like this game but.................",
            "review_score": "-1"
        },
        {
            "review_text": "Pay 2 Win cus it takes no skill to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your time on this. I'm pretty sure you played the other clickers before this one on steam. It doesn't bring anything new. Even if you decide to do it for the achievements.   I know what the game does, it gives you that false feeling of progression. But this feeling is fake! There is no progession, it is the same thing over and over again. There is no end, there is no pvp where you can test your op clicker skills. There are no awesome naked people waiting for you at the end. Just... mindless clicking.. clicking.. and more clicking.  Find something else.   ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a bloody terrible game...... but i play it anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "No explaination at all abtou what 'amnsia' is untill you use it and it resets the whole game. I immediatly quit.",
            "review_score": "-1"
        },
        {
            "review_text": "Linken Park and Evansance called, they said they want their edge back.",
            "review_score": "-1"
        },
        {
            "review_text": "Who in there right mind plays these type of games to ware down there mouse buttons??? completely pointless and very boring, oh and you can't lose. or die... whats the ilnesses tab for again??? and you can't buy any new weps. clothes ect.. or I havn't found out how to... this game is completely depended on farming minions and then sitting back and doing nothing  Games like these cookie clicker games should come mandatory with a auto clicker tool  0/10 +10 for GS auto clicker           YouTube™ Video:  Insanity Clicker, Steam Releases, Gameplay, GS auto Clicker.&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "I tried this free game. Maybe the horror art interested me, as it's kinda unique. -Half the art is good, the other half is just cringe worthy (ish, it's not like I tallied them). Didn't start up with the music, so plus there. Left from the   gore   and   gruesomeness   of it. Easy way to get achievements though.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are satanic this game is for you!",
            "review_score": "-1"
        },
        {
            "review_text": "If you are satanic this game is for you!",
            "review_score": "-1"
        }
    ]
}