{
    "app_id": 393660,
    "name": "Streamline",
    "release_date": "2015-09-02",
    "developer": [
        "Frostcloud Studios"
    ],
    "publisher": [
        "Frostcloud Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Strategy",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 35,
    "negative_ratings": 23,
    "price": 7.99,
    "description": "Streamline combines traditional platforming with a fresh take on physics based survival. Your goal is simple; stay alive for as long as possible in a world literally falling apart.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/393660/header.jpg?t=1447377489",
    "minimum_requirements": "OS: Windows 7 Processor: Intel® Core™ 2 Duo E6600 Memory: 2 GB RAM Graphics: Video card must be 256 MB or more and should be a DirectX 9-compatible. Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's basically a student project / experiment. A score-based evasion platformer. Blocks fall and knock the other blocks out from under your feet, and you have to relocate and move around and have a power that can reconstruct the broken blocks. If you've played the game 'Don't Break the Ice' it's very similar in concept to that. You basically just run around and avoid falling off the platform. Despite its simplicity, the main song (only song??) that plays is a nice chiptuney track, and the graphics themselves look cool in a very simplistic way. I got the game uber cheap during a Steam sale, and would recommend waiting for the same if you're interested at all. It's very bare bones.",
            "review_score": "1"
        },
        {
            "review_text": "This game has potential, especially if some sort of speed run is implimented, or enemies or something that just mixes up the gameplay. By the way, it's super easy to get a high score, simply go on builder, place one block and start.",
            "review_score": "1"
        },
        {
            "review_text": "A simple physics demo with an ear-grating soundtrack, nothing more. Pretty to look at for a few minutes, nothing more to it.",
            "review_score": "-1"
        }
    ]
}