{
    "app_id": 394030,
    "name": "Trigonarium",
    "release_date": "2015-08-31",
    "developer": [
        "Kimmo Lahtinen"
    ],
    "publisher": [
        "Kimmo Lahtinen"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Shoot 'Em Up"
    ],
    "achievements": 29,
    "positive_ratings": 19,
    "negative_ratings": 0,
    "price": 3.99,
    "description": "Trigonarium is a hardcore twin-stick shooter for fans of challenging arcade gaming. Fight your way through multitudes of enemy formations in constantly shifting battle arenas to face the colossal level bosses.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394030/header.jpg?t=1523508461",
    "minimum_requirements": "OS: Windows Vista or newer Processor: 1+ Ghz, dual-core processor Memory: 512 MB RAM Graphics: OpenGL 2.1+ DirectX: Version 9.0c Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I don't write reviews but the value + playability + yeehaw! factor of this game made me do it. I want to be helpful so I will keep this short and focused.  Asteroids for grownups on LSD may represent the controls, the purpose, and the environment. Only one other metaphor is missing but I couldn't remember any games that did it. The maps you play on run a pre-programmed series of changes that alternately confound and isolate. Big open map starts and you are spinning and dodging to avoid enemies as they home in on you, then a warning sequence begins and you have to figure out where you think you should be. A level transformation won't kill you but it could leave you in a wholly isolated -tiny tiny- box of sadness for a few seconds. And while you are there, your new mini slice of the whole map is still spawning enemies in a 3' x 3' anxiety pool. When it happend to me I thought I might have found the fatal flaw in the design concept, then my prison cell burped homing death triangles at me and I just spun, fired, and laughed.  I like to shop on Steam for the 0.01 - 5.99 range of games looking for gems. This game, for the number of game modes (and each of the game modes has options for how you play that mode) and the pucker factor, is a gem.   I think I paid 2.99 for this title and I was satisfied in the first few minutes I played it.  Have fun--",
            "review_score": "1"
        }
    ]
}