{
    "app_id": 394130,
    "name": "Water Bears VR",
    "release_date": "2016-02-01",
    "developer": [
        "Schell Games"
    ],
    "publisher": [
        "Schell Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "VR Support"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "VR"
    ],
    "achievements": 12,
    "positive_ratings": 131,
    "negative_ratings": 9,
    "price": 6.99,
    "description": "Requires HTC Vive to play. Free trapped water bears by rerouting, remixing and redirecting water flows in a frolicking 3D environment! Water Bears VR is the next evolution of Water Bears, winner of the 2015 Serious Play Awards “Best in Show” and the 2015 CTR “Editor’s Choice for Excellence in Design.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394130/header.jpg?t=1510934326",
    "minimum_requirements": "Betriebssystem: Windows 7 SP1 Prozessor: Intel Core i5-2500K @ 3.3 GHz or AMD FX-8350 @ 4.0 GHz Arbeitsspeicher: 4 GB RAM Grafik: NVIDIA GeForce GTX 970 or similar Speicherplatz: 500 MB verfügbarer Speicherplatz Zusätzliche Anmerkungen: Requires HTC Vive headset and controllers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "So I've actually played this on my HTC Vive and can confirm that it's charming and delightful in every way. It's one of the most polished real games for the Vive at this time. While it won't resonate with the typical Steam user, your girlfriends, wives, and moms will enjoy this game. Makes for a great soft friendly intro to VR.",
            "review_score": "1"
        },
        {
            "review_text": "A creative puzzle game utilizing the 3d space that VR provides. Good for both kids and adults (including four packs of more challenging levels) Also the Tardigrades (water bears) are very cute!",
            "review_score": "1"
        },
        {
            "review_text": "  Great/ fun little game if you have a vr!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun puzzle game that is well worth the price. The challenge packs provide a good challenge. The water bears are cute. This is one of the most polished games for VR right now. I highly recommend getting this game if you enjoy puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "  Somehow I ended up with this in my libary free prior to the Vive being launched and never got around to playing it. I just tried it for the first time and it's great. The visuals and sound are nice (well suited to the gameplay), the game itself is just a simple but fun puzzle game. That said, it works really well in VR (at least on the Vive...though maybe the same for the Rift if you have controllers).   For the price it's a good buy and considering it was made during the development stages of the Vive, it holds up really well. Hope we see more games this polished.    ",
            "review_score": "1"
        },
        {
            "review_text": "Very nice casual game. Graphics and control scheme are very well done. This is a great game to introduce the casual gamer to VR.",
            "review_score": "1"
        },
        {
            "review_text": "This game is how VR needs to be done. Schell productions once again prove that they really understand how to make VR experiences feel unique and immersive. Using the Vive with this things opens up your mind with new possibilities and a new understanding of how games can be made, and what the future holds for us.",
            "review_score": "1"
        },
        {
            "review_text": "Water Bears VR helped me understand complicated life problems, such as, 'Why is Trump leading in the poles?'  10/10 would learn again",
            "review_score": "1"
        },
        {
            "review_text": "Played on HTC Vive  Nice puzzle game, takes a while before there's anything close to a difficult puzzle. Would be a great game for kids",
            "review_score": "1"
        },
        {
            "review_text": "My 7 year old daughter loves this game, and I find it very educational so I want to see her keep playing it. Unfortunately she has some difficulty reaching high enough for some of the puzzles. Is there any way to adjust the scale so she can play it as easily as a taller person?",
            "review_score": "1"
        },
        {
            "review_text": "Very cute game, the sound and cuteness of the water bears draws you in. A good game to demo to people who wouldn't be interested in shooters. I do wish there were more levels though.",
            "review_score": "1"
        }
    ]
}