{
    "app_id": 394540,
    "name": "Spaceport Hope",
    "release_date": "2016-04-15",
    "developer": [
        "team BitClub"
    ],
    "publisher": [
        "team BitClub , Sunken Treasure Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Platformer"
    ],
    "achievements": 24,
    "positive_ratings": 342,
    "negative_ratings": 101,
    "price": 0.79,
    "description": "A huge hand-crafted world packed with 13 unique bosses, a gripping story, and tons of enemies, Spaceport Hope is the ultimate test of gaming prowess.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394540/header.jpg?t=1492978215",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 Processor: 1.7GHz processor Memory: 1 GB RAM Graphics: OpenGL 3.0 + 512MB VRAM Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows XP/Vista/7/8/10 Processor: 2.0GHz processor or higher Memory: 2 GB RAM Graphics: OpenGL 4.0 + 1GB VRAM or higher Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "This is a fun game, with a good atmosphere, tight controls and a good variety of smart-ish enemies.  There is a story to follow but you are free to take your ship to one of several planets and explore. Some of them require a certain item that you must find or buy first to be able to safely go there.  There is no controller support, which is unfortunate for a game like this. It does work fine with xpadder.  You start with a hand gun with unlimited ammo (although it does overheat and you have to wait a few seconds for it to cool off). I found another weapon about 10 minutes in to it. After 4 hours i have 4 weapons.  The enemies are not the standard 1-2 hits to kill. They (and you) have HP, not hearts. Some of the early enemies are taking many hits to kill (you can't see their HP.) The enemies do have simple AI and do more than walk back and forth.  Given that a screen with 3-5 enemies can take a little while to kill, the checkpoints seem a bit far apart for my tastes, but I'm not very patient with redoing content.   Because of the distance of the checkpoints, for me at least, the fast action seen in the store page video is just not realistic. You can't jump around getting hit as much as the video shows without constantly running back to the last checkpoint to get healed. It could get faster paced once I find more weapons, but so far it is more of a careful crawl to make sure I survive to the next checkpoint. This is especially true when you also have to go through a long series of spikes and moving blocks.  The checkpoints are my only real complaint about the game. It might be better if the enemies dropped some form of HP.  The bosses are on the easy side.  Once you get a ways in to it, there is a suprisingly large variety of enemies, most of them unique in one way or another.  Overall it's a pretty nice game, and worth the price.  Edit: I finished the game in just under 7 hours. The checkpoint spacing was not as bad as it seemed early on. They are a bit sparse in the beginning areas.  The bosses remained fairly easy all the way to the end. The final boss took me three tries, and I was one hit away from doing it in two tries. No boss took more than three tries. About half of them I killed on the first attempt, and I'm not especially good at boss fights.",
            "review_score": "1"
        },
        {
            "review_text": "This game I seriously wanted to like. The backgrounds and music felt very nice and i enjoyed the aspect of exploration involved, but there is too much wrong with this game to defend it. From the numerous weapons you find in the game, I found myself using only the default one(infinite ammo and didnt even need to be reloaded) or the explosive weapon for the bosses.  The enemies could be described as frustrating. Many of the random mobs have abilities that make them invunerable for a time, forcing you to wait still and hope you can kill then in the next cycle. This invunerability in a lot of enemies cuts up so much of the gameplay and makes comnbat feel frustrating, especially if you're backtracking or farming money for the shop. The bosses fall into an extremely similar vein to regular mobs. You either have a ridiculously easy boss you just have to hold down fire to kill, or you have an invincible enemy that has a frustrating gimmick to deal with (the first boss on the spaceport needs you to time a switch perfectly to open up the weak spot, and you had to do it ~3 times). The expansive areas also feel really empty or confusing. At one time, i thought a seemingly innocuous pool of what I thought was water turned out to be deadly chemicals that killed my character. The plot at times feels contrived or frustrating, such as the scene where the two guys in shades just up and walk past you after a quick boss fight, regardless of the fact that you could have shot them at any time. The sudden 'aliens' twist felt obtuse as well, having not heard anything about them until then.  It's relaitively cheap price makes me not dislike the game as much as I feel I should, since I did manage to squeeze some enjoyment out of the game. If the game goes on sale, or if the developers fix it up some, I'd recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun metroidvania style action platformer. Plenty of planets to explore each with their own unique theme. Lots of different guns to pick up and use. Decent music and pixel art to go with it.   The story is rather weak, lots of generic dialogue and the plot is very basic. If I had to critisize one aspect, it would be that the game becomes very unclear as to where you should be going once you get close to the end of the game. There's a hint button built into the game, but it was no use. I had to look around on the internet to find out where to go next. Also, platforming can feel weird at first, there's some clipping that you'll need to get used to. You'll go to make a jump that looks clear and hit an invisible barrier, likely due to invisible pixels on the main character extending outward a little bit. Once you get used to it you don't notice it, but it might throw off a jump or two at the beginning.  Otherwise, it's absolutely worth the price paid. I got about 6 hours out of it. Looking forward to more from this team.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game! Awesome 2D side-scrolling shooter platformer with a couple of simple puzzles thrown in for good measure. If you've played Cave Story, you'll like this. It's a decent 5-6 hours long if you go for completionists style. Definitely worth the $2 imo. The only problem I encountered was when I beat the final boss the first time, his eyes were all gone but he still had a bit of HP left. None of the weapons could finish him off. Played it again and had no issues destroying him to finish the game. Yay!  On the critique. - Most bosses were too easy(for me) because I used the Laser weapon - Laser weapon is OP vs most bosses(and pretty much everything)  Maybe give less ammo/different ammo with less reserve - The hitbox for the protagonist is larger than the character's body. Takes some getting use to but you can manage.  This is a fantastic game that is well worth the time and money. Plus, it makes it extra fun when the protagonist's name is the same as yours. :) 7/10 - Captain Cole",
            "review_score": "1"
        },
        {
            "review_text": "A pretty solid game for the price tag. Kind of shallow, but it scratches the Metroidvania itch. (Reported play time is basically doubled from having left this alt-tabbed while doing other things; I'd say 7-9 hours.)   Pros:  - Some unexpectedly charming worldbuilding. Games that look/play like this often eschew a story entirely, but this had a little heart to it.  - Fun areas to explore that seem massive and daunting at first. Very satisfying to realize that you know your way around them.  - Good diversity of enemy behavior!   Cons:  - Like I said, the actual gameplay is kind of shallow. Enemies have small hit boxes and high HP. You'll spend a lot of time dodging bullets and getting off a single shot on a stationary enemy or else running away so you can spam attacks from a safe distance until everything falls down. You don't really aim so much as hope that an enemy crosses your field of fire.  - Lots of little things that are more like helpful notes I'd give to a developer than complaints.   So yeah, I'd go for it if you're into this kind of thing.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, pretty short but it's definately worth buying for it's low price of 79p. Loved it, Would definately reccomend! :)",
            "review_score": "1"
        },
        {
            "review_text": "I have the latest Java and does not start, I don't recommend it because I can't even open it...",
            "review_score": "-1"
        },
        {
            "review_text": "Please note that in the absence of any sort of middle ground I will give this game a thumbs up. If you're still unsure after reading my review wait for a sale and try it out for yourself.  I was driving around last night wondering what game to review next when I realized that it had been staring me right in the face the whole time: Spaceport Hope. I had purchased it fairly recently and there was so much I felt had to be said about this game while I was playing it but by the time I was done, stowing it away in the deepest, darkest recesses of my Steam library seemed the best thing to do. Here I am, though, having dusted it off to share with you all the adventure I had with this one. So, let's see here. What can I say about Spaceport Hope? Let me break this down for you, so we can all scrutinize it together, hmm?  The good: There is some good to this game but honestly, the positives are far outweighed by the negative. The soundtracks are probably my favorite thing about this particular 2-D adventure and I have to credit the developer here because I found myself paying more attention to the music than I did the game. I don't mind telling you either, that such an occurrence is very unusual for me because I have a tendency to be far more visual. While this is a step in the right direction, it's also not what you want because the music should go hand in hand with the rest of the game to create a completely immersive experience for the player but failed to do so. To be honest with you, the music was so much better than the gameplay by comparison that I would have considered purchasing the soundtrack separately if I hadn't already gotten it with a bundle.  The graphics in Spaceport Hope are another one of the bright spots that are so few and far between and deserves a gold star for effort at the very least. The handcrafted pixel art is actually pretty good and a nice reminder of so many pleasantly nostalgic moments that I would recommend it on that basis alone, for all the fans of these 8-bit style throwbacks like myself.  The bad: No controller support for an action/adventure game? That's a hefty blunder right from the start. It claims to have 'Partial Controller Support' but fails to deliver on this feature, which happens to be one of the most important in the genre. I have a Razer Sabertooth Elite and could not for the life of me get it to work with this game. I've read a lot of other reviews and done some research and those who actually were able to play with a gamepad are an extreme minority. This was almost a deal-breaker for me before I even started, but I like to support indie creators of all kinds so decided to push through, hoping the rest would make up for this rather dubious mark against itself. I'm sorry to say that it did not and was forced to use irksome, counter-intuitive controls on my keyboard in order to play a sub-par game.  Although the story is by no means the most important feature of a game, especially one of this type, the narrative itself was poorly delivered. The NPC's seem nearly impossible to differentiate because their dialogue is limited to dim one-liners that are far from memorable. Even the key characters only provide tidbits of information about what's actually going on in a handful of brief snippets. If you want to get right down to it, there isn't much of a story at all, just a very dry, quick and dirty plot that seems primarily to be used as filler more than anything else.  The ugly: As I said before, the plot if not lackluster is direct and to the point but the problem arises when there is so much extra content that is in no way tied into the main story arch. It comes off as an afterthought that becomes tedious when you realize that you're about to fight the last boss and you still have five, six, even seven guns left to find, heart containers and some quests to boot, so if you're looking to 100% this game then sadly, this is what will happen. Just to clarify and show you what I mean: there are ten worlds to explore in order to find all the items and achievements but for people who just want to enjoy the game and beat it, only five of those worlds are absolutely necessary, one of which includes the planet used as the starting area.  As soon as you start a new game file and commit, plunging in head first with eyes wide and hopes high, looking forward to an exciting action adventure, the disappointment starts almost immediately. You begin squinting as you plummet towards the reality of what you've gotten yourself into. The double jump, something that should and is usually an upgrade of some sort that offers a smidgen of satisfaction when you finally acquire it, is handed to you. I hate to say it but that isn't even the worst part because the already floaty controls make the much-coveted double jump unwieldy and difficult to use.  Putting that aside for the moment, this sweet skill also comes along with a starter weapon that has unlimited ammo. Before you start thinking to yourself 'well that's not so bad, it is a starter after all,' let me stop you right there and just say that the balance is non-existent. It is all too possible to go through the entire game armed with nothing but your first gun with relative ease because that's exactly what I did. The fire rate is insane and because there's no need to reload your weapon you can stand on one side of the screen, hold down the fire button and simply walk forward with minimal resistance. Even the achievement for beating the final boss with nothing but the first weapon wasn't that hard and I certainly did not feel like I 'achieved' anything.  This takes me to my next point. The enemy AI seems a little flat and more than a touch boring. I became increasingly zoned out while playing until finally, a switch flicked on in my brain and broached the threshold of full-on zombie mode. Which is kind of funny when I think about it because this was my experience on 'Normal' difficulty; after I beat the game and was taken back to the main menu, I was scrolling past all the settings and saw 'Expert' mode that listed its associated alterations.  --&gt; Enemy life is increased by 40%.  --&gt; The player takes an additional 30% damage.  --&gt; Fire rate for all weapons is decreased by 40%.  There's nothing wrong with this in theory but in practice, I think there's just not enough creativity put into programming the AI to warrant such a drastic increase in difficulty. The only result I can imagine is nothing short of mind numbing.  Spaceport Hope sporting thirteen unique bosses, however, sounded incredibly appealing and was definitely a selling point for me, but the novelty quickly wore off after the first few encounters as they appear to be strongly choreographed and obvious. I also thought the point of having so many different guns was an indication that each boss had a corresponding weakness and some of them do but for the most part the rocket launcher will do the job quite efficiently. There's no real need and (speaking for myself here) very little desire to even bother looking for the rest of the weapons, even though I eventually did so anyway.  My final thoughts are thus... Spaceport Hope is by no means a lost cause and is a half-decent time waster if you've got a couple of hours to kill. The frustrating thing about this game is being able to see all the squandered potential because by all rights it could have been an excellent side-scrolling shooter but subsequently lost its footing and fell flat on its face.  Here at the end, after it's all said and done, you might ask if I would even recommend the game that could have been? The truth is... I'm torn. Yes, I would recommend Spaceport Hope because it's not all bad and there were moments where I genuinely enjoyed myself. The catch is that I would only give it the go-ahead to a small, niche fan base that can forgive or look past its failings and wouldn't mind adding this indie title to their collection.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, unique platformer with an old school feel.",
            "review_score": "1"
        },
        {
            "review_text": "good game one of the best 2D games",
            "review_score": "1"
        },
        {
            "review_text": "As much as i want to support indie devs i just cant recomend it. I went with no expectation left bored. Words feel to empty and the graphic assets make things hard to distinguish especially pick ups. With steam supporting refund i would say try it but i will not recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has a really nice atmosphere, and the music is definitely fitting the retro vibe. The weapons were also cool. Overall though the game just feels kindof lifeless and unsatisfying. Im not halfway through and I'm already bored.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game. Worth the price.",
            "review_score": "1"
        }
    ]
}