{
    "app_id": 394550,
    "name": "Gunman Clive 2",
    "release_date": "2015-09-03",
    "developer": [
        "Hörberg Productions"
    ],
    "publisher": [
        "Hörberg Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 7,
    "positive_ratings": 72,
    "negative_ratings": 8,
    "price": 2.59,
    "description": "Gunman Clive returns in an all new adventure. Now in Color!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394550/header.jpg?t=1478107298",
    "minimum_requirements": "OS: Windows XP SP2 Processor: 2 GHz Memory: 1 GB RAM Graphics: OpenGL 2.0 Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Gunman Clive is honestly my favorite platformer of this year. Played it on my 3DS and enjoyed every moment of it. Sure, I got frustrated when I couldn't get through a stage, but that satisfaction of beating the stage you were stuck on for the longest time is amazing. Soundtrack made it even better going through the stages and the boss battles were challenging and that's a good thing. Now Gunman Clive 2 does everything bigger and better. More variety in boss battles, different types of stages compared to the first one, and there's more color! COLOR PEOPLE! The soundtrack is still on point with everything you're doing. Probably the best $3 spent on Steam ever.",
            "review_score": "1"
        },
        {
            "review_text": "Old School fun and style!  Welcome back in the past, where simple characters were epic and it didn't take a lot of scenes and psychology backgrounds to make us feeling familiar to them.  Gunman Clives 2 is a fantastic game which give you the possibility to control 3 characters facing the main champaign. Each of these characters will have their own set of skills, and moves. Going through the campaign will give you a lot of troubles as the difficulty reward smart thinkers and patient players as it was for old school games.  Not only old school here, but also the new one, as a lot of variety is proposed in different levels, the 2D flying levels encountered here were something absolutely nex, fresh and very, very entertaining. Gunman Clive is absolutely a classic and will steal all your attention. The difficulty is something that will catch you and will never let you go, beating a level and another one and another one will grant you hours of fun.   Furthermore a special note for the soundtrack, exciting and really well thought out.  An absolute Masterpiece and a must have for all those missing Old School games.  Videogame News, Indie Score: 9.0 | ULTRA RECOMMENDED",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little platformer. It expands on the first game in both visual and level design nicely. Very short but it has 4 characters to choose from. This is well worth it for the low cost.",
            "review_score": "1"
        }
    ]
}