{
    "app_id": 394600,
    "name": "Mighty Gunvolt",
    "release_date": "2015-09-29",
    "developer": [
        "INTI CREATES CO., LTD."
    ],
    "publisher": [
        "INTI CREATES CO., LTD."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 12,
    "positive_ratings": 149,
    "negative_ratings": 54,
    "price": 3.99,
    "description": "Take control of one of three playable characters (Gunvolt, Ekoro, and Beck) as you blast your way past the baddies in stage after stage of side-scrolling action! Each stage ends with a boss encounter. Defeat the boss to complete the stage.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394600/header.jpg?t=1450760883",
    "minimum_requirements": "Mínimo: SO: Windows XP, 7 or 8.1 Procesador: 2Ghz or faster processer Memoria: 2 GB de RAM Gráficos: 512MB VRAM (NVIDIA GeForce) DirectX: Versión 9.0c Almacenamiento: 512 MB de espacio disponible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Developer: INTI CREATES CO., LTD. Publisher: INTI CREATES CO., LTD. Release Date: September 29th, 2015    Story",
            "review_score": "1"
        },
        {
            "review_text": "My thoughts on Mighty Gunvolt:  My Pros ------------------  -It brings back the feel with the 8-bit Mega Man games which is aweosme -The Chars works very uniquely which is awesome as well -So far haven't found anything about the game bad  My Cons ------------------ None yet  In conclusion I totally recommend this game If you want to go back into the retro style nostagia similar to the Mega Man games. I would also say If you want to get into playing an 8-bit style game like Mega Man well this awesome game is for you! =D",
            "review_score": "1"
        },
        {
            "review_text": "I personally have enjoyed this game so far. I guess if you have five dollars left after you bought a steam card then I would recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Its like an Entry-level Mega Man for Beginners but Awesome! Definitely worth every dollar! 5 Stars!",
            "review_score": "1"
        },
        {
            "review_text": "A fun retro sidescroller, very much like Mega Man. Beautiful graphics and great music, with very smooth gameplay and controls. It's pretty short, with five main levels in linear order, and four extra levels that can be played any time. The levels are easy, but provide some challenge in the bosses. Probably too easy for hardcore gamers, but it's good to have something for less experienced gamers too.  + Great graphics and music + Solid gameplay and controls + Bosses are challenging, but not impossible + Achievements  - Short - When you start a level, you can't exit it - The warp levels don't show any indication when cleared, so it can be hard to remember which ones you've finished - The story doesn't make sense, but I guess it's intentional Engrish.  4/5",
            "review_score": "1"
        },
        {
            "review_text": "There’s no reason to beat around the bush here, the game wants to be an old school Mega Man. So in that respect how does it hold up?  Well when it works it’s quite enjoyable. But a number of issues, mostly a lack of polish, really hold it back. As long as you like the genre you’ll get some fun out of it and its short length means you aren’t in for a serious time sink either way, but the next Shovel Knight this is not.   The issues primarily stem from the lack of variety in tactics here. Jump n’ shoot, jump n’ shoot. Classic mechanics but the lack of alternate weapons really hurts your ability to handle things tactically, instead sometimes it just boils down to slamming yourself against a wall enough times until things go your way. Add to this some spotty hit-detection and you have a recipe for aggravation. This is most prominent in the boss battles, some are well built and like a classic Mega Man game can be overcome with careful observation and reaction. However too many of them are cheap, with several of them possessing attacks you simply have NO way to dodge unless you were moving before they even began telegraphing the attack. This means far too many boss battles devolve into you jamming on the fire button as quickly as possible while you pray it doesn’t use one of its undodgeable attacks too many times in a row and you can damage it faster than it can you.  With all that said you’d think I’d be giving it a negative review. But several of the stages and bosses are just too good to do that. Like I said, when it works it really works and feels just like those classic days of yore. But if you do pick it up prepare for the fact you’ll have to deal with the less interesting/cheap bosses along the way.  ",
            "review_score": "1"
        },
        {
            "review_text": "Just like good old classic megaman. It reminds me of mega man 10 but with different characters. This is amazing!   INTI CREATES, the same developers who made the megaman zero series. It's difficult for sure. If you're looking for a classic kickass sidescroller that has megaman elements, get this! Their's not many examples of excellent games like this on steam ",
            "review_score": "1"
        },
        {
            "review_text": "Looks, sounds and feels exactly like 8-bit Megaman.  The normal levels are pretty good, but the bosses are significantly harder. Many of the patterns will require repeat tries, memorization and good reflexes. Unlike in basically any Megaman ever, there's nothing like sub-tanks, E-Tanks or weapon weaknesses to make stuff optionally easier, so you're gonna have to git gud. While I'm fine with the fact that the bosses are tough, I'm sure many people would have appreciated some optional help.  If you're a skilled Megaman veteran, this'll be right up your alley. If you're not, you're probably gonna be fine with some practice, but it might be a little bit frustrating.  For anyone who has enjoyed Megaman in the past, and especially for 8-bit Megaman vets, this is highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "What a piece of ♥♥♥♥ this game is. There is no challenge at all. The soundtrack is great but I cannot justify spending $5.49 CAD on a game that is both less substantial and far easier than even the first mega man game. Hazards are not really hazards if they literally do zero damage. Refunded this trash, and I will pirate it if I feel like playing the game again. What a ♥♥♥♥ing disappointment.",
            "review_score": "-1"
        },
        {
            "review_text": "Mighty Gunvolt is a cute, short Mega-Man style platformer but nothing special makes it stand out. It's more or less a promotion for Azure Striker Gunvolt and Might No 9. So unless you really like Mega-Man clones or the previously two mentioned games, then it's not worth your money or time.",
            "review_score": "-1"
        }
    ]
}