{
    "app_id": 394760,
    "name": "Dead Effect 2",
    "release_date": "2016-05-06",
    "developer": [
        "BadFly Interactive, a.s."
    ],
    "publisher": [
        "App Holdings"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Zombies",
        "Co-op"
    ],
    "achievements": 180,
    "positive_ratings": 1102,
    "negative_ratings": 415,
    "price": 8.99,
    "description": "Dead Effect 2 is the newest addition to the acclaimed Dead Effect franchise. This action sci-fi shooter is looking to push the boundaries of first-person shooters to new levels with slick graphics, rich narrative and RPG elements.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394760/header.jpg?t=1554494022",
    "minimum_requirements": "OS: Windows 7 Processor: Intel Core i5-2400 - AMD FX-6100 Memory: 6 GB RAM Graphics: NVIDIA GeForce GTX 560 with 2 GB VRAM / NVIDIA GeForce GTX 760 - AMD Radeon HD 7770 with 2 GB VRAM DirectX: Version 9.0c Network: Broadband Internet connection Storage: 11 GB available space Sound Card: DirectX compatible sound card Additional Notes: Install size will gradually increase with future updates.",
    "recommended_requirements": "OS: Windows 7, Windows 8.1, Windows 10 Processor: Intel Core i7-3770 - AMD FX-8350, or faster Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 970 - AMD Radeon R9 290, or better DirectX: Version 9.0c Network: Broadband Internet connection Storage: 11 GB available space Sound Card: DirectX compatible sound card Additional Notes: Install size will gradually increase with future updates.",
    "reviews": [
        {
            "review_text": "I don't know what the negative reviews are for. This is a $10 - $20 game, depending on whether you get it on sale or not, it's easily got a good 20 hours of gameplay if you play through the story and numerous other modes it has. It appears to be ported from a tablet game, but it still supporters directx9 at least. The graphics won't knock you off your feat, but they are good enough and get the job done. The major setback the game has, is a very weak ending. It just says thanks for supporting us and you get a few more lines of dialog from the NPC's. The story is but one part of the game though.   This game has a similar setting to dead space, but plays more like a single player killing floor if killing floor was ported. It has a level system with skills to advance and weapons also have levels as well as customization abilities. You can pick enegry weapons, shotguns, assault rifles, sniper rifles, and a few others. YOu can then level them up and customize the weapons. There is also an armor system, same applies with customizations. Then there are augments you can also install and customize. The game really has a lot of customization.   There are several game modes. Story is the campaign, it's decent, but has a weak ending. There's survival where you have to survive for usually 6 minutes as the game throws hundreds of zombies at you. There's biohazard where you have to survive 5 waves of zombies. There's infestation, lone wolf, and generic, which all tend to be objective based missions. There's a lot to do here, it'll take you between 15 - 20 hours to beat all the missions.   There's supposed to be a co-op aspect to this game but I have not tested that, single player, I enjoyed every one of the 15 hours I played this.",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer: I played the game hardly at all, but I highly doubt my impression would have improved over time.  I'm not sure if this game was TRYING to go for a B-film feeling or not, but if it did, it failed horribly. It would be one thing to satirize or parody a B-film, but this game has so many problems that I doubt this was the case.  The voice acting is grating. The voice acting was actually a big reason why I didn't play as long as I probably should have before writing this review. Yes. It's THAT bad. (Made even worse if you choose to play as the female character).  The shooting feels clunky. In early sections, I found myself taking shots at zombies' heads, with my aim PERFECTLY aligned in the middle of the head, only to have every shot miss. I was finally able to hit their heads after my moving my sights downwards more, towards their jaws/necks.  I found some kind of electric gun thing that could shoot a couple of shots and then stopped. I would click again, and just get a 'beep' signalling I couldn't fire.  I don't know why - the ammo counter said the weapon had infinite ammo, and there were no other visuals to indicate why the gun would stop firing.  Apparently, there actually is an indicator, albeit a subtle one. The reticle fades to gray.  Movement is PAINFULLY slow, even when sprinting.  Menus can only be accessed via NPCs.  The first NPC has her nipples showing through her shirt. Don't get me wrong, I love boobs as much as the next guy, but they should have a reason for appearing - Boobs and nips showing up in hentai games? Makes sense. Showing up at the strip club in GTA5? Makes sense. Shows up randomly in a game about shooting zombies? No sense.  Game feels like it wants to be a mix of Doom 3 and Borderlands, but lacks the polish and features to come even close.  On a more positive note, the graphics and environments looked very good, from what I could tell.  Edit: Changed the review so that it seems less like a personal attack on the devs, while still maintaining my criticism. On the internet, it can sometimes be easy to forget that the person on the other end is a living, breathing person with feelings - not just text on a screen.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Good Game .. Graphics good .. Play through with a lot of missions, on differnet levels .. Very good Keyboard and mouse key binds .. Keep up the good work ..  Can't wait for DE3 ..",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game-either to completion or as long as possible-my review of it is positive.  (This review is short and intended only as a vote for the overall rating of this game with no intention of being informative)",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the first Dead Effect. This game though is completely unplayable. No matter what settings I have the game on it barely runs. I play GTA 5 on maxed out settings without a problem.   Dont make the mistake I made and buy the game.   Ive read they tried to sort some of the issues out but dont seem to make any difference. I know several other people that are having the same issue too. The developers should not be allowed to sell it if it doesnt work. A disgrace.",
            "review_score": "-1"
        },
        {
            "review_text": "a fun game fills like the old dooms worth the money fun co op but no mic support on the game sad to think this was a tablet game first if they would have made it for the pc first i think i would have bin bigger then it is",
            "review_score": "1"
        },
        {
            "review_text": "I tried to ignore the negative reviews but now I regret that. It is pretty bad. Charming in bits but really an absolutely terrible game. And if you have dual monitors, you cannot play with KB&amp;M because your invisible mouse will be somewhere on the second monitor after turning right and when you click to shoot, it will just minimize the game. I was forced to play with a controller and the controls are clunky and poor.  Oh yeah and graphics at least looked good in the trailers... they aren't. Got it for my wife as well so we could co-op. Her first comment to me 'The graphics look old!'. I don't think they look old... I think they just look bad. This game really belongs on a cell phone if anywhere.",
            "review_score": "-1"
        },
        {
            "review_text": "  Surprisingly this game isn't bad for 2016 sure it has 2012 graphics but it isnt all that bad. I got into it for almost 2 hours straight (For a review) But this game is very great and would reccomend if you want to have 2 hours of fun then never touch again XD",
            "review_score": "1"
        },
        {
            "review_text": "Take up 2 Friends and have fun for some hours. It's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Graphics  Cons: - Voice acting (terrible) - Story - Bad mobile port - Feels so slow for an fps  Play it on mobile, don't bother the PC/MAC version.",
            "review_score": "-1"
        },
        {
            "review_text": "This is an hilariously bad RPG shmup channelling the horror greats. The voice acting is horrendous, the amount of references in the first ten minutes are cringeworthy, and at a certain point you are just doing the same thing over and over again (Clear out room, go to next room, clear out room, go to next room, etc) There is a diverse amount of weaponry to combat a insanely limited amount of enemies. The handwave is that cloning is the reason enemies have only one appearance.  What the game lacks in design, art direction, and creativity it makes up for through doing one thing very well: It is legitimately attempting to tell a story. A poorly translated, B movie grade story, but it has one. It explains that levelling exists because otherwise the strain will overload your nueral net and kill you; it makes you have to rescue NPC's before you can use the shops or menus; and it makes you do some pretty stupid things just to stay consistant.   The resulting death-fest is dripping with character and visually if you ignore the lack of enemy variation it can end up looking fairly terryfing (As long as you aren't well versed enough in video games to recognize where they got the assets from)",
            "review_score": "1"
        },
        {
            "review_text": "Unplayable.  The mouse sensitivity is too high, I lower sensitivity ... but if the movement is a little fast, peronnage 'locks', the movement is very slow. When I change the DPI of my mouse, and I change the sensitivity in the menu is not as bad but the mouse in the menu is horribly slow.  Basically: unplayable, why not put the input RAW ??? Why we have to play with 'motion filter' horrendous on PC ?  Sorry for my english.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game 2 days ago, asked for a refund yesterday. Basically, this game has some HUGE flaws. It is not fast paced, the character you're controlling feels like 33 tons truck, the zombies have all the same animation, the weapons design are ok but you do not get the impression that you have power in them and the aim system is just horrible. One good point thought, you can see the nipples pointing of the character's friend. Buy if you like nipples, wait for a sale (huge sale I might add) if you don't.",
            "review_score": "-1"
        },
        {
            "review_text": "Ahhh Dead Effect.. you werent good the first time around, adding characters we don't give a ♥♥♥♥ about and cleavage doesnt a good zombie game make. Nice try though, maybe learn how to make games in the future? I dont recomend this game even for free, its a joke, the first one is even better than this and thats just comparing STD's at this point.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played the first two missions and I love it. This game was mobile game? I saw the graphics on the mobile and am amazed a mobile game can have such good graphics. Course, the PC verison has even better graphics. The chacteter that I choose to play 'Gunner' has funny lines and I love it. The dog zombies could be improved with the running animation (which looks like there running in slow motion) but other than that loving this game. It is worth the money. And honestly as someone did say Killing Floor 2 has a run for their money. I hope this game comes out with dlc in the future. 10 out of of 10 for me.",
            "review_score": "1"
        },
        {
            "review_text": "They use unity 5.3 which allows an export to Linux with just one click, guess they are too lazy to do a click with the mouse or they suffer from kink on the hands.  UPDATE: The dev declined my help to port the game, guess that says a lot doesn't? Rating: LAZY",
            "review_score": "-1"
        },
        {
            "review_text": "edited:  great game,fun to play,devs actually help you with problems with the game. recommend you buy",
            "review_score": "1"
        },
        {
            "review_text": "Good for killing time with your friend. Short missions, some weapon variability, some upgrades. One of the choosable heroes, Jane's voice is super badly terrible, the NPC Minikin's speech is quite annoying, storyline is meh. The game itself is pretty good, however.",
            "review_score": "1"
        },
        {
            "review_text": "A port of a shooter designed for the Android and iOS environments, which is actually enjoyable to play on PC, too. It's hammy and involves Space Marine Dude on a space ship overrun with the undead and other monsters, and is broken up into a series of escalating quests ....but short quests, which is welcome. Worth finding on sale.",
            "review_score": "1"
        }
    ]
}