{
    "app_id": 394870,
    "name": "Office Battle",
    "release_date": "2015-12-02",
    "developer": [
        "Black Lime Studio"
    ],
    "publisher": [
        "Black Lime Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Violent",
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Violent"
    ],
    "achievements": 15,
    "positive_ratings": 578,
    "negative_ratings": 224,
    "price": 0.79,
    "description": "Welcome to Office Battle! Many workers will lose their job because a layoff is happening very soon in your office. That is why &quot;Big B&quot; decided to organize a competition and the winners gets to keep his job. But don’t think that it will be easy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394870/header.jpg?t=1520923551",
    "minimum_requirements": "OS: Windows XP (SP3), Windows Vista, Windows 7, Windows 8, Windows 8.1, Windows 10 Processor: Core 2 Duo E4500 2.20 GHz or Athlon X2 7450 2.40 GHz Memory: 2 GB RAM Graphics: 512 MB of VRAM and DX9 support DirectX: Version 9.0c Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows XP (SP3), Windows Vista, Windows 7, Windows 8, Windows 8.1, Windows 10 Processor: Intel Core 2 Quad Q8200 2.33 GHz or Athlon II X3 455 3.30 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GT630 or AMD Radeon HD 4730 DirectX: Version 11 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "7.5/10 - Strangely Addicting; Way worth the Full Price  I had to do a double check after wasting several hours on this one. It has the same addictive quality you find in Clicker Hero’s and Timberman. This time the game unfolds as an office beat em' up! Last Man/Woman standing gets to keep their jobs! You’ll use trashcans for helmets, rulers for swords and the list goes on! Maps and overall game is pretty simple but the combat and diversity of objectives keep me coming back for more.  There are over 60 challenging levels with several different modes including last man standing, survival, bosses and more! Each level alternates missions so things stay fresh and exciting; this is a totally achievable 100% at around 15 hours? It requires A LOT of level farming/grinding but totally doable; I typically watch something on TV in conjunction to playing this with no sound. I won't 100% this, after completing the game I still have hours and hours left. It's fun... but not that fun.  Well worth the $1! At least 7-10 hours of Campaign and Leveling!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "its a small but fun game, about you at the office, beating up your co-workers! YEAH! the controlls are a little bit weird though, but you get used to it. very amuzing game, but after a short amount of time playing it, it gets bored :) thats all i can say.",
            "review_score": "1"
        },
        {
            "review_text": "Finish the game in 2hrs, other hrs spent on bot-grinding for Max Level  Rating: 7/11  would like to be a bot grinding for levels while working in the office",
            "review_score": "1"
        },
        {
            "review_text": "would give middle optiom, but there isn't one. It's not a bad game, but it's not a great game, either.",
            "review_score": "1"
        },
        {
            "review_text": "battle ur own office worker non stop is gud way to led out ur stress... maybe",
            "review_score": "1"
        },
        {
            "review_text": "Let's see here  Pros: Good Concept Decent Appearance    Cons: Horrific default key bindings Boring Game play Little Replay value  Basically in my opinion it's just another game in the list of unity games I've play that can not hold my attention and is uninspiring   Thank you Devs for your time but this one is in my graveyard section of steam games. ",
            "review_score": "-1"
        },
        {
            "review_text": "My friend gifted me this game, now I'm going to try 100% it just to spite him.",
            "review_score": "1"
        },
        {
            "review_text": "Played survival mission. Stood in a corner. Jammed the attack key. Took a dump. Won the match.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Hit colleagues with rulers and keyboard... 11/10 would do it IRL",
            "review_score": "1"
        },
        {
            "review_text": "controls are annoying which just ruins the rest of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun but this is more of an app type of game. Controls are basic and the premise is weak, but workable. The player beats up other office employees in order to secure their position in a company. Think of battle royal but in an office and winner keeps their job.   This is a casual game. If on sale, it might be worth the consideration.",
            "review_score": "-1"
        },
        {
            "review_text": "Booring asf. I dont recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another 'I just discovered Unity, so I'll make a game!' type of game. Not a huge fan of this one, It's not an awful idea, it's just executed in a really boring manner. The same cluster of crappy 3d models chases you around, when they die their ragdoll death animation is just ridiculous (garry's mod-esque flailing). Weapons that are dropped by mobs will break within 15-20 hits, and from the first 6 skills I unlocked, It's a very boring skill tree to deal with.  In the end, this is just a game that was sloppily put together, but if you're one of those ironic gamers who like buying bad games to be ironic, this definitely is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Easily design your office and rekt all employees with furnitures. Yes!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's terribe",
            "review_score": "-1"
        },
        {
            "review_text": "  💩  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolutely madness. Do you have a bad day at work?  Play Office Battle It's 100% sure that it will relax you by kicking some butts 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Chuck norris office smashup simulator 1.0. Don't try this at work lads.",
            "review_score": "1"
        }
    ]
}