{
    "app_id": 394850,
    "name": "Square Brawl",
    "release_date": "2015-10-22",
    "developer": [
        "Landfall"
    ],
    "publisher": [
        "Landfall"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Local Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 94,
    "negative_ratings": 23,
    "price": 3.99,
    "description": "A fast and skill based party game where all of the focus lies in fun and engaging gameplay.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394850/header.jpg?t=1490457829",
    "minimum_requirements": "OS: XP, Vista, 7, 8, 8.1 Processor: 2GHz Graphics: 512MB DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great little game! Basically a ranged Smash Bros. Tons of fun to play with friends.  Still has several bugs, but the dev is very responsive",
            "review_score": "1"
        },
        {
            "review_text": "Great for local multiplayer, everyone is constantly laughing.",
            "review_score": "1"
        },
        {
            "review_text": "It would be a nice game if free, and if it was multiplayer....",
            "review_score": "-1"
        },
        {
            "review_text": "A really perfect, enjoyable and simple game...  BUT  bugs here and there, a lot of areas that can be improved on would make this game worth. Do i recommend it? Maybe, but only if you have friends locally since there isn't an online multiplayer. (cough) (cough) PLEASE CREATE ONE SOON (cough) (cough) And also do us, players, a favor. GIVE WHAT WE WANT. jk. But seriously, we want more things from this AWESOME(almost) game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for couch gaming with friends! I especially like the diverse weapon variety and minimalistic artstyle.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoy this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing for its price, you can have hours of fun just against the bots, with loads of weapons to choose from, a large variety of maps, as well as a map editor. There are numerous game modes, and other options including health regen, double speed, etc. Face up to 3 enemy bots with difficulty levels ranging from easy to godmode.",
            "review_score": "1"
        },
        {
            "review_text": "way too buggy, when friends are over I'll always play a different game. This is because of the many bugs, I like gameplay. When I pause the game I can't unpause unless i click the button with my mouse.",
            "review_score": "-1"
        }
    ]
}