{
    "app_id": 394970,
    "name": "DEADBOLT",
    "release_date": "2016-03-14",
    "developer": [
        "Hopoo Games"
    ],
    "publisher": [
        "Hopoo Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Stealth",
        "Pixel Graphics"
    ],
    "achievements": 24,
    "positive_ratings": 2376,
    "negative_ratings": 117,
    "price": 6.99,
    "description": "DEADBOLT is an extremely challenging stealth-action hybrid that allows you to take control of the reaper to quell the recent undead uprising.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/394970/header.jpg?t=1547241830",
    "minimum_requirements": "OS: Windows 7/8/10 Processor: 2.5 GHz Memory: 1 GB RAM Graphics: Direct X9.0c Compatible Card DirectX: Version 9.0 Storage: 130 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For lovers of stealth action games like Hotline Miami, Gunpoint or Hitman series this game is just outstanding. Its' demands for proper planning combined with fast-paced action and total unforgiveness are something that will wake up your inner perfectionist.  Not saying protagonists' and enemies' strengths &amp; weakenesses are very well balanced, making gameplay fair and fun.  Btw, excellent music is a rare gem on top of everything else.",
            "review_score": "1"
        },
        {
            "review_text": "All the intense fast-paced action of Hotline Miami with slick visuals, awesome music, and a really unique theme. Kills feel amazing to pull off, especially when everything goes according to plan. My most recent all-melee kill fest was an absolute blast. 2.4 hours in at the time of the review, and less than 30% through the game, according to the indicator between missions. I am a huge fan of Risk of Rain, and Hopoo has outdone themselves again.",
            "review_score": "1"
        },
        {
            "review_text": "&gt; gunpoint meets hotline miami &gt; Stupidly good soundtrack &gt; killed a zombie on the toilet &gt; hot vampire chicks &gt; died a lot &gt; did i mention the soundtrack?  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever been so mad at inner city thugs, the italian and russian mafia, and greasers that you slaughtered all of them, and went all the way to hell to slaughter them again as zombies, vampires, skeletons, and demons in the employ of a mystical fire entity and it's candelabra legions respectively?  If you can relate to that experience, you'd be happy to hear that you get to listen to the best game OST of 2016 (so far) as well while doing so.  Worth every penny, especially for that soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, feels like a mix between Hotline Miami and Gunpoint. Quite short but challenging with polished gameplay as well as an awesome soundtrack to keep you going!",
            "review_score": "1"
        },
        {
            "review_text": "I want to recommend this game, but I'm having a hard time because I just feel like it is not that fun. It has some great stuff. I really like the retro graphics and the fantastic soundtrack. The murder spree gameplay is pretty fun too, especially the stealth aspect like shooting out lights. But honestly I found this game frustrating. Now, I don't mind the 'die in one hit' gameplay in principle, but I feel like the execution here is lacking. Hotline Miami seemed more fun and less annoying than this game to me. For one thing, I feel like you are stuck with lousy weapons most of the time, and enemies don't drop many guns, even when they are carrying them. The level design is also iffy, requiring you to open doors or drop into a room and then not only be able to shoot extremely fast (much like Hotline Miami) but also land a headshot, which is very difficult and frankly verges on aggravating, because the enemies will kill you in one hit if your aim is off even by a hair. The reaper (your character) also moves very slowly and there is no run option. I feel like the developers were not sure if they wanted to create a twitch action game or a stealth game and ended up just mashing it together and it didn't turn out that well.  So, all in all, it's not that bad. I think you might enjoy it, if you are okay with a game that is very difficult, partly because of real challenge and partly because of faulty design. I would give this a mixed rating personally, but I hope the devs keep making games because they clearly have talent and there is a lot of cool stuff in here.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome Hotline Miami-esque stealth game",
            "review_score": "1"
        },
        {
            "review_text": "Deadbolt was an interesting game reminiscent of Risk of Raint in terms of visual and audial appearance, and reminded me of gunpoint in it's gameplay. The overall premise s that you play as a 'reaper' and are given missions from a misterious source through a fireplace. The gameplay itself mainly comes down to conserving ammo, going for headshots, and trying to plan out how you take a level. This game could be considered strategy in the fact that you have to plan out your route but it mostly comes to bashing your head against the wall until you find the path of least resistance. Watching friends play the game, however, shows that there are multiple ways to play through levels, and that different weapons hold different advantages in terms of gameplay.   There were not very many glaring issues I had with the game, besides the fact that weapons may sometimes block vents and doors and in stressful situations I found myself sometimes having vents being blocked by pistols, and instead of making a hasty getaway using the game's vent mechanich, I accidentally change weapons with a rogue weapon lying on the ground. The only other major flaw were landmines. I thought that they were very cool the first time that I found them, and the first time you encounter them you get to weild one in order to learn how they work. Sadly, this was one of the only two times you actually get to weild a mine for yourself, and then you get introduced to technicians, the enemies that plant and use landmines against you. Landmines can only be avoided by going through vents or blowing them up remotely with a gun or a thrown weapon. This means that if you find a lindmine in your path with no way around it, and you don't have a weapon, you have no choice but to die. This fault in landmines is also accenutaited by the fact that enemies do not trigger landmines, and if an enemy body falls on top of the landmine, there is no way to remotely trigger it except to destroy the body, which uses a ridiculous amount of ammo, a very limited resource in this game.  Overall I found beating levels gratifying and had a good time playing the game, and would reccommend to fans of games like Gunpoint.",
            "review_score": "1"
        },
        {
            "review_text": "This is now one of my top favorite games of all time. I highly recemend it. It's fun and it makes you feel like a bad ♥♥♥, and it's challenging but beatable. You must get this game. It's worth the cash.",
            "review_score": "1"
        },
        {
            "review_text": "It's amazing. That's all.",
            "review_score": "1"
        },
        {
            "review_text": "Deadbolt was more than I expected. From the ambient music thumping in the background, to the amusing, but interesting characters. It has the noir style Reaper (a hitman), dishing out death to undead creatures who otherwise seem to be trying to avoid their true deaths. Gangster zombies and mafioso vampires, all ready to be dropped and sent to their true afterlife with a nickle plated .32 Police positive. Not to mention a map editor.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is challenging but fair. Patience and strategy are key.  An interesting story paired with great character design, awesome graphics, and amazing music.",
            "review_score": "1"
        },
        {
            "review_text": "Once again Hopoo Games develops another amazing game, it's a great stealth-action hybrid. Like both Hotline Miami 1 &amp; 2, the game has little to no checkpoints, meaning you must rely on a good strategy and execution. It's a very enjoyable game with a soundtrack created by Chris Christodoulou, who created the soundtrack for Risk of Rain. I can't recommend this game more than I already do. I'd highly recommend you buy this game, it even has a level editor, allowing you to make your own maps, with workshop support.",
            "review_score": "1"
        },
        {
            "review_text": "Great little game! I love the art and the gameplay mechanics. There is a lot of attention to detail here, from spent shell casings, to shooting through walls/floors/doors with a strong enough caliber, to splinters and debris from the surrounding environment, to destrubtible light sources, on and on... Very well done!  For me, the only thing that sometimes gets in the way are the aiming controls when changing levels. The need for accuracy in getting clean headshots is welcome, but at times the point of aim can shift in ways that aren't anticipated immediately after transitioning to a different floor. I don't know what a solution to this may be or if it's even a problem at all... It's a minor nitpick that I'm growing accustomed to as I play the game more.   If anything, it helps me appreciate the 'simple' controls of Hotline Miami and how it's top-down perspective allows it to streamline around an even tighter gameplay design. In contrast, the added verticality that Deadbolt introduces in being a fast-paced side-scroller makes lining up shots a teeny bit more involved. But that's also what makes it so engrossing :)  Well done Hopoo!",
            "review_score": "1"
        },
        {
            "review_text": "SUCH an awesome game! Its difficult and fun at the same time. I think the story is actually kinda interesting and is definetly original. But the gameplay is what makes the game for me. Its so much fun when you feel like a badass just killing everyone. Ofcourse it can really get on your nerves but it's worth it! ;D",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. After finding the first chapter fun and challenging (if not a bit unorginel) I moved on to the second (which is where I am at writing this review) and loved all tthe villans they brought in and now i had had some practice, the game became more fluid and alot more enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "A solid 9/10, DEADBOLT is a brilliant little 2D stealth-action game with a great premise, stellar gameplay, and an amazing soundtrack.  Pros:  -Great gameplay mechanics -Intriguing story-telling -Soundtrack is one of the best OSTs I've heard from a game -Level editor; community content is great  Cons:  -A bit too short for my tastes. It's a complete game, however, I feel like a DLC or a bit more original content would have been a nice touch. (Let's hope for a sequel :D)  Overall, I would highly recommend this game; it's worth the $10 price tag. ",
            "review_score": "1"
        },
        {
            "review_text": "Game was good when it was popular. Or was it ever popular? I Dont know, but its dead now and im sure of it. Like how much you created maps or made them good. There was not just enough people to play your maps. You always would get 10-12 people to play your maps which you have made withing 6-7 hours... It's not just ♥♥♥♥ing worth it..  DeadBolt (Dead Game)  Oh S*it i have more hours in a editor than a Deadbolt...",
            "review_score": "1"
        },
        {
            "review_text": "I seriously reccomend this game. This games is a master piece. Amazing soundtrack. The story is rich and this is very diffcult. Similar to hotline miami. You need to be stealthy and quiet to beat this. But honestly, being steathy makes the game last longer. This game may fill u with rage, but the music, gore and gameplay will impress you, even with the pixel graphics. Also, listen to Blood on the dancefloor. BEST. SONG. EVER 11/12 ",
            "review_score": "1"
        },
        {
            "review_text": "When I saw Deadbolt on steam I really didn't know what to think. But after spending so much time playing through it I have finally decided on my review. It is absolutly wonderful. It has a few flaws that stand out but most can be overlooked.  Gameplay 8/10 The gameplay is really enjoyable. It is heavy on Hotline Miami style stealth where it isn't 'hide behind cover and sneak past enemy' instead it is more of 'Shoot this enemy behind another from far enough away so he doesn't hear the gunshot'. For me most of the guns I didn't like too much except the lever Action Rifle in the Dredged stages, and the different types of revolvers. I prefered the melee weapons as they could be thrown with the exception of the sledgehammer and scythe. the scythe, once I bought it, was my personal favorite. Fast swing, high damage, good range all in one lethal weapon fitting of the Reaper. the only issue is some stages I don't know how you can complete without the scythe as a few involve either timers or needing to clear a large room very fast without letting anyone know you are in there.  Story 7/10 The story isn't really the main focus, but I liked it. You play as the Reaper who is hired by a talking fireplace to do jobs after the undead take the world over. The Missions can be anything from gathering intel, killing a target or targets, to finding out where one of the Fireplaces Candle servants went missing. Plus you can find recording tapes after killing undead that can be listened to(they display text so more of reading) that give a little bit of insight to the undead's thoughts.  Music 10/10 The music is divine, truely and utterly divine. It is made by the same man who made the Risk of Rain OST, Chris Christodoulou and a few others I don't know. The music changes from stage to stage and each one fits well. The music ranges from Strong but quiet Electro-dance in the Vampire's nightclubs, Heavy rock and metal during the Demon mercenary's jobs, Multi-genre Soft smooth music that slowly ramps up but never gets too fast during the Zombie's drug hideouts, to powerful atmospheric music filled with tension during the magic obsessed Skeleton bases. Not to mention the final level, the last song is wonderful.  Art: 8/10 The art isn't anything special as it is pixel graphics but it does really fit well. It has that kind of effect where after playing for a few hours you kind of forget it is even pixelated.  Final score 9/10 A wonderous game with a really enjoyable challange, heavenly music by an amazing composer and great stage design plus a level editor for those who like to make their own. I highly recomend this game to anyone who is interested,",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, the soundtrack is very neat and the gameplay iteslf is quite challenging. Would LOVE it if the devs would add more levels and weapons. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Gunpoint + Hotline Miami.  Better than both.  + some great music + nice enemy variety + nice weapon variety + depth  o not very long, but this is a plus for me, it`s compact, it doesn't have filler. Also you unlock Hard Mode after beating the game and you can play tons of custom maps  - some frustrating or even unfair moments, just a few - some not so great music - weak ending - weak story",
            "review_score": "1"
        },
        {
            "review_text": "Great game, solid mechanics, nice music. If you played the demo and enjoyed it, seriously considering buying this game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, if you liked the Hotline Miami series you're gonna love this.",
            "review_score": "1"
        },
        {
            "review_text": "I've been eagerly anticipating this game, and it did not disappoint. It can get pretty frustrating at some points but I felt that it was well balanced and provides just the right amount of difficulty. There will always be a point when you realize what you were doing wrong or you figure out another way to tackle the mission that's faster and more efficient than what you were doing before, and it feels incredibly satisfying when you successfully pull a plan off. I feel like 3 chapters isn't enough, but considering the level editor, achievements, and amount of time I've poured into this game (I have just finished chapter 2) I definitely got my money's worth. Buy it now if you can, don't wait 5000 years for it to go on sale, the devs deserve the money.  Some notes: -The weapons all feel different; all of the guns have varying degrees of accuracy, power, and bullet count. I kind of wish there were more melee weapons though. -The pixellated art style is quite lovely, and I feel like it's a step up from Risk of Rain in many aspects (though I loved Risk of Rain's art as well). -Chris Christodoulou's music is amazing as always, and sometimes I found myself pausing the game just to listen. -Really loved the different environments in the game (especially the clubs), and I like that stuff slowly gets added to your apartment. -One gripe I have about the game is that the requirements for getting 5 stars aren't very clear, though I guess it's mostly based on accuracy of headshots. -Headhunter+hammer master race.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a Side Scrolling Hotline Miami!",
            "review_score": "1"
        },
        {
            "review_text": "Trying to 100% this ♥♥♥♥ing game is the most enraging ♥♥♥♥ing thing ever",
            "review_score": "1"
        },
        {
            "review_text": "This game has horrible toilets. First off, apparently in every building in this game, the toilets/bathtubs are hooked up to the ventilation systems. That can't be sanitary. Second off, I can travel through said vents and toilets, and if anyone's sitting on the toilet (and flush), then... EAU DE TOILETTE! All the points go to anyone who gets that joke.  toilets/10 plumbing was ok.",
            "review_score": "1"
        },
        {
            "review_text": "finished the game, ♥♥♥♥ING AMAZED its a stealth game where you play the reaper and have to master different levels on different settings. it is really damn challenging I once sat on a level for half an our and almost cried when I finished it, so yeah basically you feel like a boss playing this. many different guns, which either the enemies drop or you can buy from souls, which you get from completing a level. SO satisfing headshots, you have to play it to get the experience, but this feature alone makes the game a must play. last but not least, the soundtrack is bae. It is the biggest part for creating the atmosphere of the level you play and the melody is still stuck in your head after quitting the game, it is seriously so good.   so I raged alot while playing, but it was not like in CSGO, where I once punched a hole in my ♥♥♥♥ing wall, also you feel so reliefed and amazing after completling a level. ALSO there is a level editor, what more do you want seriousy, I am so glad the developers put one in the game, so I always will have new stuff to play. so yeah! get the game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very changeling. And is one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "I tried this game out, and it's amazing :O please sale down this game, i wanna buy it :)  10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Harder then darksouls and bloodborne combined",
            "review_score": "1"
        },
        {
            "review_text": "I AM THE ONE WHO KNOCKS",
            "review_score": "1"
        },
        {
            "review_text": "Feels like Gunpoint and plays in the department of Hotline Miami. Good music and replaying after death doesn't feel like a chore. The small intricacies are nice like the flick of a lighter when entering a vent and the sharp aiming reticule is fluid. Good stuff, 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the first steam game that I played and overall its the best indie game I played in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "A real Gem of a game, DEADBOLT is a quirky sidescroller where the character mercilessly dispatches the undead. It may not be fair to say the game is one of a kind, but it is definitely unique. The story, while perhaps barebones, is quite thought-provoking. There is a good selection of weapons that offer different ways to play, which is a good feature. The game is definitely short, clocking in at 7 hours for me to beat it. but that is not including all achievements and the collectables. I will definitely be returning to pick those up. There is some replay value, but even without it, this game is worth it for the price of $10.",
            "review_score": "1"
        },
        {
            "review_text": "This is Hotline Miami but with a side view, if you liked that series play this one. 11/10 Like skyrim with guns, -IGN",
            "review_score": "1"
        },
        {
            "review_text": "This game allows for almost endless possibilities when it comes to certain senarios. You can run in guns blazin', or you can take a sneakier route and complete your objective without being seen. Along with a good storyline, amazing weapons and a talking fire, this game is definitely worth your money.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, extremely challenging though.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game 10 out 10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even better soundtrack. Worth full price. It becomes very challenging, especially once the final set of levels is unlocked.",
            "review_score": "1"
        },
        {
            "review_text": "this is game is a like a break in, murder everyone as fast a possible, puzzle game, think of it as a less hyper-violent, less colorful, more gritty, version of hotline miami, just without a top-down view, and very very fun",
            "review_score": "1"
        },
        {
            "review_text": "*Knock Knock*  -Who's this?  -Your death.  ",
            "review_score": "1"
        },
        {
            "review_text": "THE PARTY ROLLS ON  THEN COMES A KNOCK ON YOUR DOOR",
            "review_score": "1"
        },
        {
            "review_text": "Its all about killing, headshots count. One bullet and you are dead. The Game is masochistic, because you are dying alot in this game. Mostly Trail and Error till your strategie works. But I am a noob sooo?  btw Look out for it's A.I., it is unpredictable sometimes. This is the only flaw of the Game. The Storytelling is a kind of poetic and get the job done. After the campaigne you feel complete.  It took me 5 hours on my first playthrough and additional 5-6 hours on it's newgame+ aka hardmode, where the enemy placement is changed.  Deadbolt ships with a basic level editor and has workshop support. Maybe there is room for a active community and the developers aren't done with supporting the game yet. They might even provide more content in the future.   tl:dr if the Trailer gets you, u should buy it. The Levels are diversified and some of them even have nasty surprises.",
            "review_score": "1"
        },
        {
            "review_text": "I just purchased this game today and it is one of the best games I have ever played HIGHLY RECOMMENED",
            "review_score": "1"
        },
        {
            "review_text": "Gaem was gud but i wish it had 2 endings 2/10 its okay",
            "review_score": "1"
        },
        {
            "review_text": "The first several levels are enjoyable: they've got swanky music and interesting mechanics... but everything after that boils down to 'walk into the room and shoot the man in the face.' The game built up a couple of major mechanics early on, such as being able to turn into smoke and waft through various air vents to surprise your enemies--and that was great fun. It lent the game an element of puzzle-solving, and it often meant that you were incentivized *not* to just walk into the room and shoot the man in the face.  At some point about one third of the way through the game, however, the developers must have gotten bored with designing levels in such a way that allowed for clever thinking--because they begin surgically excising the mechanics that allow you to do more than just walk into the room and shoot the man in the face (such as the aforementioned air vents). Don't buy this game unless you are the sort of person who thought that Hotline Miami should have just been one long corridor with twenty dudes at the end of it all shooting at you non-stop, who give you absolutely no chance to defend yourself whatsoever, and who constantly throw up reminders that you should 'just take a break and come back to this level later' since you've died about eighty-billion times in the last forty minutes or so.",
            "review_score": "-1"
        },
        {
            "review_text": "I get enough ♥♥♥♥ from my boss and Hotline Miami, I don't need another Hair-puller to pound through in a fortnight.",
            "review_score": "-1"
        },
        {
            "review_text": "did you just relly take my money and i got nothing?... ",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of your money and time, simple one shot you die and enemies like 19 rolver shots FOR ONE TANK",
            "review_score": "-1"
        },
        {
            "review_text": "Well thought out game mechanics and very satisfying gameplay. Art and music style is absolutely brilliant.  With such a fluid game engine and multiple ways to go about the levels, pulling off a quick headshot or shanking an enemy to death in a doorway makes this game super satisfying to play.",
            "review_score": "1"
        },
        {
            "review_text": "The developer of this must have been a Dark Tower (Stephen King) fan. There's something about how the reaper knocks on a door to lure baddies (just once, faintly), that gives me chills.  Great soundtrack, fun mechanics, interesting design choices.",
            "review_score": "1"
        },
        {
            "review_text": "I thought it would be pretty easy from the first couple of levels. I have never been so wrong in my entire life",
            "review_score": "1"
        },
        {
            "review_text": "this is so much fun. its like hotline risk of rain. its the same high you get if you pull off a one go killstreak in hotline. buy the game and the OST. its worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 eye-jee-enn  it's now my #1 favorite shooter game of all time! totally beats Splatoon!",
            "review_score": "1"
        },
        {
            "review_text": "DEADBOLT is an amazing game that ressembles Gunpoint, another great game of the same genre, and has an amazing soundtrack. If you're looking for a challenging game that's gonna put you in the shoes of a reaper who dies in one hit, then you definitely have to play this game.  I rate it: 4.20/Pi",
            "review_score": "1"
        },
        {
            "review_text": "Had to Alt-Enter to fix some of the user interface problems I was having but this game. Lemme tell you. THIS GAME RIGHT HERE ♥♥♥♥♥... Is addicting and tactical as ♥♥♥♥ with an awesome atmosphere and story elements",
            "review_score": "1"
        },
        {
            "review_text": "Deadbolt is the latest in a rather short line of games in a genre that I like to call 'Knock-Knock-You're-Dead.' Hotline Miami was one of the games the made this kind of stealth-taction game noticeable, and there have been a few followups like Gunpoint or Not a Hero, but Deadbolt manages to grab all of those games, looks at them and says, 'we can do this and make it just as strange!'  Yeah. Deadbolt pulls it off, for sure. You have the tactical, wait-and-pounce feel of Gunpoint, but then sometimes you've got to get in there and mash in some faces like in Hotline Miami. It can be both frantic and tactical and the game is more than happy to move at your pace right up until you do something wrong and you end up trapped in a vent and have to face the music. Deadbolt makes you think and it makes you try different tactics. The controls are rather intuitive too, taking me only a few moments to really get into the swing of the game. Allowing you aim control with the mouse works well, and it allows you to do things like throw a hammer at a zombie who's sitting on a rooftop.  In short, it's a puzzle game with an opened way to complete your missions. There's usually no right or wrong answer, though I have found some missions to really only have one way to complete them. You'll get a few of those, but normally you have a few good choices of where to start.  My only gripe about the gameplay is that placement of objects and interactive items, such as cover and vents, can be marred when there is a gun sitting next to them. The cover and vent take priority in that case, so it seems there's no way to pick up that sawn-off shotgun if it falls next to air vent. But that's a minor gripe indeed which I can normally forgive because this game otherwise plays great and looks good while I'm playing it.  I need a sense of style and cool to draw me into a game. Whether that's Hotline Miami's grindhouse 80's film style, or the humour of Stanley's Parable, I need a game to stand out before I make any other decision. And Deadbolt's style immediately jumped out at me. Because it's kinda crazy and weird.  Deadbolt's weirdness doesn't come from a over-the-top, hyper violent antics and killing people while wearing a pig mask, nor does it have a deranged bunny(Lord) trying to take over what I believe to be England. Deadbolt goes after the dark, poetic feel like Edgar Allen Poe jumped in bed with Oldboy and then added a teaspoon of Ghost Rider for ribbing. Deadbolt has a trench-coat wearing, questionably moral hero who is, I'm sure, Death or some avatar of Death, and this is helped in due part with the characters.  You have a bunch of weird-♥♥♥ characters like Charon selling you guns and Zombie drug-dealers trying to blow your bemasked head off. You have a fireplace whose fire talks to you and gives you missions often in poetic free-verse. The mobsters are all zombies and undead monsters, but sometimes those zombies like to wear gold chains or nice suits. You drive an oh-so-sexy 1934 LeBaron to your missions. Deadbolt makes you feel like you really are a contract killer going after the undead, which is so comic-booky and ironic it works.   Of course, the art in this game, being a Hopoo game, is gorgeous. If you're not into pixel art, then there's not too much here for you; however, if you're like me and you enjoy pixel art, then Deadbolt has your back. Hopoo's style is always extremely detailed despite how far back the camera is. You can easily see minute details on characters like a set of buttons on your coat or undead's necktie done up in a windsor knot, and it all animates so very nicely.  I think that Deadbolt can gladly call the Knock-Knock-You're-Dead genre, which I just made up, it's home and it can easily stand with the best of them. And better than that, it can stand out amongst those other games despite borrowing heavily from key components of Gunpoint, Hotline Miami and Not a Hero. With it's dark, slow, evil tone Deadbolt does something a little zany by going more serious. ",
            "review_score": "1"
        },
        {
            "review_text": "I remember when it was just a beta, I never finished the beta :D, it was so awesome, I felt like a badass. but the beta was a little plain. But with the ACTUAL game that came out, it was just...wow. Literally everything was different, *New Guns *New Enemies *New Level *New EVERYTHING I DEFINITELY recommend the game, my support is 10/10 on this game.  Plus with hammer you like *boop* and the toilets, JUST YES AWW MAH GAWD THE TOILETS :D",
            "review_score": "1"
        },
        {
            "review_text": "Half of my gametime came from trying to 5-star Madam Stela.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Tight controls, brutal stealth. Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fun game.  Not a compeling story. Nice controls. (I love Risk of rain done by the same dev.)",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed risk of rain, then... you will be surprised by this game?  It isn't a rogue like, but the atmosphere, animations, music and wicked tight punishing gameplay will leave you wanting more. Despite the game being 8 hours (or less if you're really good), there is a hardmode and a level editor, where a level is uploaded once a week.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game - If you liked Party Hard this is much the same with it's focus on ingenuity and brutality!",
            "review_score": "1"
        },
        {
            "review_text": "Good mustic, challenging. just enough plot to keep you going.   great way to spend a day.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Risk Of Rain with a specific storyline and instead of abilties, you have guns.  Put some hotline miami into the mix and you have DEADBOLT.  Help 'guide' undead to the afterlife via application of bullets to their craniums!  Unfortunately, DEADBOLT seems to have taken to Hotline Miami too much, as the normal difficulty story is about 5 hours. However, workshop levels and the hard mode will greatly increase play time, with an extra few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Music is 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I had a blast, i rage quited a couple of times, and some of the levels are really interesting. Plus it had the workshop ready to go from launch, this is a good way to spend 10 dollars!",
            "review_score": "1"
        },
        {
            "review_text": "Deadbolt is a pretty solid game. For the asking price of 10 bucks, it provides around 5-6 hours (depending on skill level/how much you ♥♥♥♥ around) of strategy-action gaming. It'd be an easy comparison to call it hotline miami 3, but in reality the amount of strategy and routine while akin to miami is not as easily remedied by going in guns a' blazin'. Admittedly the game does at one point basically ask you to ♥♥♥♥ up an entire room of things' ♥♥♥♥, but it was about the only time. A few of the levels are pretty disposable, but with added content from the workshop and hopefully the developers themselves eventually, it evens out. I'd definetly call it a must for anyone who wants a quick burst of stealth-action in their lives and more than a few dead skeletons and uncomfortable vampire-inspired feelings. Plus, Hoopo really deserve your money, those boys make quality games. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game, this game guys is unbelievable. I started to doubt if this game was worth it in the early stages, but as it unfolded, I loved it. The soundtrack is 10/10 stellar, and the strategy and game mechanics are awesome. You will have a lot of fun with this game as you think out how to beat the levels. The story left me with one of those feelings you cant explain, but its good and left me wanting more, a lot more, and it really comes together at the end. At the end of the day, pick up this game, for just 10 bucks and have a 10 or more hour blast... as the Reaper.",
            "review_score": "1"
        },
        {
            "review_text": "So much fun. My boss is a fire, my enemies are undead, I've got a variety of weapons and the difficulty makes me agonize. Very fun.  Also, always trust the hammer!",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. Everything from the music, gameplay and the sweet, sweet pixel graphics. It's a pretty tough stealth game that has you thinking who to kill and when to kill. I love the level designs, the enemies, hell everything about this game is great. To those who like stealth games, or are even looking for a challenge. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "reminds me of that one time dunkey beat sky in smash",
            "review_score": "1"
        },
        {
            "review_text": "great game complety worth the 10 dollars a must have",
            "review_score": "1"
        },
        {
            "review_text": "There is a cold sensation that runs down your spine when you play this game. The object is to sweep through the towns of the undead that roams the earth and send the inhabitants back to hell. You are the Grim Reaper reclaiming his lost souls.   And I love it.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game because of how different it is from the demo. Now we got vampires, demons, and other crap. Still can't get past them demons though.",
            "review_score": "1"
        },
        {
            "review_text": "Deadbolt is a challenger game - what I mean by that is most of the levels are pretty difficult. If you're looking for a relaxed game to pass the time, keep on moving. Deadbolt will have you screaming when the crook who kills you was the last one in the level, and shouting when you finally exterminate all dark creatures from their residences. Deadbolt has achievements that actually feel like achievements, not the average 'pick up your first gun' crap.  This game is real.",
            "review_score": "1"
        },
        {
            "review_text": "challenging game a mix of hotline miami and gunpoint is an apt description  One negative reviewer wrote that some levels you have to repeat too often, that is correct. Nevertheless, I thoroughly enjoyed it, needed a bit longer to finish than listed here, I played a couple of hours offline",
            "review_score": "1"
        },
        {
            "review_text": "Played it, had very much fun with it, it ended, I was very sad",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game on the market.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, Lots of cool enemies and weapons to use. The game is a bit short, but it makes up for that by having community made workshop maps.",
            "review_score": "1"
        },
        {
            "review_text": "crazy fun and addictive! this game is madnees!!",
            "review_score": "1"
        },
        {
            "review_text": "LOVE IT. This game truly makes you feel like you ARE the reaper and a total badass.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Wish there was more, it's so good. I've played this for awhile, and I thought Normal Mode was fun and challenging.. Hard mode is the best.",
            "review_score": "1"
        },
        {
            "review_text": "0/10000 won't sell me this amazing soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Please, do yourself a favor and play this awesome game! Even if you don't like 2D shooters, there are a lot of things to enjoy like music, sound design and atmosphere!",
            "review_score": "1"
        },
        {
            "review_text": "Very underrated, made its way to one of my all time favorite games. I would seriously recommend it to pretty much anyone",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but not worth it's regular price.  It could have done better on the cover and shoot mechanic, like what NOT A HERO did, but it added it's own style. What I noticed about the game in the start was that the gameplay would suit a 'Gangster' game more, with the bulky weapons and shootouts. I saw what style they tried to do and I just can't grasp what it was that it was that stopped the game from achieving the atmosphere it should have had.  Great game if it's on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Hard, addicting, fun, cool, gory are just some words for this game. The gameplay is really enjoyable and the setting of the game is something new and cool. If you're looking for a difficult game with a nice setting I highly reccomend you checking the game out.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun games I've ever played. It doesn't only have superb gameplay, it also features a significant story, which I didn't expect to find in this game. definitely a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging, lots of fun. Definitely give it a go!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing unrelated follow up to the Hotline Miami games, this time in 2D, very intricate design choices and huge replay potential to identify the optimal completion strategy. Just don't google deadbolt lockpicking because it's not going to give you any good results related to the game...",
            "review_score": "1"
        },
        {
            "review_text": "Simply put, Deadbolt is a superbly produced indie title. Not only are the mechanics very clean and well balanced, but the aesthetic and musical design is excellent. Great job, Hopoo Games.",
            "review_score": "1"
        },
        {
            "review_text": "Great Motives, even better gameplay.",
            "review_score": "1"
        }
    ]
}