{
    "app_id": 39500,
    "name": "Gothic® 3",
    "release_date": "2009-12-02",
    "developer": [
        "Piranha Bytes"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Open World",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 2962,
    "negative_ratings": 728,
    "price": 8.99,
    "description": "A nameless hero becomes a legend! Myrtana, a world in upheaval: overrun by orcs from the dark lands in the north, King Rhobar is defending Vengard, the former stronghold of the humans, with his last troop of followers.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/39500/header.jpg?t=1533039803",
    "minimum_requirements": "Supported OS: Windows XP/2000/XP 64-Bit/Vista Processor: Intel Pentium 4 or AMD CPU 2 GHz or equivalent Memory: 1024 MB Ram or higher  Graphics: 3D graphics card with 128 MB Ram and Shader 1.4 Sound: DirectX 8.1 compatible Hard Drive: 4.6 GB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'Gothic 3 scored only 8/10 because producer JoWood 'rushed out' production...' that's a funny complaint because an 8/10 from any major critic is a heavenly blessing upon a game like Gothic 3. Nobody who plays any of the Gothic or Risen games is ever on the fence about them; you either love them or wish that you could set the developer on fire.    Allow me to explain:   I love Gothic 3. I come back to it over and over even though by now the graphics are seriously dated (I had originally reviewed the game many years ago and called it beautiful) and I have discovered pretty much everything in the world that there is to discover. There are hours upon hours of quests and content in the game to keep you busy and most of them are pretty easy to figure out. Rarely do you have to trek across an entire continent (like in some other open world RPG's out there) in order to pick up item x and then walk all the way back to drop it off. It happens... but it's rare.   Allow me to first address the number one thing anybody will ever criticize about any Pirhana Bytes game: The combat  SUCKS ! Even after official and community patches it's still one of the worst combat systems I've ever experienced and without a doubt  the  worst in an RPG. Let me save you some frustration though:    If you're fighting near a hill, ALWAYS make sure you're below the enemy; if you're fighting downhill you can't hit them for some reason.    Trying to use any offensive spell other than fireball will most likely get you killed; don't invest any of your learning points into magic. In fact just use archery and you'll be a lot happier with combat once you get the better bows.    If you do have to fight in melee, just mash the attack button. Never block, it's useless. If the enemy backs up out of range and you can't close the distance, stop attacking for a second and right when they're about to strike, spam attack again.    Two handed weapons are super strong but while your character is powering up his swing, you will be murdered. With enough points in strenth a one handed sword can one-hit almost every enemy in the game.  Like I said, combat is extremely unbalanced and poorly executed but once you get used to it, it's actually kind of funny. Near the very beginning of the game there is a literal army of orcs camped outside a castle and with very little training and the starting weapon I was able to single handedly kill every last one of them because for some reason they all wait for you to kill the guy you're attacking before another one attacks you. The only exception to that is with archers; they'll shoot you while you're fighting someone else.  The world is huge and unfortunately either due to how old the game is or simply poor design choices (a common theme with Pirhana Bytes' games) the quick travel system is horrible. You have to first find teleporter stones to a town or (very rarely) another location and then use them like an item. A neat idea but it just doesn't work well. For one thing, the cities are in some cases so far apart that even if you use a teleporter stone you still have to walk for 20 minutes to where you're trying to go. Since enemies and items never respawn this gets pretty boring in the mid-game. But on the plus side there  is  a lot to see and discover in the world; obviously not as much as say, Oblivion, but it gets relatively close (it has absolutely nothing on Skyrim, though).  As with all of the Gothic and Risen titles, the voice acting is a joke. In Gothic 3 this is compounded by the script also being a joke. I don't think it was given to a native English speaker for proofreading; if it was he just phoned it in that day. I would love to see a Gothic 3 movie that uses the actual game script. That would be comedy gold.  There isn't a WIDE variety of weapons but there are plenty to keep you progressing. Unfortunately theyre's always one obvious choice that's better than what you have, no real reason to experiment with other weapons. For example: I have never used an axe or a quarterstaff. There's no point. That would be really annoying in any other RPG but since, as I mentioned above, combat was little more than an afterthought by the developers of this game... you don't really notice. You just buy the next better weapon so that you can kill faster.  Magic system is broken and they never bothered to fix it, don't even waste your time. Some of the spells have such a long 'power-up' (super saiyan) time that you'll be dead before you ever get to see what they do. Having fireball scrolls can be useful in a pinch but they do about the same damage as a strong bow unless you waste a bunch of learning points strengthening your magic (and ultimately losing the game unless you're fairly experienced).  Speaking of learning points, in the Gothic games (and the first Risen) you level up differently than in other RPGs. You gain experience and gain a level like in other games but you don't get anything but learning points when this happens. You then have to find trainers to either increase attributes or teach you new skills. In the beginning of the game you level up super-fast but levelling eventually slows down and then stops so make sure you have a plan on where you want your character to go before you start spending learning points willy-nilly. I like this system, I just wish there were more levels in the game so that you could customize your character a bit more. You can really only MASTER one combat art which is why I say magic is useless... if there were more learning points available it'd be fun to play around with but it stunts your strength in melee or ranged combat.  Reagents for potions never grow back like they do in, say, The Elder Scrolls. On the surface this seems wrong but the fact that there are potions you can make that permanently increase one of your attributes or skills shows you why they did this. If you could just keep making those over and over again there would be no need to ever spend learning points. There are plenty of reagents in the world to make more healing potions than you will ever need, anyway. Honestly come to think of it I don't think I've ever made a healing potion. You find a ton just by fighting and opening chests.  I could go on forever. It's difficult to explain what makes Gothic 3 a good time because, especially as a new player, you will rage quit a few times. You will hear some dialogue exchanges that make you think 'why the hell am I playing this?'. You will notice some of the skills or crafting recipes never got finished (only 2 or 3) and if you spend money to learn them you basically just wasted your money. Quests will break and you'll have to load a save (and in a couple rare cases I've found, completely start the game over).  But I love it.  Maybe I'm a masochist.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, absolutely worth the 10 dollars, and in my opinion, more.  WARNING!  DO get the community patch BEFORE PLAYING! Community Patch 1.75 to be exact, trust me, you'll need it",
            "review_score": "1"
        },
        {
            "review_text": "First thing you have to do, if you want to play this game is to install the latest community patch. After this you have a very good RPG. Dont even start the game without the patch! Just dont liberate the cities befor you get to the end of the game.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest adventure you will ever encounter in a game. If you make it through the first 5 minutes of the game that are not that tempting, you will be highly rewarded for the rest of the gameplay.  The game can take between 100 to 200 hours to finish.",
            "review_score": "1"
        },
        {
            "review_text": "First off I would like to say, even though my time says I have only played 30 hours. That is when I got it on steam. I actually got the game on a CD first(saddly the CD broke and lost all my saves &gt;.&lt;), and I've clocked well over 60 hours on that. I don't know my exact time but i've seen and played a lot of this game.   Much like the Gothic series, this games boasts a HUGE landscape to explore. Even if you look on the top world view(main map) That is about half the map as their is a whole other level to the game, the amount of caves and tunnel you have to explore is huge as well. The areas you have to explore are beautiful and some scenes you can just stand there watching it for awhile. The map is huge for a game that doesn't give your a great fast-travel system, but that is the fun of an open world game, them forcing you to explore.  This game, is unfinished though, even the developers came out saying that the people who put them up to it, rushed the game to be released long before it was ready. So you will find caves that are completely empty, pockets of pitch blackness even with a torch. Grass and trees that don't match the landscape. Even some areas that are just empty of anything. Anyone who has played through and explored the map has seen this, it does mark the game as not completed. Now, if they had completed the game, it might have been THE best game of that time, but, who knows, they never did.  Comabt wise, the game is very simplistic, it goes on a 'duel' system, so you'll rarely have 2 or more people gang up on you, so it is mostly 1v1, even if you are surrounded by an army. Your moves consist of the same thing and it's very easy to kill the enemies. Saying that though, any archers or magic users are not afraid to cast their spells at you, even when your already fighting someone, and spells in this game are VERY unforgiving, some even doing a 1 or 2 hit on you. What makes this game all the harder, is that there is no auto-save feature. So you will have to manually save. It's smart to save every time you enter and leave a town, this game will make you a spastic saver. Getting killed with a sword or axe though, is just as easy, as the computer gets the exact same attack patterns you do, and if your not careful, you can be quickly killed off. (Basicly, once they start a combo and you can't break it, your dead.). Archery works fantasic and forces you to aim and be accurate, shields actually do their job, I.E. stopping arrows from hurting you and magic... magic is a ♥♥♥♥♥ sometimes. Overall, the combat is wonky and unforgiving sometimes, but workable.  The quests, although quite simple at times, range wide, towns usually consist in the same but you'll find that the game does follow the progress so, killing off an orc town, well, that means going into any other orc towns wont be easy. This game also has quest that spans the continants. For instance, one quest, for you to get a boat skimatic, which is roughly the middle of hte map, well, to get said skimatic you have to go to the south, into the varrent, a desert, well, sorry, the guy wants ice wolf pelts, and those, can only be found in the north in nordmar. The game makes you travel to this fantastic areas to grab something, it is truely amazing the amount of work was put into this game that wasn't even finish.  This game lacks polish, that is evident in the fact they got rushed to release it, I don't blame the dev's for that, you can only do so much in a certain amount of time and your not allowed to push over. If you can look past it's flaws the game is great, the story is lacking somewhat and isn't that straight forward, but, it makes you take your time and explore. Overall, it is a good game for those who don't mind the lack of polish and the sometimes wonky gameplay. I've loved playing it and I think many others will too.  Quick tip to anyone wanting to get this. Focus on leveling up and getting lots of quests done before truely picking a side. You'll get twice the amount of quests.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun, too bad its poorly optimised. (Install community patch, it's a must!)",
            "review_score": "1"
        },
        {
            "review_text": "Game where your worst enemies are not Orcs,Dragons,Ogres or something. Your worst enemy is pack of wolves. No matter of level No matter of equipment No matter of skill They will always ♥♥♥♥ you without mercy",
            "review_score": "1"
        },
        {
            "review_text": "First of all: the community patch is a must! The game is not playable without it ;P  All in all a great, old rpg. If you liked Gothic1+2, you´ll also love this part. Lots of swearing, nice dialogues, diversified quests, character building. Still got its old Gothic spirit.  The only thing I hated (and I REALLY hated it) was the combat system. Either become a mage or some ranger, don´t focus too much on melee, because fighting is really clunky and even in endgame, when you got used to it all, not really that great. I spent 80% of my fights either running away and shooting the enemy with my bow or standing on some plateau/wall/stone where they couldn´t get me and shoot em down from there. Heck, even the enemies often have massive problems attacking you: a lot of enemies can be beaten by simply walking backwards and shooting them. They´ll catch up to you, swing their weapon, walk up to you again, swing their weapon...without hitting you. Not to mention that sometimes the arrows just fly through the enemies (especially snappers, damn beasts...). IN A NUTSHELL: Focus on ranged attacks and you´ll be fine.  Nice, enjoyable, LONG(!) game, good soundtrack, makes a (imo) good end to the story. (since nobody ever wanted Gothic4 ;) )",
            "review_score": "1"
        },
        {
            "review_text": "Ach, Gothic. That's the game you like to back from time to time. I remember those times when I spend in it so many hours. Play clean version and enchanted. Gothic was and is great. Sense of humor our hero, views, music, gameplay. They all great. Maybe now in so many years later it's hard to back. I know, I'm sure I will return to it many times in future. Don't understand reasons maybe it's graphic or gameplay or something else, just in this times when we have so many games we can play, Gothic is invisible and can be boring for some people. I know this game very well and my problem can be I remember all this adventures I have in it. And all of them are very important for me. Those was awesome times when I was traveling across Myrtana and other two countries we have available in this world. And still one more thing, You can't just gave it couple minutes of your time, this game need hours to understand her fully. That's can be reason for me why I can't for now at least, return to it. Sooner of later will return and again have this wonderful moments in this great world but for now. If you reader haven't play it, even in this times of hyper realistic graphics, give it a try for a sake and memory of Good Times of Old Players.",
            "review_score": "1"
        },
        {
            "review_text": "as a medieval based RPG games ,this game really is not bad , you can really feel and experience the role playing aspect on this game ,for an RPG game ,this game is awesome ,but,....there are some flaw in this game ,such as some bug (but nothing major) and the frustatingly bad combat mechanic ,seriously....it so bad that i want to smash my head into the wall. for the graphics , for an old game (2006) this game have a very nice graphics ,the world design is beautiful and detail.  overall ,i give this game about 7.5/10 ,still reccomend it for you who fans of RPG and medieval theme game",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games of all time.  Not only do you have an absolute S*IT ton of choices, you can kill EVERYBODY!  So if you feel like buying a game where you want to go apesh*t, go ahead and buy it. But it is still a great game, give it a chance!  Trust me, the time I have played isn't even half of what yo ucan experience.",
            "review_score": "1"
        },
        {
            "review_text": " The good  Surprisingly deep story Varied terrain World graphics can be pretty Interesting skills It's cool to explore the world Keeps you interested Fully voice acted   The bad  Combat animations aren't great Too easy to ruin important quests because of lack of markers or clues If you're expecting Oblivion or the like, you'll be disappointed Some repetitive objectives ",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Definetly the longest game out of the series and most epic chalange. I loved the area of Mortana. Desert felt somewhat unfinished or something and nothern lands felt overpowered. However, the gameplay was great and endings just as good. I have played all Gothics I, II, III and love coming back to those games. If you have not played this game, get it. Visuals are not up to todays standards, but gameplay is nice and difficult as it should be.",
            "review_score": "1"
        },
        {
            "review_text": "Only 4 hour in, and yes, STEAM users bundle Gothic 1/2 DO NOT WORK :(  However, I am enjoying Gothic 3  Play on, kill stuff, get killed, save lots, it's like many rpgs but more fp than 3rd person compared to the likes of diablo1/2 which I love.  Not as detailed as MAngband, but ASCII isn't everyones cup of tea (newbs try Angband first as its turn based)",
            "review_score": "1"
        },
        {
            "review_text": "First got the game on sale  Knocked out my companions and sold their weapons at the start of the game  Explored some caves and killed some cave beasts  While looting one of their bodies, a giant spider suddenly leapt from the side of my screen, which lead me to dying and quiting the game out of fear because I have serious arachnophobia.  10/10  Would get spooked again.",
            "review_score": "1"
        },
        {
            "review_text": "make yourself usefull morra.",
            "review_score": "1"
        },
        {
            "review_text": "  An excellent game! The community Patch is just.... Wooah..",
            "review_score": "1"
        },
        {
            "review_text": "Gothic 3 is the 3rd game of the series and it's the most balanced. The game has the forests and the coast of Myrtana, the mountains of Nordmar and the desert of Varant. You will be going through a number of cities and will be working for a lot of factions (rebels, rangers, Water mages, fire mages, paladins, nomads orcs and Nordmarians) The graphics and the sounds are great. The game is easy but it's still hard if you apply the community patch. You can choose to be a ranger, a mage, a warrior or a bit of everything. The only problems i can think of is the story, it ain't as good as the previous games but it still is good. It also had bugs at the start but most of it is fixed. I recommend the game, you will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "I am an RPG fanatic and with the community patch this game rivals Gothic II Gold Edition.  This is one of my favourite RPGs, buy it on Steam/GoG sale and experience it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "There ar about 2 girls in the whole game. It was a 2016 meatfest.",
            "review_score": "1"
        },
        {
            "review_text": "One the most entertaining and rewarding RPGs that I had a fortune to play when I was still a child. I must say that it has been the game that I compared all others to and for a long time none did. The series grew in time featuring better graphics and all, but the feel of the first game is everlong.  Thank you for making this amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "Possible, the greatest old gen rpg I've ever played. The world is so immersive, the game is comepletly open world. The world itself is consistent on making you feel like you are actually in the world. The combat system is not the best, but its not like the boring point and click, it is heavily skill based and you will have a permanent death after a certain number of times you have collapsed. Overall It mixes the great points of Witcher 2 and the immersiveness of the Elder Scrolls series. NOTE this game is very, and I say it again VERY long, thats why I like it so much. I would rate this game 9000 out of 10  *important note, if you are planning on playing this game you will need to download a community patch to stop the bugs from happening*",
            "review_score": "1"
        },
        {
            "review_text": "Although I've been a fan of the Gothic games back in the days (don't let my played hours fool you, I must have put hundreds of hours into the series), in 2015 I have to say these games have the worst annoying fricken combat ever. I just can't play it any longer because I get so angry that it's not healthy. The first two games were better, with less bugs, so less annoying, but the combat was essentially the same lame ♥♥♥ unresponsive 'ungh' fest. I do recommend it, it's not a misclick. I would recommend the first two installments though instead of the third. Gothic has a very atmospheric feel, great interaction, exploration, and it's a great RPG. I just can't get past the combat anymore.",
            "review_score": "1"
        },
        {
            "review_text": "log 1 : 33hrs in  so far going grate lo, took like ~ 4 hrs to lern com`bat ; then the gaem becums, enjoyabl` reely enjoy the quests/ quest system` an the combat, both of thes 2 ar much bettr than oblvion/skyrim` inli downside is frenli ai wehn following them ar pretty retardet",
            "review_score": "1"
        },
        {
            "review_text": "It's currently $2.49 US. Buy it. A game that's been around for a long time, I have personally played the crap out of it long before I got it on STEAM. If you are dissapointed, you simply don't like open world RPG games.",
            "review_score": "1"
        },
        {
            "review_text": "Allowed me to test Steam's new refund system. 10/10 would reccomend Steam's refund system. Thanks for my money back!",
            "review_score": "1"
        },
        {
            "review_text": "Such a good RPG. Very good graphics for the time, well designed world and overall a deep roleplaying experience.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game totaly worth the $10 .... How ever there is 1 flaw there is no auto save so many times ive played for hours died and nearly destroyed my device lol if they ever make another need a auto save and for that it gets a 6/10 rating..... would be 10/10 with auto save",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Gothic 1 or 2 but still very good RPG",
            "review_score": "1"
        },
        {
            "review_text": "Skyrim for those who hated Skyrim.   It's buggy but the glitches somehow don't bother me as much and half the time you'll be too busy laughing at the campy dialogue anyway.  (I'll write a more in-depth review once I finish it.)",
            "review_score": "1"
        },
        {
            "review_text": "with the community patches i have finally found my fav. RPG of all time. never wanting to buy an old rpg, but the reviews dont lie. and the graphics with 1.74 are remarkable vs original. YOU WILL DIE!! lol remember that. I can go all the way through skyrim without dieing. Not in this game. i really hope they or someone else makes an updated version for next gen pc and consoles alike.   10/10 would die 23 times again and get ♥♥♥♥♥♥!!! ",
            "review_score": "1"
        },
        {
            "review_text": "After installing the community-made patch, this game is actually good.",
            "review_score": "1"
        },
        {
            "review_text": "Horrible Game. 4/10. Best Community ever. Best Community Patch 1.7.5 ever. 300/10.  Love it. Hate JoWood, love Piranha Bytes. Lel.",
            "review_score": "1"
        },
        {
            "review_text": "pigs and wolves.  Nuff said",
            "review_score": "1"
        },
        {
            "review_text": "This is the best one of all Gothic games-despite some other players i like this game a lot.Perfect is nearby every aspect of the game like quests,items,story also console works well and helped me to avoid some bugs which are only bad thing on this awesme game, but still it is excellent title.  Rating: 100%",
            "review_score": "1"
        },
        {
            "review_text": "this game isn't as good as the old man with the blue ball makes it out to be",
            "review_score": "1"
        },
        {
            "review_text": "I played this game with the community balance patch so the glitches and balance weren't a huge-huge deal. The game still felt rather incomplete. Certain areas weren't filled in and overall the world felt dead. It had some well designed areas though; the graphics were gorgeous and hold up to this day. It's just, the NPCs and the story felt forced. I just didn't care about any of them or any of it. The best way to complete the story and quests was to systematically collect everything and kill all the monsters in basically a grid-like formation. There was no thought, love, or nuance to it. Here's another big ♥♥♥ field or large hill with tons of monsters. Just run up and down the hill to make sure you've scoured everything and killed all the filthy 'beasts.' Get used to hearing 'the beasts'. 'Beasts' was the translators favorite word.  Everyone had a quest for you and they were all basically the same thing. Talk to person, get something from person, kill enemies, collect items, go back and talk to person, the end. I stopped actually listening to the NPCs dialogue because it was boring, pointless, and lifeless.  Edit: Grammar, I wrote this late at night, give me a break.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't reccomend these games for their price. Gotchic 1 &amp; 2 required a lot of file tweaking just to run on Windows 7; and while 3 may have been more stable, the models look like they're made out of plastic and the storyline did not grip me at all. I would suggest investing the money, instead, into the cost of an Elder Scrolls or Witcher game; or even contribute it to an up-and-coming indie like Shroud of the Avatar.",
            "review_score": "-1"
        },
        {
            "review_text": "unplayable. followed the tool tips to use mouse to attack. unable to attack or do anything but get knocked down.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is absolutely HORRIBLE! NO comparison to Gothic 1! The developer should be ashamed to have released this filth!",
            "review_score": "-1"
        },
        {
            "review_text": "this remindes me of my breakfast, bland.",
            "review_score": "-1"
        },
        {
            "review_text": "Two Worlds Replica. I figured with so many good reviews I would give this a run. I have to say I am glad I bought it on a holiday sale. Graphics are poor, dialog is god aweful, and the game play is very poor. The mechanics of the game are just not there. Drink a potion ... sheath your weapon and drink ...your still getting mauled then draw your weapon. While I understand the dev figured you cant drink a potion while in combat or if you have a sword and board. What if you only had 1 sword. I shouldnt have to stop put my weapon away drink then draw my weapon again. Summon Spells break the game. Summoned Skelly army only to be attacked by everyone. Cant despawn them either. So they run rampant killing everyone who attackes them then I get accused of murder. While its pretty funny the first camp or two it does get a bit old when I cant complete quests because my summons killed the quest giver. So save your money an pass this one up.",
            "review_score": "-1"
        },
        {
            "review_text": "The game looked interesting but looks can be deceiving. Controls were clunky and unresponsive. I was unable to attack or defend. It simply would not work. I'd press buttons and my character would stand there slack jawed and drooling until one of the creatures finally knocked my weapon from my hand. I stared mournfully at it, unable to pick it back up. Having disarmed me the creature moved in and knocked me to the ground. I attempted to get back on my feet and......nothing. I tried again but apparently my character decided it was a good time take a nap.   Eventually I was able through some inscrutable arcane means able to get back up. Noticing I had a ranged weapon option I drew that. Success! And we're back to drooling so I ran around pretending to shoot things while going pewpewpew. This was not very satisfying. I think my character might have died of boredom if I had continued to play much longer.   Then it dawned on me. It's a cleverly designed punching bag simulator! Starring your character as the punching bag.   I noticed from the screenshots the game has dinosaurs in it. Alas, I will not be able to recreate that scene from Jurassic Park where everyone is being chased by the T-Rex.   The camera controls worked but they were as clunky as the rest of the game.  The only upside to this experience has been the confirmation that Steam's refund option works flawlessly. ",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game, not even if it's on sale. People say it's the best RPG in the world, even better than Skyrim because it has such an amazing, large and deep world to play with. That may be! Except the combat mechanics are literally the worst I've ever had to endure in a video game. Melee combat is horrific. When you try to block an attack it's 50/50 whether it'll actually block it or not. It's not supposed to be 50/50 - if you block it's supposed to block - but the game is so buggy it doesn't always register. You can't tell when an enemy is going to attack because animations are so stiff and poorly done, so it's almost impossible to know when to block. The enemy, on the other hand, will block all your attacks with total efficiency. If you want to play as a melee character, this leaves you with no choice but to approach an enemy and furiously mash the left mouse button to attack over and over and hope you win, which is 50/50. Quite often the enemy will hit you and make you stumble, putting you in what I call a 'death spin' which you can't get out of. This is where the enemy keeps stunning you with each hit, meaning you can't retaliate and eventually die.  Furthermore, the game is buggy as hell. Even with the community patch this game is horrendously buggy. I had to restart 3 or 4 times to get past the first part because after I had killed all the enemies in the little village (by furiously mashing the left mouse button because there's nothing else you can do) because you have to talk to this guy to advance the story afterwards, except when I tried to talk him he just said 'talk later'. After 3 or 4 restarts he finally talked to me.  Archery is even worse. All you have to do is stand on a spot that breaks the enemy AI (which is basically on any kind of rock or tree stump because the AI is awful) and the enemies will begin slowly walking away from you because they have no way of getting to you. So you can wipe out nests of 100 goblins by standing on a rock, even though under normal circumstances 2 or 3 at once would be a challenge.  I can't recommend this game. It's absolutely awful.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ guys you were so genius making this battle system. It best suits some ♥♥♥♥ porn ♥♥♥♥ PORN WTH WOLFS WHICH ♥♥♥♥ YOU AT YOUR BUTT AND YOUR MOUTH AND YOU CHARACTER JUST YELL AND YOU MASTURBATE AT IT CAUSE YOU CANT DO ANY OF OTHER ♥♥♥♥. shift delete the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's an ok game.  The game worked ok for me, though when turning around as it loads the different environment it seems to lag a bit.  Combat animations are very lazy, the same sword slash motion is used when weilding a spear. Looks very strange to swing a spear in the left right slash animation, a spear should have a thrusting animation of it's own. And the weapon hitting doesn't make a sound.  Thought I didn't like the game, but I keep returning and wanting to play.    But now after 32 hours of game play the game is frustrating me, with vague quest descriptions causing me to wander in circles and then alt tabbing out of the game to do a search for how to complete quests, I end up with a black screen and crtl alt delete doesn't work and have to manually shut down after the black screen. Don't waste your time playing this. AVOID at all costs.   I'd rate the game 3/10 not a game I'd recommend. A waste of time even if it was free.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased this as part of the bundle deal. DONT DO IT!! the game is broken badly to the point that you wont be able to play it. I tried the patches they recommend, and still no good. I so wanted to try it because it looked good but its not. Save you money for something that works.",
            "review_score": "-1"
        },
        {
            "review_text": "RSI-inducing repetitive quest grind with horrible combat and as many usability flaws as most beta tests.  This review does not use the community mod, which supposedly fixes many of the problems.  +skillup and questgrind hard to stop playing +better than Gothic 2 in every way. +community mod available.  -horrendous combat.  -godawful combat system. -kiting and AI exploits often necessary. -performance hiccups on 2015 system. -monster and npc AI stupid. -npcs get stuck -quest grind -spell and magic system weak. -poor crafting (e.g. fire arrow recipe) -sometimes hard to loot. no aoe loot -only 10 hotkey slots -no autorun.  -incompatible with autohotkey(?)  Maybe a great game in 1990. Not good enough for 2004. Not worth playing in 2015.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are unreponsive regardless of where they're mapped to, the combat is clunky and it's all around frustrating. I couldn't even play this game for an hour before I got fed with it refusing to cooperate with me.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS TOTAL CRAP!!!! I COULDN'T LOOK AROUND FOR MY LIFE! THIS IS BULL! THIS GAME AND THE GUYS WHO MADE THIS WORTHLESS GAME BETTER BE GLAD I GOT IT ON SALE!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic controls 10/10 would refund again.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly didn't play the game much. Started with the lackluster tutorial where I walked around smacking down orcs and stealing my neigbors' stuff. Nothing groundbreaking but not really fun. Still, maybe it just starts slow.  Here's the ♥♥♥♥♥. In the middle of the tutorial, attempting to click on a chest and steal my neighbor's stuff, I accidentally clicked on his bed instead. (That's not the problem. That was totally me being clumsy, not the game's fault). My character walks towards the bed, but there's a chest in the way. You'd think he'd path around it, right? No, the dumbass walks up to the interveneing chest then just keeps on walking against it dry humping it for all he's worth.  Does he eventaully path around it? NO Does he eventually stop? NO If I mash every key on my keyboard, will it cancel his action and make him stop? NO Can I bring up the menu to try and save my game and reload? NO No, he's so damned determined to frotteurize that poor helpless chest that he, and the game with him are blind to the world. Unlike it's crappy older brother though, I CAN Ctrl-ALT-DEL out of the game.  Was it good enough to re-invest that 25 minutes? NO Is it likely that the rest of the game is programmed perfectly and I just hit the only game-breaking bug in the whole game 2 minutes in? NO Am I willing to play the game in a constant state of paranoia, saving before every action in case this kind of crap is pervasive? NO   Am I glad I only spent $5 on the entire (so far completely unplayable) Gothic Series? YES!!! Am I sick and tired of buying games on Steam that someone at steam should have at least made an effort to QC? DOUBLE YES!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Just as tedious and boring as the first Gothic, lost interest. Surprised it worked though.  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "Not recommended, very bad optimized, refund requested",
            "review_score": "-1"
        },
        {
            "review_text": "Don't sell a trilogy that doesn't work on Steam.  ____________Gaben  ░░░░░░░░░░░█▀▀░░█░░░░░░ ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░ ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░ ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░ ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░ ░░█░░░▐░░░░░░░░▄░█░░░░░ ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░ ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░ ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░░ ░░░░░░░░▀░░░░░░░░░░░░░░ ░░░░ ▄Buyers right▄░░░░░░",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic and underrated gem. A great RPG for anyone looking for freedom in just about every aspect of the game. A TRUE open world RPG, open character development and free choice",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Big open and wide map with all kind of quests and task. But beware the game contains nearly no storyline.",
            "review_score": "1"
        },
        {
            "review_text": "this game without bugs and crashes 9/10 but this game has crashes and bugs 5/10  you need community patch",
            "review_score": "1"
        },
        {
            "review_text": "It still looks nice after 9 years, and looks even better with some fan-made mods. 9/10 because screw nordmar",
            "review_score": "1"
        },
        {
            "review_text": "A solid old school hack and slash open world rpg. Its leveling / skill systems has its roots firmly in old pen and paper roleplays. Has a novel stamina based combat system. A decent game engine certainly helps with some nice hdr and depth of field effects that make it a pretty world to explore. A fair bit of replay value to be found. I can spend months at a time playing games like this though.  4/5",
            "review_score": "1"
        },
        {
            "review_text": "So I played this game many years ago when it first came out (Like a lot of others I assume) back then the game was shambles, the bugs outweighed the fun it offered. So I gave up on it and it took me till 2016 to give it another go.  I have to say if you install the 1.75 'beta' test patch its moreorless bug free to a point that it feels like the game it should have been when it was released.  The game has a lot of merits which are sadly lost mostly in time due to its terrible launch, the story is interesting and the content is massive. I was impressed with just how many quests and towns there was.   However like every game there was a couple of things that still annoyed me, the usual voice changes (Not as drastic as Forsaken Gods thankfully). Also the rebranding of your friends Gorn is now White so is Vatras, also it felt like Vatras was talking to you like he had only just met you when in reality he sailed in on your ship lol.   But if we put them minor points aside I think this game is a lot of fun and very much worth buying (If you install the 1.75 patch).  Although I still rate Gothic 2 over it, it comes in a close 2nd. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has an entertaining game-play when using the community patch [included in the steam release].  The fun comes mostly from liberating cities, sneaking around enemies to rob them, jumping over mountains into forbidden places, and most of all, killing tons of enemies. The graphics are still good, despite the years passed.  The story itself is rather poor, not to mention the ending. Still, this is one of my favourite RPG games, in the top 3.",
            "review_score": "1"
        },
        {
            "review_text": "for some reason i couldnt get into this. i think i expected soemthing just a smidge more like elder scrolsl with out being as involved. this is more like diablo . im not saying dotn get it. im just saying i thought it was soemthing else.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played this game, without the community patch, I would have to restart my computer at least every hour. Sometimes I wouldn't save in time and would lose some of my gameplay. I didn't care too much, the game was worth the hassle. With the patch, the game runs perfectly and the graphics are overhauled. It still looks good today.  The best feature of the game is the fact that you can do everything pretty much as you want, there is no real guidance through the quests and the main story line. Some people find this daunting, but when you get into it you realise it gives you a real opportunity to experience the game world.  If you want to get to a specific area, the only thing that stops you is either the enemies are too dangerous or it's a stronghold and the faction that owns it doesn't know or trust you. To get through these blockades you have to either train, sneak, do favours, or find a loophole (i.e. getting into an area by doing a job for a farmer).  Because of this, the game has an authentic feel to it. There isn't some unseen force of progression that is compelling things to be driven and world events to happen, it all unfolds in an organic and viewable way.   Bonus tip: transform into a bloodfly to zip around quickly from place to place.",
            "review_score": "1"
        },
        {
            "review_text": "I used to think Skyrim was the best (singleplayer) game on market.. Then one day I saw this game was on sale for $2 so I said ♥♥♥♥ it. Bought it and it was like the girlfriend I never had.. pisses me off but I keep coming back for more",
            "review_score": "1"
        },
        {
            "review_text": "It seems like it could have been amazing. I liked a lot of what the game had to offer but the combat system is terrible. I've tried several times to get used to it. I even resorted to reading hints and tips from some website. I downloaded the fan patch with hopes of a better combat system but no. I might try again later but at the moment I feel like I wasted 10 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game. Maybe not as good as 1 and 2 but still great. For those who played the other ones it's a MUST for gothic fans.",
            "review_score": "1"
        },
        {
            "review_text": "Visually better than gothic 2, but not anywhere else that I can remember.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a huge fan of the gothic series. Loved Gothic 1 and 2 and played all 3 titles for hours. The thing about Gothic 3 tho... The base game isn't great. Some wouldn't even call it enjoyable. But there are community made mods. And with the Community Patch 1.75 i believe it is + the Content Mod, Gothic 3 becomes the game we all wanted it to be. It's still not flawless, but i've spend enough hours to say thats its more than fun for every Gohtic fan.  It's grindy. It's hard. It's a time consumer. But it's rewarding. The feeling you get from finally being able to bash opponents y ou couldn't 10 playhour earlier... Just amazing. Definetly recommended for series fans and those who generally like grindy RPG's. Don't forget the mods tho.. Just google for them ;)",
            "review_score": "1"
        },
        {
            "review_text": "Such a trash, never was able to play it because of unfixable framerate disaster.",
            "review_score": "-1"
        },
        {
            "review_text": "Most likely the best RPG I've ever played. It's immensely large for it's time, and the story is good. You don't need to play the other two games in the series to understand what's going on. Graphics are still decent, even though the game is 10 years old as I write this review. Voice acting is decent (nothing stellar) and the maps are good. The woods really give a forest feeling, and not just some random trees in a location feeling. Combat is hard in the beginning, and very unforgiving. Friendly fire is a thing, so when you have companions, careful. Archery is my favourite part, since you have to aim yourself, and judge the tracectory as well as movement speed of your intended target.  The map consists of 3 parts, north of ice and snow, center of lush forests and south of desert. All with their own people, with their own problems, fauna and issues.  All in all, a very well made game.  I played this game outside steam for more than 200 hours, most likely.",
            "review_score": "1"
        },
        {
            "review_text": "Dont work on windows 10 anymore :( ",
            "review_score": "1"
        }
    ]
}