{
    "app_id": 395270,
    "name": "A Wolf in Autumn",
    "release_date": "2015-10-27",
    "developer": [
        "David Szymanski"
    ],
    "publisher": [
        "David Szymanski"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 171,
    "negative_ratings": 59,
    "price": 1.59,
    "description": "A dark, surreal psychological horror game, in which a young girl finds herself locked in a shed, in the middle of an idyllic autumn forest.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/395270/header.jpg?t=1547154629",
    "minimum_requirements": "OS: Windows XP or better Processor: Intel i3 or better Graphics: AMD 6870 or equivalent DirectX: Version 9.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " This game was reviewed using a code sent by the developer.",
            "review_score": "1"
        },
        {
            "review_text": "Well this is my first review, so I\\'ll make it interesting with a personal interpretation. Read this only after you've played the game and you have your own opinion of it :) Otherwise, you know - SPOILERS :)  So this game, I feel is obviously about the drama between a mother and her daughter. The mother has lead a heavy, very heavy life, full of mistakes, full of wrongs. She has only her pride left... barely.The daughter sences this and much more. She feels her mother's pain and wants to help her. But she's refused. The game takes place in a nightmare, hence all the tripping colours and weird machinations. At first I asked myself if this is a metaphore for a womb and escaping from it. Close to the end you cut some bloody ropes, which remind me of umbelical cords.   I believe the mother can\\'t let her child go and wants to protect her from the evil in the world... I honestly feel for her. I have a friend for whom I have the same feelings. That's why Autumn is in a cage, going in circles, always thinkering with stuff. Which makes her mother furious: she can\\'t control things she doesn\\'t understand! That\\'s why she stops her constantly.  At one point you are attacked by a spectre of a black wolf. I honestly shivered in my entire body, such a good moment. I believe the wolves represent the evils that might afflict women: abuse, a wasted life, dead hopes and so on. The game is both very sad and very scary, when you really think about it. If you know someone, a man or woman, who might be abused - help them, be there for them. And love your children... I think this game is about those things...  Thank you for reading, and to the creator(s) keep making games like this :)",
            "review_score": "1"
        },
        {
            "review_text": "This game hit surprisingly close to home for me. What a disturbing nightmarish atmosphere based around the relationship between a Mother and Daughter. I was a little creeped out in parts and got the chills a couple of times from the things the Mother said as I completed puzzles. I loved the look of this game and for $1.00 on sale I'm very satisfied with my experience. This game may be short, but it leaves you thinking and is full of symbolism.",
            "review_score": "1"
        },
        {
            "review_text": "Well,after playing four of David Szynotevengoingtotryandspellitproperly's games I have to say that ,while they are enjoyable, they really need to start evolving. The first game was effective because you didn't realize it was a barren world devoid of actual threat. All oppressive atmosphere and nothing else. But now,I know what to expect and it isn't having any real impact. While the graphics and sound, voice acting especially, show improvement the narratives follow an established pattern. Unconventional but becoming predictable.",
            "review_score": "1"
        },
        {
            "review_text": "Completed in thirty minutes. Would have been shorter but I missed an obvious wrench in one of the rooms. It's not a puzzle by any stretch, it's just uninteresting hard to see graphics due to the saturation and walking backwards and forwards trying to find tools whilst being frustrated that you can only carry one at a time. The underlying 'story' behind it isn't particulary amazing either. Just another recycled 'mother is having doubts about her child'.  The positive reviews seem to be people flogging their Let's Play or some biased link to the developer.  If this was anymore than £1 I would bother to refund it. Worth it for the price, but if it was ever charged any more then don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "pretty cool little psychologial horror. But i think music machine is his best game ;)",
            "review_score": "1"
        },
        {
            "review_text": "Got lost in the darkness, after going inside, because had to drop my flashlight to pick up an item, at the lack of an inventory. Not sure if this was deliberate but I really didn't like it. Whether it was a deliberate gameplay gimmick, or just the developer not thinking of making an inventory, both are just as bad. Because it adds no actual gameplay value at all and just makes the experience annoying. A no from me.",
            "review_score": "-1"
        },
        {
            "review_text": "I just finished this game, and while I'm not a professional critic I am a critical consumer. Having said this I wanted to voice my opinion to aid anyone interested in this title. This was my first experience with David Syzmanski's work, and now look forward to exploring this developer more in the future.  Although this game is short 'A Wolf in Autumn' is clever. Not really exhibiting major elements of the horror genre, but exploring emotion and the human psyche through a narrative of despair and pain. The simplistic story works well and is quite beautiful and poetic in its finality.  'A Wolf in Autumn' was an enjoyable experience, earning its price tag and my recommendation.  -A short review, for a short title- ",
            "review_score": "1"
        },
        {
            "review_text": "David Szymanski is one of those indie developers making 'games as art.' Even to open-minded players, that can be a turn-off. There is no lack of pretentious, patronizing, and often preachy nonsense out there, and that can understandibly sour gamers towards arthouse titles. But unlike those developers, Szymanski is creating profound, memorable experiences with compact, well-written narratives, and he is doing so with no agenda but his artistic vision.  My first of Szymanski's games was the free Fingerbones, which was strong enough to get me to pay for futher games. The second was the powerful The Moon Silver, which is by far my favorite of his stories. And the third is A Wolf in Autumn. All three games place an emphasis on psychological horror, and all three are short, playable in a single one-hour sitting. All three contain characters constructed through text, audio, and, for the playable characters, gameplay. You generally won't see character models on-screen, but that doesn't detract from the experience. Anyone who has played a well-crafted text-heavy game (or read a good book, for that matter) knows memorable characters are created through writing, not through visuals. Gameplay can be described, and not inaccurately, as 'walking simulator with puzzles,' and that's fine. That's all that needed.  There's not much I can say specifically without spoiling the experience of A Wolf in Autumn. When it intends to be beautiful, it's beautiful. When it intends to be spooky, it is. It's better than Fingerbones, though it doesn't live up to The Moon Silver, which does a better job of using its limitations to its advantage. Like all of Szymanski's games, it sticks with you. You'll be thinking about the story long after you finish playing. That's a compliment.  Bottom line: if you like psychological horror, aventure games, and you value games as a way to tell stories, you like A Wolf in Autumn. You'll like everything from Szymanski, in fact. My only suggestion is to start with Fingerbones, which, again, is free. If you enjoy that, you'll enjoy the rest. I can't wait to try The Music Machine!",
            "review_score": "1"
        },
        {
            "review_text": "Short playthrough, but was good.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting, albeit short, horror game about neurosis (as far as I can tell)  While I’m sceptical about the use of text in the beginning, things soon get interesting, coming together a twisted fairy-tale about the main character’s (Autumn) personal issues with her mother.   There's a lot of symbolism going on. It's also a rare example of psychological horror that puts psychology first. Further, it's easy for us to appreciate as the player because the discordant sound effects creates an oppressive atmosphere to play match the characters' inner turmoil.  That’s arguably where the game stands out most. The gameplay parts are slightly more rudimentary (a lot of walking around and picking things up).   So yeah, I'd recommend it if you like experimental and bleak.",
            "review_score": "1"
        },
        {
            "review_text": "just watch a play through honestly. game is super short and even the story falls short of what it could be. not really worth paying money for tbh.",
            "review_score": "-1"
        },
        {
            "review_text": "Its honestly a very good game. Playing as a 9 year old little girl with only one arm, with an abusive/ drug addicted mother who screams at you for 'leaving the shed/cage' while wolves threaten you from the other side of doors and the fence. Spooked me. It's a bit of a puzzle though! Frustration and fear makes a good game!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not too sure why the reviews are so great? It isn't that bad for a 2 dollar game, but It's not something I'd recommend. It would only take maybe 10 min to complete this game if the lighting was better. It's very had to understand, the grammar is pretty bad, and the story isn't even understandable. Then again, it's a 2-dollar game with pretty decent graphics, an okay story, and a little puzzle. I wish I didn't have to say whether I do or don't recommened it, because I hate leaving bad reviews. Especially on an indie game. So i'll rate it as recommended, but this is the honest review.",
            "review_score": "1"
        },
        {
            "review_text": "This Game makes me want to make games. Its not very long but it was on sale and I'm a sucker for something with a wolf element. I always enjoy point and click, and it has some puzzlish elements to it, but nothing that distracts you from the story. Well done sir, A Moon Silver is next up to play.",
            "review_score": "1"
        }
    ]
}