{
    "app_id": 395350,
    "name": "Doors",
    "release_date": "2016-02-12",
    "developer": [
        "Calvin Weibel"
    ],
    "publisher": [
        "Calvin Weibel"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Strategy"
    ],
    "achievements": 7,
    "positive_ratings": 187,
    "negative_ratings": 108,
    "price": 3.99,
    "description": "Doors is a short, atmospheric first person logic game created by a one-man-team. Taking inspiration from Limbo and The Stanley Parable, Doors attempts to bring something new to the puzzle genre.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/395350/header.jpg?t=1469156978",
    "minimum_requirements": "DirectX: Version 9.0 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "-Very short -No replayability -Background story goes nowhere -Bacon joke isn't funny  The game begins really simply, and you start to think that all it is is a mindless puzzle game (which actually would have been fine). About halfway through (maybe about 20 minutes?) a plot element develops, which I found really interesting! But it is shortly abandoned for the same puzzles I solved earlier, and none of them really left me scratching my head. Not only that, but choosing an incorrect door has no real negative outcome. The fact that I can try over and over on the same puzzle, being helpfully loaded right back in front of it, leaves me with no motivation to truly solve it. The influence of The Stanley Parable is evident here, but it feels cheap. The office section of the game just screams it, but almost nothing is interactable, and the signs don't make any real sense to the 'narrative' we find ourselves in. If it's satire, it's not working. I also would have liked to see more varied humor on the doors. The main joke with the bacon falls very flat. We get it, bacon is so great. It would have been a little funny if it was mentioned just once at the beginning and then you get it at the end. Instead the word is shoved down your throat so much that when the actual bacon does show up you don't want it at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Another gem in the form of a 'walking simulator'. Doors does a good job of progressively stepping the difficulty up, ending up with some pretty mind bending decisions.  This game deffinately requires a lot of patience and logical thinking. If you are in to things like that, this game is as good as any, deffinately worth every bit of the full price.  Quite a few funny jokes and 'easter eggs' are to be found by looking around the fairly pleasent environment, which reward exploration fairly well!   Only con ive found is that the ambient sounds in the background are a bit repetitive and can become fairly annoying. Overall solid experience!",
            "review_score": "1"
        },
        {
            "review_text": "The game tried too hard to be Stanley Parable, but doesn't understand why Stanley Parable was so good. Your choices don't matter and the game feels linear. The game is not what it's advertised to be. However, the atmosphere is nice and the artwork is okay, even if it is taken directly from Limbo.  It's also worth mentioning that I beat the game after 57 minutes, including reading all of the dialogue I could find. There doesn't seem to be any replayability.  Doors would make a fun, short F2P puzzle game, but it certainly didn't live up to my expectations and I couldn't recommend this to anyone willing to spend money.",
            "review_score": "-1"
        },
        {
            "review_text": "PROS: -Delightful logic based puzzles -Interesting atmosphere  Cons: -'Bacon' as a reward takes away from the atmosphere -Story is sub par if existent at all -Short",
            "review_score": "-1"
        },
        {
            "review_text": "Short but solid, DOORS is a very fun extension of logic puzzle games such as the old Knights and Doors riddle or the Icehouse game 'Zendo'. I highly recommend it, as long as you're OK with it being about 90 minutes total. There's some depth to it, and a few hidden things, and plenty of room for growth, but as is? Short but sweet, and I'm OK with that.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely short, atmosphere is stupid, only enjoyable part of the game was the logic puzzles, which there were too few of. Maybe worth $1. CDN.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the idea of this game. When you understand that correct door and the right door are two different things, you should be fine. Very short game, so don't spend too much money on it.  Every door can be solved without rushing and no guessing, but that would be no fun no more.  If you are patient and like solving things, buy it. If you like rushing, dont buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It looked good from trailer. I bought it and was disappointed. Doesn't engage the gamer. It tries to have a storyline, but it just doesn't come to be. The landscapes are bland. To be honest, it feels like the game is going easy on you, even though it claims to be a logic game. You can just guess what door, don't even have to read.",
            "review_score": "-1"
        },
        {
            "review_text": "The only 'pro' i saw in this game was achievements. Its just an fps style of LIMBO backgrounds with colored doors that i just used a walkthrough the whole time because the riddles didnt make any logical sense in terms of 'narrowing down' the doors to the correct one. Its like the unwanted lovechild of Portal and The Stanley Parable.  Little did I know they have one achievement you literally cannot achieve, so you're stuck with a blaring 6/7 achievements with the knowledge you can never obtain it.  So yeah.  Steam refund works still.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a short game but I enjoyed it",
            "review_score": "1"
        },
        {
            "review_text": "Not sure if this is a spoiler since we already knew that.   Bacon is unachieveable. Just like the cake.      And maybe the achievement as well.    Worth a try if you like the feeling of chasing but neither getting it nor getting closer. And being watched.   The ending feels like Minecraft.  I'm going to get some bacon.",
            "review_score": "1"
        },
        {
            "review_text": "short, but interesting",
            "review_score": "1"
        },
        {
            "review_text": "Not the hardest puzzle game out there but stil a lot of fun. For 4 bucks, (price as of writing this) I'd say it's worth it. It's quite short though, which is my biggest complaint.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. Short, but very good. I loved the creepy, atmospheric world, and the logic puzzles were challenging but not so hard that I gave up or got frustrated.   When I first started playing I was like, 'OK, this is fun, but why is this a video game and not, I dunno, a puzzle book? You could make these logic puzzles work on just a piece of paper' If you feel that way, keep going, because a context does emerge and it is both funny and creepy. Vaguely reminiscent of the Stanley Parable. Very cool game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is qiute relaxing. Recomended to those, who simply want to have some rest.",
            "review_score": "1"
        },
        {
            "review_text": "Prepare yourself to have your mind blown if you're actually going to try to find the solution of the questions.",
            "review_score": "1"
        },
        {
            "review_text": "A short walking simulator and puzzle game. These are traditional logic puzzles similar to problems one might solve in a descrete mathematics course. I enjoyed my time with it, but be aware that this is a very small game.",
            "review_score": "1"
        },
        {
            "review_text": "hey thats pretty good",
            "review_score": "1"
        },
        {
            "review_text": "It was fun for the first few puzzles, but at some point they get really tedious.    at one point there is a puzzle that has a grid of 5 x 5 doors, of which only one is the correct door. That is just tedious, and it takes about 15 minutes to solve. and for what, a crappy ending?   ",
            "review_score": "-1"
        },
        {
            "review_text": "There is so much potential here, but sadly it falls short. However, I understand why it falls short. 'This is a short indie game developed by a one-man-team.' If you can make a team to help you out with this game, then that would be a great game. It has a very good concept and is ,overall, well-made. However, right now it isn't worth the money. I hope you remake this game, but make it significantly longer. Also, the end was bad. You just threw in some story that we had no idea about.",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked this game , the puzzles were easy at first then they start getting harder but after some time it became repetetive then I got telported to some office which got me more interesting in playing it 5/10 The only thing i wished was better was the environment cause it was so simple could have been done better and that you can't actually run in the game which makes it take forever to go back to the puzzle if you fail  The game got boring in the end after teleporting to the office i though it would become really interesting but then it made you go back to the old place with puzzles that got annoying and less interesting which made me stop enjoying the game that much",
            "review_score": "-1"
        },
        {
            "review_text": "Doors is a relatively brisk logic puzzle game that has some great ideas that it executes well but, ultimately, suffers from a need to expand upon those ideas.  At a launch price of $5, Doors managed a cost of about $1 an hour for completing and getting all the achievements but the unachievable achievement (someone let me know if 'unachievable' is a lie but I suspect it isn't). I'd say it's worth the money, and arguments that there's not enough gameplay here suffer from poor cost/benefit analysis. I'd recommend the game for it's cool high-contrast graphics and fun puzzles at full price in a heartbeat. That said, it's hard not to be a bit sad that this game isn't what it could have been.  There's definitely a neat underlying storyline here that remains all but unexplored. I won't spoil anything (because it really is genuinely fun to discover what little there is), but the whole thing is contained almost entirely in a 5-10 minute area about halfway through the game. There's a tease after the credits that's cool as well. However, it seems like the entire game should have been the prologue to the real game, due a lot to the way that it's set up. If there's a 20-hour follow up to this game, great. If not, real opportunity missed.  Still, despite its flaws, it has cool puzzles with a good difficulty curve that gets to the daunting by the end, and is well worth exploring. I wouldn't not recommend this game simply because of what it could have been, but I do hope that we eventually get what this world really deserves: a full title.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, though short. I hope they get their wish, i.e. a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Doors is a bad game with a linear, mysterious story which is never blatantly established. Doors has linear gameplay with no mechanics but to walk, look around, and choose. The concept for Doors is very similar to that of The Stanly Parable with making choices. The choices that you make limit you to getting only about two endings depending on if you picked wrong or not. #1. If you choose wrong you die. #2. If you choose right you get bacon. Now the only reason I'm saying this game is only OK is because of the fact you have to pay for this game. I beat the game in only about 15 minutes with no reason given as to what I was doing and it was not memorable. In fact, the only memorable part about the game is bacon, choices, and how ♥♥♥♥♥♥♥ annoying some puzzels were. Doors just simply isn't a good game. Overall, Doors should be a free game with more mechanics and more gameplay, and explain the story. Hell, gameplay wise I'd be just fine if they added a jump mechanic for no reason. Maybe I'm being too harsh for a game that was released in February But, if Doors gets an update and cleans up it's confusing ♥♥♥♥ off my small loan of a million memes then Doors would be a game worth getting a reccomendation.  Spoiler ahead. Scroll down if you've beat the game and agree.                                                         Shorten the ♥♥♥♥♥♥♥ flying scene.",
            "review_score": "-1"
        },
        {
            "review_text": "  Short, pointless logic game that is no fun at all. Walking is slooooooww and there's almost nothing to see. The only saving grace was the ability to save at any moment. I had hopes when the game transitioned to an 'office' setting, like when you go 'behind the scenes' in the original Portal, but then nothing came of it, you go right to the final couple of puzzles. This is a waste of money and time, don't purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "The start was amazing, but then the logic tasks became obscure and based on assumptions. The moment that you had to pick the door that was not correct was the last time the game had my attention, because it just used that now. The game took itself a bit too silly for the atmosphere it was going for. I'd blame the flat joke artist.  If you are looking for a puzzle, this is not it, the trailer pretty much shows all the doors. This is a little walking simulator 'trip'. It's okay, but i was left disappointed. ",
            "review_score": "-1"
        }
    ]
}