{
    "app_id": 395420,
    "name": "The Dwarf Run",
    "release_date": "2015-10-21",
    "developer": [
        "Alexander Mirdzveli"
    ],
    "publisher": [
        "Alexander Mirdzveli"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 11,
    "positive_ratings": 87,
    "negative_ratings": 32,
    "price": 5.99,
    "description": "The Dwarf Run is an old-fashioned RPG featuring turn-based combat, elements of point-n-click adventure and intriguing story line.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/395420/header.jpg?t=1508178122",
    "minimum_requirements": "OS: Windows XP Processor: 2Ghz dual-core Memory: 1 GB RAM Graphics: Intel HD Graphics 4600 DirectX: Version 9.0a Storage: 3 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: 2Ghz dual-core Memory: 2 GB RAM Graphics: Geforce GTX460 or better DirectX: Version 10 Storage: 3 GB available space",
    "reviews": [
        {
            "review_text": "I'm only four hours in, but I'm really enjoying the game. At first, I was like Iceywind1980 and was about to give up on the game; it ttook me 30 minutes, or so, to get going and figure out how to play. Also, the default difficulty setting is 'Difficult,' but you can change it in game. The fusion of point-and-click and rpg is really succesful. Solving inventory puzzles, searching the enviroment, and talking to things is really just as essential to your progress as combat. The writing is very good and never fails to entertain; party dialogue also frequently gives subtle clues as to how to progress. The graphics and animations are good, for this type of game, and add to the enjoyment. The game runs pretty smoothly and load times are minimal. The rpg mechanics are pretty sophsticated for a modestly priced game like this; for instance, your characters earn combat experience based on how much damage they did in the fight. Also, turd zombies. A very enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Know what this is, and the good and the bad, before you buy it. Then read DerWizard's review because it pretty much covers most of what I was going to say.  Yeah, the camera is wiggy. Yeah my 11+ dex ranger with 83% hit chance misses eight times in a row and does minimal damage per hit. (*maybe the random number algorithm is borked. . . maybe) And yeah, some of the spells are half useless because some enemies are immune to some of them and others simply don't work the way you might think the work. Most of that can be dealt with by adjusting tactics or, in the event that you just can't buy a frigging hit, load and re-play the fight.  It certainly is not perfect, but it's challenging and I have fun playing it. As often as the random number generator kicks me in the teeth (83% chance missing 7 or 8 times in a row. . . I know. I know. It happens, but it's annoying) I also have had success in some encounters by changing tactics. Many games reward the rinse/repeat and don't think about it tactical combat style. This one, in some fights and encounters, does the opposite. It seems to reward you for doing different things. For example, I made one fight way, way easier by doing one simple thing. I went from getting stomped into the mud on the first attempt to an easy, easy win on the second. And this particular fight is known to be nasty. The walkthrough actually informs you that it's hard, and suggests using consumeable items. And no. I didn't cheat. I also read the walkthrough for that section *after* I finished the battle. Shame on you! (just kidding)  Anyway, I like that a different approach to some fights can make the fight harder or easier depending on what you choose to do. It is not necessarily always required. If you want you can keep hammering away using the same tactics and *eventually* the random numbers will come up in your favour. Or you can change your tactics and make the fight a bit easier. Usually.  I'm having fun with it. It was cheap. I've paid more and gotten less out of a lot of other games. It's challenging, but not always for the right reasons, however the dev (yeah, to the best of my knowledge it is one person) is tweaking game balance fairly frequently right now and added tips to the game reminding people that certain stats, like constitution, are essential to success later on.  Perfect game? Not even close. Fun? Usually. Challenging and frustrating? Both, sometimes. Linear? Yup. Good story? Up to you to decide, I think it's pretty basic but does the trick. Good writing? Not particularly for me, but I read a *LOT*. The dialogue has made me laugh more than once. Great graphics? No... but they work. You can tell what things are supposed to be.  Recommended? Yup, 'specially if you know what you're buying *and* get it on sale. I'd argue it's worth the base price, however if you're not sure just wait for the next sale.",
            "review_score": "1"
        },
        {
            "review_text": "I wish this game existed earlier, just so it could have made an impact by now. Seriously:  +Point and click RPG. Why is this genre combo not more in vogue? Best combo since bread and butter. (Please tell me more about games in this genre) +Silly humour and good story yesplsthx +If you're a dumbass like me who somehow always manages to mess up the characters' stats in RPGs, YOU GET TO RESPEC. I loved Guild Wars for that, and I love this game for that too. +Instant Travel! Already better than 80% of both Adventure AND RPG games #notimetowalk +Auto combat can be toggled on/off. Saves a lot of tedium for me personally. (I'm playing on easy though so ymmv).  Neutral things imo: +/-Paper Doll equipment if you're into that +/-No voice acting but hey, you could always use your imagination. Make the wizard talk like a New York '20s gangster cause why not.  Might turn off some people: -Admittedly, these guys aren't gonna win any beauty contests, but that's just like in Real Life™.  No other complaints so far but I'll edit if I encounter them.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game.  The first half of the game is well developed. It has the right pace, the right mix of exploration, combat, adventure and whacky dialogue. More dialogue and interaction would be appreciated. Character development is well done.  And putting it nicely, I really hope the dev learned a lot concerning game design, since the 2nd part of the game, the arena, is awful. Not only too many fights, it also needs some adventure, dialogue or plot between the fights.  Graphics are indie, but since this is an oldschool game I really dont understand all the dislikes. It is almost like people cannot read, because it is advertised that this game has NO cutting edge bloomy grahics. Besides there are screenshots. Why complain when you get EXACTLY what was proposed?  Despite the arena, this game gets a solid recommend, because I like oldschool whacky dialogue more than that pseudo-realism of Witcher and Elder Scrolls or boring characters like in Mass Effect.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun came. Until you get to the Dwarf Run part, that is, at which point it simply becomes frustrating.  It's still a good run for your money until then.",
            "review_score": "1"
        },
        {
            "review_text": "The UI was too bad to suffer through for long for what appears to be a badly written, mediocre game.",
            "review_score": "-1"
        },
        {
            "review_text": "if you are looking for a fun game this is not it ! I like to play games I can beat in easy mode if I want to . even the easiest mode on this game is nearly impossible. where is the store to buy more arrows , where is the boulders to replenish what you have used . The magic cant be used over and over . The monsters should be easier to defeat in the leisure mode . If this is what you call easy I dont think I will be playing it any longer . Make it hard in Hard mode . NOT LEISURE. make supplies available . This game is not for easy playing its for hardcore players only.",
            "review_score": "-1"
        }
    ]
}