{
    "app_id": 39560,
    "name": "Painkiller: Resurrection",
    "release_date": "2009-10-27",
    "developer": [
        "Homegrown Games"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 90,
    "negative_ratings": 181,
    "price": 8.99,
    "description": "William &quot;Bill&quot; Sherman has a problem - he's dead. Blown to pieces by his own C4 payload, which he wanted to eliminate a South American druglord with on behalf of some shady secret service people.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/39560/header.jpg?t=1533041362",
    "minimum_requirements": "OS: Windows XP / Vista / 7 Processor: 2.4GHZ+ (per core) Memory: 2GB or better Graphics: Radeon 3800 / Geforce 7800 or better DirectX®: 9.0c (included) Hard Drive: 6GB Sound: Required",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Don't get me wrong, I love this series. Running around shooting swarms of crazy looking enemies with crazier weapons is both hilarious and a massive adreniline rush. This particular game, however, was built by the fans and it shows. There is little or no direction to the only way out of any level and the monsters are put into senarios that don't play to their strengths or themes. Skip this one, play the other Painkillers instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Please don't play this",
            "review_score": "-1"
        },
        {
            "review_text": "this is by far the worst pankiller ever made. it is buggy and glitchy like hell. The guy that made it just didn't have enough experience making levels interesting and fluent.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awful. Level design is horrendous and filled with many bugs. I often find myself not knowing where to go as the levels this time around are hugeee. Sometimes I wander around aimlessly, only to stand at a specific point to trigger the next wave of enemies. Another thing that irritates me is how everything seems to be randomly put together. The enemies in the levels from the original and Overdose fit well with the environment, however in this one they do not. Avoid like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "man this is some ♥♥♥♥♥♥♥t",
            "review_score": "-1"
        },
        {
            "review_text": "Not sure why people hate this game so much. this is the only painkiller game that actually has exploration and large open areas to search . it may be buggy but the level design is strange and makes you feel like you are in hell. much better levels than the industrial areas that made no sense in the original.",
            "review_score": "1"
        },
        {
            "review_text": "This has a open area and has very less levels than the previous installments. However, they added ALOT of monsters which helps enjoy the carnage despite the small levels. This truly gives off the Doom feeling when you are fighting a huge army of monsters. I also like the comic story, and its pretty cool to have cutscenes often. Its rather a bit easier than Overdose and the tarot cards are useful and fairly rewarding. But its fun if you are up for more mindless shooting.",
            "review_score": "1"
        },
        {
            "review_text": "I got this because I liked all the other Painkiller games/dlc. But after playing this I found that I didn't hate it but I didn't like it either. It's not bad bad but it's just not as good as the others before it but what can you expect for $2",
            "review_score": "1"
        },
        {
            "review_text": "More open format than the first two, over all good",
            "review_score": "1"
        },
        {
            "review_text": "good game love the story line its like a comic book and game play is very easy and i love how evil it is",
            "review_score": "1"
        }
    ]
}