{
    "app_id": 395850,
    "name": "Bear Simulator",
    "release_date": "2016-02-26",
    "developer": [
        "Farjay.com"
    ],
    "publisher": [
        "Farjay.com"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Adventure",
        "Simulation",
        "Memes"
    ],
    "achievements": 24,
    "positive_ratings": 348,
    "negative_ratings": 69,
    "price": 10.99,
    "description": "It's a game where you play as a bear and explore stuff.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/395850/header.jpg?t=1456881327",
    "minimum_requirements": "OS: Windows 7+ Processor: 1.8 GHz Intel Core 2 Duo or equivalent AMD CPU Memory: 2 GB RAM Graphics: 256 MB with Pixel Shader 3.0 support Storage: 4 GB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": "OS: Windows 8+ Processor: 2.4 GHz Intel Core 2 Duo or equivalent AMD CPU Memory: 4 GB RAM Graphics: AMD/ATI Radeon HD4850 512 MB or greater / Nvidia GeForce 9800GT 512 MB or greater Storage: 4 GB available space Sound Card: DirectX 9.0c compatible",
    "reviews": [
        {
            "review_text": "While far from perfect, the game is an entertaining exploration experience. With some support, the developer could go on to polish a few things and make an even more enjoyable game (with some improved combat and hopefully no getting stuck, which was rare but annoying). However, the internet prefers to just shoot people down, and I imagine they still would if the game was only five dollars, or two dollars, because where's the fun in supporting someone's genuine hard work unless it's perfect the first time you see it?  If you're uncertain on the game, but are attracted to the exploration and/or silliness, feel free to wait for a sale, but don't pass the game off completely. If you're reasonably certain about it, buy it! If you expect non-stop action and violence in your games, and state-of-the-art graphics in your indies, you are in the wrong place.",
            "review_score": "1"
        },
        {
            "review_text": "This game, in my opinion, was fun. If you're into scavenging and exploring, and seeing stats grow, this is the game for you. The whole game could use some polishing though. The hitboxes for animals are god awful, and the platforming is a bit wonky. The jump button doesn't always respond either. Overall, good exploration game.   And if you're gonna make a platforming gauntlet section, for god's sake fix your platforming and controls first.   Edit: Recent updates made the hitboxes better. Glad to see feedback is taken seriously for this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've played many games that let you turn into a bear.  This is the first game I've played that lets you   be   a bear.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I need a distraction when I take a break (I work at home), and while I most often prefer fantasy RPGs, I have found Bear Simulator to be a delight.   Is it a 'casual game'? Yes, but there's nothing wrong with that.  Does it have a few bugs? Yes, all games do.  Is it a game I can become engrossed in, that I find slightly absurd in a delightful way? Totally. I lose myself for hours in the world.  I really hope the developer realizes that he does have a lot of fans, that the game is a joy for many of us, and that we'd love to see add-ons.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun, silly, creative game for players that like exploring, mysteries and adventures. You are pretty much dropped into bear life and figure things out on your own, so be warned, you are going to be a bit confused to start. If you are a compulsive explorer, collector, and love poking thing with your giant bear paws you will enjoy this. All made in a one person studio!",
            "review_score": "1"
        },
        {
            "review_text": "I adore any game that lets me be an animal, and this one gives more than just an animal simulator. You get to wear hats, eat tons of food without the calories, and kick Big Foot's butt, all while learning a little about your ancestors' history. The NPC animals in the game, though you don't actually see them, have great personalities and sometimes actually give useful advice.... sometimes... There's plenty to explore and munch on... and also in-game goodies to fill your den with. If you are curious or interested about the game, try it. You may just end up liking it.",
            "review_score": "1"
        },
        {
            "review_text": "GOOD -------  -You can play as a bear (that's actually the point of the game) -You can collect things what is pretty cool -Other simulator things  CONS ------ -Damn it's not really a simulation game you can't survive like a real bear in the wild (Why? I'll explain now...)   -First you can eat only one time a mushroom 'Look I found a mushroom! Well damn bear you'll never be able to find me ever again!' -Hunting animals too only one time 'Hm where did all the animals go?!' -Alpha was better, there you did have hunger and it was more like a real bear game -After a time you have nothing to do anymore, but it's still a good game -There will be only one more update then this game will be not further developed. WHY?! -It's only 5$ worth not more (really)  ---------- He will not anymore develope this game, and it was long ago finished (from my sight) it could be already released when it was in alpha then it would be just early access. Alpha was more interesting than this here, and the most are disappointed right now what they play here for a crap now. ---- 6/10 Stars right now, if it would be alpha this game would have 10/10 Stars but ♥♥♥♥♥♥♥ no. Not happy with my opinion, then why are you reading this? (yeah my english is bad) ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game its simple and fun with plenty to do and explore.",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice chill game to enjoy while waiting for your buddies to finish a round of whhat ever game they're playing. It's a simple game that has thousand possiblities depending on the way the developers progress it.  To other reviews saying that there is no map, there is. It's pretty close to the den and although crude, once you get your bearings and screen shot it, finding your way around is no problem.  I personally love these alpha games so I can enjoy the development of the game and it's content. It's a decent pickup right now.",
            "review_score": "1"
        },
        {
            "review_text": "This game some how manages to make me play it even though there are newer games. I'm nominating this game for the Test of Time Award!",
            "review_score": "1"
        },
        {
            "review_text": "I never review games. I just play them and either think 'hey cool' or 'wow this sucks'. I adore this game so much, i need to review it. Words cannot express my love for Bear Simulator. It has a really great price and nice gameplay, plus the obvious bonus of BEARS! and cool hats. glasses also if thats your thing. I am very excited to see more updates in the game, as I have almost completed everything there is now.",
            "review_score": "1"
        },
        {
            "review_text": "If I had to describe this game in one word, I'd say it's 'Cute.' If I had to describe it in five, I'd say it's 'Cute, but a real mess.'  As a well-known lover of bears, I followed and backed the Kickstarter. I was curious to see what it was going to be like, and was interested in the developer's sense of humor. The dry and inoffensive humor is the game's shining feature, as each example of writing in the game has a sort of cute and casual cadence to it that actually had me looking forward to the next item description or animal smell. It's such a shame that the actually interesting things to look at are hidden behind [long stretches of incredibly ugly textures and] (note: this is no longer an issue) z-fighting shadows (even on the highest graphics settings), very difficult 'enemies' with incredibly small hitboxes, wonky platforming, and [obnoxious stat barriers] (note: this is no longer as big an issue). I found a door in a place called Nido Valley (A Dark Souls reference?) that required 777 in a certain stat and something called Bear Courage, [and even eating mushrooms would require you to have a high enough Intelligence stat] (note: this is no longer an issue). Also, and I don't really know how to describe this, but the trees wobble. I think that the trees react to your view bob differently depending on how far away they are. Bizarre. (note: I have been informed that this is an engine limitation. It's still weird, though)  As a developer's first game, it's a nice little prototype/practice for what could possibly be described as a 'real' game sometime in the future. I'd be interested in reading a wiki for this game, but I absolutely do not have the patience to write it. Maybe pick this up if you really love bears and simple jokes, and have a lot of time to waste and don't mind walking simulators.   Edit: As of March 3rd, Farjay released a patch upgrading the texture qualities and removing the stat requirements on food. Although there is still a significant amount of Z fighting on shadows (Z fighting is where two textures that occupy the same space overlap each other and fight to be seen), these updates fixed the two biggest problems I had with this game. The game is actually pretty good looking now! I am now upgrading this to an uniornic recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME. If you have any sence of humor. I absolutely love it. Everything about it is cool and well thought and really funny. Its sad that the dude who made it said that he aint goona support the game no more.  ♥♥♥♥♥ haters.",
            "review_score": "1"
        },
        {
            "review_text": "As much as I like the game, I'm disappointed I'm still seeing reviews of the developer apparently giving up on the game, and marking it as a lost cause. Seriously, if you're really going to be that sensitive about reviews, then you're not mentally fit to be releasing games at all.",
            "review_score": "1"
        },
        {
            "review_text": "I'm trying to understand why people are so upset about this game (the negative reviews, at least). Many of the funders knew that (1) this is a bear simulator (2) this was Farjay's first real game and (3) the game was more than 3x overfunded, which is not a good thing. You couldn't go into this expecting a 100k game made by an indie professional, and if your negative review is negative because it isn't a game you'd normally pay ~$20 for, then you came in expecting the wrong thing. This game is called Bear Simulator, and it is exactly that.  We start off waking up from hibernation (by that I mean the extra year of development the game took, much of which was without any updates - which I am not using to affect this review) in a bear den. You explore the world, which is surprisingly large and detailed, looking for food. There are a lot of random things to find (e.g. boards that have Bear Facts on them, random signs that have been graffitied), and I've enjoyed reading pretty much everything. Farjay's humor was what originally drew me into the game (other than my love for bears), and the game is rife with it. I personally quickly found myself acting like a bear - all I cared about was finding food. Everything is pretty much about eating in this game, which is pretty much realistic for a bear coming out of hibernation. Granted, the game effectively becomes a big ol' collectaphon, but I've enjoyed the constant need to stuff my bear stomach. Food gives you stat bonuses, and these bonuses help you in your exploration (and subsequently adding more interesting foods to your culinary repertoire. It's fun, it's silly, and it's very bear-like.  Unfortunately, the game does suffer from a few issues:     There is no map, which makes the expansive world a bit difficult to explore consistently     There isn’t much food and few animals to kill, which quickly makes the world seems empty. It’s made worse because the food and animals don’t respawn.     Some items don’t really make sense – e.g. some mushrooms require a certain amount of intelligence…which I’m not really sure the reason behind     There are a number of weird clipping issues when it comes to the environment, just random areas where the controls don’t work well, you can’t jump, etc. It seems to be mostly around rock formations and cliff areas.  These were my biggest issues with the game. Otherwise, this is really just a bear simulator with some bonus things in it. It isn’t much like Goat simulator, which many people seem to have expected it to be. ",
            "review_score": "1"
        },
        {
            "review_text": "You get to be a bear. It's awesome. Eating mushrooms. Eating Ducks. Life is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I actually am very near to completing the first level, and, i have to say, it wasn't at all what i expected. I thought you just had to find food to survive, i wasn't expecting it to have adventure, puzzles, quests and prizes. DJ Raven was hilarious, and the ancient cave is really vexxing, but fun.  The only thing i can say is that this game would be SO MUCH BETTER if we had a map, and tutorial on how to use strength, upgrade our bed, etc. I know the game was just released today but, it is really aggrivating to try and remember how to navigate back to entrance zones for different areas. I had to make 3 bears before i finally resigned to staying in armani falls for about 4 hours. loved the anceitn ruins, very zelda-meets-kungfupanda, loving it.  I also noticed that if you get stuck somewhere, twice i got stuck on logs, you have to exit, and it's a real pain if you haven't saved. An autosave function would be rad.  love the mysterious humans with the fallout feel, great game, loving it so far.",
            "review_score": "1"
        },
        {
            "review_text": "You are a bear and you run around and eat food.   That is the game.   It is suprisenly enjoyable though, the enviroment is fun and you get to be the best animal to ever exist. Exploring the world and getting more bearlike is what makes this game fun.  The game is a little buggy though and the combat is a bit wonky. That is part of the charm though.  Overall I enjoy this game - I see myself putting another 4-6 hours as the world is pretty big and there is a lot to explore.",
            "review_score": "1"
        },
        {
            "review_text": "After waiting quite a while for this game it finally came through and I am very pleased with the results! I personally would like a little more direction, but I think as a base it is fantastic and I hope the creator continues to improve and add more.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "I was backing this as a joke, not expecting too much, but I must say I am pleasantly surprised. There are a few hitbox issues but all in all this is a neat tongue in cheek exploration game. I am not sure that there is a lot of replay value but you get a couple of hours gameplay. ",
            "review_score": "1"
        },
        {
            "review_text": "This is the best god damn bear game I've ever played. It's a little buggy and such sometimes, but well worth the price. If you love bears you should get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Rated 9.9/10: Fountain keeps making me need to pee.",
            "review_score": "1"
        },
        {
            "review_text": "pros:I LOVE BEARS,cool story,veryed places,useful friends,funny as heck cons:bad jumping, looks like a PS2 game, collision is broken at times  I still love this game and i can't recommend this game more ps: devs if you are reading this add a volcano area to the game pls ",
            "review_score": "1"
        },
        {
            "review_text": "don't know what i expected, the overwhelmingly positive reviews kind of swayed me. The graphics aren't great, the physics aren't good, the fighting sucks, and you get stuck in walls or on ledges all the time.  The whole game is basically you looking for stuff and occasionally being rewarded with a lame meme, crappy pun, or whatever. There were a few funny moments. A few cute moments, but most of the jokes are just kinda dumb and really not worth crawling around and getting stuck on garbage for 20 minutes. Maybe I'm just old and bitter, younger kids will probably get more of a kick out of the humor, either way, absolutely not worth 14$. I wouldn't pay more than 5.",
            "review_score": "-1"
        },
        {
            "review_text": "Fair warning: It's not that pretty. There's no map. Sound needs work. Combat is clunky.  It's a good exploration game if you're into that sort of thing. Thankfully, I've been playing the ♥♥♥♥ out of Solas Project for the last week, so lucky for me, I am totally into that sort of thing.  It takes patience, but if you're used to older games, you should do fine in Bear Simulator. Plus if you have patience, all your stats are at 100 and you no longer care about mean aligators. Collect/Eat EVERYTHING!  Edit: Game is not done, there's places you can't get to yet but the dev has said he's not going to work on this anymore so do not buy. It will be a dead game.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game. I've actually been following this game off and on since I saw the kickstarter. I thought that I had found a game that would be a giant hit like Goat Simulator was when it came out. You know, something that doesn't take itself too seriously, and is mostly there for you to laugh at its absurdity. By looking at the website before this game came out, it seemed like this game was heading in a good direction. There were jokes everywhere; and they were actually pretty funny.   So naturally, when the game came out, I bought it. I was ready to be a bear.   ....I quit after 1 hour.   Why? Because there's nothing to do. In that one hour, I walked around a world that was more barren than anything I'd ever encountered in games like Fallout, which are SUPPOSED to be barren and devoid of life. I killed two rabbits, which I was only able to do because they got stuck on terrain, one duck, and then died to a fox. A fox....the natural enemy of the bear, obviously.   The game mostly consists of this: Walk around and try to find something to eat. Oh, is that an apple on the ground? Eat it. Yay, some stats went up. Is that another apple? Eat it too. Yay, some stats went up. Is that a plant of some sort? Eat it too.  You cannot eat this plant. You are too stupid.  Yes, you can apparently be too dumb to eat things. Things that you REALLY NEED TO EAT so that a fox doesn't kick your ♥♥♥ in a fight.   Now, you may be reading this and think 'Well gee, I dunno, that  sounds  like it might be kinda funny.  Trust me, it's not. It's extremely tedious. You can walk around forever and not find anything to interact with. The highlight of my gameplay was finding a hat.   PROS:   You are a bear.    You are smart enough to eat an apple without killing yourself.    There is the occasional funny sign to find.    I found a hat.   CONS:    World is so barren that it looks like the apocalypse just happened and they didn't take the bears with them.    Graphics look like something I'd find on a PS2 game in the year 2004. A lot of things, such as hills, just look like extremely stretched textures.    Hit registration is off. In combat, I died to a fox because my right paw REFUSED TO HIT ANYTHING, EVER!   THERE IS NOTHING TO DO. - This is the biggest drawback to the game. There is literally nothing to do. If there were more animals to kill, more places and secrets to find, more funny things in the world itself, and you weren't so stupid that you risk killing yourself if you eat a mushroom, then the game has the POTENTIAL to be fun. As of right now, the game is a chore to play. I bought this with the intention to start make a YouTube series out of it, but there was so little actual content in the game, that it was just incredibly boring.    Overall score: 2/10 - Would not bear again.",
            "review_score": "-1"
        },
        {
            "review_text": "This is terrible. You basically wonder around at eat food till you get 'smarter.' The terrain is hard to navigate and cn't really attack anything without being on top of it.  I hate that I paid 50 for this on the Kickstarter.",
            "review_score": "-1"
        }
    ]
}