{
    "app_id": 396060,
    "name": "The Rose and I",
    "release_date": "2016-04-05",
    "developer": [
        "Eugene Chung",
        "Jimmy Maidens",
        "Terry Kaleas"
    ],
    "publisher": [
        "Penrose Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "VR Support"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "VR"
    ],
    "achievements": 0,
    "positive_ratings": 142,
    "negative_ratings": 18,
    "price": 0.0,
    "description": "An immersive, animated VR film. Crafted by the artists, animators and storytellers of Penrose Studios, “The Rose And I” is about loneliness, friendship, love, and loss. Come meet a lonely Rose living in the unlikeliest of places, and join her as she transports you to a brand new universe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396060/header.jpg?t=1477448823",
    "minimum_requirements": "OS: Windows 7 Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: NVIDIA GTX 970 DirectX: Version 12 Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is just a short little movie really. It's sorta like being inside a claymation movie where you can look around at all angles. It's not that impressive after you've been using VR for a week but if it was your first try at VR it would be pretty cool. But again, it's really short.  Download it, check it out, go 'ooh neat' and then forget about it until you want to show off the VR to someone else.",
            "review_score": "1"
        },
        {
            "review_text": "There is no way that this was $4.99  woth one visit and thats it.",
            "review_score": "-1"
        },
        {
            "review_text": "short, sweet, kinda cute. Good use of VR for positioning.  I do wonder how this film looks if you're very short or very tall, however...",
            "review_score": "1"
        },
        {
            "review_text": "It's a quick short film that left me wanting more. I really enjoyed it and loved that I could see the character from all angles. Great job with this one.",
            "review_score": "1"
        },
        {
            "review_text": "Very well done and creative look at part of \\'The Little Prince\\' done in VR. I really love what they have done with lighting and scale. I also enjoyed being able to get really close to the the little guy on his planet to check out the fine details and animation. You can\\'t get that experience anywhere but in VR. Lean way in and walk around a little as this is room scale. Overall a nice short animation demo to show people (it\\'s not a game) and a very artistic and well done short that is well worth your time. I would love to see more like this.",
            "review_score": "1"
        },
        {
            "review_text": "Viewed on HTC Vive  Its very cute, I show this to everyone i demo the vive for.",
            "review_score": "1"
        },
        {
            "review_text": "Neat short video!",
            "review_score": "1"
        },
        {
            "review_text": "Very beautiful experience. Making it free is very generous. I would gladly pay a couple bucks to support more experiences like this.",
            "review_score": "1"
        },
        {
            "review_text": "It's similar to watching a Pixar short but you get to be the camera and walk around the scene and view it as you please.  This was actually a hidden treat in my libary of VR titles. Will be on the lookout for their next release.",
            "review_score": "1"
        },
        {
            "review_text": "short, sweet, kinda cute. Good use of VR for positioning.  I do wonder how this film looks if you're very short or very tall, however...",
            "review_score": "1"
        },
        {
            "review_text": "Short and simple VR Film.",
            "review_score": "1"
        }
    ]
}