{
    "app_id": 396230,
    "name": "VERSUS: The Lost Ones",
    "release_date": "2015-08-21",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Text-Based"
    ],
    "achievements": 86,
    "positive_ratings": 138,
    "negative_ratings": 28,
    "price": 2.89,
    "description": "Steal alien powers and absorb their memories! Can you outlast your opponents to escape from planet Versus? An epic adventure in a new galaxy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396230/header.jpg?t=1538615537",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This novel was a fantastic read for anyone who enjoys alot of backstory ,which will keep you hooked for hours. I would like to see the rest of the books to come out as there are so many questions i am dieing to find an answer to.",
            "review_score": "1"
        },
        {
            "review_text": "It reads like average fan-fiction. The author gives Shakespeare a run for his money at making up words.",
            "review_score": "-1"
        },
        {
            "review_text": "Another fun adventure from Choice of Games!   The worldbuilding is a little over-complicated and sort of hard to get into at first, but after that, the story picks up and is honestly intriguing.   Be warned, though, this is apparently just the first in the series so it does end in somewhat of a cliffhanger for the story. If cliffhangers aren't really your thing, maybe want until other installments of this game are out, which the author (is that the right word for this situation?) says will be out in a timely manner.   Overall, it's a thrilling science fiction story that I burned through very quickly and am eager for more!",
            "review_score": "1"
        },
        {
            "review_text": "Good and detailed writing. Can't wait for the next one.",
            "review_score": "1"
        },
        {
            "review_text": "I've played a lot of the texted based games by Choice of Games and I really enjoyed this one as well as the others that I've played. It's descriptive and very entertaining. The only thing that I would say is confusing is the stat screen, it has a lot of info to take in, but it's easy to get used to. These are some of my favorite games to play and I cannot wait for the next one to come out.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  I love this series, just as I adored the Hero's Rise trilogy. It has to be one of the best adventure novel pieces I have ever picked. The story draws you in, giving you a look into a totally new and original galaxy with interesting beings and politics. The characters are well thought out and widely different, it is hard to choose who your favorite is and why. Similarly, such things can be said for the romances, which I found myself conflicted upon picking between any one character. Every choice has a consequence and it is very easy, yet also challenging, to paint yourself as any singular sort of being. Are you a manipulative and evil jerk bent on achieving his own desires? Are your decisions based on love, or a singular political focus? I won't divulge anything about the story itself, spoilers would be heart breaking when considering such a interesting piece of work. The only reason I hesitate on giving it a full ten stars is simply due to my desire to see the romances flushed out just a little more. But, hey, that is my own pickiness showing, I due tend to favor handsome characters and sweet words. Try it out, you will probably like it.~",
            "review_score": "1"
        },
        {
            "review_text": "Anxiously awaiting the next episode.",
            "review_score": "1"
        },
        {
            "review_text": "Really good and intresting but a little bit to many made up swear words and a bit to much sci-fy mumbo jumbo",
            "review_score": "1"
        },
        {
            "review_text": "This is written by the same person who brought you the Hero Rise Trilogy.  As soon as you start you can tell that a lot of effort has gone into the story. You start off on your home planet who is at war with an evil swarm of Blots. You are a soldier on the front line until you are suddenly taken to a stange new world.  There are plenty of romance options once you appear on the Versus world.  On this world you you are soon given a choice to help one of two sides on this world, you have to manage the political situation between the two groups in your choices as well. Your time on Versus changes when you realise that your planets saviour could be on this planet.  Cannot wait for the next one 5/5. ",
            "review_score": "1"
        },
        {
            "review_text": "There is a lot of worldbuilding and thought put into this game. The storyline is also fairly well developed, with significant choices available. My one complaint is the abundance of technobabble, but that is a matter of taste. The technobabble honestly helps support the setting. The beginning was a bit hard to get through at first, but a chapter or two in and things move along quite smoothly.   The writer of this game obviously learned a lot from his previous series, and I look forward to seeing where this one goes too.",
            "review_score": "1"
        },
        {
            "review_text": "A slow start, but builds to a satisfying second half and conclusion. Bring on book 2.",
            "review_score": "1"
        },
        {
            "review_text": "I really did love this game! I've loved all of Zach's works and this one was no different. The game was really interesting and I've played it twice already! I do recommend this if you've played the Heroes Rise Trilogy or just enjoy Choose Your Own Adventure games in general!  However, the only complaint I really have about this is that it didn't feel complete. The ending left me wanting more but not in the sense of 'I hope he realeases the next one soon!' and more 'Wow that ended way before I felt like it should have.' It felt more like one chapter of an entire book or 1/4 of an entire game if you know what I'm trying to say. The way the game ended felt lackluster.",
            "review_score": "1"
        },
        {
            "review_text": "Great game(?). Just play/read it. Its an awesome peek at whats going to be a very fuffilling story and it cost no more than lunch by yourself. You can skip lunch for one day right? You won't go wrong. The heartfelt effort reflects off of the quality games(?) like this exude, its something I'd very much recommend to anyone who likes narritive driven stuff, (good) books, or just fun/unique experiences. Fair warning though, there is some sometimes pages worth of fluff to go through but if you can filter that it shouldn't detrack from your experience.",
            "review_score": "1"
        },
        {
            "review_text": "Thus far I am quite impreesed with Versus, albeit new to the CYOA style of games this was a very fun 7 Hours (crazy 7 whole hours of reading, more fun then I thought). So yeah if you have the time and patience and enjoy games where your choices in life can alter you gameplay in an instance this is one to check out, and I can't wait to play though book 2!",
            "review_score": "1"
        },
        {
            "review_text": "This game was alright. There were a few times when the rather jumpy story and odd choices of words made my head spin but I enjoyed it all the same.  Would probably get the next game too, just to see where the story is going.",
            "review_score": "1"
        },
        {
            "review_text": "An epic start, to an ejoyable read I can't wait for the next book.",
            "review_score": "1"
        },
        {
            "review_text": "A great read to kill time.",
            "review_score": "1"
        }
    ]
}