{
    "app_id": 396360,
    "name": "LocoSoccer",
    "release_date": "2015-12-09",
    "developer": [
        "Startreming"
    ],
    "publisher": [
        "Startreming"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Sports",
        "Indie",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 129,
    "negative_ratings": 64,
    "price": 0.75,
    "description": "LocoSoccer is a fun, crazy physics-based soccer game where you must do a lot of goals to win cups and accesories for your team. Your objective is easy: win all cups with your goals. How awesome is that?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396360/header.jpg?t=1492976652",
    "minimum_requirements": "OS: Windows XP, Vista, or higher Processor: Core 2 Duo or equivalent Memory: 512 MB RAM Graphics: Intel HD 4440 or better Storage: 100 MB available space",
    "recommended_requirements": "OS: Windows 7, 8, 8.1 or 10 Processor: AMD Phenom, AMD Athlon, Core i3 or better Memory: 512 MB RAM Graphics: Dedicated GPU with 512mb or more Storage: 200 MB available space",
    "reviews": [
        {
            "review_text": "GAME PROS:  Incredibly cute graphics! Fun sounds, really liked them Controls are pretty decent Moving around on the soccer field feels normal/real The physics FEEL REAL Hilarious game!  GAME CONS:  The tutorial - WTF! The tutorial is EASILY harder than the game itself! Switching players. Oh, you'll see!!!  I would say 9 yellow stars out of 10. BUY THIS NOW! ",
            "review_score": "1"
        },
        {
            "review_text": "Lowcoball( crazy physics-based soccer game ) is a funny game to play with friends ( local ) or with the AI!  Pros- Very nice soundtrack A lot of fun with SHIFT Customization of players and balls A lot of teams with custom stats(even with names for each player!) Cons- Some bugs, that will probably get fixed in future patchs",
            "review_score": "1"
        },
        {
            "review_text": "Very fast paste good game, graphics 10/10, gameplay xd/10  Full game: 8 sieg heils/10",
            "review_score": "1"
        },
        {
            "review_text": "I dont think this game is finished yet...",
            "review_score": "-1"
        },
        {
            "review_text": "Its not bad, but please make instructions cause i dont even know what im doing",
            "review_score": "-1"
        },
        {
            "review_text": "wasnt expecting a lot and was still let down.",
            "review_score": "1"
        }
    ]
}