{
    "app_id": 396320,
    "name": "Tank Battle: 1944",
    "release_date": "2016-03-01",
    "developer": [
        "HexWar Games"
    ],
    "publisher": [
        "HexWar Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Hex Grid",
        "Turn-Based Strategy"
    ],
    "achievements": 18,
    "positive_ratings": 25,
    "negative_ratings": 12,
    "price": 6.99,
    "description": "Instantly get involved in the action by joining the Allied invasion of Europe during the Second World War. Take command of an American battle group during WW2 in this turn based strategy wargame and help liberate Europe from the evil Axis power-base!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396320/header.jpg?t=1467824418",
    "minimum_requirements": "Минимальные: ОС: Windows Vista Оперативная память: 1024 MB ОЗУ",
    "recommended_requirements": "Рекомендованные: ОС: Windows 7 Оперативная память: 2048 MB ОЗУ Видеокарта: Discrete graphics with 256 MB or more VRAM",
    "reviews": [
        {
            "review_text": "A fun little 10$ turn based stratagy with some interesting mechanics, such as moving and shooting, flanking, and terrain effects. Reminds me of my first gaming days surfing the web and finding things like flash games such as Warfair 1917 and 1944. Good tutorial and lots of campaigns. A very solid game with a good price tag for what you're getting. Almost a rarity these days with 60$ titles releasing with huge amounts of bugs.",
            "review_score": "1"
        },
        {
            "review_text": "Tank Battle: 1944 ... Is not a bad little game. You can get your feet wet here just to get the feel of board game and strategy.  My only complaint is in the single player mode The PC moves the apposing units (way !!!) to fast !! . Bam !! and there they are ... magic ! There is no way to slow them down to make them act and feel like the movements of real tanks. I do like the game ... its down and dirty ... Love it",
            "review_score": "1"
        }
    ]
}