{
    "app_id": 396310,
    "name": "Masochisia",
    "release_date": "2015-10-09",
    "developer": [
        "Oldblood"
    ],
    "publisher": [
        "Oldblood"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Captions available"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Horror",
        "Story Rich"
    ],
    "achievements": 0,
    "positive_ratings": 268,
    "negative_ratings": 40,
    "price": 5.59,
    "description": "A young man discovers through a series of hallucinations that he will grow up to become a violent psychopath. How will he respond to these revelations? Can he change his fate? Can you even... change fate...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396310/header.jpg?t=1448335017",
    "minimum_requirements": "OS: Windows 7 with SP1 or later Processor: 3GB Dual-Core Memory: 4 GB RAM Graphics: 1GB VRAM DirectX: Version 11 Storage: 2 GB available space Sound Card: Any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " It's a fascinating game. Something so different that it might not be everyones cup of tea. One question ... are you a terrible person?",
            "review_score": "1"
        },
        {
            "review_text": "A dark and distrurbing game with nice artstyle and story but its biggest flaw would be its length. I was able to complete it in less than 2 hours in my first playthrough, would probably play again but I don't see my time going beong 4-5 hours in any case. There's number of clues and hidden messages in the game which point towards the true story it is based on and various references to the same as well. There are no graphical options to chose from in the game but that didn't matter anyway because it played at 60fps throughout on my potato.   In conclusion, definitely get it if you are a big fan of psychological horror games and the game is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant game. Truly disturbing, it went to very dark places that I didn't expect.  Pros -  +Great disturbing art style +Amazing, touching soundtrack +Soul-crushing story with fantastic writing +Always has a trick up its sleeve. Many WTF moments +PHENOMENAL ending that will have you at a loss for words and keep you thinking about what you've just played  Cons -  -On Act V the game glitched and I was missing items needed to progress. I was able to retrieve them by restarting the chapter, however. -This is a niche game. The content is disturbing to say the least. If you are at all squeamish, or get uncomfortable, you're going to hate this.  Loved it, can't wait to see what's next from this company.",
            "review_score": "1"
        },
        {
            "review_text": "This review may contain spoilers. Not a lot of games can crawl into my head and just make me feel off. While I would recommend this game, I would be careful who I actually recommend it to. I feel like the lack of a choice to divert the story to a different path was actually a good choice here despite what else I've read from others. When you have a serious mental illness it controls you, and often times there isn't a lot you can do about that. So in that sense, the game having such a direct path, but with answers that make you think you have a choice, was brilliant. That's just my view though. It made me feel as if I were actually living through a horrible day in this guy's head, which is why I felt pretty horrible after playing this. There were a few times while playing when I could not pick any answer and I sat hovering over the screen, conflicted with what I should (or would rather not) do.   TLDR; this game is a piece of art in itself, and it leaves a very powerful effect when over. The gameplay, while simple, has a deeper meaning in it in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "I have never left a review for a game. But Masochisia is so astoudning, creepy (withouth relying on jump scare), disturbed and with an amazing sound track to boot. I seriously recommend this game a million times over, I havent binged on a game like this for a long time",
            "review_score": "1"
        },
        {
            "review_text": "Um. Holy crap. Yeah, there are some bugs, and the camera paining is a bit awkward. Pretty straightforward and a fast play. I beat it in about two hours. Some scary bits, but the real chill I got was at the very end. No spoilers, just. Holy crap. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Masochisia is a deeply disturbing game, covering such happy topics as masochism, sadism, physical and emotional abuse, murder and madness. In it's brief runtime it managed to be more horrifying and memorable than many other games several times its length. Every piece of the game works together to create an atmosphere of growing dread and revulsion, not just at the game's dark subject matter but the warped lens it is viewed through. Hamilton, the game's viewpoint character, is a particularly warped individual. The player is encouraged not necessarily to justify his actions, but sympathize with the madness that drives them.   Here's what the game does right:    The art, soundtrack, and subject matter combine to make a unique and memorable psychological horror experience.    The game approaches madness and mental illness in a surprisingly nuanced way, neither glorifying nor entirely condemning the aberrant thought patterns and impulses of the afflicted. It's an interesting approach, given the relative rarity of horror portraying psychosis as more than people who want to stab anything within arm's reach.    The viewpoint perspective, as mentioned above, is well executed.   There are some missteps, however.    Without being told directly from another review, I would have never known the subject of the game was    the serial killer, cannibal, and child ♥♥♥♥♥♥ Albert Fish   and without that knowledge context for much of what occurs in the game is lost.    Every so often the game shows coded messages that are not required to progress but reveal additional information. Someone with little patience or preference for ciphers, such as myself, is consequently left with an incomplete picture of the game's portrayal of its subject matter.    The way the game portrays   the murderous nature of its protagonist as a matter of 'destiny'   could easily be misconstrued as   justifying murder in general   rather than   that being the self-rationalization of a deranged and murderous mind.     So do I recommend this game? If you can withstand it, yes. Will I every play it again? HAHAHAHAHAHA.... no. ",
            "review_score": "1"
        },
        {
            "review_text": "Great stuff. Always good to find something like this out there. This industry certainly needs to tackle more challenging themes like Masochisia does.",
            "review_score": "1"
        },
        {
            "review_text": "Part of me wishes more people have played this game. Im just glad i found it. Thank you for this awesome game.  Allthough id only say to play it if you know you like darker themes.  Im ready to preorder anymore games by oldblood.  JUST REMEMBER I'LL BE WATCHING",
            "review_score": "1"
        },
        {
            "review_text": "A nice little family friendly, narrative driven exploration game where you play the charasmatic hero searching for the answer to a sign he recieved from a higher power. Best played alone late at night with a headset for full immersion.",
            "review_score": "1"
        },
        {
            "review_text": "There's not much to say about this game that hasn't already been said. I finished this game a few days ago and I still can't stop thinking about it. I don't know that any game has had as much of an impact on me as Masochisia has. It's definitely more of an interactive story than a 'game,' but anything more than what it is would have probably lessened the effect of the story. If you're familiar with who this game is based on, you'll catch so many hidden references. If you can handle disturbing games, get this one.",
            "review_score": "1"
        },
        {
            "review_text": "Based on a true story about a very interesting serial killer Albert Fish. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend few games. This one made me few like crap, something no game has ever been able to do. To anyone on the egde about this game. Get it. Few games can comapre.",
            "review_score": "1"
        },
        {
            "review_text": "worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game to completion. I loved every second of it! It's an intense pshycological point and click adventure based on a real story.    Albert Fish    The setting and mood of the game attributes to how intense this can actually get. It keeps you on edge the whole time and then something else happens taking it away, building it back up before a reveal.   I definitely think this game is worth playing the potential of multiple endings is also a bonus!  P.S. Check your desktop.....",
            "review_score": "1"
        },
        {
            "review_text": "Super fun point-and-click game based a little too closely on real life events! Polished graphics and haunting music make this an enjoyable and immersive experience for fans of the psychological horror genre. I only wish it were longer; I completed it in about 2 hours.",
            "review_score": "1"
        },
        {
            "review_text": "My first thought was there was a very unfortunate lack of choice in this game. many of the diologue options were quite limitited and reptitive. I wanted to be the endearing protagonist, but the game just wouldnt let me. It was like I (the player) was being bullied into making choices I didnt want to make, simply because the game didnt facilitate the right choices. This, coupled with the general reptitiveness left me feeling frustrated to the point where i didnt want to bother anymore, which is kind of a harmfull pitfall, given the stark seriousness of the context, because it felt like the only way to enjoy the game (as a game) was to not take it seriously.   After hearing about the the real world context that this game is drawing from though, I think it would be very difficult to allow for any redeaming outcome without undermining the actual events in some way or another. So turning it into choices matter game, then adding in halloween anouncements and cheeky surprise pranks just feels offensive, especially since there were times in the game where i actually felt morally compramised just for taking part. I get that its not supposed to be a typical game, but its being delivered as a game using typical game mechanics, and that just doent work like the dev wanted it to I think.",
            "review_score": "-1"
        },
        {
            "review_text": "a little disappointed. The plot seems trite to me.",
            "review_score": "-1"
        }
    ]
}