{
    "app_id": 396590,
    "name": "CMYW",
    "release_date": "2015-10-16",
    "developer": [
        "Shane Berezowski"
    ],
    "publisher": [
        "Zen Labs"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Space"
    ],
    "achievements": 0,
    "positive_ratings": 31,
    "negative_ratings": 11,
    "price": 2.79,
    "description": "CMYW is a four player survival co-op inspired by classic space shooters. The objective is to work as a team in order to survive the longest and score the highest. Find a balance between gathering resources and defending your portal if you hope to succeed.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396590/header.jpg?t=1487969146",
    "minimum_requirements": "OS: Microsoft速 Windows速 XP / Vista / 7 Processor: 1.2GHz processor Memory: 1 GB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 250 MB available space Additional Notes: Microsoft Xbox 360 Controller or Direct Input compatible controller and OpenGL 2.x or better highly recommended.",
    "recommended_requirements": "OS: Microsoft速 Windows速 7 / 8 / 10 Processor: 1.4GHz processor Memory: 2 GB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 250 MB available space Additional Notes: Microsoft Xbox 360 Controller or Direct Input compatible controller and OpenGL 2.x or better highly recommended.",
    "reviews": [
        {
            "review_text": "My base is gaurded by 2 turrets, 2 mines, I have a shied, a backup sheild and my favorourite gun is equiped. I'm mining asteroids and making sweet bank.   Then suddenley I am bombarded by two laser asteroids and three ghost asteroids that flank me. I shoot two but the third takes out my sheild as I try to dodge the laser 'roids. No problem! Equip the backup sheild, but whoa! Wait! While that happened I've lost two mines and a turret in the action at my base and 7 more asteroids are descending on it quickly. No sweat. I take them all out. The furthest one drops another sheild.... hmmm, should I grab it or protect the base? the action is hot.... I grab it the sheild but lose my current sheild from two bots chasing me. Damn.  I make it back to my base to stop another couple ghost 'roids, and a couple smoking ones. But now I have zero turrets and zero mines. One sheild left, I can do this. More bots charge in and its too much, I lose my last shield. I hurry to the other side of my base and run into a nuclear bomb.... everything goes white.  10/10 - would grab the backup sheild again  ....oh, and my wife likes it too",
            "review_score": "1"
        },
        {
            "review_text": "Okay, I originally didn't like this game and gave it a bad review. After rereading the other reviews, I think my negative reaction was due to the fact that I was just not that good at the game.  So, I hid my review and sporatically played over the course of the next week.  Now I have to say that I was wrong. As play progresses, your get better upgrades for your ship and base making the game more enjoyable.  Unfortunately, I still haven't had a chance to play multiplayer. I did hook it up to my Steam Link and it looks great on my 55' LED.  -------------------------------------------------------------------------------------------------------------------------------------------------- My Original review: These reviews must be written by the developer and his friends. I found the game boring. They claim it was inspired by asteroids. Actually, they took asteroids and made it so you can only shoot one bullet at a time. The controls seem very sluggish.   I played 5 games and I am not sure if I will ever play it again.  I will say that I have not played multiplayer yet. I will try it out on my Steam Link. If it turns out that it is more fun then I will come back and update this review.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun simple little game. Perfect to kill a few minutes, and if you get into breaking a high score, longer. Perfectly suited to multiplayer, and the developer keeps adding little bits and pieces that make it even more fun. Definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Co-op suport is only local splitscreen, misleading tags made me buy this game.",
            "review_score": "-1"
        }
    ]
}