{
    "app_id": 396640,
    "name": "TowerClimb",
    "release_date": "2015-09-22",
    "developer": [
        "Davioware and Quazi"
    ],
    "publisher": [
        "Davioware and Quazi"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 247,
    "negative_ratings": 25,
    "price": 10.99,
    "description": "TowerClimb is a difficult and rewarding procedurally generated platformer with roguelike elements. Enormous and mysterious towers of ancient unknown origin stand above humanity, extending to the heavens. Struggle forward as a weak human, driven by an iron will to reach the top.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396640/header.jpg?t=1452807494",
    "minimum_requirements": "OS: Windows XP Processor: 2.0 GHz Memory: 2 GB RAM Graphics: 128 MB VRAM DirectX: Version 9.0c Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game has clicked with me. Hard. I love procedurally generated games, especially platformers, and this game offers a challenge unlike most others. It's never unfair, as all of my deaths were my own fault, so it avoids being too frustrating or annoying. What it IS, is satisfying. REALLY satisfying. Getting past just the first room/area was a challenge, and it felt GREAT getting past it.   That's not even the first level, just the first ROOM in the first level, and they're always different. One level had rising lava for no real reason, one other had dogs on every ledge, one was full of wasps, and yet I always had a great time. The graphics are both retro and modern (thanks to amazing lighting effects) and charming as hell, and the music is great. I love roguelikes and I play a lot of them, but I think this is one that will stick with me for a very, very long time.",
            "review_score": "1"
        },
        {
            "review_text": "Spelunky for people who hate fun - pixellated, gritty and brutal, with no-nonsense movement that's satisfying nonetheless. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "In many ways, I find this is a game you have to experience. Not because of a heavy reliance on story or art, but because the mechanics of the game and every new thing introduced are just that interesting. Each area you see will kill you in new and interesting ways, and there is just something novel about being utterly destroyed time and time again knowing that you could have done better. This game accomplishes that. Thoroughly. Like, seriously, did you have to make it so that the ledge cling mechanic locks you there specifically when it is inconvenient? Playing towerclimb is like being in a relationship, you'll be up countless nights playing with it. You'll spend countless hours at your job thinking, 'I KNOW I can get to the third  base  area', and you'll spend countless more hours wondering how to do so. You love it yet you want to strangle it. In a romantic kind of way.",
            "review_score": "1"
        },
        {
            "review_text": "I'll never beat this, but the gameplay is incomparably rewarding with the challenge it presents, and the atmosphere can be genuinely enthralling. I couldn't recommend a game more, it's a perfect indie gem that shouldn't be as obscure as it is. Great for anyone who wants a tough, fair platformer with an abundance of playtime and replay value.",
            "review_score": "1"
        },
        {
            "review_text": "I've been eaten, cut in half, electrocuted, melted...even had my heart explode. But I can't stop trying to get to the top of this tower.   The platforming feels great, and there's a lot of physics based stuff involved that really make the climb interesting. Of course the ever changing maps and obstacles help make sure every climb is different, and a ton of fun. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I've been following this game for about three years, starting with the Let's Play series done by JSmithOTI, a youtuber who covers many different games. The idea of the game and its unique art style immediately caught my attention. I had been familiar with rogue-likes and different platformers; the original Spelunky is one of my favorite games and I saw a lot of similar aspects in TowerClimb.   I finally made the jump to purchase the game in April of 2015 while the game was still in beta and began playing it religiously. I got a good deal of my own friends into it and they themselves enjoyed the challenge posed by simply Chapter 1. The gameplay feels fluid and reminds me of the classic platformers I grew up loving. Since then, the game has only improved and expanded. It is amazing to look back and see that so many years of work and dedication were put into the making of this game and the same work and dedication that comes from the community.  I am proud to have been a part of TowerClimb in my own little way and hope that it can entertain you just like it has for me.   If I had to summarize what I enjoy about the game, the major points would be a great soundtrack and the mental challenge it gives. At the beginning of a run, you can take it slowly and space out every jump, but as the game gets more hectic and fast-paced, you really feel your mind kicking into overdrive just to make the precise movements and grabs you need to survive. TowerClimb properly has proposed a puzzle that players feel a desire to solve. Learning piece by piece lets you truly experience the game, but an active community and veterans from half a decade ago are available to help out a novice player.  I would reccomend this game to all my friends and everyone who likes a frustrating challenge that reaps a fulfilling reward.",
            "review_score": "1"
        },
        {
            "review_text": "Good but pls add joystick support (xbox/pc controller) or am I missing something?  Good game.",
            "review_score": "1"
        },
        {
            "review_text": "If it's on sale, definitely worth the price. A neat and addicting rogue-like game. The core principles and premise are pretty straightforward, but there are a lot of little bonuses and such to explore.",
            "review_score": "1"
        },
        {
            "review_text": "I gladly recommend this game because of many things.  First of all, for a roguelike, it has absolutely no mercy. Imagine if Spelunky and I Wanna Be The Guy meet, and you get an idea of how difficult it is.  On top of that, the game is long, and the challenge keeps growing as the levels go on. So, basically, what you need to play this game is patience, humility, and sheer determination if you want to reach the end... so it's not a good fit for everyone.  Besides your additionnal 'HP', you can also count your ressources (potions, items) as another HP stats too, because if you run out of them, the terrain generation may stop you.  As for now, I just beat Chapter 1 and reach the unique checkpoint of the game, and tried the cave of trials a little. SO I think I'm 20% done in the game ^^.  Pros : - The atmosphere. The musics are fitting very well to the slow pace of the game. - The original way to manage items. It's part of the steep learning curve. - The feeling of accomplishement once you complete something (quest, zones, mini games) - No time limit. You can take all the time you want to strategize your actions and manage your items. (except when there is lava, but that's close to non-existent in later stages) - A perfect run require to fill your inventory with key items, which makes the game all the more challengier.  Cons : - 1 checkpoint, there is no way for practice later stages that can be particularly brutal. - No steam achievement (yet ?) - The cave of 100 trials ... why is this luck-based ? :(",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot to love about TowerClimb.  Every time I play, I feel as if I'm controlling a brave human being with opinons, a family who loves them, an identity, opinions of his or her own, and complete obedience, so when I accidentally jump into a spinning fan blade I feel as if I've foolishly wasted someone's life. Most games just churn out the same protagonist over and over. Despite a simple procedural trick, I feel much more involved with the characters and their elation when we find a pair of climbing gloves, and their fear when they fall from an almost-fatal height.  TowerClimb's visual style is a combination of dynamic lighting and crunchy pixels, and it's beautiful. The character animations are expressive, especially when the avatar pushes against a block or wall. That specific animation almost looks rotoscoped. I can imagine a backstory where the Climbers don their ceremonial one-color climbing suit. The color changes for every climber, so it feels like each avatar has a unique identity.  The controls don't make sense at first, but perservere and they become natural.  The gameplay is tight, hard but mostly fair, though the giant worm miniboss is a bit OP. Even touching its abdomen is fatal, and I think that makes it really to escape it when one is cornered.  There are lots of secrets and side-quests, so the replay value is high, though I haven't beaten the main quest yet I can imagine playing through multiple times to explore the secrets.  The music is great, and very evocative of each level's theme. The music in panic levels, like when the lava rises or the worm chases you, is pretty good at getting novice players to crack under stress and die, which is always entertaining. It takes some concentration to tune it out, but it's doable.  There's substantial support and hints on the wiki, so novice players such as myself can pick up a lot of the knowledge required for a successful run, but don't be fooled, this game is very skill-based. The game includes a playthrough log, so I can clearly see that I'm getting progressively better.  I'm glad it's not item-based, and I'm glad that nothing carries over from my previous runs. The game is very well balanced, and you will become a better Climber with experience. Good luck!  I really enjoy TowerClimb, and I think I'll play it for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "I think...another reviewer had it right with crazy climber...  I'll just gently proceede to add in ice climber to that cocktail.  I can only agree with so many reviews of what this game brings to the table.  You must be able to react instantly...but,there are times for thought.  High risks and high rewards.  The controls...will take some time to get used to...  but once lava starts rising...  you either do a swan dive or you climb like hell.  Look...  this is an absolutely vicious platformer.You really have no weapons...you mainly try to avoid problems.   It's is a fun game that you will sweat over each move made.  Difficult,but totally fair.  You will feel like bad ♥♥♥ with each completed chapter.    And...   for the love of God...   please,do not mistake these minimalistic graphics for anything other than a design choice.  You will have no problems bonding with your character.  Tower Climb is a home run.       ",
            "review_score": "1"
        },
        {
            "review_text": "20 Minutes With Towerclimb:         YouTube™ Video:  20 Minutes With: Towerclimb&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "But I would climb 500 miles And I would Climb 500 more Just to be the man who climbed a thousand miles To fall down to the floor",
            "review_score": "1"
        },
        {
            "review_text": "Purchased after the RPS feature. Something about this reminds me of the magic of a game like Teleglitch because: it builds huge atmosphere from a modest conceit; its simplicity belies its depth; you're in a constant state of panic because twitch controls + resource management; and it's stupidly hard. It's the Teleglitch of Spelunky-likes. And it's good. And its existence made it so I could type that awesome phrase: 'the Teleglitch of Spelunky-likes.' Just say that out loud, ugh.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR - 'Towerclimb is one of the most engaging, menacing and downright tense games I've ever had the pleasure of playing. It will make you want to throw your controller across the room and then desperately reassemble it to keep playing more. It's atmosphere and music are big highlights alongside the tense gameplay.'  Long form - This game is recommended for persistant, dedicated, patient players. It is *very* old school tough and it does NOT cater to people who are looking for a game with all the (cough) 'features' of modern rogue-lites like constant saves, several lives, and character building mechanics that make successive runs easier; this game gives you none of that. This is 80's-90's tough, at least when you are starting out. Then you play more, get a bit farther, learn what things to watch out for, learn how far you jump and the way you can move in the air. You begin to understand how the monsters and traps work. Then, gradually you can get to floor 8, then 10, then 19 and finally you beat chapter 1. And when you do reach the top for your first time your heart, I gauruntee you this, will feel like it is about to explode with a mix of anxiety, fear, and joy. Then your baloon ride up puts you into chapter 2. You can relax a bit at this point because you can now access chapter 2 content without having to beat the tower again. Which BTW...  **Acessing chapter 2 is done by picking-up the '2' to the right of the Tower Entrance and bringing it to the portal during the new game scene. The skull, if brought to the portal, activates Centurion Trials.**   On the negative, a downside faced by new players is that It has *very* nuanced and subtle mechanics and 'tricks' that are not laid out clearly. Almost none of these tricks are required for beating the first chapter but knowing them and using them well makes the climb to the top significantly safer.",
            "review_score": "1"
        },
        {
            "review_text": "Towerclimb is an incredibly well designed roguelike, it's challenging, and all the mechanics in the game really work together to create a lot of depth. The game is also quite fair, and very rarely puts you in no-win situations, if you know what you're doing.  That said, the game has a lot of mechanics that need to be learned early on, so it may seem frustrating to new players, my suggestion is to stick with it, and possibly read a few guides. This is the kind of game where players with 100s of hours in the game still die frequently at the game's harder levels, so don't feel bad if you die a bit early on. Spend enough hours in the game, and you'll be breezing through the early levels.",
            "review_score": "1"
        },
        {
            "review_text": "I love a great challenge and this game provided it. Easily one of the best platformers I have ever played. The controls are tight and unique, offering you the ability to ditch items in order to achieve extra jumps. The game also features many secrets for you to find.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing! The music, the challenging levels, everything about this game is great and unique! Give it a try :D",
            "review_score": "1"
        },
        {
            "review_text": "A impressively fun game, with incredible difficulty. Very similar to spelunky, and dare i say, even more enjoyable.  An option for pixel blending for those without the eye fortitude of the sharp pixel edges, though personally i found it too muddy.  Highly recommended.  Best game ive ever played in years. Great job Davioware (And Quazi).",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game since its early beta versions, and it's honestly one of the best purchases I've made. If you like 'roguelike' platformers, or just challenging platformers at all, you'll definitely want to check this one out.  It's incredibly challenging, but always in a fair way. Every run is an intense experience, and the higher you get into the tower, the better it gets. When you get to a new place, way up in the tower, that you've never been to before, you're just swarmed with so many different emotions that it's hard to describe. The amazement of seeing the new place, the fear of dying and having to start all over again, and the sense of accomplishment, all at once, makes for an unforgettable experience.  The mechanics are solid, altough it can be pretty difficult to get the hang of the controls for new players. Once you learn the basics, though, you're gonna have insane ammounts of fun.  The atmosphere and soundtrack are also spot on, and make the experience even better.  If you like a good challenge, do yourself a favor, and give this game a try. I guarantee you're not gonna regret it. ",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like feeling challenged, this game is not for you.  If you don't like the feeling of a headache after failing over and over again, this game is not for you.  If you are not ready to see all hope of ever beating a game drain the more you play it, this game isn't for you.  If you are a masochist, this game will be your favorite game.",
            "review_score": "1"
        },
        {
            "review_text": "I wish more of my bones were broken.",
            "review_score": "1"
        },
        {
            "review_text": "While this game does fit the description of a roguelike, there simply doesn't feel like there is enough variety to the content or mechanisms to make the gameplay rewarding enough for the price (especially given the alternatives). There is no character progression (as far as I observed), no overall growth or goals (aside an album of death types to complete), and once you understand the basic jumping patterns, it all feels awkwardly sterile and repetitive.   As a secondary complaint, the pixel-style graphics, while charming, are a bit muddy and have a fairly limited color palette, leaving a number of enemies and objects very difficult to tell apart.  The music, however, is truly excellent.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought and installed the game with the intention of playing coop with my brother. After trying to figure out the settings and realizing they were horribly dysfunctional, we could not figure out how to get coop to work. The settings were atrocious and impossible to work with. Haven't even played the game but can't even get it to go fullscreen with the proper resolution and it looks horrible the way it is right now. Pass.",
            "review_score": "-1"
        }
    ]
}