{
    "app_id": 39680,
    "name": "The Guild II Renaissance",
    "release_date": "2010-07-28",
    "developer": [
        "Rune Forge"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Economy"
    ],
    "achievements": 0,
    "positive_ratings": 1944,
    "negative_ratings": 482,
    "price": 8.99,
    "description": "For centuries Europe has been dominated by the church and nobility. On the shoulders of ordinary people the servants of god and the noble families justified their power and wealth. This was the incontrovertible, divine world order. A truly dark era… In the 14th Century the world order is beginning to transform itself.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/39680/header.jpg?t=1533042539",
    "minimum_requirements": "OS: Windows® XP, Vista Processor: 2 GHz Processor Memory: 512 MB RAM Graphics: DirectX9 capable graphics adapter with Pixelshader Model 1.1 DirectX®: DirectX 9.0 Hard Drive: 3.5 GB space free Sound: DirectX 9.0 compatible sound card",
    "recommended_requirements": "OS: Windows® XP, Vista Processor: 2.8 GHz Processor or better Memory: 1 GB RAM Graphics: DirectX9 capable graphics adapter with Pixelshader Model 2 DirectX®: DirectX 9.0 Hard Drive: 3.5 GB space free Sound: DirectX 9.0 compatible sound card",
    "reviews": [
        {
            "review_text": "In 1400 A.D. I was no one In 1401 A.D. I was a low office holder In 1402 A.D. I got married In 1403 A.D. I got a child (thank god a boy) In 1404 A.D. Life was good In 1405 A.D. I build a mine In 1406 A.D. I was rich In 1407 A.D. My wife got kidnapped  In 1408 A.D. I killed the kidnapper in 1409 A.D. My wife bore a girl, so I killed her In 1410 A.D. I got sued for killing my wife In 1411 A.D. In court everyone started talking German In 1412 A.D. I got frustrated and killed those who spoke German In 1413 A.D. I was no more  Best 7 hours of my life.",
            "review_score": "1"
        },
        {
            "review_text": "This game was bad. The developers didn't care about it. Out of the ♥♥♥♥ing blue, it was patched. This game is good.  There are three versions of this game, this one is by far the best. So buy it.",
            "review_score": "1"
        },
        {
            "review_text": "The Guild II Renaissance is a game that is most fundamentally about money management. You use your funds to build a number of production facilities - everything from your basic farm to buildings producing high end equipment, armor and artifacts for trade or use. In addition to a typical strategic 'god view' you control 3 individual characters. You can engage in a variety of activities with these characters like having them run for office, enage in special actions with the buildings they own like goading the workers into action, and so forth.   The game starts off amazingly. It's great fun when you first start out and you can effectively micromanage all of your production facilities. Unfortunately, the game begins to fall apart once you reach the point where micromanagement becomes impractical if not impossible. The game provides a number of ways to try to automate your buildings but they are extremely bare bones, and very buggy even given that.  For instance, imagine you would like to simply take a product that one facility produces and bring it over to another facility that uses it as a resource, like bringing grain to a mill to turn into flour. The game allows you to setup an 'automatic trading route' to do exactly this, but what is offered provides marginal functionality and does not work as intended. You can't supply 'up to' an amount or anything of the like. You can do nothing except constantly send goods with one of three choices in terms of frequency: 'rarely, occasionally, constantly.' What do these mean you ask? I have no idea, the game in no way tells you. The sparse 12 page manual dedicates two sentences to the topic:  6.4 AUTOMATIC TRADING ROUTES You can now set automatic routes for your wagons. You can choose single waypoints for your routes and decide what to carry.  And even once you do get a trade route setup your transport wagons will occasionally just completely stop working in random locations. It's not for lack of a quantity of resources, or lack of desire at their destination. It's just a bug. Setting the routes up is an arduous process that you'll find yourself doing over and over again for the same route.   The other method to deal with an inability to micromanage is to completely automate a facility. This is much more functional, however it is once again incredibly bare bones and restrictive. In particular there is no way to have your own facilities provide their resources to one another. Instead your resource providing factories will sell all of their production to the market. Assuming the transport wagons for your factories that need those resources can beat the AI to the market, they will then purchase them there, losing a substantial amount of money in the process. In a game that is entirely about money and resource management this is incredibly frustrating.  There are also numerous other bugs in the game related to most of every action. You and your betrothed set out on your lengthy journey to the chapel to happily get married. Three quarters of the way there she decides, 'You know. I actually think I'm going to go engage in church services on the other side of the world first. Bye!' Or you'd like to bribe the mayor of your town. You send your character, who can run substantially faster than the mayor to do this. Your character will catch up to the mayor and then begin to slow down to engage in the bribe action. The mayor will ignore this and continue walking, your character will catch up and again slow down. The process will repeat indefinitely until the mayor decides to finally stop somewhere, often many hours later.  In general, I cannot recommend this game. It had great potential. I thoroughly enjoyed the beginning of the game, but the middle and endgame completely fall off. However, the company behind the game has been updating this version, presumably due to the imminent release of the Guild 3. This review has been based upon Version 4.2 with the hot-fix applied.",
            "review_score": "-1"
        },
        {
            "review_text": "I was once having a peace talk in my gabled house with two rogues, when suddenly, a town guard walked up and shot one of them before promptly leaving and never being seen again.  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "What a gem.  Basically a nepotism merchant political simulator.  You pick your starting characters profession and earn income and influence based on that. Find a mate and produce an children who then be sent to different schools or apprenticeship to become like dear old Mom or Dad or another profession.  Buildings and production chain are a huge part of the game.   Run for office, sabotage other candidates and/or bribe influence to secure your seat. Each seat has it's own perks and abilities.  Run for Pope if you want.   In somewhat the same vein as Evil Genius.  ",
            "review_score": "1"
        },
        {
            "review_text": "(starter tips at the end) People say life is thrown at you without instruction, now truth be told, your mum and dad give you some direction. Apart from that you are on your own.  This game is not your mum and dad, you are on your own. If you die, if your dynasty fails, if you go bankrupt....that is your fault. Unless you watch a walkthrough, google a walkthrough, occasionally right click in game to get a brief idea of what you are about to do or become a true gamer and live and learn....you are on your own.  I spent the last 2 year's playing this via download from another site and then downloaded it through steam for ease over my multiple laptops.   This game is harsh. This game requires business acumen, political skills, guilt free consequence to climb to the top of the political ladder, gaming skill and overall patience for bugs (download patch 4.21).  You start with a man or women you have created (similar to the sims), choose one of four jobs (Patron, Rogue, Craftsman or scholar), choose the amount of other factions you play against (some similar to your chosen profession, which mean competition). Choose a map and town to start in and away you go.....life.   Some starter tips:  - Establish your bearings  - Build a business  - Buy a title - Court and marry a partner  - Produce heirs...lots of heirs (some will die of disease, some will be killed and some will fail) - Level up - Apply for office (politics) - good luck if you win - Grow your business further - Have more heirs - Spend money on your heirs to go to school and get an apprenticeship  - Invest in more businesses  - Climb the political ladder  - survive...this is life    ",
            "review_score": "1"
        },
        {
            "review_text": "Even with the 'latest' patch (4.21), the game is still a buggy mess. Fun concept on paper, would be great, if the bloody thing worked. Hold out for Guild 3.",
            "review_score": "-1"
        },
        {
            "review_text": "Usually I wouldn't like a minor update to the original game, but it fixes a lot of gameplay issues. Not to say the game doesn't have any problems, but everything seems more polished. The original Guild 2 was a game with a lot of potential and a lot of problems (and bugs). Renaissance still has some gamebreaking bugs, but the gameplay has been improved. For example: you can now set up trading routes so you don't have to spend time sending out your carts. You can now make each round last 1 year and not worry about your main characters dying of old age. Ways to eliminate your competitors have been also improved. Since your workers and allies fight for you when you attack someone you can use brute force with more ease. Even losing a fight can work for you if you want to get rif of your allies. If you like The Guild 2 you should get this game, if you've never played The Guild 2 I recommend you start here. The game is difficult and buggy, but it's worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "this game series i think it one of the golden ones that sliped under the bus but as of right now the probleams it does have it good to have friends to play with but i still think this game is awsome",
            "review_score": "1"
        },
        {
            "review_text": "A ways into the early phase of the game, I had a son named Edric.   At the age of 18, Edric was ready to be married. Edric looks into the book of potential marriage candidates and finds the perfect match. It's a wealthy 42 year old woman named Myrtle. She seems out of his league, but Edric has a plan.   That evening, Myrtle attends her daily church services. Edric attends as well and takes a seat next to Myrtle. He leans over and whispers 'My grain is not moldy!' Needless to say, they were married the next day.  10/10  Still a better love story than Twilight",
            "review_score": "1"
        },
        {
            "review_text": "Take a dash of the sims, keep all the uncanny valley ♥♥♥♥, add the buisiness side of any good economy game, throw in the the voice actors from ANNO 1404 (Dawn of Discovery), a dash of intrigue and subterfuge, and you have this pile of fun. Probably one of the more in-depth economy based games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Guild 2 Renaissance is unique in its time, like all other Guild series. It's actually quite complicated but it will hook you for very long hours once you know all the commands and actions. You are born into one of the four classes namely Patron, Scholar, Rogue and Craftsman. Each class is special and has unique abilities.  If you choose Craftsman, your job is to make things out of raw materials and sell them to earn a living. If you are a Rogue, you can rob, waylay or kill a person for money or infamy. However, you can be sent to court and get hanged if found guilty. You are not alone in your line of work. You can also hire workers or goons to assist you.   As you perform your job, you gain money and your reputation grows. With both, you seek to buy bigger homes and increase your social status until you reach the pinnacle! You can get married, have lots of kids, and when you die, you take over your kids' roles. Along the way, you will encounter resistance from other noble families. There are many ways to get rid of them, of course...  There are many scenarios to choose from and there's multiplayer function! I have yet to encounter major bugs but the graphics is a bit outdated but still acceptable.   I just couldn't get bored with this game. The only way I stop playing this is when other games beckon me to play them.  Overall, I give this game a 115% satisfaction for its complexity and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Start up as a small priest, take a wh*re by profession wife, your son ends up owning the whole city. Just like RL. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is Pretty f**king good It would be great if not excellent If it weren't for the bugs. SO MANY F**KING GAME BREAKING BUGS. I've never been so overwhelmed with bugs. IF YOU BUY THIS GAME MAKE SURE TO BE READY TO MOD THE SH*T OUT OF THIS GAME IN HOPES A MOD WILL FIX IT.  _______________________________________________ Pros Good game. Addicting (for some people at least) Murdering b*tches to become higher in the political game (when i say b*tches i mean dumb and weak NPCs) _______________________________________________ Cons Bugs Game breaking bugs Bugs to the point of insanity Bugs making people of all sorts of patience levels Rage _______________________________________________ So over all Just wait for a sale, Its a good game but the bugs just can drive someone to the point of F**KING insanity when you put in over 10 hours into a single save game and The bugs Just go and f**k your surfs that carry things out of your businesses and to the Market.",
            "review_score": "1"
        },
        {
            "review_text": "Great game play - can be addictive, but horrifyling buggy. Eventually your saved game files become corrupted and you will no longer be able to load them or the quick saves. So I only get to play for about 15 - 19 years before I have to start all over again.",
            "review_score": "-1"
        },
        {
            "review_text": "Must buy!!!!!!!!  Such a good game",
            "review_score": "1"
        },
        {
            "review_text": "One of the most broken games ive ever played  Still fun",
            "review_score": "1"
        },
        {
            "review_text": "The Guild 3 is coming......^.^v  The Guild is a fascinating trade and life simulation that takes place during the late Middle Ages. Step into the shoes of a citiizen, acquire businesses and mansions, produce goods and trade them, start intrigues in politics and society, love, hate, bribe, fight and live through good and bad times!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with friends. Some things are still a little broken, but I am eagerly waiting for the Guild 3.",
            "review_score": "1"
        },
        {
            "review_text": "This is so medieval fun I can't stress enough :D",
            "review_score": "1"
        },
        {
            "review_text": "Hey thats pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This is by far a unique game when it comes to economic/political/simulation games. This manages to be a very entertaining game with lots of depth and strategy involved while also being light hearted and not too serious.  It can be a bit daunting at times but reading up on the internet can help start you off, The campaign in Pirates of the European Seas also helps you get accustomed to how the game is played.  An important thing to note is that there is no Dev support for the game anymore BUT it does have a very active and successful modding community, it's also highly recommended that you look for the latest legacy mod to fix the bugs and add some extra features.  If you've got a close group of friends this game can be a blast with planning secret back room deals, political intrigues, sabotage and an in depth criminal system. On the top layers it is also pretty fun to run a proper business and try to improve the local towns prosperity. Basically it's about as awesome as GoT but on a much smaller scale xD Sadly no massive armies or foreign lands to explore.  If you Roleplay, this would probably be the best game to use as a setting, The depth of actions and choices you can make is staggering.",
            "review_score": "1"
        },
        {
            "review_text": "game is blah, no action only words and a world that doesnt make any connection to your existance. clunky user controls. i like many sim style games and i played this 2x and regret the purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a unique game to its style. It mixes life simulation with politics and strategy, all set in a medieval world. Despiste all the technical issues and bugs it had, most seem to be solved since its lastest patch (2015).",
            "review_score": "1"
        },
        {
            "review_text": "What a great game  Wife gets captured and tortured Wife confessed to being a witch(she actually wasn't) Wife went to court Wife was fined 10k in debt reloaded because it was bs Happened again reloaded even farther Dude was captured I murdered the person in charge I was finally free  I was selling women A little boy walked up to, and payed for one They had 'fun'  10/10 would do it again ",
            "review_score": "1"
        },
        {
            "review_text": "this game is so hard to describe to people! i played it years ago and put 100+ hours into it. Myself and a friend had sooo much fun we had to buy it again here! the multiplayer works great for us with tungle but we did use gameranger too and possibly evolve. if the mp goes out of sync just email the mp save file to your friend. its an easy fix. highly recomend this title! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, sex, money, assasinations, weapons, plunder and more assasinations. best medieval real life simulation out there!",
            "review_score": "1"
        },
        {
            "review_text": "An Oldie by now. but still fairly immersive if you like this genre :)  The Guild puts you out into an Medieval City where you can well. Life :P You buy Buildings, Get a Wife, Trade or Work and try to become Wealthy. Either by legal or by not legal means :) The Game is showings its age. So alot of stuff is not looking topnotch. but its bearable and the options are pretty wide :)    give it a try :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game idea, terrible execution. Has a lot of crash issues (somehow even manages to crash windows to the point where hard reboot is needed for some folk), saves have a 50/50 chance of being corrupted, the pathing is wtf worthy if not downright frustrating; the controls become really annoying after a while (don't even get me started on combat). It has its cool moments, but honestly it plays like a steam early access game and it's from 2006 (granted Renaissance did come out in 2010, but it seems to me that the engine was practically unchanged in the two games). I might have a soft spot for this game because it's both a political and and economical simulator in one game, but honestly I would advise people to stay away from this particular game unless you're really into strategy/tycoon and the like. You're only going to go out being frustrated (and maybe a bit confused, as the game doesn't really have a good tutorial). Maybe wait for The Guild III as it's in development right now.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun game... but horribly unstable! I would NOT recommend ANYONE to buy it for the multiplayer part, as it's nowhere even near 'functioning'! 4.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Overall the idea behind the game is very nice. Too bad that it's running VERY VERY slow even on a powerful PC - making it not fun to play. ",
            "review_score": "-1"
        },
        {
            "review_text": "So, decided to try this game, since my Guild 1 started to crash before I was able to play it to the end. I'll just write what happened.  ' - Wow... I actually have an avatar this time? I'm not some invisible being that appears only in cut-scenes? Cool... I'll make a merchant.'  '- How the ♥♥♥♥ does anything work here? I just hired some dude for my home? Wat?'  '- Ooh... I bought a tailorshop... I'm going to make this town FABULOUS!'  '- Better hire someone... I love it how the game says: Hire a random person from the street. Mhmm... What could go wrong? Here, have a needle, now start making fashion!'  - Sees someone getting killed by the guards.  '- Oh well... The person's dead anyway! FINDERS, KEEPERS!'  '- Woo! I got me some gold And... I got sued to trial? For stealing? Come on... I did it in broad daylight in the middle of the market, can't be that unusual!'  '- ♥♥♥♥! Trial is tomorrow 9am... Better go to my tailorshop...'  - Proceed to yell at your employees and whip some action to them at 11pm.  '- It was a good night. Now to bed.'  - Wake up to beautiful morning.  '- ♥♥♥♥! THE TRIAL!'  - Look up info... Chance of charges going through, 90+%  '- Well, I'm ♥♥♥♥ed. It was a fine day I spent in this town. Opened up a shop, courted some random lady on the street. Pickpocketed a corpse'  - Go to court. The person who pressed the charges doesn't show up. All charges are dropped.  -'HA! I'M FREE! NOW TO YELL AT MY WORKERS!'  - Get charged for abusing workers like slaves.  '- God dang it!'  8.7/10 Charges are nice.",
            "review_score": "1"
        },
        {
            "review_text": "Don't know how anyone could give this a good review. It is unplayable. Crashes almost every time I save. Worse, it seems to clobber save files as well... Whatever is causeing it, I am 64 Bit OS, and I have 16GB of RAM, so it isn't the 'usual'. I am just glad it was cheap, and on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money its buggy and sometimes just stucks with black screen.",
            "review_score": "-1"
        },
        {
            "review_text": "I courted some random Rogue while having my friend bribe me thousands of money for my poorly managed businesses. Didnt realize she was married to me and demanded we seperate after 12 years of not knowing of her existance. She might have died when I asked my buddy to bomb the local Pesthouse so my Infirmary could have all the business.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has always appeared an error of 'connection out of sync' when played it with my friends.",
            "review_score": "-1"
        },
        {
            "review_text": "1. Patch the game to latest 4.2 2. Doesn't work on windows 8.1 - Many C.T.D. 3. Use compatible mode 'windows 8' on the exe file 4. Works perfectly!  Great sand box game with many different playing styles. Its like playing the series The Borgias on PC!",
            "review_score": "1"
        },
        {
            "review_text": "I would rate this a 9.5/10, iffff it weren't for the game breaking bugs that you can encounter. It really is a great game; don't let the bugs stop you from getting it. The general premise of the game is revolutionairy, the espionage is great, and the mechanics are usually decent. Could do with a major update and there is virtually no community so it gets a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Really unique and fun game. The latest dev patch (released years after development) is a must have. Really looking forward to Guild 3",
            "review_score": "1"
        },
        {
            "review_text": "-Play as Rogue -Earn Dirty Money with your thieves and mercs -Pay higher office holders with said dirty money to elect you into office -Pay even higher office holders with more dirty money to take those original office holder jobs -Snake your way into Supreme Commander (only the Kings job in the way now) -♥♥♥♥♥ kill that guy in broad daylight  -Become King  -DO WATEVA U WANT  DIPLOMATIC IMMUNITEHHHHHH   now the streets rage with blood and violence as i purge all other dynasties from existance ",
            "review_score": "1"
        },
        {
            "review_text": "I've been messing around with the classes to find my favorite. 'Happened' to get rich as rouge. Build a bar. Hire hookers. Figure out im a renaissane pimp. Competetor poisons my hooker. REALLY??? Great game, overall.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game that is combination of economy games with RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I love old sim games. This is perhaps the fondest sim's of my childhood. Needless to say; this is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Can someone please help me fix the lagging and crashing that the game does? I think it's a memory leak issue since it tells me to close programs to save memory but the only fixes I've found are for Windows 8 and I'm running Windows 10. I loved this game on my old computer and am really frustrated with it on this one. Any help is appreciated.",
            "review_score": "1"
        },
        {
            "review_text": "(version 4.20 Review)  TLDR: Broken beyond belief. Not worth your time even if it were free...  Honestly, I tried really hard to have fun with this game. 11 to 12 hours of solid gameplay, 2 hours of learning form videos about this game on youtube, cause I was thinking: 'there must be something I'm missing here. Either I just don't know about all the mechanics, or I'm doing something wrong, or both...'. But no, none of that was the case. The problem with this game is that it is just plain broken. Out of all the mechanics in the game that are at the player's disposel, only 1 actually works (if only clumsilly).  The impression I get from this game as far as what the dev's envisioned is bassically Crusader Kings turned Sims. Or even think of this game like this: turn House of Cards into a PC game, and set it in the medieval/renaissance era. Which, when hashed out on paper, sounds great and I think there's actually a need for a game like that in the PC market. Unfortunately, The execution on this game is just not there.  The only mechanic that actually works 100% of the time in this game is the charchter's ability to make money, but making money in this game is not fun. it's a mindless 'Point &amp; Click' chore. Every other mechanic is just down right broken.  Want one of your character's to rob someone? Tough, cause it's broken. I actually took the time to find every single chacter on the map I was playing on (and I mean EVERYONE) and tried to rob them with both my main character and my 'henchmen', and the game would not allow me to attempt to rob anyone. So then I thought: 'ok, maybe it's the buildings that I'm supposed to rob'. Tried to rob everysingle building on the map, and again, no dice. So why even have it in the game if it's broken?!?  Want to bribe the Mayor to ellect you into office? Don't bother, because every other applicant will bribe him for the exact same amount you do, which essentially nullifies all the bribes given by everyone because he ends up equally favouring everyone. In one particualr ellection, I decided to show up to the council meeteing early so that I could bribe him right there in the council hall before the voting started. I then watched hillariously as every single npc in the council hall handed him a sack of money. I was like number 8 in line with my bribe. Needless to say, I wasted my money and so did the npc's.  Want to Sabbotage a business owend by a competing faction? Tough nuts, because Sabbotaging a building doesn't have any effect on the business' abilty to function what so ever. Because you have to sabbotage it multiple times and there's a 7 hour cool down period on the sabbotage ability (in-game time of course), and by the time you've bombed the business enough for it to actually have an effect, someone's just going to lay charges against you and throw your bung-hole in jail. Sure, you can pull off 1 or 2 sabbotages with out having too much incriminating evidence floating around, but it takes more than that, so you will get caught. So therefore, pointless.  I'm not even scratching the surface here. There are sooooooo many broken mechanics that I do not have the time or the patients to list them all here.   Conclusion:  I bought this game on sale for under 3 bucks, and I feel very lucky that I didn't spend any more then that. And please, don't buy into the youtube videos that supposedly show you how this game works and then claim its a 'good game'....In fact, now that I think back, every video I watched never contained a single second of mid-game or even late-game play time. And that makes alot of sense, because this game is 'deceptivley' broken:  In the first 2 hours of the first playthrough, you might feel proud that you've started a thriving business, gotten married and had kids to carry on your 'Dynasty', and bought your familly a higher 'Title', and that will give you the illusion that this game is 'Fun'. But then when you try to make use of all the game mechanics provided for you in order to progress further than that (i.e. get ellected in to office, hostel take-over of competing dynasty's buildings, bribery and blackmail, etc...), you'll slowly find that those game mechanics just do not work at all. And its sad. because the idea behind this game is so great. Motives for this game were great; method's in making this game were crack-♥♥♥. There are early access games that are more pollished than this game, and bare in mind, this game is on it's 4th itteration already...  So no, I can not, in good clean conciense, recommend this game, even if it were free, let allone 80% off. Sorry dev's, but you bought a really bad, sour apple here. Rumor has it there will be a 'Guilds 3', and I really hope they're just that: Rumours....",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game, so much missed potential.  The performance is horrible on high end machines, I'm lucky to get 30 fps on normal settings with one nvidia 690. The graphics are poorly optimized and are not good enough to justify poor performance.  The ai for characters is poor as well. My character regularly walked about in circles trying to get into a building right next to him.  The game is buggy and very unintuitive, tooltips are far and few for many things.  I recommend saving your money. The game has a ton of potential, but the execution is bad. Unless you already know how to play or plan on looking up guides, you will have a stressful time getting into this.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't possibly recommend this game because it doesn't work, the intro scene is a black screen and when inside the game when ready to play in the town whenever i press ESC the game shut down, even with the latest beta patch, i do not recommend it as it is not properly functional.",
            "review_score": "-1"
        },
        {
            "review_text": "“My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.' Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.”",
            "review_score": "1"
        },
        {
            "review_text": "Made people pay toll for safe travel, then robbed them a little farther up the road.  Great game, even tho it has had it's problems. The Guild (II) didn't get the attention it deserved.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game with only a few glitches. i wold recomend you buy this game, since i have more hours in this then most new expensive games",
            "review_score": "1"
        },
        {
            "review_text": "Broken AI, game breaking bugs and no intention of fixing problems. Avoid. ",
            "review_score": "-1"
        },
        {
            "review_text": "My husband really likes this game",
            "review_score": "1"
        },
        {
            "review_text": "Connection out of sync.",
            "review_score": "-1"
        },
        {
            "review_text": "Im writing this for potential buyers of this game so they are informed.   Edit: A developer has finally updated the steam version to 4.211. I have changed my review to 'recommend.' This change should solve many bad review issues.",
            "review_score": "1"
        },
        {
            "review_text": "SPOILER ALERTS!!! Hello everyone I am PPPPPPPPPPPPPEEEEEEEEEEEEEEWWWWWWWWWWWWWWWDDDDDDIIIIIIIEEEEEEEEEEPPPPPPPPPPPPPIIIIIIIIEEEEEEEEEEEEEEEEEEEE. Anyway, Pewdiepie, loves to make fun of people because he is Swedish, you know who else is Swedish?  the Swedish King.  Do you know who else is a king?  King Arthur. King Arthur is a guy.  Do you know what guys have? That's right, Deez Nu--hands Men have hands.  Do you know who has hands and is a man?  Traitor Trooper. Traitor trooper is awesome. Do you know who else is awesome? Kylo Ren. Kylo Ren kills Han Solo. That brings me to the climax of my review. *MAJOR SPOILER*  HAN SOLO DIES!  In this game people die too, like my idiotic thug who doesnt know how to kill a fricking pedestrian. Anyway this game is really terrible and I DONT RECOMMEND GETTING THIS GAME.  Virus Infector Simulator 2015 PS: It isn't a simulator   ",
            "review_score": "-1"
        },
        {
            "review_text": "It was a fun game, full of promises and potential...while it worked. Enough said, dont waste Your money, not even while its on sale. Spend Your money better, on a working game. Thank you steam for making available yet another unplayable game on your list and sucking money out of your customers. Youre the best (!)  P.S. This applies to The Guild 2, The Guild 2: Pirates of the European Seas and, of course, The Guild 2: Renaissance.",
            "review_score": "-1"
        },
        {
            "review_text": "I can poison asians in this game. 20/20",
            "review_score": "1"
        },
        {
            "review_text": "Lots of problems, but the only, and by default best, family RPG-Sim hybrid set in the renaissance.   Play a family, but start as one man or women who owns a shop of some type and a house, all upgradable  12 other families who try to kill you, and each other off   Very much like EA's sims, where you don't have any real direct control, in terms of button mashing ect, over the outcomes of actions  There are a few ways you can play, but the most effective is a heavy handed approach, dealing in robbery and murder  You can kidnap and torture rivals  Dueling (largely automatic)  Run for offices, set up your family in elected positions as well  Gaphics are not great and there is a memory leak of some type that can slow down the game  You win or lose the game very quickly, within the first 2 -10 years, depending on your style, you can either ride out, wipe out or be wiped out by all threat families, though you keep playing for long after any major challange",
            "review_score": "1"
        },
        {
            "review_text": "nice game with the new patch..Im luvin it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Unoptimized, repetetive and packed with a insane amount of bugs. Includes a tacked on multiplayer mode that doesn't work, and about 4 or 5 maps that actually work.  It's pretty bad but atleast worth playing once or twice.",
            "review_score": "-1"
        },
        {
            "review_text": "A great mesh of genres make this game an ever enticing rpg, I hope it's kept alive and eventually reborn.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game. Own a business, start a family, get involved in the political system, and keep your dynasty going. You can earn your way to the top by becomming the best, or simply assasinate anyone who opposes you. Definitely worth it to buy this game! Doesn't come with a tutorial for some reason, so look up tutorial videos or ask some friends who have the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has been sitting in my library for about a year before i gave it a fair shot, and i wish i tried it long ago!   Make no mistake about it this is a RTS game, but its an RTS that makes you forget about all that. you really believe that your just playing a sims style game until you remember that you have to take out other familys.   The game play is fun and you can loose your hole day to playing it. I would strongly recommend this game to a friend even though the online servers are off.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games with a cool idea. .   Too many cons and only a few pros make this game a toss away. It will bore you to death after about 5 hours,and a taste in your mouth of last nights Inn  The far biggest Con in the game is the cities themselves,most are so small and crappy looks like a 5 year old set them up. I can see that the company that made the game went bankrupt. As you play it you will see why.   i'd rate this game a 5 outa 10..cause am 50/50 myself. cause its a BORE  ....................../´¯/)  ....................,/¯../  .................../..../  ............./´¯/'...'/´¯¯`·¸  ........../'/.../..../......./¨¯\\  ........('(...´...´.... ¯~/'...')  .........\\.................'...../  ..........''...\\.......... _.·´  ............\\..............(  ..............\\.............\\...",
            "review_score": "1"
        },
        {
            "review_text": "The guild 2: Renaissance has more depth than most Alabaman gene pools. There is a lot to do and several ways to do many things. I’ve only got about 11 hours into the game at the moment but it has been 11 hours of aggressive expansion and calculating distain for my competitors.   Note: I haven’t tried any mods yet so this excludes them. I also have not tried the rogue bits.  Pros:  - Fairly deep simulation of economy and politics. - Loads of corruption and fun. - Opportunities to mess with the unsuspecting. - Hours of mechanic learning and production cycle exploitation.  - Hilarious romantic simulation. Cons - Dated graphics. - Not too much in the way of character customization. - Somewhat difficult to learn.  While playing this it kind of struck me as similar to an X game (e.g., Terrain conflict, Albion Prelude) in a renaissance world. Player owned supply chains? Check. Lots of merchanting? Check. Having more money than the entire town/sector probably should? Check! It must be an X game. As far as the ease of access goes, with a small amount of time most of the game play mechanics become fairly second nature. If you find the X games interesting and enjoyable, and you kinda like renaissance times, this game should be a winner.  ",
            "review_score": "1"
        },
        {
            "review_text": "I do like this game. It has a lot of unique elements, and is generally ok on the enjoyment side...  But here's the thing... this game is RIDDLED with bugs!!! I mean, LOADED to the hilt with them!!!  And I'm not talking about minor glitches... I'm talking about - you have to restart the game - bugs...  I guess this studio just got to a certain point and said, 'Aye, it's playable enough... call it done' When you first start the game, it says, 'Version 4.17 BETA'  It's 10 years old now (the original Guild 2 game), and it plays like it is 18 years old. I played the original G2 way back in the day... Knew it had a crap ton of bugs.... was hoping this version of it would have some of them worked out.  Nope, actually seems to have more.  Well, buy it if you like, but the $10 I paid for it was NOT a bargin. This game should be listed for about $1.99.  I have to restart the game and load a save, around 8 times per night.  - In new game menu, use the 'back' button... menu items dissapear (have to restart game) Happens every time. - Alt tab out to windows (game speed change doesn't work anymore - restart game) Happens ALL the time. - characters, wagons just get stuck in random places on the map. - too many to list.  Last night I was playing and was wondering why there was NO ONE in town? Went over to the town next door and say 100+ NPC's/wagons all stuck spinning at one place. After trying to interact with them for about 20 minutes, all of a sudden they all broke lose... looked like a hornets nest busted open... npc's scattered everywhere. Took quite a while for everything to go back to where they were supposed to be....  Cheers  Oh, and one last thing... micro managing your business to try to make a profit (and you need a lot of money to upgade - everyhing)... gets REAL OLD FAST. While it is fun to see what makes you money... after you get it going, you're just micro managing it, constantly. Letting the AI run your businesses is a waste. You make very little profit. not enough to progress at any good rate.  That said, open the game folder and edit config.ini [INIT-PLAYER-2] (yes, that's right, you're player-2...) Money = 1000000  Take your million and play the game like a real noble. :p  Giving yourself more than that, doesn't add anything to the game. You want to be able to run out of money if you're careless... and you can blow a million easily if you're not careful.",
            "review_score": "-1"
        },
        {
            "review_text": "finally got this to work. not played yet will update once i have a chance. first off opt in for the beta. theres the latest patch. second modify the config.ini file. change these to 0 as shown.  // Show the splash screen at programm startup (0:no 1:on (default) ) SplashScreen = 0  // Show Loading screen (0:no 1:on (default) ) LoadingScreen = 0  also change the resolution to what you like i chose 1920 by 1080. [GFX] ScreenWidth= 1920 ScreenHeight= 1080 FullScreen = 1 Contrast = 1.0 Brightness = 1.0 BloomEffect = 1 RangeOfSight = 18000 SaveMovie = 0 ScreenShotType = 'jpg'  then it worked. this is of course for windows 10. 64bit.   ",
            "review_score": "1"
        },
        {
            "review_text": "This must be my favourite economy simulation game of all time. Sure there are odd bugs here and there, but a lot has been done by the community to make this game great.  Would hire a ton of thugs and kill the town guard again 11/10",
            "review_score": "1"
        },
        {
            "review_text": "D̶o̶e̶s̶ ̶n̶o̶t̶ ̶s̶e̶e̶m̶ ̶t̶o̶ ̶b̶e̶ ̶c̶o̶m̶p̶a̶t̶i̶b̶l̶e̶ ̶w̶i̶t̶h̶ ̶W̶i̶n̶d̶o̶w̶s̶ ̶1̶0̶.̶ ̶ ̶C̶a̶n̶'̶t̶ ̶g̶e̶t̶ ̶t̶h̶e̶ ̶g̶a̶m̶e̶ ̶t̶o̶ ̶r̶u̶n̶.̶ ̶ ̶E̶a̶c̶h̶ ̶t̶i̶m̶e̶ ̶i̶t̶ ̶l̶o̶c̶k̶s̶ ̶u̶p̶ ̶m̶y̶ ̶w̶h̶o̶l̶e̶ ̶p̶c̶ ̶a̶n̶d̶ ̶c̶a̶n̶'̶t̶ ̶e̶v̶e̶n̶ ̶p̶u̶l̶l̶ ̶u̶p̶ ̶t̶h̶e̶ ̶t̶a̶s̶k̶ ̶m̶a̶n̶a̶g̶e̶r̶ ̶t̶o̶ ̶d̶i̶s̶a̶b̶l̶e̶ ̶i̶t̶.̶ ̶ ̶H̶a̶v̶e̶ ̶t̶o̶ ̶c̶o̶l̶d̶ ̶b̶o̶o̶t̶ ̶m̶y̶ ̶p̶c̶.̶  Found this solution in the Steam forums: go to your config.ini search 'splashscreen' put in 'splashscreen = 0'   Works fine after that.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played Crusader Kings II then you'll love this game. It's very similar only on a smaller scale.",
            "review_score": "1"
        },
        {
            "review_text": "I hope that they will fix 'connection out of sync' error, at least in The Guild 3.",
            "review_score": "1"
        },
        {
            "review_text": "Does not run. Tried everything the average user would attempt before giving up. And terrible support from the makers themselves. Seems to be a gamble in regards to whether this game will run, so I wouldn't recommend it when there's a chance your product won't work when you've paid money for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, but it's many glitches dosent make it as fun as it could be.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game.  Can be a little slow for those who like action.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game in a bundle a few months back and read reviews that said it was buggy and not worth playing so I didnt give it a second look. After a bit of research I found that there are community mods that fix some game mechanics and the existing bugs. I decided to give it a try and it turned out to be AWESOME. It is more in depth and complicated than it seems at first glance, so give it a little bit of time to show you what it is really about. If you like simulation/management simulators then this is for you 100%. (Just make sure you patch it first)",
            "review_score": "1"
        },
        {
            "review_text": "VERY buggy, BUT really awesome and fun game!",
            "review_score": "1"
        },
        {
            "review_text": "Been trying out the G2 Collection, seems like the games have the same bug with time accelleration getting stuck, which means you have to save - exit - restart the game to make it work again :P And the intro movies are invisible = Press ESC to get past them.  The courting game takes too much time and subtracts from the whole turning it to a crap version of 'The sims'. Besides that, the games are nice. Wish they would fix em.",
            "review_score": "1"
        },
        {
            "review_text": "This game is still an interesting and fun game. It has a lot of great ideas that could potentially be used by other games later on. I find it quiet enjoyable to play as a rogue family and make toll booths with my mercenaries so that all the carts must go through me to get the goods were they need to be. No one likes me at the end of the game though *shrug*. I enjoy owning a mine, making huge bank, and then spending that bank to actually build a bank for my Doctorate son. I enjoy running an inn, and watching all the serfs spend all their hard-earned money getting drunk after a long days work. Though this game does have some bugs, but none of which are game breaking. For instance, the AI is too pacisft, never really bothering to interrupt my family other then maybe plundering my new tiny shop, or beating up my sons second wife. I only got murdered twice in the hours I have spent. The learning curve has gotten harder, for originally in PotES, buildings were going on sale left and right, but now buildings are rarely sold, adding a bit of competition to the game. Another issue I have with the game is that titles are WAY too expensive compared to PotES and the original. I do like how becoming a nobleman to become a king is a lot harder now, but 100000 gold? I could get a baron title with that in the other games! They do add other titles to fill in the gaps with the game, but they just dont feel right to have. These things are minor things however, and can be overlooked. Most people have modded the game to fix these problems, and you can find a lot of them at Runeforge's forums.",
            "review_score": "1"
        },
        {
            "review_text": "i love the series and the game, but dont buy it. just stick to the guild 2(without expansions)  this part is buggy as hell.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, original and funny",
            "review_score": "1"
        },
        {
            "review_text": "No matter the past of the developers or how buggy the game is its pretty hard to not play once you have it. The game has had its last update now and from what I can see most the game ending bugs are gone just little ones left and with the last update you get the mod tool that already has a usefull mod installed on it that you can turn on and off as you wish. :)  Realy it is a good game the best if you like trade and management games.  ONE OF A KIND  5 STARS FROM ME",
            "review_score": "1"
        },
        {
            "review_text": "One of the most orignal games I've played in a long time. The world feels and looks alive and has a great depth to it.  Bit of a learning curve and no in-game tutorial though.",
            "review_score": "1"
        },
        {
            "review_text": "I had played this game previously a few years back prior to repurchasing it on Steam and loved it, even though it was extremely buggy. Unfortunately, even with these new patches to the game, it is still buggy as all hell. My first game in, after having bred the first child, my character was unable to sucessfully take any action thereafter. Reloading to a previous save had no effect to remedy this bug. Unfortunate that game breaking bugs still exist, and are even worse when the save game is corrupted well into a playthrough and can not be reversed. Great game concept, but I would recommend avoiding this if possible and wait for the 3rd edition which will hopefully not suffer from so many bugs as this still does.",
            "review_score": "-1"
        },
        {
            "review_text": "Good ideas, bad execution. Nothing is clearly explained, not even how to get to the tutorial. Just look at the forum, almsot every thread is full of questions on how to play the game. You will probably find yourself stumbling over menus, having the click things multiple times ( I hate carts), botching playthroughs and generally not understanding why the heck you can't do something. With that said, it's pretty neat trying to make a dynasty.  It's a fun game but it comes with too much baggage in my opinion, bugs, the difficulty curve. Also, way too much micro-management for me. There is probably a way to make it easier, but I don't get it, even after 8 hours.   You're better off playing some other game but I'll recommend this one if you don't mind lots of work to get to the fun.",
            "review_score": "1"
        },
        {
            "review_text": "A very serendipitous find for me, I had never heard of this game before, it popped up on my Steam feed for £2, liking the sound of it (I love games with depth) I decided to give it a go. My first 4-5 hours were spent scratching my head and wondering what the hell do I do? I finally got the hang of it and learnt that there was a patch released recently even though the game is quite old, the patch also unlocked a tutorial, which I didn't bother with as I thought I was well on my way to establishing my dynasty, it also fixed and streamlined a few things like pathfinding. It is still a little buggy but there is a fantastic deep game here that is still getting support from somewhere, more patches to come and maybe even a third game in the works, hope so. Top game and nothing quite like it.",
            "review_score": "1"
        },
        {
            "review_text": "need guild 3",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun game but quit difficult i had to look up a begginers guid",
            "review_score": "1"
        },
        {
            "review_text": "Good game but has taken to crashing soon after loading any saved game. Waaaay to many bugs in this 'finished' game.  Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Became a 'pastor', cheated on 3 diffrent wives, killed 5 people, stole money, bribed for political spots, created a bunch of followers=money,.. Nest day, goes to preach to say, love your fellow people, treat other the way you wanted to be treated, amen and let us pray to the lord.  10/1 would be pastor again",
            "review_score": "1"
        },
        {
            "review_text": "This is quite a good sim. it took me awhile to learn it but once i did the replay value is high",
            "review_score": "1"
        },
        {
            "review_text": "9/10 All 8.5 hours are from the day I bought it. It cost $2.49 and it's well worth that price. I didn't have the bugs that others have complained about, and the interface is a little unorthodox, but for the sale price it was a steal.",
            "review_score": "1"
        },
        {
            "review_text": "- Pick a profession out of many possibilities. Sounds interesting! - Construct your business building which allows you to produce several specific goods - Produce the goods from resources that you either collect, buy or produce yourself - Sell goods either at the business or at one of the markets on the map - Update the building and hire more workers as money permits - Repeat with as many businesses as you like - Grow bored  Resources that you can collect never run out. You can send a bunch of workers to pick that same small spot of lavender flowers for decades.  Resources that you grow never fluctuate. I never had a bad harvest.  Production rates are steady, too. I've never had a problem with my workers or any noticable difference in their output.  Seasons don't provide variation either. While the game has nice visuals for the seasons and even tells you that transports move slower in winter, you can harvest just as many flowers, fruits or grain in the deepest snow.  There are only 3 levels of each building and very similar minor updates. I maxed out 6 businesses within a generation of my dynasty and now they are just sitting there.  Goods are often weirdly specific or illogical. A lvl 2 inn can only offer a salmon and mushroom dish for food, so you better get salmon and mushrooms, no alternative. A lvl 1 bank produces copper coins from iron (by magic?).  Goods never spoil. Harvest a ton of fruit and sell them 20 years later, who cares?  Even places that should be about providing services are not. As a healer you earn most by selling soap you make out of lavender.  As soon as you own a chain of supply, there's nothing left to do. Buy a farm, a mill and bakery, and spend the rest of your life moving icons of grain and wheat around, yay!  tl;dr:  Maybe you could have a little fun with a criminal or political career, but the economy and building mechanics lack any dynamic or complexity that might make them interesting or challenging.",
            "review_score": "-1"
        },
        {
            "review_text": "Life is hard, when you get down to it. This game only points it out moreso. Imagine The family feud of romeo and juliet, now take this, spread it across up to 16 families, and live life! Such a fun, and yet hard game to learn and play right... I really recommend this to anyone looking for a great strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "if you like micro mangement this is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game, I was surprised by how much I liked it once I got into it. has quite a steep learning curve at first as it does not really tell you how to play. however, the forums were very useful and people were a great help.  Once i got the hang of the game it is super fun setting up your businesses, then collecting the raw resources to craft your items cheaper then your competitors so you can run them out of business.  the politics side of the game was not really interesting to me, but building a network of businesses and carts running resources between them to build up my empire was definitely entertaining for hours.   Looking forward to The Guild 3",
            "review_score": "1"
        }
    ]
}