{
    "app_id": 396860,
    "name": "Over The Hills And Far Away",
    "release_date": "2015-09-16",
    "developer": [
        "WarGirl Games"
    ],
    "publisher": [
        "WarGirl Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Visual Novel"
    ],
    "achievements": 8,
    "positive_ratings": 154,
    "negative_ratings": 25,
    "price": 4.79,
    "description": "The War of 1812. Northwest Frontier. William Aubrey, a rogue redcoat of the once-glorious 41st Regiment of Foot, is on the run. Wounded and tired, he seeks shelter during a thunderstorm inside an abandoned barn. But when he gets there, he finds he’s not alone...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396860/header.jpg?t=1461001559",
    "minimum_requirements": "OS: Vista or later Processor: 1.8 GHz Pentium 4 Memory: 1 GB RAM Graphics: 1366x768 DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Over the Hills and Far Away isn't a war story, where you see a brave soldier who win a glorious battle and comes back home to his wife and kids. It's a story about a soldier who choose to live instead of dying on the battlefield, and a child who got sold into slavery and who dreams of coming back home to her village.  This is one of my favourite stories, and I'm actually a bit sad that I bought it during a -75% sale because it feels like I paid too little for something great. Everything about it is absolutely wonderful, the way the game is written, the lovely watercolour style and the characters.   Would I recommend Over the Hills and Far Away? Yes, I'd probably force people to buy it because it's such a great story.",
            "review_score": "1"
        },
        {
            "review_text": "No matter who wins or loses a war there is always pain left behind -for the victor, the vanquished, and even for those who try to remain neutral. Set in the War of 1812,  Over The Hills And Far Away  tells the story of a soldier and a little girl on the run in a harsh and unforgiving world. This game is a kinetic visual novel, meaning there are no choices to be made, the entire experience is reading. While this may not be everyone’s cup of tea the story itself is very much worth it as this is  an engrossing piece of historical fiction.   In the game you follow an Englishman named William Aubrey, a redcoat who was conscripted into the British army and sent to fight in North America. While the game doesn’t require you to be an expert in American history it does require you understand the basics of the period. Aubrey, as the game refers to him, has abandoned his regiment due to its poor leadership and is now wounded, on the run from his own countrymen and American forces. Aubrey takes refuge in an old barn sharing the space with a young native girl. Finding her name too hard to pronounce, he nicknames her “Mai”. What follows is a touching story of two people from different worlds trying to find the same thing- safety and happiness.  Through Mai’s innocence Aubrey becomes slightly less jaded and more aware of the plight of the native people in America , a theme featured heavily in the game.   The artwork in the game is lovely , the models are well done and really express each character’s personality. There aren’t many characters in the game as most of the time is spent with Aubrey and Mai and we rarely see much of Aubrey at all so a lot of the time you are stuck looking at just the background images while reading text. Thankfully, there are a few scattered cutscenes mixed in during certain plot points which add to the visual appeal of the game. The music is also enjoyable, fitting of the time period and location of the story. You can purchase the soundtrack separately as well.  The game is a visual novel and being as there are no choices to be made there is little in terms of gameplay here. The game runs well, all the menus are easy to read and you are given basic options that I feel any visual novel should have; mainly adjusting the text speed and the ability to put the text on autoplay. Since  it is a kinetic novel , the autoplay feature allows you to sit back and relax while reading along. The game also has a gallery so that you can look at past cutscenes, concept art and background art at your leisure.  This is an outstanding piece of work, the story is rich and the characters are enjoyable and I found them easy to relate to as well. I enjoyed the historical background of the story, I even learned a few things as well.  Over The Hills And Far Away  has many different layers to it, the harshness of war, the treatment of native people, a person’s own struggle to find where they belong but it’s all told wonderfully in this visual novel format with great art and music to move along with the story.  The game also has Steam trading cards and achievements  that you can easily get by just playing through the story so that is also an added bonus. It may not be the happiest of stories, but most happy stories to come out of war are despite the war, not because of it. It’s worth reading, so open yourself up to something new.   Lunar Productions  [lunarproduction.com] ",
            "review_score": "1"
        },
        {
            "review_text": "'When your time comes to die, be not like those whose hearts are filled with fear of death, so that when their time comes they weep and pray for a little more time to live their lives over again in a different way. Sing your death song, and die like a hero going home.' - Tecumseh (qtd. in the beginning of the novel)  Over The Hills And Far Away is a kinetic novel, meaning there are no choices to be made. You simply either click or auto-progress through the story. It took me about two hours to read through, though I took a couple short breaks.  + Great writing! The characters interact naturally, languages mix in in creative ways, and the pacing is just right. + Excellent art. The artwork is consistent stylistically and fits descriptions well. Only complaint here is that I wish there was a bit more. + Beautiful soundtrack. The orchestral score both built and melted tension as the story called for it. It layered with the writing without overpowering it. My only complaint sound-wise is that the bird call loop was a little too short and got a bit annoying in one of the sections.  It's an emotionally intense story that asks some serious questions of the reader. Set aside a couple hours and experience it in one shot if you can. It will be time well spent.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a short, sweet and touching experience, look no further than this.  Despite the limited visual assets of the game and the short length, Over the Hills and Far Away took me by surprise in the best way possible. I couldn't have predicted that I'd get so emotionally attached to characters in such a compact story - I'll admit, I cried. T_T Though I felt the story was somewhat predictable, it was immensely enjoyable, and I found myself smiling, admiring, and laughing very often at the little details and foibles that were lovingly woven into it. I loved the care and attention that went into the art and character designs, and I adored the soundtrack, which was breathtaking - I will definitely be buying the soundtrack.   This delightful Visual Novel ticks all of the right boxes for me, and I would heartily recommend it to anyone who appreciates authentic, heartfelt storytelling.",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 Really got me in the feels ;_;  Gifted to me from MistressNinja",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely beautiful story. Other reviews here can discribe all the technical details far better than I, but all I can say is it is a well told , touching story of two people of different cultures and backgrounds lost in a war torn world. The game is short, but I enjoyed every minute I was playing, and will never forget the story and how it effected me. Runs very well on Linux too. If you enjoy VN, it simply is a must buy. For those who are not VN fans, but are curious about the genre, Over The Hills And Far Away would be a great game to start with. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't offer you any choices, but its a pretty decent VN. I hope they make a sequel to this.",
            "review_score": "1"
        },
        {
            "review_text": "Short and nice kinetic VN with an average ending. At 70% is really worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "too short, too shot, literally A to B with no other route (if you are spoiled don't buy, not worth it) but I feel guilty to buy this when it discount, it's very heartwarming    and heartbreaking at the same time. SOMEBODY END THIS SUFFER!     My Final Score - 8.8/10   ",
            "review_score": "1"
        },
        {
            "review_text": "While I'm admittedly relatively new to the visual novel genre, I thought both the 'visual' and 'novel' aspects of this game(?) were lackluster at best. It wasn't a terrible experience, I'd recommend it to fans of the genre when on sale for a buck or two.",
            "review_score": "-1"
        }
    ]
}