{
    "app_id": 396930,
    "name": "Tidal Affair: Before The Storm",
    "release_date": "2015-11-24",
    "developer": [
        "Overcurfew"
    ],
    "publisher": [
        "Overcurfew"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 5,
    "positive_ratings": 13,
    "negative_ratings": 6,
    "price": 6.99,
    "description": "Tidal Affair is a stealth adventure game that immerses you in the midst of conflict between pirates, rebels, and what governs the islands of Alter Tides.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/396930/header.jpg?t=1462749923",
    "minimum_requirements": "OS: Windows 7/8 Processor: 1.7 GHZ Memory: 2 GB RAM Graphics: 512 MB DirectX 9.0c compatible graphics card DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you're worried about this being a visual novel because of the title, worry not.   It's a stealth adventure where you can sneak around mind-controlling people. Atmospheric, with lush jungle environments, feels like you're moving through a painting. Painted isometric games are extremely far and few between these days, so snap this up if you're a fan. The visual style is eyecatching and evocative. I was rather surprised to learn that the game itself was created in only ten months, as there's a tonne of content in it. Levels are easy at first but rapidly evolve in complexity to require careful planning and skilled puppeteering.  I'm not a fan of stealth games in general, but it was compelling enough that I found myself staying up well past midnight to get to the next level... and the next... Support more original titles like these by indie devs on Steam!  NB: I highly recommend using the controller instead of keyboard/mouse if you have one available.",
            "review_score": "1"
        }
    ]
}