{
    "app_id": 397040,
    "name": "Sphere III: Rage of the Devastator",
    "release_date": "2015-12-02",
    "developer": [
        "NIKITA ONLINE"
    ],
    "publisher": [
        "NIKITA ONLINE"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "RPG",
        "Massively Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 144,
    "negative_ratings": 165,
    "price": 0.0,
    "description": "Take a journey to an epic fantasy world of Sphere 3: Rage of the Devastator, the PvP-based MMORPG with hardcore non-target system! Play it for free to experience massive battles, breathtaking castle sieges, deep storyline and even more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397040/header.jpg?t=1532678160",
    "minimum_requirements": "OS: Windows XP, Vista or Windows 7,8,8.1 (32 or 64-bit) Processor: Dual core more than 2 GHz Memory: 2 GB RAM Graphics: Shader 3.0 support Geforce 6600, Radeon X1600, 256 Mb RAM and DirectX 9.0c support DirectX: Version 9.0c Network: Broadband Internet connection Storage: 6 GB available space Sound Card: DirectX support",
    "recommended_requirements": "OS: Windows XP, Vista or Windows 7,8,8.1 (32 or 64-bit) Processor: Quad-core more than 2 GHz Memory: 4 GB RAM Graphics: Shader 3.0 support Geforce 8800, Radeon HD4000, 512 Mb RAM and DirectX 9.0c support DirectX: Version 10 Network: Broadband Internet connection Storage: 6 GB available space Sound Card: DirectX support",
    "reviews": [
        {
            "review_text": "gotta love these sorts of games, you get your choice of 4 races, 2 are locked btw, and you get your choice of 9 classes, but if you want to play the first 3 or last 3, your female, but if you want the middle 3, then your male. also their idea of a non-target system is that the system will auto lock onto anything near your cursor, so its not actually a non-target system. oh, and before i forget, its just funny to watch everyone attempting to jump over the fence, but the devs messed up the jump system, so all you see is 4-12 people all stuck on the fence in the jump animation.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is definatly beta, lots of bugs. Not well balanced with some classes getting benefites in gear and others not. The player community is very nice, though. Issues are being resolved so be patient with the game. ",
            "review_score": "1"
        },
        {
            "review_text": "Coming from a great game of Mortal Online, I decided to try this out, It showed promise and ideas of similar style to Mortal until i installed it, Combat is rubbish, Even for archers you get aim assist, NOT FREE range targetting like reviews explain for this game. If it were more like mortal with its combat hit boxes in the pvp realm then yes this game might actually be decent as an open world pvp game, The immersion isnt there except its graphics, things are automatically given over level progression instead of earned or researched. All in all its another World of Warcraft trying to pretend to be an immersive 'hardcore' pvp game. If your crosshairs ARE NOT on the target VIA arm, head, chest, legs, etc arrows, melee attacks, and spells should register a miss not CURVE towards them like you have auto aim. 2 / 10 Nice try guys on the combat system.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been gaming for over 30 years. This is probably THE worst mmorpg I've ever played. The graphics are early 2000's at best. Quests are ridiculously long and way too spread out and you only get a TEMPORARY mount for like, a day. It takes longer to level in this game than ANY other I've ever played. The non targeting system completely sucks. I always make my main a healer and when you're trying to heal your tank, but you can't lock on to him and he's bouncing all over the place...I think I *actually* healed a mob. &gt;.&lt; Save yourself the trouble. This game blows. One of the better FTP MMORPG's that I played for years is Shaiya. I was explaining to one of my kids that Sphere III is like if Shaiya had a mentally challenged little brother. Soooo, yeah. I'm gonna give it another day ir two, but I don't see me wasting much more time on it. Somebody spread some love and get me a REAL mmorpg off my wishlist! &lt;3 ;)",
            "review_score": "-1"
        },
        {
            "review_text": "+Big ♥♥♥♥ for girls +Skip intro +Many classes +NO P2W +Good story pictures  -Attack delay -Gender locked for classes(ex: human female for assassin) -No sound for dialogues -You can run with your character through monsters -Jump and floating in the air for 2 seconds -2 races locked -Bad textures -Character customisation limited  Good Uninstall,no problems. Download and try this game for yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "i think its region lock on some country  cant play it, cant play it",
            "review_score": "-1"
        },
        {
            "review_text": "Game is completely dead and has connection issues. Avoid this and play one of the other Action MMOs.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so damn generic and it feels like 10 years old - there are so many much better f2p MMORPGs out there that I definitely can't recommend this one - if you have some time to waste (like I did^^) give it a look for yourself ;)",
            "review_score": "-1"
        },
        {
            "review_text": "A game released in 2015 which doesn't recognize mouse thumb buttons.  Shame.",
            "review_score": "-1"
        },
        {
            "review_text": "i wasted 30 minutes of life",
            "review_score": "-1"
        },
        {
            "review_text": "A very helpful review.",
            "review_score": "1"
        },
        {
            "review_text": "If you are mmorpg player and started playing in mid 2000 games like Lineage 2 c1 or Kalonline you feel here like at home. This game is PvP oriented with alot of grind for exp. At lower lvls around till 20 there are alot of quest which are generic kill and loot stuf. Later quest will end and you will have to grind on mobs to level up and get around new 10-15 quest which give you 1/3 exp of your current lvl and than you grind again to next lvl. Every class have capability to solo AoE grind, some classes are better in that case. I think best way to level up is AoE grind after lvl 20 becouse later it takes you 30min to complete 1 quest which gives you 10k exp and you can get that much amount in 2min with AoE on mobs.  Pros: There is solo pve arena where you have to defeat waves of mobs. Total 45 waves  Dungeons and World bosses Good optimized game runs on any toaster like 10 years old rig There are castles where clan control it which gives good rewards for clan members Non target combat system PvP (with PK system) and PvE server  Cons: Gender locked classes Low population atleast on pve server demon side Server lag Game feels unfinished alot basic things are missing and need improvement. For things like UI, chat, AH, no friendlist yet Jumping is awkward Brainless grind on mobs to level up NO skill reset for gold, be carefull with your build if you mess up it can cost around 30$ to reset  Is this game P2W? At current state i would say no but there is possible to upgrade your weapon and armor pieces +20 which IS impossible without spending ridiculious ammounts of money and i dont need your theory that if you have milions of gold and thousands of upgrade scrolls you may success. As free to play player you wont get above +10 on weapon or armor becouse even +7 is hard enought to enchant or upgrade. For future my suggesion would be make max upgrade +15 so gap between wallet warriors and freeloaders wont be so high.  I recommend this game to players only which are expierenced with mmorpg and dont mind brainless grind and like pvp. This game wont hold your hand, you have to solo alot which can be tedious unless you start playing with few friends. Also if you die you lose exp and your gear lose durability which cost quite abit gold to repair If you are casual or new to mmorpg genre i would suggest playing something else there are better alternatives  Im still playing this game while i do see potential and with more people those castle sieges and dungeons could be fun  I rate for now 6/10 will update later  UPDATE 04.01.2016  Not playing anymore reasons: game bugs, problems with server, random dc, game keeps crashing. Most important thing game is ghost town feels like playing a bad single player game where you spend 8 hours everyday killing same type of monster on same place for any unknown reason   rate 4/10",
            "review_score": "-1"
        }
    ]
}