{
    "app_id": 397180,
    "name": "Command: Northern Inferno",
    "release_date": "2015-10-22",
    "developer": [
        "WarfareSims"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Wargame"
    ],
    "achievements": 0,
    "positive_ratings": 30,
    "negative_ratings": 7,
    "price": 14.99,
    "description": "Command: Northern Inferno is a stand-alone game that uses the latest version of the Command: Modern Air/Naval Operations (CMANO) engine. Do you have what it takes to stand up to Soviet/WP forces and avert Armageddon?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397180/header.jpg?t=1553876614",
    "minimum_requirements": "OS: Windows XP SP3 / Vista / 7 / 8/10 Processor: Dual-core Pentium and above Memory: 1 GB RAM Graphics: DirectX 9.0c compatible video card with 16 MB RAM DirectX: Version 9.0c Storage: 10 GB available space Sound Card: DirectX 9.0c compatible sound card Additional Notes: Requires Windows Media Player",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "+ Incredible level of details + straightforward interface that allows total control... or let the IA do the job + tons of fan made scenarios (you will need CMANO though)  - 50 years ago, owning the information contains in the database will send you to jail for spying activities - nuking is fine... and fun - you will need to sleep at some point  Northen Inferno is an excellent introduction to Command Modern Air Naval Ops, I have played many wargames and this simulation is the top gun.",
            "review_score": "1"
        },
        {
            "review_text": "I got my first triumph after 10 hours.  But damn, I dont have a single idea about how did I won.  Such simulation, much wow.",
            "review_score": "1"
        }
    ]
}