{
    "app_id": 397190,
    "name": "Sengoku Jidai: Shadow of the Shogun",
    "release_date": "2016-05-19",
    "developer": [
        "Byzantine Games"
    ],
    "publisher": [
        "Slitherine Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Includes level editor"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Military",
        "Historical"
    ],
    "achievements": 0,
    "positive_ratings": 71,
    "negative_ratings": 24,
    "price": 22.99,
    "description": "Sengoku Jidai: Shadow of the Shogun is a turn-based tactical and strategic game set during the Sengoku era; primarily focusing on the Japanese Warring States period and Japanese Invasion of Korea.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397190/header.jpg?t=1524740076",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8/ 10 Processor: CPU: Intel Pentium 4 or equivalent Memory: 1 GB RAM Graphics: Graphics: 256MB DirectX card DirectX: Version 9.0 Storage: 1.5 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ukiyo-e: The Game. Everyone who appreciates human civilization should get this, 'grog' or not.  This is not a 'poor man's Total War' as some reviewer below was misled (?) to think; it's a miniatures wargame ported to digital form. And what a thoughtful port it is!  For me, this game does capture the very essence of what 'TW: Shogun' - the original TW title back in 1999 - was meant to feel and transpire: a tactical (not strategic) chalenge, but foremost a slice of taste of a particular era in history I was not familiar with, and became fascinated since.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the masterpiece of pike and shot style game with amazing music and very impressive artwork. The ukiyo-e style is well embedded in the game. I could see the talent of these game designers. The game mechanism is also well-designed to try their best to show what the 16th century oriental war would be like. Some of the reviewers may not like the mechanism of pursuing and think it is out of control. However, from the game perspective, I like it since it could prolonged the manoeuvre distance. From the historical perspective, if someone studied battle of Kawanakajima, you could see wrongly pursuing could cause confusion. So using charge carefully and wisely is quite vital.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love Slitherine games. I've put more hours into Battle Academy than any other game I own, so every time I see a new game using the BA engine, I usually take the bait.   I wanted to love Sengoku Jidai. Just like Pike &amp; Shot, the game is aesthetically beautiful. The period artwork is gorgeous, and along with the great music, really provides an immersive experience.  What killed both games for me was the pursuit mechanic. I look at turn based wargames like games of chess. I want to plan my strategy, and develop it by thinking several turns ahead. What I don't like is having control of the game ripped away from me by the game mechanics, and not the cunning tactics of the enemy. It's simply impossible to implement an overall strategy when every time a unit breaks, the victorious unit automatically chases it. You end up with units vanished off the map, with no idea when or if they'll return. Other units have rallied at random points outside of command range, and even getting them back into action is going to be a tedious chore. The only actual chance you get at strategy is in your initial deployment, because once your units make contact, you essentially lose control of them. They are locked in melee combat for multiple turns until one breaks, then the victor compulsively chases the loser around the map. I've literally spent four turns or more without issuing a single order. Once all the automation is finished, the battle has devolved into a scattered mess, and any sense strategy is lost.  Until the pursuit mechanic can be toggled off in the settings menu, I'll have to look elsewhere. I'm bummed about this. ",
            "review_score": "-1"
        }
    ]
}