{
    "app_id": 397210,
    "name": "Kanji Training Game",
    "release_date": "2015-09-23",
    "developer": [
        "Targhen Games"
    ],
    "publisher": [
        "Targhen Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Education"
    ],
    "achievements": 0,
    "positive_ratings": 65,
    "negative_ratings": 15,
    "price": 3.99,
    "description": "Kanji Training Game is a game that helps you learn the Japanese writing system in the form of a game. Memorize 1006 symbols of Kanji, Katakana and Hiragana, and level up as you advance through the increasingly complex alphabet and words of the Japanese language.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397210/header.jpg?t=1488002205",
    "minimum_requirements": "OS: Windows 7 Processor: 1Ghz Memory: 512 MB RAM Graphics: Intel HD Graphics 4000 DirectX: Version 9.0 Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "From the get-go, this game doesn't replace actual studying for kanji on your own. It is more of a memory mix-and-match type of deal. To make matters worse, the game itself is riddled with bad localization and transliteration errors most likely resulting from Japanese phonetical spellings into English such as (but not limited to): luggage - laggage, livelihood - libelihood.  Doesn't come close to providing help for actual kanji studying. Don't touch with a ten foot pole.",
            "review_score": "-1"
        },
        {
            "review_text": "I found this to be quite a good program. I agree, you don't learn Japanese from the ground up. If you want a program that does everything, you will have to look elsewhere and expect to pay a lot more money. However, this program compliments any form of book or online study that involves reading and recognition. Even at entry level this program is useful, because quizzing yourself is essential, if you hope to get anywhere.   When you launch the game, beginners can select hiragana and katakana quizzes. Once those are mastered, you can devote more time to the different grades of kanji. I don't know what constitutes a grade, but I find each one manageable and not overwhelming.   Each quiz is random, but if you repeat a quiz 5 to 10 times a session, you will notice the value of doing so. Some kanji repeats while others are introduced. I find it easy to take note of the kanji I don't know, study them in my spare time and do another session of multiple quizzes at a later time. I also look up words related to the kanji I learned in a previous quiz and expand my vocabulary a little. Kanji is intimidating. The game seems to take the confusion out of knowing where to begin, so it is a big timesaver.   I'm learning Japanese as a hobby, so I don't want to spend a lot of money on online classes or foreign language software. I use books, websites, and communicate with a few Japanese friends on Facebook regularly, so this program suits my needs perfectly. I highly recommend it to anyone in a similar situation. Sure, this program could use a few fixes and added features, but if you prefer something that compliments speaking, grammar, or an overall more comprehensive material like stroke order or background, look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "Learning Hiragana, Katakana and Kanji in one game. Pretty good if you struggle to remember these stuff. Good choice of music as well. You also learn to recognize the characters faster when you look for them  Only minus I feel about this game is that it's slow. If you don't remember what character ''Bu'' is for example, it takes a few seconds until the correct character is highlighted. Would spare me the waiting if the developers added an option where the correct character got highlighted if you clicked at the wrong character.   But else, I think that this is pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game if you are learning Japanese.",
            "review_score": "1"
        },
        {
            "review_text": "If you are thinking that it might be fun or nice to learn Japanese writing system, then save your money and time. If you are truly motivated and have dedication then this is a great tool to help you learn.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice! relaxing music.",
            "review_score": "1"
        }
    ]
}