{
    "app_id": 397320,
    "name": "CTU: Counter Terrorism Unit",
    "release_date": "2016-04-22",
    "developer": [
        "Odin Game Studio"
    ],
    "publisher": [
        "Excalibur Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Workshop",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Action",
        "Tactical"
    ],
    "achievements": 0,
    "positive_ratings": 23,
    "negative_ratings": 50,
    "price": 3.99,
    "description": "Join the CTU, arrest dangerous terrorist threats, use gadgets including the snake cam and play online with up to five player co-op",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397320/header.jpg?t=1528357162",
    "minimum_requirements": "OS: Windows 7 or above (all OS must be 64bit) Processor: Intel Core i3 2.4GHz or equivalent Memory: 4 GB RAM Graphics: Dedicated graphics card with 1 GB memory DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 or above (all OS must be 64bit) Processor: Intel Core i5 3ghz or above Memory: 6 GB RAM Graphics: Dedicated graphics card with 2 GB memory DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Graphics are really bad and gameplay is clunky. Best Graphcs are the menu screen. SWAT 4 was a lot better at both and that was years ago. Apply for refund after 15 min.",
            "review_score": "-1"
        },
        {
            "review_text": "  the game is full bugs at are not fixed from day 1 i beta tested the game and bug are still not fixed  DO NOT BUY",
            "review_score": "-1"
        },
        {
            "review_text": "'Get Down' *Arrests Terrorist* *Shoots In The Head And Body Get Glitched In The Roof* 10/10 would arrest terrorists again!",
            "review_score": "-1"
        },
        {
            "review_text": "Looking at the how the guns feel and if you could breach doors with the shoty from the hinges would be niced. Still early access and charging so take the risk if you want to see developing prossesses, me too. I am leaving (a 1st viewing review and will level it as should ♥♥♥♥) edit at 2209 ], it a has potenal with a skunk cost added if you buy it now wait tell the skunk is desented., even if some leather clad noseless ghost does it for you.",
            "review_score": "1"
        }
    ]
}