{
    "app_id": 397500,
    "name": "Labyronia RPG 2",
    "release_date": "2015-08-28",
    "developer": [
        "Labyrinthine"
    ],
    "publisher": [
        "Epic Quest Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Anime",
        "RPGMaker",
        "RPG"
    ],
    "achievements": 6,
    "positive_ratings": 391,
    "negative_ratings": 129,
    "price": 0.79,
    "description": "You return to the land of Labyronia, now in the cold grip of an evil force. Roam the wartorn lands. You are the only one who can save the planet from destruction. The epic sequel to the critically-acclaimed Labyronia.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397500/header.jpg?t=1492976008",
    "minimum_requirements": "OS: Windows 98, XP, Vista, 7, 8, 10 Processor: Intel Pentium III 800 MHz Memory: 512 MB RAM Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I have mixed feelings about this sequel. First of all, the gameplay is still turn-based RPG, which is exactly what I wanted. The world is the same as the first game, but far more bleak and hopeless (this is not a drawback to me). I got additional party members early on, and I can use one joystick for both movement and menu selection, so those improve on the original! However, I feel like the writing was weaker in the second game, possibly due to the increase in 'zany' characters, who came off as irritating and not funny at all. I noticed more grammatical errors and exclamation point spam as well, which could mean I'm just being more picky with the sequel. That said, I still enjoyed the gameplay, and most of the puzzles (a few were not intuitive at all, and one made me rage-quit for a day), and I'm curious to see where the story goes from here. If you liked turn-based retro JRPGs, liked the first game, and are willing to put up with some mediocre writing, I'd say you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "Stick with Labyronia 1 and don't buy the sequel, it's far less engaging and in my opinion has less desirable features.   It feels like a rushed attempt to cash in again on what was a good original game.   Labyronia 1 I do recommend however.",
            "review_score": "-1"
        },
        {
            "review_text": "Labyronia 2 RPG is the sequel of Labyronia RPG. ( Obviously, Duh!? ) Being inlove with Labyronia RPG, I am excited to play the next story but . . .  -They changed the graphics but as time passed by, you will adjust to it.  Example, the chest are well blend in the environment. ( Who doesn't want easy chest? )  -The High-pitch sound. ( It makes me cringed, mostly at night. )  -The battle scene and effects. ( Something is not right. Maybe the status effects? )  I have to say that Labyronia RPG is way better.  Although, the story of Labyronia 2 is same as awesome as Labyronia RPG!",
            "review_score": "1"
        },
        {
            "review_text": "Lovely small game. Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A fitting sequel to the amazing 1st Labyronia, if you owned the first 1, you will Love it!",
            "review_score": "1"
        },
        {
            "review_text": " The Hall of Madness is insane! 2spooky4me. (Whispering SFX)!",
            "review_score": "1"
        },
        {
            "review_text": "A must if you played Labyronia RPG as it continues the story down paths you never could predicted. It is great seeing old characters and watch them develop as they struggle to try and right their wrongs once again.",
            "review_score": "1"
        },
        {
            "review_text": "Ez card farming 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good luck binding your keys and changing your audio  2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Thats it I'm done Too many things in this game are just impossible - frigging rolling balls this time what next so sorry to say my review is a big negative...You could give people a chance to switch off these 'puzzles' they aren't fun for people like me who have problems with hands and just want a game to play that's fun with a bit of a challenge not impossible speed tests multiple times in different areas   What did you run out of ideas and just reused from previous section...",
            "review_score": "-1"
        },
        {
            "review_text": "frist one was bad and this one was just as bad so ya if that says anything",
            "review_score": "-1"
        },
        {
            "review_text": "Great game,  to idle for cards.",
            "review_score": "1"
        },
        {
            "review_text": "Pros : - Labyronia Sequel - Amazing Story - Good Soundtrack - RPG - Cue System - Trading Card &amp; Achievement  Cons - Map Smaller than Labyronia 1",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the first one you will enjoy this as well.",
            "review_score": "1"
        }
    ]
}