{
    "app_id": 397690,
    "name": "Hyperspace Invaders II: Pixel Edition",
    "release_date": "2015-09-04",
    "developer": [
        "Entity Medialab"
    ],
    "publisher": [
        "Black Shell Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Bullet Hell"
    ],
    "achievements": 18,
    "positive_ratings": 295,
    "negative_ratings": 67,
    "price": 3.99,
    "description": "Hyperspace Invaders II: Pixel Edition is a hardcore, uncompromising vertical scrolling bullet hell/invader hell shooter (shmup) that doubles as a techno-based lightsynth, triggering bursts of funky invaders at the pulse of a relentless beat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397690/header.jpg?t=1483448965",
    "minimum_requirements": "OS: 7 Processor: Dual Core 2GHz Memory: 1000 MB RAM Graphics: 1GB DirectX: Version 8.0 Storage: 80 MB available space",
    "recommended_requirements": "OS: 7 Processor: Quad Core 2.4GHz Memory: 2000 MB RAM Graphics: 2GB DirectX: Version 8.0 Storage: 80 MB available space",
    "reviews": [
        {
            "review_text": "  Hyperspace Invaders II: Pixel Edition  is a truly outstanding arcade shmup that finds the perfect balance between precision shooting, strategy, and trippy chaos.  Well worth the small asking price. Dim the lights, crank up the volume and get comfortable with a controller, and enjoy the awesome experience.   Essentially, in this schmup, you only need the left stick and a button.  Shooting is on auto, so all you gotta do is dodge. As you kill stuff and collect 'souls', your main weapon becomes stronger. If you push the button, you fire a beam that kills bullets, but weakens your main gun. Simple mechanic, yet jam-packed with possible strategy.   Pros:  +Awesome trippy bullet hell experience that is totally unique +Too cheap +Music is really great, and the game goes along with the beat +Visuals find that sweet spot between being really overwhelming, yet never too chaotic that it is frustrating +Steam leaderboards keep me coming back for more   Cons:  -There isn't a ton of content, BUT it'll take you a good bit of time to finish   If this looks like your thang, don't hesitate - I assure you that it is. ",
            "review_score": "1"
        },
        {
            "review_text": "It's a really simple concept, but it's intense and kept me engaged. Great game, I would reccommend to just about anyone.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "It's like Touhou and Space Invaders had sex and the result was this. The soundtrack its really amazing, getting me pumped and I just can't stop bobbing my head to the beat. Seizure inducing though for those of you who are epileptic. Nevertheless, it got me very addicted to it when I first got it. It does get a bit slow on some parts when there's just too much bullet on the screen, my computer can't take it. I'm a big fan of bullet hell type games, and if you are too. Check this game out. As idubbbzTV would say: 'Heyy. That's pretty guud'",
            "review_score": "1"
        },
        {
            "review_text": "Scoring system is completely irrelevant because the RNG is everywhere. And game keep crashing because there's litteraly too much stuff on screen (and I know my computer can normally handle bullet hell and most other ressource-intensive games) Has pretty colors (WARNING : CAN CAUSE SEIZURE), and music can have it's fan.  Otherwise, don't get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "MY EYES!!!!!!!!!!!!!!!!!  It's rather good ;0",
            "review_score": "1"
        },
        {
            "review_text": "___________________________________________ ############################################################################################ FATAL ERROR in action number 1 of Draw Event for object bpb04:  Fatal Error: Can not create vertex buffer of size 98304 bytes 9581 vertex buffers allocated with total size of 921696 KB at gml_Object_bpb04_Draw_0 ############################################################################################ ",
            "review_score": "-1"
        },
        {
            "review_text": "It's very good but holy crap the menus will give you seizures even without epilepsy. During the game itself it wasn't too bad, maybe because I wasn't trying to read.",
            "review_score": "1"
        },
        {
            "review_text": "Space Invaders on drugs X.X",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me a epileptic seizure.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "i had the game free and got it first   the game is very good   would be again   rating 100/10",
            "review_score": "1"
        },
        {
            "review_text": "My $850 Custom PC runs the last few levels at 6 FPS.     GG. Good game though. Really challenging.",
            "review_score": "1"
        },
        {
            "review_text": "I dropped acid 10 minutes in,  Nothing changed.  9/11 would enjoy again.",
            "review_score": "1"
        },
        {
            "review_text": "Well... I'm giving it the thumbs up because I like the idea. It's a lot of fun with loads (I mean LOADS) of crazy things going on. However, I'm running a fairly decent gaming rig with plenty of power and still run into constant fatal crashes. I hope that this can get fixed soon.",
            "review_score": "1"
        },
        {
            "review_text": "After so many years, they finally found it... The rumours were true... It really does exist...  POLYBIUS, GET IT NOW FOR THE LOW LOW PRICE OF $5 AND YOUR CHOICE FROM HEADACHES, SEIZURES, AND FOR A LIMITED TIME ONLY, CEREBRAL CORTEX DYSFUNCTION!  THIS OFFER IS CRAAAAZY SO BUY IT BEFORE THE GOVERNMENT GUYS TAKE IT AWAY AGAIN! :D ",
            "review_score": "1"
        },
        {
            "review_text": "Game Crashed Because Of To Many Enemys On Screen In The Final Level. 10/10 Would Play Again",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and rage inducing, thank you for my new obsession.    Very psychadelic i reccomend to people who like the asthetic and difficulty of the impossible game and super hexagon. not for people with eppilepsy AT ALL!!!!!  EDIT:Great for those who love classic arcade games but want a challenge",
            "review_score": "1"
        },
        {
            "review_text": "Epilepsy Inducer 2015",
            "review_score": "1"
        }
    ]
}