{
    "app_id": 397780,
    "name": "A Wise Use of Time",
    "release_date": "2015-09-04",
    "developer": [
        "Choice of Games"
    ],
    "publisher": [
        "Choice of Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Choices Matter"
    ],
    "achievements": 38,
    "positive_ratings": 88,
    "negative_ratings": 19,
    "price": 5.19,
    "description": "With the power to freeze time, you can ransack a casino, rescue a celebrity, or cheat death itself! A thrilling interactive sci-fi novel.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397780/header.jpg?t=1538615287",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's like corruption of champions without the porn.",
            "review_score": "1"
        },
        {
            "review_text": "The touting of this product claimed that there was so much written content for this, that it could go in any direction.  It didn't.  You have three choices of lifestyle, and two out of only three attributes to choose from. You always start with the same job, live in the same place, and are always stuck helping your two roommates even though you might decide not to like them or talk to them at all.  I think I paid less than five dollars, but for some people, it's about 'how much enjoyable time will I spend with this,' and I was done, 2 times through, after about 400 screens of reading (2 hours).  Regardless, there were very few misspelled words or bad punctuation. But all-in-all, it seemed like just another software designer's ego-flex.  ~Pozzy Thump",
            "review_score": "-1"
        },
        {
            "review_text": "Gahhhh!!! After trying many times and failing I have finally found the ending I wanted. Saved olivia, rescued raj, killed barnabas, found the truth about my father, made a breakthrough with Dr.Oden, experienced the beauty of the nature with malaya. It was an awesome story as I have expected from Choice of Games. Not the best one because Choice of Robots will allways be my favorite but this game also was a wise use of time...",
            "review_score": "1"
        },
        {
            "review_text": "You must flee! Don't try to be a hero or you will end up a corpse just like me.",
            "review_score": "1"
        },
        {
            "review_text": "Better than I expected and a damned good price. More replay value than most games.  It's oddly very ... PG-13. Considering the nature of the main plot device, I found that very odd.  This game would be excellent if you could actually make truly devious choices.  6.5 of 10",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Felt like most of my choices made a difference in the story development. If you're a fan of 'Choice of Games', you should definitely consider getting this",
            "review_score": "1"
        },
        {
            "review_text": "The first game to allow me to become a time-controlling serial killer. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "For what's on the steam market, this game really freshens up my library. This game tells a really good story, and I absolutly ADORE the choose your own adventure aspect. When I bought this game, I really wasn't sure what I was getting myself into, but as I read on, I became more involved with what was going on. The choices that you make determine what happens in the story, and you can't go back, giving you a desire to replay and learn what you could have done. All in all, great story, well diverse people and interests, and intriguing sub-plots. Can't wait for the sequel or spinoff to this game. 10/10 would stop time to read this again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is easily probably one of my favourites that I've played from Choice of Games! It's well written and engaging, and it's fun to read not only the first time, but even on the second, third, and fourth playthroughs (I'm an addict)! I won't give away any plot details or anything, but I can say, without doubt, that this game is... A Wise Use of Time. Fun, fun, fun!",
            "review_score": "1"
        },
        {
            "review_text": "This features a good story, with interesting decisions. It's quite replayable, as although the major story structure remains the same, the side-stories vary depending on your actions. There are also plenty of achievements to get, which encourages multiple playthroughs.",
            "review_score": "1"
        }
    ]
}