{
    "app_id": 397700,
    "name": "Urizen Shadows of the Cold Deluxe Frosty Edition",
    "release_date": "2015-08-31",
    "developer": [
        "Red Moon Studio"
    ],
    "publisher": [
        "Red Moon Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 44,
    "positive_ratings": 26,
    "negative_ratings": 97,
    "price": 1.69,
    "description": "DELUXE FROSTY EDITON OUT NOW!!! KEYBOARD AND JOYSTICK COMPATIBLE. STEAM ACHIEVEMENTS ARE HERE!!! Stretch across lands of unforeseeable cold, and trouble in Urizen Shadows of the Cold Deluxe Frosty Edition.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/397700/header.jpg?t=1555052942",
    "minimum_requirements": "最低配置: 操作系统: Windows XP and Higher 处理器: Dual Core and Higher 内存: 3 GB RAM 图形: Pentium Family Graphics DirectX 版本: 9.0c 存储空间: 需要 187 MB 可用空间",
    "recommended_requirements": "推荐配置: 操作系统: Windows XP and Higher 内存: 4 GB RAM DirectX 版本: 9.0c 存储空间: 需要 187 MB 可用空间",
    "reviews": [
        {
            "review_text": "This game sucks 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Urizen Shadows of the Cold appears to be an interesting game based off of lore described on its Steam store page. It is presented well. However, this game implements 8-bit style graphics. While this can be done well, it was done poorly in this situation. It is butt-ugly. This game also does not allow keyboards to be used. This game is on the PC and should be able to do so. I do not own a joystick. As such, gameplay was not decent and the controls were very unintuitive. The music is present and seems to be decent, but I was only able to listen to the start menu music. This game does count towards number of steam games and has trading cards. As such, I would pay 50 cents for the game.   If you are reading this and are the developer, please add keyboard controls. I do want to try this game.  Note: I recieved a key for this game in a giveaway.",
            "review_score": "-1"
        },
        {
            "review_text": "Total trash.  You can run game but you can't play it. Had to wait in games so that I can write this review.  Save yourself.  Hidden!",
            "review_score": "-1"
        },
        {
            "review_text": "I dont know if i should put you through the suffering but plug in a controller to be able to play....but please, dont blame me for what happens next...im sorry...so sorry...",
            "review_score": "-1"
        }
    ]
}