{
    "app_id": 398170,
    "name": "Evochron Legacy",
    "release_date": "2016-01-18",
    "developer": [
        "StarWraith 3D Games LLC"
    ],
    "publisher": [
        "StarWraith 3D Games LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Space"
    ],
    "achievements": 8,
    "positive_ratings": 220,
    "negative_ratings": 50,
    "price": 18.99,
    "description": "Advanced Space Flight, Combat, Trading, and Exploration Simulation. Set in a vast explorable universe, Evochron Legacy offers freeform gameplay with many diverse objectives and paths to choose from.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/398170/header.jpg?t=1533939423",
    "minimum_requirements": "OS: Windows Vista, 7, 8.1, 10 Processor: 2.2 GHz AMD/Intel Memory: 4 GB RAM Graphics: 1 GB DirectX Compatible* Storage: 2 GB available space Sound Card: DirectX Compatible Additional Notes: * Shader Model 3.0 hardware support minimum required (via DirectX 9Ex)",
    "recommended_requirements": "OS: Windows Vista, 7, 8.1, 10 Processor: 3.4 GHz or faster multi-core AMD/Intel Memory: 4 GB RAM Graphics: 2 GB or more DirectX Compatible* Storage: 4 GB available space Sound Card: DirectX Compatible Additional Notes: * DirectX 11 required for experimental VR mode.",
    "reviews": [
        {
            "review_text": "It doesn't take a 2.5 million dollar Kickstarter campaign to make a decent space sim. What this lacks in AAA polish and graphics it more than makes up for with it's gameplay.  And you don't even have to buy a $60 expansion to land on the planets!",
            "review_score": "1"
        },
        {
            "review_text": "Try the demo before you buy the game. The tutorial can take longer than your 2 hour refund window. You can get it off the developers webpage.  That being said, I love the Evochron series, they are my favorite space simulation games. Notice I said simulation. So watch the videos, try the demo, then enjoy outer space.",
            "review_score": "1"
        },
        {
            "review_text": "*This review focuses on lyrical consideration rather than literal assessment. For detailed game information and analysis I recommend  StarWraith's Evochron Forum.  [www.starwraith.com] *   A Precious Indie Jewel",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the best, most complete, and funest space sim available right now. This game is NOT an other early access, or some kind of endless slow paced development plan. This is a complete game. If you like space sims you should definetly look into this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! The best space sim in my opinion, theres just so much in this game and its crazy how not a lot of people know about. Shii I just found out about it today and if theres a space sim your looking for besides Star Citizen, this is the one to get trust me. Also its only $25 and first day on sale and devs are in it to win it. Did I mention you can build your own space station and staion on planets?",
            "review_score": "1"
        },
        {
            "review_text": "This is my first space sim. I had the patience to complete the demo (2 hours!) and now find myself enthralled by the game. It's an intricate, slow-burner and I have only scratched the surface of its content after nearly 40 hours. I came to this game with my eyes wide open and understanding there is a lot to learn, which is why I gladly take advice from the helpful community.  Here's a few pointers that may help anyone considering buying the game. If you want an arcade shooter, don't buy this game - you will dislike it. If you want the best graphics, don't buy this game - you will dislike  it. If you have little patience, don't buy this game - you will dislike it. If you are in none of these categories, you may still dislike it!  If you are a mature (of mind) gamer, you may well like this game. I enjoy it, even though I have never put this much effort into learning a game in my life. I'm looking forward to future community mods and Dev updates to further enhance the experience of being an explorer in a complex and captivating virtual galaxy.   Finally, having read about the history of the Evochron games family and read the Dev Diary for Legacy, I am wholly impressed by the Developer of the series and wish him unbridled success with this and future endeavours. Wish we had more of his calibre making games.",
            "review_score": "1"
        },
        {
            "review_text": "Words cannot describe how good Evochron Legacy is. It is not just game. It is an experience.",
            "review_score": "1"
        },
        {
            "review_text": "I love Evochron Mercenary so much, and this game even better.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly rich and detailed world, honed to perfection and updated damn near weekly by one of the most remarkable developers that is has ever been my pleasure to support. I wish that i had discovered his games 10yrs ago when he started building this stunning series.  This game has everything content wise that elite is lacking and then some, openly supported modding....only con i would say is that the dev gears this game to play on 10yr old computers and doesnt give much attention to trying to push modern visuals. The game looks pretty good and in moments really stunning but i wish this game was married to the INovae engine.  Every lover of space sims owes it to themselves to check this game out, dont be daunted if it takes a while to setup and go through tutorials....the game is worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game is so intricate and open I was surprised I stuck with it. But there is so much room for this to grow from the great job they have already done. Worth the $20",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good game! It's a good game because it allows you to do what you want, and my only complaint is graphics!",
            "review_score": "1"
        },
        {
            "review_text": "I just want to say get this game if you have always wanted to experience what it would be like to live in space as a mercernary/entrepeuner/master space pilot and dont mind going through the traing mode. First off the feeling your in space is real and you might feel overwhelmed, but dont worry youll love it. Picture all the great science fiction spcae movies you love and the one most recent to come to mind isthat nolan movie he just made about being in space. WEll thats exactly what you get here its as real as i can imagine it being with all the little painstaking details you would find in ever george lucas film and discovery special about space travel in the future. The game to me has perfect physics and the graphics are gorgeous, and the file size is only 300 some megs. The game runs as smooth as butter and thats on my i5 2.2ghz intel hd 4400 laptop. So the game by the way is humongous actually its like fallout 4 in space or arma in space but with futuristic space objectives to accomplish and its very challenging . No doubt its definitly one of my favorite games of all time so do yourself a favor and buy it if you want to feel like matthew mccaughney in that nolan spacemovie but more badass.",
            "review_score": "1"
        },
        {
            "review_text": "Great space simulator! Very relaxing. I recommend it to everyone who likes that sort of simulation.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to give this an awesome review because the flight physics of this game are phenomal!! But..Unfortunately that is the only thing this game has going for it..  Where to start...   The Good - Well like stated the flight physics are great and exactly what one would expect from a space flight..Even the physics of planetary flight...Gravitational effects...atmospheric effects...  Now the bad - which pretty much covers the rest of the game.  The graphics - some parts are ok but others like planet features are so 1990's...All the stations are exactly the same.  The universe - On a 2d plane with some UGP(universal galactic plane) where you align to plane and are on same level with every single station in the universe....really bad.  Jump Gates - Seriously (Another game trying to be like Eve Online) Learn from Elite Dangerous in this respect...doesn't matter where you leave a map from....it's where you ener the next map thats most important. Oh and speaking of gates...ships always crashing into you as you either entering or exiting gate.  Build Constructor for building stations - Absolute crap...build something in the wrong place...yeah screwed can't move it or even remove it..Modules don't even need be connected.  Ship Modules...It's ok but...kinda boring and not enough explaination.   Not enough explaination or direction of the whole game seeing as it has been around 16 years beginning with Star Wraith / Arvoch Series in year 2000.  And in closing - it is worth the 24.99USD price tag just for the flight sim...but it probably won't hold anyone's interest for long enough to build a universe...Even the public Multiplayer servers are empty of players.",
            "review_score": "1"
        },
        {
            "review_text": "[Requested Refund]  Game seemed really interesting.   But, after about an hr of trying to set up keybinds for my xbox controller, I had to give up. I recommend the game because the whole concept seems great, its just that I have no actual gameplay because I cannot get my controller to work and the solutions on the forums dont fix my issuse. I'd rather buy something else, so I requested a refund.  Sounds like a lot more people are having better luck. The game is for those people.",
            "review_score": "1"
        },
        {
            "review_text": "The flight mechanics and spaceship customization are really, really cool and I really enjoy the complex controls, it makes me feel like i'm really flying a ship. I even installed voice attack (a program that maps voice commands to keypresses) to try to make it more immersive and realistic. The same thing is wrong with thtis game as so many other space sims. It is a mile wide, but a foot deep. There is nothing to do, much like elite dangerous. While this game has a few more mechanics than elite dangerous, like building space stations and cities, it still feels like a really cheap version of elite dangerous. The missions are extremely repetitive and consist of:  Go here and shoot these asteriods Deliver X thing to Y place Deliver X thing to Y place quickly Defend X ship from enemy Destroy X ship Clean a solar panel  And that's it. You can do some trading I suppose, but honestly it's not anything special from other space sims. The mining consists of fly to these asteroids. press alt+b. Wait. Fly to station. repeat. And even if you do this, who cares? You get to upgrade your ship. If you have fun upgrading ships to get money faster, I suppose it could be fun to you. It just feels really, really empty, and, honestly the most importatnt thing, I don't have fun while playing. I wouldn't recomend to someone looking to have an adventure in space.",
            "review_score": "-1"
        },
        {
            "review_text": "After having played this game Evochron LEGACY for 33 hours I can say that I could not recommend it. The play itself is slow. The money you can build up is quick if you mine and increase your cargo space so that was ok. Getting from one quadrant to another was just a nightmare deal. The navigation is too complicated. The space docking boring and game play on line with others was none existant.  I'm sorry but this game needs a complete overhaul. I know it's just one person band and perhaps that is the problem. It's only being seen through one set of eyes.  I'll just wait for squadron 42 to come out from star citizen.",
            "review_score": "-1"
        },
        {
            "review_text": "why did i buy this game? it's bad  people think gaves developed by a single person are 'great'  this is not great",
            "review_score": "-1"
        },
        {
            "review_text": "Wow does this game ever suck. I know that the fan boys will jump on me saying 'but it was made by one guy'...And my response is year i really looks that way too. Writing an email to steam to see if I can get a refund. It's ugly, clunky, slow, completely devoid of anyting looking or feeling interesting.",
            "review_score": "-1"
        }
    ]
}