{
    "app_id": 398680,
    "name": "Ace Of Words",
    "release_date": "2016-05-13",
    "developer": [
        "ZeroBit Games"
    ],
    "publisher": [
        "Ocean Media LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Word Game"
    ],
    "achievements": 18,
    "positive_ratings": 511,
    "negative_ratings": 238,
    "price": 3.99,
    "description": "Become a spelling ace or just beat the highest score in this arcade spelling contest. The challenge is ON! 8 letters, up to 100 words and 120 seconds to spell them out. Compete against other players via leaderboards and become real Ace Of Words.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/398680/header.jpg?t=1463155183",
    "minimum_requirements": "OS: XP, Vista, 7, 8, 10 Processor: 1.5 GHz Memory: 1 MB RAM Graphics: 512 MB VRAM Storage: 80 MB available space Sound Card: Direct Sound compatible",
    "recommended_requirements": "OS: 7, 8, 10 Processor: 3.0 GHz Memory: 1 MB RAM Graphics: 512 MB VRAM Storage: 80 MB available space Sound Card: Direct Sound compatible",
    "reviews": [
        {
            "review_text": "Quit fun, there's plenty of words that I didn't heard anywhere before playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best crossword game I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun",
            "review_score": "1"
        },
        {
            "review_text": "  It's pretty hard because you put your mind in motion but is very hard.",
            "review_score": "1"
        },
        {
            "review_text": "  Its amazing , in just 5 ,6 or more letters we can form '40' words , and it has online highscore that makes the game more competitive .  W4RRIOR - 8/10",
            "review_score": "1"
        },
        {
            "review_text": "  nice little casual game.. good training for non-native speakers",
            "review_score": "1"
        },
        {
            "review_text": "Nice little spelling game, interesting to kill some time, no more than that",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. You can type the letters of your word guess then press enter or click each letter individually with your mouse. The sound effects are pleasant and rewarding. The only bad things I can say about the game are that a few real wordsI tried to use 'aren't in dictionary' and if you want to click a menu option you have to hover your mouse pointer about a half inch above the button to get it to highlight. But that's not really a big deal. All in all, it could use some minor improvements but is otherwise a good game. It's a simple yet challenging way to pass some time. FYI, this type of game can be played online for free on many sites. I bought this one for offline play.",
            "review_score": "1"
        },
        {
            "review_text": "3.6/10 - Game Includes FREE Copy of the World's Smallest Dictionary.   First, I found it really concerning that I saw a few people run into some problems with malware. Was it the porn they watched or the actual game? I really don't know. I didn't run into any problems...(gulp). I Think. My review however is strictly about the game play.   The game really just didn't do it for me! You have 120 seconds to spell out as many words as possible; after that another round begins immediately. There aren't levels, objectives, progress or any endgame to speak of. I guess the achievements help fill in the gap but it;s just not nearly enough.   There is no multiplayer and the dictionary is complete TRASH. I even tried to cheat several times by using word compilers, friends and even taking screenshots of potential answers. Even with all this assistance I will never get 100% on a level with such inconsistency in the word mix. Common words are omitted and abbreviations, names and unknown words are often included..  The positives include achievements, card drops, malware?, and a really rickety leader board that I'm not confident that is accurate. That's all the positives.   Overall, There are so many better word games for FREE. They have better features, multiplayer and a legit dictionary. I wouldn't even spend $1 on this! If you do grab this game continue at your own risk.   (Vacation Review #1 of 28)      Accidently Reviewed",
            "review_score": "-1"
        },
        {
            "review_text": "  I will try to express how i felt in the game in long story short. The games rating is i have to say 3/10 and i DO NOT RECCOMEND  Price:Just too overpriced max coud be 0.90 $  Pros: +You can test your dictiniry skills  Cons -Not all wrods that are in dictionary  -why woud you buy it when you can get it for free. -too much negative then positve no matter what woudnt buy it AND WOUDNT SUGGEST IT!  Overall: I woudnt buy it anywhere becosue on internet there are much better games with words.",
            "review_score": "-1"
        },
        {
            "review_text": "The main problem this game has is that it lacks words. It's starts off fine, but it gets old very quickly. I started to get annoyed after the 5th round as it rejected fairly commonplace words. The music is alright, but it gets annoying fairly quickly. The concept has been done better many times. You can probably find a comparable game for free. I actually got this for free. I recommend you don't purchase it.",
            "review_score": "-1"
        },
        {
            "review_text": "I didnt know AWRDOM was a word 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "  Great for kids, not gonna be fun for teenagers or adults, I got this for free and now I know why, also it's very lacking in words, this game will only benefit you if you want Achievements, other then that please avoid it, you'll find yourself getting bored very easily",
            "review_score": "-1"
        }
    ]
}