{
    "app_id": 3990,
    "name": "Civilization IV®: Warlords",
    "release_date": "2007-04-06",
    "developer": [
        "Firaxis Games"
    ],
    "publisher": [
        "2K"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based",
        "4X"
    ],
    "achievements": 0,
    "positive_ratings": 121,
    "negative_ratings": 20,
    "price": 2.99,
    "description": "Sid Meier's Civilization IV: Warlords is the first expansion pack for the award-winning game that has become an instant world-wide hit. Paying homage to some of history's greatest military leaders, the expansion delivers six unique and interesting scenarios, giving players the chance to change the course of history with the help of their...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/3990/header.jpg?t=1534463400",
    "minimum_requirements": "1.2GHz Intel Pentium 4 or AMD Athlon processor or equivalent, 256MB RAM, 64 MB Video Card w/Hardware T&amp;L (GeForce 2/Radeon 7500 or better), DirectX 9.0c compatible sound card, 1.7 GB of free hard drive space, Direct X 9.0c (included) Recommended: 1.8GHz Intel Pentium 4 or AMD Athlon processor or equivalent/better, 512 MB RAM, 128 MB Video Card w/ DirectX 8 support (pixel and vertex shaders), DirectX 9.0c compatible sound card, 1.7GB of free hard drive space, DirectX 9.0c (included) SUPPORTED OPERATING SYSTEMS: Windows 2000 (plus Service Pack 1 or higher), Windows XP (Home or Professional) (plus Service Pack 1 or higher) *Requires Sid Meier's Civilization IV to play",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've enjoyed this episode the most, usually playing the Terra map in order to be able to expand first into an unclaimed territory.   The ability to modify the game text by editing XML has been fun -- part of the enjoyment in both Civ II and Civ IV for me has been editing the resources.  On my platform (Win 7/2.8GHz HP home PC/8 MB RAM), the UI alternates between snappy and very slow. After a while (presumably a memory garbage collection) it gets fast again. Using some of the shortcuts like right-click to move makes the slow-down bearable.",
            "review_score": "1"
        },
        {
            "review_text": "Joesph Stalin and Gandhi fought each other. Gandhi won. Don't ♥♥♥♥ with Gandhi.",
            "review_score": "1"
        },
        {
            "review_text": "Obviously I need to recommend Civ IV; this being the latest.",
            "review_score": "1"
        },
        {
            "review_text": "I played Warlords to death when it was first released. Still have the disks for it somewhere, but I bought the Steam version because on sale for one dollar and thirty seven cents, you cannot go wrong. Warlords add the Mongolians to the Civ world, and they are my favorite because they add greater mobility to the exploration process. Warlords is still very playable, and I had forgotten how good the music is. Compared with Civ V, Warlords is no slouch. It is still beautiful and a pleasure to play. Two thumbs up for this old chestnut.",
            "review_score": "1"
        },
        {
            "review_text": "This one is a classic. I played it soooo many hours (outside steam). This expansion deals with stuff on the older ages, really adds lots of stuff until the Industrial age. Warlords are very cool features. It still has some great mods to offer based on everything you could want for...  I really recommend especially for the low price to try it out and see how much Civilization evolved throught the ages... I meant the game lol ;)  Overall Score: 8/10  PS: If you buy the complete edition the version you should use for launcher is the Beyond the Sword one. It has everything... ",
            "review_score": "1"
        },
        {
            "review_text": "Not worth your time or money",
            "review_score": "-1"
        }
    ]
}