{
    "app_id": 399240,
    "name": "XNemesis",
    "release_date": "2016-06-07",
    "developer": [
        "XProd Games"
    ],
    "publisher": [
        "XProd Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Shoot 'Em Up"
    ],
    "achievements": 19,
    "positive_ratings": 8,
    "negative_ratings": 2,
    "price": 1.69,
    "description": "XNemesis is a 2D shooter SandBox game, it is a package that contains fully featured levels, Level Designer Software that allows you to create/modify levels and Assets Pack(s) as ready Templates to use in your levels if you don't have/want to use your own images/animations.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/399240/header.jpg?t=1496177929",
    "minimum_requirements": "OS: Windows 7/8/8.1/10 x86 or x64 Processor: Intel Core 2 Duo or equivalent Memory: 3 GB RAM Graphics: DirectX®: 9.0c compatible video card 1GB VRAM DirectX: Version 9.0c Storage: 4 GB available space Sound Card: Compatible with DirectX®: 9.0c Additional Notes: Recommended Xbox 360® Controller for Windows",
    "recommended_requirements": "OS: Windows 7/8/8.1/10 x86 or x64 Processor: Intel Core 2 QUAD or equivalent Memory: 4 GB RAM Graphics: DirectX®: 9.0c compatible video card 1.5GB VRAM DirectX: Version 9.0c Storage: 5 GB available space Sound Card: Compatible with DirectX®: 9.0c Additional Notes: Recommended Xbox 360® Controller for Windows",
    "reviews": [
        {
            "review_text": "I got the game from the 'Build a Greenlight Bundle 25' what I bought around a year ago. The game got the Steam key for the bundle around 6 months ago, but I didn't checked it until recently. The key wasn't worked, but they got awesome support, even after 6 months, they helped me out, after providing the proof of purchase.  The game at first look maybe seems to be your usual +1 Steam line, what you leave running to get the trading cards and forget about it. But I gave it a shot, because if the game got awesome support, then it should be a good game too. I was right, it is a nice little game, not your typical AAA category, but the price is aligned right for it. You can have fun for some hours with the original levels, and if you have the time, the level editor can extend the fun time. At first the levels were hard for me, but after some try I figured out how to play effectively to survive for 5 minutes/level and do the boss fights.",
            "review_score": "1"
        }
    ]
}