{
    "app_id": 399520,
    "name": "Comedy Quest",
    "release_date": "2015-09-02",
    "developer": [
        "Trav Nash"
    ],
    "publisher": [
        "Crothers Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Casual",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 201,
    "negative_ratings": 47,
    "price": 0.0,
    "description": "Comedy Quest is a point and click adventure game by Trav Nash. Can you become the greatest comedian in three gigs?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/399520/header.jpg?t=1447377797",
    "minimum_requirements": "OS: XP Memory: 256 MB RAM DirectX: Version 9.0 Storage: 253 MB available space Sound Card: Yes",
    "recommended_requirements": "OS: XP, Vista, 7, 8 Memory: 512 MB RAM DirectX: Version 9.0 Storage: 300 MB available space Sound Card: Yes",
    "reviews": [
        {
            "review_text": "Comedy Quest s a decent point and click adventure game, Its voiced and everything so that is neat. The game itself can run pretty terribly though and has some weird quirks, like resolution issues, sped up dialog and mouse sensitivity. Overall though if you dont experience those, or can work through them, you will find a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty good game there are some good cheesy jokes, but the funnest was the guy who had a shushy for his dingus, LOL!!! So yes I recommend playing it, I had fun.  Four stars: **** 8.5/10 - rateing",
            "review_score": "1"
        },
        {
            "review_text": "a man got his man parts stuck in his zipper and had to cool it down with a slushy... thats all that needs to be said.... well that and i frickin loved this game!",
            "review_score": "1"
        },
        {
            "review_text": "its ok. gets a little dull most of the time but you cant help but stay to see what happens next! BUT BEWARE THE PLAYER IS SLOW AS F@$%",
            "review_score": "1"
        },
        {
            "review_text": "Joined game. Looked at a wall in the bathroom, there was some writing from some dude telling girls to call 'sex bro' for a good time. Only he didn't leave his number. gg 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Can I have a drink?",
            "review_score": "1"
        },
        {
            "review_text": "I can honestly say I liked the game. I spent a lot of time reloading though because I didnt catch on the whole using the notebook thing the first time through. I just kept reloading till I got the best sets I could... Didnt feel too bright after that",
            "review_score": "1"
        },
        {
            "review_text": "Its cool but you have to know what to do,",
            "review_score": "1"
        },
        {
            "review_text": "11/10 needs more urinal cakes",
            "review_score": "1"
        },
        {
            "review_text": "What a cracking little adventure.  Okay so the graphics are a bit crappy (when you parody Monkey Island 20 years later your graphics are worse.. ) and the sound / voice acting is somewhat muffled and the click detection janky.  But you know what.. theres a lot of heart here. The jokes are terrible but its done with sincerity and it made me smile a lot and want to progress. The fully voice acted plot was great and unexpected, so bravo.. give us more... and more bug fixes.  What cut me short was my chracter inability to move during the taxi chase (possibly a windowed application issue) he just move a little then just stop, especially when moving north or south.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Why is it so short. I want more of it. One of my favorite Games.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool voice acting, but I honestly didn't like playing this game. It has a unique plot, but not that fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I have Windows 10.Game is Black Screen.",
            "review_score": "-1"
        },
        {
            "review_text": "Someone really had a great idea but realisation went bad.Its boring game because already at the start of the game u are putted in weird situation where u dont even know how to move.So dont waste your minutes of life on this.Jokes aren't bad but u can't make game based on jokes.I will say it again amazing idea,but bad realisation!",
            "review_score": "-1"
        },
        {
            "review_text": "This game was awful - downloaded it because it looked funny, but it wasn't. It was ♥♥♥♥. None of the jokes were funny anyway. Don't waste your time, storage and bandwith downloading this game.",
            "review_score": "-1"
        },
        {
            "review_text": "after opening this game i was treated to a broken fullscreen that wouldent allow me to kill it with a constantly looping song that brought me to the 720 sized black sploch on my display that cant be exed thrugh the bottem bar, leading youto try f4, but that doesent work... taskman is stuk behind screen and wont allow you to use that... so if you have windows 10 and want to play this game, you better have an extra hdmi around the house or you are going to have to use the good old power swith.  from what i have ringing in my head of 'gameplay' - 1/5 on music, it has it... - 0/5 on gameplay, black screen - -1/5 on comedy, the sick joke of this screen sickens me with its vile music  dont play unless you know it works on your system...",
            "review_score": "-1"
        },
        {
            "review_text": "Comedy Quest is a short point and click adventure about some schmuck who's trying to become a stand-up comic. I've got kind of mixed feelings on this one.  On the one hand, the controls are pretty clunky, the sounds are kind of annoying, and the voice acting, while decent, is poorly recorded and you can often hear background noise when the voiceclips play.  On the other hand, the humor is solid and the art style is unique and interesting despite its somewhat mediocre quality. Most importantly, the game itself is enjoyable. And, it's so short that there's really not enough time for its bad points to start to get on your nerves. I was mildly annoyed at first but within like ten minutes i was laughing too hard to care. Though it's not for everyone, and it's certainly a tough call, the scales tip on the side of my recommending it.  ...Also, my new favorite line from any game is now 'Crumpets, you are one hell of a unicorn for someone with no heart.'",
            "review_score": "1"
        },
        {
            "review_text": "the game crashed while i trying to talk to the canned cat food lol All in all that's a humorous funny little game  Worth a try :)",
            "review_score": "1"
        },
        {
            "review_text": "A quick game with a few witty jokes, and a few bad puns. An upcoming comedian hopes to gain fame by doing stand up. You have to use your notebook to find objects in the world to make jokes at. Depending on whether or not you find them affects your performance. Overall, a quick game that shouldn't take a lot of time, but plays like an old school adventure game. Adventure Game Studio may be old, but it still holds up to indie developers.",
            "review_score": "1"
        }
    ]
}