{
    "app_id": 399890,
    "name": "The Secret Order 2: Masked Intent",
    "release_date": "2015-11-05",
    "developer": [
        "Sunward Games"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Hidden Object"
    ],
    "achievements": 24,
    "positive_ratings": 162,
    "negative_ratings": 46,
    "price": 6.99,
    "description": "Become the wayfarer through the past to force back the evil power!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/399890/header.jpg?t=1530539008",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Your father called you to help a secret order to save their lifes after a new member betrayed them. From a museum to a strange island and a village in the end of the XVIIth century, you're going to find a powerful artifact that will defeat that traitor.  When Artifex Mundi publishes something that isn't their own work, you're often disappointed by the quality. While these games are still good and high quality, it's not what Artifex Mundi can deliver. And sometimes, you find a real gem, that could have been developed by them. Dark Heritages for example is one of these gems. Now, The Secret Order 2 is joining that club.  The story is a good one, though you wish that you played the first game to understand more the story. I mean, Nathan Williams, the bad guy, seemed to be related to the previous game (though it could be a mistake from my part). But, knowing you can travel through time (even if it's not really like in Time Mysteries, where you're going to different eras), you can expect some nice backgrounds. And you have them!  It's the Collector's Edition that is on Steam, so, the bonus chapter is already added in the middle of the story, when you're diving into a terrible atmosphere, with spirits, swamps and other cursed castles.  What I really loved in this game is that it's not too hard but not to easy: puzzles are well-balanced, HO scenes are also easy for some items but harder for others because of a matter of perspective (you're not used to see binoculars behind a piece of wood, showing their profiles or another item being upside down for example).  And the music.... it's really fitting to the game. Really fitting.  Anyway, my only complaint is the HUD that I find too big but you're getting used to that anyway.  If anything, buy that game. You'll enjoy it.  Now, I'm waiting for eventually for the first game to show up on Steam :)",
            "review_score": "1"
        },
        {
            "review_text": "A daring adventure through time with magic, ghosts, dragons and family drama; this game is filled to the brim with excitement from beginning to end.  A good story is what keeps me playing games like these. I enjoy following along with the main character and helping them to complete their mission. This tale revolves around Sara who is trying to save her parents from her very own brother. Along the way she discovers a time traveling ship and goes to the past to uncover the mystical artifact that will defeat the darkness.  While the story is good, it drags a bit to me. The time traveling aspect wasn’t as exciting as it sounds on paper. You only go to one time period and, of course, do mundane tasks until you finally get the information you need...THEN you get sucked into a vortex of some sorts and have to defeat two evil specters to escape. This part, I believe, is added content for the collector’s edition to make it longer which might explain why it seems out of place from the rest of the story. However, once back on track to finding the scepter things pick up pace again.  Gameplay is common fair for this genre of game. You have plenty of hidden object scenes, I wouldn’t even have minded more. You also have plenty of puzzles, some frustrating but the instructions are clear and you can get past them without having to skip. If you’re playing on Steam, gaining all of the achievements should not be difficult. The game also offers a mahjong alternative if you can’t find an item during a hidden object scene.  Artwork is beautiful, though the characters suffer from dead eyes during cut scenes when they look at it. It’s a bit creepy but nothing too distracting. The soundtrack is great at setting the tone of the game and smooth on the ears along with talented voice acting.  As of the time I’m writing this review, the first installment of this series is not on Steam yet. I would love to see it and more stories involve the Order of the Gryphon available, however. The mythos of the game is intriguing and a lot of mystical fun.   Lunar Productions  [lunarproductions.tumblr.com] ",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps the worst Artifex Mundi game I've played. The storyline is abtuse at best, and the cutscenes and graphics look like they're from 1999. I'm a sucker for these kinds of games, but I may have to start rethinking purchasing games that Artifex Mundi only publishes and doesn't develop. They need to start exercising some quality control. Achievements on this one are minimal as well, with nothing beyond the story achievements and a few hidden objects ones like 3-in-a-row and completing a hidden object in under a minute. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty standard hidden-object game from Artifex Mundi. Nice graphics, silly story, fluent gameplay and zero originality. Every single minigame is copied from their previous titles.",
            "review_score": "1"
        },
        {
            "review_text": "Ubuntu 14.04. This game runs the first time and then shuts down and refuses to open again even after removing local content and reinstalling. I do not recommend this for anyone running anything higher than Ubuntu 12.04.",
            "review_score": "-1"
        }
    ]
}