{
    "app_id": 399910,
    "name": "Ookibloks",
    "release_date": "2015-10-08",
    "developer": [
        "Studio Work3",
        "Lampert & Sons",
        "Skyboy Games"
    ],
    "publisher": [
        "Skyboy Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Action"
    ],
    "achievements": 22,
    "positive_ratings": 41,
    "negative_ratings": 3,
    "price": 1.69,
    "description": "Ookibloks combines the spirit of classic action puzzlers with a bright visual style and an ultra-catchy soundtrack. In this game you help Ooki the Monkey collect all his stolen bananas while avoiding enemies like crabs, ghosts, piranhas and the all-powerful Devil Cat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/399910/header.jpg?t=1551049588",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.5 GHz Processor or faster Memory: 256 MB RAM Graphics: OpenGL 1.1 compatible graphics card Storage: 384 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " This key was provided for review purposes    Solid time waster",
            "review_score": "1"
        },
        {
            "review_text": "This is an old-school puzzle game that - like most great puzzle games - seems deceptively simple. In Story Mode, you play as a money in an Angry Birds scenario where crabs snuck onto the beach and stole your precious bananas. Each level is made up of block-tagging puzzles with some baddies and boss fights thrown in for fun. For such an unassuming game it is surprising addictive. I expecially like the bright colors and the sound effects that mesh seamlessly with the catchy sound track. Give it a try! I'm sure Ookibloks will charm you.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let this cute artwork and music decive you, In all its cuteness you will need much skills and fast thinking to master this game.  If you are in puzzle games, you can expect playing Ookibloks daily, it offer daily missions with rewards and leaderboard which makes it very challenging and competative.  My personal opinion is that 7,99 is a bit pricey for this kind of game, but will instantly recommend buying it on 50%",
            "review_score": "1"
        }
    ]
}