{
    "app_id": 400020,
    "name": "Atari Vault",
    "release_date": "2016-03-24",
    "developer": [
        "Code Mystics"
    ],
    "publisher": [
        "Atari"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Racing",
        "RPG",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Retro",
        "Classic",
        "Arcade"
    ],
    "achievements": 12,
    "positive_ratings": 331,
    "negative_ratings": 78,
    "price": 6.99,
    "description": "Relive the Golden Age of Gaming with 100 of the most iconic Atari games from the 70’s and 80’s. Now with online multiplayer capability, this extensive catalog includes classic Atari titles like Asteroids, Centipede, Missile Command, and many more, paired with intuitive new controls.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400020/header.jpg?t=1489425831",
    "minimum_requirements": "OS: Windows 7, 8.1, or 10 Processor: 2.0 GHz Memory: 2 GB RAM Graphics: DirectX 9.0c or higher compatible DirectX: Version 9.0c Storage: 1 GB available space Additional Notes: Network Required for Online Play",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you enjoyed the classic Atari acrade games and the subsequent 2600 console cartridge games, you'll love this collection. It carries a lot of nostalgia with it and brings back a lot of great memories. Works perfect with both my Steam controller and my XBox 360 controller. Nice customization options under the hood. Hopefully, other publishers like Midway, Capcom, Techmo, Taito, and Activision will follow suit and release their classic arcade and console collections in a similar manner.  Note: Overall, I've found that the games in the collection work better with a Steam controller than an XBox 360 controller.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:- &gt;&gt; Multiplayer support &gt;&gt; Contains over 60 Atari 2600 games &gt;&gt; 20 of to your favourite Arcade based games from Atari included &gt;&gt; Easy-to-use GUI and menus &gt;&gt; Auto save-state for when you need to take a interval break  Cons:- &gt;&gt; Battlezone is NOT included on both Arcade and 2600 &gt;&gt; Archives appears not to be included &gt;&gt; No Atari 5200 or 7800 games included &gt;&gt; No options to play as Standard or Enhanced mode  This game may not match like Digital Eclipse's Atari Anthology or Atari - 80 Classic Games in One, as they include Battlezone and some of Nolan Bushnell's video archives etc. But the multiplayer support and Steam Achievements are not bad for this game.",
            "review_score": "1"
        },
        {
            "review_text": "I have played Pong in multiplayer. This is heaven.  First, sorry for my english :) This bundle interface is pretty well done with the 3d visualization of games boxes and even arcade machines in simplified 3d models that you can turn around. You can kind of navigate in the menus with an Xbox360 controller, sometimes I had to use the mouse, but probably because I missed all what I can do with the controller, I guess.   Nostalgia at its best, in a modern presentation. You can host a multiplayer game or join some, probably more for friends than randoms, because there won't be thousands, even hundreds, playing them in multi or hosting a game and waiting for someone...  I've bought it for Breakout and Yars Revenge (it was a blast playing it again!). I would recommend it for a nostalgic trip only, not every old good Atari games are there but there is enough for a couple of nights trying some. If you don't understand them, there is scanned manuals that you can read and zoom. I would have liked modernized manuals instead of scanned ones, because sometimes the fonts are hard to read.  *Note: the problems in the paragraph below don't exist anymore, since they patched the game and controls so it's way better* There are some games that either with keyboard, mouse or Xbox360 controller, the contols don't feels right. Especially Breakout, the paddle feels like mouse acceleration effect, not very good. But this is saved because there is other games... I read somewhere that they recommend the Steam controller, but anyway I would say be aware that you can have some frustrations with some controls in certain games.  You have a leaderboard for 17 of the 18 arcade games ( Pong have no 'score').  I have bought this on another website and it included 20 Intellivision games pack and 40 Colecovision games pack, so I could not be disapointed with Atari Vault price for sure. It worths what Atari games are inside are worth to you. :)",
            "review_score": "1"
        },
        {
            "review_text": "I purchased Atari Vault only for the arcade games. The initial release was unplayable, but there have been two major updates that have improved the product greatly. Any reviews prior to update 1.0.2 are obsolete.  For Missile Command and Millipede, there is still a significant issue with the trackball control in that if you roll the trackball fast and let go, the object that you are controlling with the trackball will sail too far resulting in imprecise control. I have tried to change the settings for the mouse in Windows 10 OS to a slower movement, but this did not help. There is a 'follow mouse' option, which annoyingly shows the image of the cursor, and is therefore worthless.  Fortunately, the trackball works fine as a surrogate spinner in Tempest, Pong, and Super Breakout. Tempest has a cheat mode that allows the game to start at any bonus level without the need to earn the level, just like in Atari Anniversary.  The games that use only buttons, including Asteroids, Asteroids Deluxe, Space Duel, and Gravitar, are perfect as far as I can tell. Asteroids Deluxe even has the option to hide the background.  There are other emulators, such as Atari Anniversary, Atari 80 Classic Games in One, and others, that for the most part handle the trackball issue better than Atari Vault, although Missile Command in Atari Anniversary moves the site in a diamond when you move the trackball in a circle.  The developer is very responsive to feedback and is courteous. Issues with the trackball notwithstanding, I still highly recommend Atari Vault, because Tempest, Asteroids, Asteroids Deluxe, Space Duel, Gravitar, and Black Widow are awesome and work perfectly or essentially perfectly, the developer is committed to Atari Vault, and because most of the other emulators will not work on Windows 10. Hopefully with enough support, this fine developer will bring more Atari games and perhaps arcade games from other companies to Steam.  I love the music in the intro.  I nominated this game for the 'test of time' award. Unfortunately it has been some time since the developer has posted.",
            "review_score": "1"
        },
        {
            "review_text": "I used to think that the only thing I was missing in my life was the love of a good woman.  It turns out I was really just missing my old Atari 2600.   Seriously, this game has already given me multiple nostalgia-gasms. The arcade version of Asteroids alone is nearly worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "As a collection, this works really well. I am not judging atari vault's games, I am reviewing it as a collection. When you are using a controller. It varies from game to game weather you're using a D-pad or analog. Which is wierd sense the Atari 2600 had a joystick, it should've been you can use whichever method of control.  it can easily be fixed in a patch tho. I'll never forget getting high with my friends and playing 'Basic Math' on Atari 2600.",
            "review_score": "1"
        },
        {
            "review_text": "Have you played Atari today?",
            "review_score": "1"
        },
        {
            "review_text": "Upon making the proper updates this game finally is compatible with my xbox 1 controller! Although this game does not come with Space Invaders which is among one of the most well known Atari games. Perhaps They'll add it in a later patch. But patching this game so promptly really showed me they care about support. I recommend this to all Atari lovers!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best gaming deals I ever got. Everything is in perfect condition. Include manuals, art and everything. Done very nicely. I recommend you buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game that put's you right back into the seventies and eighties. I think that the graphics are pretty good, and the resolution is great considering that these games are from 30-40 years ago.   However, with a hefty price, I do wish that they included more classic games :(.   All in all, I give this game a solid 8/10  Good job Atari!",
            "review_score": "1"
        },
        {
            "review_text": "I got a refusand. eaven tho no Galagae stiell fun geam. u shued get",
            "review_score": "1"
        },
        {
            "review_text": "Someone wrote a review that its only Atari 2600 games - not true. I'm not sure where they even got this from as when you first launch it the default is to browse about 25 or so custom/classic Atari arcade games. They are great and play just like the original - just need some pizza, beer and some friends :).  On the 2600 games - I admit I never was a huge fan of them (even though the system came out when I was a kid) - they play as expected. Interestingly enough - the collection doesn't include ET. I guess not even Atari could stomach that one again.",
            "review_score": "1"
        },
        {
            "review_text": "Fun for the whole Family! (of 1 or 2) :P  The good: Most Games appear to be playable. (Haven't tried them all yet)  Contains the game manuals and box art for the 2600's games  A good buy for anyone not wanting to jump through hoops to play old Atari games. (Less than 10U$D in my region, otherwise maybe wait for sale)  The chosen games are fun (the ones I have tried)  Able to customise keyboard and mouse controls for EACH game  The Unknown: There is an online multiplayer function that I haven't tried, nor can I be bothered to try. It's an interesting idea and I appreciate it. But playing Atari games locally with a second player is more fun as you can laugh at each other failing at retro games and the keyboard/mouse controls (which probably don't hold a candle to the original controls like steering wheels ...)  The Bad: Would be nice to offer updated graphical reimaginings of the original games as a display option, like the Atari classics collection on PSP. (not sure what it's called, but it was a solid game with good design)  Apparently won't work with 'arcade controllers' according to hardcore fan who tried to put this in an arcade cabinet.   Doesn't have Battlezone. Red Baron is fun, but Battlezone is a great game that should not have been left out. No E.T. or Indiana Jones for the masochists. DLC anyone?   Conclusion: It has a nice interface to choose the games from at main menu. Box arts and manuals are nice. Games are fun. Multiplayer is good idea if it works.   BUY if you just want something to play while waiting for the next Hitman 2016 episode to come out, or if you're like me, spend that some that large sum of money you got from your Hitman refund when you found out about the always online DRM policy.  BUY NOT if you already have a source for the original game files and you can get them running on modern or retro hardware of your choice",
            "review_score": "1"
        },
        {
            "review_text": "Works excellent on my 6 core AM3 with Windows 10 64 bit! No problems what so ever! Excellent job you guys done on converting the games. Hey is there a way you guys can also do Scarface to PC ??",
            "review_score": "1"
        },
        {
            "review_text": "Every time I try to load the Atari Vault game it crashes. Am seriously considering requesting a full refund since Steam and/or Valve seem to think it is not necessary to have a live support page to help guide you through the process! What a shame!",
            "review_score": "-1"
        },
        {
            "review_text": "What, E.T. isn't here? ;)",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy - this bundle is one crap game after another and not any of the games you may be expecting. Worst of all is Steam pawning off BS like this on loyal cusomers.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know if this runs too fast on my system or if my brain is slower than it used to be -- either way, I couldn't play these games.",
            "review_score": "-1"
        },
        {
            "review_text": "if you like old games get it it's realy fun",
            "review_score": "1"
        },
        {
            "review_text": "I cant help Myself, there is a special place in my heart for games that were made before I was born. I love them all, but asteroids has to be my favorite, it was the first video game I ever played! I remember playing these co op with my dad when I was 5yrs old.",
            "review_score": "1"
        },
        {
            "review_text": "I was very surprised to see that my childhood was on Steam.",
            "review_score": "1"
        }
    ]
}