{
    "app_id": 400030,
    "name": "Cloney",
    "release_date": "2016-01-19",
    "developer": [
        "dotBunny"
    ],
    "publisher": [
        "dotBunny"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Casual",
        "Indie"
    ],
    "achievements": 7,
    "positive_ratings": 121,
    "negative_ratings": 102,
    "price": 0.0,
    "description": "Cloney is a dragon looking for coins, all you need to do is tap your way through this endless runner collecting as many coins as you can without flying into anything. Sounds easy enough?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400030/header.jpg?t=1453266717",
    "minimum_requirements": "OS: Windows XP SP2+ Processor: SSE2 Capable Processor (Everything Nowadays) Memory: 2 GB RAM Graphics: Shader Model 2.0 Capable (Everything Made Since 2004) DirectX: Version 9.0 Storage: 85 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is not worth your time it is barely a game",
            "review_score": "-1"
        },
        {
            "review_text": "Clone-y. Get it?",
            "review_score": "1"
        },
        {
            "review_text": "This game is horrible. That's pretty much all there is to it. AVOID AT ALL COSTS.",
            "review_score": "-1"
        },
        {
            "review_text": "Remember that ♥♥♥♥ing bird that was unable to fly propperly? That Flappy piece of ♥♥♥♥? This is Flappy dragon, same ♥♥♥♥tard as the bird.  Tried to be better than my gf who has 58 Coins. I ♥♥♥♥ing tried but couldn't get past 41 coins.  THAT FLAPPY DRAGON CANT FLY. So I payed back with completing the game 100%. Still not better score than her but sure showed her in completing achievements.   Do you like Flappy Birds? - Ofc not.  Do you like being better at a game than your friends? - Good Luck with that..",
            "review_score": "1"
        },
        {
            "review_text": "If you like to play flappy bird then this game is perfect for you :)",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, but very dull. You just tap and tap to fly to get coins and try to not crash into any thing.   Pros: - Cute - Soundtrack  Cons: - Repeative - No use for the coins collected- need upgrades to get far - Preformance problems",
            "review_score": "-1"
        },
        {
            "review_text": "avoid this game at all cost.  the game is just a flappy bird mobile port ripoff.",
            "review_score": "-1"
        },
        {
            "review_text": "A pile of crap with inconsistent controls and alot of bloody confusion.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very adorable.",
            "review_score": "1"
        },
        {
            "review_text": "Dude... 15 minutes for that achievement?",
            "review_score": "1"
        }
    ]
}