{
    "app_id": 400170,
    "name": "The Incredible Adventures of Van Helsing: Final Cut",
    "release_date": "2015-11-06",
    "developer": [
        "NeocoreGames"
    ],
    "publisher": [
        "NeocoreGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Action"
    ],
    "achievements": 50,
    "positive_ratings": 1190,
    "negative_ratings": 457,
    "price": 29.99,
    "description": "Embark on an adventure in a gothic-noir world, where mad science threatens the peace between monsters and mortals. The Incredible Adventures of Van Helsing: Final Cut is definitive edition of the trilogy with six playable classes and a new endgame mode with a huge variety of open missions!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400170/header.jpg?t=1478701298",
    "minimum_requirements": "OS: Windows XP SP3, Windows 7, Windows 8 Processor: Dual Core CPU 2.0 GHz Memory: 2 GB RAM Graphics: GeForce 8800, Radeon HD4000, Intel HD4000 (min. 512 MB VRAM) DirectX: Version 9.0 Network: Broadband Internet connection Storage: 40 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 7 (64 bit), Windows 8 (64 bit) Processor: Quad Core CPU 2.5 GHz Memory: 4 GB RAM Graphics: GeForce 560 or Radeon HD5800 DirectX: Version 11 Network: Broadband Internet connection Storage: 40 GB available space Sound Card: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "Final Cut combines the storyline and refines the gameplay mechanics of the previous trilogy games.  The gameplay mechanics is improved in all aspects:  1. The character classes are those from the third part of the trilogy, and namely Protector, Bounty Hunter, Elementalist, Umbralist, Phlogistoneer and Constructor;  2. The character attributes are now only 3 and are different for every class, and every attribute is important;  3. The skills are combination from the skills in the trilogy games and are now organized in tiers and branches:  3.1. There are 3 skill-tiers - the first one is accessible from the character creation, the second and the third are accessible at levels 20 and respectively 40;  3.2. The branches are 3 linked skills from each of the tiers, to learn skill from tier 2, you should have learned it's linked skill from tier 1, respectively to learn skill from tier 3, you should have learned it's linked skill from tier 2, and in addition there are synergy-bonuses between the linked skills from given branch, given skill from tier 2 receives synergy from it's linked skill from tier 1, respectively given skill from tier 3 receives synergy from it's linked skills from tier 2 and tier 1;  4. The character progression is now smoother and there is no inflation according to attributes and gear-bonuses;  5. There are now 2 major modes - offline and online:  5.1. In online mode your characters and shared chest is stored on Neocore-cloud and your characters get downloaded for every gaming-session, it requires internet-connectivity but DOESN'T require uninterrupted connection, in this major mode, in addition to the story and multiplayer, the players may experience the new end-game modes (Scenarios, Events and Daily Quests);  5.2. In offline mode your characters and shared chest are stored on your machine, just like it was in the trilogy games, in this major mode you can play story and multiplayer with friends, and the end-game content.  At the end my opinion for the game is that it's really what most of us wanted, it's improved in every aspect. Neocore deserve deep admiration for bringing us the game in this brilliant state. They have it from me!  I was one of the beta-testers of the game, and I am grateful to the devs that they gave me the chance to contribute somehow to this brilliant game!",
            "review_score": "1"
        },
        {
            "review_text": "The Final Cut allows you to replay the previous Van Helsing games with the new class/skill set up that was not present in the previous games, and also unlike the normal release of the third installment is not a bug ridden mess. This game series for me is probably one of my favorite, it makes me harken back to days (and nights, lots and lots of nights) wherein I played Diablo II for hours and hours not really accomplishing anything but throughly enjoying it. This combines that class loot and exp grind of ARPGs like Diablo II and presents it in a world that whilst presents itself as being very dark, knows full well what it is and makes light of almost every situation with really enjoyable comic dialogue between the two main characters.  Full of hidden secrets, loot, near infinite (unashamed hyperbole) character build paths, and at least 20 hours of enjoyable main storyline with great dialogue, this game is well worth its cost and I cannot recommend it enough to ARPG fans with a sense of humor. Though the game has it's fair share of faults, none of which I can objectively talk about with these rose colored glassess glued to my face, but it, like most indie games, has a fair number of clunk and lack of smoothness to it, but nothing really that ever got in the way of me enjoying myself. Overall rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Improved in all aspects, free for previous owners, worth your time :)",
            "review_score": "1"
        },
        {
            "review_text": "Well I was really frustrated by the delays and a minor hiccup with the keys, but it wouldn't be fair to criticise Neocoregames since I can clearly see the sending out free keys to this many people can be madness.  Also, the game froze on some occasions but I think I fixed it, so... that's the last of my criticism, really, since the game itself does what it promises: a really rich and big ARPG now with the content of all three games.  It's there, it works and it has everything that the trilogy had and more. And it was free, and I'm pretty sure the devs will fix everything that may be buggy at the time of release. So far I'm having a blast, so I can't recommend it enough. ",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't able to get the 3rd series of this game when it first came out but I'm glad they put the trilogy into one whole game with a few noticeable added content. Hope they fix the multiplayer option, either way, the game is still fun!",
            "review_score": "1"
        },
        {
            "review_text": "So having played through the three games previously I thought I'd give my opinion of the Final Cut edition to help new users to the series to decide if it's worth it.  and I'd highly recommend it  and here's why:  Firstly it's a standard diablo-style hack'n'slash game, with thousands of enemies, lots of loots and a fairly linear path to go alone. Whilst this means it won't set new standards for the genre, they do the basics well. There are also tower-defence style missions to help break up the main game as well as multiplayer options and a scenario mode.  The setting and characters gives the game a fresh twist, instead of the usual dungeons and dragons theme, we have Van Helsing, the famous monster hunter. Whilst not a huge change it is something original and makes for a nice change,  This is also the first time in the series that you can have one character playthrough the entire three games which lets you get better connected to your character. You can also play as any of the six classes for the entire game as well, whereas previously they added classes as the series went on.  Getting the game's Final Cut edition also allows you to get the game after the previous ones have effectively been tested. The skill system has been re-worked to be the same throughout all the games, level cap has been raised and bugs and nuisences have been removed.  The game's store page says you'll get around 50 hours in total and this seems about right as my time in the three seperate games came to 56 hours; and even at it's full price it gives good value for money.  If you're a fan of hack'n'slash games then you'll enjoy this, it's easily worth the price and I found it to be quite a pleasant surprise when I played it.  If you are unsure then search the steam store page for 'Van Helsing' as there is a demo still available of the first game, whilst skills and classes may have changed since then, it can give you a good chance to test it before parting with your money.",
            "review_score": "1"
        },
        {
            "review_text": "As Online, game is kinda dead. Actually people just get a public game then when you try to join it, they suddenly kick or ban you. They're just ♥♥♥♥ing ♥♥♥♥♥♥♥♥♥♥♥♥s Get some friends then play game.",
            "review_score": "1"
        },
        {
            "review_text": "Played the game since 2014,now i play the final cut as well.This is one masterpiece right here.Every RPG lover needs to own that game!",
            "review_score": "1"
        },
        {
            "review_text": "I am new to the VH Series. Having just purchased the first TIAOVH during the Halloween Sale, i played around an hour and I fell in love with the story and the dialog between VH and Katrinia also the skill and leveling system of the game. After playing I purchased the franchise. At that time I was unaware of VH: Final Cut. I had just completed VH1 and was set to start VH2 when the Final Cut was released.   The final cut is worth playing, the leveling changed enough to make me feel like i was not playing the same game again. I also noticed quest changes and additions, which made it still feel fresh and fun. They took away 2 classes from VH1 and added 5 more.  I am sure there are more in-depth reviews you can find with all the changes/additions and so-on, however if you enjoy monsters and guns with a side of steam-punk...well this is the game for you.  On a side note: The original VH franchise is worth getting if you can grab it on a sale like they had for Halloween (VH1,2,3 and Deathtrap for $25). Playing through VH1, i already knew I wanted to give it a 2nd play through and VH: Final Cut is the best possible 2nd play through. Some thing old, yet new and exciting.",
            "review_score": "1"
        },
        {
            "review_text": "Van Helsing is the only ARPG I could ever really play more than a couple hours of besides Lionheart and Divine Divinity. This game has enough rpg elements to keep me going, and unlike Diablo 3, all the Van Helsing have had very good character building, especially this version.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, reminds me a lot of Torchlight 2 and Diablo 2.   Please buy and support the devs.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game , it's fantastic and a lot of fun.. i definitely recommend it.. nicely done neocore.",
            "review_score": "1"
        },
        {
            "review_text": "So good that I rather be in the game right now than writting this review!  Must have.",
            "review_score": "1"
        },
        {
            "review_text": "Finally all the parts in one game, and all classes. :) If you liked the first parts must have final cut !",
            "review_score": "1"
        },
        {
            "review_text": "Had some unexpected crashes on the multiplayer mode, however, updating my nvidia driver was the solution. The game has a neat gameplay, and the skill trees are interesting. Would've liked a female char, or the female option for each class, aside from that the game is addictive. If you're a RPG player and love games like diablo and torchlight, the full price is worth it in my honest opinion. If you're just looking for a casual game to have fun with friends, I'd wait for a discount.   So far so good, will update when I finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "Van Helsing is a great game. Chapters 1 and 2 are better than 3/final cut. Some of the classes are in need of balance. The story is fairly well done, but fels a bit.. unfinished? at the end.  They want you to have an account with neocore,, butyou can play offline.  I look forward to seeing what else neocore comes out with. ",
            "review_score": "1"
        },
        {
            "review_text": "excellent! theres a huge increase in performance on this version.",
            "review_score": "1"
        },
        {
            "review_text": "The best action rpg game, I've played, 10/10 Epic humor alert!",
            "review_score": "1"
        },
        {
            "review_text": "Incredible surprizely nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Kinda janky but fun and amusing and long as heck, since it combines all three games.",
            "review_score": "1"
        },
        {
            "review_text": "Kinda janky but fun and amusing and long as heck, since it combines all three games.",
            "review_score": "1"
        },
        {
            "review_text": "Steampunk Diablo with a great sense of humor. You'll dig it.",
            "review_score": "1"
        },
        {
            "review_text": "When I first started the vanhelsing series I was a bit overwhelmed with the amount of skills and stats and constant combo buttons. This fixes all of that for me making it deep and streamlined. If you have yet to play the entire series this is a no brainer. Cons:There was no 1920x1080 res for me and many users have had this issue. You have to create a folder and configs to make resolutions appear. Feels like it needs some more polish to make it hit that AAA studio feel but you can not go wrong for4 the price. Your really getting 3 amazing arpg's for one price",
            "review_score": "1"
        },
        {
            "review_text": "  &gt; Gets TIAoVH franchise pack &gt; Gets this game for free &gt; Realises what this game inlcudes &gt; Got a refund on the other three games  10/10 would profit again.",
            "review_score": "1"
        },
        {
            "review_text": "takes forever to load...holy ♥♥♥♥ its like loading simulator 2015",
            "review_score": "1"
        },
        {
            "review_text": "*Initial Review* Will update after more gameplay.  Graphics got a big overhaul, though the full install with graphic upgrade pack is 53GB. Game runs a lot better and still sounds fantastic. Class system seems good and the skill tree changes are very welcome to me. So far same game but with some needed polish. Played the first game all the way though and the 2nd half way. Got the 3rd one, but did not play it as they announced the Final Cut. Stopped playing the 2nd and waited for this release, glad I did. All 3 games in 1, with updated graphics and gameplay polish, sure I will take it. Liking what I am seeing so far. Had a big issue with loading times with the other games, got an SSD for a few games a while back and this game loads very well from it. Good job so far Devs!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Update: Van Helsing Final cut has been Foxed and now runs great on my system with no problems! I am very pleased that Neocore fixed this game, the HD textures pack is now a working Hd textures  pack! This game plays a little different then the Original but fans of the Original will enjoy 'Van Helsing Final Cut'   Old review This game will have to be fixed before i can even think of recommending it, I had to turn the gL to get 1080P. Then when i got 1080P the game looked like it was running on a PS2! No Neocore No!",
            "review_score": "1"
        },
        {
            "review_text": "It's a really charming gem of a game. I personally like a much the humor and the artwork combined with the beautiful graphics and very differing landscapes...and sure...of course all these different kind of monsters waiting for you. I played Diablo 1,2,3 ,Torchlight 1,2 ,Path of Exile and Titan Quest a much, so if I would be you, just get it. The only big minus is the ever equal world, that has no random landscape generator but for one walkthrough, you should need lots of time. Great work and big Thx to the developers, cause they gave it to us for free as those who bought all three episodes before - that's no standard at all...just look around.",
            "review_score": "1"
        },
        {
            "review_text": "Thus far, I've fought werewolves, zombies, werewolves enslaved using shock collars, genetic abominations, vampires, giant robots, rat-people, demons, and combinations of the above. Because of the class I chose, I've elected to skip the silver, salt, and sacred water in favor of rockets, flamethrowers, airstrikes, and grenades.  A solid monster hunting hack and slash with a spooky aesthetic I can get behind. I got this while it was on sale, and have not regretted the purchase for a second, but I'm not sure I'd pay the full price.",
            "review_score": "1"
        },
        {
            "review_text": "if you are a fan of arpgs i would recommend this game for its variety of different zones and fairly interesting storyline of being van helsing traveling with your ghost friend. I would say though at times the accented english is a bit overdone, but I love steampunk stylized worlds and lore so if you enjoy the gothic steampunk backdrop, i would suggest this game to you. I wish more people played online and werent trying to play the game as if it was a Path of Exile of Diablo 3 style of game. Yes you could grind and grind and max out your char but to me this game is more enjoyable as a single or with friends experience to play through the story and find the secrets. i have played the others but this version is all 3 combined into a fluid game and is the only version that people should be buying.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, I am a FPS gamer..... but this game ohhh just great!",
            "review_score": "1"
        },
        {
            "review_text": "I kinda digged the interaction of Helsing and Katherina, but for every thing the game does good, it does something terrible. The changes on the core game that came with the part 3 of the game managed to ruin what was done in parts 1 and 2. Above all, a loot arpg that makes me get to lvl 92 while still using lvl 50ish gear is kinda hard to digest... where's the loot!?! The itemization is terrible.  Finished the game at lvl 93, while playing on heroic and doing a couple of missions on the adventure map, and to my dismay, you can't replay the story, like you could on parts 1 and 2. So if you missed any of the secrets (some are very dark) or failed any of the side-quests/resistance missions, too bad.  And like, for real? If you plan to let your chimera hunting while you do anything on adventure map, you gotta go out and into story mode to access it again, who was the genius that decided to remove it from the adventure map?",
            "review_score": "-1"
        },
        {
            "review_text": "Since last patch, game won't load with 64 bit executable. Using 32 bit got me to login stage but then game throws an error and have to exit. Others have reported same problem. Use at own risk. What a piece of crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Multiplayer not working anymore since last week. No outlook when they'll fix it available. This is not even a hidden bug. It happens right at the beginning each time you click on Multiplayer. -&gt;testing before releasing patches seems not to happen -&gt;no outlook available when they fix it means they don't really care about the issue  ",
            "review_score": "-1"
        },
        {
            "review_text": "Guess I didn't read close enough on details to see where my dual yeilding gun/sword VanHelsingish toon is un-playable in The Final Cut. Too bad I wasted my cashing thinking such.",
            "review_score": "-1"
        },
        {
            "review_text": "The Incredible Adventures of Van Helsing - Final Cut is an action RPG that combines the three previous Van Helsing games into one unified campaign. Before this Final Cut version my exposure to the series was very limited as I had only briefly tried out the very first Adventures of Van Helsing game.  The game has all the features one would expect in a traditional action RPG. Unfortunately, the game suffers from bland gameplay and uneven production values. Graphics often feel dated, even with the optional high resolution texture pack. Some of the voice acting is also quite weak and other audio isn't particularly memorable, either.  The combat itself is pretty simplistic, most builds only use a few skills frequently. The monster design is fairly boring as well, so the game gets repetitive pretty fast. Luckily the bosses are a lot more varied and there are a few maps that break the monotony. Still, with no random maps the campaign has very little replay value.  The character development is not particularly deep or engaging either, there are not that many good builds per class and often the good choices are pretty obvious. On a positive note respecs are cheap so there's no big harm experimenting with builds. Itemization is not particularly interesting either as there only a very few truly unique items.  The game is quite story-driven, especially for an action RPG. The main story is decent enough and the game makes use of many different myths and stories. Side quests are more of a mixed bag. Some are interesting enough whereas others feel like filler content.  In addition to the your typical action RPG maps, the game has several different optional minigames that add a bit of variety to the campaign. None of these are particularly compelling, however. The tower defense minigame is by far the most involved of these. It's decent enough implementation of the basic tower defense formula, but it could have been integrated better into the game world. The other minigames provide very little actual gameplay, they are mainly there as opportunities to score some easy extra loot.  While I found my playthrough enjoyable enough, I'm finding it hard to recommend the game to anyone who is not already an action RPG fan. The core gameplay just isn't compelling enough and the game lacks replay value. However, if you can get the game cheap during a sale, it's compelling enough for a single playthrough.  I played through the game on hard with the Bounty Hunter class. After finishing the main game I also dabbled a bit with the scenario maps.  The good: - Interesting setting that mixes gothic and steampunk elements - Lady Katarina is a great sidekick and provides a lot of fun dialog - Lots of hidden secrets - Does a good job of combining three separate games into one fairly seamless whole - Lots of inventory and storage space  The bad: - Core gameplay is not very engaging - Character development and skill system appear deep on the surface, but on closer inspection the whole thing is a poorly balanced and not very interesting - Boring loot - Powering up skills with rage often feels clunky - Map design is often pretty bland - Voice acting ranges from passable to terrible - Overuse of pop culture references and jokes - Auto-leveling enemies that can lead to big difficulty spikes - Fairly dated graphics  The ugly: - Long loading times",
            "review_score": "-1"
        },
        {
            "review_text": "Returned..does not function well in Windows 10 and requires yet another account creation.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy if you have a mac it wont boot up properly",
            "review_score": "-1"
        },
        {
            "review_text": "As much as i want to recommend this, i cant. I tried this game once again on fearless as a constructor because the mechanic was fun in the 2nd part but it just doesent work here.  The system is not challenging its simply broken. Ofc you could play on lower difficulty but thats not fun either its just plain boring, you wont die alot but you also will not find good items. Several times youll get 1-hitted without knowing why, also your minions die most of the time in an instant even if you optimize your whole build so they do alot damage and they should have enough hp, they are basically useless when you need them. For example the ornithopters are weaker then the drones wich came before them, also you cant have all of them out at once.... im not exactly sure why they made this desicion since vh1 and vh2 have been alot of fun.  I guess they wanned to make it more challanging making it 'harder' but all they did was removing the fun, it feels slow and repetitive pretty quickly, and when you see that your efforts and your work is not paying at all, and every time you upgrade your equipment and improove it a little here and there but in the end you feel even weaker than before, then its actually a waste of time.  If you feel like getting this game anyway, i recommend waiting for a discount.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately the game has become broken for me. I cannot progress passed the beginning of Chapter 2 (Dreadworks). After the very first shop merchant you find in this level, the game immediately crashes and restarts my PC. 69 other games in my library and more outside of steam and not one does this. Have done a few hours of research and forum posting. No fixes as of yet. That said, nobody should have to use hours of their time trying to fix a $45 game that should work. Money wasted.. Time wasted..  It actually sucks because I was having a good time with the game. If there is a fix, I'll change to recommend it. You can still try it, but only at your own risk.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great single player game, but sadly the multiplayer community doesnt allow anyone else in their games but theyre own friends so if you try and join someone elses game you will get instantly kicked unless you know the person so if you wanna play with someone dont be surprised to get instantly * Kicked* Out of the game for no reason whatsoever but if you like to play alone then this game will be good for you. I dont know how they could fix this sour community? Maybe add rewards to hosts for letting other people play their games IDK ? Bye.",
            "review_score": "-1"
        },
        {
            "review_text": "Kinda lackluster and the writing is cheese.",
            "review_score": "-1"
        },
        {
            "review_text": "crashes every 1 min into starting up. after forcing into 32bit it crashes 1 min into the intro",
            "review_score": "-1"
        },
        {
            "review_text": "There is no neutral rating for this game, and I stopped playing without finishing due to lack of fun, so I am giving it a negative rating.  I thought that the first two Van Helsing games were fun and played them all the way through. I liked that there was set gear to collect and that it was possible to load one's character from the first game into the second game. This game, like the third in the series, does not allow a player to load in an existing character. In addition, the set gear is no longer in the game until the very end and only if your character reaches the highest level possible (100).  The game as published currently is not well-balanced. My first new character was a Bounty Hunter and I was able to chew my way through to the third game with no problem. At that point I started to get bored so I made a constructor. I had fun with that character up until the bits in the second game when there are bombardments that fall on Borgova. The constructor relies on having a multitude of bot and turret constructs that do damage and protect him, and I found it next to impossible to avoid having my various constructs blown up by one to two bombardment hits. At this point I just decided it was pointless to continue as there are multiple times when your character is hit by bombardments in game and also in the adventure maps. I went looking for and found a new game to play.  If you have not played the first two Van Helsing games, then I recommend playing those as I found them to be more entertaining and the classes better constructed. If you played those already then I suggest waiting for a balance and/or update to this game (or using a mod if you really want to play it).  I really wanted to like this game more as I enjoy the setting, story, and steam punk atmosphere and critters. Oh well... so many other games to enjoy and so little time.  ",
            "review_score": "-1"
        }
    ]
}