{
    "app_id": 400110,
    "name": "Else Heart.Break()",
    "release_date": "2015-09-24",
    "developer": [
        "Erik Svedäng",
        "El Huervo / Niklas Åkerblad",
        "Tobias Sjögren",
        "Oscar \"Ratvader\" Rydelius",
        "Johannes Gotlén"
    ],
    "publisher": [
        "Erik Svedäng AB"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Programming"
    ],
    "achievements": 0,
    "positive_ratings": 356,
    "negative_ratings": 173,
    "price": 18.99,
    "description": "A game about friendship, love and technology in a place where bits have replaced atoms.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400110/header.jpg?t=1447377823",
    "minimum_requirements": "OS: 7 Processor: Core 2 Duo 2.4 GHz Memory: 2 GB RAM Graphics: Dedicated graphics card DirectX: Version 9.0 Storage: 1500 MB available space",
    "recommended_requirements": "OS: 7 Processor: Intel Core i3 2.4 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GT 650M or equivalent DirectX: Version 9.0 Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "This game is pure escapism. Think of Sims or Second Life, if those titles were created by people with an actual artistic flair and a sense of exploration. I enjoy just walking around the town, seeing what people have to say and appreciating the detail that went into each part of the city. Nothing else even comes close to the cool vibes that you get from playing Else Heart.Break(). This will be my go-to chill out game for a long time to come.",
            "review_score": "1"
        },
        {
            "review_text": "After playing the game for some time I can tell that it is really cool. It is my first game of the hacking 'genre', but I do have experience in software development and I am somehow familiar with the topic.  The beginning is quite straight forward and you get along pretty good. However as soon as you get to the main city where the actual story (for what I can tell atm, I haven't finished yet) takes place.  A problem that you may face if you have absolutely no idea of what 'hacking' is about, that even if you do not have to do any hacking yet, you are already expected to have the right mindset for doing so. The nature of hacking just is about finding a way how to get to a solution and in the case of the beginning it is just about getting to know the right people at the right time. This does require some skill set like having fun with exploring new areas, keep on pushing again and again until you get the result you want - like advancing in dialogues- and last but not least the patience to keep up with the task. But what is the task? This question will become clearer the more you move on. This is part of the game.  To sum up, you will need about 2-4h to get to the part where the 'actual' game begins (the hacking part). If you get there, the rest will mostly be learning new stuff (like simple programming and manipulation) and a nice story. But you have to have the patience to get there - if you don't then probably the hacking part may not be your biggest satisfaction, neither. So you may just put the game aside and don't 'waste' time on this game. On the other hand if you do get there you are most probably going to have a lot of fun with the rest of the game as well.  This may also be the biggest criticism: The game is not there to 'teach' you patience and since it does not have the claim to be an educational game it somehow fails to introduce todays average/casual gamer to the required thinking (no offense to both parties :) ). So I would definitly recommend the game but beforehand I'd make sure the player does know what to expect.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best hacking games,  since you hack meaningful things inside a pocket universe filled with diverse characters.  your path is arbitrary, i e. g. missed the most important tool for quite some time;) but then, the game started with full power.  you're free to program all kind of nonsense into the hackable items some of your ideas might not work,  but when they do, you'll feel very satisfied. floppy disks! cyberspace! don't read any walkthroughs!",
            "review_score": "1"
        },
        {
            "review_text": "Ok, first an anecdote, skip to [PROS &amp; CONS] if you don't want to read it:  I first came across this game while stumbling around the internet, in one of my routine 'StumbleUpon' binges before insomnia succumbs to fatigue. I didn't hit it directly, I hit some other game from the same publisher or something and then a link to it from there. It was pre-release at the time and not being promoted anywhere else. I read enough to be excited by the prospect of it but fell asleep or got distracted or something without making a note of the name.  Fast forward a few weeks till I thought of it again and I was driving myself nuts trying to remember the name of this brilliant experimental adventure game I had found... I got so frustrated I almost had myself convinced I imagined it, dreamed it or fantasized it.  I was pretty sure it would be released on Steam eventually if it wasn't a delusion, so I waited, stalking the coming soon and new release listings on the Store page. And finally here it is, snapped it up real quick and I'm glad I did.  [PROS &amp; CONS] Pros - Highly experimental game mechanic (A pro in my book) - Vibrant and creative art style - Brilliant 'chiptune' soundtrack, appeal for retro gamers  Cons - Not polished like a AAA game (not that you should expect it to be) - Writing could be stronger, but I am a harsh critic in this department, others might be more forgiving - Primary plot path is by necessity shorter and more direct than most games, though their is a great deal that can be done outside that path.  tl;dr? Programming gameplay mechanic is bold and inventive, art style is quirky, music is retro, could be longer but as a whole, worth the money any day.",
            "review_score": "1"
        },
        {
            "review_text": "macbook pro retina no programming experience  This game has many flaws. A bug here and there. Pretty sure I skipped a few missions/quest on accident. Crashes quite often (Not due to my codes). But damn, thank you for making this awesome game! Usually, I wouldn't put up with the problems I listed above but heart break is truly unique in a good way. I had so much fun to where I'm excusing the issues. I know making a game like this is pretty darn tricky.  I didn't have issues with the camera. Maybe you guys forgot that you could zoom out or rotate?  I loved the art, the music, the atomsphere. Lots of complaints about having boring conversations. To me it fit well within the world. It was sort of down to earth and funny sometimes. It's not amazing nor boring but I enjoyed it.  You might not enjoy the game if you don't tinker around with the codes, If you're just trying to beat the game as fast as you can, or looking for an amazing plot.    I hope we get another game like heart break with improvements.. That would just be amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game swept me right off my feet! At first I felt lost. The city felt confusing and people gave me weird directions. Which is just what I've felt before, being new to a town. Then I'm suddenly interested in what everybody is doing, and before you know it I'm unraveling all these strange characters and events occuring in this city that's more than meets the eye!  The mechanic of being able to hack almost everything makes some great emergent gameplay (if you're willing to dive deep enough to experience it) and the art and sound design sets the mood in a way few indie games have ever done, if you ask me.",
            "review_score": "1"
        },
        {
            "review_text": "A very unique game that is a lot of fun. Don't expect a lot of hand holding, this isn't your made-for-the-masses adventure game. You will need to really invest yourself to discover the hidden gem that is Else Heart.Break().",
            "review_score": "1"
        },
        {
            "review_text": "It's an entertaining game with a nice style  That said, the story really needs some help  ",
            "review_score": "1"
        },
        {
            "review_text": "var steamReviewsComputer = Connect('SteamReviewsComputer') steamReviewsComputer.PostReview('Marmaduke', 'I wish you could use Slurp() on real-life computers')",
            "review_score": "1"
        },
        {
            "review_text": "so far, I love it!",
            "review_score": "1"
        },
        {
            "review_text": "I am falling in love with this game.  I can now hack a cup of coffee to be even more powerful, that's power my friend. After learning that the game is NOT in fact about selling soda beverages, but actually about developing social connections with the characters I meet, it really started to open up.  This game is fantastic, the art style is beautiful, the music and sound design is beautiful...  It is also extremely challenging for someone who doesn't know how to code, but here's the kicker. I've tried to learn coding before, but got too bored within moments. This game presents coding in such a way as to make it feel like learning the mechanics of a game you like. I'm learning to code, I'm 'getting it' while I'm doing it, I'm rewarded for each step I make, by having more power in the world I exist in.  Ah, and here's perhaps the most important part of my love of this game, I really feel like I'm immersed in it. This isn't a game as much as it is a thing of utter brilliance.   The game can seem a little dry and aimless at the beginning, but once it clicks with you, it's just so eye opening.   Do yourself a favour, get this game, jump right into it, and enjoy the hell out of a truly unique experience.  BUT!!!  Don't boot it up an hour or two before bedtime on a work day, and expect to only play for an hour or two. I've just sat down at 11PM, I played for about an hour, and it's now 5AM. That hasn't happened to me in a LONG time.  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, and charming. It makes a point of keeping you away from any sort of hacking device until you've wandered around for a bit and gotten a feel for the town and the characters, which helps with the human side of things.  The problem is that depending on who you are and how much you're into it, there can be a huge dissonance between the character and the player. The character isn't that great at programming and all he really wants to do is follow his love interest around like a creepy, stalking six-foot-tall puppy; the player, on the other hand, might not have the same experience.   If you're any good at programming at all, you'll probably break reality itself and remake your PC into an omnipotent deity after an hour or so of tinkering with the hacking tool; but in character he's always a huge dweebus. It's really weird. I just like to pretend he's screwing with everyone else.",
            "review_score": "1"
        },
        {
            "review_text": "The art-style in this game is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Superb - a real must. Great music also.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend. Fun adventure that includes some intersting light programming puzzles. Reminiscent of Ultima 7 in visual style and feel.",
            "review_score": "1"
        },
        {
            "review_text": "A hard game to get into at first, but once you get going, it's actually pretty cool.",
            "review_score": "1"
        },
        {
            "review_text": "A game with a lot of potential but badly finished, plagued with bugs potentially game-breaking. I don't know. The only thing I am sure of, is that after a few advancements in the storyline, the triggers that should let me advance in it didn't trigger off. Or something like that. I learned things, I solved problems, but the world didn't react to that. So I stayed in the same phase, stage, act of the game. Forever. After a while of experimenting, as in a kind of sandbox game, I got bored (not that much of a complete world to act as a stand-alone sandbox game). Although I enjoyed the programming part (I am a programmer, as professional and as hobbyst), in the end the experience delivered was a bit frustrating. So no, I sadly do not recommend. Note that this applies to version 1.0.8, according to the news section, and after a month of no updates, I have little hope that the game will ever improve.",
            "review_score": "-1"
        },
        {
            "review_text": "This game feels like there is a story to be told, but the controls and this joke of an instruction made it not understandable which I find really sad, since I would have loved to heard your story.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought the latest Humble Bundle just for this game, expecting it to be a good one. I read about it and saw a good review by PCGamer, and it being the favourite game of the year of the reviewer. I previously played some other programming related games and enjoyed those, so I expected this one to be fun too. Sadly, it wasn't. The game gives you no clear instructions what to do, and while you can usually figure it out easily, sometimes you are just walking around, talking to random people trying to do what you think you are supposed to do. The controls are rather annoying, as the camera often clips into buildings making it hard to look around. I have not played the game for long, but I already encountered a bug twice where I had to reload a savegame because the game stopped responding to my input, and I get random lagspîkes from time to time (although that might just be my outdated hardware). So while I expected to have a good time with this game, I sadly didn't. I would not currently recommend the game untill the developers roll out some patches.",
            "review_score": "-1"
        },
        {
            "review_text": "This game really make my heart break because it lacks tutorial and confusing story. Could be really good game though.",
            "review_score": "-1"
        },
        {
            "review_text": "The 'What the f-- am I supposed to do and getting lost' simulator 2016, complete with lacking map, mediocre camera and no information about where to go to or whom to speak to (Or how to get there, for that matter.)   There is extreme handholding in games, there is having minimal information (yet sufficiant) about your objectives in others and then there is this one, throwing you into the game world with no information about what to do whatsoever, frustratingly so. And the terrible camera is only obfuscating your limited view on an area only further. I like the idea of the game in itself, but the realization of it is just....NO, especially for a point and click adventure.",
            "review_score": "-1"
        },
        {
            "review_text": "I may have only played very little of this game but I didn't find a single aspect that could get me hooked. The Art style was hard on the eyes, the overworld was overly and uneccesarily confusing and worst of all the gameplay was exceedingly boring. If you as a developer cannot produce something more compelling than aimless wandering around a boring and confusing environment in the first hour of your game then you have failed on some level. There seemed to be some kind of 'hack the planet' vibe going on, hinting at real gameplay from the start but if that doesn't manifest itself in an hour then what's the point?",
            "review_score": "-1"
        }
    ]
}