{
    "app_id": 400200,
    "name": "The Mystery of a Lost Planet",
    "release_date": "2015-12-17",
    "developer": [
        "AlikArt Studio"
    ],
    "publisher": [
        "AlikArt Studio"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 14,
    "positive_ratings": 55,
    "negative_ratings": 29,
    "price": 3.99,
    "description": "The crew of a marooned spaceship must uncover the secrets of an unknown planet to survive. After a crash landing on the lost planet, you’re left with many unanswered questions. What was the mysterious force that seems to have pulled your ship into the planet and what are its intentions?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400200/header.jpg?t=1480426093",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: 1 Ghz Memory: 512 MB RAM DirectX: Version 9.0 Storage: 553 MB available space",
    "recommended_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: 2 Ghz Memory: 1 GB RAM DirectX: Version 9.0 Storage: 553 MB available space",
    "reviews": [
        {
            "review_text": "The game captures and keeps in suspense.It makes you think, and that's another reason I love it. Music creates a disturbing atmosphere.Logical and thought-out game with beautiful graphics - dim, then dark, then bright... everything!",
            "review_score": "1"
        },
        {
            "review_text": "A sci fi HOG???? Whaaaaaaat?  So few are far between. 2014 Space Legends (on pc) as far as the other ONE. Insta buy as soon as I heard about it. Actually, I am so desparate for Sci-Fi HOGs, I do a monthly google search just to see if anything is happening on the development front. (Steam has two if you do a tag search sci fi/ hidden object)   So as far as the game goes, I liked it but the sci fi elements were not plentiful. It was more of a jungle exploration game imo but after being fed plenty of fanstasy and victorian era games the change was welcome. The HOG scenes were fair. The puzzles did not irratate. The story was okay. The art was very good. And the music was alright. Game engine stable. If these guys were doing a series of sci fi RPGs I would readily get the next one. (On Day 1 - full price no less)",
            "review_score": "1"
        },
        {
            "review_text": "Kinda ok as HOG's go.  The storyline loses luster as it switches up and give the player a less than dramatic ending.  Quick play-through, as it uses a common sense approach to finding the clues to (ahem) level up. Graphics are good and the overall theme is entertaining enough for a one play type deal...as a recommend special.",
            "review_score": "-1"
        }
    ]
}