{
    "app_id": 400370,
    "name": "Normality",
    "release_date": "2015-10-09",
    "developer": [
        "Gremlin Interactive"
    ],
    "publisher": [
        "Funbox Media Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 190,
    "negative_ratings": 100,
    "price": 2.09,
    "description": "A sinister force now controls the city of Neutropolis. A once-thriving city full of beauty and light, Neutropolis has been reduced to a a stagnant pit of apathy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400370/header.jpg?t=1530529922",
    "minimum_requirements": "最低: OS: Windows XP, Vista, 7, 8 プロセッサー: 1.8 GHz Processor メモリー: 512 MB RAM グラフィック: 3D graphics card compatible with DirectX 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Most influential game of my life.   They really don't make them like they used to! Imagine buying a game today then looking at the manual through a mirror to read a riddle to work out what the #### to do! It's crazy which is why I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Normality is a very odd combination - an adventure game with a Doom-like engine. Sounds odd? Yeah it is. There are some minor issues with that presentation but I'll mention it when I'll go on... Normality is a Orwell served with a heavy rock/punk sauce. The titular normality is complete subjection to the ruling government, that means... yeah. No TV other than the boring NORMTV(TM)which runs normal (read: boring) programs for normal (read: boring) people, no rock music, normal books only (anything that isn't normal is of course either censored or disposed off). Hell you can't live in a NORM world eh? Take control of Kent - a young rebellious (or just wanting to have fun) chap and overthrow the boring government! That's pretty much the story of the game. As for the actual substance - the game requires scanning the environment carefully (Not too careful though, thankfully it isn't a pixel hunt), pick up the puzzle pieces, use them, converse - the usual adventure game stuff. One thing though: the puzzles are HARD. Play on words, tongue in cheek humor or just sheer surrealism is the basis of this game. So watch the conversations! Throwing a spanner in the works might have to be taken literally. The 3D interface works out... so-so. It's weird and the voodoo doll interface needs to get some using to. Buuuuuttttttttttt... it works. That's pretty much the best summary: The game works - the dry and quirky humor, the weird control scheme and the revolutionist storyline all goes well together. 5 stars and must get for any adventure game fan. If you're a new to the genre though, reconsider the purchase for it might leave you clutching your head for days, trying to solve a particularly hard puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Normality is an exciting point-and-click adventure game about a fat ginger kid who is locked in an apartment all day and literally forced by an even more obese angry man to binge-watch TV as part of some sick act of voyeurism.  Also, there's a shark on a harpoon embedded into your bath. Rip out the harpoon and the resulting hole in your bath has some sort of horrific stench of decay spewing out of it. Needless to say it's a very fascinating game that I totally didn't win in a giveaway and leave running solely for Steam cards.  Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "I don't like it at all. Very ugly and pointless game.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont like the gameplay and the graphic.",
            "review_score": "-1"
        },
        {
            "review_text": "Normality is a great little classic 3D adventure game that features a fairly cutting edge 3D engine for its time. You can actually move and look around freely with the mouse although the controls take some getting used to (e.g. press both left and right mouse buttons to enable free mouse look). Given its age (released in 1996) that is to be expected but how far ahead of its time it is in general even extends to an autosave feature - yes those were extremely unusual even after almost a decade after the release of this game! The animated textures and level of geometry detail is quite something and while there are sprites for many of the objects and people there are many 3D cutscenes peppered throughout the game.  So, enough about how retro cutting edge it was, the game itself has an interesting story, funny characters and conversations and mostly logical, if at times hair pulling puzzles due to having to find an object in another location to advance, The latter is softened a bit by a fast travel option available from the beginning of the game. The music is quite so-so in general but not really bad per se (we are talking 1996 DOS here). The length is fairly decent clocking in at around 10 hours and it comes with Steam trading cards too. The setting is quite interesting being somewhat a critique of consumer society wrapped in humour.  Would I recommend this game? Of course!",
            "review_score": "1"
        }
    ]
}