{
    "app_id": 400580,
    "name": "Black Closet",
    "release_date": "2015-09-16",
    "developer": [
        "Hanako Games"
    ],
    "publisher": [
        "Hanako Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Detective",
        "Indie",
        "Strategy"
    ],
    "achievements": 16,
    "positive_ratings": 169,
    "negative_ratings": 10,
    "price": 14.99,
    "description": "Command your minions to solve mysteries and cover up scandals in a high-class boarding school, where the competition is cut-throat and image is everything. But be careful - one of your minions is a traitor.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400580/header.jpg?t=1453094638",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.2 Ghz Memory: 256 MB RAM Graphics: 1366x768 Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a cool game for people who like reading and/or rolling D20s.  Seriously though it's a really neat little game, part visual novel and part detective saga; unfortunately, it's hobbled by a clunky, low rent UI and a price that's probably a little too high for what it offers. The randomly-generated cases work well with a surprising amount of variety in the possible outcomes, and the resource/time management aspects of creating tension and leading to interesting dilemmas regarding who should be sent where.  The story and dialogue gets a bit melodramatic at times, but it feels appropriate for a game about conflicts between high school girls at an all-female academy. I enjoyed the character development that I saw (I didn't complete everyone's story arcs), even though most of them start off as pretty standard archetypes. To me, at least, the constant stream of cases does a good job of alleviating a major issue with visual novels: every playthrough is unique! The standard 'pick these options to go down this path' setup still exists, but the player isn't just fast-forwarding through the rest of the game during subsequent playthroughs.  To be honest, Black Closet is a tough sell at full price; it's a fascinating concept that's executed reasonably well, but it doesn't feel meaty or polished enough for $20. Once it's on sale, though? If you're at all intrigued by this game, get it!",
            "review_score": "1"
        },
        {
            "review_text": "Note to self: there's always a traitor.",
            "review_score": "1"
        },
        {
            "review_text": "Greetings fellow gamers! This is Gamer Guy (In a Suit) from the Echo Army YouTube channel! Today I am bringing you a review of Black Closet!   (NOTE: This game was reviewed using a key provided by the Developer)  Video Review:     Black Closet Review     The 'Too Long, Didn't Watch' Review:  A delightful game. A TON of replayability. Intriguing charachters, interesting scenarios. Easy gameplay/controls. Addicting game. 4.5/5  Worth the $20  The 'Meat &amp; Potatoes' Review:  The game play is superb. What can I say? Great graphics, solid sounds, comfortable and addicting gameplay. Very much like running the mafia....except at an all girls school! You have minions, traitors, harassing, interrogating and more. An absolutely fantastic detective/mystery type game with solid elements of Simulators, Strategy Games and even RPGs present. Fans of Long Live The Queen will enjoy this game quite a bit. There really isn't much to tell you about this game short of 'it's actually worth the full price!' This has certainly been one of the best games I have played over the last 6 months. Games like this are precisely why I enjoy PC gaming more than console gaming. Almost a truly perfect game, just falls somewhat short as I can concept running a little thin after, oh, 40-60 hours of gameplay or so. That is NOT bad at all. This gamer hesitates greatly to give out a 5 to ANY game, this one falls JUST short. Definitely a 4.5 out of 5 stars and worth your $20 any day.  Happy Gaming!!!",
            "review_score": "1"
        },
        {
            "review_text": "Spreadsheet sim/VN/card game/rpg. Play a lesbian School Captain in an elite boarding school, and use your minions to pry into your fellow students' secrets and bend them to your will.  A+",
            "review_score": "1"
        },
        {
            "review_text": "An estrogen-filled version of Floor 13. As the Student President, your task is to preserve your school's reputation with a student body full of high school girls who do whatever they want and think they can get away with it.  From exam counselling (Regardless of your daddy issues and your desire to get back at your family, you are not failing your next exam on purpose) to stopping them from personal embarassment (Your freedom of artistic expression is invalid; you are not putting a painting of a woman surrounded by tentacles on public display) to religious education (Black magic = bad).   Oh, did I mention that one of your minions is a traitor and you have three months to win her loyalty or lose a valuable minion forever? It's not Floor 13, but would play again.",
            "review_score": "1"
        },
        {
            "review_text": "A superb game of politics and intrigue. It's challenging, it's fun, and it's actually kinda sexy. But don't go thinking it's smut. There's a really interesting game here, with really interesting choices to make. The difficulty fades once you figure out the mechanics, but that takes long enough for you to be really entertained.  Not the kind of game I'd usually play, but having played it, I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Good, but short (approx. 5-6 hours.) It has some decent replayability; however, that doesn't quite excuse its lack of depth with regards to the main story line. I wouldn't want to pay full price, but if you can get it at a steep enough discount, I'd say it's a good way to kill a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not even halfway through the game, and I love it. It's not a game I think EVERYONE will love, but if you're a fan of detective games with good plotlines, you will definitely be happy with it. It seems simple at first, but you'll quickly realize how difficult it is to keep all of your karma and reputation intact. The dating portion is pretty solid, taking on the feeling of a good visual novel style of game.  The case aspect, for me, is a bit difficult - not only realizing what needs to be done in some cases, but I also don't understand the case rating system. I've failed some and gotten a C, and solved one in two days (that could have ONLY been solved on day 1 by gambling that I'd interrogate 3 characters successfully) and gotten a D. I think that would be my biggest concern in gameplay, because otherwise, I'm digging the stats and D-20 system.  They've added tons of replayability, with different story paths for different choices, 5 romance options, case endings differentiating, and randomizing the traitor. I'm absolutely going to continue playing, and will likely play it again!",
            "review_score": "1"
        },
        {
            "review_text": "Black Closet, a mix of mistery and VN elements. Thats something you dont see everyday. You are a Highschoolgirl in one of this highclass schools in Imbetterthanyoutopia. You're Student Council President and need to protect the School image by any means nessesary. Heres where the mistery begins. You solve cases/puzzles through various actions like a nice and friendly talk, or you just detain people until they break. Its just like your classical overthetop anime since you have almost as much pover as that girl from killakill. The cases are randomly generated and actually quite hard to figure out sometimes. Ofc there are schematics that repeat themselfs after you have senn them all, but that certanly takes some time. The VN part comes into play with your 5 Minions who you can befriend at weekends. They do seem pretty shallow at the beginning but they get more interesting the more time you spend with them.  But does all this work? Yes and no.  The good side of the game is that it just works i guess. The cases are fun and dont become repetetive that early on. The caracters are all interesting and the VN part does a really good job.  The bad things on the other hand go way more into detail. It starts of with the information given at the start which is pertty much not more than I have given until now. No mechaniks, no Stats, basically nothing gets properly explained, which leads to a lot of trail and error at the beginning. Also the VN part could be a little more informative before, since even though this is a Lesbian Romance game you cannot romance everyone. Two of the girls are actually underaged and therfore not openly romancable, since the image of the school wouldnt allow it to begin with, which is a great touch of realism, but it needs to be said at the beginning. I started the game 2 times hoping to get my favorite girls and boom, you're to old after 2-4 hours, go fund yourself. Also one of the girls is only romancable if she was the traitor, and the chances for her to be one is actually lower since she is a pretty hard opponent. Again a 3rd time I had to restart after wondering why nothing happend anymore.  Even though there is so much to criticise here, I would still recommend the game to every fan of VNs or Hanako Games other games like Long live the princes. It is hard, its enjoyable, and after you figured everything out, an overall great game.",
            "review_score": "1"
        },
        {
            "review_text": "Solve mysteries. Find the traitor in your ranks. Seduce your underlings. Reign over highschool with an iron fist. What's not to love, really?  Black closet is a turn-based game, some king of strategy-visual novel hybrid that has you impersonating the president of the student council of a prestigious girl's bording school. You are in command of a team of underlings, and must tackle a number of randomly generated cases quickly enough to safeguard the school's reputation, but subtly enough not to turn the students against you. The mechanics are easy to take a hold off, but the gameplay is very well balanced, meaning you'll constantly be weighting your decisions and the way you allocate your limited manpower.  And that's only the day to day affairs. The procedurally generated cases rhythm a much bigger intrigue, as your character must prepare for her life after school, attend a variety of event, bond with her underlings, find the traitor in the council (who changes every game and can be detected by carefully observing your underlings' success rate), and maybe uncover a conspiracy or three, all the while maintaining her position as the student council president.",
            "review_score": "1"
        }
    ]
}