{
    "app_id": 400790,
    "name": "The Juicer",
    "release_date": "2015-09-11",
    "developer": [
        "Anvate Games"
    ],
    "publisher": [
        "Anvate Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 180,
    "negative_ratings": 29,
    "price": 0.79,
    "description": "The game is a cheerful shooter with a user-friendly gameplay in an original setting.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400790/header.jpg?t=1556220062",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium 4 Memory: 512 MB RAM Graphics: DirectX 9.0 compatible video card DirectX: Version 9.0c Storage: 200 MB available space Sound Card: Any sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is awesome...and MUCH more value than the price...in fact, this could be the best dollar, in terms of value, that I've ever spent! Sure, that may sound over-the-top or superfluous in praise, but it's TRUE. The game itself is fun, the controls are surprisingly accurate, the difficulty is appropriate to which one you select...but it's more than just that. Bad day? Shoot some veggies. Great day? Celebrate by shooting some veggies. Bored? Shoot some veggies. Each level is different enough to keep you interested. BEST OF ALL...is the developers. Yes, for just a Dollar, I have found through personal experience that this game's developers give service above-and-beyond, and better than ANY developers whose game's prices cost you your first-born and ignore or take personally any complaint you have. I had troubles, at first, getting the game to work, and these developers took personal interest EVERY DAY until they helped solve my issue, and were polite, and shared in both my worry AND my joy once the issue was fixed...and ALL THIS happiness, fun and personal joy for one dollar. I cannot think of ANY other time IN MY LIFE I had this much value for such a reasonable price. So yes, I recommend this game on several levels, and offer the highest praise possible for value inestably higher than the price offered. By all means, GET THIS GAME!! Enjoy life as a result! :)",
            "review_score": "1"
        },
        {
            "review_text": "Better than CoD BO3",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. At the end of every level you get brutally gun down frightened pears and pumpkins. That's all you really need in a game.",
            "review_score": "1"
        },
        {
            "review_text": "removed my cancer 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Imagine that they are filthy canadians and you are a d-day soldier.  1944/911",
            "review_score": "1"
        },
        {
            "review_text": "  10/10",
            "review_score": "1"
        },
        {
            "review_text": "My friend gifted me this game. We are no longer friends.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10   Pro's:  Beautiful Graphics, I think this game can confidantely stand next to games like COD Ghosts, COD Advanced Warefare and the sims 4.  Masterpiece AI, the AI in this game is literally twice as good as fish ai in COD. I can't get enough of it  Controlls, super smooth. Feels like I'm playing a next gen version of CSGO.  Cons:    They have my family hostage  ",
            "review_score": "1"
        },
        {
            "review_text": "very good ww1 sim and really shows the horrors of what it was like",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why, but something about this is amazing It's not good, but something about it makes it extremely fun",
            "review_score": "1"
        },
        {
            "review_text": "  cool badge :3 *actually i haven't played this game thou...",
            "review_score": "1"
        }
    ]
}