{
    "app_id": 400740,
    "name": "VERGE:Lost chapter",
    "release_date": "2015-10-01",
    "developer": [
        "GDNomad"
    ],
    "publisher": [
        "Infernal Dream"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Gore",
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 110,
    "negative_ratings": 140,
    "price": 3.99,
    "description": "Our hero has decided to get away from the urban bustle and out into nature to relax. On his way to his cabin, while anticipating the amazing sunsets, fresh air, the tranquility of the mountains, a heavy rain began to fall.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400740/header.jpg?t=1527699347",
    "minimum_requirements": "OS: XP, Vista, 7, 8 Processor: Intel Quad-Core (q8300) Memory: 4 GB RAM Graphics: NVIDIA GeForce 400 series or AMD Radeon HD 6000 series, 1GB Video Card (Minimum Shader Model 2.0) DirectX: Version 9.0 Storage: 1500 MB available space Sound Card: DirectX Compatible Sound Card with latest drivers",
    "recommended_requirements": "OS: XP, Vista, 7, 8 - (64 Bit) Processor: Intel Quad-Core (i5 2300) or AMD Octo-Core (FX 8150) Memory: 8 GB RAM Graphics: NVIDIA GeForce 660Ti or greater, AMD Radeon HD 7950 or greater, 2GB Video Card (Minimum Shader Model 2.0) DirectX: Version 9.0c Storage: 1500 MB available space Sound Card: DirectX Compatible Sound Card with latest drivers",
    "reviews": [
        {
            "review_text": "Could have been a LOT better.Loading screens.....lack of content......VERY short.Got what I paid for though.",
            "review_score": "-1"
        },
        {
            "review_text": "  Instead of the free version of fps creator the dev decide to use the software 'GameGuru' which is the new version of fps/ version that cost 10 bucks.. Unfortunately the game is terrible. All you do is find keys and open doors. Graphics are bad and you cant RUN and jump is about an inch high! Most of the ingame stuff are paid assets. Developer clearly doesnt know how to make a game after his 3rd try.  Pros Steam trading cards puzzles 2 different endings  Cons Gameplay is short about an hour for both playthroughs puzzles are lame Unskippable dialogue cutscenes  Cant run All you do is find keys Graphics bad Laggy gameplay",
            "review_score": "-1"
        },
        {
            "review_text": "Game took me about 20 min, 10 of which was looking for a key in an area with the same hallway and rooms copy and pasted 20 times over. Then I found another key and then the game was over. Didn't go to or see any of the other areas in the game. Don't know if I missed much story, because there was literally none, besides this guy ending up in an old asylum, then escaping in 5 min and driving to the cabin he was planning on going to. There was 1 semi scare and thats about it. It was just over so fast and there was literally nothing to it. 3.5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute garbage. Save your 2 bucks for a coffee. Pray for my refund.",
            "review_score": "-1"
        },
        {
            "review_text": "This is very good and atmospheric horror.  I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game the only trouble is my stupid computer suckssss..... If we give this game time im sure then can fix eveything. Other than that love it.",
            "review_score": "1"
        }
    ]
}