{
    "app_id": 400910,
    "name": "Rabi-Ribi",
    "release_date": "2016-01-28",
    "developer": [
        "CreSpirit",
        "GemaYue"
    ],
    "publisher": [
        "Sekai Project"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Cute",
        "Bullet Hell"
    ],
    "achievements": 208,
    "positive_ratings": 6496,
    "negative_ratings": 167,
    "price": 13.59,
    "description": "Dodge bullets, missiles and lasers in battle as you wrap your head around that bunny girl costume! Combo away with your mighty Piko Hammer or spam various spells from afar with your fiery fairy friend. Explore and explode through Rabi-Rabi Island as you collect power-ups and uncover secrets...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/400910/header.jpg?t=1554835924",
    "minimum_requirements": "OS: Windows XP or above Processor: 1.0 Ghz or above Memory: 1 GB RAM Graphics: Any DirectX 9.0 supported card DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP or above Processor: 2.0 Ghz or above Memory: 2 GB RAM Graphics: Any non-integrated card with DirectX 9.0 support w/ 1280 x 720  or above DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Do not be fooled by all the weeb anime visuals, this game is an amazing metroidvania. The explorable game world is giant, and is mostly non-linear. There are literally dozens of bosses, many of which can be tackled in any order you want with few exceptions. There is fast travel to minimize some back tracking, a shop where you can buy upgrades, and a ton of hidden secrets and items scattered all over the map.  The gameplay handles surprisingly well, and the music is top notch through the entire game. The story is sort of meh, and there's a lot of dialogue that is painful at times to read through. It doesn't detract enough from the game though.  Boss battles seem to be at the heart of the game since there are so many. They are bullet hell Touhou style fights with creative and insane barrage patterns. Playing through blind on Hard right out of the gate, I found it to have the perfect level of challenge. It's hard enough that you feel motivated to hunt down hidden power-ups, but fair enough to not discourage you. After all if you get stuck on a boss there's always a few others you can try your luck on.  After you beat the main final boss, which is a doozy of a fight that I won't forget soon, the game keeps plowing onwards after the credits roll into overtime with more challenges and extra content for those willing to see how deep the rabbit hole really goes. (See what I did there?)  Overall highly recommended for fans of metroidvanias, the game is very lengthy for the price and the replay value is there as well.",
            "review_score": "1"
        },
        {
            "review_text": "  First Impressions Video:         YouTube™ Video:  Rabi-Ribi (Critical Eye): Bunnyula and Bullet Hell&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Played for almost 200 hours and will be soon enoug...h... There still things to do...  -Metroidvania exploration in a huge world with lots of tricky secrets -Lots of challenging bullet hell style boss fights (20+ bosses) -High replayablity = Additional challanges such as higher difficulties and and no upgrade run -Gruelling, and frustratingly challenging journey to achieve all the achievements",
            "review_score": "1"
        },
        {
            "review_text": " Minor spoilers in the black boxes.",
            "review_score": "1"
        },
        {
            "review_text": " Rabi-Ribi is a platformer where you grow stronger and gain new abilities as you progress.",
            "review_score": "1"
        },
        {
            "review_text": "+ Smooth challenging gameplay + OST of the year + Beautiful sprites  + Bunnies + Replay value / nonlinear gameplay - Difficulty spikes  GOTY Material   Peroperoperoperopero",
            "review_score": "1"
        },
        {
            "review_text": "Hard game. I like it. Erina so cute w ",
            "review_score": "1"
        },
        {
            "review_text": "RIbbon loves this game with a perfect combination of bullet hell, platforming, and visual novel aspects.  The OST is amazing and Ribbon does not regret spending the extra $7 for it.  Ribbon thinks you can guess who Ribbon's favorite character is in the game.   Would buy sequel. 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fun little hybrid. Much of the time it's a 2D Metroidvania exploration game with dozens of upgrades scattered around a big 2D-platformer game world, and a (sequence-breakable) set of mobility upgrades that help you explore said world. Sprinkled liberally throughout are boss fights wherein the game suddenly becomes a bullet-hell dodge-and-counter action game, complete with the genre-conformant unreasonably-tiny hitbox on your character to make it possible to dodge the crazy attack patterns many of the bosses can dish out.  The plot is a bit ridiculous, but it's clearly just there for window-dressing, so I find that entirely forgivable.  If you like both Metroidvania-style action-platformer games and bullet hells, this is the game for you. Buy it, now.  If you like Metroidvania-style games but don't really feel like dodging bullet storms, you should probably buy this game anyway. Just play it on a lower difficulty setting; the main difference between difficulties is how many different attack patterns each boss gets.",
            "review_score": "1"
        },
        {
            "review_text": "Bullet-hell in a metroidvania style. Range of difficulties for everyone, cast of cute characters, unforgettable soundtrack, and tight controls.  Overall an amazing game. ",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvania bullethell shooter with bunny girls. What's there not to like?",
            "review_score": "1"
        },
        {
            "review_text": "You're a cute rabbit, everyone loves you. You die a lot too so you know that means it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "   Was a gift from a friend.   As much as I feel a bit mixxed with this game (and I'll explain why), it's a great, well done, creative game. Worth the price or no less than $10. Felt a hint of Paper Mario from the N64 with the badges.  The story is interesting, but I had trouble keeping track of it since most of the names aren't very easy to remember to a specific character. In fact some of the characters talk in first person and I forget who's talking at times or find myself not caring much about the story, sadly. (I would like to say I was bored of the story here and there, but everyone will assume I was in it for the breasts or whatever. Despite I have a thing for melons, that wasn't the case for this game.)  Here's the story from what I can recall:  Erina wakes up in a box in an area she doesn't recognize. She was a rabbit prior to waking up, but became human and for some unknown reason is dressed like a playboy rabbit (in terms of the clothing since the ears and tail are real). After exploring the unknown area, she wakes up back on her home island with her head on some girl's lap (who may or may not have a crush on Erina.) Erina eventually meets a frantic fairy named Ribbon, who believes she's a real bunny that eats fairies, and ends up attacking Erina in near exhaustion. After the battle, they become friends and head over to Rabi Rabi Town where they meet Erina's master (remember, Erina was an actual bunny before turning human, so think 'pet owner' master). Her master, Rumi, is shocked to see her pet turned human and explains what lead up to the change, along with Bunner Lovers becoming very rampent and nearly causing an extinction of rabbits on the island, and Rumi's missing sister, Miru. From there, Erina and Ribbon set out on an adventure.  That's just the Prologue too (roughly the first hour of the game). As you progress, you'll notice some references/cameos, even from another Sekai Project game.  The gameplay just keeps me glued to the point I have to hit the panic button to summon a friend with a crowbar to pry me away from my laptop! It's that addicting and fun. Last game I played that was a metroidvania + bullet hell was Rogue Legacy (however the layouts change every death, but is a decent comparison) but that was more frustrating than this (yet both challenging).  Now this is where I start to have mix feelings. I'm fine with fan-service when it makes sense, is humorous, and/or subtle, but when it becomes abundent, even if subtle, I start to question the value of the game. Everytime I see fan-service in a game, my first thought is 'Is it a poorly made game with eye candy to cover it or is the game very well made and the fan-service is just the icy to a very delicious cake?' This time, cake is no lie, but the icy does become too much that I can somewhat taste the cake and gardually become sick of the icy.  Majority of the fan-service I was comfortable with. Most of the characters, while may be sexualized, aren't TOO sexualized and feel more down-to-earth of how they appear. There's a handful that are beyond subtle, but it fits their character or the people they interact, so no real complaints. The game does recognize this that even Erina acknowledges she has no idea why she's dressed that way, with another character calling her outfit 'Shameless', and another instance of one character showing boob envy of a close friend of hers. As for the fairy's clothing... well faries are faries. How they dress is really up to speculation and imagination (look at Tinker Bell) so there's really no use in throwing a fuss about that. Ribbon is about the size of an average palm anyway.  Sadly, no explanation was ever given for why Erina was dressed in such fashion, I say as I glare at the devs since Erina doesn't deserve to be dressed that way (she's WAY too innocent for that). Do expect innuendo jokes and context though. You be a fool to not expect them from this game.  Overall, don't let the fan-service deter you. It's 100% non-sexual/suggestive. It's just appealing and nothing more. Yes, I was skeptic at first, but I asked around to verify from other players to help ease my mind. (However, if you get easily offended for seeing a girl in a bikini, some cleavage showing, and/or dressed in what's suppose to be sexual/suggestive but, in game context, isn't, well you're a kill-joy, paranoid person, or down right prude. Or maybe just a horny teen looking for content to get off on... you creep.)  There are at least two CG's that I just couldn't help but facepalm or groan in massive annoyance as it made two female characters look degrading than they should be. (You'll know once you see them and after you know the characters.)  The music I just LOVE. I WANT that soundtrack very badly!  Controls do feel odd, but will take a bit to get used to.  Now I need to mention some technical issues. My laptop surpasses the minimum system requirements, however there are isolated cases of frame dropping. I usually don't care about FPS beyond 30, but this game was programed to run smooth on 60, and if it drops to like 45 or 30 the effects clearly shows visually. Sadly there is no frame skip option, and even setting everything to the lowest settings there's still frame dropping. It's believed to be due to a certain number of sprites in one area, the background, or some unknown variable.  This is a known issue from others, not just me, and the devs are trying to find solutions for it. I'm unsure if this is recent or since release. Try not to let that deter you though as it can make boss battles easy since they're bullet hell/endurance.   Summary",
            "review_score": "1"
        },
        {
            "review_text": "As a devout fan of bullet hells(Touhou, Nuclear Throne, etc.), combat-based platformers(Cave Story, Metroid, Castlevania, etc.), and non-linear/exploration based games, I highly recommend Rabi-Ribi to any player looking for a challenge.  However, and this may sound bad, this is   not   for a casual player.  I repeat, casual players, stay away. My reason for saying this is simple; unless you wish to throw out any difficulty in the game and not feel any pride in your victories, you're going to want to play on Normal at the very lowest when you first play(I was debating between Normal and Hard but eventually cursed myself with Hard mode, which had me stuck on a boss for over 4 hours). I did make an alternative save file with Casual and another with Easy, just to see how much more difficult Hard mode was, and it definitely lives up to its name. Hard mode is difficult, and there are still two difficulties I haven't unocked yet. However, let's get off of this.    Gameplay:",
            "review_score": "1"
        },
        {
            "review_text": "Bunny girls? Yeah, yeah whatever. I'm here for the Metroidvania and I am not disappointed. (Not saying I hate the bunny girls though).  EDIT: After playing a little more. If you like Metroidvania games at all, then do yourself a favor and buy this game now. The soundtrack is amazing as well imo.",
            "review_score": "1"
        },
        {
            "review_text": "The game is incredibly fun and also incredibly rage inducing. That's my type of game. I've only done normal runs but the game gives off incredible replayability vibes. Once I'm done playing postgame i'm definitely going to venture to the hardest difficulty and smash my computer in induced rage.   Music is great! Nothing fantastic but something you can bob your head to when you're weeabooing out.   I got nothing much else to say. If you're into memorizing crazy patterns and failing 1000 times until you manage to dodge everything then this game is for you. Also its a metroidvania, who doesn't like a metroidvania-type-game?",
            "review_score": "1"
        },
        {
            "review_text": "This is the Metroidvaniest Metroidvania I've ever played. You wanna get powerups? You wanna backtrack and get more powerups? It's good.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I have to get this out of the way: this game has awesome soundtrack and the boss battle visuals are superb!  Couple that with the cute characters and seemingly slow and relaxed pace of the story makes you think it's pretty easy to play. The boss battles, however, get challenging and fast-paced over time. It's a great pick-me-up game to play on your down times.  So far the game itself is very solid and feels pretty polished! I'm glad to say I haven't encountered a single bug. And controlling Erina (the character) feels very responsive. I can say without doubt that the developer put effort into making the game run at a very stable manner on day 1.  I may edit this review at a later time as I experience the game more but as of currently. It's a very solid day 1 release without any apparent bugs. It's a shame larger AAA companies fail to produce fully functional games nowadays without requiring subsequent patches.  I got the UPRPRC Edition to support the devs more and to encourage more games like this. Am eagerly waiting for the digital art book too!  If I'm to nitpick on things it lacks, it's support for the d-pad in the controller and the lack of a dialogue text log to view previous conversations. But aside from that, I can't really think of anything else to say to NOT recommend this.  UPDATE: 2016-01-29 10:06pm GMT+8 There was a point in the game awhile ago where I thought I was stuck for good since there's no visible way get out of the place I was at and I had no way to pass through the small passageway so I asked on the forums first before editing my review to reflect on it. Apparently there was a hidden pathway that I seem to have not noticed so take that as you will.",
            "review_score": "1"
        },
        {
            "review_text": "  It's about bunn girl, fairy girl, fan-service, platforming, hammers, magic, and bullet hell bosses...  oh, and super Metroid-like secrets and non-linear gameplay, yet it's still pretty easy to figure out where to go. I've been wanting to get it for a while and my amazing good friend bought it for me today and I'm very happ!  I 100% reccomend this game, I was hooked from the start and it has an atmosphere that just makes you feel happy. Alot may see the price and think it's a bit too much, but for me, it's really not. If I had the money, I'd still buy this game in a heartbeat!  Personal rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "on the surface this may look like a cutesy, innocent, anime game, but deep down it's one of the toughest games i've ever played. you'll get to the first boss thinking it's a piece of cake, but then you start realizing that every single boss has different attack patterns that you'll die to at least a couple times before understanding what's going on. you'll start tearing your hair in frustration while listening to the great music this game offers. you'll curse the bosses because of their 'unavoidable attacks' and relatively op mechanics. however, you'll eventually get it; the moment when you finally kick that anime girl's butt is one of the best feelings out there.   i fully recommend this game to weeaboos and non-weeaboos alike.",
            "review_score": "1"
        },
        {
            "review_text": "I don't even have to finish the game to know that this is a 100% recommendable game.  First off, don't let the cute, anime styling’s turn you away. The game is a solid Metroidvania game as well as a surprisingly well integrated bullet hell. Each boss has multiple bullet patterns to memorize and throw your controller at when you are trying to go for the no damage achievements. Also, the price, whether on sale or not, you get more than enough gameplay. Just look at the play times on the other reviews. As for me, with some minor achievement spamming, I’m not even done with the first chapter.  [EDIT: I wrote this review with only 5 hrs, I have since moved on to the third chapter and am working on achievements and getting 100% items and map before beating the main game and then the post game.]   Next, as with all good non-linear games, there are many ways to get to certain points without the “necessary” items. Hell, there is even an achievement for bypassing an early story point.  For the controls, I’m using a cheap third party 360 controller. The gamepad is customizable and quite responsive (ex. Jumping is pressure sensitive). It’s taking me some time to get the bullet hell down with the controller, but I’ve pretty much got it down.   As it stands right now, I can place this game in my top Metroidvania games. And this is without my love of cute. So don’t ignore it just because of the anime.  NNM",
            "review_score": "1"
        },
        {
            "review_text": "Rabi-Ribi is a truly outstanding Metroidvania and has managed to impress me in all regards, the time and effort put in to the game and all the little details you will notice make this game outstanding. The developers clearly loved making this game and I love playing it.  The Develepers are always updating the game with new content and achievments. All the charaacter designs are cute and it was a joy to play through. I strongly recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and sometimes difficult game. Gotta say I love the soundeffects!   I recommend",
            "review_score": "1"
        },
        {
            "review_text": "Rabi-Ribi is a great game with cute girls, especially the protagonist a beautiful rabbit girl. :3 It has a great art on maps and also the characters as we see the creation of all the DLC Artbook, DLC can also choose the expression on the faces of beautiful girls &lt;3, among other things... The graphics are well done for a game simple 2D boss has magical effects as a Touhou game which makes it a more frantic and very challenging to be quick to avoid the shots and taking any damage not to mention that it is addictive and super beautiful to see, it also contains a large playlist for those who like this style (I love), including DLC Soundtrack initially does not come with all the songs to listen to on the menu will have to play and explore all the maps and then unlock all the songs one by one . I have not finished the whole game yet, but by the time I've played seems to be very long and so far the story its so cool. Super recommend the game with DLC, worth have it in the library. 11/10    Sorry my bad english. :c  ",
            "review_score": "1"
        },
        {
            "review_text": "this game never fix the 144hz problem...",
            "review_score": "1"
        },
        {
            "review_text": "This game is cutesy, fun, progressively gets more difficult but as a slow comfortable pace and that's with palying on normal mode. they have two lower difficulty modes for newer people to the genre but this is great bullet hell game for anyone who doesnt absolutely despise rabits or anime.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun and very well made! I was surprised when I bought it thinking it would be bad, but honestly I REALLY underestimated the game. The soundtrack is also nice and jumpy, keeping you awake in a fight. Highly recommend for those who like anime stiyled bullet hells with a cute story and some comedy mixed. Great character design too. Keep up the good work!",
            "review_score": "1"
        },
        {
            "review_text": "Rabi-Ribi is an adorable metroid-vania game with retro-graphics, an awesome soundtrack, and cute anime ladies. The platforming is challenging, and the bullet-hell boss fights are a blast to play, bringing me back to my old mega-man days on the NES and SNES.  I highly reccomend purchasing this game for the challenge offered. The cute anime ladies are just icing on the cake!",
            "review_score": "1"
        },
        {
            "review_text": "I wish I had a means to spread this game all around and get more people to buy it as it honestly deserves it.  Rabi-ribi is a metroidvania-styled game, that meaning there's a large, expansive and explorable map with powerups, secrets, and etc to find as well as boasting an hp system for you and enemies and giving you tons of means of taking them out.   What I need to mention first is that you should not, I repeat, NOT let the Anime-esqe style steer you away or make you want to buy it. It has nothing to do with what makes the game shine... that being the gameplay. Rabi-Ribi takes elements from beat-em-ups, metroid, and castlevania games, pushing it all inside a neat box. You gain powerups as you progress, allowing you more means of beating up enemies. Honestly, it would just take too long to list everything as much as I'd want to.   This game excels at what it's trying to be gameplay wise and because of that, it's a friggen blast to play.",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite bullet-hell because it's a platformer as well. makes it pretty challenging yet oddly forgiving at points. Amazing soundtrack which i could listen to for hours. overall a fantastic game ",
            "review_score": "1"
        },
        {
            "review_text": "If you want to check out my video review on the game click right here          YouTube™ Video:  Rabi Ribi - Kagami Review -&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "The first time I heard about Rabi-Ribi it was off of a recommendations thread on NeoGaf. Honestly, I thought it looked like a Sakura Spirits knockoff aesthetically mixed with Maple Story. With regard to the aesthetic, I still feel like it looks too much like an anime game for the actual kind of game that it is. However, the underlying game is PHENOMINAL. if you love 2d DIFFICULT brawlers in the vein of wings of vi, castlevania SOTN, momodora 4, then you'll love this game.  Honestly, it's very similar to wings of vi in that the game has very difficult and punishing boss fights that are a mix of getting damage (through both ranged shooting ala megaman x and close combat fighting ala WoV or SOTN) in while avoiding bullet hells. There's a pretty important distinction to be made with regard to the combat though, as in Rabi-Ribi you can only melee if your feet are on the ground (as far as i am in the game anyways). This might, and did to me, seem like a bad thing becuase it limits just how much freedom you have in attacking. However, it's alleviated by the fact that you can get your first 2 attacks in while moving (out of your ♥♥♥♥ combo) allowing you to attack while still dodging, making boss fights pretty hectic but still rewarding.   The game somewhat has a leveling system as well, but from what I can see it's mostly 'buy this item to increase damage by 5x' or 'buy this item to increase stamina be 10%' etc etc, which you'll also find in the world similar to a metroid game with its missle/etank capactity upgrades. There are upgrades for abilities that I just haven't unlocked yet (for example there's an air dash that has upgrade items, not sure what the upgrades do for it, maybe reduced timer or more invincibility frames?). If it's a big selling point you should look up the upgrades to see if they're interesting and meaningful to you.  There's also a rating system in the game that as far as I can tell amounts to 'do a lot of damage without getting hit and we'll give you a higher rating,' similar to devil may cry somewhat. However, where it differs from DMC is the higher your rating, the more bonuses you get. So if you get to D rating, you'll have 5% extra damage, C = 10%, etc, incentivizing you to play perfectly to clear boss phases faster. Also similar to DMC, there are consumables to heal you in battle if that's your thing, but in Rabi-Ribi you have to stand in place for like 3 seconds to consume the item, which given the bullet hell nature of boss fights can be pretty unrealistic.   I think i have sufficiently broken out why this game is a mechanically superior 2d brawler, so let's go on to the rest of the game. There are additional modes that you can play, the most notable one being a boss rush mode that is locked until you beat the game I believe. It's cool that the devs decided to include this because the bosses are definitely the best part of the game.  The pixel art graphics are pretty cool, but in my opinion they don't hold up when compared to superior games like momodora 4. However, they're still clean and cute. Dialogue is.... there.. ha... the music is pretty dope during boss fights though, there are a lot of people that really love some tracks! A lot of the different 'Zones' of the game give me a serious maple story vibe, but oh well..  Honestly, the bosses are what make the game so damn good.. the rest of the game is okay, but the bosses make it 110% worth playing through if you like this kind of game.",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly good",
            "review_score": "1"
        },
        {
            "review_text": "YOU NOMINATED THIS GAME FOR: THE “BEST USE OF A FARM ANIMAL” AWARD  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not sure what to say other then I recommend it to you.   You like metroidvania-style adventures? You like a good challenge with bosses? You got a thing for losing your !@#$ing fingers from a BULLET!?!? Then you will probably enjoy this game! Cute little adventure with an enjoyable cast of characters. Oh and if you can get past the fan service you may get attached to these characters (you don't need to get past the fan service though XD).  Really fun, had a blast, never gave up when the challenge desided to bash my face into the ground saying, 'hahaha !@#$ you, try again!', and hoping for some fun DLC or sequal in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Rabi-Ribi is yet another game that I was hesitant to buy. At first glance, it looks like an anime style fan service fest. While there isn't anything wrong with fan service, it's undeniable that it can be used to sell sub par products. Another factor that made me hold back on purchasing it was the graphics. It's not ugly, but it's far from the prettiest platformer I've ever played. It made me further wonder if it wasn't primarily about fan service. Well, I spent some time researching the game and it seemed to be well received by just about everyone. I gave it a try, and today I can say that I'm happy I didn't miss this game.  First and foremost I'll go ahead and confirm that the game has a fair amount of fan service as well as not so subtle innuendo. Fortunately, Rabi-Ribi is carried by its strong and creative gameplay. If you really dislike anime style fan service you might want to avoid Rabi-Ribi. I think you would be doing yourself a disservice, but I have no doubt that these may be deal breaking traits for some individuals.  The basic story is that Erina wakes up one day and discovers that she has been transformed from a rabbit into a human. Most of the story follows Erina's adventures exploring Rabi-Rabi Island and attempting to figure out what happened. Overall, it's nothing remarkable, but there are some humorous moments. There is a rather large number of characters, but the vast majority of them serve as little more than excuses to have boss fights. This may sound negative, but in all actuality it's where the game really shines.  Boss fights in Rabi-Ribi are unlike any I've ever seen in an action platformer before. It is almost like a mixture of a fighting game combo system mixed with shmup style bullet dodging. As you explore each area you can encounter a wide variety of items that will enhance your combat skills, mobility, and stats. During boss battles you shoot and do melee combos while your foe moves around and fires danmaku style patterns at you. Not unlike ships in many shmups, Erina's hitbox is significantly smaller than her sprite, which makes it easier to dodge complicated patterns. If you have experience playing shmups it will be very familiar to you. During battle you have a combo meter that ranks your performance in battle. If you avoid damage and keep your combo meter high the game will reward you with temporary stat bonuses. Also similar to shmups is that there appears to be some sort of rank system (dynamic difficulty) via the levels of bosses. Admittedly I don't know all the intricacies of it, but one clear way it manifests is through badges.  Badges are one of the many item types you find throughout the island. They bestow beneficial effects including stat bonuses, damage reduction, and occasionally alter the way attacks work. The more badges you equip, the greater the level of bosses. This means you can wear many and face higher level bosses or alternatively use them selectively in order to lower their level while keeping specific bonuses. As interesting as the dynamic difficulty system is, Rabi-Ribi is not without a couple flaws.  The open world and large amount of freedom leads to a very nonlinear game. The player is free to fight bosses in many different orders and even skip nearly every item in the entire game if they so choose. The developers have even added an achievement in for one of the sequence breaks. The lack of a linear path allows for a lot of creative play, but unfortunately there were a few parts of it that were handled somewhat inelegantly. Rather than having an impassible physical barrier, there are a few places in the game you simply can't enter until the appropriate time. The characters will stop and say something along the lines of, “I don't think we should go this way.” In the end it's not a big deal, but I think there could have been a better way to do it. The only other issue of note I encountered was consistent FPS drops in two situations. One of them happened intermittently during the ending credits and the other happened every time I loaded the game, though pausing and unpausing seemed to immediately resolve it. My computer far exceeds the requirements and fortunately I never experienced FPS drops at any other times so it seemed a little strange. I've heard of others having FPS issues as well though so I suggest making sure your system meets the recommended requirements.  Other than that, there isn't anything negative I have to say about the game. In fact, Rabi-Ribi is one of the most entertaining action platformers I've played in quite some time. It has a surprisingly large amount of content and offers enough difficulty options to be provide a challenge for players of many skill levels. As much as I enjoyed this game, I must admit it's probably not for everyone. If you are staunchly against the art style and themes, or if you are frustrated by bullet hell patterns, this game might not be the best choice. I'd highly recommend this game to anyone looking for an action platformer that focuses more on an interesting combat system than precision platforming. Hopefully the developers create a sequel and/or DLC expansion.   Like the review? Follow my curator page to see my thoughts on other games. ",
            "review_score": "1"
        },
        {
            "review_text": "Damn amazing this game is. The characters and their portraits are all great and cute, the music feels like it came from Newgrounds 2000s era (which is a very good thing), the story is pretty lighthearted, the sprites (especially the character ones) are adorable as all hell and the fights, especially against bosses are actually challenging. Yup, the cute characters actually don't make the gameplay deteriorate at all so you're gonna have to git gud as you progress through the story.    I felt a bit uncomfortable at first with Erina's 'bunny outift' though, but it didn't stop me from enjoying the game. She's still cute as heck.  Protect Erina JFC. She is a pure soul and must not be tainted ever.  10/10, this game is soothing, cute AND hard to play with. I love this game. Yes I am extremely biased, but I couldn't care less. I enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "steam doesn't let me refund it edit : i play this game to tell my mom that im not gay",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ing died to a succubus which stunned me and made the screen go black when approached me. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "And people think Dark Souls is hard...  Erina will eat Dark Souls for breakfeast",
            "review_score": "1"
        },
        {
            "review_text": "ご注文はうさぎですか？: The Cosplay: The Game",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with pretty looking attacks.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. What a game. For an action platformer this is without question one of the best in the genre. TL;DR Awesome game. Better than Salt and Sanctuary. Better than La-Mulana. Closest thing to Symphony of the Night on steam. Ok so what makes it so good?  Pros - Crisp and responsive controls. This is the most important aspect the game nails it. Attacking feels like a fighting game. Hammer combo -&gt; drill -&gt; air dash -&gt; hammer roll during which game atuo zooms in for max impact feels awesome. The anime style boss pause before unleashing super attack is great too.  - Every game in this genre basically involves you dodging glowing stuff gets thrown at you. Learn the patterns and the openings. This game is no different, but does away with needlessly fancy animations or gimmicky mechanics and this is a plus. Boss attacks comically make no sense lol and is basically just random laser and balls of death in increasing complex patterns....and its awesome! The difficulty levels is toned so well that anyone, by learning the fight over and over, can eventually win. Learn which attacks can be dodged, and which ones cannot, and take advantage of invicibility frames from super attacks, etc. With enough skill (ie. not gear or stat check) you can defeat bosses that outlevel you, and when this happens it feels so rewarding and satisfying. - there is an rpg element as well, with character customisation by choosing from a pool of various passive abilities that you collect. - Levels are expansive and the full map is huge. Typical of metroidvania games, levels often contain areas that you will need to revisit after acquiring the appropriate skills elsewhere in the game. There are also generous amounts of hidden items/upgrades to find on the maps that greatly encourages exploring. - visuals are clean, the BGMs are fantastic, no pc performance issues, large replayability with various difficulty level and modes.  Cons - Story/writing/dialogues - its cutesy anime stuff that I dont care much for, but that's just a personal preference. Don't expect any deep or engaging plot. Some characters are interesting and on occassions some funny dialogue. it doesn't take itself too seriously ie. there was a npc in a niche corner of a level that told you 'there really is nothing hidden in this room!' Lol that just made me search it even harder... XD - Some dialogue texts are missing in traditional chinese setting. You see placeholder numbers like '7852' instead of text.  Overall this is an incredible game and criminally under advertised. If you are reading this because you are already somewhat interested, no need to hesitate it is definitly worth the purchase.  Edited: nominated for the “I Thought This Game Was Cool Before It Won An Award” Steam Award! :D",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvania with danmaku+spectacle-fighter combat. Great art and music.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It was worth the price. I bought it for Harambe &lt;3 RIP",
            "review_score": "1"
        },
        {
            "review_text": "Now I'm sure I am a weeabo.",
            "review_score": "1"
        },
        {
            "review_text": "A really cute, fun game with a big world to explore and tons of unique powerups to collect. On top of that an amazing soundtrack, lovely pixel graphics and a fun light-hearted storyline to boot. Whether you're in it for the bunny girl, the story, the Metroidvania or the music, you're gonna get your money's worth. The combat, as simply as it may be at first, gets surprisingly deep and strategic once you start facing up against walls of projectiles which, admittedly, might overwhelm less coordinated people. The fusion between bullet hell and platforming is handled alright but it definitely needs to be polished a little more, also in some cases you might get stuck in an area if you explore too far as you might not be able to get out because you'll lack the required powerup. Overall, I definitely recommend it but you gotta be ready to fight some pretty tough fights, that's for sure. It's a Metroidvania game like I've been waiting for for a looooong time now since Konami and Nintendo are refusing to make one. 'It's like Dark Souls in 2D.' would not encapsulate the game quite right as it's so much more than that. 9/10 from me, for sure.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty hard, but reasonable. It's much better than Mighty NO.9",
            "review_score": "1"
        },
        {
            "review_text": "This is like Dark Souls. It f**ks with you but in a moe way. I mean REALLY REALLY moe, Not sure if i died 10 times in roll due to the difficulty of boss fight or the excessive cuteness. Oh I'm at the second easiest difficulty by the way. 10/10 would die again.",
            "review_score": "1"
        },
        {
            "review_text": "Rabi-Ribi is up there as one of the best metroidvanias I've experienced, and has proven based off of other high ratings and mine to be one of the best metroidvanias in 2016, which says something about the others that have been churned out. The gameplay definitely keeps you on your toes, the difficulty levels are wide enough that any skill level can enjoy the game, the soundtrack is subperb. The only thing holding this back from being a complete cult classic in about 10 years is the weeaboo primary demographic and the par-on-average storytelling.   STORY/WRITING",
            "review_score": "1"
        },
        {
            "review_text": "I regret spending money on this game for the story. I should of bought it for all of the bunnygirls.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy Metroid, Castlevania, and cute-as-♥♥♥♥ things. Buy this game. It combines 2 of my favorite video game series' ever, Metroid and Castlevania, while sprinkling in some Kawaii. You have the exploration-backtracking-branching paths of Metroid, and the level up and come back later of Catlevania. I usually don't enjoy replaying games after I've beaten them, but Rabi-Ribi is one out of hundreds that I will go back to again and again. 9/10     Edit : Just found the small reference to Nekopara with Vanilla and Chocola. &lt;3   ",
            "review_score": "1"
        },
        {
            "review_text": "Hella fun. I just wish the enemies didn't have such long invicibility frames, even with the badge. Nevertheless, a real good time sinker.",
            "review_score": "1"
        },
        {
            "review_text": "10 Rabbits/ 10 Rabbits. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "It's very refreshing for bullet hell style games mixing 2D platform and RPG elements. The story is well done and answers all the questsions that pop up so you're not left wondering how something happens, but the soundtrack is absolutely great. I will continue to play just for the sound track easily.  Boss battles are challenging, and take on classic Touhou style fights. The final 3 are superpurb clinchers that bring the hell in bullet hell for rabi-ribi. Danmaku patterns are beautiful, and are unique to each of characters you recruit to rabi town while you're left with the ever classic spread, beam, and burst patterns courtesy of ribbon.  Playing as a rabbit girl that beats everything with a hammer and making friends after hitting them with a hammer is the most fun I've had in a long time. As someone that loves bellet hell games, I defintely recomend this to those that like bullet hell games with something different to offer.  My only problems are that there may be segments of lag, but none were rather severe and usually only occured when I wanted to pull up the map. It was very uncommon for lag to be present during any world exploration, but even then it's nothing that would take me away from the game. Other than that, game play is very smooth and controls handle very well.",
            "review_score": "1"
        },
        {
            "review_text": "Rabi-Ribi is easily my GOTY for 2016.   While the story is kind of cheesy, the gameplay and soundtrack of the game are the better parts.  You get the fun of exploring in a metroidvania style as well as upgrades styled the same. While boss fights are pretty much bullet hell type bosses they are all beatable with practice constent tries. Easily the most enjoyable part is keeping up the combo meter to max which means attacking the boss while also dodging bullets and not getting hit.  The best part really is how open the game is. The game is designed to the point where you can beat the game the default way with collecting power ups as you explore and 0% where you can go the whole game with no items collected.  The boss battles are amazing in this game while the patterns for some of the bullets are the same at times they'll change and even the order in which they are used are different also the higher the boss' level is the more different attacks they'll use. Some of the bosses are well designed in terms of gimmicks and abilites they may have, the first early post game boss will easily show you what I mean.  The Soundtrack for this game is surprisingly amazing, a lot of the locations have nice music and the boss musics are very very well done. (I really love 2nd and 3rd Final boss themes)  What really pulled me in is how well the sprites were done and how detailed some were.  Easily worth the full price, took me around 50 hours just to 100% the whole game on hard for my first run. If you have the money I'd recommend the UPRPRC Edition the soundtrack being so good and the artbook actually has some playable beta content.  (Side Note: I really wish there was a vita port of this seems like it would fit so well on it.) (PS: I have a thing for bunny girl costumes now)  Edit:Holy ♥♥♥♥, they did it, PS4/Vita ports of this game along with new soundtrack extra content confirmed from E32016.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute and fun game with solid gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Bunny is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Let's see now:  Non linear metroidvania, cute bunny girls, lot's of yuri subtext, bullet hell...  What else is there needed??",
            "review_score": "1"
        },
        {
            "review_text": "Started the game, and thought it was pretty easy.  Now in the final chapter, and the challenge is absolutely badass.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I've played in years. If you're on the fence, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "If you aren't familiar or skilled with platforming, bullet hell, or metroidvania mechanics, then it doesn't really matter, because the difficulty settings / scaling are really well-tuned and let you get used to things before it throws difficulty at you. And if you ARE familiar with some (or all, like me) of those, then higher difficulty levels + some of the extra challenges mean it has a lot of replayability. My first run was 100% items, and my second was 0% (this game *is* actually beatable without even a single item pickup!) and I still want to give it another go.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and still difficult  Wish it had some Voiceacting tho tbqh",
            "review_score": "1"
        },
        {
            "review_text": "Fun little metroidvania with some bullet hell elements ... a good mix !   Controls are responsive and the overall atmosphere of the game is just very relaxing!",
            "review_score": "1"
        },
        {
            "review_text": "when developers mix cute anime girls and bullet hell/platforming, you know it's going to be a difficult game!  great BGM and some pretty pleasing visuals, definitely worth picking up",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game on Steam so far, I love the cuteness factor mixed with a serious-type of story. Really Fun!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Metroidvania (2D platforming + exploration) games I've played. The mashup between that type of gameplay and bullet hell mechanics is amazing, at least when it has this much polish to it. Four chapters in and a lot of hours spent exploring, I still don't have anything major to complain about with Rabi-Ribi. It's consistently challenging, but never feels unfair. Exploring the rather large world, finding new items, secrets and enemies everywhere, keeps being entertaining.  It's perfect for people who like challenging 2D platformers in general. And if you're not already familiar with bullet hell shooter mechanics, chances are that you'll come to like that too from playing Rabi-Ribi.  Pro tip: If you really want to challenge yourself right from the get go and possibly feel more satisfaction from beating each boss, start on the Hard difficulty level.",
            "review_score": "1"
        },
        {
            "review_text": "What a great game this is! Sexy rabbits! Sexy fairies! Sexy girls trying to kill you! Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't beaten the game yet, but I figure for a relatively new and small game like this one giving it a positive review may help. I'm having fun with it, it's a nice metroidvania type game and all the bosses have attacks inspired by bullet hell games. I've been playing on hard mode and almost every boss so far has killed me at least once. There's still two harder modes beyond Hard I believe. Traveling to places you've been to before is easy because of the warp stones, combat is... average I'd say. You have a hammer and magic from the fairy, not a whole lot of variety but I don't have a problem with that. The story isn't anything super interesting, but it's not bad either. Just a tad weird. I'd suggest watching a video on the game to see what you think of it, that's probably more useful than reading text reviews.",
            "review_score": "1"
        },
        {
            "review_text": "As a Metroidvania fan, I do like this. While it does follow the sadly common trope of anime-styled games having mostly females in revealing or skimpy outfits, it doesn't try too hard to show that off. The most you get out of it is character renders and the cutscene stills. Everything else is colorful, innocent fun. Haven't beaten the game yet myself, but the game is pretty plentiful in content if you like long Metroidvanias or general action platformers. It sports plenty of collectibles, great abilities that help in exploration, and challnging boss fights that always change up their attack patterns, which makes them more challenging to beat since you can't predict what they do next.I recommend to any Metroidvania fans.  Also, I don't usually recommend DLC, but if you end up enjoying this game, I also would like to recommend the artbook. Yes, it has beta and concept artwork, as well as editable character stills, which is all okay, but it also features beta/unreleased game content. Playable characters, unused/scrapped bosses, as well as two new modes of play for the base game: impossible and unknown. Impossible is pretty much what it is on the cover, with enemies doing heaps more damage than usual. I'm not sure how it effects stat growth, as I only played about 3 minutes to see what it was all about, but I imagine that you don't get much in that regard. Unknown I haven't played yet, but I'll update the review when I get to it. Either way, the content you get with the artbook is well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Don't judge it by looks; this is great bullethell metroidvania game. must try.",
            "review_score": "1"
        },
        {
            "review_text": "I cry when I play this game.",
            "review_score": "1"
        },
        {
            "review_text": "It feels like a well polished game but somehow still gets really tedious somewhere halfway.  Still, it's pretty good. Bonus points for using an Alraune in it.",
            "review_score": "1"
        },
        {
            "review_text": "I am generally not a huge fan of metroidvanias but this one has really hooked me. The gameplay is varied with tight controls and mixing bullet hell in is a genius move. The only real gripe i can have is that the character models ingame are absolutely huge compared to their hitbox so sometimes judging the dodges can be a bit of a struggle but as soon as you learn where it is your solid.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game thinking it would be a short game to mess around with. Well 7 hours in and i have a long way to go. The game is filled with dialogue but its not that bad and i actually enjoy the story. What i didnt expect is the difficulty. Man this game is rough, though fun at the same time. gets a 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Like titles like Megaman, Metroid or Castlevania? A game with moderate and increasing difficulty AND fantastic sound track which pairs nicely with the setting and background of the game, Rabi-Ribi is a non-linear bullet hell game. Even after you clear the game, there are many achievments that enables the player to explore the game, and even challange the player for example, a 'no item run'. This is a game that even after clearing, there's a re-play value with unlocking difficulty, or increase difficulty with each clear. Even for new players to bullet hell, I would recommend starting on 'hard' as you get a real sense of what the game really feels like, and you even have the option in game to lower the difficulty if it's too much for you!  Overall, the freedom of the game melded with the fantastic elements such as music and character develpoment, I would totally reccomend this game to anyone who loves platformers. (Double that for people who play [東方]) :DD",
            "review_score": "1"
        },
        {
            "review_text": "It's a cross between metroid and a bullet hell shooter, with a super anime aesthetic. If you can deal with bunny girls and enjoy those genres you should buy and play this game. I'm playing on one difficulty above normal, which is challenging but doable, and the boss fights are some of the best I've played.",
            "review_score": "1"
        },
        {
            "review_text": "#Edit at 2016/07/30  After complete this game 100% in normal difficulty (level 3/6, 3/7 include DLC)  I think everyone should know.   THIS GAME IS BRUTAL.   The FIRST HALF is great, but the SECOND HALF gets punishing as the game progress.  In the end it is satistifying, but also really annoying.  Still, I recommand everyone buy this game. Just be prepared some rage quit momments.  And if your blood lust for hard, even punishing game. Rabi-ribi is definitely your choose.    #original comment: (2016/07/08)  Well, what a game for its price, Cute style(both pixelart and cg), good music. Great control (might be a little weird at the beginning) Decent gameplay - metroidvania with bullethell boss fights.  And...bunny girl!  (((((BUY THIS NOW))))))  Just joking, the price is higher than most indie games. But I think Rabi-Ribi deserves it. At least I play it for 2 straight hours without feeling any bit boring. It's cute, fun, and satisfied :D  Just to be sure. If you don't like anime style, or bullethell fights, or metroidvania gameplay. Or maybe feeling guilty playing as a innocent girl. - which basically Rabi-Ribi is. You can try less than 2 hours and ask for refund. Just don't put your hatred on me if you actidently spend too much time on it.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with a plot that is very intresting.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game because of the anime waifus. But it actually turned out to be a really top game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is too addicting.  Fights Boss Dies 2 hours later.... Dies again  Bunny Girls/10",
            "review_score": "1"
        },
        {
            "review_text": "This game should win. Because I love bunnies :3",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best indie release of 2016. A great mix of taking the metroidvania platform and adding bullet hell mechanics. Do yourself a favor and play this game sooner than later.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the 'bullet hell' tag scare you off, this game is nowhere near as difficult as a CAVE game, even on its harder difficulties. However, this game does require memorization of patterns so if you don't like that sort of thing this game is probably not the game for you.  In my experiance the game sort of cycles between gathering tons of items and fighting bosses. The item collection feels sort-of like an old collectathon game in that there are quite a few items in the game to collect, most of which are hidden or have some small challenge you have to beat to get them. The bosses are the centerpieces of the game that break up item collection, they attack with bullet hell -esqe patterns that are generally very pretty. Your combat abilities seem to fall into three categories:  1) CQC with the hammer, which almost always resolves into doing the same few combos   2) ranged fighting with Ribbon which gives you a number of unique shot types to work with and is usually more fun than CQC  3) bomb-type attacks in the form of the amulet and super carrot (amulet being a defensive bomb with high invincibility but low damage, super carrot being an offensive bomb with short invincibility but high damage)  Overall I think the gameplay is quite fun.  There are also extra modes like speedrun mode and boss rush (and extra boss rushes with NPC characters in the DLC) which are exactly what you would expect. Also about a billion achievements ranging from boss rush to speedrun to low item% run to sequence breaking.  The game has been known to lag and crash for seemingly no reason sometimes on some computers, so that is something you should probably take into account if you are playing on a toaster.",
            "review_score": "1"
        },
        {
            "review_text": "Want a game full of cute girls on an island made of bullet hell? Some high paces combat, with high paced music to go with it? Then look no further, Rabi-Ribi has it.  From fairly simple attack patterns like something out of MegaMan, to complex, screen-filling blitzs you would find in Touhou, and a whole handful of difficulty levels ranging frim 'easy' to Bunny Extenction mode, you are sure to bash your head against a wall by the tim eyou are done, no matter what difficulty you play on.  A metroidvania world, bullet hell bossfights, a story about a confused bunny and her fairy companion, trying to make a home in the strange situation they find themselves in.  200/10 would swing bunny hammer forever.  ***MY ONE ISSUE IS I HAVE TO SET MY SCREEN REFRESH RATE AT 60Hz INSTEAD OF 144Hz IF I DONT WANNA PLAY AT 144 FPS (over double the intended game speed)***",
            "review_score": "1"
        },
        {
            "review_text": "You know why you're here: for that quality metroidvania shootemup bunny and cat girl action. Weebs and normies alike will love it. Your parents will acknowledge your passion for games and will never bother you again if you introduce them to Rabi-Ribi.",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly just too amazing to describe.  The game is hard, yet fair. If you got into a bad place, it was your own fault .-. The game is CUTE AS HELL OMGGGGGGGGGGGGGGGGGGGGGG. The sprite-art is pretty enough but wait till you see the cutscenes.  The gameplay itself is a lot of fun, those who have played Touhou will have a blast. My ownly negative on this game is that the achievements are VERY hard to get. Rip With all that in mind, why shouldn't this game get the 'Cute as hell' award? :D",
            "review_score": "1"
        },
        {
            "review_text": "Its a metroidvania style bullet hell. Collect power ups and upgrades to be able to access the new areas. Its also really hard. Easy mode is probably still going to wreck your face if you haven't played bullet hell games before.   Game is extremely well designed and mechanically fluid. Something that I like a lot is that the maps were built in a way for someone to zero item clear the game if he/she understood the game mechanics well enough.   Story's nonsensical though, but anyone who's played enough touhou is probably used to that by now.",
            "review_score": "1"
        },
        {
            "review_text": "Searched for metroidvania and found this one. It has a map system and action just like other metroidvania games, but the enemies are totally designed for bullethell, especially the bosses.  In short, it's not a bad game. However, if you want a traditional metroidvania, don't play this.",
            "review_score": "-1"
        },
        {
            "review_text": "Hot chinese garbage  The epitome of shoving every genre you can think of in a single game to make it appealing but in the end you have this stiff movement, poorly implemented systems, unlikeable characters, unsatisfactory difficulty, frustrating combo system, bad camera work, unappealing plot, dragged on fights and I could go on.  Art is okay, OST is fine but doesn't have much variety.  DO NOT fall for this meme even if your weeb self think no anime game can do wrong.",
            "review_score": "-1"
        }
    ]
}