{
    "app_id": 401290,
    "name": "Nusakana",
    "release_date": "2015-11-19",
    "developer": [
        "Studio Namaapa"
    ],
    "publisher": [
        "Studio Namaapa"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Indie"
    ],
    "achievements": 167,
    "positive_ratings": 45,
    "negative_ratings": 4,
    "price": 5.99,
    "description": "Nusakana is an open-world JRPG where you date fish girls while trying to solve the island mysteries. Play as a tourist having a full-year vacation on the island, on a mysterious invitation. Will it be a fun holiday or will it be a thrilling adventure? What about the romance? You decide!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/401290/header.jpg?t=1512658918",
    "minimum_requirements": "最低配置: 操作系统: Windows XP/Vista/7/8/10 处理器: Intel Core2 Duo 2.0 Ghz 内存: 1 GB RAM 图形: Intel HD Graphics DirectX 版本: 9.0 存储空间: 需要 650 MB 可用空间",
    "recommended_requirements": "推荐配置: 内存: 8 GB RAM DirectX 版本: 9.0 存储空间: 需要 650 MB 可用空间",
    "reviews": [
        {
            "review_text": "Here are my review points:  -Nusakana have legit nuance, from the originality, the artwork, and the Bossanovas (this is the strongest point why I bought it), and of course Indonesia Vibe inside of it, really love the local content.  -The Developer seems to really care about Nusakan bugs and problems, and they fixed it up after several hours of my report post about getting error with the last version, two thumbs up for your hard work, I as the user feel very glad for it.   -The artwork I think, I will really enjoy it if the characters especially the girls looked different (especially their eyes and nose,  I think almost all of them looked same for me, I know the visual style  using JRPG style, but would love to have new experience in Nusakana  with very different looks, the elders and older women looked very young). But that just my opinion, everyone have their own taste.   Greeting from Nusakana.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of Harvest Moon. 5/7 would play it again and again.",
            "review_score": "1"
        }
    ]
}