{
    "app_id": 401330,
    "name": "Akuatica",
    "release_date": "2015-11-27",
    "developer": [
        "Tianyu Studio"
    ],
    "publisher": [
        "Tianyu Studio"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 11,
    "positive_ratings": 39,
    "negative_ratings": 20,
    "price": 4.99,
    "description": "Akuatica integrated puzzles into action adventure. Below are some highlighted features;Fast paced action encounters that require problem solving. With obvious clues.Multiple environments. From shallow river, coral reefs, open sea to the abyssal depth.Epic bosses and dozens of unique enemies.Meticulously sculpted visual style.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/401330/header.jpg?t=1535438238",
    "minimum_requirements": "OS: Windows Vista, 7, 8 ,10 Processor: 2 GHz Memory: 1 GB RAM Graphics: Generic or integrated graphics cards. DirectX: Version 8.0 Network: Broadband Internet connection Storage: 400 MB available space Sound Card: Generic or integrated sound cards.",
    "recommended_requirements": "OS: Windows Vista, 7, 8 ,10 Processor: 2 GHz Memory: 2 GB RAM Graphics: Entry-level or mainstream graphics cards. DirectX: Version 9.0 Network: Broadband Internet connection Storage: 400 MB available space Sound Card: Entry-level or integrated sound cards.",
    "reviews": [
        {
            "review_text": "It can be difficult to figure out exactly what it is you need to do at any given time, but that's a lot of the appeal right there: this one doesn't hold your hand as much as similar examples of the genre. The art style is very unique, and the music creates the desired ambience. I personally love it. As long as you can handle some frustration, at the level of a moderately hard platformer game, you'll have a very good time.",
            "review_score": "1"
        },
        {
            "review_text": "I'm enjoying it alot. Love the artwork and music. Nice how they don't hold your hand and show you how to do things . Now to make me up a template so i can use my Steam Controller :)",
            "review_score": "1"
        },
        {
            "review_text": "How do you get past the Fishing Boat, blowing up ther bubbles just ends up with the man rerpairing the boat fast then you can damage it.",
            "review_score": "-1"
        }
    ]
}