{
    "app_id": 402030,
    "name": "Zenohell",
    "release_date": "2015-10-14",
    "developer": [
        "Team Grybanser Fox"
    ],
    "publisher": [
        "Team Grybanser Fox"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Shoot 'Em Up",
        "Bullet Hell"
    ],
    "achievements": 23,
    "positive_ratings": 43,
    "negative_ratings": 20,
    "price": 6.99,
    "description": "Zenohell is a 90s inspired shoot-em'up (shmup) that is all about simple gameplay, just dodge, shoot, score, with vibrant pixel visuals and a kicking 28 track soundtrack, with lots of content to boot.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/402030/header.jpg?t=1478028073",
    "minimum_requirements": "Минимальные: ОС: Microsoft® Vista / 7 / 8 / 10 Процессор: 1Ghz Processor Оперативная память: 256 MB ОЗУ Видеокарта: Pixel and Vertex Shader 2.0 DirectX: Версии 9.0 Место на диске: 500 MB Дополнительно: May not run correctly with Intel HD integrated graphics units. Other than that, it should run fine on a PC made in past 5 years.",
    "recommended_requirements": "Рекомендованные: ОС: Microsoft® Vista / 7 / 8 / 10 Процессор: 2Ghz Processor Оперативная память: 512 MB ОЗУ Видеокарта: Pixel and Vertex Shader 3.0 DirectX: Версии 9.0 Место на диске: 500 MB Дополнительно: May not run correctly with Intel HD integrated graphics units. Other than that, it should run fine on a PC made in past 5 years.",
    "reviews": [
        {
            "review_text": "This game really scratches that shmup itch! It's very easy to pick up and play, and you can get going within seconds, Aside from all the usual options desired by shmuppers (rotatable screen being the main one), you can also change the music pack used by the game. I haven't tried out the option just yet, but I imagine I could use Cave's music, for example.  I'm not one for longer reviews, but I also want to praise the music and the art, since it becomes immediately clear that a lot of love was put into both these aspects. It feels a bit like I'm playing an Amiga game, and this is high praise in my book.",
            "review_score": "1"
        },
        {
            "review_text": "Moves much too fast for how visually noisy it is. I had much difficulty even seeing the bullet that killed me, over and over and over.",
            "review_score": "-1"
        }
    ]
}