{
    "app_id": 402570,
    "name": "Atlas Reactor",
    "release_date": "2016-10-04",
    "developer": [
        "Trion Worlds"
    ],
    "publisher": [
        "Trion Worlds"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Free to Play",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Multiplayer",
        "Strategy"
    ],
    "achievements": 121,
    "positive_ratings": 3992,
    "negative_ratings": 890,
    "price": 0.0,
    "description": "SEASON 6 NOW LIVE! The battle for Atlas continues as a hot (some might even say fiery) new freelancer enters the scene.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/402570/header.jpg?t=1527021846",
    "minimum_requirements": "OS: Windows Vista™ Enterprise (6.0, Build 6002) Service Pack 2 (6002.vistasp2_gdr.150312-1556) or later Processor: Quad Core. Intel(R) Core(TM) i5-2520M CPU ~2.5GHz / AMD Phenom II X4 @ 2.6GHz equivalent or higher Memory: 4 GB RAM Graphics: Display Memory: 1696 MB   - Min. Shader Level: 3.0   - Supports Render Textures DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space Additional Notes: Glyph Client and registered Trion Worlds Account",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is such a refreshing and addicting game.   The turn-based combat in this game is unique and it requires teamwork and smart thinking.  - The Characters are unique and have their own skills, playstyles and are balanced.  - The free to play model is fair and good: You can play VS. Bots And PVP, Ranked and custom games are locked for the full version, but you can still have plenty of fun with the free version ( I personally still play the free version, and love it.)  Now one of the main issues people has, is that you can't purchase skins, if you don't have the full game. And i do somewhat agree with that, it feels restricting. But what they fail to realize is that if you just play the game and level up a certain character, you gain ''loot crates'' for that character. And in those loot crates you can get skins, even in the free version. I have personally already optained a couple, so it is possible.",
            "review_score": "1"
        },
        {
            "review_text": "Please ignore the bad reviews that specif complain about paying for the heroes. This is a PAID GAME, the Free to play mode is more like a demo with limited herores which you can play online with only five. (Pretty much like LoL, Paladins, etc)  It is not fair to bash bad a product because you have to pay for it, it is insane.   You pay 26 dollar, 56 reais, and you get al heroes, are able to do ranked matches and open as many loot boxes as u want.  Very smart and strategic game, very like XCOM.  They already update with a new hero very quick, they have a couple of skins for each hero and only a few maps.  The game has a great potential and the heroes are unique, has some moba feel to it too. Just try it the free version, if you like it, buy it.  It is a great game and well supported.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! It is essentially like XCOM, just online and with/against other players. Round-based combat with different phases, characters and abilities. I am always skeptical when I hear the word 'Trion' but this time they have outdone themselves.  People are annoyed at the free model, and it could certainly be better - you get a few freelancers in a rotation and have a timer on lootboxes   *EDIT: This restriction is now gone. They really listen to feedback!*.   But otherwise, even the free version is awesome, though I highly recommend buying the game - it is well worth the price. The free version is great for trying it out though.   It is a highly unique concept and just works insanely well, what with there being support characters that heal and shield others, Frontlines and damage dealers, and every character being distinctively different. Great fun! Graphics are fitting and the characters are charming. Definitely recommended!  Edit: What I find sad is that I find many people here on a crusade against the developer, downvoting every positive review. While it is true that the dev has ♥♥♥♥ed up games in the past before, I would still like you to give this game a chance - it may very well be a fresh start for Trion and even though I have been burned on their games before in the past, I have a feeling this one will be different, just judging from playing it myself. Look at the game, not the developer - just have fun, because that is what video games are for. Plus, the free demo mode shows you all you need to know about the game. If you won't like it, then there is no investment lost.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really great game, lots of fun and suprisingly fast paced despite being turn based. I really love it, people are downvoting because they feel cheated because it's not free. Whether that's a legitimate concern I don't know, I bought it and I really enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "So far, I really like this game, even with just the free rotation characters. I don't usually like turn based combat, but it's a different case when it requires quick thinking. Atlas Reactor, to me, is basically a combination of strategy, quick thinking skills, and game knowledge. It combines turn based combat, combat roles, strategy and competitive play. With more maps, characters, playerbase, community, and content in general, this game could easily be just as popular as other MOBAs. As for the graphics, Atlas Reactor is simple (but nicely stylised), straightforward and mostly effective. The only bones I have to pick are the vagueness of the tutorial (really need an advanced one with introduction to roles, explaining little things like time banks, stealth blocks, advanced pings etc), some tooltips, and there are still some graphical glitches (clipping taunts and crazy ragdolls which make me XD). It's f2p, so I highly recommend at least giving it a go.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game since alpha and I can say it has only improved. It's a fast-paced strategy game, with rounds lasting ~20 minutes. FAIR WARNING: This game is not entirely free to play. The free version is more of a trial and to fully play all of the characters you will need to buy a pack. In my opinion it is absolutely worth it, but feel free to give it a try first.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantistic in both the free and paid formats, no pay to win elements, simply a reduced selection of characters (6) which rotate every Tuesday.  A Recruit a fried code will grant you 7 days of free, full access, check the AR reddit page to grab one.",
            "review_score": "1"
        },
        {
            "review_text": "The Game Is Fun But U Need Use alot of iq so goodluck im alr having brain cancer for play this game but i still like it LoL",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet because nobody pays me for my time:  Fun, easy to learn but enough depth to engage you. Terrible Tutorial, luckily game is easy enough to understand and the tutorial is short. Free version is better than buy-only model but leaves a lot to be desired.  Gameplay makes up for business model flaws, queue times under 30 seconds are nice. Hopefully they pump out quality content as time goes on and consider altering their model and I'll be quite happy with it.",
            "review_score": "1"
        },
        {
            "review_text": "pretty damn fun and satisfying while not taking too long per turn would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Turbo Chess Team Brawler, awesome character designs and snappy soundtrack. Actually excellent quality all-round.  Don't whine about the free to play, treat it as a demo.. the full game is worth it!",
            "review_score": "1"
        },
        {
            "review_text": "This is going to be an honest review of this game.  If anything, going into this game I was already predjudiced after the devolopers of Trion's other game, Trove, screwed it up for the most part. I did not even expect this to be a game I liked, as this game is very similar to XCOM, only multiplayer. I had never played XCOM.   So here's the pro's of this game: +Unskippable but informative tutorial +Decent graphics reminiscent of Boderlands +Memorable characters with unique abilities +Everything happens in the game can be understood, there are no secrets to abilities +An original story with some decent lore that connects all the characters +Balanced and well designed maps  ~  And the cons: -Turns are conducted in a short amount of time, and while this adapted to with time, it is hard to start with -Turns in blast phase seem to happen in random order, which can be confusing -Free version only gives a rotation of 5 characters (see 'Message to negative reviews' for more on this) -Some characters are just not as useful as others -Can be hard to learn all of the abilites of every character  So now thta you have the pros and cons; My thoughts on the game:  It's fun. It is a satisfying game to play, even though it is of a genre that I'm noth that interested in. The game is very well optimized, with only a few crashes here and there. Honestyly this game has a lot of depth and would recommend it to anyone mainly interested in tactics based games.  Message to negative reviews:  I see most negative reviews talk about how they don't get the full game for free. Mainly, most people are mad that they can't buy the characters instead of the full game. This is probably due to people being used to LOL so thats what they've come to expect. I don't blame them, but its not reason to give the entire game a negative review. I mean, people should specialize in many characters anyway. To the people who wanted the entire game to be free, I don't get why you got that impression, as it says nowhere on the game's website, and the free beta was an 'open beta', meaning open to anyone. It's stupid to negatively review a game when it was never said that the full game would be free. If anything, everyone should be happy that they get some access for free.",
            "review_score": "1"
        },
        {
            "review_text": "not my tyoe of game but its alright tho if you like games like this then you will probably enjoy",
            "review_score": "1"
        },
        {
            "review_text": "a pretty good game, pluss you can play it for free so why not try it .",
            "review_score": "1"
        },
        {
            "review_text": "I played this game up to level 50 during the beta! The wipe has me dismayed as I have to start from square one again. =/  This game is loads of fun. The simultaneous turns make for loads of chaos in the beginning; but blossoms into hardcore bluffing after a few hours. (Hold down the alt key! You'll thank me later.)",
            "review_score": "1"
        },
        {
            "review_text": "This game delivers exactly what it promises. Fun, fast paced, tactical, turn based combat. Highly polished menu's and system make the game easy to learn and worth the time to master. Also great to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say this is the most unique pvp game I've played in a while. The 'free' mode is fair. Most users complaining about it are used to a LoL style of unlocking things. Go ahead and give it a try. There is nothing else out there like it! A blast to coordinate with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Character design is brilliant, game seems very balanced and i'm enjoying it more and more each time i play it!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and I can't say I've played a game like it. It's an odd mix of XCOM and Overwatch. I think it would be better if instead of premade charcters you made and upgraded your own but it's still cool. If you like XCOM and Overwatch but want to mix them, this is it",
            "review_score": "1"
        },
        {
            "review_text": "I'm not much of a gamer compared to most people who would consider themselves gamers. When I play, I play mostly MMOs and light games that don't require a whole lot of time investment. Strategy games? They take a long time, and when you lose, you lose everything you built up for the last x hours. Turn-based sounds slow and boring. Battle arenas seem to be full of 12yo's expanding their vocabularies. And then, somehow, Atlas Reactor happened and got me hooked.  There are a bunch of reviews that describe how the game works, so I'll just share my impressions of the game. The gameplay feels very polished, the characters have a lot of personality, and each match is different from the last, which is probably my favorite part. It's also cool that each match takes only about 20 minutes - if I don't have much time due to work and life in general, I can still get a game or two in and have a ton of fun. I'm actually glad that I usually can't play for hours at a time, because it really is addicting. :P",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Great game. Pay the 30$ for the full access. It's not really a 'Free to Play' game, it's more of a demo.",
            "review_score": "1"
        },
        {
            "review_text": "Really a great game. Has to be be played to be appreciated .",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is very fun, with the depth of a hero based game like League or Overwatch but with the more deliberate, turn-based tactics of XCOM on a timer to keep it intense.  The free-to-play model is weird, but not enough to kill the fun of the action. As others have said, it is best described as a generous demo, so treat it like that; if you're the fence, try it out, play a few bot matches on easy, and you'll see for yourself if it's worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "oh man its finally out! Im hyped!! ",
            "review_score": "1"
        },
        {
            "review_text": "I didn't think I would like this style of game but I gave it a shot. Once you 'get' the game, it becomes INCREDIBLY fun. When I can, I will definitely be getting the paid version, but the free mode is a great way to get a feel for everything.  Definitely recommend! Surprisingly it has a good playerbase with decent numbers. I'm never waiting more than 4 minutes for a game (a blessing for me in OCE)",
            "review_score": "1"
        },
        {
            "review_text": "im not a very good writer, but all i can say about this game is that it is amazing so far. take my word for it, you wont regret at least giving this game a try, i mean its free",
            "review_score": "1"
        },
        {
            "review_text": "The game is really nice but it should be a possibility to buy the characters without having to pay a bundle!",
            "review_score": "1"
        },
        {
            "review_text": "awesome turn-based game! But you have to spend 30$ to get the full game. But it still awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. It is free to play. Not the free-to-play you're thinking though. I played about 25 hours free, then decided Trion earned my money. If it looks interesting, try it out for free. Then decide for yourself if you want access to all the Freelancers or not. You could take a week learning 6 freelancers, then learn 6 more next week. The game is tactically deep and knowing all the Freelancers moves helps planning your turn out. I was fully prepared to stay 'free to play' but think enough of this game to pay $30 for it. It's sad that Free-to-Play hurts a game. I think in this case, the developer just wanted to give people an option to try it out without putting any money down, and they are getting blasted for it. This game might review better if they hadn't done the free model, but I probably wouldn't have given it a shot. Download this and play it. Do what you want with your $30 afterward.",
            "review_score": "1"
        },
        {
            "review_text": "This game is excellent. It has stregic depth, great characters and good pacing. It really is an excellent mix of DOTA and XCOM. Buy the full 30$ version and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "So far I've been playing this game nonstop when someone gaved me the 7 day trial. I gotta say I didn't expect the enjoyment this game offered. It needs a few more stages but there's always something good on each fight. There's also no pay to win aspects on a game like this which is a real good winner, There is also no such thing as a hard counter, it's all about thinking and outwitting your opponent like chess.  If you like xcom and strategy this is you game.  Now if only I can save enough money to actually buy this game....",
            "review_score": "1"
        },
        {
            "review_text": "I like it. It's another breath of fresh air in terms of turn-based strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "It's a thinking game. It's team base ( 4x4) as free lancers (guns for hire ) where you try to take out the other team using team tactics in a grid base, turn base tactics game. Choose between frontline, support or firepower freelancers to help your team. Each freelancer and their respective type has diffrent skills, abilities and playing styles to help bring about the edge to win. Work together with your team to either capture and turn in a breifcase in extraction with 10 points/kills or first to 5 kills in a straight fight. Each freelancer is full of character and theme base that really makes it fun. Taunts are cut scenes that you can earn for each freelancer along with skins and banners for your profile by playing and leveling them up. Taunts are used in game to well, taunt or for a good laugh during a game. I rather enjoyed them. Leveling up the freelancer and your profile to earn banner backgrounds, pictures and emoticons for some custimizable fun. Colors and graphics and all that to represent you on your profile. Facing pvp or AI is up to you and completing missions and daily's is a good way to get modular points and iso's to unlock more freelancers/profile banner goods. Mods are fun little perks you can equip your free lancers with to help damage or gain sheilds depending on how you want to play. They help out or piggyback specific moves your freelancer does. Catalysts help too. These are used to perform specific actions during a fight. Games are back and forth turns with 3 steps per team turn. PREP, in witch sheilds or healing or throwing of traps around happens along with dashing in witch freelancers do a quick dash if they choose to, BURST, the freelancers fire guns or swing swords and whatever at each other, MOVE, then freelancers run or move or fly whatever where they wanted to if able or can ...Find the right combination of mods and catalysts on your freelancer to really help out your team. Dailies are fun challanges, but it really comes with the season missions. A story line of this crazy game of corperations and espionage, world dominations and freelancers trying to earn money is available. Read the story and complete the season missions for really good rewards. Complete more missions to advance the story line. A good read that seems to really build upon the aggresive negotiation of bussiness and science in the future. The music is super catchy and admittingly I bob my head to the theme/ main page song while waiting for games. Give it a try, honestly with such fun characters and a game that really brings this genre together with flashy modern themes and music. Learn the game with a quick prologue missions tuturial and play bots. LEARN the game before jumping into the deep. Alot of good guesswork and thinking stratagy wise is actually needed here! Limited maps and freelancers is the only bummer so far, they just need to grow and expand and people will start noticing...",
            "review_score": "1"
        },
        {
            "review_text": "If you ever enjoyed Tactics Ogre or Final Fantasy, this game is right up your alley. In short it is a revival of the turn based tactical genre and a great addition for anyone who enjoys competitve mutiplayer games. I highly recommend the game for all stragety lovers. Most of the negative reviews seem be to related to the fact you have to buy the game (rather than free to play) moreso than the content of the game. You can however download and try a basic version of the game for free-- I did and shortly ended up purchasing.",
            "review_score": "1"
        },
        {
            "review_text": "Great game at its core. A very interesting take on strategy games similar to Xcom, which im not usually fond of. However this game is one of the few games with the turn based elements that I genuinely enjoy. Multiplayer is great and so far queue times have been under a minute just about every time. However there is one thing about the game that does hurt it in my book, that being its pay to play influence. Although listed under the f2p category, to get the full experience you need to shell out at least 30 dollars or more. There is no currency that you can earn through play meaning there is no system of purchasing individual characters to unlock permanently like in other MOBAS. Which means you have to use the free rotation every time to play as characters if you dont want to pay. And honestly I wouldnt mind paying if it were more f2p friendly because, as previously stated, this game is generally a good time. Definetly try it but if they don't make it more f2p friendly I may have to sadly let this game go.",
            "review_score": "1"
        },
        {
            "review_text": "So, to begin with I am going to say that if you hate Trion and would not TRY the game because of that, you should probably throw that out of the window.  Atlas reactor is a 4v4 simultaneous turn based battle arena. Players each get to control a single character and are required to work with their team to have 5 takedowns (kills) or have the most takedowns by 20 turns.  Its a fresh sort of game which is hard to come by nowadays. It allows for players who are not very technical, but who are very smart and can outthink their opponents to shine. It has a very large learning skill ceiling, as moving a single unit differently could change the outcome of the game.  It has a free to play COMPONENT (This is not a free to play game) that allows for people to trial the game, in which I seriously recommend doing so. It may take you 10 games before you get the hang of it, but it is definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Atlas Reactor is a fun little game that takes some elements from turn based squad games (like XCom) and mixes them with other elements from MOBAs. You've got twenty seconds to enter your move for the turn, and then the action goes off.  It leads to fun mind-games where you're trying to decide whether your opponent thinks you will dash to that location over there, so they might attack that location instead of where you actually are, so you decide that since your correct course of action is so obvious, that you'll instead stay put and... then you find out they called your bluff.  Never go in against a Sicilian when death is on the line!  The character bios are awesome as well, especially Oz, the recalled toy-bot (for displaying freewill and weapon-grade lasers) and Quark, the homicidal... thingie... that just wants to tickle your neurons.  I recommend this game for anyone old enough to have played games like Jagged Alliance and who doesn't want to wade into the toxic morass of other MOBA communities.  Edit: Regarding the 'free to try' nature of the game - they let you try the game out for free. It's not intended to be played forever like an actual free to play title. If you like the game, buy the damn package. If you don't, then stop complaining that they give you a random selection of four characters (that rotate) to play around with in the meantime.",
            "review_score": "1"
        },
        {
            "review_text": "'Free Mode - Try Atlas Reactor for Free'  People complaining about a infinite duration demo not having enough features. BUY THE GAME YOU CHEAPSKATE ♥♥♥♥S   ",
            "review_score": "1"
        },
        {
            "review_text": "This is da game",
            "review_score": "1"
        },
        {
            "review_text": "you can such a good time with this game even when you just have the free version, And the full game is half of that of an average game that just came out, so yeah this game gets a thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a LOT of fun.  It's unique. It's 4v4 pvp simultaneous turn tactics. Broken down, everyone decides what they want to do (one action then one move) ahead of time and locks it in. Then the phases go off in order and you get to see what everyone locked in! games go a LOT faster then other turn or tactics games with the 20 second limit on turns and 8 people all taking their turns at the same time.  This alone would be neat and novel, but what makes the game great is how tactical and deep and balanced the game is. One of those 'simple idea, complex strategy' type deals. There are already high level tournaments where top teams are repeatedly winning, showing player skill cap is a HUGE factor.  I've been playing atlas reactor a LOT the past few months, and even more in the future to come.",
            "review_score": "1"
        },
        {
            "review_text": "I need to play it more, but I like what I have played so far.",
            "review_score": "1"
        },
        {
            "review_text": "It's really good.",
            "review_score": "1"
        },
        {
            "review_text": "fun, relaxing turn based combat that you can just jump in and play in a hurry with a nice beverage in your hand.",
            "review_score": "1"
        },
        {
            "review_text": "I wanna get one missunderstanding right out of the way,the game was never meant to be a true f2p game. See the Freemode as a sort of Demo to check if you like the game, so dont get a wrong image of bad reviews by people who complain about the freemode.  Now to my actual review -  as of right now i completely recommend the game, it may not have tons and tons of content yet,but whats there is solid. I didnt run into any unbalanced character or any character feeling 'OP' or anything, all characters can be combined with each other to unleash combos of abilities - teamwork is key here. Im looking forward to be playing alot more of it.  peace~ ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Fun",
            "review_score": "1"
        },
        {
            "review_text": "Best new game of the year, IMO. If you like strategy and you like pvp, this will be right up your alley.",
            "review_score": "1"
        },
        {
            "review_text": "fun game that keeps you on the edge of your seat as the crazy unfolds.",
            "review_score": "1"
        },
        {
            "review_text": "A well made game with a fresh spin on the battle arena concept that has been floating around for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Atlas Reactor is a child of Overwatch and Xcom. The combat is Xcom style, where you instead control only one character. Your abilities and dealt damage built up to your ultimate bar. The game has multiple heroes, or 'Freelancers' in this case, and they all have different play styles and abilities to be aware of.  Matches are pretty well phased and the balancing is great. Matches also don't take too long to finish.  The game is basically pay to play, but you can also play a trial version with free heroes, but you cannot unlock heroes by playing.  Overall a really fun and addicting game.",
            "review_score": "1"
        },
        {
            "review_text": "It's good",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game if you like turn based tactical combat like Xcom series and others. Definitely worth checking out since it's free.",
            "review_score": "1"
        },
        {
            "review_text": "the Character Balence is great, which can't always be said for games like these. the game is easy to learn unlike other game like this. you will have to deal with bad players every once and awhile, but dew to the game's Strategic Nature, there won't be that many.  There is a but however, this is a Trion Game, and it wouldn't be a Trion game without them Shoving the cash shop in your face. but the cash shop here is weird.. because there is none, you can either play for free or buy the game. if you play your free you can't own any of the characters, your stuck using the Free rotation, you also can't use ISO which is the game's currecy you get from getting skins and emotes you already have, which you get from boxes. you get the boxes by leveling up your account and the characters, there was a time where free player's could only open 1 box every 36 hours, but that was removed. if you Buy the game you can use any character any time.  my only real problem is, once this game gets a solid playerbase that won't grow anymore... how are they gunna get a income? for now the game is great, but be warned, Trion has a habbit to downgrade their games for money",
            "review_score": "1"
        },
        {
            "review_text": "The Greatest Multiplayer streagy game I have played , even if I have just started to play The only bad thing is people dont talk",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite fun once you get the hang of it. Very unique concept, and matches are relatively short.   I like picking soldier 76, mac cree, and messi. Looking forward to release of Sombra and Tracer  -Gamani",
            "review_score": "1"
        },
        {
            "review_text": "good if you have friends to play with. sadly most games i recommend to my friends (or buy) never play. so gg. great game all round though and highly recommend it to anyone wanting a good pvp strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting system, to be sure. I've had a lot of fun with the 'free to play' version, but more on that in a minute.  The characters are all endearing and pretty fun to play once you get a grasp of the core mechanics, which are a fresh take on... MOBAs? Not really. There are no ingame upgrades, and most building is done pre-game. There are some really interesting concepts going on here, and I'm really waiting to see what comes of it when the cast expands a bit.  Which brings me to my main gripes. The cast is very small for this sort of game, weighing in at 5 supports, 5 tanks, and 9 DPS as of the time of this writing. If you are the type that likes switching characters and roles frequently, your interest will wane much faster than with other team based games. The core mechanics may carry the game for you, however.   Lastly, this game isn't actually a FTP. The FTP model works more as a demo, really. This is fine as far as I'm concerned, but it should really be listed in the store as such.   Additional plus, I'm running this on a potato and aside from the occasional framerate chug, I'm running it pretty fine.",
            "review_score": "1"
        },
        {
            "review_text": "Ever since I came across Atlas Reactor, I was worried that it might fall into the 'It takes too much time' category. Since, in my opinion, games that grant instant gratification rather than requiring lots of effort to reach satisfaction are blossoming nowadays, Atlas Reactor had fallen in the latter category for me on first sight and had me questioning wether I should invest in getting it or not. The concept was great and fresh, game mechanics looked like they work fantastic, and since it's 4Vs4 type of game, you could have a much tighter space too cooperate with teammates. Once I learned that Atlas Reactor offered a 'Demo Version', and I call it that because people who read Free to Play get super salty when everything isn't free, I was delighted and decided to give it a go. I was simply amazed at the freshness of game concept Atlas Reactor had to offer. Matches were MUCH shorter than I had expected and it was more adrenaline inducing that the majority of my Dota2 games, all within 20 seconds of deciding what to do. After reaching about lvl 8 with my account, I reached a point where I thought to myself, I should definitely buy and support this game. And it was one of the best game purchasing decisions I ever made. I hope this game goes far. I truly do.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for a long time and have loved every bit of it! It's only getting better and better and there is so much value for the measly asking price it's not even a question to give!  The Devs are fun and engage the community every single day and have nothing but ears to listen to our feedback!",
            "review_score": "1"
        },
        {
            "review_text": "Really clever twist on arena deathmatch action. The turn-based action phase mechanic is very intuitive and easy to pick up. The time limit on turns is more than generous enough to allow thoughtful decision-making while still keeping the pace quick.  I'd love to see some more game mode variations to break up the deathmatch, but otherwise this is a really fun action/scrategy hybrid.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine the best parts of an LoL/Dota teamfight essentially turned into a board game/SRPG, essentially slowing down to a manageable but not crawling pace, and you're pretty much sitting in the Atlas Reactor's sweet spot.",
            "review_score": "1"
        },
        {
            "review_text": "If you combined Borderland 2's graphics, XCom's gameplay and added the Team based gameplay of a Moba or Team shooter, Atlas Reactor is what you'd get. The only con I really have is that the UI needs some work.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much like an on-line X-Com with unique heroes. Like!",
            "review_score": "1"
        },
        {
            "review_text": "amazing game  you need just good team and good judgement purely team based game",
            "review_score": "1"
        },
        {
            "review_text": "I think it's a pretty good game for starters. Althought it would be helpful if we could just grind every character when the beta is done :)",
            "review_score": "1"
        },
        {
            "review_text": "It looks like a fine game, but quite slow gameplay in my opinion. Here are the pros and cons:  Pros: + nice graphic + nice characters + it is based on prediction, not reflexes + it is co-op + not pay to win, but pay to look good =) so you are paying only for visuals as far as I know  Cons: - slow gameplay - fights are quite long and slow since you wait 20 sec (during your turn or enemy) and it causing that game looks like it has no action. Also mechanics are slowing game.  - lil complicated mechanics (Boost &gt; Dash &gt; Attack &gt; Movement) it means you boost or heal yourself/allies 1st, then goes dash, attack abilities and movement is the last one. It sounds kidna cool, but I would say it takes away action little and causing troubles if you get knocked very far from team or you are melee hero - till you get into suitable possition it takes ages, couple of dmg and in the end you still dont have good position for attacks (since enemy moved too). - If I was a Dev, I would try to make it more simple  And that is all.  Overal: I would recommend you to try it and see by yourself =). You might like it, but for me it is kind of slow action =)",
            "review_score": "1"
        },
        {
            "review_text": "it's fine",
            "review_score": "1"
        },
        {
            "review_text": "Been liking it a lot so far. The idea of outfitting a MOBA skeleton with another genre isn't particularly new, but allows for many possibilities, and if you ever dug a strategical turn based RPG like X-COM, then you're gonna like this. A methodical yet fast paced game with good character design and interesting setting. It even has some grouding lore for those who like that kind of thing.",
            "review_score": "1"
        },
        {
            "review_text": "Better than playing any MOBA after a bad game. Each game is quick, only lasts 20 turns, clear goal, and very fun to play. The skins could have better colors but the loot matrix gives you some good stuff each time. Ranked isn't bad too, don't have to worry about promotional games and just focus on winning every game to climb. The freelancer mastery is good too, but I hate that it takes forever and doesn't really require skill, you just spam the character. That would be my only complaint. Still a fun game to play alone and with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "A winner. Does what it does perfectly. If round based, quick online strategy doesn´t sound like your thing, i´d still give it a try for the sheer fun of its visuals.",
            "review_score": "1"
        },
        {
            "review_text": "Turn-based (tile) strategy game turned online! one of the coolest free to play games in here! the game is improving to its best since beta. you should give this game a try since it is free and if you're into this kind of genre! definitely a must play for me!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game but...be prepared to lose at first as you get the feel for the different hero's abilities.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a great game. Got it this weekend and its amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I'd like this game... but ♥♥♥♥♥♥♥ it is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome new game that blends XCOM strategy and MOBA style characters. Difficult at first, but with enough hours you can master this game. Since there are various freelancers and various maps, every single game plays out differently so it never gets stale. The game is still new so there's more characters, maps, gameplay and cosmetic items yet to come.  Try out the free version of the game, although heavily restricted, but if you like it, then I definitely recommend purchasing the game to unlock everything.",
            "review_score": "1"
        },
        {
            "review_text": "    One of the greatest of all time  ",
            "review_score": "1"
        },
        {
            "review_text": "mix between XCOM and OVERWATCH. Brilliant strategy, best played in a team of 4, makes for a lot of fun and not as much frustration as MMOBA'S If i ever get a dog, i'm calling him 'Pup'",
            "review_score": "1"
        },
        {
            "review_text": "Is good game, would recommend to all comrades",
            "review_score": "1"
        },
        {
            "review_text": "TLDR - Turn base MOBA",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but expensive. 40$ to play ranked seems steep. Would definitely drop some cash if there was a cheaper option.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game, it could be a really great free to play game, but...",
            "review_score": "1"
        },
        {
            "review_text": "i faking love this game.  Played it prior to steam 'release' already and it's just so much fun outplayin' ya enemies.  Goal is to score 5 kills or the 'golden kill', if both teams are tied after 20 rounds. First you start with a planning phase and then both teams turns are played in four phases. First a preperation phase, where buffs are applied. Then a dash phase, where ...well, you guessed it, dashes of all kinds are used. Then comes the blast phase, in which all attacks are used. Last comes the movement phase, where all players run and reposition.  This forces you to think ahead. 'I could kill him, but does he have a dash? Where could he dash to, can i shoot the approximate position and kill him after he dashed?'  You should master those thoughts. And when, some day, you play against your friends and stomp them and they insult you, you can be like: 'I am five steps ahead of you. Scrubs.' &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "First, there was a bit a confusion about whether it's F2P game. Not really, no. You can try it for free, but there are features and characters locked out for you. You must buy the game to fully unlock all features. Once you bought it though, you have it forever. I find this much better than those 'free to play' games out there, that actually ask more and more money from you with each new thing. Taunts and purely cosmetic stuff is unlocked by playing, which is part of the fun, and it actually is happening at a nicely fast pace.  The game is really great. I recommend snatching it at a 33% discount like me, but for me it's well worth the full price. Heck, I even bought the ultimate edition because I enjoy it this much. Best served with friends btw.  The turn based system is simple yet well made, first comes the decision phase, you decide what you gonna do, then everything happens simultaneously. This brings a lot of funny and/or wtf-moments, and every match unfolds differently. Unlike MOBAs, there is no snowballing, no lined up way to play, no laning here. You need to use brain a bit, presume enemy actions and play mind games with them. It's not overly hard though, no worry.  Pros: Interesting turn-based gameplay. Varied and fun characters. 'Buy once, play forever' type of obtaining the game. Great attentive devs.  Cons: Menus look slightly obsolete at this point. Occasional bugs.  The game is at the beggining of its path, updates come often and bring new characters and maps, it can grow a a lot from this point, and it will. Thumbs up, I am looking forward for new characters and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "There is too little content and replayability to justify spending 30 euros on this. It's a fun game and I like the effort to make some turn-based, fast-paced pvp. However, after having played 15 hours (at the time of review) I already feel it getting old. It seems like the matches all seem to play out in a very similar way. The maps don't change much at all and there is only one game mode.   I just don't get a strong urge to queue back up after a game like I do with LoL, for example. Maybe this is because of the limited number of champions available as a free player. I'm not sure unlocking all the champions would really remedy that, though, so I won't fork over the money and I don't recommend you do either.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a great game that challenges you to constantly think about what you are going to do ahead of time. Make sure you download Discord so you can talk to your team wish there was a in game voice that though. For those thinking this game is Free 2 Play it's not and the game never makes me feel like it is. Try some charter out see if you like the game and then decide how much $$ you want to invest in it. All the reviews saying this game is F2P are dog ♥♥♥♥♥ for the most part because as i said once you open up the game and play it nothing screams free to play. Update The timed moves is horiable i often don't do what i want to do or can't cordinate with me team properly and this more often then not make me steamy and often leads to teamates doing whatever the hell they want and not cordinating attacks",
            "review_score": "-1"
        },
        {
            "review_text": "Could be good after A LOT of polishing.   The turorial is weak, and doesn't explain things well enough. It took me 3 games afterwards just to get the basic mechanics down, and I still got confused about many smaller details as they arose.  Turns are too long, and matches get tedious fast.  Gameplay is unengaging and unintuitive.   Visuals are unpolished, and could use a lot of cleaning up.  Voice acting is cringey. They say really stupid things with almost every move.   This honestly feels like an early alpha game. Some great ideas, but I just couldn't squeeze a drop of fun out of it in it's current state.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game. A horrible business model. It feels like this game doesn't know if it wants to be free to play or buy to play so it kinda does both and does it bad.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not a real f2p at all which may end up killing this in the end as it has a fairly weak playerbase. As a paid game it's fine in general, but I have no faith in it lasting over time. I would avoid buying it in general just due to this alone unless you plan to get your fill asap and not play in the long term.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "the games fun and all but holy ♥♥♥♥♥ god forbid you play without paying... and the price is just too greedy for the overall scope of it.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game, but unfortunately this is not f2p. You can't buy all characters nor play ranked unless you buy the full game (you can just try characters in rotation). And this is not worth 30 euro, maybe 15 would be a better price.",
            "review_score": "-1"
        },
        {
            "review_text": "I get the surprise you need to buy the game to unlock all characters.",
            "review_score": "-1"
        },
        {
            "review_text": "Bugs over bugs and a not-working-game  - first you need a separate Trion Worlds account on top of the Steam one - charset is broken on the Glyph sign-up screen. I couldn't read anything. - next it didn't accept my regular email address, sign-up page said it is an invalid one. But of course I entered a valid one but the system just suxx. I had to try a couple of email addresses until I found one the system accepted. - then I didn't receive any confirmation email to finish my sign-up process for hours. - after a few hours I finally received one and started the game just to see a only a small, little black square and that's it. - tried over and over again, did a reinstall and things but nothing... the game just doesn't start. - After all I lost interest in the game and wrote the this review.  Do yourself a favour and stay away from this crap!",
            "review_score": "-1"
        },
        {
            "review_text": "Dispite being listed as a F2P it really isn't.   If you guys ever played any F2P MOBA you know about those weekly hero rotations where a limited number of heroes is made available. This is the case with this games 'Free' mode. You never get to really own a hero, you are limited to those random hero rotations.   Other than that it is a simple arena brawler with a turn based twist.  The gameplay itself is ok, you essentially try to predict enemy movement and catch them offguard since gameplay happens simulataniously. This means everyone plans their turns and then executes them at the same time. You have a rather small amount of heroes with rather boring abilities compared to lets say LoL or DotA 2.  Ultimately the maps are boring aswell, there seems to be a steampunk/scifi theme going on.  There is an ingame tutorial, play vs AI , casual pvp and ranked pvp mode. Ranked pvp is behind the paygate.  The graphics are ok and it runs decent on my 3 year old PC. They went for a cell shading style similar to borderlands on their characters and a very boring generic 3D style for the environment.  Overall a good idea but a boring execution.",
            "review_score": "-1"
        },
        {
            "review_text": "A game without much content that is relying solely on its so called unique gameplay to keep you interested, when in reality everyone over a certain age will remember when this system was very popular with flash games in the early 00's.   The artistic direction of this game suffers from the same issues that many mobas and other 'character driven' games do in that they have no cohesive design direction, and instead rely on developers coming up with a ton of 'cool' character ideas in a vaccume.  I'm still waiting for the mobaesque game that actually utilizes faction v faction mechanics with solid artistic and gameplay direction to create a unique experience with asymetric balance instead of just pulling random 'hero'(or in this case, freelancer) ideas out of their ♥♥♥.   This game not only does nothing new, but also fails to deliver on quantity or quality regarding the content that is here.  On top of all of this it is a Trion game, so even if things were good you know it would only be a matter of time before they find a way to turn it into p2w trash.   Best to avoid this one and it's misleading free to play platform.",
            "review_score": "-1"
        },
        {
            "review_text": "I know that alot of free games can be pay to win... But this game is pay to win and then pay to play. Not beong able to play ranked unless you pay £20.99, now that's a little bit silly.",
            "review_score": "-1"
        },
        {
            "review_text": "See i just started playing this game few days ago. I love this game, but the only down sider about this is, You only get to use 1 ability per turn. I think it would be more better if you could use 2 abilities per turn max. Therefore because, It would bring more destruction and more funnier ways to kill your enemy to this strategy game. Also, If you have a heal ability, You can heal your teammates and then do damage to your enemy. And your 5th ability is 100 max energy, That should be less then 100. because instead of using it, then once its used you wont be able to use it for the rest of the match because therefore, your energy takes quite just slightly to long to charge. Mabye look into it possibly.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't play if you don't intend to buy the game as you'll be stuck with heroes you don't want",
            "review_score": "-1"
        },
        {
            "review_text": "The game is pretty good but you will need to pay like $30 to access the full game so if you want a f2p game then dont download this game but if your willing to pay then thats a good game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a really good game but my issue is you need to get the full FULL GAME and it would be cool if they can add a currency to the game to buy stuff without ussing youre money",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of time unless you buy it. Every champion is locked behind real money pay wall and so are the mods which allow to augment the champions skills/abilities. I thought we had moved past this stupid payment model years ago, apparently not.  I guess that why only 300 people are playing",
            "review_score": "-1"
        },
        {
            "review_text": "Like a Chinese Dr.Moba aborted a baby between Overwatch's store and Final Fantasy tactics. Enjoyable for casuals... I don't think many people looking for serious competition in a game would enjoy this game. Good idea on paper but really boring to play.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was so boring but any one who likes strategy games this is the game for u.",
            "review_score": "-1"
        },
        {
            "review_text": "☒ Glyph ☒ Virus detected",
            "review_score": "-1"
        },
        {
            "review_text": "it's not really free-to-play you need to buy packs for play ",
            "review_score": "-1"
        },
        {
            "review_text": "Wrote a bunch...steam deleted it apparently. So short version. Game is fun but the lack of unlocking any characters in free to play mode makes it an underwhelming experience and frustrating to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Some might think of this as 'strategy', i see it as a bunch of random actions. Dota meets XCOM? Trust me...its not....  Cons - 30 € ist about 20€ too much for this game - 'Free to play' version is a demo, nothing else. Don't call it F2P, it's a ♥♥♥♥♥♥♥ demo... - GUI design team must be on Crack and LSD at the same time. Never seen a more confusing GUI in any game. - 'Strategy' is based on 30+% luck - Round-based Strategy and 15 sec per Round....yeah 'strategy'  Pros + Funny background story + Nice animations  This game is fast paced, turn based action with some stategy behind it. It is not good, but well it seems to have few bugs so give it a try if it's under 10€",
            "review_score": "-1"
        },
        {
            "review_text": "- Learn about the game and feel interested - Download the game notice that it starts on Glyph  - Think: 'either Trion decided become decent or the business model is a scam' - Finish the tutorial and realise that Trion is still Trion - Uninstall  By all means this game is very original and might even be good but I just don't buy into scammy business models, I'm sorry. This is just the demo of a game whose full price (22£/29$ minimum atm) is simply out of line for multiplayer/match only game. This is not Overwatch for crying out loud... The leopard can not change its spots...",
            "review_score": "-1"
        },
        {
            "review_text": "So this I like this game. It's fun to play so far and I think i will play many more matches. My main problem that's holding me back from buying it is that if I do will the game just die like battleborn? Until you know for sure that the community for this game isn't going to die in 2 months I'd hold off on getting it and just play it for free. If the game does stay I will change this review until then it;s going to be negative.",
            "review_score": "-1"
        },
        {
            "review_text": "30 fps on medium settings in a turn-based game on FX6300, 8GB DDR3 and GTX1060 6GB doesn't sound right to me... Also the 'free' business model is a pure joke. Not mentioning it's FAR from 'XCOM meets DotA'. Oh well, another fast cash-grab. I don't know which game played those who say 'well polished', 'original' or even 'great game'.",
            "review_score": "-1"
        },
        {
            "review_text": "cant even register because it says 'the text you entered for the CAPTCHA is not correct' so, i cant even play the game.",
            "review_score": "-1"
        },
        {
            "review_text": "max complexity.  zero depth.  killyourself420.",
            "review_score": "-1"
        },
        {
            "review_text": "don't play this game please ",
            "review_score": "-1"
        },
        {
            "review_text": "worst game ever, sry but a bit too how can I put it... Bad",
            "review_score": "-1"
        },
        {
            "review_text": "Atlas Reactor, a fun game about playing a Freelancer in a fast paced turn based strategy game that is oh so slightly reminicent of Xcom. The game takes place on a 20 second turn timer were you set up your move and see what your team mates are doing. Then those moves you set up happen in phases. The phases are as follows. The Prep phase is where healing, support, and trap like actions occur, This makes it so you can keep up yourself or your team before the figurative (sometimes literal) bombs drop. Next up comes the dash phase, were you get to do a quick, most of the time short move. Almost every freelancer has a dash abillity they can use, They can do damage, stealth you after a short teleport, stop the enemy from moving later, and save you from a bad situation such as an entire team surrounding you. The next runner up is the Blast phase. This stage, unsurprisingly, has a lot of blasting. Almost all abillities in this phase go in a sort of order that you more or less learn by playing. It's made so that the abilities that deal straight up damage go before the abilities that move people around go. While this keeps a lot of cockblocking from happening, poor team coordination still ♥♥♥♥s things up. Finally there is the move phase, where you move normaly if you're still alive after all of that. You keep doing this until one team gets 5 kills, or has more kills than the other at 20 turns. There are 3 or 4 maps that have enough variety in how you play on them for you to notice. That's about it on the gameplay side, time to get to the big issue. I haven't read much into why Atlas is like this, but its a free to play, but as Trion is involved with it, there's something off. The one thing that could ruin this wonderful, hero based game, is by restricting heroes. You see, Im not sure why this is, and it might just be a slow adjustment out of EARLY early access, but you have to pay to be able to have access to all Freelancers at all times. It tries to make up for this with a free rotation change that happens every two weeks, and is unique for each play, but it doesn't work to well when you want to play who your comfortable with after a bad losing streak. It also tries to make up for it by giving you access to lootcrates in the free version, and you get to open one every two days or so. This lets you have a wide variety of cosmetics that you would have to pay several bucks for in any other game. Once again, you can't own freelancers, so it's like getting nothing but that loot you didn't want when you pay for those keys or chests in other games like TF2 and Smite. So, if they get rid of this and make it a proper F2P with a sort of Ultimate Character Pack like the other good games, then I would totally be 100 percent reccomending this game.  So, in short, the Gameplay is wonderful, most fun I've had with friends since I started playing smite about 3 years ago. But, at the moment, gameplay is all it's got going for it. If it wants to be popular in any way, shape, or form, then it's gonna have to fix how it's doing it's free to play.  ___________________________________________________________________ The Real ♥♥♥♥  Alright, it's Trion. They've officially been working a lot on it and I see that they've been keeping with the fact that It's not free to play unless your fine with just Free rotation, So yea. Im done, fun gameplay cant be all that holds up a free to play game.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont know where to start with this review so i guess ill just say this game is top notch after the time ive spent playing it i say its money well spent i was hooked from the start and any strategy/moba fan i think would be hooked as well since it combines both genres so nicely.   Pros - great freelancer choice with so many unique characters - fast paced yet not so fast its overwhelming - SKINS SKINS SKINS - Loot crates!!! - addicting - non toxic community - did i mention skins?!?  Cons - there are none even worth mentioning",
            "review_score": "1"
        }
    ]
}