{
    "app_id": 402620,
    "name": "Kindred Spirits on the Roof",
    "release_date": "2016-02-12",
    "developer": [
        "Liar-soft"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Nudity",
        "Visual Novel",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 574,
    "negative_ratings": 22,
    "price": 26.99,
    "description": "During lunch one day, Toomi Yuna meets two &quot;Kindred Spirits&quot; on the roof of her school. When they insist she help them nurture young love, Yuna finds herself playing &quot;yuri cupid&quot; to six unique and adorable couples. Can she remain aloof or will the promise of a &quot;yuritopia&quot; reach her too?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/402620/header.jpg?t=1547534582",
    "minimum_requirements": "OS: Windows Vista Processor: Pentium III 800 MHz Memory: 1 GB RAM Graphics: 800x600 Full Color DirectX: Version 9.0c Storage: 1100 MB available space Sound Card: Direct Sound Compatible",
    "recommended_requirements": "OS: Windows 7 or Better Processor: Pentium Ⅲ- 1.0GHz Memory: 2 GB RAM",
    "reviews": [
        {
            "review_text": "'B-But we're both girls!'  10/10",
            "review_score": "1"
        },
        {
            "review_text": "We have entered Yuritopia. Full and uncut.  -There is no going back now-",
            "review_score": "1"
        },
        {
            "review_text": "It helps ease the pain.",
            "review_score": "1"
        },
        {
            "review_text": "Now that the entire series has concluded, I no longer know what I want to do with my life.",
            "review_score": "1"
        },
        {
            "review_text": "A ghost bought me this game, since I don't have any friends.  Thanks,  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Kindred Spirits exceeded my expectations by leaps and bounds. It's my favorite yuri now. Because it's not just a good yuri, it's a good story. The characters are so well written. You can understand were they are all coming from and why they are behaving the way they are. It's rare for the yuri genre to have fleshed out characters like this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like yuri or VN you may want to support this game for the future of the genre.  First of all, I have played the Japanese version a few years back. The game is fantastic. Probably one of the best takes in VN form on the yuri genre. It's light hearted, often funny and very touching towards the end, 'healing', and characters are very cute. The things you may criticize in this game are mostly attributable to the development budget. That said, I can't comment on the translation. I assume it will be fine enough. The original text is plain and simple and I assume it remains as readable translated.  Liar soft is one of the VN companies with a more indie feel. It makes very unique and fun games, though not necessarily with the highest production value. You can say it occupies a niche spot in an already niche market.  Often times this is reflected in the fact that there is limited voice acting. That just means mostly the writer was more ambitious than the budget allowed in terms of full voice acting. I would also point out that although the consensus is fully voiced acted VNs are the way to go, partial voice acting allows writing of longer monologues, which some may enjoy.   Now I was really surprised this game got released on Steam uncensored. The price is high but it's what you would expect for a limited audience release. If you buy this game it may encourage them to make bigger budget works with western release in schedule. When the volume is higher obviously that allows for different pricing schemes.   Finally let me reiterate that the game is fantastic, espcially if you are a genre lover of yuri--it's not to be missed. If you can't get it now, wish list it and check it out later.",
            "review_score": "1"
        },
        {
            "review_text": "I saw the reviews and thought the artwork was cute, so I purchased this game on a whim.  I did not complete this game on a whim. I am still suffering from the aftermath, because h o l y ♥♥♥♥ is this game adorable. The story's adorable, the concept is adorable, the voice acting--did I mention the voice acting??--is superb.  10/10 would yuri again",
            "review_score": "1"
        },
        {
            "review_text": "it was my first eroge, and DAMN, this game is wonderful. I'm actually at 76hours in this and i didn't seen them passed. Stories are really different from each others. Charact design is really beautifull  If you're still in hesitating way about try or not this game, just buy it, it'll not be a disappointment",
            "review_score": "1"
        },
        {
            "review_text": "This is more kinetic novel than video game per se, given that choices have no impact (besides unlocking extras). That said, as a yuri kinetic novel, it is nearly flawless. The characters look like stereotypes at first glance, but are actually quite developed and act rather believably. There is enough variety for anyone to find characters to their liking and while I liked some characters a lot more than the rest, I did not hate any of them. Even the teacher/student pairing, made all the weirder because the teacher looks like she is 10, did not grate on me like I tought it would, mostly because every character has her time to shine and her own quirks. More than anything, I felt like this game perfectly captured the nature of teen drama as I remember it. How even the most insignificant of exchanges can be misunderstood and blown out of proportion, not because anyone is mean, but simply because everyone expects others to just understand 'obvious' stuff via pure empathy. That said, in my teens, things did not resolve so systematically well for everyone... but here the happy endings go a long way to compensate for the sad moments (the whole premise is about ghosts of long dead high school girls who never experienced love in their short lives and want to so that they can move on... yeah, want some fries with your angst?). As for the sex scenes, they are more erotic than pornographic and mostly well built up into each couple's narratives. I think they could be easily ignored by players who don't like that kind of stuff.",
            "review_score": "1"
        },
        {
            "review_text": "This visual novel has somewhat limited voice acting, art style could use some polish, but...  The story was very sweet, heartwarming and entertaining and it was worth reading.  I enjoyed this more than XCom 2.  I only wish they included japanese text in it as well.",
            "review_score": "1"
        },
        {
            "review_text": "DANGER ALERT: IN THIS VISUAL NOVEL, THERE ARE MULTIPLE GIRLS AND SEVERAL COMBINATIONS OF THEM LIKE EACH OTHER. IF YOU LIKE PEOPLE, YOU MAY ENJOY THIS  e; IN ACCORDANCE WITH VALVE'S TERMS OF THE 2016 NOMINATIONS, I AM UPDATING TO SAY THAT I BELIEVE THIS GAME SHOULD WIN CAUSE, IT'S REALLY SUPER GAY",
            "review_score": "1"
        },
        {
            "review_text": "This game is super cute and the story line is pretty good though some parts are super cheesy but its still cute. This is one of the longer visual novels that I played before but definitely worth the hours spent in this game.   Made for all yuri lovers out there &lt;3 ",
            "review_score": "1"
        },
        {
            "review_text": "Long story short, they all banged in the end.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game and it's exciting to see that it's released on steam. Hope that we could have more such games on steam",
            "review_score": "1"
        },
        {
            "review_text": "'I guess I'm gay'  Yes, that's the point, be gay, be okay with being gay, and be gay  'A True Yuritopia' - Mjoll 2k16  'It's pretty damn gay' - AnimeKilledMe  'From what I've heard it sounds GAY AS ♥♥♥♥' - Timmy  '7.8/10 to much gay' - IGN",
            "review_score": "1"
        },
        {
            "review_text": "My friend told me about this game and at first I lost my ♥♥♥♥. I saw the price and was bummed and wondered if it was worth it... IT IS WORTH EVERY PENNY! Kindred Spirits does an amazing job pulling you into its amazing story, character development, plot, and everything. There isn't anything about this game I don't love. I played it all in a week and I'd do it again and again and again... If you have the money, please buy it! Together, we can make 'YURITOPIA!'",
            "review_score": "1"
        },
        {
            "review_text": "A game about teaching ghost lesbians how to get jiggy did not make my cry. You cant prove ♥♥♥♥. I'm a grown ♥♥♥ man. Shut up. Also to be serial this game is more like a romance novel then a porno so keep that in mind wen you buy i was plaing pretty slow so it took me over 20 hours to get the first love scene, not compaing at all that was 20 minuts of beautifly writen romance.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. I love it. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Did you see the review? Did you see i recommend this? Then purchase this stuff and play you damn plebs",
            "review_score": "1"
        },
        {
            "review_text": "Good story, Great Characters",
            "review_score": "1"
        },
        {
            "review_text": "Teases you with ambient jazz theremin concerts but doesn't deliver.",
            "review_score": "-1"
        },
        {
            "review_text": "Really liking it so far! The way they announced it before was very ecchi and sex-based but the story is really fun to keep track of and be a part of, you kind of forget about all of that other stuff until it shows up eventually.  It's been amazing and I can't wait to finish it!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game, i didn't get bored at all, i highly recommend it, if you are into visual novels and yuri",
            "review_score": "1"
        },
        {
            "review_text": "its worth the wait ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Yuritopia FTW! Definitely enjoyed the game, character development, art and music. Story plot is satsfying as you progress the game, if I have a request that would be a route for the mc with a certain other character.",
            "review_score": "1"
        },
        {
            "review_text": "  I remember being really excited for this game when it was announced. Well lo and behold when I receive it as an early birthday gift from a friend! As someone who is very into the Yuri genre but has as of yet played really any visual novels (up until now anime and manga has scratched that itch), this is a great introduction! Despite a somewhat slow start and limited soundtrack, it's very well written and definitely worth a playthrough if a nice yuri on the lighter side is what you're looking for.   While the reason I had avoided buying it for myself up until now was a seemingly high price for the perceived amount of content, there are actually a sizeable amount of extra scenes you can unlock based on the decisions you make in game. All in all I'd say it definitely makes the price more reasonable (for anyone cheap and skeptical like me).",
            "review_score": "1"
        },
        {
            "review_text": "It's a great visual novel with good artwork and a fantastic story. Perfect for any yuri fans or anyone who wants to see a good love story. The length of the game depends on how fast you can read, but I'd say it took me about thirty hours to go through the story and another 4 or 5 for the bonus scenes. All voice acting is in Japanese, and it only occurs in important scenes. The only bug with the game is that it doesn't mesh well with steam, so you can't open the steam overlay or take screenshots, and if you're playing the game through steam, it will sometimes freeze after 15 minutes. That can be avoided though by just running the program itself instead of playing it through steam. Fantastic visual novel that I will continue to distract me from any homework.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game, i didn't get bored at all, i highly recommend it, if you are into visual novels and yuri",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite VNs, and some of the best writing I've experienced in a game this year. I love almost all of the characters. Koba Youka in particular is awesome. It's likely the best yuri VN on Steam. It's definitely in a league of its own of those I've played at least.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let my play time fool you, I definitely got over 20-30 hours of play time out of this visual novel and that's not counting the extra scenes you unlock after finishing the game.   Every 15-20 minutes the game would freeze and become unresponsive when I opened it through steam, so I had to use a work around. I had to go to my game library, right click the game, click “properties,” click the “local files” tab, click “browse local files,” and finally open the game directly from the folder. It was only after doing all that the game worked without any problems. The only thing about opening the game like that is that steam won't register it which is why I only have five hours on record even though I played it for far longer than that.  I had this game on my wishlist for a while now waiting to see if it'd get a better sale, but after a while it seemed 25% would be the best sale I'd get so I decided to finally pull the trigger and I wasn't disappointed. I'd say this is probably the ultimate yuri visual novel experience just based on the amount of content you get and the fact that you have five different yuri couples to get that you learn about aside from the main ones each with their own fleshed out storyline that runs parallel to the main one.  In conclusion, if you're a fan of yuri than this is a must buy especially if it's on sale.",
            "review_score": "1"
        }
    ]
}