{
    "app_id": 402750,
    "name": "Giant Machines 2017",
    "release_date": "2016-09-29",
    "developer": [
        "Code Horizon"
    ],
    "publisher": [
        "Code Horizon",
        "PlayWay S.A."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Indie",
        "Singleplayer"
    ],
    "achievements": 14,
    "positive_ratings": 196,
    "negative_ratings": 85,
    "price": 14.99,
    "description": "Take control over seven of the biggest industrial machines in the world. During the 14 mission campaign you will punch through the snows of Greenland, plow the steppes of Wyoming and travel all the way to sunny Florida. Your hard work will be completed by launching a space shuttle into space.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/402750/header.jpg?t=1556015450",
    "minimum_requirements": "OS: Windows 7 (64-bit) or Newer Processor: Intel Core i3 Memory: 4 GB RAM Graphics: NVidia GeForce GTX 560 DirectX: Version 11 Storage: 8 GB available space",
    "recommended_requirements": "OS: Windows 7 (64-bit) or Newer Processor: Intel Core i5 Memory: 8 GB RAM Graphics: NVidia GeForce GTX 970 DirectX: Version 11 Storage: 8 GB available space",
    "reviews": [
        {
            "review_text": "If you like giant machines and sims, buy this game. Machines are large and interactive. Physics arent the best, but good enough. Also, if you have trouble at the shuttle section, take your time! Make sure the ground percent and the platform percent cancel each other out.",
            "review_score": "1"
        },
        {
            "review_text": "The mission with the shuttle (where you transport the shuttle over those track things or whatever) is completely bulls**t. Haven't played past it, otherwise this game is pretty good. Would not recommend for the price.",
            "review_score": "-1"
        },
        {
            "review_text": "Hello , i played this game about of 3 hours and I was so excited , thinking that i will play this game everyday ! I advise to everyone who love giants machines !",
            "review_score": "1"
        },
        {
            "review_text": "Damn it, I'm working on a building site and everything exactly as I have at work. As much is well developed game , hopefully will DLC !!!",
            "review_score": "1"
        },
        {
            "review_text": "I like Giant Machines is cool but short games. I wish the developer could make more Giant Machine  simulator. that would be nice. Thank you.",
            "review_score": "1"
        }
    ]
}