{
    "app_id": 403200,
    "name": "Legends of Dawn Reborn",
    "release_date": "2015-10-20",
    "developer": [
        "Dreamatrix"
    ],
    "publisher": [
        "Dreamatrix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Indie"
    ],
    "achievements": 143,
    "positive_ratings": 21,
    "negative_ratings": 46,
    "price": 19.9,
    "description": "Legends of Dawn Reborn invites players to the brutal northerly reaches of Narr. Survival depends on your magic, your sword, and your wits. Legends of Dawn Reborn takes place in a world of Narr and events take place before those from Wave of Darkness released on Steam Early Access in June.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/403200/header.jpg?t=1447378065",
    "minimum_requirements": "OS: Win 10-64 bits/Win 8-64 bits/Win 7-64 bits//Win Vista-64 bits Processor: Intel Core 2 Duo 2.2 Ghz or AMD Athlon 64 X2 5000+ Memory: 1 GB RAM Graphics: 512 Mb RAM, supporting Pixel Shader 3.0 (Nvidia GeForce 8800 or ATI Radeon HD3850) DirectX: Version 9.0c Storage: 8500 MB available space Sound Card: DirectSound compatible sound card Additional Notes: Game uses resources streaming to avoid loading screens therefore SSD or fast HD is highly recommended",
    "recommended_requirements": "OS: Win 10-64 bits/Win 8-64 bits/Win 7-64 bits//Win Vista-64 bits Processor: Intel Core 2 Quad or AMD Phenom X4 Memory: 1 GB RAM Graphics: 1 Gb RAM, supporting Pixel Shader 3.0 (Nvidia GeForce GTX260 or ATI Radeon HD4850) DirectX: Version 9.0c Storage: 8500 MB available space Sound Card: DirectSound compatible sound card Additional Notes: Game uses resources streaming to avoid loading screens therefore SSD or fast HD is highly recommended",
    "reviews": [
        {
            "review_text": "Absolutely do NOT buy this game. It is a scam. I am not stating that ironically, or to be malicious; this game is unequivocally the buggiest, most poorly managed, poorly updated, and awful piece of garbage that has graced Steam's greenlight program.  BUT, for the sake of a review, lets discuss why.  Entire subsystems and 'class mechanics' dont work. Pathing is a nightmare, and its possible to get stuck in terrain, path through cliffs and never be able to walk back up them, etc. You can die from falling a foot, and die from falling in water. Textures and meshes seeming load in and out of the camera's view randomly. Entire houses will pop up around you, or disappear entirely as you're walking into them. Progression is entirely arbitrary. Items are random, quests may or may not work depending on the alignment of the stars, 'dialogue' is schizophrenic and characters will seemingly have entirely random or baseless reactions to spoken text. Skill progression and pseudo-class progression is trivial and unimaginative. (The only exception being the ability to craft magic) The graphics are abysmal, character models, NPCs, and monsters appear to have been created using software from 1998. The camera and movement controls are horrifically limited. The camera will only allow about a 620x480 field of view, no matter the resolution you're attempting to play it in. Anything and everything can be locked, and the 'rune' system to unlock ANYTHING is never explained and so convoluted theres multiple sections of the manuel that attempt to cover it. The storyline is non-existent. The game has hardware and technical issues, crashes, buggy meshes / textures, etc, etc. Inventory and item management is a chore, and I had found myself not even bothering to loot drops at a certain point.  I can go on. Honestly, I havent even listed half of the things wrong with this travesty of a title, but hopefully this will suffice. AVOID. THIS. TITLE.  I dont even hate the developers, im sure they're great people. Im sure they're nice and loving and wonderful individuals. However, they have produced one of the absolute worst titles to ever hit steam, and I cannot in good faith recommend this to anyone. Seriously.  Dont even buy this for 50 cents. This game is going to go down in history as the next E.T. for the Atari. There's going to just be a virtual landfill with Legends of Dawn (Reborn) and anyone's wallet that accidentally purchased this title.",
            "review_score": "-1"
        },
        {
            "review_text": "Warning, this game is very bad and still expensive, don't buy it even if Steam pays you, I'm serious.  Got this game, or better (if you can call it), before Dreamatrix re-released it as the Reborn version with a big discount. BIG error.  Made a negative review back then, as the game was awful.  What can I say? Dreamatrix says it fixed the game, but the gameplay is as horrible as before, framerate is very low, even with a good pc.  I pity the players who helped to fund this game on Kickstarter - so many promises, all broken.  Dreamatrix, get your game back and please don't mess it anymore.  -10/10",
            "review_score": "-1"
        },
        {
            "review_text": "i was surprised to see a re-release of this, but its still as bad as before. really clunky animations, poorly designed controls, bad performance and just boring gameplay.  dont bother buying this.",
            "review_score": "-1"
        },
        {
            "review_text": "As a casual-ish player,looking for a deacent time sink, Legends of Dawn REBORN provides a decent story, combat system and a overall good time that I wanted for a relativly low price. Most ppl have a problem just starting the game but sicnce I didnt have such a problem I'm enjoing myslef.",
            "review_score": "1"
        },
        {
            "review_text": "Nice to see Legends of Dawn back with some bug fix ! :) Nice work Dreamatrix and good luck for yours futures games !",
            "review_score": "1"
        }
    ]
}