{
    "app_id": 403560,
    "name": "Eaten Alive",
    "release_date": "2015-09-30",
    "developer": [
        "Space Cat Studios"
    ],
    "publisher": [
        "Back To Basics Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Zombies",
        "Pixel Graphics"
    ],
    "achievements": 0,
    "positive_ratings": 166,
    "negative_ratings": 301,
    "price": 0.79,
    "description": "Eaten Alive is a Point and Click, Adventure, Horror game with Puzzle and Mystery game-play elements. Take control of 'Mia' six years after the apocalypse began, the dead don't stay dead and the earth is in a permanent state of darkness. This game contains adult themes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/403560/header.jpg?t=1447378097",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8/10 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible DirectX: Version 9.0 Storage: 500 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Horrible, horrible, horrible, horrible, horrible, horrible, OMFG THIS IS BAD",
            "review_score": "-1"
        },
        {
            "review_text": "This game, it's just... It's so bad I can't even describe it  Let's see, where do I begin...  I played through the tutorial because that's what I usually do, and when I got through it, the game told me to use the pause menu to leave. I thought doing quit game would take me back to the main menu, but nope, it just flat out shut the game down. Why have a tutorial if it's going to force you to quit the game?  Getting into the actual part of the game, the first building,  FIRST  building, I find multiple problems: I had to do sort of fetch quest in order to leave, in which I was given no knowledge, or even a hint, of doing so. It literally took me a whole 8 minutes to figure out what to do. When I got that done, I encountered buggy mapping near the exit door that would let me the exit the map. Just seeing those two things along almost caused me to close out right there, but I still managed to move on with this painful thing called a 'game'.  Now, these controls... Using the mouse and shift key to run? That just doesn't feel right on me. Especially since you have to click on  every  tile you want to go to. I get that it's a point-and-click game, but it would make more sense to be able to run in one direction while moving with shift instead of clicking on every single tile, but that's just me and my personal experience with these types of games.  But this dialogue... It's so cheesy, I wouldn't even eat it...  I saw this game was on sale, and had trading cards, so I figured 'Hey, let's sit through something for a while and drop these cards', but nope, I didn't even drop my first card, that's how far I managed to get myself before I quit.  Save your 15 cents (or how ever much the game happens to be now) for something else, people.  Not even the card drops are worth it. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game seems to have potential, but I was able to walk on some walls so that was fun. It feels like an early access game, but it's not. For the price tag, this could be a fun game and I look forward to future updates.",
            "review_score": "1"
        },
        {
            "review_text": "So far while playing this game, I have:  - Stepped through the side of a building onto its roof.  - Stood under a waist-high sink without crouching.  - Been eaten by a zombie that I had already run past, was about three meters behind me, and had been standing perfectly still the entire time.  If not for the one-hit perma-death, I might have declared this game craptacular. However, as is, it's just crap.",
            "review_score": "-1"
        },
        {
            "review_text": "complete pile, was thrown together in an afternoon and wasnt even debugged. not worth 1 cent",
            "review_score": "-1"
        },
        {
            "review_text": "So far the game is completely glitched everywhere. There is no conclusion, since progression hasn't been made (you will  play...what?  5 min if you know what to do then stop because the game is not completed/cant advance and this should be some serious red flag for it not to be admited in steam in the first place)  Not that it matters much, gameplay is boring, the whole game was just some quick game made on some cheap prebuild game engine with no real effort in it. Every character has horrid dialog, like they where propusely trying to create the biggest jerks possible.  Install, get the cards and sell the cards for profit, then delete this game from appearing in your library.",
            "review_score": "-1"
        },
        {
            "review_text": "this game really is pretty bad.....i could open RPG maker unzip my pants and slap my hairy taters down on the keyboard a dozen or so times and it would make a better game than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Abous as fun as being literally eaten alive. The controls are ill-conceived and imprecise. In a game where a gameover is always haning over your head, is this is inexcusable, since it means dying is often not even your fault. I bet some people even got stuck on the title screen for a while. Consider this as aggravating pretty much everything else I write from now on. The minigames are annoying. The main character seems written as a parody of an edgy teenager, and acts like a psychopath even towards people showing kindness to her. But, there is no humour in this: it is in fact played completely straight. The tiling is amateurish at best, with several walkable walls where you can get stuck. The design of the game (scenario, progression, mechanics) in general is pretty obtuse. In particular, the story/progression triggers are unmarked and somewhat obscure, and finding them is made even more annoying from the control scheme. The author is very stubborn on a no-saving mechanic in particular, which makes no sense at all with the rest of the design, because the game is: -Unforgiving, as each and every enemy can instakill you. -Always the same, with no content change between different runs, not justifying having to restart from scratch over and over. Not to mention, the first sequence is extremely annoying to do over and over. -As stated above, imprecise in controls and inaccurate tiling in a game where the main survival mechanic is avoiding visible enemies -Expressed in dialogues that you really don't want to experience twice -Very vague in what exactly triggered you being where you were, so if you do even something seemingly menial (or that you might have forgotten at that point) differently, you might get stuck.  Basically, this isn't a game with one or two glaring flaws: it's a trip to unfun land that you're forced to relive over and over while fighting with the UI. I don't only think it's not worth your money, even if it was free, I think it wouldn't be worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashed 3 times trying to leave the 1st room, when I finally escaped the first room I went north, entered somebody's house, played genetalia maze simulator, then left his house and crashed  10/69 would crash into genetalia again",
            "review_score": "-1"
        },
        {
            "review_text": "This game brought my GPA down",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty dire. My playtime consisted for 90% of rebooting the game because my mouse stopped working. During the little time I was actually playing all I could do was the unintuitive tutorial and the first single minute of the real game.   -The dialogues are horribly written, reminiscent of what swearing twelve-year olds would say if they were having a school play or something.   -The click-to-go-somewhere movement system is unhelpful when you are trying to run away from zombies and it is very weird how the game makes you hold shift to sprint when there is no punishment for sprinting and you have unlimited sprint. If there is no reason not to sprint I'll be sprinting all the time, so why don't you make sprinting default?  -During the tutorial I was already able to walk into a building, so it was already glitchy from the word go.  -The menu is weird and unintuitive. You can only use the mouse and when you open the options menu you can only use the keyboard for some reason. Then in that menu, the game calls the option to switch between fullscreen and windowed mode the ' resolution' option. I think they need to look again what that word means.  -The audio, while not bad in it's own right, is obnoxiously loud when you boot up the game.  -You can't alt-tab out of the game.  -Within two minutes of starting the tutorial they wheel out Jim Sterling for no reason whatsoever except perhaps to please his fans. The guy pops up out of nowhere and is about as out of place as Justin Bieber in the men's bathroom.  -The title is probably the most unimaginative one I've seen in my entire life. Not a relevant point but just something I wanted to say.  - By far the most important point: the game's mouse just stops working after a certain amount of time or doesn't even work from the word go. When that happens you can't click anything anymore and as everything is mouse-controlled you have to reboot it.   -The menu buttons are so not-button like that the button that starts the actual game looks like the title of the menu page you are currently on. They have to make that look button-like.  Avoid this like a zombie, because it eats your money alive.",
            "review_score": "-1"
        },
        {
            "review_text": "I must suck, but I couldn't find the pistol to get out of the room. Just gave up.",
            "review_score": "-1"
        },
        {
            "review_text": "Go to Store (Featured), Click on Games, Narrow by Feature (Steam Trading Cards), Relevance (Lowest Price). Then skip to Page 9 or 10, until you find the .50 - $1.00 games. Add them to your Wishlist, games that are a dollar can go on sale and you may be able to purchase for cheap! A game at .50 may give you that value back in trading cards. Search and Install 'Idle Master' which will run your games even without the game being installed.  I may or may not ever play this game, but some games I have installed and messed around with on a rainy day! @ .50-$1.00 it's hard not to recommend!",
            "review_score": "1"
        },
        {
            "review_text": "So far the game is alright. Still needs some tweeking here and there. A few things about the game:  -Pretty easy to run away from zombies (they are pretty slow) -would be nice if the setting would save once you exit the game. I put the game in window mode and it goes back to full screen once you restart the game. -save houses/bases would be nice. I know its a perma death game, but I hate to pull the old nintendo game break/pause trick and leave the game running and my computer on.  -A few walls you can walk though. (One is in the place you start and I found another one in the alleyway, near the bulding with the ladder.  So far its a pretty decent game. tweek a few things , add a save house/base and I think some more people might go for it.",
            "review_score": "1"
        },
        {
            "review_text": "Cool concept but the game plays so slow. You can't run, you can't skip dialogue, and there's permadeath. Permadeath works in some games, but nah, not in this. It's like watching paint dry every time you start over. This game isn't rogue like(it's not different every time you play).  Idk, for a sale price of 15 cents it was worth a shot but I'm not gonna watch paint dry for 15 cents.  Would benefit from a save system.",
            "review_score": "-1"
        },
        {
            "review_text": "A hard to understand game, that got me pretty stuck at the first stage of the game.  The story doesn't make sense, why the girl wants so much to go to the outside world? And why is the guy so insistent of not letting her go, even though he has, apparently, a lot of weapon that, for some reason, he broke. Why go to the outside world? The girl looks like a teenager, by her actions.  Anyway, the graphics are ok, since it is one of those rpgmakerlike games, but the game doesn't achieve much. It is not really interesting at all, although cheap.  If you want to try it, go at your risk, but wait for a good sale. Otherwise, don't touch this.",
            "review_score": "-1"
        },
        {
            "review_text": "WTH, that guy must smoke alot of crack... just i got nerve collaps in this game F*CK YOU............................ IDIOT the worst spended 25 minutes of my time.. but it's good",
            "review_score": "1"
        },
        {
            "review_text": "it's a good game can't say much of a game that i bought for just 15 cents. it has some bugs but it doesn't bother me",
            "review_score": "1"
        }
    ]
}