{
    "app_id": 403700,
    "name": "Zero Punctuation: Hatfall - Hatters Gonna Hat Edition",
    "release_date": "2015-11-20",
    "developer": [
        "Ben 'Yahtzee' Croshaw",
        "Collected Worlds"
    ],
    "publisher": [
        "Addicting Games",
        "Defy Media, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Memes",
        "Comedy"
    ],
    "achievements": 18,
    "positive_ratings": 218,
    "negative_ratings": 33,
    "price": 3.99,
    "description": "HATFALL is a high-energy game of skill and hat-wearing born from Zero Punctuation, the hit online video series from The Escapist, created by the man behind ZP, Ben 'Yahtzee' Croshaw.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/403700/header.jpg?t=1448033332",
    "minimum_requirements": "OS: Microsoft速 Windows速 XP / Vista / 7 / 8 / 10 Processor: 1.4GHz processor Memory: 2 GB RAM Graphics: DirectX 8-compatible graphics card with at least 512MB of video memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 100 MB available space Additional Notes: Microsoft Xbox 360 Controller or Direct Input compatible controller",
    "recommended_requirements": "OS: Microsoft速 Windows速  7 / 8 / 10 Processor: 1.8GHz processor or faster Memory: 4 GB RAM Graphics: DirectX 9-compatible graphics card with at least 1024MB of video memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 100 MB available space Additional Notes: Microsoft Xbox 360 Controller or Direct Input compatible controller",
    "reviews": [
        {
            "review_text": "Simple as gameplay. You move your character left and right with the arrow keys, stand in a shadow and catch the hat (or fridge) on your head. Eventually you'll find minigames in between levels that change the game up a bit, stockpile hats that you can use to spend on 'skins' for characters and acquire gifts like a swear jar that throws obscenities at your face everytime you catch a hat.  Like I said, simple as. Its got some replayability.  7/10 its aight.",
            "review_score": "1"
        },
        {
            "review_text": "NO. They should change the review time from 5 minutes to 30 seconds just for this game. Thank you steam for refunds this game is surely worth one.",
            "review_score": "-1"
        },
        {
            "review_text": "Yahtzee Hats People die Its cheap  Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "Team Fortress 2 Simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "All of the hats. You'll ever love",
            "review_score": "1"
        },
        {
            "review_text": "This is the most realistic hat-putting-on simulator that is currently on the market. The depth of gameplay, the true graphical fidelity and amazing soundtrack put together probably one of the best video games of this century.",
            "review_score": "1"
        },
        {
            "review_text": "Such a sick game!",
            "review_score": "1"
        },
        {
            "review_text": "This game gave me a genius level of intelligence and endowed me with the power fo flight.  eleventy/ten",
            "review_score": "1"
        },
        {
            "review_text": "This game is trash. i just want the emote and the wallpaper. you know the ones.",
            "review_score": "-1"
        },
        {
            "review_text": "Just...where do I begin with this game? First of all, this game has graphics so superior that I'm surprised my rig could even handle it. And then the story? GAH! I thought I loved BioShock's story, but...wow. Just...wow. I was not expecting such a marvelous story from this game. The part where Jake Starbone realizes the true whereabouts of Princess Hamflute - WOW! - never before have I seen such characterization in a video game character. It was like he was truly a human being standing in front of me! Wow. Just...wow. Though, I must admit this rather shyly, I do still think my favorite part was when that local ponce - oh, what a charming fellow, lost his hat. . . . Oh, and the time I got squashed by a flying car and jumped backward a good half foot.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games ever 10/10. +Good for the price +Simple gameplay +Jokes and minigames are mildly funny +It has good music +Good unlocks that lead to aforementioned good minigames  -Music gets a bit repetetive after a while -Not enough hat-kun",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the most accurate hat-catching, refrigerator-dodging, life-simulating simulator ever made.",
            "review_score": "1"
        },
        {
            "review_text": "It's really dumb, you guys. I'm not even kidding.  At least you can get a refund now. I predict you will.",
            "review_score": "-1"
        },
        {
            "review_text": "Well... it's like 'Fallout 4' except this game doesn't like you at all and wants to kick the s*** out of you in every possible way. ... To be honest, there's no crafting system but better dialogs.  Fair enough...",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to give Yahtzee some money :^) I got a fun game for it!  Though this game is a steam port of a free flash game online, it runs far better on small machines",
            "review_score": "1"
        },
        {
            "review_text": "Why are you not wearing a hat?",
            "review_score": "1"
        },
        {
            "review_text": "Bought this for the Dirt Console Pesant background, didn't get it so ended up paying for it off the market place, decen't little game. Not a big fan of Zero Punctuation but not the worst thing I've spent money on.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, silly, and full of gaming references. Will run on a broken toaster, and is an amazing game for when you have a really boring lecture in class.",
            "review_score": "1"
        },
        {
            "review_text": "A short video game that you'll like IF you are into dry, british humor or you'd like to support Yathzee and his wierdness. :P",
            "review_score": "1"
        },
        {
            "review_text": "The best hat simulator i've ever seen 20/10",
            "review_score": "1"
        },
        {
            "review_text": "i bought a golden desk it got stolen i bought another one it got stolen again 10/10 would waste time again",
            "review_score": "1"
        }
    ]
}