{
    "app_id": 403950,
    "name": "Conquest of Elysium 4",
    "release_date": "2015-11-16",
    "developer": [
        "Illwinter Game Design"
    ],
    "publisher": [
        "Illwinter Game Design"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Turn-Based"
    ],
    "achievements": 0,
    "positive_ratings": 287,
    "negative_ratings": 29,
    "price": 18.99,
    "description": "Conquest of Elysium 4 is a quick turn based fantasy strategy game with a touch of rogue-like. The game might appear simple at first, but it is full of depth, details and of course monsters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/403950/header.jpg?t=1515144509",
    "minimum_requirements": "OS: XP, Vista, win 8 or later Processor: 1 GHz Memory: 1 GB RAM Graphics: OpenGL Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I seriously can't recommend this game enough. It has its quirks (no control in combat), but the replay is huge. All the classes actually do play differently! The 'Voice of El' collects relics from settlements and uses them to increase his holy bonus and gain (random) units from El in his settlements. The more 'seals' broken (7 in total for the world), the closer the world gets to El and the more powerful units you get for free. You can also spend money to convert settlements to your faith. Even if an enemy recaptures it, it'll still pay you money every year (in a lump sum)!   Then there are the dwarves. They lack any 'standard' recruitment, but gain a free dwarf every turn birthed from your Dvala (whcih can't leave its mountain home). You then spend iron to upgrade your workers. You gain less gold from settlements, but more iron from mines. Mines also yield gems to power rituals or further upgrae your troops. The mountain-mines also count as citadels (recruitment centers) that you can install more Dvala's into (for more free troops).   The point is that the El faction will fight tooth and nail for large settlements to fuel their relic addiction, and while they need mines for higher-tier troops, its not critical for them. Dwarves on the other hand, can't even collect relics. They also get barely any gold from settlements but can't get enough iron/gems for upgrades. Thus, its fairly typical for a dwarf to ignore settlements and only take them away from other players. Even if they capture a city, they can't recruit units out of it for defense (other than sporadic, expensive, mercenary options). Nor can they upgrade their base workers in one. So two factions that can' be bothered with the others' resource, and have their own mechanics for progress and expansion. These are just two of the ~20 factions found in the game, too!   About the combat though... while there is no real control, units still move about the grid and have varying ranges on their attacks. They also try to fit in various ranks (front/middle/rear). So you can have a cluster of rear-castesr that would otherwisse be secure behind two ranks of infantry. However, if you think a few powerful frontliners are all you need, superior enemies can flank around them and gank your casters- this is particularly true for swarms of fast wolves. Also, you can have infrantry ranks so thick that your archers can't fire over them, or casters that kill your own units with your spells! For the latter you have to turn those off, or only use resistant troops in the front ranks. However, light frost damage ove the battlefield can be worth it if your enemy has tons of 3-4 hp fodder (goblins)... Your troops survive, they get decimated. On the world map, they can have different move speeds and movement types. So like in Age of Wonders, you can put together an amphibous army to attack from the coast-line, or a mountain-moving army able to quickly hit/run through a mountain range. Also, some units are slow and others are fast. So you can keep a quick mounted unit to scout/snatch locations from an enemy while your slow army makes the most efficient beeline to whatever the scouts found. There is actually quite a bit of strategy involved in combat planning still... I really can't recommend this game enough to TBS fans!",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun, light 4x-ish game that fills an unusual niche in strategy gaming.  The Pros and Cons are often the same thing.   For example, combat is simple and automated, but there is a point to how you create your stacks. Some troops have better synergy than others. con - lack of control, pro - no micromanagement. Which matters more to you is pretty subjective depending on what you're looking to get out of the game.  It's random and you can get terrible starting positions or great ones. You'll get key troop offers when you need them or maybe not. If that happened in a 40 hour Civ game, it'd be annoying. In a few hour Civ-lite, it just means some runs are more challenging than others.  It's not really a rogue-like, but it has that feel to it. Quick turns, very limited numbers of controllable units (often 1-2 stacks for much of the early game). Lots of random independent critters to kill. You'll die frequently :)  It fills a pretty uncommon slot in strategy games. If you've ever wanted to play a game of Civ in 1/20th of the time, Conquest of Elysium scratches that itch.",
            "review_score": "1"
        },
        {
            "review_text": "Let's get something out of the way. The game looks ugly to the outsider. But let me reassure you –&nbsp;when you're ravaging the countryside with your necromancer's army of the undead or laying siege to coastal towns so that your demented priest can summon Cthulu-inspired monsters, the graphics won't matter one bit.   This is one of the rare games that challenges the imagination as much as it does your skill. Though the game is addictive and complex, it really shines when you allow yourself to get sucked into its universe –&nbsp;when you assign histories and personalities to the bizarre commanders and heroes you recruit to lead your armies. When you visualize the fear of your enemies as you approach them with your army of flame-breathing demons.   Too many games hold your hand and get in the way of letting your imagination run wild. Great graphics and 1,000-page RPG scripts are an example of this. It's hard to imagine your own heroes when you can see the individual specks of beard stubble rendered on your character in 1080p. This game trades those luxuries for some rich lore, deep gameplay, and graphics that are just good enough so as to not be distracting (as Dwarf Fortress is for me).   Play it, and get lost.",
            "review_score": "1"
        },
        {
            "review_text": "Illwinter clunky interface? Check. Illwinter monsters? Check. COE 2's great deal of roguelike unfairness? Check. Even better music than COE 3? Check. More and more, more than COE 3 of that COE Gaming Goodness? Check.  Once again, Illwinter has created a game that, once one gets past the interface (which is 100% usable, don't get me wrong), will find a game of great detail and depth.  Just expect that roguelike unfairness...",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this game for over a hundred hours on a pirated version until i bought this game. And man is this game worth it.  The big selling point for me is that as many of the other reviewers have said is that the twenty races play so diffrent from eachother. Both in what they want and in how they get their armies.  If you can get over the mediocre graphics this game is a easy buy.",
            "review_score": "1"
        },
        {
            "review_text": "I opened up a gateway to hell deep in enemy territory in order to overwhelm them. The plan worked, except that the demons ended up overtaking me before my enemy, the Senator Tantalus, who then won the game. After I had opened a portal to Inferno, I had decided to make a foray into hell, searching for anything useful. While this might seem like a mistake at first, it actually kept me alive, as the demonic forces were too busy ravaging Elysium to bother with the minor foothold I kept in hell. Eventually, after my tellurian citadels were overthrown by rampaging demon lords, I decided to bring my demonic army back to Elysium and shut the gateway to hell. I succeeded in doing this, but hell's legions were persistent, and kept reopening the gates. Eventually, they conquered my last city, far to the south of my original citadel (long since overrun by a heliphagus and his army), which was meant to be the point where I would rebuild my strength, given its proximity to the gateway to hell. Thus, I lost. My enemy, a relic of the empire's height, continued to hold out against the demons after I was wiped out, and thus was declared the victor. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A strategy game that blows you mind with it's depth of strategy and possiblity.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! User interface is a little clunky but the depth of the gameplay and the vairety of units is amazing. Very addictive!",
            "review_score": "1"
        },
        {
            "review_text": "CoE4 has been piquing my interest for the longest time because of all the love for it and Illwinter games in general. To tell the truth I didn't think I'd like it because glancing over the manual gave me the impression of over complexity. And let's play videos, for some reson, don't do the game justice. Also reviews by prestigious reviewers all say that, athough CoE4 is simplified and streamlined compared to Dominions, the game is still very hard (to win, not to play).   Well I had to give it a try and I picked it up expecting to be bored, confused, irritated, and to get a refund before the 2-hour limit. But as I was advised in the Steam forums, CoE4 game is not too hard to pick up, but to play well takes a lot of time and effort. As for the manual...What I mistook for complexity was instead explanations of the depth and finer points of the game. Listening to the advice in the forum, I read the parts about movement, recruitment and commanders. That got me started quickly. Then in between playing of a few short sessions, I read over the other parts to answer my questions and to learn the finer points.  Well my 2 hours are up and that is all it took for me to fall in loe with CoE4. This is definitely a keeper. Now I know why CoE4 is so valued by serious gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Great tweaks to make this more interesting than the already great Conquest of Elysium 3. However, I'm experiencing bugs where certain leader units and their stacks become immobilized. This has happened for Demonologist and Voice of El. Does anyone else have this problem? I'm on a Mac. Once it's fixed I'll give the thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "I have played Illwinter games i.e. COE 3 Dominions 3/4 for hundreds if not thousands of hours. This game is a great incremental improvement over COE 3. its a blast Random killer wild life. swim off the edge of the map into the void. go insane get blasted apart by a horror from beyond. Good fun. WIsh they would implement some form of Item crafting, my one beef with the game.",
            "review_score": "1"
        },
        {
            "review_text": "Started as a witch, and was roaming around the forest with my main army. Left 1 witch and 2 spearman in my tower and got attacked by a giant crab. Crab got charmed and joined my army. Killing enemies like a boss.   10/10 would charm giant crabs again    Honestly.. some starting points are sometimes difficult, but it's really playworthy!  ",
            "review_score": "1"
        },
        {
            "review_text": "Hero arrived your village. Orderd hero to attack a snake. Hero died of snake vemon. 10/10 will let hero attack snake again.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game from a tiny developer. Greatly improves on COE3, but is an evolution not a remake. There's nothing else like it out there. I highly recommend for fans of turn based strategy.   Pros: -Many unique classes to play that greatly alter your play style -Doesn't hold your hand. Survival is a struggle and victory is an accomplishment.  -UI is much improved from COE3.  -Maps are much more coherent than COE3 - geography is more clustered into regions than in COE3 (where terrain seemed totally random).  -Awesome variety of interesting units  -Nice music, it's not ugly (just not pretty) -Combat is better in general, particularly sieges  Some annoyances remain: -Your towns still get conquered by 2 damn wandering snakes or a deer. I really wish they would come with a small militia to defend against such annoyances -Still no building of structures.  -I would really like to be able to build roads so I could more quickly retake my town that was conquered by the 2 snakes -This is mroe a refinement from COE 3, and not a huge departure.  -Only adds a few more classes than COE 3 had.  -More ritual spells would be nice.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played CoE3 already, this game is basically an upgrade. Worth the price for an upgrade? Well, if you played the crap out of the last one, you'll probably play the crap out of this one too. The additions and upgrades are, in my opinion, definitely worth it, although I wish the game could have been a little cheaper. Same great classes as last game, and even a couple new ones, which are interesting, but not really insanely awesome either. First differences you'll notice are the changes to the battle system. It's much more fluid and interesting to watch. Also, you now have a little bit more control over your characters' development throughout the game. Libraries (as far as I can tell) can be used forever, so as long as you have the gold, you can just keep learning new spells. They can also be used to upgrade those cool mercenary wizard characters that are recruitable from time to time.  There are also different worlds you can visit, like hades, inferno, some elemental planes, and probably more that I haven't cared to remember, each with their own landscapes and towns and citadels to recruit from. Overall a very fun time. I was addicted to 3, and now I'm addicted to 4, and they added and changed most of the things that I was hoping they'd change in 3.  Multiplayer works, but it's another game that seems to make it a pain in the ♥♥♥ to set up. It's basically a direct connect type of game, and if you don't like dealing with port forwarding, you're going to have to use something like hamachi. Hosting requires you to start another instance of the game, which can be tricky in steam, but doable if you just run the .exe from the game folders. I haven't played too much multi yet, but the only downside I've encountered are the continuous restarts from you or your friend dying early.   If you haven't played CoE3 or really any of Illwinter's games, I can only really describe it as a game where you spend the majority of your time finding ways to put cool new monsters or soldiers in your army, and then send them into what are basically live action autocalc battles. Might sound lame if you are into games where you play a more active role, like the total war franchise, but the fact that you have no control over it once the battle begins adds to the roguelike quality of the game. Your favorite character will often die and leave their apprentice. Sometimes your giant army killing troll king will be cursed within the first few rounds of play, and have that curse for the rest of the game. Even though the game offers less freedom of choice in battles, it still has so much variety that you won't even care.  If you want a game that will run on pretty much anything and be capable of stealing hours and hours of your life from you, then I highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "surprisingly in depth and incredibly replayable, every class plays differently, many hours of entertainment, solid 10/10, hope they either continue updating (so far so good, theyre very good at that) or release no 5 eventually, id buy it straight away.",
            "review_score": "1"
        },
        {
            "review_text": "Old review (thumbed up):  If you searched Steam for Master of Magic, and somehow wound up here, buy this game. It's as close as you're going to get, and that is very high praise.  Update 27 Feb 2016 (thumbed down):   Having sunk a bunch more time into this (offline mode, I probably have fifty hours offline), I'm ready to thumb it down. It's tedious. MoM was never tedious to me. There is a non-stop barrage of deer, snakes, wild life, and wandering nobodies that continually take your farms, forests, and anything else you could have possibly laid claim to. For no good reason. Two wandering deer do not chase people from their farm.   It's a non-stop game of recapture. You leave three guys to defend the farm? Four bears show up and kill them. If that's not bad enough, there are actual random factions and events that pop up for the sole purpose of spitting random extra monsters across your lands.  If you start a game with five AI, three of them will be killed by neutral 'armies' (deer) in the first dozen turns or so. As far as I can tell, the only difference you get for ramping the AI difficulty up is that they start with bigger armies (and probably get cheaty amounts of resources per turn).  I assume I'm just bad at the game still, but there's no excuse for the amount of rubbish that exists just to force you to keep recapturing the same thing over and over.",
            "review_score": "-1"
        }
    ]
}