{
    "app_id": 403900,
    "name": "Clergy Splode",
    "release_date": "2015-09-17",
    "developer": [
        "PiGravity"
    ],
    "publisher": [
        "Back To Basics Gaming"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Arcade"
    ],
    "achievements": 0,
    "positive_ratings": 197,
    "negative_ratings": 252,
    "price": 0.79,
    "description": "In the life of every Clergy Priest, there comes a moment when it turns out that there is no other solution than.... to just drop bombs everywhere and blow everything up... Clergy Splode is a fast paced, casual-arcade game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/403900/header.jpg?t=1447378111",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/8 Processor: 1.6 GHz Memory: 128 MB RAM Graphics: DirectX 9.0 Compatible Storage: 200 MB available space Sound Card: DirectX 9.0 Compatible Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Yet another lazy mobile port. Resolution is locked at 1280 x 768. There are no rebindable keys, which if you are left handed like me, makes the game pretty much unplayable past the first few levels. Plus the game suffers from some of the worst screen tearing issues I have seen in a non-idtech game. You'd be much better off just playing this on mobile since no effort was made to make the port PC friendly.",
            "review_score": "-1"
        },
        {
            "review_text": "got the game for 11p idled for cards sold the cards for a total of 12p cheeky profit 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game for cards to make about 7 cents when it was on sale. Game cannot be played as it is Out of Range for my monitor. Changing config files has no effect. Forcing window mode crashes it. Forcing scren resolution crashes it. There are no options to blindly fumble through to change it to get it to work. Black Screen Simulator the game. Didn't even bother with cards. Refund requested.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so bad. Just so bad, i only bought it to send to my freind as a troll girft",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "the levels take too long to finish the priest walks as fast as a snail only bought it for the cards and idk if i'm gonna make proffit out of it.   *prays to clergy priest* please let me make money amen",
            "review_score": "-1"
        },
        {
            "review_text": "Ugly and boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game reminds me of cancer.",
            "review_score": "-1"
        },
        {
            "review_text": "Made profit on cards, fun, addictive game. Worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Join the adventure of Clergy Priest that looks like a Jew for only 0.99€",
            "review_score": "1"
        },
        {
            "review_text": "Get the Markiplier version KappaRoss",
            "review_score": "1"
        }
    ]
}