{
    "app_id": 404080,
    "name": "Murder",
    "release_date": "2015-10-21",
    "developer": [
        "Peter Moorhead"
    ],
    "publisher": [
        "CDP"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Cyberpunk"
    ],
    "achievements": 0,
    "positive_ratings": 132,
    "negative_ratings": 160,
    "price": 0.79,
    "description": "From the designer and artists behind &quot;Stranded&quot; comes a short story about the intersection of morality and sentience, in a cyberpunk future where both have become commodities.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/404080/header.jpg?t=1506028195",
    "minimum_requirements": "OS: Windows XP and Above Processor: Intel or AMD Dual Core x86 or x64 Graphics: DirectX 9 or above, Minimum 1 GB Memory DirectX: Version 9.0 Storage: 750 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "OK, first things first. When Murder says it's 'short', it doesn't mean '4 hours, maybe 3'. The game is 20 minutes long at the longest.  That being said, it's a  gorgeous  game. Full hand-set pixel-art scenes. This is a $3 game with  full voice acting . There's even a secret ending!  Think of this as a music video or one of those 15-minute sci-fi movies that sometimes crop up from a crew of talented cinema students. It's not a big game, but it's a pretty game, and certainly an unique game.",
            "review_score": "1"
        },
        {
            "review_text": "Great visual!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely hardworking developer and it shows true in his work. Murder is a beautifully crafted, visually stunning game with obvious care and attention to detail jumping out from the screen. This is an experience intended to be revisited and appreciated again and again. Atmospherically this game is second to none. Albeit a short experience (25 minutes for me personally) this is in no way a hindrance, considering the extremely low price. Murder delivers a thoughtful and stylised experience that will stay with the player and most definately will be the subject of reflection and discussion after playing.  Murder is most definately a testament to the idea that video games are an artform.   Highly reccomended by myself. An experience not to be missed out on.  EDIT: Trigger Warning - Friend of the Dev",
            "review_score": "1"
        },
        {
            "review_text": "An interesting mini-adventure game. The engine and style, and the story, have a lot of potential, but this is way too short and lacking in choices for me to give a strong recommendation. I hope the story is continued in further chapters, though, as the game does have promise.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this 'game'. However, the 'game' was extremely short. No more than 25-30 minutes tops, and that's interacting with everything you can. Would love more. The soundtrack and visuals where top notch. The voice acting was impressive to say the least. The overall vibe was on point for a future noir title. I'ld say give it a shot...but you may be dissapointed by the time the credits role. Not for quality's sake but for simple fact that a good thing ended too soon. Tip of the hat to the creator.",
            "review_score": "1"
        },
        {
            "review_text": "i just finished it and im seriously amazed how this game shook me  i personaly think this game is very good in all kinds of way music graphics and the dylema showes in the game and this game sure will stay in my heart as a great expirence",
            "review_score": "1"
        },
        {
            "review_text": "This game is very short, but that's not necessarily a bad thing. The game has some of the best pixel art I've seen in a while and the sound design is superb. The voice acting is solid overall but some of the police agents could have been better. People aren't wrong when they say you can run through this in about 30 minutes, but there's also a few side things you could miss if you just cruise through it. For example, in your apartment building there is a droid that has fallen into disrepair and if you talk to it you can learn a pretty fascinating backstory.   My biggest complaint would be how the game handles fullscreen. It doesn't render the pixel graphics to nearest neighbor, so in full screen it looks pretty blurred out. There's no reason not to pick this game up for the price but I strongly recommend playing in windowed mode.",
            "review_score": "1"
        },
        {
            "review_text": "A tiny little point and click game with amazing pixel art. The visual aspect of the game was the reason I bought it. The voiceacting was also on point.  Unfortunatly this isn't enough to save the game. The story had some potential as a prologue to something bigger. I was rather shocked when the game ended ten minutes in. The sound effect of the robot in the corridor was awful, and the soundscape/music made some awful glitching noises in both my speakers and headphones.",
            "review_score": "-1"
        },
        {
            "review_text": "While the game isn't badly made, it's way too short so there is no investment in the story.   There are other games such as The Fall or SOMA that tackle the same issues but those games actually invest you in them enough to care. While it's hard to compare a $2.50 game with these, it's plain to see that this format of game just doesn't work in such a small installment.  I wouldn't really recommend it but it is only $2.50.",
            "review_score": "-1"
        },
        {
            "review_text": "It's apparently trying to be Asimov's 'Robot Dreams,' but only really manages to put the 'short' in 'short story.'",
            "review_score": "-1"
        },
        {
            "review_text": "Murder seemed like an interesting story, yes it did but it was so cliche´ and underwhelming. I feel like a threw my money away, this 'whatever' is so bland and unoriginal. The art was ok but it felt wasted.",
            "review_score": "-1"
        },
        {
            "review_text": "I typically love cyberpunk stories, specially about advanced AI, and I got excited by the trailer and its nice pixel graphics and effects. But I was overly disappointed by the short length and lacking story.  The same ~6 different screens shown in the trailer is all there is in the entire game. You visit them twice by basically just walking from one to another.. you could finish the game in ~15 minutes if the character didn't walk so slow.  The story doesn't tell much.. while it's nice for it to be voiced there's so little to it and so vague... I have the feeling the game is simply incomplete. As if they had run out of funds and couldn't afford any more lines so they had to keep it short.  Even as cheap as it is, I cannot recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Great visuals/theme, enjoyed the soundtrack (save the rap).  Perhaps if there was more substance I could it say was pretty decent for such a brief outing.  At the same time however, the you're also paying the developer to call you an entitled prick and spit on your feet (if you get the 'good' ending).",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money. The game is literally what you see in the trailer -- nothing more, nothing less. The game is less than 15 minutes of 'gameplay' if you can call it that, and the story, well, isn't a story. There's no beginning, middle, or end -- it's a bunch of pixel art strung together with animation, click targets, and really bad voice acting.  Don't bother. Seriously.",
            "review_score": "-1"
        },
        {
            "review_text": "The visuals are stunning, the music is great but the game overall... not so.  The game is around 15 minutes long. Does this necesarry have to be a bad thing? Not really, if there is a smart and valid point the game and the creator tries to get across. In 'Murder''s case, there is nothing, there is no deep twist, no message, no interresting topics, it's just a messy unfocused convolute.  It seems like the creator didn't understand the topics he wanted to talk about nor did he bother do go into any detail. The most obvious cyberpunk tropes are smashed into the script and are reduced to 1 - 2 sentences with implications lead ing to nowhere.  It tries so hard to be smart that it falls on it's face when it comes to basic character development and writing. Dialogues are very unnatural and cliche, the games scene changes have no natural pacing and it all ends with a forced 'Stanley Parable' twist in that feels completely out of place.  It's really a shame, because the audiovisual aesthetic feel absolutely wasted on 'Murder'.",
            "review_score": "-1"
        },
        {
            "review_text": "+ Great artstyle and visuals + Great soundtrack  - 30 minutes long (And that is if you chose to do everything, otherwise it would be half the time) - A story that ends just as it starts (seriously it's like someone took the first and last page of a story book and stuck them together) - Some Dialog is butchered by the games voice actors or grammatically incorrect  Final Judjement: Buy it when it is on sale, I reccomend 50% off",
            "review_score": "-1"
        }
    ]
}