{
    "app_id": 40400,
    "name": "AI War: Fleet Command",
    "release_date": "2009-10-21",
    "developer": [
        "Arcen Games, LLC"
    ],
    "publisher": [
        "Arcen Games, LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Space"
    ],
    "achievements": 322,
    "positive_ratings": 1109,
    "negative_ratings": 205,
    "price": 6.99,
    "description": "&quot;You are outgunned. You are massively outnumbered. You must win.&quot; These are your orders. Humanity has already fought its war against the machines -- and lost. AI death squads stand watch over every planet and every wormhole, the few remaining human settlements are held captive in orbiting bubbles, and the AIs have turned their...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/40400/header.jpg?t=1546963973",
    "minimum_requirements": "OS: Windows XP SP2 or later  Processor: 1.6Ghz CPU (2.4 Ghz recommended, Dual Core strongly recommended for Host) Memory: 2 GB RAM Graphics: Graphics card must support 1024x1024 textures (most 32MB and up graphics cards do), 1024x768 or greater (32 bit color recommended) Hard Drive: 300MB Multiplayer: Broadband Internet Connection or LAN required for multiplayer.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "For me, it’s a rare thing indeed for a game to move from total obscurity to a fixed place on my hard drive in the course of a handful of days. Admittedly, I was less-than-enthused as I first started playing this little gem from Arcen Games. I was thoroughly prepared to slog through yet another space-based RTS, and be on way to bigger and better titles. Then, slowly, I began uncovering a depth of play that I just wasn’t expecting in a freshman game from a tiny indie studio. After a few more hours, I realized that I was not only having a blast with my initial runs through the game, I was planning many additional excursions even after my review was written. Although not for the faint of heart, AI Wars: Fleet Command is a surprising, delightful, and thoroughly engrossing RTS title.   AI Wars is just brimming with innovative twists on the 4X-style RTS. First up: regardless of the number of players, from the solo outing to an eight-player mash-up, AI Wars is always Human vs. AI. At first blush, this may sound like a Bad Thing, but it works quite well. Due to this co-op only setting, Arcen dodged a huge problem with many RTS games: the need for balancing several different factions.   Next up is the AI itself. In a very cool take on enemy behavior, the AI advances in difficulty and aggressiveness in direct proportion to the amount of territory the human teams take. Destroying key AI structures increases the “AI Progress” value, meaning a greater buildup of enemy forces, and a greater willingness for them to be used. The AIs themselves can be set from several different flavors at the start of a game, giving players the chance to face turtling AI, highly aggressive ones, tech-mad researchers, or some combination of the mix. Just one little change in AI setting makes for a very different game.  Speaking of game setup, there are scads of options to choose from at the outset. Galaxy size and planet distribution choices are endless, with millions of possible combinations (and the ability to preserve the random seed for those who want to re-try a favorite map). AI style and aggressiveness, as mentioned above, greatly changes the challenge level of the game. In addition, there are several choices about player tech level, bonus units, and other small flavor changes.  The scope of AI Wars is staggering. Played over a series of planetary gravity wells connected by jump points, a typical game can have dozens of active battlefronts with literally thousands upon thousands of ships slugging it out. Thankfully, the control scheme is more than capable of handling the hordes. With just a few clicks, entire sweeping fleets can be sent across the galaxy. Typical RTS necessities, such as tech upgrades, resource management, and unit building, are likewise streamlined to allow players to spend much more time in big-picture decisions. The tech tree itself is rather small compared to other games of this type, but it fits well with the flow nonetheless.   The strategy for playing AI Wars is something truly unique. Due to the AI Progress aspect, it’s often not in players’ best interest to completely take over every planet. Those that take that approach will soon find themselves swamped with enemy forces, since the AI doesn’t have to play by the same resource-limited rules that the players do. Careful scouting of neighboring systems, following by surgical strikes and opportunistic lunges is the name of the game. Because of this, players are often spreading out across the galaxy in a piecemeal fashion, leaving enemy forces interspersed between the growing empire. Thus, players need to find that perfect balance between careful defensive turtling and selective offense. Adding additional human teammates increases the difficulty proportionally, so the challenge doesn’t fade with the increased number of allies.   AI Wars looks good, although I did take a little while to warm up to the almost old-school style. The ability to quickly zoom in and out over massive battlefields is impressive, as is the ability for the game to visually keep everything straight. I found the background music to also be surprisingly good, since it’s often something I either just overlook or soon disable in this sort of game. The controls are solid, although they did seem just a little clunky at first. After a bit of time, however, I soon had everything flowing smoothly in my quest for human dominance.   All told, AI Wars: Fleet Command is bound to be a delight to any fan of the heavier strategy titles. It’s an absolute bargain as well, and this title has the rumblings of a very strong, even if not terribly large, community support. I was pleasantly surprised by just about everything I saw in this game, and I would heartily suggest this for those wanting a meaty, unique galactic RTS romp. Although not for the faint of heart (or even the casual strategy gamer), AI Wars: Fleet Command is a surprising, delightful, and thoroughly engrossing RTS title.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games of the last years.  AI War: Fleet Command is a strategy game which you will love. Building your econemy, your ships (lots of ships; if you say, I'll attack with 400 ships, there are really 500 ships on the map...and you need them), creating your tactics and win against the AI...or lose. Sounds normal? This game has some more stuff than other games...or better, it is doing everything a bit different. It is relativ hard to get into the game. But after one, two, three houres of playing you get it (hotkeys, fight mechanics, etc. ). And than it gets really good.  The 'story' behind this fighting is, that AI populations have taken the world we know (or better the universe) and the human species has to recover and fight back. Every solarsystem is to capture, because the AI got everything, so you have to fight from the beginning. 'War is not fair' are the introducing words of that game. And that's true. The AI got reinforcement out of nowhere, but that's not a minus for the game, because that's how it works. You get better, the AI too, so get some friends and play it coop, it is much more fun to tell someone how unfair it is, that the AI is sending again 600 bombers to you homeworld ;) and it is impossible to beat the AI alone on higher difficulties.  For these who don't like micro-strategy, just take everything you have and click on the enemy. They have so many livepoints, that you have to concentrate you fire always on one ship of thair ships, so it's not that important which ship is where, just that it is in combat :). Or you have the option to play as a champion. Than you have no base, just one big ship which gain lvl and better weapons over time, so you have to care about nothing than your 'hero' (a little RPG in strategy).  But the other are right, be warned: This game is huge. You play normaly over 7 houres on one campain. If you play with friends on bigger maps, it can take over 20h, so be sure to have enougth time.  And...If you like soundtracks, buy it! Don't think about the game...this Music is epic, you can listen to it for hours and there are so beautiful songs between (AncientShadows, Cries of Zenith are my favorites ;) ) ...amazing...(with the expensions there are over 5.5h music)  So if you like space strategy games or really good musik buy that game...and on sale day like now (the holiday sale) it is nearly for free. (I would recommend to buy the expensions too (the collection))",
            "review_score": "1"
        },
        {
            "review_text": "AI War: Fleet Command (AIW), is an Asymmetrical 4X Tower Defense RTS. Which I know probably sounds very jumbled up so let me break that down a little more.  Asymmetrical: While you are playing AI Wars, the computer is playing something more akin to Risk.  4X: Pretty self explainatory it follows the 'eXplore, eXpand, eXploit, and eXterminate' style of gameplay.  Tower Defense: This is the one that threw me off it at first because I generally don't enjoy TD games, however, in AIW it is more a the defensive side of the game, in that you have a whole arsenal of turrets at your disposal to defend your planets with, while your RTS fleet is off doing offense. They are more akin to towers, and turrets from a traditional RTS like Starcraft or Warcraft.  RTS: It is a real time strategy, with a grand campaign feel for it. You have your more 'tactical' fighting at the planet level where you might be maneuvering your fleet to best deal with the AI, but on the Galaxy map that planet is only one of 80 in a normal size game (You can go as little as 10 planets, or as high as 120 I believe)  Story: The war for humanity is over, we lost... the AI has all but wiped humans off the face of the galaxy leaving only pockets left in the abyss before turning their attention to more pressing concerns. You play as one of those pockets, and using the AI's absent mindedness to begin rebuilding the human race, and take revenge. Assuming you can be sneaky enough to not draw the full ire of the AI before your plans go off.  Personal Take: I've dumped well over 100+ hours into this game over the time I've had it, which is a huge amount for me, however, a drop in the bucket to many of it's fans. This is a game where you start with 1 planet that you call home, everything else is owned by the AI (technically it is two AI, but they are a team). As such you have to be very strategic about how you move forward. If you just kill everything around you, you end up drawing attention to yourself in the form of AI Progress, which in turn causes the AI to send bigger, and stronger attacks against you. If you're playing anywhere near your skill level in the game, that can mean disaster for you. It's very much a game of learning how to push to what you need without necessarily steamrolling everything. The AI in the game is phenomenal, and hands down the best computer AI I've ever seen in any sort of RTS/Strategy game.   It does have it's downsides though as well... the biggest being that there is a pretty steep learning curve for the game. The tutorials do an excellent job teaching you the different aspects and controls of the game, but it is a lot to take in, even with just the base game and no extra fluff turned on. (It's grown a fair bit in the 7 years it has been out).   It's other drawback is that it is a hard game, a very hard game. This is mostly by design, as remember we've already lost the war, when you start the game, the AI already has 10k+ ships floating around in the galaxy and getting more as you play. There is a joke among the hardcore players (the 5-6k+ hours played folks) that winning on 10/10 (the hardest difficulty) is a bug, which it normally is. The developers for this game have spent the last 7 years essentially playing a PVP game against their player base of seeing how they exploit various AI missteps at 10/10 and then fixing those with the help of the players.   There is a demo on Steam if you want to get your feet wet first. (I love games that provide Demos) If you do enjoy it, or have enjoyed it in the past they announced a few days back that they are making a new one, and are currently running a kickstarter for it if you are interested. They are adding a bunch of new things to it, but the one I'm most looking forward to is the 3D graphics, and re-designed UI.",
            "review_score": "1"
        },
        {
            "review_text": "This game would be great if they introduced me into it in a way that made me want to play. Instead, even before getting to the tutorial, I am met with a screen full of options and game choices, with tutorials tucked away in the corner. If you decide to sit through the lengthly introductions, you may find yourself enjoying the game. I found the multi leveled view to be hard to adjust to when jumping right into the game, even with experience from other space RTS games.  If you want a space RTS that isn't like others, this could be your new favorite game. If you're looking for something to jump right into, look elsewhere! Time investment needed.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game, with a customizable play experiance and tactics that go from a shallow 'Wave on wave of 'splosions approach to deep, twenty-hours ahead strategy. The graphics are sometimes a bit simplistic, but you can get some beautiful visuals during intense fleet battles, and its performance footprint can get pretty small.  Best of all, though it has a LOT of expansions, you don't really need them to get the best of the game. They add new ships and side functions, sure, but every balance pass and gameplay tweak is applied to the base game, and it even gets some full out new content from time to time. I'd definately say pick this up, since if you like slower paced strategy games, some configuration of it is almost certain to be your cup of tea.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic, the level of depth and complexity is mindboggling and yet it wasn't a pain to learn. The UI is clear and effeicent and there are options to customize the game in almost any way you could imagine. Also a side story about why this developer deserves your money. They care. A whie ago my first laptop destroyed itself and unfortunatley my only saved copy of my activation code went with it (I know, hahahha backups right?). Not only was I able to get my code sent back to me but the head of Arcen Games himself, Chris, emailed me and sympathised about the laptop. A man running a business in a truly tough and cruel marketplace, went out of his way to say hello and treat one of his thousands of customers as a real person.  You know what? That says saomething. So yes, I recommend this game, all of thier games. Chris, if you see this: Thank you, the code worked and I am LOVING the game : )",
            "review_score": "1"
        },
        {
            "review_text": "The best grand strategy RTS I've ever encountered. Play this if you love strategy but hate micromanaging",
            "review_score": "1"
        },
        {
            "review_text": "A very complex RTS game. It's a great challange for your brain.",
            "review_score": "1"
        },
        {
            "review_text": "Difficulty wise, it's the Space 4X version of dark souls, but way harder.  It's the kind of incredible game a single person or small groups makes sometimes, where the learning curve is steep af, the market is a small niche and the difficulty is incredibly challenging, but for those who go through that and actually learn it, it becomes incredibly rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "When I first started playing it I absolutely hated it. Visually it's very ugly and unappealing, it's difficult to learn and when you do learn how to control it and learn the basics of how to play and make a little progress the enemy hits back unbelivably hard. I also happen to absolutely suck at the game. I bounced of it hard.  So why am I reccomending it? Because it's immensly fun once you get into it. This is mainly due to the AI. It's far more powerful than you at the start and for large chunks of the game. It also NEVER loses it's ability to hurt you badly and/or turn things around even when you're attacking it's homeworlds and secondly the AI feels like it's thinking and reacting to you.   The AI's response to you is based on what you've done to it and how long you've been playing, be to aggressive and try and conquer everything and it'll simply hit you with overwhelming force, it'll crush you with ease. Be far to passive and take to long and it'll eventually grind you down with it's relentless attacks that'll get stronger with time. You have to work out where to hit the AI where it'll do the most damage to it but where you can withstand the Ai's response to your actions.   It's a constant game of risk and reward against an AI that hits your weak spots intelligently but also sends a mega♥♥♥♥ton of ships steaming towards your main planet when you irritate it enough. It's fels like a game where tactics and strategy matter and also throws you in desperate situations. It feels great when you manage to start winning or even when you 'just' survive a massive AI fleet pushing through your territory only for you to barely beat it on your home planet. However, the learning curve is brutal, the AI is most of the time outright stronger and it will just destroy you, especially if you try and take every planet (though if you get the Light of the Spire DLC going the fallen spire route makes been more aggressive and expansive an option). You have to learn where to hit the AI and anticipate what kind of response it's going to give.  It's also different every time. Theres many differences in AI type, maps, ships, and the options you have make each campaign very different.  In the few hours I've had with it I've had the most tense and desperate battles I've had it any Grand Strategy or RTS game. It's incredibly easy to bounce very hard of the game in the early stages due to it's graphics, difficulty and learning curve. If you can get past that then it's a great game and I've never played anything quite like it.",
            "review_score": "1"
        },
        {
            "review_text": "Lose the tutorial.  RTS Roguelike.  10/10  EDIT:  Now I'm in my third game.  The first game is the tutorial, which I shamefully lost (I aborted the tutorial when those guys overran my homeworld though).  I played against two 7/7 AIs in my second game with all expansions enabled. Held for more than 2 hours, and during an exogalactic invasion 12+ starships rammed into my homeworld, while my troops and allied force were distracted by enemies elsewhere. I losed horribly and earned an achievement 'The First Loss'.  Still playing against two 7/7 AIs in my third game. I'm doing far better than I expected. I survived for more than 4 hours, held off a full round of (that is, four) exogalactic invasions, a cross-planet invasion, and countless Level-I and Level-II waves, while still having some space to breathe and launch some offensives. Every time I thought humanity was doomed, I survived. I think I will lose eventually, but in my next game I can probably do better.  I think the term 'RTS roguelike' precisely defines the game, because, like any roguelike games (such as ToME, NetHack, Dwarf Fortress, etc.), the learning curve is quite steep, the content is rich, the replayability is high (with totally different experiences between games), the opponents are unforgiving, and most of all, you will probably   die a lot  .  However, the game proceeds in real time. So the game play is very stressful, intense and exhausting. You will be analysing the situation all the time, closely watching the dynamics of the entire galaxy   all the time   to figure out opportunities, manage your crises, patch up vulnerabilities, and turn disadvantages into advantages, etc., until your brain cells were worn out. I tend to pause a lot to think of what I should do next.  As other reviewers noted, taking all the territories without selection would NEVER work, unlike in some of the other RTS games such as, say, Total War series (It's not that Total Wars are bad. It's that Total Wars care less about campaign, because their main selling point is real-time battlefield tactics in massive scale), because   the AIs can ALWAYS crush you if they want to  . You have to determine which planets should be controlled ASAP, which planets should better be left alone, and which planets should be weakened instead of controlled, until you turn the table and truly smash the AIs in their face.  If you like games such as Dwarf Fortress, you probably would also love this game. Buy it now. If you like to play roguelikes (and therefore don't mind losing, and weak graphics and audio etc), and you also like real-time strategy games. Give this game a try. Probably best to grab the entire expansion on sale.  Overall: 10/10 RTS roguelike 10/10 Skynet simulator in space 10/10 Would doom humanity by their own AIs again 10/10 Looking forward to the sequel",
            "review_score": "1"
        },
        {
            "review_text": "Not like other RTS games. More of a giant puzzle as you have to plan out not just how you will win battles, but what objectives you will take and how you will win the war.",
            "review_score": "1"
        },
        {
            "review_text": "'Welp I've got some time to kill might as well play a quick game of AI War' OH ♥♥♥♥ NOW IT'S LIKE 40 YEARS LATER AND YOU'VE GOT A SCRAGGLY-♥♥♥ BEARD AND 3 GROWN-♥♥♥ KIDS AND ONE OF EM'S A DOCTOR HOLY ♥♥♥♥♥, you gotta be able to INVEST some TIME into this crazy nasty-♥♥♥ game which you will NEVER ♥♥♥♥ING WIN because this ♥♥♥♥ will CHEW YOU UP AND ♥♥♥♥ YOU OUT like a mother♥♥♥♥ing 80-STORY-TALL TIME-VAMPIRE. There are A TRILLION MOTHER♥♥♥♥ING SHIPS and you will BUILD ALL THE SHIPS and then THROW ALL THE SHIPS AT A BRICK WALL and it is THE MOST ENTERTAINING ♥♥♥♥ ON STEAM AT THIS VERY MOMENT. It's a CRAZY GOOD STRATEGY GAME and it looks like ♥♥♥♥ because the devs don't know how to art, but NO ONE ♥♥♥♥ING CARES because ♥♥♥♥ YOU IT'S AWESOME.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR Great strategy game, sequal coming out next year set to be better if the graphics are a turnoff  I for one have always been a fan of almost any strategy game that spawns the creative interpretations of full length games in the reviews. Before I bought this game, I must have spent the best part of two hours trawling through the reviews for this game, reading all the wild and wonderful tales of players and their friends getting thoroughly trounced by the AI, despite their best efforts. When you take into account all of the expansion packs (which are regulary on sale along with the main game) and the way the game plays out, this game has the same kind of almost limitless possibility that you might expect from one of Paradox's games (though granted in a slightly different setting than their grand strategy titles). Definitely a game for co-op (I recommend Hamachi if you're trying for 'online' multiplayer as there is no built in system for non-LAN multiplayer) so you can die gloriously with your friends!  The one slight turn off is that the graphics haven't aged well, with the 2D sprites looking like something from pre-2000, but if you end up playing it anything like me, most of the game is spent zoomed out so far the units switch to icons, which is more than enough to work with. In fact, its to the point that I probably couldn't identify some ships up close! As of next year, this will probably become a moot point anyway as Arcen Games (the studio that made AI Wars) has just successfully gained funding via Kickstart for AI Wars 2 (Woo!) which is scheduled to have vastly improved graphics.  If you're not sure about it, there's a free demo that you can try before you commit to the full game (though its a bargain in most sales. I got the lot for like £4.00, expansions and all).",
            "review_score": "1"
        },
        {
            "review_text": "Love this game spent hours on youtube to learn this game and just in an hour fell in love with this game dev u did good i mean this game was made in 09 and is still great. one thing that sucks though is cant find a person to play multiplayer though.",
            "review_score": "1"
        },
        {
            "review_text": "(Reccomendation including the expansions).  Very good game with awesome AI opponents, on the hardest difficulty it even learns from you and counters your moves. Can be played with several friends together as well.  ",
            "review_score": "1"
        },
        {
            "review_text": "I really liked this game, but it is very deep. In 18 hours I managed to lose 1 game, and was maybe going to win a second. If you have the time and enjoy deep strategy games, this is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "-start game -build ships, defences and collect ressources -accidentaly ♥♥♥♥ off the AI -die within minutes  I r8 8/8 no h8, gr8 game hurts my head just thinking about all the multitasking... &lt;3 love it",
            "review_score": "1"
        },
        {
            "review_text": "It's like SHODAN and Allied Mastercomputer made babies before proceeding to near obliterate humanity.   You might want to buckle up for this one. They didn't make the main enemy in the story an AI for nothing.",
            "review_score": "1"
        },
        {
            "review_text": "Hard-core strategy. 4X + RTS + Tower defence. Challenging. 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "This game can seem very complicated on the outside, but it has amazing depth once you get into it. I can guarantee you'll never have the same experience twice. I was a AI programmer for a video game in a past life, and I can say the AI is very impressive and worth the price of admission alone.",
            "review_score": "1"
        },
        {
            "review_text": "It seems incredibly complicated at first, but then as you do the tutorials which only take about 30 minutes all together it becomes very understandable. The battles by themselves are quite good fun on their own, but the thing that really stands out is the amount of ways you can vary every match, with different numbers of planets (up to 120), different map layouts, different starting ships, unique rules on how the AI plays, and even subfactions.  In-game there is also a massive variety of different techs, ships, buildings and skills to unlock. Also as can be expected from a game called AI War, the AI is nothing short of brilliant. It adapts to your unique playstyle and really knows what it's doing, even on normal difficulties it will prove to be a great challenge.  There is no pvp in it, the matches are from one to eight players against two to three AI's. The more people you have the stronger the AI will be to compensate. Along with it's astounding price for what you're getting, if you're a fan of RTS games with a large focus on economy and research then I would highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, expecially with friends. Each playthrough is completely different and it is difficult to get bored of. The DLC also adds a ton to the game. There lots of excitement to be had if you play this game with friends due to how much harder the AI gets to fight whenever you beat them once or twice. I highly recommend this game to any lovers of RTS or action games.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, but I can only recomend it for patiente people. Succes will came in time.",
            "review_score": "1"
        },
        {
            "review_text": "Intelligent, beautiful, well developed, lot of fun, mentally demanding and still being refined. For me, this was one of the best game purchases i have ever done!",
            "review_score": "1"
        },
        {
            "review_text": "This has a bit of a learning curve, but it's a deep strategy game with potentially hundreds of hours entertainment value.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this to anyone that likes strategy games. The learning curve is somewhat high at first and the game is usually slower paced but very rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "God I'm so glad I bought this. It took a while to grasp it (the learning curve is SUPER steep), but after it did I got sucked into it and found out that it's one of the most satisfying games I've ever played. Last night with a friend we managed to pull off a strike against four key targets that severely hurt the AI, with the last target being in the alien homeworld... which was ten planets away, and all of them hostile. We not only did it, we managed to rebuild in time to stave off a counterattack that could have wiped us out.  I'm still smiling about that.",
            "review_score": "1"
        },
        {
            "review_text": "Co-op survival rts that's brutally hard. Get it if you have rts god frirnds only!!!",
            "review_score": "1"
        },
        {
            "review_text": "had 1k max ships assulted AI home planet battle lasted 30 seconds, i lost 10/10 IGN would die by the hand of AI again",
            "review_score": "1"
        },
        {
            "review_text": "have to play as a non steam game 1395/5 stars would watch the book again",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT PROVOKE THE HIVE!         YouTube™ Video:  Star Trek Voyager - 'Don't Provoke The Borg'&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "+ I recommand this game only for guys who have friends who can play 8h at least on the same game  + Random map + Simple to play  - If you are playing solo you will not apreciate this game at full potential then skip it and don't buy. - Why no AI with us vs other AI ? (see company of heroes 2) - Direct connection only not a matchmaking lobby like eu4 and ck2  To resume all this :  Play in coop or be an chess hermit to profit fully this game.",
            "review_score": "1"
        },
        {
            "review_text": "You can't love everything about Arcen. Its a game dev that doesn't care too much about what fans say or think. In another words, there is only one way to really play this game. They give you options but none that change how it must be played. You must not take all the planets, you cannot conquer your way to victory (unless the diff is set way down) It has a pretty steep learning curve (expect to lose the first few, even after a few hours). This is a game that also is best played with a friend or 2. The AI cheat, they are allowed to cheat, and they are given lots of advantages (like having virtually unlimited ships while you are very limited). Its a challenging game (try setting the difficulty down from the start), in depth, simple graphics, and can be very fun. Get it when its 5 bucks or less.",
            "review_score": "1"
        },
        {
            "review_text": "oh my god. This game is amazing The game in my mind is a Stratagy coop rts game and my god is it fun The game runs amazingly and is extreamly satasfying Especisally with the 8pleayer coop.  the only real problem is a bit with graphics where battles really are just ships standing still shooting and other ships standing still but you get over that quickly",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played this game for a while (and that was on Impulse version, so no Steam gameplay hours). That said, if you have enough time to learn this game, you definitely should get it.   I'd say it takes between two to eight hours to learn the game enough to really start enjoying it. Most of the UI is behind keyboard shortcuts (though you can probably *kind of* do without them), and there's so, so many shortcuts, many of them basically mandatory. Well, for convenient playing, in any case, since you can probably manage without, but it's going to take at least twice as long to play the actual game without the shortcuts.  Now, assuming you can manage the UI, the game is excellent. The point of the game is you're against two AI's, which are also AI:s ingame. As in, you're in control of human survivors, surrounded by two mighty AIs. Initially, you're not worth the AI's attention, and will barely receive any attacks. As you expand and destroy AI bases, they will start to consider you a threat, and their attacks will get more serious.  The genius of the game is this: AI and you are not equal. The AI has vastly more troops, and controls nearly all of the map. You're initially in control of a few human survivors, and the only reason you're surviving is you're not worth the AI's attention. As you begin to draw more attention the threat increases. Your goal is to wipe out the AI's, but you (probably) cannot simply conquer everything, as that would lead to an overwhelming AI aggression. You have to choose the best strategic targets to conquer, and leave the rest to AIs.  Though the game is real time, there is usually no hurry. AI War is really more a puzzle game than an actual RTS. A single playthrough can easily take more than eight hours on standard settings.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me re-think how to play an RTS game. I had not had any that could really challenge me in a long time. Most had the same easy road to victory and it was hard to lose unless you really stumbled. This game though...the ability to almost instantly lose, at least that is how it felt at those times, when everything seems to be in hand is excellent. It keeps you on your toes and doesn't let you just fall into the same rinse and repeat pattern of other RTS games today.  While the visuals may turn off some people, I think they add to its charm and for a game of the size/scope work well enough. The soundtrack alone puts it above most other games I've recently played. The continual support and additional content for this game make it a must own for all fans of the RTS genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game, serves as an intersection point between some of my favourite things. Coop play, spaceships, rts, 4x. Runs on a brick. Immense strategic depth. Very customisable opponents, with fine grained control from very easy, to near impossible, to downright amusing.  Designed so you and your friends can have fun right to the finish, as long as one of you holds out, the rest can still make valuable contributions. The dev seems like a Nice Guy. The soundtrack I find quite relaxing, and I have been known to leave the game open just for that.",
            "review_score": "1"
        },
        {
            "review_text": "If you happen to have a friend over, and you are planning to stay up the whole night, this game is perfect. It is a really awesome game and makes hours pass almost unnoticed. 9/10 would bang.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty AWESOME! ",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of very lengthy, guerella style strategy games, this is a real winner. There's a lot of depth, a ton of options, and an AI that will make you lose if you get it angry. There's a steep learning curve, and a normal strategy of 'conquer everything n sight' won't work here. You need to be selective to win (or turn on the Fallen Spire option and then try to conquer everything).  Definitely worth looking at for genre fans, just be prepared to rethink what you know.",
            "review_score": "1"
        },
        {
            "review_text": "A fascinating, experimental strategy game. It's almost puzzle-like--you can't afford to conquer everything, so you have to very carefully pick the systems you want and figure out how to skip over and possibly neutralize the ones you won't take. And of course, each system presents its own little tactical puzzle. If you enjoy staring at a screen for a while trying to decide what your next move will be, I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Few games in this life have something very special about them. The earlier Elder Scrolls games and a few of the Legend of Zelda titles were what I consider 'Special'. Not many games anymore have the same magic that games used to. AI War is a different story. Everthing about this game, the sound effects, the art, the music, and most importantly, the gamplay, are all extremely special. I would rather be sitting at the main menu of this game than play almost any other game I can think of. The gameplay ranges from mild to wild. You can set it to easy and win a game with a little bit of time and not much difficulty. If you set the difficulty to 10, out of nowhere, you will see 20,000 enemy ships lauch into your planet and destroy you faster than you can say 'Huh?'. I cannot stress enough how fantastic this games is. Whether you want to kill 10 minutes or 10 years, this will be one of the most rewarding games you will ever play!",
            "review_score": "1"
        },
        {
            "review_text": "Grab a friend, you're going to spend the next week building massive fleets and stealing plans for more ships.  And then you'll start your second game. Very fun, if you like protracted battles and long seiges... IN SPACE!",
            "review_score": "1"
        },
        {
            "review_text": "it's the best strategy game of 2010!!!",
            "review_score": "1"
        },
        {
            "review_text": "You will fear judgement day.",
            "review_score": "1"
        },
        {
            "review_text": "It takes ages to set up, so many things can go wrong and the AI always seems that little bit smarter than your collective intelligence as players. But that feeling you get, as your forces shred the AI's final defenses, working in seamless tandem with your friends', listening as the superb soundtrack reaches its crescendo - little compares.",
            "review_score": "1"
        },
        {
            "review_text": "this game is very hard to understand and learn.. The the whole approach is too outlandish to me to bundle enough will power to get into it.. Yes, I bought it but never played it, haha... So if you're hardcore RTS you got a pick yo :P",
            "review_score": "1"
        },
        {
            "review_text": "Got 7-14 hours of time to blow? Got some friends to blow it with? Well then you have more free time than I. However AI War: Fleet Command would be a great way to spend that time. Very challenging and rewarding if you have the time.",
            "review_score": "1"
        },
        {
            "review_text": "Get your teeth kicked in by various flavors of robutt.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this games if you want a VERY different take on the RTS genre. The graphic is pretty simple but the game is hard as hell and very hectic if you tease the AI....  Looking forward to try it in multiplayer some day!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt, AI War is the best strategy game I have ever played.  Once you get past the intimidating complexity, you find an incredible depth and variety of gameplay. The interface is incredibly slick and a lot of effort has gone into filing off the rough edges and minimising unnecessary micromanagement.  AI War really shines in multiplayer, too. The gameplay experience is the same, but you get to fight alongside your friends to defeat the galaxy-wide AI menace. If you're new to the game, multiplayer with someone more experienced is also a fantastic way to get up to speed and pick up a few tricks to help ensure your eventual victory.",
            "review_score": "1"
        },
        {
            "review_text": "A.i. Fleet Command is one of those hit or miss games. Some like it and some simply despise it. I am the people that absolutely hate this game. It takes some absurd amount of hours to beat opponents on higher difficulty, and the learning curve on this game is absolutely ♥♥♥♥ing insane. It took me some ~7 hours just to understand all the control and interface and even though I still hated the game. It is simply way too confusing for me. I enjoyed star craft 2, the old command and conquer general’s series where you amassed huge armies while holding a defensive line. In this game you explore, scout, and explore some more. Find your enemy, attack them, and pray their retaliation suck. This game simply doesn’t have the adrenaline rush that I come to love in an RTS game. It’s simply too slow and cumbersome for my taste. Have a try at it if you want.",
            "review_score": "1"
        },
        {
            "review_text": "Quit reading and give Arcen your money.",
            "review_score": "1"
        },
        {
            "review_text": "Cool space strategy. Though the graphics will make your eyes bleed.",
            "review_score": "1"
        },
        {
            "review_text": "You know...AI War: Fleet Command is a hard game to describe...but if you get to try it, you'll see that past its graphics and presentation there lies one of the best RTS/4x/TD/...yeah, there a lot of combination, but still! I think it's one of the best game I've played, with lots of replayability, EXTREMELY GOOD AI, and much more!",
            "review_score": "1"
        },
        {
            "review_text": "Do you want a highly difficult space strategy challenge? Then you should give this game a try. Featuring epic battles between enormous fleets, an enemy that becomes more aggressive as you progress and will outright destroy you if you expand carelessly, randomly generated maps with lots of possible options to make the game more interesting, gorgeous starscapes and a soundtrack that may make you cry in melancholy, this is a must have for space strategy enthusiasts.",
            "review_score": "1"
        },
        {
            "review_text": "Jolly cooperative RTS with some tower defense elements; like Broderlands, (Palderlands!!111) do not play without a pal. Or a bunch.",
            "review_score": "1"
        },
        {
            "review_text": "Fun strategy game where the AI is well done so it doesn't feel like it is cheating.",
            "review_score": "1"
        },
        {
            "review_text": "This game feels so massive and expansive. I love how the scale makes your ships feel so small in relative size. Great Game play.",
            "review_score": "1"
        },
        {
            "review_text": "hello, my first review, and i chose this game because of the 130 games i have on steam, this is the only one i have been extremely mad at. A galactic RTS, if you will... start above a planet, and move to control the space over the next planet or planets that you are next to, or skip the next one to get a more crucial point further along in the map. As you progress, so does the AI, and they get boosted as you destroy their bases, so u need to be selective on which ones you cap for yourself, and which ones you leave in their control. Fight your way thru systems and make your way to their home 'planets' and u win,   This...Game... Is... Hard.... it is designed for 8 people to fight against 2 AI teams, so imagine the difficulty with just 2 people trying to micro-manage the chaos. A buddy and i (who both LOVE RTS games) restarted this game repeatedly and lowering the difficulty every time. Just when you think youve got em by the balls, a few thousand units show up and wipe u out. Frustrating?...YES... but even more so, we laughed so hard after being wiped out by over 1 million units... yes, 1 million..and combined we had maybe 6000.. mind you, we kinda pushed them to spawn that many, lesson learned...So its very strategic how it needs to be played out..Also has some of the best DLC ive seen in most games, all add quite a bit of options to the initial gameplay, making the play much more diverse as u continue to progress through.  Pros:  -Diverse units -unlimited map choices -infinite number of choices to apply to your game (ALOT more with DLC included) -simple and basic RTS controls  Cons: -Graphically not quite there by any means, top down 2D view... but that doesnt take away from gameplay at all -Multiplayer doesnt work in game thru steam.. we had to use himachi or evolve, but no connection issues in either of those and the game ran great  Quite honestly, i cant think of anything bad to say about this game, its phenomenal.. If u enjoy RTS games, this is a must have.   9.5/10(would be a 10 if they dolled up the graphics)",
            "review_score": "1"
        },
        {
            "review_text": "I can't say enough good things about AI War. it is not the typical RTS, it was designed from the start to be something different. A list of 'you know in every RTS game. you have to X, well i don't like that.' and i have to admit the result is very refreshing. Its you vs the AI in a very asymetrical war, there is no PVP in this game. Some will be turned off by that fact i am sure, but its a whole nother experience to be facing an AI that can kick your ♥♥♥. The AI starts controlling everything and has nearly unlimited resources it can throw at you, but you rank so low on its threat meter at the begining that it really pays no attention. As you become more powerful take more systems from it etc. You become more of a threat and it begins to take more notice. It then starts to throw progressivly larger and larger attacks at you and fortifies its defences more and more. The AI is never idle and you need to be dynamic as well as the AI changes so must your tactics actions that it has learned works based on previous actions it will start to use more frequently and thoughally kicks your ♥♥♥ more times than not. But loss is all all part of the fun. Don't bother playing on any difficulty lower than 7 by the way, not worth the time. Another Innovation thats worth mentioning... Seamless join and drop of comrades in multiplayer games. Have a friend that can play but only somtimes, well they can play with you, and when they leave you can take control of thier assets of seamlessly have someone else take over in thier position. Without a doubt there is a steep learning curve to this game, its best to have a more experienced player guide you through your initial game, but its not impossible to learn on your own, as long as you are ok with getting your ♥♥♥ kicked for a little while. Anyway, great alternate take on RTS worth a shot. Its so cheap these days what do you have to loose?",
            "review_score": "1"
        },
        {
            "review_text": "It was a bit boring when I first played it... The combat looks like ships just shooting at each other instead of the usual dogfights that we see like in Homeworld or any other space-combat game. It's like a 2d Version of Sins of a Solar Empire. However, it is a good game and a recommend to most RTS Fans out there. I for one love it, but the combat... eh, not so much.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Lots of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "Most complex and advanced RTS available - it is NOT for everyone, but if you like highly strategic gameplay, large scale battles, co-op and have someone (or - even better - a group of players) to play with, this game is probably for you.  It requires lots of time to learn and even more to play, but... If you are willing to invest enough time into it, it will be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game, but buy it from developer Arcen Games directly.  Completely unique 4x strategy premise. Sins of a Solar Empire setting with Forged Alliance scale with Chessmaster thoughtful 'move' progression with strong influences of Tower Defense. Your opponent AI can crush you at any moment, so doing things to attract its attention like setting off nukes, raiding every planet within sight, or destroying key structures will doom you if overdone. Guerilla warfare in a scifi setting is the name of the game, as you are assaulted with announced waves of enemies IN ADDITION to waging a traditional scout-and-expand campaign. The multiplayer implementation is revolutionary and flawless, as you can easily add and drop players as needed throughout a typical 6+ hour mission.  Best. Indie Game. Ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. Just wish losing certain structures didn't mean you pretty much lost the game.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best space game I played, but the challage I do enjoy quite a bit. Want to take over a planet, ok but the AI will get stronger, want to steal that tech ok the AI will get stronger, want to do almost anything? you guessed it the ai will get stronger. Unlike most games; this one the more you take the more comes at you, unlike most games.",
            "review_score": "1"
        },
        {
            "review_text": "Overall a great game! I've had it for years and put many hours into it. The concept is new and refreshing, the difficulty is frustrating but you learn your mistakes. It's the Dark Souls of RTS, if I were to say, it punishes you for doing stupid stuff but you learn and become better next attempt. Save scumming helps, too.  Pros: Refreshing playstyle: A new type of RTS, not one where you find new resources and fight against someone on equal footing. You have to survive in this, the AI is vast and strong, but it scales with you. You fight for survival, not for dominance. Good mechanics: The workings under the hood are pretty good. It could be a little user friendly, but with how much is needed to deal with it works for what it is. Advanced options for veteran players that aren't in your face, with the more familiar gameplay visable in front of you. Amazing soundtrack: In most games I find myself muting the music, but this is one of the few where the music feels right. It perfectly plays into the feeling of being alone against all odds. Difficulty curve: The AI doesn't use it's vast resources to beat you, it gets more angry as you progress. If you progress too quick it will react, but if you take your time you'll make it to the end. Unit selections: There is no race you pick, you get to pick a special ship with 3 base ships and work with it. There are many with different specialties. You can get more as the game progresses. Lots of different ship types, and defensive structures.  Cons: Not friendly with newbies: The game has a steep learning curve, not gunna lie. Its not really easy to learn and harder to actually master. Multiplayer: It's based on IP, no central server to play with. You have to get a virtual lan or figure port forwarding. To top this there is no central area to get a group together to play. Visuals: While this might be neutral to me, the visuals are overly simplistic. They get the job done, but nothing really to look at.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game, but buy it from developer Arcen Games directly.  Completely unique 4x strategy premise. Sins of a Solar Empire setting with Forged Alliance scale with Chessmaster thoughtful 'move' progression with strong influences of Tower Defense. Your opponent AI can crush you at any moment, so doing things to attract its attention like setting off nukes, raiding every planet within sight, or destroying key structures will doom you if overdone. Guerilla warfare in a scifi setting is the name of the game, as you are assaulted with announced waves of enemies IN ADDITION to waging a traditional scout-and-expand campaign. The multiplayer implementation is revolutionary and flawless, as you can easily add and drop players as needed throughout a typical 6+ hour mission.  Best. Indie Game. Ever.",
            "review_score": "1"
        },
        {
            "review_text": "not sure why there are only 554 reviews on this game. maybe it wasnt marketed well enough. the game is ♥♥♥♥ing amazing and and if you like RTS, 4X, tower defense, OR strategy games you should stop reading and scroll back up and add this to your cart.",
            "review_score": "1"
        },
        {
            "review_text": "Think you have what it takes to kill off an AI?",
            "review_score": "1"
        },
        {
            "review_text": "A different take on tha RTS genre. Plays like a typical RTS with plenty of units and gameplay options. You start with one system and 2 enemy AI's that at the moment are otherwise engaged and are vulnerable. You have to scout out systems and decide what action to take. You do not just take every system, you have to pick and choose as the AI awareness of you goes up with certain actions (ie. - killing AI command's). As the AI level goes up, your chances of survival go down. There are plenty of different options for progressing and getting more units. Hacking enemy Fabricators gives you access to that unit permanently or you can capture the system and own the factory yourself. Or sending a strikeforce to take out the Data center in the system 2 jumps away to lower the AI level.  A well done game that does what it says. Highly recommened.",
            "review_score": "1"
        },
        {
            "review_text": "good game, big battles, co-op, and clever ai buy this game",
            "review_score": "1"
        },
        {
            "review_text": "ENG:  The best space strategy game that I have ever played, this game is a space civilization, testimonials, which are regarded as space games or strategy games.  FIN:  Paras avaruus strategiapeli, jota olen pelannut ikinä, tämä on avaruuspelien civilization, suositteluni, jotka pitää avaruuspeleistä tai strategia peleistä.",
            "review_score": "1"
        },
        {
            "review_text": "-Good, challenging AI -Tactical decision making can make or break you in a match -DLC adds lots of content and ships  I bought the whole bundle when it was on sale for $3 and it was well worth it.  10/10 would reccomend",
            "review_score": "1"
        },
        {
            "review_text": "When you see Google's AI...you know that preparing your self with this game is the best move.  (On a more serious note : excellent game. Can be hard sometimes, especially in end-game at high difficulty. Mechanics are simple and fast to learn.)",
            "review_score": "1"
        },
        {
            "review_text": "This is not your normal 4x or RTS game. It can be very hard. The problem is the way the AI enemy behaves or reacts to your success.  A normal person used to normal games of that type will be inclined to conquer as many planetary systems as possible. But the way the game is designed, this only makes the AI send larger and larger waves of atackers. And since there is a cap to the number of units you can have, you are quickly overwhelmed. Its so frustrating to be punished for success.   So since its not a bug but a deliberate design choice, stay away if you dont like games like that. I like to steamroll and overwhelm my enemy but its not possible in this game. You have to be lean and mean, and I'm not fond of that tactic",
            "review_score": "-1"
        },
        {
            "review_text": "Its a bit much to learn all the different types of ships. The idea is kind of neat. Online multiplayer might be nice",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game because it tries something totally new with the RTS formula. The idea is that an AII has taken over the galaxy and your planet rebels. Luckily the AI is distracted in far off areas and doesn't focus its full attention on you right away. The idea is you have to expand and ultimately find the system the AI core is located and destroy it. The trick is that every installation you destroy raises the AI's alert level causes more and more powerful enemy ships to start warping in. Instead of expanding wherever possible, you have to expand smart along paths you think might lead to the core.  It's a good original idea. The problem is the execution is horrible.  The graphics are terrible even for an indie game. All ships are pixely cardboard cutout 2D sprites with NO animation. You just see them glide across the screen like some kid just discovered animating layers in Final Cut for the first time.  The problem with the awful graphics is compouded by the sheer swarms of units that flood the game. You're pouring hundreds, if not thousands of ships into fight and you can never really tell what's going on. Just a mess of unanimated pixel blobs sitting there and it's impossible to tell who's losing until someone is wiped out with no way to tell why someone won or lost. Did you have enough frigates? Did you need more bombers? Was some special support ship providing an advantage? You can never tell. You just spam an even mix of hundreds of ship types each and hope for the best.  Speaking of swarms, this is RTS blob warfare at its worst. One of those games where it doesn't feel like you're fighting battles so much as grinding economies against your opponent. That approach doesn't work in this game because you're not fighting against a traditional RTS economy. The AI isn't building units based on how many planets it owns, but by its threat level so it actually gets stronger with more units magically teleporting in the more bases you destroy. Is it worth throwing away 800 ships to take this system? Do I need 500 turrets to guard this wormhole from a future attack or will 200 do? You have no clue what kind of tradeoff is worth it because your opponent isn't playing by the same rules as you. You can't anticipate when the next alert level spike will come or how much of a boost it will be so it's impossible to plan ahead.  The interface is the worst I've seen in a game since the 1980s. I swear I haven't seen a strategy game this overlycomplicated since those super hardcore 80s wargames that were controlled with keyboards only (not even arrow keys!).  There are also a bunch of little features that are 0% fun and 100% annoying. There's an 'astro train' unit that's a train traveling through space. It is indestructible and will destroy any of your bases it moves through. The only thing you can do is destroy the stations (yes, train stations in space) it travels between, but only the stations that will divert its path away from you. It's ridiculously complicated to calculate which stations you have to destroy to get the train to go away and not at all fun. Thankfully you can turn trains off in the options menu but there are dozens of little annoying things like it and you have to comb through literally 40 optional settings at the start of a game and you won't know which features are worth it and which are terrible until you've played many games and the darn thing is hard enough to learn as it is.  In summary, this was a good core idea for a game that they should have refined more. If they boiled it down to the best 10% and dumped the 90% that was boring and redundant so that you could actually start understanding the big picture. If they could recreate the core idea in something like the Sins of a Solar Empire engine and make the strategies for units and production more clear, that would be an awesome game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the idea of this game but the UI is just ugly. It all seems complex just for the sake of being complex. I've played games like Civilization and Masters of Orion 2 so I know what I like and this just isn't it.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Making simple tasks complicated to try to look smart.",
            "review_score": "-1"
        },
        {
            "review_text": "Complicated and just not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I've attempted 12 campaigns, 5 with lower difficulties, 8 with smaller number of planets, and every time I get stopped by a Superfortress on the 6th, 7th, or 8th planet with no way to progress. I've tried not conquering every planet and even still, I get BS like that. The game doesn't respect a player's time and I question every positive review because their experience is nowhere near the same as to what I had witnessed.  It has a great concept of the player being a small army, having to ambush the robot army and the game enforces that by giving the enemy unlimited resources. To succeed in destroying the A.I. mainframe, you have to go to each planet and decide if you want to conquer it for resources and in the process, increase the difficulty, or quickly go to the next planet, hoping you won't get trounced by an even stronger pre-built setup that doesn't reflect the A.I. 'awareness' you have earned throughout the campaign.  The game pretends to give you encouragement, that it is about tactics and planning, within the tutorial. The four main weapon types come with the standard extreme Rock-Paper-Scissor forumla of dealing and taking damage present in the game. It is more annoying than anything else when fighting something like a Super Fortress where you know you need to use only bombers to handle those, but they place anti-bomber items around the Super Fortress and the weakness against those anti-bomber item one shot each of your bombers, so the fight becomes 'how many thousand of units do you want to waste?' instead of the careful planning you were doing at the start of the campaign.  I'll try a few more times to beat this game, then never attempt it again. It's the new XCOM: Enemy Unknown all over again; where internet tough guys defend a Games Workshop style of game while the rest of the world struggles to comprehend why geniuses love to torture themselves with unfair RNG.",
            "review_score": "-1"
        },
        {
            "review_text": "I heard it was an interesting game, but I have NO IDEA how it works. Lucky I got it + DLC as extras in a bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst games I've played in awhile.",
            "review_score": "-1"
        },
        {
            "review_text": "terrible, built like a 1950's game.",
            "review_score": "-1"
        }
    ]
}