{
    "app_id": 404100,
    "name": "STEEL STRIDER",
    "release_date": "2015-11-12",
    "developer": [
        "ASTRO PORT"
    ],
    "publisher": [
        "Nyu Media"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 49,
    "positive_ratings": 34,
    "negative_ratings": 7,
    "price": 4.79,
    "description": "STEEL STRIDER is the follow up to the acclaimed GIGANTIC ARMY and pays homage to the great run and gun games such as Turrican and Super Contra, but adds mouse / dual analogue stick-operated weapons!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/404100/header.jpg?t=1451112677",
    "minimum_requirements": "OS: Windows 2000, XP, 7, or 8 Processor: Pentium 4 1.4GHz or better Memory: 512 MB RAM Graphics: NDIVIA Geforce series, AMD(ATI) Radeon series Storage: 100 MB available space Sound Card: DirectSound-compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "What we have here is a proud, noticeable improvement to Gigantic Army. Let me offer some bulletpoints so far, and I may change my post depending on how far I get into the game.  ----Pros +I'm pleased to say that the controls are fantastic. A bug or two persisted at launch, but the developers have swiflty patched it out and I can report that everything works smoothly. I'm more of a gamepad kind of guy, but I must say their use of keyboard controls is refreshing, and anyone who likes either scheme will not be disappointed. +the graphics are nice, once again utilizing fine spritework instead of lazy pixel art like it's become a habit of in indie games +there's about 7-10 tracks of music in the game, but they're really catchy. I've often left the game open just to listen to some of the boss music (incase you're wondering why I have so much playtime). Soundtrack when? +the pacing is smooth, in that you'll never suffer a massive whiplash in difficulty. Also, the game advertises 4 planets to explore, and each has 8-10 levels each. The length of each level is about 1/3rd of the length of your average GA level, so I'd reckon this game is almost twice as long.  +overall it's an enjoyable experience with a good difficulty curve. Expect to die a bit +The game, unlike its predecessor, utilizes a save system, where you can start off where you left at certain checkpoints, so you don't have to do the whole game in one run. In exchange, your mech can't tank hits anymore. A few shots and you're dead, and hazards are actually a threat to you now.  +you trade in the shield of the GMR-SALADIN in favor of multiple weapons, each of which function as your basic damage dealers, but there's enough variety for each playstyle.  +the game makes good on its promise of large, imposing bosses. Each has a distinct feeling to them, a strategy to take them down, and even unique arenas to fight them in. Whether you're soaring through the sky, or running on a collapsing bridge, they change up the formula to keep you on your toes.  +the store page says they make several references to their older works, like Satazius and Vulkaiser and I think even Armed Seven reared his robotic mug. I won't spoil anything for you, but the way they reference each is pretty cool, and they're not just background murals or small missable things.  +Nyu Media and Astro Port have been quick to keep watch over and work out any issues with gameplay or other bugs (as with all their games) so you can expect a quality product. I definitely love this game enough to fully recommend it, so it's hard to contain my enthusiasm in a single review.  ----Cons -achievements are a little bugged, but a fix is in the works from what I've heard (doesn't affect the game, so if you're not a dedicated achievement hunter, this shouldn't be a problem) -not too many configuration options, as you can't personally drag the screen to your desired size, but it does offer some choices.  On that note, I think that, along with Xenoblade Chronicles X, Earth Defense Force for the PS4, and Final Fantasy 15 (and the promised magitek missions), robots are coming back in style. Steel Strider is a fine staging point for that. Now if only Astro Port could make a 3D robot game where you drive it around like in XCX. That would be cool, but that's for another day.",
            "review_score": "1"
        },
        {
            "review_text": "As mentioned in my previous review of Super Cyborg, I spent some time looking for run and gun action games. During my search I learned of the Japanese indie developer ASTRO PORT and their side-scrolling mech shooters. I chose STEEL STRIDER because it is the most recent game and had heard that playing the others didn't matter. There are a few references to the other games within STEEL STRIDER. It's difficult to say how important it was, but I do feel like I may have missed a few things.  STEEL STRIDER's story is conveyed primarily through scrolling text between each stage. The text scrolls somewhat quickly and as far as I know there is no way to pause it. In fact, instead of an option to slow it down you can speed it up to an even faster pace. It isn't difficult to imagine players having a tough time keeping up with the wall of text. It usually describes what's going on, why you're going to the next stage, and what your mission is there. The game gets it right where it's important though, and has solid gameplay.  You play through each stage piloting the Gemini-class MCR (manned combat robot). The mech is armed with an infinite ammo pistol, plasma blade melee weapon, and a jet-pack. Throughout the stages of the game there is a veritable arsenal collect. The weapons are all useful and I found myself routinely switching between them. There is game-pad support, but I preferred the keyboard and mouse for this game. A lot of twin-stick shooters offer adjustable aim-assist while using game-pads and it would have been a good addition here.  When I watched STEEL STRIDER's trailer I was unimpressed. The graphics looked underwhelming. After actually playing the game though, it looked mostly fine. The player mech and the bosses were well designed but some of the backgrounds were a little drab. The only disappointing thing was a noticeable lack of graphical and resolution options.  Overall STEEL STRIDER is a fun, but short game. It took me less than three hours to finish the game on normal. There are several higher difficulty options and leader boards which all add some replayability. It certainly has some flaws though. In addition to my other criticisms, I noticed that a few of the achievements are bugged. Considering that the asking price is low, and it can be caught on sale for as little as $2.99, I'd say it's a good deal. I recommend it to anyone looking for a solid action platformer.   Like the review? Follow my curator page to see my thoughts on other games. ",
            "review_score": "1"
        },
        {
            "review_text": "Worthy successor to Gigantic Army. Pretty much more of everything. Also really cool that you get to fight the mech from the first game. It did remind me that I miss its shield though :(",
            "review_score": "1"
        }
    ]
}