{
    "app_id": 404410,
    "name": "Endless Sky",
    "release_date": "2015-10-30",
    "developer": [
        "Michael Zahniser"
    ],
    "publisher": [
        "Michael Zahniser"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Free to Play",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Space",
        "Free to Play",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 3420,
    "negative_ratings": 366,
    "price": 0.0,
    "description": "Endless Sky is a 2D space trading and combat game inspired by the classic Escape Velocity series. Work your way up from a relatively wimpy shuttle, cargo ship, or fighter, to a highly upgraded and customized flagship or to a massive fleet of warships or freighters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/404410/header.jpg?t=1466793422",
    "minimum_requirements": "Memory: 350 MB RAM Graphics: OpenGL 3.0 Storage: 65 MB available space",
    "recommended_requirements": "Memory: 750 MB RAM Graphics: OpenGL 3.3 Storage: 170 MB available space",
    "reviews": [
        {
            "review_text": "So I land on a planet and check the space port for any missions and I wind up with a woman holding a gun to the back of my head. It gives me two options, one is raise my hands like a smart person and the other is 'Do a karate move'. I kind of just stared at the screen for a couple seconds before clicking the 'raise my hands' option. The woman with the gun tells me to move or something and two choices pop up again. 'Comply' or 'Now do the karate move'. I stared at it. And it stared back. For what seemed like eons I watched it. It was seducing me. It was corrupting my morals and everything I hold dear. I wanted to stay in the immersion but it did not care what I wanted. It wanted me to click it like Miley Cyrus wants attention.  I clicked it and she went off on a rant about how she's a she-badger.  10/10 best dialogue ever, would karate chop again",
            "review_score": "1"
        },
        {
            "review_text": "This is just the sort of game I have been looking for, for ages. Very reminiscent (for me) of the original Elite on C64 only in 2D. I love space exploration games, and this one has struck a chord. There is not really a sense of urgency, and you can play at your own pace. Great time sink and if you die you don't have a huge grind because the game saves your progress periodically when you land on a planet/station.  I have already logged more hours on this game than many of the other P.O.S. indie games out there (with trading cards!!!) that I actually forked over good money for (O.K. well not good money, but on discounted sale, but I hope you get my point).  This game was obviously a labour of love. Seriously Michael, why are you not charging for this masterpiece/gem/diamond in the rough? If at all possible, at the very least let people know how they could donate via paypal or other means to support you and any other developments you may have in the pipeline, you deserve the spoils of this wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "How to play game:  Step 1: Find out the game is neat-o. Step 2: Buy a crappy ship. Step 3: Slave away at your mortgage. Step 4: Finally buy a less crappy ship. Step 5: Do lots of transportation and cargo runs. Step 6: Find out there are drug runs. Step 7: Apply said drugs to your face/arm/nose/toes(?) Step 8: Dang flowers always after me' Lucky Charms. Step 9: Restart because I can't find out how to get rid of said flowers. Step 10: Repeat steps 2-9 several times. Step 11: Get a pretty awesome ship. Step 12: Start to pirate the pirates by stealing their pirate ships to sell for profit. Step 13: Accidentally gut a pirate before capturing them, leaving the pirate ship you just captured stranded in a useless system. Step 14: Progress anyways even though you have a useless ship rotting out somewhere. Step 15: Finally have enough to get the Shield Beetle and buy it. Step 16: Forget to set the Shield Beetle as your flag ship. Step 17: Become stranded on the one little pirate ship you captured because you are unable to get half way across the galaxy, where your Shield Beetle is. Step 18: Get raided by pirates in your personal crap-mobile.  10/10 cry again.",
            "review_score": "1"
        },
        {
            "review_text": "  The perfect free game",
            "review_score": "1"
        },
        {
            "review_text": "The people ask me to transport 30 tons of hand bags I transport 30 tons of handbags profit",
            "review_score": "1"
        },
        {
            "review_text": "Escape Velocity, update for 2016. This is the game I've been wanting to play for years.",
            "review_score": "1"
        },
        {
            "review_text": "Endless Sky is a great game. It might not seem like much of one at first glance, but it really pulls you in once you start playing. It's a lot of fun running missions and generally trying to figure out how to make more money and do more things. I especially liked the non-intrusive and responsive tutorial at the start - the game as a whole really shines through its writing. I'm still enjoying running deliveries across the galaxy, so I can't vouch for the entire storyline, but the fact that there even is one that blends into the world so well is very impressive.  I feel that the controls and mechanics could be more friendly - arrow keys were a surprise, as was the fact that ships in the 31st century don't have retrograde thrusters, and that you have to turn 180 degrees and thrust to stop. It's also a little jarring that you can simply jump into a sector to be absolutely demolished by a pirate cruiser, though loading from the previous save makes it no big deal.  All in all, this is a great game and I recommend it whole-heartedly, especially since it's free AND open source. The developer did a great job on this.",
            "review_score": "1"
        },
        {
            "review_text": "A great free game. I'd have gladly paid at least $5.00 for this. It's worth about that much in the current state alone with all of the stuff you can do in it. It can be monotonus but that's entirely up to you. You can start out doing missions and build up cash to get a better ship, attack a pirate (Or even a friendly trader) to scavenge parts for money or even take the ship itself, run travelers around, trade. I mean it's basically a single player top-down Elite Dangerous. Very very very fun. The cap of the game seems to be getting a sizeable fleet and maybe either claiming entire worlds for yourself or just demanding tribute from them. Either way I've dumped about 12 hours into it and I just have a relatively tough mid-tier freighter with about 10mil saved up and the ability to actually put up a fight against pirates. It has enough content to keep you busy and honesty you can't argue with free.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best space game out there right now.   For one, the map is actually based on real stars in the galaxy. Two, there are so many ways to play this game. Trader, Pirate, Privateer, Courier, Taxi service xD and probably my favorite, ITS MODDABLE!  This game is open source, and is incredibly easy to mod, even without a basic understanding of coding. I myself have made a mod, so I would know.  Sure, its top down, oh no, there goes my Z axis! Hello, infinetly moddable game, Non-cancerous community, and amazing storyline!",
            "review_score": "1"
        },
        {
            "review_text": "It's a great treasure in less than 50 MB! Pure pleasure for free!",
            "review_score": "1"
        },
        {
            "review_text": "A potential masterpiece.  In Endless Sky you become part of a deeply designed and thought through, living universe - one that's not just there for decorations, but a work of art in its own. And you slowly make your way in it, tying yourself tighter and tighter into the plot. (Only to end up with a deep satisfaction from a completed storyline and with A LOT of side missions and secrets to discover.)  Exploring this universe has brought me a great pleasure. Every planet, every sector, every alien race is unique - especially the aliens.  Other than that, the combat is fun, the storyline is interesting and intriguing.. Some background music would be nice, but I heard that's coming as well.)  The game is a work in progress, and that is especially true for the content, the lore, other possible campaigns, I mean. As more and more content is added, the backstory of the universe unfolds beautifully. Im looking forward to playing it again when it's done. (Dont look at my pretty low playtime, I was too impatient to haul cargo, so I cheated with scanmem. Tip - start as a combat pilot, its much more fun this way)  Definitely thumbs up, 9/10. When this is finished, it'll be a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "In the mid-90's there was a game called Escape Velocity released by Ambrosia Software, where you flew around in spaceships in a 2d universe, completing economic or combat based missions. I recieved a copy free copy of this game on a MacWorld Magazine disk and was immmediately hooked. I spent endless hours of my youth exploring the the Escape Velocity univerise. It's an open world, where you follow quests and decide which faction you were going to join and others that you were going to become enemies with. You could join the Confederates, Rebels, Pirates, or just remain an independent trader.   Endless Sky is clearly modelled after the Escape Velocity series (Escape Velocity, Escape Velocity Override, and Escape Velocity Nova) and anyone who was a fan of those games should be playing this.  That being said, for me personally, Endless Sky brought back a lot of nostalgia from my gaming days in the 90's. Growing up I had a Macintosh computer, which really limited my computer gaming choices. There were the early Bungie games (Pathways Into Darkness, Marathon, and Myth 2) as well as Blizzard's Warcraft and Starcraft games. Bungie, Bllizzard, and Ambrosia Software were my three go to gaming companies and they all sparked my passion for gaming.   Enough nostalgia, let's talk about the game. You start off with a trading ship and have to complete several trading missions in order to pay off the morgage you got for your first space ship. As the game goes on, you begin to explore the galaxy, earn more credits, learn more about the main plot, and eventually build and upgrade your ship. There appears to be one main storyline to this game (as opposed to the EV series where you followed a certain faction's story line) but you can go about it at your own pace. Some side missions pop up which also add an element of intrigue. All the missions require you to either take people/cargo somewhere, to fight other ships, or analzye something. At both the beginning and end of the mission there are no cutscenes but instead you read and sometimes make decisions on what was said.   The combat is a bit difficult to get used to at first and you'll need to buy another ship and upgrade a bit before taking anyone on. The first few hours playing this, not unlike my high school days, I always got my ♥♥♥ kicked. If you keep grinding out the trade missions, you'll soon have a ship to be reckoned with and can go face to face with everyone who wronged you. Also you can hire a fleet of ships to help fight along side you although you'll have to pay them x amount of credits to retain their services.   I've played this game for several hours and it has kept me entertained and curious on how the story line will unfold. It's not ground-breaking at all, sometimes I got lost trying to figure out where the story picked up at, and the game is outdated graphics-wise but I'm recommending it.   I'm also looking forward to the user created mods. Escape Velocity had a similar editor where there were a lot of great user created mods released for free and kept the game new and exciting after you exhausted the original game.   If your curious, give it a shot. You got nothing to lose but time - it's free.",
            "review_score": "1"
        },
        {
            "review_text": "so simple but so fun, and it's potato compatible.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best free games I've played, behind only TF2.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Free to Play games I have ever played. Bought it 2 days ago and I've already logged several hours of gameplay. The game allows you to approach it however you'd like, whether you want to be a galactic trader, a military fleet, a pirate, or just want to explore. The missions allow you to make a quick buck, and the banking system gives you money to upgrade your fleet. It also works like a real bank in which paying your loans on time allows you to get more money in the future. 10/10 would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "So i originally picked this up because i was craving a space game but i was broke. I thought aw yeah ill play this crappy little game.... Needless to say i was very very wrong.   This game is amazing and there is so much content.  I would of hapily paid $15 for it.   I hope they keep up the good work",
            "review_score": "1"
        },
        {
            "review_text": "The kind of game you lose yourself in. Fun, in space, and free... win, win, win.",
            "review_score": "1"
        },
        {
            "review_text": "In 6 hours: - Got killed 100+ times trying to figure out the shoot button - Killed 100+ innocents when I figured out the shoot button - Pressed the J key accedentally / Started exploring - Went back to shooting people - Started following the story - Got distracted way to many times by tourists and bounty hunting - Gave up on the story - Starting building my EPIC SUPER BADASS FLEET - Boarded a ship - Thrown off ship - Held planet hostage - Laughed at - Had a tantrum - Looked for friends - Killed friends, stole their ships - Fleet of five now - Decided to attack some planet - Fleet of one now - Regret previous life decisions - Exited game - Changed every picture in the resource folder to a face - Scared by my own creation  10/10 would press j again",
            "review_score": "1"
        },
        {
            "review_text": "It's a free credit score simulator. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "just like Escape Velocity!!! We need more games like this!",
            "review_score": "1"
        },
        {
            "review_text": "I've had this game for only a few days, and I've played for almost 48 hours.   Granted, I've had it running in the background for some of that, but the point stands.   This game is great.   Pros: Still in development - you can talk with the developer and suggest improvements This also means new content is coming out regularly  Solid gameplay - this game just feels good to play. The ships range from tiny to massive, and their handling changes as well. Great selection of stuff to customize with that forces you to balance heat, power generation, and ship handling with the amount of weapons or cargo you want to carry.   Interesting world: this game has a LOT of lore to dig into if you want to find it, or you can just take it as it is. up to you.   Easily moddable: I haven't installed any yet, but mods take the form of plugins that you just place in the appropriate folder, and its designed for you to be able to change things easily.  Open source: You can help make this game.   Low system requirements: anyone with a PC can play this pretty much  Cons:   Only one minor downside Still in development: while there are benefits to a living game, one of the downsides is content with some loose ends to be filled in later. This also means there are a few minor bugs here and there. If you're reading this after 1.0.0 then this will probably be a non issue, so download this awesome free game.  Any other issues I've had are already on the list to be fixed, so don't worry about that.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. Even though I don't have a ton of hours, I have started multiple characters just to experience the different ways to play, and it's so fun to develop your character/fleet. Reminds of a 2D Privateer, a few missions can be unforgiving, but overall worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games i have ever played. The only thing it needs is multoplayer and it would be perfect.",
            "review_score": "1"
        },
        {
            "review_text": "This is a cool space trading and fighting game that I found entertaining yet challenging.  Work your way up from a junk freighter to the Millenium Falcon and smuggle some Jedi aboard the Deathstar, sweet.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit of a rough diamond. Its got great potential and I enjoy what its got in it already but the combat feels pretty awkward and there are still a lot of UI issues that I think need to be made simpler. The game doesn't have much of a tutorial either and if you want to do bounty hunting or combat aligned work, there is no easy way to figure out how best to get into it unless I was meant to do the same tutorial over but in the fighter ship.  I seriously like the game though and I hope it will evolve into something truly amazing. Definitely worth a try if you like space games and/or trading stuff.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME BEST SPACE GAME IVE EVER PLAYED, Battle Space Game Of Course BECAUSE IF IT WAS RP/FREEPLAY SPACE GAME IT WOULD BE MY 2nd FAVORITE (i have kerbal space program) BEST SPACE FIGHTING ADVENTURE OF THE YEAR TO MY OPPINION",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly one of the best free games out there, I advise you get it right now, There will be no regrets.",
            "review_score": "1"
        },
        {
            "review_text": "Not a good game to play when you have exams.",
            "review_score": "1"
        },
        {
            "review_text": "Got it, loved everything about, immediately bought warships and destroyed the galaxy.  10/10 would terrorize again  ~ZeroHundred",
            "review_score": "1"
        },
        {
            "review_text": "I've been looking for a new open-world space adventure for a while, and I couln't be happier with what I found. I've played it for 40+ hours now and I havn't even started the main quest.",
            "review_score": "1"
        },
        {
            "review_text": "I liked playing Space Rangers 2 and this smells like it and I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Great small game for free that can get really addicting. great for simple time wasting on long trips, and doesnt use much battery",
            "review_score": "1"
        },
        {
            "review_text": "I liked playing Space Rangers 2 and this smells like it and I love it.",
            "review_score": "1"
        },
        {
            "review_text": "After playing a few hours of Endless sky i had over 100M cerdits and the largest ship on the game. very good 2D game that still needs work. however for a free game its fun. i played mostly offline and have spent roughly 15hours.  Still considerd incomplete as it has no music. could also have a larger 'area' and more ships.  Current rateing 3 Stars out of 5  Is well worth a look if your on the move or only have a small amout of disk space then i reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very high quality game for it's low price of nothing. Though the graphics do leave something to be desired, the game itself has many details just like a AAA title. Funny text also included.  Once you figure out how to jump it's fun, but I spent a while trying to fly to the next galaxy with no success while doing the first escort mission for the Captain.",
            "review_score": "1"
        },
        {
            "review_text": "Hi- inglish i'ts not my lenguash  This game is too good for a free to play game, i will pay this $1 minimum The description of the worlds , the market , the pirate's , all the core of the galaxy i'ts too good This remember me when i play star wars but on 2D and more dificult , the bank sistems i'ts a little easy i only play 3.9 hs and i was kill almost all the time at first . Now i have a big ship and i'ts working prety good  1 ditel , the space rocks or asterois need to chance so if you shot this exploud on a minimun rocks",
            "review_score": "1"
        },
        {
            "review_text": "As an old Escape Velocity fan, this definitely stirs my nostalgia-glands. Jump into a small spacecraft and start trading and doing missions, flying between stars, and trying not to get blown up. This is a very solid EV-like. My only complaint is that the setting seems to be very generic. Having played it for a bit, I have no idea what's actually going on in the wider galaxy.",
            "review_score": "1"
        },
        {
            "review_text": "While I have not played much of this game, I do enjoy and love the familiar yet new feel to this game. I hope that this game gets the recognition it deserves.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those '5 more minutes' games... It's easy once you get the basics and you can end up playing for 2 hours when you planned to play for 30 minutes XO...   It has it's flaws, of course but, considering it's at the start of development and it's free... play it!  Cons: - To me it looses a bit of spectacularity because of the small planets. I don't stop looking at them as I use to do in other space games. - When you are in a system with asteroids... well, they look like popcorn to me. Too many, too much spin on some of them, too fast movers others. - Combat is too fast and I have serious problems to tell who's my enemy and who's not. - The messages from other ships... I almost never read them, being low in that corner.  I know most of this can be 'solved' modding the game, but this is my opinion with the vanilla one.  Pros: - Addictive (a con too ;) ) - 'Simple' trading system if complex/dynamic ones overwhelm you. - The map. - It's very and easily moddable. - It's free (and even it would cost like 5€ or even a bit more I would buy it).  8/10 Will loose more sleep hours playing this game.",
            "review_score": "1"
        },
        {
            "review_text": " Note:   This review was made after playing  v0.9.4 , I plan to update this review when the game hits  v1.0.0    This game needs a  TON  of work, and can be frustrating, but  is still in active devlopment and is very fun even with all its flaws.  It's worth a go, especially when it costs you nothing.   Reminds me very much of old  Sid Meijer's Pirates!  which is one of my favorate games of all time. Only thing that halte dmy session tonight was litterly losing my fleet - I can't find them. One of those flaws I mentioned. I'm going to have to start my whole game over (which is a massive downer) because I didn't save before it happened and all the auto saves are after. Next time I'm just going to build one powerhouse ship instead of collecting so many small weak ones. Its to annoying to try and keep an eye on them all in the current revision of the game because pirates keep picking them off while I try and regroup.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -it has small features that make the experience better -apperehently there are some secrets which I haven't actually found -it is a very relaxing game if you listen to some music with it -just the fact that you can fly in space -you can take over the galaxy  Cons: -has yet to make a number of quests -some unrealistic things, even for the future -a few bugs that can really screw up your game  Overall this game has already done good for me, it gets 8/10, but there are some things it could add.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an absolute gem. Many props.  It's simple, straightforward, and fun when you want it to be, but contains layers of complexity that are not necessary to enjoying yourself.  You want to become a trade magnate? You can do that. You want to own the tourist industry? Go for it. You want to blap some badguys because Superior Firepower? Have at it. You want to have a complex fleet with a mix of long-range, medium-range, short-range, and defensive weaponry? Give 'er.  I grabbed this game on a whim because it was free, and I have enjoyed myself more than I have with some of the 'best' games out there. This game is pure entertainment.  Good on ya for making it, and thank you!",
            "review_score": "1"
        },
        {
            "review_text": "the game isnt bad it does alright but a few things that bug me is the way it feels, looks junky and the dev/form mod w/e seems very prudish and it makes me really not wanna play just like an ♥♥♥♥♥ shop keep makes you want to leave the store though it is a game that you can play to kill time i will warn you there is only one branch of the story in all the time ive owned it and i warn you dont ask questions in discussion as the mod will also badger you and treat you like your stupid",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! I just love this game. I absolutely recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "I agree with all the other praise this game is receiving. Endless Sky is a great game, overall.   I do have a big complaint, however. The very poorly done combat system. I can progress no further in the game because of the endless traffic into each and every star system in the game. The story mission I'm on needs me to fight 1 ship and steal a part. Fine. Dandy. Problem is even when there is a ship alone (since we're talking random gen, here), before I can possibly disable it and loot, another ship or 2 jumps in. Then another. Then more still. Say some of those ships are friendly? Doesnt matter. They blast disabled ships 99% of the time.   0Again, I'm loving this game. As long as I avoid combat and just focus on resources and being a space trucker, very well done. This one issue is game breaking from a storyline perspective. You want to do the missions? Good luck, brother!",
            "review_score": "1"
        },
        {
            "review_text": "This game Is good but they should change the name to endless virginity",
            "review_score": "1"
        },
        {
            "review_text": "Bought Elite in the Holiday Sale, but can't stop playing Endless Sky instead. Like space-based crack, but free!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 buy millions of shuttles and become the swarm",
            "review_score": "1"
        },
        {
            "review_text": "For a game like this, it's surprising that it's free. The amount of customization you can do is amazing. Not just in-game, but the ability to create your own ships or planets is fantastic.   oh, and you can take over entire planets by destroying fleets of ships and then literally nobody else cares 10/10, would take over planet again",
            "review_score": "1"
        },
        {
            "review_text": "Debt Simulator, now with space",
            "review_score": "1"
        },
        {
            "review_text": "hi this game is really good for a number of reasons one of those reasons is it's open source so anyone can fix it except me well the main problem with this game is if you undock, you will die in 0.5 seconds so its best to just stay docked up like eve online",
            "review_score": "1"
        },
        {
            "review_text": "For a free to play game, it's not bad at all. (I have only tried 'starting') but still it seems to be a good singleplayer space game, considering its free to play. As far as i have tried and seen you cant become an empire with lots of fleets and stations - So no basebuilding AS FAR AS I know.   That being said there is other games like this out there (not on steam, yet). That I personally like a lot better. For example: Unending Galaxy, has all this game has to offer (FROM WHAT I HAVE SEEN) and a lot more. + unending galaxy comes in a 'free' version which is the 'WHOLE' game but with no option to mod or use mods. the paid game is moddable + have some extra features that the basic free version doesn't have.  Try this if you don't mind it is in 2D - and like space.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically a free version of EV Nova- obviously the two games are identical, but the overall feel is. Endless Sky is very addicting, but it soon becomes a little too easy to generate income and purchase the most expensive ships and equipment. From there, it seems harder to find any story advancing missions and you pretty much run out of interesting things to do (it also becomes really hard to pay for your crew through missions).  Great game if you don't want to pay the $20 for EV Nova, but it unfortunately doesn't completely live up to it's predecessor.",
            "review_score": "1"
        },
        {
            "review_text": "Essentially a Galactic Smuggling simulator, or a bounty hunting simulator. it's your choice, and while it may seem shallow (and it's not exactly linear in story or instructions at ALL), it's a great game that you can let yourself be immersed in if you choose. And hey, it's free, so the people that won't like it really shouldn't care. give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Great game would be nice if I could see it :))))",
            "review_score": "1"
        },
        {
            "review_text": "Great game, simple to play. I found it good when i had to do something else as well. Made my day a little less boring from time to time. Could have slightly easier to use UI, when i started it was a little bit confusing when i would read stats of ships etc. but after about 30 mins I got the hang of everything. :D 8/10",
            "review_score": "1"
        },
        {
            "review_text": "2D EVE Online                                  For free ;)",
            "review_score": "1"
        },
        {
            "review_text": "nice, nice nice  have to say yes",
            "review_score": "1"
        },
        {
            "review_text": "'Hey how's your college debt?' 'OH GOD YOU HAVE NO IDEA HOW MUCH ♥♥♥♥ I AM IN!' 'Did you buy that sapceship?' 'Yes...' 'You're adopted.' '....You're never going to space with me!'",
            "review_score": "1"
        },
        {
            "review_text": "Captain Watney was disabling a Clipper (WITH A SPARROW). Captain Watney succeeded. Captain Watney was destroyed by a Falcon with heavy laser turrets. Captain Watney died. Captain Watney failed. Captain Watney clicked Load/Save. Captain Watney went to the same system. Captain Watney met the Author (yay!). Captain Watney saw an Argosy. Captain Watney saw it get rekt by the Author. Captain Watney is now a gazzilionaire.",
            "review_score": "1"
        },
        {
            "review_text": "if you like getting in tons of debt this is the game for you  if you like to get constantly robbed then this is the game for you  if you like dieing at every turn this is the game for you!!  lol but seriosly. if you like money/crew/ship/war management exsploreation games? then this is the game for you  and its 100% freeeeeeeeeeeeeeeeeeeeeee !!! so buy now. for free !!   10/10 would buy this game for free again",
            "review_score": "1"
        },
        {
            "review_text": "  Great game!  A good space trade/combat game with a good storyline. Can't find anything negative about this game.  Great job developer(s) (i don't know if it's one guy or several) XD  i r8 a gr8 8/8 m8!",
            "review_score": "1"
        },
        {
            "review_text": "The visual quality is low. The sound design quality is low. There's no music. Combat is aweful. Yet the game pursists with some addictive qualities that can really be fun for a while if you just need to kill some time. Plus, it's free, so no loss if you don't like it.  Overall: 2/5",
            "review_score": "1"
        },
        {
            "review_text": "i give it a 10/10 a simple but great game!",
            "review_score": "1"
        },
        {
            "review_text": "Disabled a ship 2 times my size after a long fight Was gonna loot the most expenseive equipment i could get from that ship Random ship jumps in Fired it weapons for 2 sec at disabled ship Destroys the ship Jumps to another system Flip out for a half an hour about it   10/10 Would get hard work destroyed in a matter of only 2 secs",
            "review_score": "1"
        },
        {
            "review_text": "best game for ever... not really but get the game anyway!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game that I would have happily paid money for.",
            "review_score": "1"
        },
        {
            "review_text": "  Great game!  A good space trade/combat game with a good storyline. Can't find anything negative about this game.  Great job developer(s) (i don't know if it's one guy or several) XD  i r8 a gr8 8/8 m8!",
            "review_score": "1"
        },
        {
            "review_text": "its really fun9",
            "review_score": "1"
        },
        {
            "review_text": "It looked pretty cool, but it frequently dropped to 1 FPS and I could hardly do anything. I don't know if it's something with my computer or with the game itself, but if you want to play it, go ahead. I was fairly disappointed by the poor performance of such a small game that should really be able to run flawlessly on just about anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, to sum it up in a few words: controls are janky, economy is completely static, pirates are pretty overwhelming. These 3 issues kill the game for me, but I will say there's a lot of potential here and I'd be happy to change my review in the future.  I could deal with the controls and the pirates but the economy, that's the real killer for me. I'd love to feel like pirating a freighter has an impact on the economy, or that I can single handedly starve out an entire solar system with a large merchant fleet... I mean, I'm not evil what are you talking about?  Worth noting that the story/writing is fantastic.  As it's free you really can't go wrong with trying it, but I can't honestly recommend it.  Also: While I initially thought the mortgage was a pretty steep challenge to overcome, I realized that it was actually just a tedious waste of time more than anything else. Thanks to the static economy paying it off is a matter of finding the right trade route and mindlessly pushing buttons for an hour. Not really sure if that's a good game mechanic but I'll leave that to wiser minds than mine to sort out.",
            "review_score": "-1"
        },
        {
            "review_text": "i high af rn   It's free, actively being worked on, fairly player-choice, plot-based, has modding, is open-source, fine community, has 'meme', SPACE TRUCKIN' for those who like it, fairly fun 2d spaceship blasting, a great sense of progression, aliens, a big galaxy, and al",
            "review_score": "1"
        },
        {
            "review_text": "3 things that could happen 1. Break your keyboard 2. Get attacked by pirate ship 3.. You fail and die (a lot)",
            "review_score": "1"
        },
        {
            "review_text": "Unless you want to spend hours practicing the game Astroids before playing this one, then well NO. I believe the story line is great and the adventure of the game is also great, but the manuvering and gameplay is worse than playing the old game astroids game. I hope that in the future the game's makers will make this much easier. All of this said is why I only played for about an hour.",
            "review_score": "-1"
        },
        {
            "review_text": "Although the game managed to hook me up for few minutes, it seemed all to plain. I didn't like the feel of the controls and the battle system. I did however enjoy the missions.",
            "review_score": "-1"
        },
        {
            "review_text": "The difficulty curve on this thing is stupid, in all the worst ways. It starts out easy, then becomes nearly impossible, then becomes easy, then tedious, then you're back to spamming saves to keep your ships from blowing up. If you don't mind ending with no resolution, no sense of accomplishment, and a hoarse throat, this thing is still worth no more than you pay for it.  Nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "It's Free",
            "review_score": "1"
        },
        {
            "review_text": "Just couldn't get into it. Interface was confusing. Not very accessible to newer players. Doesn't teach the controls",
            "review_score": "-1"
        },
        {
            "review_text": "+pretty deep for a free game -uninteresting missions  too many time consume reading the guides instead of playing the game, should add interactive guide for new players...",
            "review_score": "-1"
        },
        {
            "review_text": "i about went deaf starting up this game. dont have headphones in when playing this. its silent until you name your ship, then the loudest sound ever happens. maybe ill play it once the ringing and pain stops in my ears. game devs, be careful with the volume to sounds in your game.",
            "review_score": "-1"
        },
        {
            "review_text": "x3 albion prelude, is what you need if you found this game interesting.  Within 15 hours of starting this game, I had the banks offering $250m loans, I had over 20 of the best freighters and found a sweet run of 3 legs between achenar and Delta (food/medical), with in 6 hours I had pretty much done the content. Still a bit of fun.  When I got my 100m loan I started buying new freighters every few runs intermixed with a 5m payment.  Game is good for 6-10 hours, then find a game like x3 albion preludem which is way, way , way better.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased a cargo upgrade thinking I would make more money. Wrong. I started losing money. If developers cant get the simple things right how can we expect them to get the big things right. Not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "The first time i played i was stuck. i couldn't beat a mission. then when i died it didn't load my ship.  3/10 its ok.",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't tell me how to shoot, sent me on an escort mission where I got oneshotted. Combined with no controlls panel in the main menu...",
            "review_score": "-1"
        },
        {
            "review_text": "Even for a free game this is ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't even download the game",
            "review_score": "-1"
        },
        {
            "review_text": "Most seem to think this is a great game... they may be right, but i wouldn't know. This is how my experience went.  1: read good reviews and download game.  2: read a wall of text  3: read another wall of text, pick an answer.  4: read another wall of text pick an answer  5: moved to a select screen that has different boxes all with a wall of text each.  6: managed to get into space which is a slightly prettier version of asteroids  7: figured out how to pull up the map, ah ok there's the system with my mission in it...  8: fiddle around for a few min trying to figure out how to get my ship to do anything, let alone fly to the mission system.  9: give up and quit game.  10: come write a review to make sure that anyone who tries this knows what they are getting into   The game may well be good, but as it stands now i just got to bored and annoyed to get to the 'great gameplay'.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks ",
            "review_score": "-1"
        },
        {
            "review_text": "Very bad",
            "review_score": "-1"
        },
        {
            "review_text": "The game is too simple! It realy disappointed me. It dose not even worth $0.1! I mean, even a small group of people can make this game easily, I don't see the point of making this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I acctualy haven't played it.",
            "review_score": "-1"
        },
        {
            "review_text": "Having played a lot of Escape Velocity this game is very much a successor. It solves a lot of the old control inefficiences while still feeling like the awesome space trading and adventure game of old. Awesome job to the Devs.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so ♥♥♥♥ing awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an awesome tycoon based game, it is non-traditional though I'm where you actually have to go out and activity do stuff but that is what makes it great!! A great pass the time game!",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game! and its free!!!",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game and will be great for anyone who likes to just kick back relax and play throgh an impossible story get shot down in space by pirates and have no way to repair yourself then get killed while transporting a lost family in need and killing them all and then paying a loan that you will get again and again for buying another ship and continuasly float aimlessly through space AGAIN cause your new ship is now broken have pirates plunder your supplies restart you game 5 times at least and spend half an hour trying to figure out how to shoot just to be killed or destroyed or plunderd by mallitia rebels pirates or the empire but yeah over all great game 10/10 would get shot,plundered,disabled,and destroyed by space pirates again.",
            "review_score": "1"
        },
        {
            "review_text": "Got a bit bored after a bit but ok game :)",
            "review_score": "1"
        },
        {
            "review_text": "For a free game that has yet to have been updated with more content/bugfixes/etc., it's incredibly fun and it's got a good amount of content. It's definitely a game to give a try. I would definitely pay money for this game!",
            "review_score": "1"
        },
        {
            "review_text": "Its a very addictive game but the gameplay does get stale eventually. If your the patient kind of person, go on and play you'll have a blast! If your impatient, well i wouldnt recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I do not normally reviews. i liked playing this game but after about 4 hours my ship just disappeared when trying to land on a planet. I could not recover. Every time I reloaded my save I ended up in the same place...could not see my ship and could not do anything to land or jump anywhere else. All progress/time lost. Until they fix this issue the game is unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a very fun game that has a lot of story to it",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool, but it needs a good tutorial with the binds and mission intructions, i didnt understand anything at first, and im still kinda confused. :|",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, its just like Escape Velocity only without having to pay $45.00 for a game that is decades behind its time. :D",
            "review_score": "1"
        },
        {
            "review_text": "I was a huge fan of Escape Velocity back when it came out, so playing this game is a huge nostalgia trip for me. I've played a few other games inspired by EV, but this is the first one I've actually liked. It captures the feel and mechanics in a way that very closely resembles my memories of EV. There are some minor differences, but nothing that really diminishes from the experience for me. In fact, some changes (e.g. loans/mortgages, being able to see what goods trade for in other systems, etc.) add to the experience. The game is free, open source, and (in my opinion) very enjoyable. If you're an old fan of EV, or even if you never got to experience it, I think you should give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Simple controls, very simple 2D space sim. I enjoy the trading.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun space simulator. Best recommedation is to immediately find a way to pay off your debt.",
            "review_score": "1"
        },
        {
            "review_text": "this game is great, mut im still not sure how to shoot",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Get first space ship. &gt;Go around doing jobs. &gt;Still don't have enough money for mortgage payments. &gt;Get killed by the pirates I plan to join once I get a good ship. &gt;No money to buy good upgrades. &gt;Forgot to install new thrusters into my ship after selling the old ones. &gt;GG no re. &gt;Jump around to do more jobs. &gt;Still not enough money. &gt;Now in endless cycle of being royally ♥♥♥♥ed by the bank.  10/10, would get ♥♥♥♥ed financially by bank again.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, fun, free little space trading game. It'd be nice to have Steam Workshop integration, if not planned already.",
            "review_score": "1"
        },
        {
            "review_text": "I have played so little time on it because I got bored and I will probably not play the game again. The drifting comes in large blocks which is off putting and there isn't much help on controls. I really don't like the Sykes of game. But that's just me others may find it fun but not me",
            "review_score": "-1"
        },
        {
            "review_text": "i absolutley love this game for what it is, free to play eve online",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but needs at least a 'restart storyline' feature",
            "review_score": "1"
        },
        {
            "review_text": "Games owns. I'd easily pay $5/10 for the shape it is in now, but to get it for free is awesome. As others have said it's a 2D space sandbox that plays like a stripped down version of Elite, but also with a little twist of EvE: O in there. The writing is surprisingly good and the game strikes a very nice balance between play for 10 minutes or play for hours. The credit grind early is a little tough, but fair and once you start getting into the medium/larger ships can you really start to create some havok.   For something so small this is my current time sink and an excellent one at that.",
            "review_score": "1"
        },
        {
            "review_text": "Complex in its simplicity. Very good game that force you play it, make better ship, earn more money, fight pirates or be one of them. Be sure you spend more time with this game than you really wanted. :)",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely excellent. One of the better constructed games on Steam, and indisputably the best free space game. The only thing I can say about it that is negative is that the main story is not yet implemented, and most quests seem to be random and not hooks. However the developer has stated that they intend to change that aspect of the game, so I have no complaints at all really.",
            "review_score": "1"
        },
        {
            "review_text": "Well, a good way to spend time while not playing some big-♥♥♥ titles.  And when I say 'good' it means I mean it.  It's FREE by the way.",
            "review_score": "1"
        },
        {
            "review_text": "Got missile barraged by pirates in my first 3 minutes in-game.   Missiles/10 would get myself killed again.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly don't see why this game is free. I've played a little bit and I can't wait to try all the different ships. Concept is pretty simple, trade, transport, or pirate (I'm trading/transporting at the moment). Well worth at least a try because who can turn down a free game? I'd say give it a shot, if you don't like it then there's no damage to the wallet. But who knows, you could become obsessed.",
            "review_score": "1"
        },
        {
            "review_text": "What do I have to say about this game..  Endless Sky is a completely free, top-down, 2D space game. But there's more to it than that; think Elite Dangerous meets 2D with text-based story telling charm.   Gameplay:   Gameplay typically goes along the lines of this: Game: 'Buy your first ever spacecraft! Pick from a transport, cargo ship, or a fighter!' Player: 'I want the fighter!' Banks: 'Let me just set your mortgage appropriately...' *Proceeds to suffer paycheck to paycheck*  Yeah.. Never start with the fighter. Bad idea.  Once you get the basics down, a lot of the gameplay boils down to your character trying to earn a living through either pirating, transporting tourists around, and/or shipping cargo around the galaxy, and avoiding pirate raids. Be warned, this game does take a little trial and error before you're able to get the hang of it.  What catches my attention is the surprising amount of story a free game like this has. The random events can range from a funny little fetch quest (Go save my pookie!), to helping scientsts with something, to throwing you the chance to go off on a sudden story quest.  The writing has a charm to it. The dialog is surprisingly well written, every planet, starport, and space station has it's own bio and photo (There are a LOT of planets), and the science is well researched.   OVERALL: 8/10  Upsides:   This game is clearly someones passion project, and the passion shows. From how far I've played, the characters have personality, the writing is vivid, the planets are well thought out, and the story that I've experienced thus far is interesting. I can honestly say this is the first time a completely free game has thoroughly impressed me. This game has well over 15-20+ hours of potential minimum playtime.  Well thoughtout universe and story!  Huge number of ships, upgrades, and planets!  No Microtransactions!  Good autosave system!  Forgot to save and now your flagship is destroyed, along with that cargo that was going to net you 124,000 creds? Don't worry about it, you can pick up back at whatever planet you last took off from!    Downsides:   The initial tutorial quests, which do have some variation (+Brownie Point Get), don't cover as much as they could. They explain the game concepts well, but the only way to learn the controls, how to hyperjump, target, fire, et cetera, is to look in your options menu. This isn't a huge issue, as there aren't many controls for the game and they're fairly simple at that.  The UI could use a little improvement. I'd like to have my flagship's shield and hull stats next to the rest of my fleet, and the enemy's stats nearby, rather than have all three seperated. It makes it difficult to properly manage a ship (let alone a fleet) during combat.  There isn't any way that I've found that will make all of the ships in your fleet jump at once, they go at their own pace and become scattered between planets if you move too fast.    Still not convinced that this game may be a hidden gem? Try it out, it's free, you have nothing to loose!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very interesting, im only 10 hours in but love it so far. I only wish that main storyline was easier to find, and please add a way to join the navy, and republic! Overall very good game, highly reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "Took out loan for 480000 credits  Walked out the door and to the shipyard  Left the shipyard and headed back the the bank  Payed off loan in full  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best. Looked subpar at first, but I am completely sold on the beautiful roleplay opprotunities and simplicity. I love space games and this one is everything I wanted - FOR FREE",
            "review_score": "1"
        },
        {
            "review_text": "It's free and its ok, not the best sim and no tutorials so you gotta memorize some basic keybinds other than that lol w/e ok",
            "review_score": "1"
        },
        {
            "review_text": "It is pretty good by now, especially for a f2p game, but imo there is still some aspects missing like: building a outpost/colonizing a planet/create an empire to rule the galaxy amd much more...  this game has potential.",
            "review_score": "1"
        },
        {
            "review_text": "Starts game and names ship not gonna die  PLays around a bit change the controlls ect Dose the escort mission with no battles dose the gemstone mission gets the a system with the thor hammer..thing big ship protects me i feel safe big ship runs away i died restarts and gets futher meets thor hammer warps away to mission sysetem dies i quit but as i quit i read the death message it looks like it said ship disabled..                                               damn it",
            "review_score": "1"
        },
        {
            "review_text": "The origional Escape Velocity was one of the first video games that really had me hooked, and got me in trouble alot because I would stay up all night playing it. This is a very good clone and highly recommend to anybody who loved the origional and doesn't have an old Mac around to play it on.",
            "review_score": "1"
        },
        {
            "review_text": "This free 2D game made by one person may be one of the best space open-world games I've played in a long time. I have spent several hours in this game creating my own story within the narative the game creates for itself. as others have said it's still a little rough around the edges but I have faith that this will soon be another indy success story.",
            "review_score": "1"
        },
        {
            "review_text": "Repetitive uneventful gameplay. Can't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Ever play space trader as a kid? Wanna play space trader but better again?  This is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, reminds me of one of my all time favorites Escape Velocity! Nicely done with the commodity rates and being visible on the map. I very much appreciate that.",
            "review_score": "1"
        },
        {
            "review_text": "A near identical clone of the old Escape Velocity games by Ambrosia Software; with updated and better graphics. Everything down to the map and travel mechanics, trading, random special/story missions upon entering the spaceport (bar), ship outfitting, and even combat is taken from Escape Velocity.  This is not a bad thing. In fact I'm happy to see an almost 20 year old game reborn into this as it remains one of my top 10 games ever. But the best thing about it? It's free.",
            "review_score": "1"
        },
        {
            "review_text": "So I was starting to like this game, its fun to play and easy to learn.   Until you are leaving a planet and you suddenly notice the second ship you bought for your fleet just dosnt have engines anymore.... just gone... and you cant buy some on a different planet and bring them back to put on your ship nooooooo you are just screwed over by a glitch in the game. And you cant even fix it by spending the money you were saving to enlarge your fleet.  I was just warming up to this game to bad it screwed me over 3 or more times in less than 3 hours of play...",
            "review_score": "-1"
        },
        {
            "review_text": "I'm made speechless by this game. Created and open sourced by a myterious developer, comes this fantastic representation of a classic game genre that I've loved for decades. And, whoever has built this is doing it just for the pleasure of us playing. It's amazing.  Oh, did I mention you die a lot, but it's still fun to play?",
            "review_score": "1"
        },
        {
            "review_text": "All around good game except the fact its low on content and hard to use the editor to make your own.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game , its quick and easy to pick up and really the only fault i could pick with it , is where does it go ? After 13 hrs of playing i had made 30M , but what is the goal ? By the time you have enough money to buy a massive warship or two , the pirates have little to no chance , so whats the point ? That said i throughly enjoyed the making money process and the game is well thought out and easy to play . Overall 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Addictive gameplay, easy to approach and have fun. Still paying off my ship mortage. It is free so you don't have an excuse not to try it.",
            "review_score": "1"
        },
        {
            "review_text": "I've built up a small fleet of larger battleships and I have to say I'm really digging the game play. Storyline is a bit wonky but WIP is WIP. I like the game quite a bit, like it even more that it's Linux friendly.",
            "review_score": "1"
        },
        {
            "review_text": "A top-down space trading/combat game. It is a very faithful recreation of the Escape Velocity series, for any familiar with that (probably the closest I've found yet, even moreso than Naev, which was the closest before this). It has several improvements over EV. Movement is less of a hassle because you can tell your ship to maneuver on autopilot to accomplish things like docking, landing, and lining up with a target. Of course, you can also move manually to fly circles around the enemy or avoid missiles. You can take out bank loans to purchase ships you can't afford yet (in fact you start with a ship mortgage which you will need to pay off as your first hurdle in the game). You have to pay your crew salaries, but you can upgrade them with weapons to make capturing ships easier. You can also loot the ships' equipment as well as their cargohold. The map is very informative, allowing you to see what systems sell what outfits and ships, and what trade routes might be profitable (assuming you've explored the system already). I haven't gotten into any storyline missions, if there are any, but so far I've been having a blast. After trading and missioning for a while I just bought my first fancy combat ship and captured a few wingmen. There is even a ship you may find that pays homage to good old Cap'n Hector.  Pros: - Very close recreation of Escape Velocity with several improvements. - Many different ships and weapons to play around with. - Emerssive world; other ships send you chats and each planet has a story behind it. - Loans and crew salaries give a sense of realism and urgency to keep making money. - Very stable.  Cons: - Sometimes the NPC ship chatter gets repetative and relentless. - Early game can be rather boring (though that might be my fault for starting off as a trader). - Some things are never explained well. For instance, only cargo/passenger missions appear until you earn a combat rank, whereupon other mission types are generated as well. - Some of the sound effects seem rather low-quality (especially the beam lasers, they just sound like a couple keys pressed on a keyboard).  This is a fun game for anyone who enjoys open world arcade-style space sims. And if you ever loved any of the Escape Velocity games, do yourself a favor and give this a try.",
            "review_score": "1"
        },
        {
            "review_text": "If you remember Escape Velocity and EV:Nova, this is a worthy successor to those titles. If you don't have EV nostalgia, it might seem hopelessly old-fashioned, but since it is free, remember that there's nothing to lose to try it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. For the 1980s. I enjoy it, don't get me wrong. But I would love if the game was an MMO.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun game, but it needs music to play in the background.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty simple but is very fun and addicting. Very simple control system on the keyboard which makes playing the game very easy and comfortable. There's quite a bit to do and the universe is pretty big too. On top of that, the devs are not only releasing bug fixes but new features/content also(new alien race, ships, and ship mods). And it's free, which means you have nothing to lose, so take the two seconds to download and at least try it.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE LOVE LOVE LOVE THIS GAME!!! its not even finished and i already am addicted love the trading and combat system cant wait for the updates adding in other plot lines like alien storylines XD its frustrating sometimes but that just makes it more fun in the end",
            "review_score": "1"
        },
        {
            "review_text": "getting off from a planet, when suddenly there are pirates with 3 large warship class, 2 light warship, and 4 interceptor. in a flash, my shuttle gets destroyed.  5/7 will get destroyed again.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this is just Escape Velocity 2015.",
            "review_score": "1"
        },
        {
            "review_text": "This is the sequel to Escape Velocity I've been waiting over a decade for. It's a blend of 2D space shooter with incredible RPG elements and exploration.",
            "review_score": "1"
        },
        {
            "review_text": "Gotta love that it's open-sourced on Github.  Seriously though - solid mechanics, decently fun storyline, and surprisingly deep. Worth checking out if you're into the genre or enjoy open-source projects.",
            "review_score": "1"
        },
        {
            "review_text": "The game is easy to learn and very addicting.  Edit: Some 30 hours into the game and the difficulty has spiked to epic proportions. The realism is intense; if I were an actual space rebel fighting a giant empire, I would be viciously skull-f*cked. That's exactly what is happening with me in game now. I am being brutally skull-f*cked by the power that is the Republic of 'Keep-The-Hell-Away-From-Us' and there is nothing I can do but take it like a champ until some indefinite number of tries later I succeed only to find a bigger, blacker Republic D-!ck waiting for me on the other side.  10/10 still a great game",
            "review_score": "1"
        },
        {
            "review_text": "Endless Sky is one of the best space ship games I have ever played but it could have more chain missions. There should I think there should be some mods made for missions and different looks for the ships. One cool mod that you could make is that there a wormhole to different galxaies (sorry for my spelling). Another idea is that there could be more ways to get missions in the space port.",
            "review_score": "1"
        },
        {
            "review_text": "I'm too lazy to write a proper review. basically trading fighting and mortgages in space. Better than it sounds.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like Escape Velocity (the franchise) and the game NAEV. Unlike NAEV which was greenlight here on Steam, Endless Sky has actual made it so that you can download and keep it up to date in the steam client.  Now as for the game it is classic Escape velocity fun. Get a ship, explore the universe. You choose how you do so and make a living. You can choose to trade, do quests, or be a pirate.  Thats where some of the similarities end. In Endless sky there is the challenge of debt involved. your starting money is completely a loan that you have to pay off every in game month, You also have to pay your crew. This makes it more pressing to earn a living and make as much money as fast as you can.  Now when i first started i left the planet with the absolute joy of starting a new ship and i would leave the planet and explore , wait... whats that? I AM BEING KILLED BY PIRATES!!!!  Died, restart. Leave starting planet, HOLY ♥♥♥♥ MORE PIRATES.  Died.   So as fun as the game can be if you do not get the fire power to deal with the pirates right off the bat you are hosed.  There is suppsoe to also be a way you can get into your safe file and mod it to your liking. Every time i did that, regardless of the OS, It would corrupt my save file and i would have to restart everything over agian with a new save.  Now with all that negitivity that i just mentioned, This game is fun and as addictive as Escape Velocity. I was up so late playing it for so long without break that someone called me a beserker the next day due to how red my eyes where.  Would I recomend this game. **** yes. At this price it is a no brainer.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive!",
            "review_score": "1"
        },
        {
            "review_text": "A pretty fun game for the low price of free ninety-nine",
            "review_score": "1"
        },
        {
            "review_text": "amazing game that is full of ideas. Do not hesitate just because of the not so amazing screenshots, this game will be worth your time!",
            "review_score": "1"
        },
        {
            "review_text": "Space! So much SPACE! I LOVE SPAAAAAAAAAAAAAAAAAAAAAAACE! But yeah this is a fun game!  With Space exploration, combat, economic-based progression, and survial as some of the key components, Endless Sky is a fun, free-to-play game in which player takes on the roll of the freshly licensed space pilot who is about to embark on an adventure of a lifetime. This game is a very open game that urges players to explore the galaxy, taking on missions to earn thousands of credits to keep buying and upgrading ships to add to your fleet. With multiple ways to exapnd, players can have an unstoppable fleet that can handle anything that space has in store for them. If you like space, I would highly recomend this game as it is free to play, so you have nothing to lose!",
            "review_score": "1"
        },
        {
            "review_text": "An old dream coming true. And it's free. Thanks a lot to anyone who made this !",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game enough for fans of the space genre. If you played the Escape Velocity games from the 90's you'll find this to be the perfect spiritual successor. Text based missions, top down game play, tons of ships and outfitting, and a big map; Endless Sky feels like EV in every way, but it's bigger and better. Beyond better, Endless sky has a much bigger story and improves the gameplay dramatically with better fleet management, travel, and menu options. Many new mechanics like having a large crew, a bank for loans, and extensive outfitting really open up the universe of possibilities. For ayone who has never played Escape Velocity but you like space games with mining, trade, pirates, and a choose-your-own-adventure open story, you'll really get a lot out of Endless Space. Hats off to the creator for giving this game away free. I would have paid 20 dollars for the depth and satisfying gameplay and another 20 for the nostalgia. Keep up the great work!",
            "review_score": "1"
        },
        {
            "review_text": "My 'casual game' suddenly became the only game I played for weeks. At first glance, it's a simple sandbox with trading and 2D flight, like Space Rangers. But then I started getting in depth storylines and several ships in my fleet and new weapons got developed as I progressed on the story...  Suffice to say that this game became far, far more engrossing than I expected. The graphics might not seem like much, but the gameplay is engaging, smooth and streamlined, and keeps the important stuff centered, letting AI handle the rest. The whole concept of buying more ships and going from a pilot to a fleet admiral had been tried by other open world games before, but usually not with this level of freedom, flexibility, AND simplicity. I still remember the horror of trying to manage fleets flying all over space in the X series. This one makes it all much more manageable.  That, and I love the storylines. ",
            "review_score": "1"
        },
        {
            "review_text": "Shoot. Capture. Sell. Make money.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just good. Its got trading, lots of customization, and combat all settled together in unison. If you dont feel like trading, you can go kill pirates for even higher profits. If you enjoy just exploring, well, you can buy and sell resources as you make a dash across the galaxy.  All of the customization parts are faction-based, and the factions are very well spread out. In other words, to build the best ship, you are actually required to transcend the entire galaxy to collect the parts you need. Some can't even be bought. Instead, they have to be stolen off other ships, which adds even more difficulty to building 'ideal' ships.  The only thing I don't like is the heavy limitations on engine/weapon setups. Weapons, you're limited not only by what your ship can carry and how many weapon ports it has, you're also limited on how much 'weapon space' you have, if the other two werent limiting enough. Engines, same thing, minus the weapon ports. What if I wanted to create a rideable missile, or simply put stronger weapons on my ship? You are allowed to put on as much shielding as you want though, which I find odd compared to the weapons/engines. Last I knew, shields were more important than engines in heavy combat. (I did modify a ship to have a few hundred engines though, and steadily dropped to &lt;5fps as the stars zipping by merged into a massive white background. I was going a few hundred thousand units/second on a game intended for ~900 tops, lol)  Theres just so much to do on here that it becomes difficult to get off. You think to yourself, 'one last run, then I'm going to bed'. Three hours later, you realize you're still playing. Deffinately worth its whopping cost of 'free', unless you have to work in the morning. If you do, wait until the weekend before getting this.",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice little game, definitely worth the download. However, it's kind of buggy (mostly cause the main storyline is treated as a sidequest, and as such it is very easy to accidentally do something that messes it up and makes it uncontinuable, coupled by the merciless autosave (saves everything you do on a planet, so as soon as you land it saves anything you do automatically, meaning one foul up and your game is ruined.) and in early development, but it's pretty interesting and can keep you occupied for quite a bit.",
            "review_score": "1"
        },
        {
            "review_text": "creat game i wish that there were more like it",
            "review_score": "1"
        },
        {
            "review_text": "All I've wanted since 2002 was a sequal to EV Nova, and it's finally here. Everything I loved about EVN is here, plus a lot of interface and control improvements. I can't wait for more campaigns to get fleshed out",
            "review_score": "1"
        },
        {
            "review_text": "Worth a try.  Multiple ships Good auto save system Combat LOADS of planets Free! No crashes in 5 hours.  Trading is a bit poor, better off doing transport missions, which is a slight disappointment. Could use better balance.  will be playing plenty more!",
            "review_score": "1"
        },
        {
            "review_text": "This game is similar to most other top-down space trade sims I've played (like Escape Velocity Nova, VoidExpanse, etc.) with a few additional features like squad-like AI fleet (which is fun), and it's free!   It's worth noting, however, I'm about 30+ hours into the game and think I may have already broken the main quest.  Still, I'm give it a positive review because it's free and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, I could play this for hours on end.",
            "review_score": "1"
        },
        {
            "review_text": "If you remember Escape Velocity and EV:Nova, this is a worthy successor to those titles. If you don't have EV nostalgia, it might seem hopelessly old-fashioned, but since it is free, remember that there's nothing to lose to try it.",
            "review_score": "1"
        },
        {
            "review_text": "Loaded a save and my Energy was totally depleted. When I saved the game last I had more then enough to land on a planet.  When you run out of energy you cannot turn your ship, meaning you cannot land on a planet. Furthermore you cannot ask for help when you are out of energy, other ships only offer Fuel or repairs. There is no tow option or ability to buy 'jump start' from a passing ship. So if you are out of energy then you are adrift for good and have effectively lost all progress and need to start over. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty good for not being finished im still trying out how to play though",
            "review_score": "1"
        },
        {
            "review_text": "Use shooting mechanics from Asteroids, or use trading mechanics that are less detailed than Mount &amp; Blade (a game that isn't even about trade at all). Sometimes you may be lucky enough for the game to autosave in a sector with an assassination attempt that you can't avoid or do anything about because there are no outfitters or shipyards, if you even had enough money, rendering hours of work null. Good thing it is free.",
            "review_score": "-1"
        },
        {
            "review_text": "There is a glitch where you can't complete the mission in the free worlds segment where you have to take over Menkent and transport Katya, you do that but it tells you you failed the mission, please fix this, thank you dev!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I picked it up not too long ago and started playing it. I sat down and played about 9 hours as of today and I really enjoyed the mathematics, the galaxy, and the ships.",
            "review_score": "1"
        },
        {
            "review_text": "Great! 4 out of 5!  only reason its not 5 out of 5 is cuz it's in the early development stages. sound effects aren't so good, and i wish coming out of hyperspace would stop you instantly in a more star wars-y fashion. but, I'm not saying this game should turn into a star wars-like game",
            "review_score": "1"
        },
        {
            "review_text": "Made the mistake of not buying a cargo ship in the beginning. Lessons learn the hard way   Awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing PC games for 15 years and the entire time I've been trying to get EV to work on them. Thank god this game exists.",
            "review_score": "1"
        },
        {
            "review_text": "Compleatly free, no micro-transactions. Runs smoothly, even on my computer (which is not the best). Overall, fun little time-waster.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AMAZING. It has an amazing story, and with mods it feels like i am reading a book. But don't think that means crap gameplay; the options are ENDLESS (budum ch) for how you will make your fortune: be a pirate? Trade goods? Deliver supplies? Help local militia? Support the Navy? Go crazy!",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game to entertain you while you wait around. In the begining, the morgage you have to pay off keeps you busy. There seems to be a lot in this game for such a small download. Overall great game only thing i would change is to make a tutorial that tells you how to shoot and how outfitting works. There already is something the breifly covers outfitting but it seems like it lack information. Great game and keep up the great work! Now I have something to pass the time!",
            "review_score": "1"
        },
        {
            "review_text": "Got a bit bored after a bit but ok game :)",
            "review_score": "1"
        },
        {
            "review_text": "Was looking for a game for my linux laptop and this one turned out to be really interesting game.   Thumbs Up for a really nice free game.",
            "review_score": "1"
        },
        {
            "review_text": "Really damn fun and pretty massive, especially for a free game.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly addictive. The game play is simple but fun. My only critique is that later in the game the missions don't seem to generate enough income. with high end ships costing $15mil and up it turns into a kind of grind. I can't wait to see how this game grows.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, fun, free little space trading game. It'd be nice to have Steam Workshop integration, if not planned already.",
            "review_score": "1"
        },
        {
            "review_text": "Close to paying off debt. Go to a safe guarded galaxy. Pirates shoot me down. lost everything. Died 20 more times, smashed my hands till they were bloody and still had fun.",
            "review_score": "1"
        },
        {
            "review_text": "not a half bad game its a good timewaster if you like thesse type of games then you sould try this its very cool love watching the ai battle each other",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely ADORE The game but where in the world is multi player! I really want to play with my friends!  Also maybe a better Tutoriel, and maybe a ship design feature? I would love that!  Either way I have been playing this game so much and I love it!",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Escape Velocity Nova this game is a must have! It's very very similar in concept with just enough differences to make you know your playing a different game. If you join the beta stream for updates the beta is quite a bit more polished than the stable release (of course it may have undiscovered bugs as well) but it's definitely a better game with the improvements added.",
            "review_score": "1"
        },
        {
            "review_text": "IDKY but this game is addicting for me. They talk about some game called Escape Velocity, which I never heard of (sorry) that it's based upon, but ultimately for me it reminds me of Uncharted Waters (NES, SNES), but in space. Specially with the pirates, lol.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting game with potential, if you've played one of my favorite games from the Escape Velocity series, you'll like it too.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game , its quick and easy to pick up and really the only fault i could pick with it , is where does it go ? After 13 hrs of playing i had made 30M , but what is the goal ? By the time you have enough money to buy a massive warship or two , the pirates have little to no chance , so whats the point ? That said i throughly enjoyed the making money process and the game is well thought out and easy to play . Overall 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Its free... And its actually good... Nice to see updates as well.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic Game, really clever adding in the banking/loan side of things. Look forward to future updates.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into economy/trade simulators and space, then you'll probably enjoy Endless Sky. I gave it a try and found that it offers enough variety that you'll enjoy tinkering with it for a few hours before you really make up your mind about it. Overall, your gameplay falls into three categories:  1. Make money, or invest in ways to make you even more money 2. Keep exploring the map until you hit the edges and begin unlocking more of the plot 3. Have pew-pew battles in space that involve ships the size of postage stamps pointing lines at each other  Until you have a decent amount of money saved up, you'll want to skip #3. In fact, you have so few jumps worth of fuel that you can't explore #2 without risking ending up in a system without a shipyard or with the shipyard on a planet where the authorities won't let you land. You're left to beg for one more jump worth of fuel from another ship in the system, and you'll get to watch the ship VERY SLOWLY putter over to your position before coughing up some fuel.  So, that leaves us with #1: making money. You're already starting in the hole with a 0.4% daily interest mortgage for your ship, so you can't spend any time exploring. You have to head straight to the grind. By the time you've paid off ship #1 and have moved onto ship #2, you'll have the basic mechanics down. Find a mission or missions in the area you want to go. Figure out which systems you're stopping in to refuel along the way. Use the market data comparison to buy the most profitable cargo possible to sell in that system. Sell the cargo, pick up new missions as applicable, and wash, rinse, repeat.   A lot. For hours.  With a few million in the bank, you can stretch your legs a bit more and explore around the edges of the map. You can even start investing in multiple ships and building up your own combat or trade armada. But, expect to watch your ship whoosh to new systems, slowly rotate, and then whoosh on the next system over and over. And over.  For a free-to-play title, you should give this a shot. It is well put together, visually pleasing (with lots of CC licensed astronomy artwork), and has a decent storyline. The audio is lacking a bit, with the sounds largely coming from the pew-pew of lasers and the whoosh of jumping from system to system.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Downloads the game &gt;I guess i'll play it a bit &gt;47 Hours later &gt;YARR MATEY GIVE ME YER CARGO OR FACE DEATH &gt;Aaaanddd my save file somehow dissapeared",
            "review_score": "1"
        },
        {
            "review_text": "Its free and 2D, but that doesn`t mean its low quality. This game is still being updated and new features and content continues to be added, and so far its already an amzing game. The storyline is fun to play, if you manage to actually get a storyline mission, and there is tons to explore. do admit after a while when there isn`t enough to explore and rebels don`t seem to want to give you missions, it gets kind of boring, but they are adding more and more stuff so soon there will be much more replayability and it will probably be easy to access the story.   Overall this game is great and its free so why not give it a try?",
            "review_score": "1"
        },
        {
            "review_text": "Very easy to get stuck into for hours on end, much like Escape Velocity :)",
            "review_score": "1"
        },
        {
            "review_text": "Not sure what the issue is, but I'm not able to use my mouse in-game. Any ideas? I did wake up to having Microsoft AI Cortana loaded.. Not sure where that came from. I've tried rebooting several times. Mouse works just doesn't show up in game.",
            "review_score": "1"
        },
        {
            "review_text": "While Endless Sky is an obvious spiritual successor to the Escape Velocity games, there's also a feeling of, 'this is only the beginning'. Only one of the main three story lines has been implemented so far, and there seems to be the potential for more triggerable missions and alien interaction, but even with just the skeleton there and usable, it's a fun game, but it's also very obvious that the content is only  starting  to be made by a wide variety of contributors through its Github.   And that's probably the best part, not only is Endless Sky good, it's also free as-in beer and free as-in speech.  Probatus et gratis et libre.",
            "review_score": "1"
        },
        {
            "review_text": "It is single player game. Better than original elite but very old style and i wonder why author still continue development for free. However, if invested to multiplayer upgrade, it could be great game and make him rich for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Very great game to pass time. I am still wondering on how this is free to play!",
            "review_score": "1"
        },
        {
            "review_text": "Menu interface could need a bit of improvement. Having to call out starmap and click every time you want to jump is quite annoying.",
            "review_score": "1"
        },
        {
            "review_text": "'I can't believe the Greasemonkeys destroyed the Airhammers last night.'  10/10 dialogue  EDIT: on a serious note, as of the many hours I've played this simulator, I'd like to thank the creator and everyone and anyone who has contributed to this well-made space-sim. This is my opinion of the game so far:  Pros:  The main campaign is pretty good and I won't write anything about it as to not spoil anyone.  There are other races other than humans.  You can equip a 'cargo' ship with a billion missiles.  There is almost no limit to how many ships can be in your fleet  A lot of areas to discover  Can run on a potato  Karate chops  It's FREE  Cons:  A whole lot of grinding for better ships  Literally start with the 3 ♥♥♥♥♥iest ships in the game  Being a trader/transporter almost gives no reward(early in the game)   Overall I really enjoyed every hour I played with this game, it's a lot of grinding and dying in the beginning but I think it just adds more to the challenge and makes the rewards more satisfying. Also, it's FREE, it costs nohing to try it out.  overall 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Played it for about an hour, it was okay. I mean I can see why people could enjoy this game, I just got a little bored.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't felt the need to review a game before. Most games are just okay, they deliver what they deliver, and I try to convince myself I can justify the purchase.  This game, however, is a very different story. First and foremost: it's free (at least it is at the time of this review). So even if you don't like it, there's no loss of money. Second: Unlike most free-to-play titles I've spent time with, this one has zero microtransactions. There's nothing that real money will do for you in this game, unless you're buying a new computer to play it. Which brings me to three: This game runs excellently on my laptop, so it's going to be one of the best and most portable games I play. Awesome!  So, here's how my gaming experience has gone: - Picked the hauler as my starter ship. - Hauled things. Made money. Paid off my loan. Bought a bigger ship to haul things. - Hauled more things, made more money. Paid off my loan from the new ship. Bought a newer, bigger ship. - Decided I wanted to do something other than haul, so I started a new character with an interceptor. Didn't like it, so I bought a fighter to accompany my hauler. - Cleaned house while hauling things through space. Pirates stood little chance. - Liked how this was going. Bought two more fighters to accompany my hauler.  I'm currently cleaning up space of pirate scum while making bank so I can buy more ships, and despite the simplicity, I'm looking forward to seeing where it goes from here.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the most brilliant things I've played in a while and not just because it is free - in re mechanics It is quite similar to games such as X3 and Elite: Dangerous, but it's top-down aspect makes it easier to follow. If you're looking for amazing graphics and cool explosions this game is probably not for you, however if you are looking to spend some good time with an arcade-ish space sim that has a fairly detailed universe and reasonably immersive gameplay, you should definitely try this. Or just try it since it is free and only a few hundred MB download",
            "review_score": "1"
        },
        {
            "review_text": "so i got this game awhile ago while going on some rampage for games and thought 'i will play it eventually' 3 months later i decided to actually play it. i meant to for about an hour, but like basically everyone... i played untill 1 am, for you get caught in battles, debt, pirates, debt,debt, cargo, passengers, debt, debt.",
            "review_score": "1"
        },
        {
            "review_text": "very fun :))  its also free  all should get it",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game, but after experiancing how accurate the banking system seems to be, I'm dreading my future student loans.",
            "review_score": "1"
        },
        {
            "review_text": "Let me just start by saying that this is the best zero dollars I have ever spent on a game. I am not sure where to start, so let me tell you the story of Captain Vic Edwards, Pirate Hunter, in my own words.  Young Mr. Edwards walked into the bank, he was sure of this. He knew what he wanted more than anything was to pilot his own ship. Even if it meant going into immense debt in order to buy it. After handling his business with the bank, he jetted straight for the shipyard. Three models are manufactured at Edwards' home planet, New Boston. The first, a Shuttle, well balanced for any small jobs a new captain may take on. The second, a clunky Star Barge, made for shipping and not much else. The last one stopped him dead in his tracks. It was beautiful. The Sparrow, the cheapest interstellar ship rated for combat. The salesman warns you as you prepare to take off that a very high percentage of new pilots die within one week of purchasing a Sparrow. Well, it was too late for that, He christened the ship 'short sword' and left the planet. Space was everything Edwards had dreamed of. After a few random courrier missions to some close star systems, he decided to explore. At the rate he was going, it would take forever to pay off the loan. There must be faster money out there, he thought. Then, in an uninhabited system, he saw them. Pirates were attacking a Star Barge. His first instinct was to flee, jump to another system, to safety. He couldn't let that happen, though. He had to intervene. He was apprehensive about opening fire so close to the friendly ship, especially since he hadn't fired one shot since buying his ship. It was now or never, he pulled the trigger. Shots went everywhere. His ship pointed in all directions, Edwards attempting to aim at the pirate while avoiding the friendly. Every beam of energy seemed to pass over or under the friendly, and the few that made it, actually hit the pirate. Then the pirate switched targets to Edwards. The Star Barge, free of bombardment jumped out of the system. It was Edwards vs. the pirate. Equally matched in terms of equipment, the two ships squared off, kind of. Edwards aim was so bad, when his shield was almost depleted, he tried to jump systems. no luck, the energy blaster fire was enough force to push his ship so that the hyperdrive wouldn't kick in. Shield was completely depleted and Edwards was trying to outmaneuver the insatiable pirate. Finally, help arrives, in the form of a massive Republic Defense Fleet. One Corvette annihalates the pirate in a few shots while a pair of capital ships roll up. The sight of saviors is short lived as an opposing fleet of pirates jumps in from the opposing system. Edwards jumped back to safety and landed on the nearest planet. After landing at the spaceport, Edwards looked up at the heavily damaged hull and said, 'I need a bigger ship' After several different ships, loads of cargo, a mad scientist, a woman who spends way too much money on a dog, a few escort missions, a ton of pirate bounties and meeting a couple of alien races, Captain Vic Edwards is a known name in the Galaxy. His fleet is headed by a Bactrian city ship known as 'The Citadel' he is acompanied by 2 Heavy Interceptors and an alien heavy warship with an extreme shield. All are armed with a combination of human and alien weapons and equipment. With over 200 million credits in the bank, life is good for Captain Edwards.  TLDR: Download this game. It is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game plus ITS FREE, takes a while to get good at the game but once you really play its really fun great storyline sure its not multiplayer but i still totaly recomend this game to anyone. i would really like to see multiplayer come into this game but its still AWESOME as is",
            "review_score": "1"
        },
        {
            "review_text": "Heavily inspired by Escape Velocity (so much so that it even steals the tutorial :P) but the game is a lot of fun, it's one of the gems on the free2play market on Steam.  Not sunk much time into it, but I've enjoyed what it is.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic 10 outa 10 ign ",
            "review_score": "1"
        },
        {
            "review_text": "An excellent f2p space game with lots of interesting content and missions  This could become better if there is more content and polish added into the game but so far, its really good for a f2p game",
            "review_score": "1"
        },
        {
            "review_text": "great game !  ",
            "review_score": "1"
        },
        {
            "review_text": "Good story, though i didnt follow it. I hope more content will be added! 8/10 for me (+1 free to play). And really want more missions where you can read what happened to people. I like 2D and here i think its better that way. (If developer could please add story where you can decline the free worlds and you can buy things from pug etc. :) )",
            "review_score": "1"
        },
        {
            "review_text": "I've been looking for games similar to EV since i finished EV:Nova, that's 14 years now, and when i finally find it, not only is it perfect, it's also free? Am i dreaming?  The trading is improved, the ships are lovely, and there is still that text-based-adventure feel going. I've yet to fight, since i prefer to trade/run missions in the beginning, but everything else feels just like it should.  The only massive con i can find is that i can't pay the lovely man that made this &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "great game !  ",
            "review_score": "1"
        },
        {
            "review_text": "Why is this game free? It's awesome. I'd pay at least $10 for it; maybe more depending on the amount of content. I haven't even finished it yet.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game so much, I suck at it  so of course I change stats for the cheap parts has a ultimate sparrow realizes that pirate ships actually use given parts  finds invinsible pirate all because you sucked at game haven't even beat story 'clap clap clap' i am so good at games  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I wish there was stronger praise than a simple 'thumbs up'. As a huge fan of the original Escape Velocity series, I fully appreciate what the developers are trying to accomplish here, and they have succeeded in every possible way. They resisted the urge to change the core mechanics of the game which already worked so well, and added a couple of new features that are plausible evolutions of the core mechanics. I love that the game is open source and so easy to modify and create content for.  I don't care that the game is not finished and this or that feature is not ready yet. It doesn't matter.  I would gladly have paid for this game, but since it's free, I don't know what to say. How could you possibly go wrong giving it a try? ",
            "review_score": "1"
        },
        {
            "review_text": "Good fun and simple Game, Long to get into but has very grabbing storyline. That and blowing up whole enemy fleets is fun. Just needs more faction storylines and longer stories.",
            "review_score": "1"
        },
        {
            "review_text": "This game surprised me with its well written dialog and natural storyline. Love the verity of play and I cna see my self spending alot more time on this game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not good at writing reviews so I'll keep it short and sweet. If you love the Escape Velocity games, you will absolutely love this. I would randomly do a google search for 'Escape Velocity type games' etc. and never find anything that filled that niche so I would just install/play EV Nova. Well I pleasantly stumbled upon this game the other day and haven't gone a day without putting 2+hrs of game time into. Best of all....it's FREE and open source!!",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game, quite atmospheric. And it's free! Try it and see if you like it!",
            "review_score": "1"
        },
        {
            "review_text": "I always loved the escape velocity games. I am glad someone brought it back",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a Nostalgia Binge for Escape Velocity players. Can't wait to see more DLC and updates to bring more life and missions to the game. Congratulations Mr. Zahniser, this is a brilliant game!",
            "review_score": "1"
        },
        {
            "review_text": "Endless Sky is a good free to play game and I wouldn't imagine it any other way at the moment. The problem is it gets very repetitive very quickly. I'm at 10 hours of game play writing this review and I'm not feeling motivated towards putting more time into it. You get to explore a galaxy of systems and trade various commodities between planets, occasionally fight pirates and rarely you get some exerts of story here and there. You can grind for buying better ships and build a fleet, but the point seems moot as it's just too easy to survive with a plain Clipper or Blackbird running errands. Essentially that's what is on the cover and there isn't much more to get.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun, the detail and writing that goes with the story and each planet is fantastic, and the gameplay has the right balance of simplicity and complexity (if that makes any sense). if you want something to play casually, but that might be a little addictive I'd reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds of a lot of the games I played in the days of flash games, and is also free.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun and addicting game. Although one thing that could be better is if there was voiced dialouge. Becasue the conversations while few can fell very much like a wall of text. If this were impoved it would make this an even better game.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable for a free game, keep going dev, love you",
            "review_score": "1"
        },
        {
            "review_text": "It's the best thing since Escape Velocity. Super easy to pick up, super fun to play. Whoever is developing it played a LOT of EV and EV: Nova. Worth every secon of your time!",
            "review_score": "1"
        },
        {
            "review_text": "This game brought back Escape Velocity nostalogia. 10/10 - it feels more like the orignal EV rather than the any of the EV sequels.",
            "review_score": "1"
        },
        {
            "review_text": "I feel like I've been travelling through a series empty systems with a single ramscoop/solar panel looking for something like this for a decade. A spiritual successor to EVN that is being updated fairly regularly.   As of now, the storylines aren't as melodramatic as EVN's. Probably not everyone's cup of tea anyway, but I miss that.  The game has a lot of potential though, even now. Sink 40+ hours into this game, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Simpistic but fun, reminds me of Traveller D20",
            "review_score": "1"
        },
        {
            "review_text": "Good game about space trucking, or space bus driving...   without being able to expand out zoom or in... combat in this game is ♥♥♥♥ poor. combat missions are poor  you need to Truck to get the cash to get a ship worthing fighting with but after you get the best ship in the game then what?  there is no quest, nothing to do beside random missions  it is good for about 20 to 30 hours of game play before you hit the highest ship which cost 25M.    After that i see ZERO point to this game being it is not a MMOG, it is a really good base model for a game... with no point. You can't own land, house, station, a moon or conquest or have a base... it is really about Truck Driving.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It has an amazing playing style. If you like Galaxy on Fire, you'll love this game. The 2d is actually prefered because my computer is about 5 years old, but it doesn't detract from the gaming expierence. What I alo find amazing is the fact that I have 21 hours in-game, but I still haven't scratched the surface of all the galaxies and systems out there. I rate 5/7.",
            "review_score": "1"
        },
        {
            "review_text": "The game is Incredible  Pros  -Free -Controls are relatively simple -There are multiple ways to play  Cons  -At the start of the game you have to pay off a mountain of debt -No tutorial",
            "review_score": "1"
        },
        {
            "review_text": "Love all the things that there are to do and figure out right as you jump into the game. Also love the feel of the game in general.",
            "review_score": "1"
        },
        {
            "review_text": "It's Escape Velocity...that you can buy!",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me   positively   alot of a fanmade Star Trek flashgame I played years ago. The game is very simple and easy to understand, you basically get a loan from the bank, buy a ship and then you can either start trading goods, play space-taxi, persue a militaristic/piratehunter career or become a pirate yourself. Preferably while paying off your bank-loan. A negative thing that I noticed is that there is apparently no way to change the difficulty ingame (game is very easy as of right now, in terms of money making). Nonetheless I already wasted 6 hours of my life on the game and it doesn't seem like a bad investment at all. The game becomes somewhat of a grind after a few hours, but until now it still felt pretty rewarding when you just finally get the money for a better ship. I had  alot  more fun with this FREE as-a-hobby-developed  ?   game than with certain overpriced 'AAA' games.",
            "review_score": "1"
        },
        {
            "review_text": "I picked up this game just a couple hours ago and have been thoroughly enjoying it, but the one thing that is bugging me is that there is literally nothing in the game that costs real world money. It's free to play, has no DLC, nor any microtransactions.   I mean, don't get me wrong, I'm not complaining per say, but I know that my spending habits show developers what I want to see made and what I will spend money on. I want more games like this made (Hello Starpoint Gemini!) and I want the ability to show support to the developers who have made me happy.   I will do some research into if this Dev has a Patreon account set up or something not in-game to show my support through, but in the meantime, if you like space sandbox games like this and want to see more of them, give Endless Sky a thumbs up and show the developer that you like his game. Show the other Dev's that you'd be willing to play more games like this and possibly spend you money on them!",
            "review_score": "1"
        },
        {
            "review_text": "Props to you guys for making all the AI ships and everything in this game. ITs amazing!!",
            "review_score": "1"
        },
        {
            "review_text": "I love Endless Sky.  It's free, but I would happily pay for it.   It satiates my need for a Space Exploration RPG.   It is 2D, but it mixes simplicity with complexity very well.   You can make your money different ways, such as being a merchant, a raider, a glorified space bus or protecting convoys.   I've put in around 120 hours at this point, and there's still many things I haven't done, though a large portion of my time has probably been spent working out how best to to utilise cargo, weapons, engines and shield space. which isn't necessary I just like to be efficient.   Like I said, it's free, so nothing to lose by trying it, other than hours of your life you'll never get back and a step closer to the endless void that will eventually devour us all.",
            "review_score": "1"
        },
        {
            "review_text": "This is without a doubt one of my favorite games on Steam, not only because it is free but because it also includes aliens, various types of spaceships, large space battles, a very large area to fly your ship in, and mods, which also allow you to add your own storylines, and weapons/ships.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Reminds me a lot of Escape Velocity. Looking forward to where else this goes.",
            "review_score": "1"
        },
        {
            "review_text": "For the few hours I've put in to this game all I can say is that I love and have recommended it to all of my friends to try.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Pretty creative top down space game where you manage a ship and destroy other enemies, or trade. ",
            "review_score": "1"
        },
        {
            "review_text": "Only played a lil bit of this &amp; honestly, I'm blown away! Like Escape Velocity? IS a 1000x better than EVNOVA! I thought I was gonna be harsh &amp; critical of this game, but nope, this game DESERVES attention.  Why the Devs are making this FREE TO PLAY is beyond me. If they add Multiplayer to this game, hoooooo boy.... it could go from a 10/10 to a 50/10!  Play it! You seriously will NOT be disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "As a free, open source game, it's relatively steamlined and no-frills, but it captures all of the core features of exploration, trading, combat and customization that a player could want from an entry in the genre. The ship designs are generally great, and there are some nifty Easter eggs tucked away in secluded corners of the galaxy. It's very easy to say, 'Just one more supply run,' only to look up at the clock and find that you've been playing for two more hours.",
            "review_score": "1"
        },
        {
            "review_text": "I think I've become addicted to this thing. Absolutely recommendable.",
            "review_score": "1"
        },
        {
            "review_text": "The game covers almost every necessary factor in a space game.Well dseigned ship configuration system,amazing 2d combat experience.It absolutely captures the sprit of space game imo.",
            "review_score": "1"
        },
        {
            "review_text": "Exceptional game all in all, my only criticism is the lack of guidance pertaining to missions. Despite this I'd highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing. i would pay 10 dollars for this at least but it is free! i dont know if you still make games but i hope because this game is just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, a lot of flavor and challenge. Just started, but will definitely keep coming back.   Also, available for linux! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I've played this way more offline, probably something like 50-55 hours. All I can say is that this game is suprisingly good. It's not very well known and it's not that groundbreaking. It has a charm to it that I really can't explain. Maybe it's the gameplay reminiscent of an early trade-based game. I don't know and I don't care why I love this game so much! It's free, give it a shot. It's not for everyone but I imagine others will enjoy it like I do.",
            "review_score": "1"
        }
    ]
}