{
    "app_id": 404480,
    "name": "SC2VN - The eSports Visual Novel",
    "release_date": "2015-09-22",
    "developer": [
        "Team Eleven"
    ],
    "publisher": [
        "Team Eleven"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Visual Novel",
        "Anime",
        "Free to Play"
    ],
    "achievements": 0,
    "positive_ratings": 786,
    "negative_ratings": 59,
    "price": 0.0,
    "description": "SC2VN is a visual novel about the South Korean StarCraft 2 scene. You play as Mach, a foreign semi-pro trying to make it in eSports who soon learns that success in StarCraft takes more than in-game strategy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/404480/header.jpg?t=1538254535",
    "minimum_requirements": "OS: XP Processor: 1 Ghz Memory: 1 GB RAM Graphics: DirectX or OpenGL compatible card DirectX: Version 9.0c Storage: 560 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well worth a few hours of your time, this free Visual Novel is a great peek into the sorts of challenges facing someone looking to become a professional gamer. There's some concessions of realism for the sake of story, but they don't hinder the game in any real way, and I found myself actually interested and even caring for/about the characters.  The interface is clean and responsive, and the medium is put to good use, as there's little things that happen, like interruptions which wouldn't be possible with a non-interactive book. Do note, however, that while you do get to make a few decisions here and there, this is less of a game than an experience, so the emphasis is on telling the tale of Mach and his/her journey. That's standard for many VNs, but it has to be noted, because this is a genre that will be new to many players.  I personally feel it's a better experience with the female protagonist, as then the issues of discrimination and sexism are more relevant, as well as some of the bonds formed between characters feeling more true to life, but it's not heavy-handed with either player choice. Although fictional, there's quite a bit of historic fact and character traits based off real people included, so, in a way, SC2VN is educational as well.  Recommended for anyone interested in eSports, StarCraft, gaming in general, or just a few hours of reading and enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "only god can judge me now",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful tribute to the human side of professional esports.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who played SC2 and even saw glorious days of Broodwar in the past, and actually currently following the esports scene of that MOBA mentioned in the game with great dislike ^^, I liked the game. It is mostly about the hardships behind pro gaming and how competitive and unforgiving the scene is.   Cons: - It is a short VN - There could have been more drawings of the characters and their expressions.  Pros: + Original e-sports story + Nice visuals + Price :)",
            "review_score": "1"
        },
        {
            "review_text": "When I went into this game, I expected it to be sort of like Katawa Shoujo, but with StarCraft, and less sad. Instead, what I got was genuinely good writing, with good visuals, and a great story. As a fan of eSports, it was interesting to get insight into the more human aspects. Let me break it down a bit.   The writing. It was really good. Characters were believable and likeable. The dialogue conveyed what was meant to be brought across.   The visuals. The game looked nice. I'm somewhat a fan of the style used here, and the backrounds looked great.  The story. Without giving away too much, it follows a upstart SC2 player who travels to South Korea in hopes of making it big in the pro-gaming scene. It was really interesting, and I found myself invested in what it told. One complaint though is that it was over a bit fast, and the ending leaves a bit to be desired. However, a sequel is apparently a possibilty, so I hope that is the case.  Overall, this is a surprisingly good game, and I definitely recommend it to fans of VN's and really anyone who looks for a good narrative.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I've never really followed the SC2 scene but I still got caught by this visual book.  Every gamer that tried to play seriously on whatever game should recognize himself, at least a little, dreaming of fame, friendship, money,... thanks to his gaming passion :-)",
            "review_score": "1"
        },
        {
            "review_text": "Nice story, not much interaction but I guess it's a narrative VN, good graphics and music :) It does its job pretty well, you really feel immersed in the competitive world of korean eSports. Actually it feels like a sport VN, but with eSports instead :P Surely, Starcraft 2 players will feel at home, but I don't know the game at all and I still enjoy it a lot :) Also, you get to learn some specialized vocabulary! :D (there's a glossary so you don't feel lost) Would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "  Though it was a very short VN, the story was amazing. It truly captured what it would be like to be an esports player and how difficult it was. The people the character I met along the way contributed to her eventual success which each other having a unique and positive impact on the main character.",
            "review_score": "1"
        },
        {
            "review_text": "this game. man this game is amazing. i have never played sc2 for the record but i loved this vn. it gave me the urge to buy sc2 and try to go pro (which would never happen) the only problem i have is it coud be so much longer and the lack of choices. i would either wish for another sc2 vn or any other esports game",
            "review_score": "1"
        },
        {
            "review_text": "A great (although short) VN. Never played StarCraft 2, but this game made me see how hard and stressful it is to be a pro-gamer. Free and fun. Go for it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, polished to perfection in everyway. Just a little bit short though.Hoping for a sequel. ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game to get to know about the Star Craft e-sport scene!  ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic visuals, good writing, compelling story.  Awesome work!",
            "review_score": "1"
        },
        {
            "review_text": "This was a really cool story. I kinda wish that it went longer but it was still cool. Plus, now there's one more Starcraft playerinthe world (me :P)",
            "review_score": "1"
        },
        {
            "review_text": "Wow, If you play starcraft and have ever taken the game seriously you will relate to this game on a whole new level. I felt like this game really gets me, and on top of that its a fantastic story. I had a good time reading through it and it really motivated me to play more starcraft, so if you are tired of laddering and want to take a break. go ahead and play through this game in your spare time.",
            "review_score": "1"
        },
        {
            "review_text": "Ayyy who else is tryna ♥♥♥♥ JETT",
            "review_score": "1"
        },
        {
            "review_text": "Starcraft pro 1 simulator is the best one",
            "review_score": "1"
        },
        {
            "review_text": "I came in expecting to make a review about how I accidentally became a pro.  Turns out, Reva is my waifu. This works too. 10/10, would get cucked by Accel again",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, though I have some quips with the OST, it is still sound, and that's only because I'm a music producer. This game has been fantastic so far, enjoying it fully. Would recommend to any starcraft player, especially one who watches the scene. If you're bronze or silver don't expect to fully understand some of the game mechanics involved, but that's fine, it's still a fun.",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded this visual novel for something to do and I can honestly say that it blew away all of my expectations. If you are a fan of starcraft or esports scene, you should play this. Although it is not very long the way that the characters are developed make you feel as if you are a part of the story. I cared for what happened during the story, cared for the characters. Very excellant!",
            "review_score": "1"
        },
        {
            "review_text": "I can't get how a VN with 3 hours of duration where every choice you make does not change anything in the history can have 95% of it's reviews marked as positive. There is only a correct path on the history, and if you don't follow it, simply you get kicked to an standard 'Game Over' screen. Also it makes no sense that the story is focused on 'becoming a champion of VSL', and the game ends when you get a sponsor and join a team. ",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunatelly its not a very creative game, although it is a decent interactive sport-anime. Could be worse, could be better. Not a waste of time though.",
            "review_score": "1"
        },
        {
            "review_text": "It ends at such a weird timing feels like the game wasn't finished. It feels like there are more dragonball refrences than there is starcraft refrences. short and boring but got me intrested in starting starcraft so will give it that",
            "review_score": "1"
        },
        {
            "review_text": "GM but doesn't know how to wall off natural properly... 'Do they teach you this stuff on NA server??' Even in the VN terran OP  11/10 would extractor trick again",
            "review_score": "1"
        },
        {
            "review_text": "It is great.",
            "review_score": "1"
        },
        {
            "review_text": "The Dream is Dead!",
            "review_score": "1"
        },
        {
            "review_text": "the best visual novel ive played, but it's the only, and it's bad",
            "review_score": "-1"
        },
        {
            "review_text": "This is bad",
            "review_score": "-1"
        },
        {
            "review_text": "i want a cs:go version so i can understand",
            "review_score": "1"
        },
        {
            "review_text": "This is a very simple story. It is also surprisingly moving and detailed for the supposedly simple topic it covers. Good work to the creators on writing the story and melding the music and artwork together. If you like Starcraft 2, or are interested in the team aspect of ESports, you may want to play this. It's quite short at just over 2 hours for me(I rushed a moderate amount), though I don;t feel it is a bad point. Really felt the need to give props as this seems like a very thoughtful visual novel.",
            "review_score": "1"
        },
        {
            "review_text": "Good pley",
            "review_score": "1"
        },
        {
            "review_text": "A good insight in eSports and the different types of StarCraft communities. Definitely a good visual novel.",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly engaging and entertaining. Well worth a go!",
            "review_score": "1"
        },
        {
            "review_text": "I dont like visual novels that much, but this game is great: the chartcters are great, the overall story is great, and the humor is great.  PLEASE 11/11 MAKE A SEQUEL I BEG YOU",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good for the price.",
            "review_score": "1"
        },
        {
            "review_text": "D I G I T A L S P O R T S pretty good even though it's short they even got day[9] to do some voicing",
            "review_score": "1"
        },
        {
            "review_text": "Simple game but very short. game only lasts around 3 hours but gives you an interesting perspective of Esports",
            "review_score": "1"
        },
        {
            "review_text": "I love visual novels. This one was not only free, but free of meaningful content as well. Your decisions don't affect the story much at all, and that's honestly the biggest no-no with a VN imo.  I can only recommend it because it is free. Don't expect great storytelling here.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a must experience for anyone that closely followed StarCraft 2 during the Wings of Liberty days. There are a lot of things in this novel that pay homage to the golden age of SC2 so far: a girl pro that represents IdrA, the GSL, TeamLiquid/Reddit and its involvement with the pros, the passion of the foreigner dream, the conflict of SC2 and SC:BW in Korea, the aspirations of a team trying to make it in the market. All very good stuff that is very recognizable from someone who experienced it first hand.  As for someone that hasn't played StarCraft before, there is an introduction with guest voicing from Sean 'Day9' Plott, but I'm not sure exactly how it will work out for you. Take a dip, anyway!",
            "review_score": "1"
        },
        {
            "review_text": "While I have almost no idea what a lot of this means, it's still pretty fun and a decent story. Truth be told, I did actually learn some things about StarCraft and its community.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a Starcraft player, but this novel is amazing. 10/10. I wanna see sequel",
            "review_score": "1"
        },
        {
            "review_text": "Was pleased.",
            "review_score": "1"
        },
        {
            "review_text": "This game was awesome! I am proud to have experienced playing it!",
            "review_score": "1"
        },
        {
            "review_text": "I'm glad I gave this a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Very great VN, but I want more :( I would comapre it with some others VN it's better than most of 20€ VNs",
            "review_score": "1"
        },
        {
            "review_text": "Worth a download.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this, it's very rare that I actually care about the main character in a VN.  It also did a great job at explaining the story and the 'action' scenes were exciting even for someone like me who has never even seen a game of Starcraft.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, this game is awesome, the creators are awesome, you're all awesome. But I swear, if there isn't a sequel, heads WILL ROLL!!!",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game over twice and will probably do it again. The worst thing about it is that there is no more of it.  This game hits all the right notes: it's instantly intriguing, the characters around you are people you'd want to know, and the story punches above its weight class for such a short VN. The art is good (the colouring is great), it's efficient -- not a lot of bloated dialogue, no clunky writing -- and your character's story instantly engages. The game does a good job of portraying a side of eSports audiences don't really get to see, as well, in a way that's unadorned without being depressing. Not voiced (not surprising), except for the fully-voiced explanation of starcraft, which was really well done.  I'm shocked this thing is free. Would have been happy to pay for it, and am looking forward to giving the creators my money in exchange for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Good storyline  Good scoring  Refrences galore  Cons:  Sometimes the noise cuts out, but that might be because of my compooter",
            "review_score": "1"
        },
        {
            "review_text": "Played this game before it came on steam. Really shows you the hard work and toughness it takes to make it big in Korea as a Starcraft Pro. Really nice visual novel, especially the music! Temp0!  GG no re  ",
            "review_score": "1"
        },
        {
            "review_text": "A heart warming story of a young individual risking his/her future for her passion, touches on several issues experienced by professional starcraft 2 players both in the competition and the drama behind the scenes. Allows the player to emphasize with the hardships and lessons that many progamers experience such as fear of being trapped into a corner fearing to admit failure, as well as the difficulty in dealing with loneliness.  Highly recommended to everyone who is interested in biographies or the starcraft 2 scene.",
            "review_score": "1"
        },
        {
            "review_text": "liked it want there to be a sequel really good story to me. really fun",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the game, I loved the fact that its unique. To me its not that long but I'm a fast reader. I 100% would recommend it! :3",
            "review_score": "1"
        },
        {
            "review_text": "If you have any interest in visual novels and/or the sc pro gaming scene in general is should prove to be a worthwhile experience, especially since it is completely free to play.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game it portrays how difficult it actually is to get into the eSports scene and the message it tries to send to people in the scene with Mr. Yeon was sent out beatifully and moreover IT'S FREE so there is absolutely no reason whatsoever to not play this. And kudos to the devs very well made game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome visual novel, the art is beautiful and colorful, the story is great and the music too. I have been trying to make a visual novel and this game really inspires me. The starcraft 2 competition in this game really puts pressure on you, even so that at every choice you have to make you have the feeling that you are going to ♥♥♥♥ everything up. Seriously great game and FREE! Just play it if you like visuals novel or e sport, you will love it. 10/10 would think about every choice for fifteen minutes again.",
            "review_score": "1"
        },
        {
            "review_text": "Good art style, interesting story. If Team Eleven Eleven is looking to sell their next product, I've been convinced to give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "I've never really been a fan of visual novels, but I guess it's because they've never really hit on anything I've been passionate about. As someone who's devoted countless years of their life to games, this kinda hits home. There aren't a whole ton of decisions to make, and if you make the wrong one, it just sends you back to make the correct one. Overall this game is to tell a story, and regardless of your decisions, you will see the entirety of it. It's well written and extremely enjoyable, even to a casual SC2 player like me.",
            "review_score": "1"
        },
        {
            "review_text": "Best thing since sliced bread! If you enjoy anime/esports, you'll appreciate this heart-warming story and enjoy 'learning about', as TotalBiscuit says, 'how competitive Starcraft works.' Very engaging, epic soundtrack, etc. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A solid eSports-themed visual novel. Heavy on decision making and very well done overall, especially for something that's free. I look forward to any sequel or other offering by its creators.",
            "review_score": "1"
        },
        {
            "review_text": "Please make a second one..... we need more...",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome. Reminded me of the early days when SC2 first came out. I no longer play it but this hit the nostalgia lane for me. I recommend it. It's fun and hey even if you're not a fan, try it, you might end up understanding a bit about sc2 in a fun way without all the technicalities.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, highly intriguing.",
            "review_score": "1"
        },
        {
            "review_text": "Took my time to enjoy it and I'm not going to lie, I really enjoyed this VN  Hoping for a sequel",
            "review_score": "1"
        },
        {
            "review_text": "everyone hates protoss  realistic/7",
            "review_score": "1"
        },
        {
            "review_text": "SC2VN was a amazing experience for me and the entire family. 9/10 Accels smile is very warm.",
            "review_score": "1"
        },
        {
            "review_text": "I have never more fell in love with a Visual Novel. Especially since i have a deep love for Star Craft 2.  It was sweet, short, emotional and, had the type of empathy that made gamers who could look past any shortcomings  ( I didn't see any, but then again I dont have a setup to play games at 1080/30 )  It was a masterful thing that i enjoyed thoroughly, especially the accuracy of this game and the story of the main character and how they had to get past the short sightedness of their peers before they could achieve this goal.  As someone who made it into the COD world championship before I must say that many people will never look at gaming as a sport even though it is ever growing larger. Thank you is all I have to say to the crowd funders and the developers for letting us enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. This was probably my first visaul novel, but it has a great story and lovable characters. This is a good game for a free game. Although the story was short, and I don't know a single this about E sports, This is on of my favorite visual novels.",
            "review_score": "1"
        },
        {
            "review_text": "Short, but a good read.",
            "review_score": "1"
        },
        {
            "review_text": "better than it has any right to be",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable, but short as well. I loved the writing. Would love to see a sequel!",
            "review_score": "1"
        },
        {
            "review_text": "  So this is my first visual novel i ever read, and i got to say one thing: I enjoyed it. I have always been into eSports and i have seen every single english eSports document, so this was a good first visual novel for me. Even though i have never played Starcraft 2 and i even haven't watched a single video of it, i enjoyed the story. In the matches, you can make little choises, which doesn't really affect the story that much. You might have to replay some matches, but it's rather annoying than entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "A guide to competitive Starcraft 2 disguised as a visual novel. Perfect for weebs interested in eSports...like me.",
            "review_score": "1"
        }
    ]
}