{
    "app_id": 404640,
    "name": "Game Tycoon 2",
    "release_date": "2016-04-08",
    "developer": [
        "Sunlight Games"
    ],
    "publisher": [
        "Sunlight Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Simulation",
        "Strategy",
        "Indie"
    ],
    "achievements": 35,
    "positive_ratings": 120,
    "negative_ratings": 114,
    "price": 8.29,
    "description": "In Game Tycoon 2 you find yourself in the middle of the big players. Get into the act and experience the fascination of the game development. Reach your goal and become the Game Tycoon!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/404640/header.jpg?t=1516749331",
    "minimum_requirements": "OS: Windows 7, 8 or 10 Processor: Pentium 4 with 2GHz (or better) Memory: 1 GB RAM Graphics: Graphics card with a minimum of 256 MB Storage: 600 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Couldn't even stomach the tutorial before refunding. This game clearly has a lot of depth, but it is hidden behind a terrible interface that gets in the way of even doing simple tasks.  Noticing that as of my review, there has not been a single positive review (other than Early Access reviews) outside of one that was given a free key to the game. Either people were being too nice because the game wasn't done yet, or people were being bribed with early access keys to boost the game's reviews.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is actually great... its a challenging business simulation game. Very well detailed, a few kinks to weed out but its not a game thats designed by UBISOFT so dont expect a 60$ for 16$... i think its priced well, it has a lot of nice features and yes it is a bit repatitive but all tycoons are!! the developer is active on the forum which is nice and he will take your opinion into consideration!! i support these guys its a great game, ive got a solid 12 hours on it so far and i still cant seem to get past 10 years of game play.  thanks",
            "review_score": "1"
        },
        {
            "review_text": "UI is too complex",
            "review_score": "-1"
        },
        {
            "review_text": "i want my refund ♥♥♥♥ graphics not worth $15 would buy for $0.99 i have played 20 minutes i bought this 2 weeks ago i have ordered a refund  make sure you do too and you'll get 15 to spend on steam",
            "review_score": "-1"
        }
    ]
}