{
    "app_id": 405370,
    "name": "Sky Break",
    "release_date": "2016-10-21",
    "developer": [
        "Farsky Interactive"
    ],
    "publisher": [
        "Farsky Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 306,
    "negative_ratings": 157,
    "price": 6.99,
    "description": "Sky Break is an open-world game on a stormy abandoned planet filled with wild mechas. Learn to master this world and to hack the mechas if you want a chance to survive.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/405370/header.jpg?t=1508941783",
    "minimum_requirements": "Minimalne: System operacyjny: Windows 7 Pamięć: 3 GB RAM Karta graficzna: Radeon HD6970, Nvidia GT 750 DirectX: Wersja 9.0 Miejsce na dysku: 2 GB dostępnej przestrzeni",
    "recommended_requirements": "Zalecane: System operacyjny: Windows 10 Pamięć: 4 GB RAM DirectX: Wersja 11",
    "reviews": [
        {
            "review_text": "why you SHOULD get it;    Great Graphics for its price    Really cool and unique idea, being able to hack mechs etc    Sets a great atmosphere around you during the storm   why you SHOULD NOT get it;    Fairly short gameplay    Not as much survival as it is adventure (there isn't hunger)    There isn't much free roaming, you travel across islands and most of the time you will end up following the quests    There isn't an actual tutorial (this isn't that big of a deal as the quests will eventually teach you how everything works)     I want the devs to at least see this part   This didn't bother me much (Dark Souls Fanatic) but I know other people will struggle with this    If you save at an Ionizer even after destroying all the mechs around it, when you respawn or load your save the mechs will respawn too. Oh did I mention they respawn RIGHT NEXT TO YOU READY TO ATTACK    [My Thoughts]  I love the Designs of the mechs, the idea of hacking into them is really cool and reminds me of an old game named Metal Arms. What brought it down for me is that there isn't really a survival aspect, it felt more like I was playing a story based RPG instead of a free roaming survival game. There isn't much replay capability. This game probably would have gotten to top sellers if it stayed in early access more to add new things. Once again I love the concept of this game ",
            "review_score": "-1"
        },
        {
            "review_text": "They claim this game is a finished product, in reality it feels like a game still in early access. It seems like they didn't 'finish' this game so much as they just 'stopped making it'",
            "review_score": "-1"
        },
        {
            "review_text": "I wouldn't recommend this game, it's very fun the first few times playing- but there's little content to really go through. Maybe 4 hours later into the game and you find the bottom; There's no depth. I was surprised the game released already despite it being repetitive and limited. This doesn't feel finished at all when looking at the UI, combat system, and overall disappointing 'cure' storyline. This game has a super promising layout already! It just needs to go back to the table and elaborate on present elements and bam! You got a finished product. It just needs more thought honestly.",
            "review_score": "-1"
        },
        {
            "review_text": "Sky Break   It’s a one trick pony but it’s at least a fun pony  You are stranded on a strange abandoned planet inhabited by hostile robots. A virus is threatening to destroy the human race and the cure lies within the flora of the planet. That’s about all the story you will get besides a few journal logs. But it’s all the story you need to setup the gameplay. Collecting resources and finding repairs to your ship while surviving the harsh environment to return to Earth to save humanity will be your goal in Sky Break.  There’s a straightforwardness in Sky Break’s gameplay. Collect resources to craft items and upgrade your equipment then rinse, repeat, and move to the next area of the game. As more resources are collected new items become available to be crafted such as different types ammo and health packs, but also the ultimate goal of finding the cure is progressed. The longer you are away from a safe spot collecting resources the more dangerous and unwieldy the weather of the planet becomes. Although enemies are easier to fight during these storms, the use of the map becomes unavailable and tornadoes and lightning strikes makes the experience terrifying, exhilarating, and disorientating.  The robot enemies encountered, called mechas, can be hacked and turned into an ally that will fight beside you. Also, they can be upgraded in the sky base to make them more worthy in combat. Mechas have a nice, sleek design each vary differently in look. But ultimately, all the mechas act in the same clunky way. The exception is the “boss” mecha that will pose as a challenge the first time it is fought, but becomes trivial in subsequent encounters. Mecha collection may be one of the shallowest parts of the game, but it’s also one of the most fun.  While there’s many things to craft, I found myself using very little outside basic and heavy ammos for the blaster. The other types of ammos seem expensive and ineffective. Upgrading the ship feels rewarding, but by the time the ship becomes really useful the game is over. The other player upgrades are secondary to the most useful, player damage. There’s not as much choice as it would appear. Crafting ahead of time is pointless as you can craft anywhere and make the things as you need them.  Sky Break has a few things wrong. The UI is a mixed bag. Crafting is easy enough, but using items is slow and clunky. Often times I used the wrong item or ammo by accident. Spawns of resources will be inside of trees and rocks. The AI of the mechas do funky things in combat. The story feels tacked on as an afterthought. And the game is short (about 4-5 hours), but I’m not sure that I would want it any longer as there is a lack in variety to do. The complaints don’t detract from the game too much from the game though.  Sky Break has some problems. I probably won’t be returning to it anytime soon, but it is an enjoyable game. It’s a one trick pony but it’s at least a fun pony. And I would recommend to any survival game enthusiast or anyone who is interested. At price point, Sky Break is a great pickup for game to play over the weekend.  3/5   Full Review  [www.drewshores.com] ",
            "review_score": "1"
        },
        {
            "review_text": "Well, to start with, 'Open World' is kind of a lie. There are a set of islands, and yeah, you can explore them freely, but they are VERY small. The pets (A major selling point for me) are beyond worthless, and actually a hindrance to the player most of the time. They push you around and interrupt your actions. The bird actively does NOTHING, no attacking or anything. Inventory is too constrained, it suffers from the NMS issue of, it's a collect-a-thon, and you have no inventory room. Your gun does laughable damage, and you can't carry much ammo. So you have to craft more, in a menu that doesn't pause your game.  There's just a plethora of bad. That's why I'm asking for a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Starts out very strong but after a while you notice it's all just the same. Then I was extremely exited to get a spaceship. Don't be, you control it with wasd and can go up and down...and just to make it even worse it can only land on a few select places and barely has enough power to get you anywhere. Game idea is great, just needs a little more polish to make a great game. Still I would recommend buying this game since in the beginning it was extremely fun.",
            "review_score": "1"
        },
        {
            "review_text": "love this game recommend it for anyone! the music and graphics make this game a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome  Its in the early stages, but I think Sky Break has so much potential to expand into a fantastic mecha survival game.  Blows NMS out of the water, for less than $20.00 USD  It is completely worth the price and I hope they continue to develop upon this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Unfinished game, lot of bugs, need a better starting guide and with lack of content.   Good concept but for just short time...",
            "review_score": "-1"
        },
        {
            "review_text": "This game was awesome, i hope they make another one soon. didnt want it to end.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun!   10/10 great concept good ai and the game is great overall!",
            "review_score": "1"
        },
        {
            "review_text": "This game simply is not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a gem. The premise is simple, the gameplay is fun, and the price is right. If you get it in a sale even better. This is the kind of game you beat and then invite your friend over and watch them beat it. As with all games that give this much of an atmospheric experience it is shorter than you'd like but the replay value is there.      (semi spoiler below for if you get stuck like I did)      When moving off the first island (and each subsequent island) you have to dock your station with the next island from within your sky station by clicking on the new dock and waiting for your station to move there.",
            "review_score": "1"
        }
    ]
}