{
    "app_id": 405500,
    "name": "Dangerous Golf",
    "release_date": "2016-06-02",
    "developer": [
        "Three Fields Entertainment"
    ],
    "publisher": [
        "Team17 Digital Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Action",
        "Indie"
    ],
    "achievements": 55,
    "positive_ratings": 251,
    "negative_ratings": 305,
    "price": 14.99,
    "description": "Not your traditional Golf game. Humorous destruction and over the top trickshots are the way to score big. Smash up the toilets, make a big mess in the Kitchen, destroy priceless antiques in the Palace. This is golf played indoors where the more expensive the object the higher its game value.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/405500/header.jpg?t=1542798367",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 64 bit Processor: Intel i5 3.2GHz / AMD FX 8350 Memory: 8 GB RAM Graphics: nVidia GTX 750ti / AMD Radeon R7 265 DirectX: Version 11 Network: Broadband Internet connection Storage: 6 GB available space",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 64 bit Processor: Intel i7 3.5GHz / AMD FX 9590 Memory: 8 GB RAM Graphics: GTX960 / AMD Radeon R9 280 DirectX: Version 11 Network: Broadband Internet connection Storage: 6 GB available space",
    "reviews": [
        {
            "review_text": "  Note: This game was reviewed with a code provided by the developer this doesn't change my opinion on the game.  Dangerous Golf is the game developed by ex developers of Burnout. It provides golf and adds the crash mode from Burnout to provide a fun destruction game, but this falls flat within minutes of you starting playing it.  I was looking forward to playing this game and at first I enjoyed my time with it, but the more I played, the more my experience became a pain rather than enjoyment.   Dangerous Golf is a simple game. You are thrown into an environment and you are forced to destroy almost everything in sight and then sink in the put. This is pretty simple even later stages. After enough destruction you are given a smashbreaker bar which lights your golf ball on fire and you explode everything you touch. It brings in more strategy in this game, but however this isn't wanted and you just want to cause as much destruction as possible.  The events stay regularly the same and there's an event at the end of each tour which is there to test your skills, but it's probably the easiest event out of all of them and the most relaxing as well.   Graphically the game looks stunning. The UNREAL 4 engine lighting and destruction look glorious and it's just amazing. One of my favorite features is the game letting you do a flyby of the level and then after you are finished with the level you have a flyby of the level after you destroyed the hell out of it.   The game is also quite buggy. The golf ball glitches through walls, smashbreaker balls get stuck in walls and furniture models clipping with each other when you destroy them. The golf ball going through walls happened frequently on my playthrough and I really hope this issue is fixed.  The game is also too long for it's own good. There are around 100 courses to go through and all of them are the same, by the time you unlock World Tour 4 you have pretty much seen everything. It get's insanely boring by the end of it. I had to take long breaks after playing for a while cause I was incredibly bored while playing it.  The game took me 5 hours to finish everything. There is also a Co Op mode and you can try acing every level, but it's insanely hard, so I doubt it's worth trying to achieve that.  The game also has abysmal keyboard and mouse controls so only play if you have a controller cause otherwise there's no point.  Overall Dangerous Golf is a rough game, for the price you can get your moneys worth, if you absolutely loved Burnouts Crash Mode, but Burnout had a full game attached to it, but in my opinion this game is kind of boring and only worth getting on sale, but I still suggest skipping it.  Pros: + Amazing Visuals   Cons: - Too Boring - Glitches - Keyboard Controls are horrible 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Great game - burnout crash junctions make a glorious, golf based, return!   If you're not sure if you'll like it ask yourself 3 questions:  - Did I like Burnout Crash Junctions back in the day? - Do I like fun local multiplayer, score driven, gaming sessions with friends? - Do I like smashing things?  I'd say if you say yes to any or all of the above you'll find something to enjoy here (particularly the first one).",
            "review_score": "1"
        },
        {
            "review_text": "I love this game because I'm a big, dumb idiot.",
            "review_score": "1"
        },
        {
            "review_text": "Get your balls in the hole while breaking ♥♥♥♥. What more is there to say? Hopefully this is a tech demo for a new Burnout game using Unreal Engine 4. YES PLEASE!",
            "review_score": "1"
        },
        {
            "review_text": "The level of physics-based destruction is downright pornographic. This is as close to a true Burnout successor as we're gonna get, y'all. Enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "You can 'redestroy' the Bathroom of James Camerons 'TRUE LIES' :)",
            "review_score": "1"
        },
        {
            "review_text": "Got it for 79p on a bundle and well worth it, although overpriced at £14.99. Don't pay anymore than £2.99 in my view. Make a cuppa when the tutorial video starts as this is unskippable. The main game is fun in the same vein as Burnout crash, by destroying everything possible. No issues to report although the controls are not responsive enough.",
            "review_score": "1"
        },
        {
            "review_text": "LOVE this game so far. Saw a few people moaning about the training video, but didn't bother me, especially as you can now skip it (and it only plays on the first time anyways).   This game is all about doing loads of destruction and getting crazy trickshots - right up my street and its a lot of fun. Looking forward to playing it with my friends over Christmas.  Only down size is lack of people online. Please more people buy this game so we can get more online games going.",
            "review_score": "1"
        },
        {
            "review_text": "Played for ten minutes, and half of that was watching an unskippable tutorial video by an annoying DJ who says 'what are you waiting for!?' Answer. The end of this video so I can play.  Finished the hole the first time in about 20 seconds, takes next to no skill. Really, just rocket the ball forward and as long as it crosses the hole, it goes in?  Got it with a humble bundle.   It does have high production values and neat physics, but it just wasn't fun to play. i'd rather play the old Microsoft golf games from Windows 98 where some modicum of skill is required.  Sorry, but I'm uninstalling it now.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a really big fan of golf and this game is just disapointing. Personally I don't care for the game of goal but I just love shoving golf balls into my ♥♥♥. If you also enjoy shoving golf balls in your ♥♥♥ I wouldn't recommend this game. You could just spend the money on real golf balls and have a good time! ;) Hope this was a helpful review!",
            "review_score": "-1"
        },
        {
            "review_text": "long unskipable tutorial, and still didin`t explained how to play. pretty, but that`s prety much it",
            "review_score": "-1"
        },
        {
            "review_text": "If you're on separate PC's, this game is absolutely horrible for multiplayer. Everything starts locked, you can't watch other players, voice comms are forced open, and the only interaction you have with other players is the scoreboard. If you enjoy mind-numbing destruction alone in your mom's basement, this is the game for you. Very glad I received this as part of a discount bundle. Would not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAMES IS A PEACE OF .... ITS SO BAD !!! WOW",
            "review_score": "-1"
        },
        {
            "review_text": "Really annoyed with the intro video. i get it, its a game where you can break stuff with a golf ball. you dont have to keep emphasizing the intro that takes 20 years to finish just to play the game. the fact that you cant skip the damn thing just got me frustrated enough to quit the game and write this 'review'.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like clicking randomly and watching the ball fly through like a bullet with no possibility of controlling power or any other aspect, then you may like this game until the novelty of things breaking wears off (about two minutes). The hole is five feet away? Click to putt and no matter what the ball flies at 200MPH across the entire map and back. No way to actually enjoy a game, and useless 'power-ups' that are as confusing as the rest.",
            "review_score": "-1"
        },
        {
            "review_text": "Awsome fun! Totally burnout 3.",
            "review_score": "1"
        },
        {
            "review_text": "Can´t started a game because the tutorial its toooooooooooo loooooooong and boring, to hit a ball to smash things its no necesary more than ¡ 5 min !. Report",
            "review_score": "-1"
        },
        {
            "review_text": "Extremally too long video tutorial without any way to skip it. Also it either restarts the same tutorial everytime or it plays it all over again between gamemodes. Didn't have enough strength to bear through it. I consider humblebundle money % which went to those guys a waste.",
            "review_score": "-1"
        },
        {
            "review_text": "For how little I played this game, I can tell it is not my kind of game. Lucky for me, I bought it as part of a Humble Bundle, so it did not cost me twenty dollars. Overall I got bored with it after the ten minutes I spent playing it. It's uninteresting, boring, and gives me no drive to finish it. For how the team executed the game, I guess it's pretty okay in that department, graphics aren't horrible, controls need getting used to but nothing extreme. The concept of the game just does not intrigue me.",
            "review_score": "-1"
        },
        {
            "review_text": "Mash buttons and get points. Sometimes you get in the hole magically and sometimes you 'missed'.  Essentially free from humble bundle and still not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "I can see how this could be fun with friends, and I like the 90s vibe. But I need a bit more in a game than 'Do this!' 'Good job on doing that! Now do this!'",
            "review_score": "1"
        },
        {
            "review_text": "if you dont want to watch the very long intro, you have no idea what you are doing.. you play like 1/4 of the time, and wait for 3/4 of the time, for either loading or the score counter,, not worth money.",
            "review_score": "-1"
        },
        {
            "review_text": "clumsy adn disorienting golf game that triet to be burnout...  a definite dont buy recommendation from me",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely love this game! Highly recommend if you love to smash things and get points for it! Plus so many maps to discover!",
            "review_score": "1"
        },
        {
            "review_text": "CONTROLLER ONLY GAME RIGHT NOW BE AWARE.  If you have an Xinput controller or ds4windows lets move on, The game is a physics based 'golfing' game where you aim a ball at A LOT of physics objects in a room, you get a few swings and the goal is to get as much points as you can not get the ball in the hole in as little swings as possible. Hell on the putt shot there is very generous sweet spot where the ball will go in the hole, It took me 6 games to miss a shot, until then i thought it just auto went into the hole. It definitely has the feeling of Showtime mode from Burnout Paradise. The game runs great on a 980 Ti over 100 fps at 1440p Maxed out with all nvidia gameworks features enabled. . It is pretty dumb though that you cant use keyboard and mouse. But I garuntee its going to be in the first content update. There is also a bunch of levels, and in them you go back to the room and there will be different layouts too. I havent tried multiplayer yet because i havent been matched with someone so i cant report on that. But for $20 as long as you have a controller this game is a great value and its a really nice showpiece technical demo for unreal 4.   Now all we need next is for three fields to work with epic and fix the mess that is the driving mechanics in unreal 4, and make a spiritual successor to burnout paradise, my favorite driving game EVER.",
            "review_score": "1"
        },
        {
            "review_text": "So i wrote a review back when this game didnt support pc controls they fixed that and im still underwhlemed.  The game had potential but no one seems to care enough to give it a life after release. This had so much potential but it needed so much love and they just dont seem to care.  They couldnt even be bothered to release it with pc controls and the best they managed was 2 updates and not a word since july. There is a good game here but we will never be able to see that game because they moved onto other stuff.  I expected far better from you guys but thats what i get for trusting a new company please dont ever stain the name of burnout again in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game. Way too difficult.",
            "review_score": "-1"
        },
        {
            "review_text": "  Really poorly optimized and literally requires a controller, not to mention unskippable 7 minute instruction video every time you launch.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a moment where steam really needs a 'meh' or inbetween score rather than simply yes or no.  On one hand, it's got a good amount of polish to it and feels basically like burnout crash mode meets minigolf. On the other hand it's WAY too simplistic and doesn't hold much entertainment past the first few swings. I sure as hell would NOT be happy having bought this for $20, but I got it in a bundle for $1 and I wanted a different title anyway, so this was just added extra.  It's good enough for the bundle pricing, because you can easily spend $1 at an arcade for far less entertainment and less entertainment time, but that's not the normal price for this game and once this bundle is over, I simply cannot recommend this game.  P.S. the unskippable tutorial video is the WORST DECISION EVER MADE. That alone earns a negative review imo. I had to alt tab and mute the game's sound for the duration. It was the most cringe inducing ♥♥♥♥♥♥♥t I've seen in a long time. If you want this game to succeed at all, patch this out immediately.",
            "review_score": "-1"
        },
        {
            "review_text": "Is golf too boring for you? Maybe you don't like the quietness of golf? Not enough trickshots for your liking? Not enough explosions and destruction? Well then this is the golf you're looking for.",
            "review_score": "1"
        },
        {
            "review_text": "whoever made that training video has to be the worst employee ever.",
            "review_score": "-1"
        },
        {
            "review_text": "Got it from humble Hundle unreal engine bundle, The intro is too long and the fps's are too low. (even on lowest settings &amp; other games run just fine) Quite boring, and if you where to buy it, 20$ is waaay to much. ",
            "review_score": "-1"
        },
        {
            "review_text": "rubbish stupid load times utter ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "very very poor execution of a game. Could be great, would be great.. but the controls are barely even talked about and nothing feels right within the game play. there is no aim, no way to truely control the ball and unless you hit something on the get-go.. you've pretty much wasted the shot. Glad I got this game in a bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "very very poor execution of a game. Could be great, would be great.. but the controls are barely even talked about and nothing feels right within the game play. there is no aim, no way to truely control the ball and unless you hit something on the get-go.. you've pretty much wasted the shot. Glad I got this game in a bundle.",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable. Uninstalled after 30 minutes (2 of actual gameplay).",
            "review_score": "-1"
        },
        {
            "review_text": "It's amazing if you're looking for pure destruction. It deserves far better than it's current mixed rating.  Personally, I don't think a controllers necessary; helpful, but not necessary.",
            "review_score": "1"
        }
    ]
}