{
    "app_id": 405610,
    "name": "Flight of the Paladin",
    "release_date": "2015-10-23",
    "developer": [
        "Grizzly Wolf Games LLC"
    ],
    "publisher": [
        "Grizzly Wolf Games LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 8,
    "positive_ratings": 178,
    "negative_ratings": 163,
    "price": 0.79,
    "description": "Flight of the Paladin is a fast-paced top-down shooter where you play as a knight of valor and light vanquishing the nightmarish creatures of darkness. Featuring multiple game modes, Steam Achievements and Leaderboards!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/405610/header.jpg?t=1547591746",
    "minimum_requirements": "OS: Windows Vista Processor: AMD or Intel Dual-Core at 2.0ghz or greater Memory: 4 GB RAM DirectX: Version 9.0 Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I thought I'd give this a try, seeing how it's only $2. Unfortunately you get what you pay for and this game was sadly not particularly good.   The gameplay is very simple, as demonstrated in the trailer on Steam. But that's also all there's to it: a very light shoot 'em up.  The game is incredibly repetitive. Monsters come at you from the exact same angles every few seconds, making the game more of a pattern recognition exercise than anything. You have a basic attack that you can pretty much spam continuously and a whirlwind attack that needs to be charged but only kills certain enemies. The lack of a health bar, score meter or progress meter to the next boss is very annoying.  Graphically there's really nothing to it. Playing it full screen is not recommended, as it makes all the ugly stand out.  There's also not much sound. Aside from the looping organ music, the sound assets seem limited to a whopping 3 sound bites.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is worth the price; especially if you're paying with a coupon. If you're looking for depth, look elsewhere. But if you're down for a late 80s style Arcade shooter, this is the one.",
            "review_score": "1"
        },
        {
            "review_text": "Decent and simple quick game. Smooth gameplay with no issues. Audio is fine, gets boring after the hype.  Final Grizzly Warrior achievement is rather tough for my standard.   Recommend for the low price, trading cards and easy 7/8 achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Pros : .10 cents Trading cards  Cons : Apparently a game that's supposed to run on OSX,This is a lie by the way,What it does is basically 'go get a VM' as if busts download the Windows executor and files and even an external app like Wine can't even run these executables.  Just a huge scam if you are on Mac,You have been warned.",
            "review_score": "-1"
        },
        {
            "review_text": " good ♥♥♥♥ go౦ԁ ♥♥♥♥ thats  some good♥♥♥♥ rightthere rightthere if i do ƽaү so my self  i say so ",
            "review_score": "1"
        },
        {
            "review_text": "Not OK !",
            "review_score": "-1"
        }
    ]
}