{
    "app_id": 405640,
    "name": "Pony Island",
    "release_date": "2016-01-04",
    "developer": [
        "Daniel Mullins Games"
    ],
    "publisher": [
        "Daniel Mullins Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Psychological Horror"
    ],
    "achievements": 20,
    "positive_ratings": 9347,
    "negative_ratings": 421,
    "price": 3.99,
    "description": "Pony Island is a suspense puzzle game in disguise. You are in limbo, trapped in a malevolent and malfunctioning arcade machine devised by the devil himself. It is not a game about ponies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/405640/header.jpg?t=1539709568",
    "minimum_requirements": "Минимальные: ОС: Windows XP Оперативная память: 2 GB ОЗУ DirectX: Версии 9.0 Место на диске: 400 MB",
    "recommended_requirements": "Рекомендованные: ОС: Windows Vista / 7 / 8 / 10 Оперативная память: 4 GB ОЗУ DirectX: Версии 9.0 Место на диске: 400 MB",
    "reviews": [
        {
            "review_text": "Pony Island is an interesting game. Levels are a bit repetitive at first. Eventually you get powerups. After that, it gets more interesting. Some of the levels get pretty tricky. Early on, all you can do is jump. Hovering is added a bit later. Enemies come at you every few seconds. Left mouse button to jump over obstacles. Push enemies away with right mouse button. Make it to the flagpole and you can advance. Every so often you get a 'Puzzle Break' It's kind of like a programming puzzle. A butterfly is trying to get to its house. Moving arrows around defines a route. The butterfly follows the arrows. Reach the house to advance. Anybody can learn this game. Please give it a try. Play it right now. E &nbsp; verybody. D  331/335",
            "review_score": "1"
        },
        {
            "review_text": "j̰̤̩͍̖̝̕us҉̤̪̙̻͎t̻ ̪̞͍͚̱f̣͔̝̯̻͈̻i͍n̷̼į͖s͏̺͇̬͉͖h̜̗̜e̡̗̫̣ḏ̪͝ ̜̪̭̀t̩̗h̡̟͍e̖ g̺̝͈̳̼͓̱ḁ̛͔̦͉m̤͕͍͚e̵̞͔͙̝͍,͔̬ ̰͇i͢t̡ ̠͚̕a̪̰̜ͅc̭͙̮̺t̼̲̼͝u҉͈͙̟͓a̤̺̻͖̳͇l͏l͓̭̳̠̘y ̬̹͉̀i̧̻̯̞͖͕̰s̲̕ ̴̬ab̛͔͓̘̺̩o̸͉͎̘̹u͈̯t̶͈̣̠͓ ̱͚͎̟p̫͕͚͡o̺̝̪ṉ͢i͇̪͙̥͓̞̥e̶s̢̰̖",
            "review_score": "1"
        },
        {
            "review_text": " ***Warning***  Minor spoilers!  It has been a while since a game has had me 'wtf'ing' all over the place, but Pony Island brought it back to life. This game is genius.   Storyline:  Basic breakdown is that you are trapped within some funky arcade machine that has gone vicious thanks to the devil himself deciding to be a programmer. Take the cover of the game.. Take what you expect the game to be and throw them out the window. Already as you begin, it's clear that something isn't right - Having to fix a broken and glicthy menu from the get go before you're able to commence the gameplay is a sign that the devil may not be as good of a programmer as he likes to think.  As the cursed player of this hellish demon-game, you get whisked around from a chaotic, glitchy, broken world to a cutesey, diabetes-inducing pastel nightmare, with random logic puzzles thrown in, to fix Satan's buggy code. As you guide your pony through the devil's glitchy game, you can catch brief glimpses of who your character used to be before they were killed and trapped in the game. The story is gritty, blurred and as twisty as the day is long. Basically, it's fantastic.    Gameplay:  I feels as though I had to make an extra section *just* for gameplay because it's honestly that damn good. The ingenuity of the puzzles, the level designs and the text communication alone make it note worthy. Pony Island as a whole is magnificent and shows incredibly unique ideas put together insanely well. When something like this, running on such simple mechanics can set an atmosphere so well, it raises the bar for many other games to do the same.  Also!  Passcodes  to keep tucked away until needed;  Baphomet  and  2023     Graphics:  The look of it makes it feel like a genuine ported arcade game. It's pixely, it's box-like, it's all kinds of good while been fairly simplistic.   Menus:  Broken because of Satan.   Soundtrack:  This goes from being an eerie and abrasive glitchy, retro, electronic style base for the tension and horror-ish atmosphere and then completely flips a coin to be colorful, cute and innocent with its uncomfortably cheerful electronic notes. The changes in this set the scene and is yet another thing that makes this game so unique, it's unlike anything you've heard before.   Final Conclusion:  Get this. Seriously. It's rare that games can really spice things up with something new. With that been said, unique ideas are one thing, but it's the fact that they are brought together well that makes Pony Island stand above the rest. It keeps you thinking, provides great atmosphere, keeps you on your toes and has so much hidden content perfect for those willing to look for it.",
            "review_score": "1"
        },
        {
            "review_text": "A whimsical run through luscious grassy valleys with occasional logical minigames.  Don't let butterflies tickle you!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and cheerful game about ponies and butterflies, which can also be used to teach your kids the basics of programming!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I've played in a while, there was very cool 4th wall breaking moments, which made this game stand out to me. Highly Recomend",
            "review_score": "1"
        },
        {
            "review_text": "i can't believe satan is a ♥♥♥♥ing brony",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island is a great,colourful and innocent game! It teaches you the meaning of life, shows you the kindness and probably the best thing is, your only goal will be having fun! Pony Island is a great,colourful and innocent game! It teaches you the meaning of life, shows you the kindness and probably the best thing is - Pony Island is a great,colourful and innocent game! It teaches you the meaning of life, shows you the kindness -- Pony Island is a great,colourful and innocent game! It teaches you the meaning of life, --- Pony Island is a great,colourful and innocent game! --- ----------- Pony Island is a demonic game which you will play as a trapped soul inside a machine of a demon. This game is not innocent nor colourful! It will not teach you anything! You will only see demonic creatures in this game. Your only goal will be escaping from the machine! Escape from HIS machine! You will have a companion on with you as you try to escape the machine.  I̢̕͞͡ ̴́́͝n̵͜͜͠͡ę̢e̡͡d̵̵́͘͡ ̸͘͟͝y̵̴̵̢ơ̵͘ų̴͏r͏̛͢ ̨̛h͜҉̕è̵͡l̢̀̕͟͢p҉̕.̨̡ ̵̡̧҉P̷̡l͏̵̸̷̢ę̨͞a̴͞s̕̕͢͠ę̶̧!͏͜ ̸́͡H̨͡e̶l̷p҉̵͜ ̢͝m͜҉̕e͘͠͝!̴̷̢͟͝ ̴̨̢   Ŗͪ̽u͊n̛ͥ́́̓̿̔!ͥ͂͗͆̏ͥ̚̕ ̓͆͛͋D̔ͥ͗́͋ͥŏ̓͋ͫ̈̅̾nͤ̄'ͮͭ͞t̸ͬͫ̓ ͥͫl̏ͤ̉ͨ̓ͥ̚èt̓̔ ͑ͮͣ͐ͤ̈́hͥ̏̾͐̑̃͠ȋm͆̒̓͛ͩ̿ͦ ́s̈̅̚͟tͫ̀ę͒ͬͦ͊̅͒̇ą̈́ͧ̒ͮ͗̐l͠ y̢̎̉̂o͟uͤ͡r̀͝ ̨͆s͌̌́ő͛ul̀!̴̓̉͋̈̀͆̇ ̕C̵ȯ́͗͑͠n̐̀tr̸̅̈́̇ͪ̑̌͂õ̇̋͗l͐͑ͤ ̒̃̓ͨ͆ͩyͦ̾́͆̀oͤ̾͛͆u͂ͥr̅ͫͣͧ c̷h̎aͫ̓ͥ̉ͧ̂͠r̔͛ͧ̎͠a̢ͧ̐̚c͝t̨́eṙͨ̓͐ͥͤͫ ͥ͢w̨̒͌̎h̴́͋i̚ċ͒͢h̛̅̋͛ ̃̃͋̄͒͠i̵ͪͯ͋ͤ̓ͪsͪ̄ͨ͑̌͒̓̀ ̵ͧ͛͗̄̃̽̍a͐̆̽͋ ̋̊p̒̿̚o͘n͆͛ͮ́̀̏ẙ̡͑̅̀̒ͩ͛ ͩͪͬͧ̈́̃ͦ͏à͒͌̚҉n̍̎ͯͦͥd ̛h̛͂͋́̈̋̄è̐̃ͯ̾̀lͧ̈́p̿̾̒ ͒ͬ͝u̶ͥ̅̒̈́ͯ͑s̛̉ͭ̈̚ ̈́͐̈́̌͊̂́tͥo ́͂̄͋ͫ̌ͬȇͥ̃ͤ͟s̓ͤͤ͐̊̔ͣ͞c̅ͩ̕apͯ̃̀̈͂̈́ė̆̂̇̈́ fͦr̎ͬȍ̐͒m ̏t̿h͛̎e̛̅̔͒ ̛̃̄ͣ͊m̉͟aͣ̐̏̓ͮchͥ̕ḯͣ̇͊n̷ͣ͑ͤ̆e̸!͂     Oͦ̃̓͛ͧ̚͏҉̸͝ḩͦͩͭ̉͑̏͑́͜ ̨̇ͬͮͥ͋ͭ̋͋̉͑̋̎ͤ̎͂ͫ̿̕n͗ͮͬ̀ͩ̇̕҉͟ơ̈͋̄̐͆ͫ̅͛ͫ̇͑҉̷͢ ̈́̀ͪͩ̒͋̓͆͊ͦ̈́ͫͣ̃͜҉̴̀Ḣ̈͋͛ͦͯͤ̑̾͂ͬ͆̀E̢̾ͮ̿̔͗͒͋̽ͪͫ̂ ̶̆̂͛̎̒̌̔̚̕͢ş̴̧̎̀͋̾̉̂̐͡a̵̿̈̂͆ͣ̾͂̈́ͪ̓̾̒͋͘w̷̐̽̅ͯ́͞͡ ̵̈̅ͦ͗ͯ̆̀͟u̍ͩͤ̒ͣ́ͥͩ̈́́ͥ̇ͫ̐҉̢̛s̷̡ͤ̊̐̍ͧ͋ͫ͒ͭ̽́ͩ̚͞͝!͌ͣ̄̈̏ͯ̑ͥ̌͊͊ͤ͛ͫ͐̎̋̀҉̵̴̶̀ ͒͊̎͛̄ͤͬ̂̑̋͡͏̀͘͝Rͯ̋ͫ̃ͥ̆͗̂ͦ́ͬ͐̐͌͐́̀̚͡͡u̶ͥ̐̾̽̑̂̐̎ͣ̄̍͐ͥͣ͊̿ͦ̈́n̸̈́ͧͭͥͨ̔͊̀ͥ̓̑̽̔ͥ͟͢!͛ͨ̃̂̎͆̄̓̌ͧͩͥ͌̓͒̊ͩ͢͝ ̵͛̉̀͛ͬͭ̀́̕ H̱͔̬̜͐e̬̥ͣ ̣̺̪͠ī̙̻̱͉̮̃̔̿ͅs̑͒̊͂̎͜ ̙ͯͧ͛ͣ̚c̬͚̬̗͟o̗̊ͤ͌ͩ̒̎m̡̬͓͙̯̳̳̍ͦ̾ͩ̓̃̚i͖̥͍͊ͩ̔̊̕n̩̊̌̂̓̾ͯg̫͉̩ ̘̪͙fͣ̒͌̽̓ͮǒ̲̼̦͚̟͙̺͞r͔͕̜̜͔̅ͯ͛ ̈́̒ͯͤ̚y̹̗̼̥̱o̤ͫ̇u̵͎͍͍͇̤͉̣̓̈́ͦ͆!͗͛ ͛̿D̠̐́o̰̙̜͓͘n̞͔̲͈̦̣̭͊͑͑̃̌ͧ'͓͈͂̋́ͥ͠t͈̺͕̭ ̒͂ͨ̏͂ĺ͖̏̓ͨẹ̪̮t̹̠̮͓̰ͦͭ͛͢ ̶͉̥͛hi͍̓ͨ̓͌̒ṁͨ́̇ͣͣ͏̬̞̣̼̟ ̼̾t̰̪̣̀aͧ̍k͙̭̳̆͆̌̃ͨ̚ë̲̪̬́ ̛̤͖̋y̧̹͇̝ͪ̅ͫo̙̼̭͍̼͉͙̒̕ù͍̟͎̭̝̯̻̇̾͊̔ͬr̯̝̙̼͊ͬ̒ͧͩ ͍̗̠̳̣̼̆̚͝s̢̍̄̑̾̾ͬo̯̩͎ͯͤͥ́ǔ̡͕̠͂l̘̬͚͔̀ͭ̅̚!̲̗̟    H̨̢̛̪̙̟̲̦̞͉̗̟̖̰̤͉̹͕̾͂̆ͬ̔ͤ̆̈̏̈́͠͞ȅ̶̢͎̙̜̣̪̮̫͔̫͍ͫ̓ͣ̓̾̂ͭ͂̄̀͞͞ ̵̹̼͚͔͇̝̳̲̺̖̥̱͎̯̟͕͍̲̟̔͗̀̒͋͗͐̃ͨ̍͒́i̮͙̤͍̱̖̯̺̦̳͚̰̹ͭ̔̈́̎̂͒͋̌̈́ͨ͛ͨͯ͋ͮ͜͞s̑ͣ̔͋ͬ̋̔ͬ̅͂͗̀͏̗̫̬̬̝̝͍̣̪͙͇̙̝̰̲ ̙̟͎͙͓͙̺ͪ͑̌̃̇̃ͤ͊ͬͦ̊̔͛̌̚͢͡ͅh̴̸̢̛̰̼̼̗͙̥͍̪͉̰̻͆ͣ̒ͭ̇͊̊͑ͯ̕ę̵̺̬͍̘͉̘̩̜̣̭̫͕͈͎̱ͣ̐̋̅ͭ͂̈͗̏r̷̸̢ͬ̈́ͧͪ̅͘͏̲̰̖̩̥̞̫͉͕͕̤͖̰ȩ̴̥̙̞͎̩̦͈̮͈̲̯̝̗̪̜͚̯̾̽̓͐̈̀̌̈́̅͌̏̓͌ͩ͑͗͊ͩͥ́͠.̶̸̜̭̦̟̩͎̠̼ͣ̏̿̊̍̐ͣͨͫͮ͛́̍ͣ͒̓̊̾̿͞͠͝    Welcome, Mortal. ░░░░░░░░░░░░░░░░░░░░ ░█░░░░░░░░░░░░░░░▒█░ ░██░░░░░░░░░░░░░▒██░ ░▒██░░░▒████░░░░▒█░░ ░▒███▒████████░▒██░░ ░░▒██████████████░░░ ░░▒██████████████░░░ ░░░▒██░▒████░▒██░░░░ ░░░▒███░▒██░▒███░░░░ ░░░▒████████████░░░░ ░░░▒██▒██████▒██░░░░ ░░░▒██░▒████░▒██░░░░ ░░░░▒██░▒██░▒██░░░░░ ░░░░▒███░░░▒███░░░░░ ░░░░░▒███░▒███░░░░░░ ░░░░░░░▒████░░░░░░░░ ░░░░░░░░░░░░░░░░░░░░  Update: Pony Island must get the 'Game inside a game' award. Even the story itself goes about a soul gets stuck inside an arcade machine!",
            "review_score": "1"
        },
        {
            "review_text": "Epic, brilliant, funny. These are the words I would use to describe this little diamond. Make a favor to yourselves, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A masterpiece in disguise. This game will test your puzzle and hacking skills to the limits. One of the best cheap games I've had the pleasure of playing in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Not what I was expecting at all. And that's great feeling! Like you suddenly entered a good trap.  UPD: I'm still not sure if I really closed the game. I even uninstalled it, but still not sure.  UPD2: Is my soul free?  UPD3: Is it?",
            "review_score": "1"
        },
        {
            "review_text": " 1 set x_cursor to 0 0 n0t_th!s_w@y 0 1 set y_cursor to 0 1   x_AddToCart = 3   0 0 ch3ck_s0ul 0 @ctiv@t3 p0ny_l@s3rs 1 1 free_p0n!es 1   y_AddToCart = 5   1 0 [-&gt; ] 1 ch#ck Cr3d!tC@rdNum8er5 1 1 set x_cursor to 3 0 [&lt;- ] 0 1 set y_cursor to 5 0 ch#ck YourM0mCr3d!tC@rdNum8er5 0 0  is x_cursor equal to 3  0 goto free_p0n!es 0 0  is x_cursor equal to 5  1 U_c@n't_g0_h#r#_n008 1 0 cl!ck_on_th!s_butt0n 1 p0ny_4_l!f3 1",
            "review_score": "1"
        },
        {
            "review_text": "Saw a playtrough on youtube.  Bought it to write this review.  Louey/10.  Would support developer again.",
            "review_score": "1"
        },
        {
            "review_text": "I saw this in the discovery queue was interested in the concept of the game and decided to give it a go. Fantastic game, well for your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "  I usually like to write somewhat indepth reviews. However for this game just trust me. It is well worth the extremely cheap asking price. Just go in blind and have one of the most unique 2 hour experiences you will probably ever have",
            "review_score": "1"
        },
        {
            "review_text": "Live your life in the land of happiness! It's about a pony, bridges and lots of butterflies.",
            "review_score": "1"
        },
        {
            "review_text": "Hello, there!  Well, what do i think about this game? I think... it's awesome. it one of these game with a short story but awesome story. This story was compelling, seriously, i love the story. It's not like the most games published on steam, in my opinion it's something... awesome, and special.  I really love this game, and i enjoyed to play it! It's worth the money!  | greetings, Nexus. :)",
            "review_score": "1"
        },
        {
            "review_text": "I tried to explain to a friend I've discovered a great game called Pony Island, then I realized how difficult it would be to describe such a gameplay by starting with the name of that game.  I had good ideas about what the game would be like, and yet it suprised me : breaking some knew grounds about interaction in video games.  Definitely a great experience. Now I just have to find all the tickets and maybe get my soul back :D",
            "review_score": "1"
        },
        {
            "review_text": "The humor in the game is well executed and spot on.",
            "review_score": "1"
        },
        {
            "review_text": "Play this game. Don't read reviews, don't read comparisons to 'other' games. It's $5... play it.",
            "review_score": "1"
        },
        {
            "review_text": "  &gt; We1c0me t0 Pony Island, Guest!  &gt; Take y0ur t1me and read th1s review.  &gt; The gaMe_is_great for 6reaking the 4th wall. &gt; In P0ny 1sland the feel 0f being 1nvo1ved in the story 1s en0rm0us, that,s_because the main character here is REAL you. &gt; The_Game really grabs y0ur attention from the most beg1ning, and till the 011001010111010001100101011100100110111001101001011101000111100100100001 &gt; The c0nstant_changes gameplay_&amp;_atmosphere w0n't let you get b0red. &gt; Enc0untering newChar will be an individual text_based games, where you,ll be able to talk to them without choosing prepared dialogues.  &gt; If t0 cho0se from most c0ol aspects of th1s game, they wou1d be:  &gt; very interactive gameplay;  &gt; Big variety of gameplay mechanics;  &gt; Free Ticket;  &gt; PuzzleBreak;  &gt; secrets!;  &gt; 01010011010;  &gt; secretz!;  &gt; SECRETS!!!;  &gt; This game is just perfect. You can't deny it. &gt; So just purchase it and... &gt; PLAY IT, MORTAL!! &gt; Or I will take your soul... ",
            "review_score": "1"
        },
        {
            "review_text": "Despite the notices to the contrary, this game is absolutely about ponies.  Short enough that the sweetness doesn't burn out or overextend itself. Even more fun if you're a programmer or computer power user!  Saying anymore more is almost a spoiler. It is definitely worth the 5$. ",
            "review_score": "1"
        },
        {
            "review_text": "This has quickly become one of my favourite games. I don't even know where to begin. It's an experience worth having. Simple, and yet very deceptively clever. Full of hidden little details and charm, and with a fantastic little story. Pony Island likes to toy with the player, and provides a bleak atmosphere I didn't think possible from such a simplistic format. It took me by complete surprise, and I would recommend giving it a shot. I know it won't be for everyone, but it's definitely worth a try, especially if you're interested in game development and design.",
            "review_score": "1"
        },
        {
            "review_text": "This has quickly become one of my favourite games. I don't even know where to begin. It's an experience worth having. Simple, and yet very deceptively clever. Full of hidden little details and charm, and with a fantastic little story. Pony Island likes to toy with the player, and provides a bleak atmosphere I didn't think possible from such a simplistic format. It took me by complete surprise, and I would recommend giving it a shot. I know it won't be for everyone, but it's definitely worth a try, especially if you're interested in game development and design.",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't take long to beat it, but for the price you can't go wrong. If nothing else, it's worth the experience. This game legitimately had me fooled on more than one occasion, and made me question what was real and what wasn't",
            "review_score": "1"
        },
        {
            "review_text": "Well that was an awesome experience. Highly recommend it for an afternoon or enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "This game has messed me up in ways unheard of.﻿",
            "review_score": "1"
        },
        {
            "review_text": "Pony island is an experimental game that I just can't quite pin down a genre for. It has game hacking, puzzle, platformer(?) elements. You play as a programmer or something who found this machine that has a game called Pony Island on it and your job is to go through the code and fix it. But a lot of weird crap happens.    It's a very short game so I don't recommend paying full price. But I can honestly say that it's unique and that I've never played anything else like it. I had fun with it but I doubt I'll play it again. I'll give it a stamp of 'recommended' if you feel like playing something unconventional but I would not recommend full price, as I said a couple sentences ago.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;&gt; this is not a game for bronies",
            "review_score": "1"
        },
        {
            "review_text": "so I dont know what I was exspecting when coming into this game and to be honist its best like that. I really can say much because everything is best being unexspected. what I will say is this game is really really worth playing its not much and for the price I can really recommend this.  trust me if you want to try a stange game which loads of differnt macanics I would recommend it. this game isnt very long, it took me 3 hours but it was soooo worth it. it really does make you think and I think everyone should give it a go",
            "review_score": "1"
        },
        {
            "review_text": "Well what do i have to say about this game. When i saw the trailer and look at the style i start to kinda compare this with Undertale. And the end result with this is i got kinda same feeling to this game as i got when i played Undertale. But the diffrents was that i really got mind ♥♥♥♥ when stuff at the end happend but i wont spoial that. I wish the game was longer i could beat the game around 1 1/2 hours but i was still sadersfid what the game give me.  and after i have telling you all about this i will give this game 8/10  (this is my first real review i hope its good) :3",
            "review_score": "1"
        },
        {
            "review_text": "It is simple but challenging...  The code puzzles are fun...",
            "review_score": "1"
        },
        {
            "review_text": "Buy it.  The less you know, the better.",
            "review_score": "1"
        },
        {
            "review_text": "A bit short, but lots of fun. Can't say I didn't see some of the twists coming, but the gameplay throws more than enough curves at you to keep things very interesting. I would certainly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "The World's #1 Pony-themed Exorcism Simulator.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so many things, and took me forever to figure out the first 3 puzzles xD, great great game!!!!!!!!! Amazing fun, entertaining and I for one have hard time finding fun games to play :P Buy this game TBH it should cost more, but thats just me :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! 10/10! The game is kinda creepy , and i like it! Soundtrack in this game was awesome , too. I think I'll buy it on a steam market! :D  So go buy this game and try to beat it.  ",
            "review_score": "1"
        },
        {
            "review_text": "this game is pretty fun and creepy in a cute way and I really recommend the game if you like horror games",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely brilliant. Only a half hour in, and I'm already hooked. Even the main menu is a puzzle and the creepy nature makes this game absolutely worthwhile.  Update: After completing the game, I am just as perplexed and enthralled in the plot as when I was in the middle of it. I wish there were more content, but I am so pleased with the product here. 10/10 for Daniel Mullins Games, and I can't wait for the future.",
            "review_score": "1"
        },
        {
            "review_text": "A sweet little game that is NOT about ponies.",
            "review_score": "1"
        },
        {
            "review_text": "Beat it in just over 2 hours. Highly reccomended for the price. The game is very clever and is highly worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Great stuff. Played through in one sitting, and I wasn't even planning on being in front of my computer that long. Brilliant puzzles and pony-based fence jumping.  I don't know if it's deliberate or not, but Lucifer in this game is pretty much exactly the Devil as protrayed in Dinosaur Comics.",
            "review_score": "1"
        },
        {
            "review_text": "Pony island is impossible to talk about without spoiling the game, So all I can do is say that Pony Island is a great game with an ending that I won't soon forget.   Well worth the price of admission for this one.",
            "review_score": "1"
        },
        {
            "review_text": "This game has to be one of the best put together games I've ever played. I won't spoil it but it'll absolutely screw with your brain as the game goes on. It's simple enough and you probably won't find much replay value, but it's one of those unique games you just really need to play.",
            "review_score": "1"
        },
        {
            "review_text": "Captivating from start to finish. Laughed out loud quite a few times at the creative mechanics this game contains. Absolutely loved it! Don't watch any videos / ready any walkthroughs - just play it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so many things, and took me forever to figure out the first 3 puzzles xD, great great game!!!!!!!!! Amazing fun, entertaining and I for one have hard time finding fun games to play :P Buy this game TBH it should cost more, but thats just me :D",
            "review_score": "1"
        },
        {
            "review_text": "Humor, Psychology, Demonology ,Programing code All in one. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The biggest trollface metaparody fourth- and fifth wall-breaking masterpiece of 90s era 8-bit console games. Very highly recommended, but only if you have a sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "hella good no spoilers but hella good",
            "review_score": "1"
        },
        {
            "review_text": "dont read reviews. dont look at walkthroughs. just play it. and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "I am still not convinced drugs were not involved in the making of this game.",
            "review_score": "1"
        },
        {
            "review_text": "I am still not convinced drugs were not involved in the making of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice, delicately made. F***ed me a bit hard in the a** at the end, though. : o",
            "review_score": "1"
        },
        {
            "review_text": "Short but really nicely put together. Just when you felt you might be stuck, you got out. So for me this was just the right amount of puzzeling. After finishing I noticed only collected 6 /24 tickets, this game still holds many secrets for a second playthrough!",
            "review_score": "1"
        },
        {
            "review_text": "'That was clever.'  You will be saying that often while playing this fun, charming game.",
            "review_score": "1"
        },
        {
            "review_text": "Talk about Fourth wall, this game was an Immersive ride from start to finish. I even felt emotional impact towards the game. It's amazing, do buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A really amazing game. I had much fun the (short) 5 hours I played it. Even if there is not *the story* - till the last minute the game surprised me. When you follow the achievments guides out there you will not regret it (a special end is waiting for you). ^^  A great short game for in-between times.",
            "review_score": "1"
        },
        {
            "review_text": "A delightful game about ponies and the people who love them. Great for ages 3+.",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island is a game that deceptively appears shallow with quite a few neat things going on for it under the surface. Relatively easy platform-shooting and logic puzzles, wrapped with a mini-mystery and one of the best in-game mind♥♥♥♥s in Act 3 that I've ever encountered. I think it's definitely worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "There are only a few games that make you really feel like the developer was truly brilliant. It might be the mechanics in the Witness, or the writing in Undertale. Pony Island's cleverness clearly speaks to the talents of the developer, from the overarcing plot to even the subtlest details. I was certain of it once I realized a character was typing in tune to the music.  To begin elaborating on the plot would give too many of the best moments away - suffice to say that the writing is always somewhere between witty and genius. The gameplay mechanics are both simple yet trippy: at first it seems really easy to use the mouse to look around and aim, left click to jump, right click to fire. But the game carefully begins making you do both at once, and this is surprisingly good at bending your brain; first the game makes enemies and obstacles come at the same time, so you need to press both buttons. But then the enemies will come a bit earlier, or a bit later, and you'll need to press the buttons almost at the same time, but slightly staggered - it sounds so insignificant, but in gameplay it ends up being an important factor, and it's a wonderful thing to experience in action.  If I have any real criticisms to level at the game, it mostly involves replaying the game for achievements/tickets (which are required for more information about the 'lore,' if you can call it that). The game has a chapter select, but the divisions are often too large, and once you've played through a section, it's not exactly fulfilling to replay it.  There's also one puzzle that's so obtuse, the first stickied post in the forums is the solution to it. The gimmick is that the game crashes at a specific point every time you try it - a familiar issue for many PC gamers. It's intentional, you're just supposed to wait, but there's no hint whatsoever that it was deliberate - even a 'Welcome back' message would have sufficed. It was also a missed opportunity to use that stickied post to turn it into a meta-puzzle, which is perhaps even more upsetting.  In any case, this is one of the easiest recommendations I've ever made. An absolute thumbs-up from me.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ive played this year.",
            "review_score": "1"
        },
        {
            "review_text": "This game was fun and full of quirky gameplay and darker humor. It's relatively short as far as games go these days, but longer than I expected. It's not going to be for everybody, but it was right up my alley. I enjoyed the puzzle aspects and the style of humor. It's one of the more fun, unique, and engaging games I've played this year.",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island is a game where you have to control a pony in an isolated island, far away from mankind. You are forced to build a society of gnomes thanks to your point forehead thing and fight Lucifer, so that God can ask Noah to pack you in his boat.  I highly recommend the game for its educational value about the Canadian Economy system.",
            "review_score": "1"
        },
        {
            "review_text": "a game where cute ponies come and jump all over the time",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island is a game where you have to control a pony in an isolated island, far away from mankind. You are forced to build a society of gnomes thanks to your point forehead thing and fight Lucifer, so that God can ask Noah to pack you in his boat.  I highly recommend the game for its educational value about the Canadian Economy system.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever I Played!!! Love the Story and the actions :) Great game if u wanna destroy your childhood :D Don't mess up and buy it, it is just 5 euros :/",
            "review_score": "1"
        },
        {
            "review_text": "Pony island was a awesome rollarcoaste rider. I never expected this game to be full of surprises and entertainment. It was a great story with all kinds of disturbing events. It also did a great job messing with you and tried so hard to make you figure out puzzles so easy that a 4-year old would figure it out. The game was not trying to be too bloody and satanic which is in alot of everyday horror. It was cute and funny. I loved playing every moment of this game from start to finish. The dev deserves that 5 dollars for a fun adventure i had. ",
            "review_score": "1"
        },
        {
            "review_text": "How about a drinking game: Every time this game breaks the forth wall take a shot. Wait thats literally the game, please don't do it I don't want to deal with murder on my hands",
            "review_score": "1"
        },
        {
            "review_text": "If you were the type of person that played 'The Stanley Parable' and thought 'Oh my Gosh that was the most unbelievably intelligent, witty, original and creative games that I have ever had the privilege of playing in my entire life!' you'll love this game. Its got all that wierd kind of stuff that you can sit at home and love how different and unique and original and non mainstream it is. ON THE OTHER HAND... if you didn't think 'The Stanley Parable' was the greatest piece of artistic creative genius that has ever been graced into the world, I cant really recommend this title. Its got that very similar type of 'unique originality' to it that you'll either think its the best game that has ever been released and will ever be released in every plane and sphere of existence in the universe, or you'll just think it was a tedious game, interspersed with a few cool spurts of puzzle solving but a game that you're glad you didn't pay full price for. So save yourself the hassle now and decide whether or not you're the type of person that believes this game will fill an intangable void in recesss of your self or it's just another 'original and imaginative' title that beats playing hearts or solitaire.",
            "review_score": "-1"
        },
        {
            "review_text": "I may not have finished the game yet, so this review is subject to change, but I do want to get this out of the way. Pony Island may be one of the most interesting, and one of the most fun game released so far, and it's only the fourth day of the year. If gaming keeps going this way, this may be a huge redemption, and Pony Island is just the start.  The game switches between genres. It initially starts off as a sort of puzzle game where you use timing, critical thinking, and precision to place tiles that maneuver a cursor over to a correct line of text that modifies the game itself. The second part of the game is a simple platformer where you play as an actual pony, where you can unlock wings and a projectile to fire. The platforming itself is simple, and does have some rather difficult parts, but the puzzles are easy to learn and hard to master. There's a lot of trial and error in this game which requires you to use your head, and like the game description says, think outside the box. Sometimes literally.  Without spoiling this game, (yes, Pony Island has a plot.) you take control of a person trying to play a game called 'Pony Island'. But when you start off, the new game button won't start a new game. How do you fix this? Go to the options menu, and you'll see some pretty regular options. Anti-aliasing, sound volume, a code in binary, and an odd symbol to name a few. Once you find the option to fix the menu, things start to get... grim. You suddenly get harrassed by a being that is known as 'HIM', or as he calls himself, 'Lucifer'. Lucifer wants to stop you from progressing down his little rabbit hole and simply wants your soul, you see. So, really, the wise choice is to ignore him. But he won't go down without a fight. But there is a lot more to Pony Island than just a malicious being inside... But that's for you to find out on your own.  Would I recommend Pony Island? To those looking for a game with a fresh concept and good tension, absolutely. For the ones with epilepsy? I'd stay away.",
            "review_score": "1"
        },
        {
            "review_text": "I learned that demons love ponies too. I thought only little girls and fat bachelors did.",
            "review_score": "1"
        },
        {
            "review_text": "FOKIN ASMADEUS HACK MY STEAM, DELETE ALL MY FILES ON PC AND BROKE MY LIFE...HORIBLE PART IT'S STILL A GMAE  SOMEBADY HALP ME 7772023/666 SHOULD SWAP MY PANTIES  TYPE &lt;BACK&gt; TO LEAVE THIS REVIEW",
            "review_score": "1"
        },
        {
            "review_text": "it ruined my life ☺☻",
            "review_score": "1"
        },
        {
            "review_text": "I know, I know -- there's a lot of competition in the pony game market, and rest assured, Secrets of the Magic crystal fans will not be delighted here. There isn't even a grooming station for your pony.  What there is, however, is a delightfully twisted story going on, filled out with some basic game mechanics that prove... er... challenging. A little problem solving, maybe a little logic, and suddenly you're getting pretty deep into what was just a cute little pony game.  It's not going to replace your DOOM fix, but this is a really, really fun game to see. It's a good narrative, the gameplay ties in well, and the only complaint I have is it's a little *too* easy to hit the back button and hose yourself. But that's me being bad at mousing.  Note: The game is serious about not using a trackpad. Please don't; you don't enjoy it. It looks like it would be okay to play touch-based... but no, just no. Okay?",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Tried not to kill Jesus &gt;Fail &gt;1 hour and several tries later... victory &gt;All I got was a ticket 777/10    In all seriousness, excellent game! There was 1 or two very frustrating sections, but was mostly due to trying to get an achievement and a ticket. It will surprise you in many ways and it can and will trick you.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's edgy",
            "review_score": "1"
        },
        {
            "review_text": "This game is very surreal. Very dope.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true favorite of mine. I truely recommend this game, especially for the price. But, the less you know about it, the better the experience is. I knew nothing, and it was so rewarding to finish. JUST BUY THE GAME ALREADY! :D",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indies around!",
            "review_score": "1"
        },
        {
            "review_text": ":]",
            "review_score": "1"
        },
        {
            "review_text": "Turns out Satan is a terrible programmer.   Thankfully David Mullins Games is a fantastic one.   Really enjoyed this game. Do yourself a favor and play this game already.",
            "review_score": "1"
        },
        {
            "review_text": "So the first major Undertale-influenced game is already here: primitive looking game with surprisingly deep and original mechanics such as 4th wall breaks that occur in para-game territory (menus/save states/coding become part of the gameplay and narrative) and cheeky infantile aesthetics transgressed by semi-psychological horror elements, AND the illusion of linearity that is actually subverted by non-linear actions in a rhizome-like fashion as you dig deeper and deeper.   So it's KINDA subversive like Undertale, you know, that game you probably have played, except Undertale at least had you *literally* dicking around with the code in order to explore more game and story (I mean, if you really wanted to; trust me). Then again, all of this meta-game horror was being done 5 years ago by 9 Hours 9 Persons 9 Doors which you probably didn't play, AND 14 years ago by that masterpiece psychological horror game you definitely never played called Sanity's Requiem.  Don't get me wrong; this game is rad and you should buy it. Just, you know, play Sanity's Requiem and 999 and Undertale first.   01110100010101/101010100101101",
            "review_score": "1"
        },
        {
            "review_text": "A deceptivly smart and clever game that hides behind its almost-painful title. Has a really good soundtrack to boot. It says a lot about video games, their development and their fans but it never beats you over the head with its message. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Short (about 3 hours) game, with not bad plot, low skilled minigames and sometimes hard puzzlegames. But the best are music and the atmosphere.... I was totally in the game. Every shocking moment I nearly jumped out of my skin. Original price little too high for so little of gameplay. ",
            "review_score": "1"
        },
        {
            "review_text": "Hey there! Welcome to Pony Island!  In this game you take the role of a  spawn of Satan  beautiful pony, frolicking through the flowers in the  depths of Hell  perfect green hills!  You must jump majestically over gates to and  use your death laser to violently murder Lucifers spawns  blow away pretty butterflies before they can tickle you!  And we also have PUZZLES!!  And don't forget to pay your Soul to unlock premium features, unless you want to continue in filthy peasant mode...  10/10  HAVE FUN!    P.S. Get all the achievements. It's worth it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Alright, I won't lie, I walked into this game pretty worried. The ludum dare version I had played was good, but I really couldn't See it being mAde into an enTire gAme. Wow. I doN't know how, but thIS silly concept WAs Turned into a sHockINGly well-executed game. I can't really define it by one gerne alone, since it takes on so many different forms. At times, the gameplay can be a tiny bit tedious, but the game makes sure to make up for it.  That being said, it is a bit short. About 2 hours. But it's definetly worth a try if you want something quick and intresting.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would deinstall it again!",
            "review_score": "1"
        },
        {
            "review_text": "Good game. In-app purchases a bit steep though.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Just buy it, play it, and savor it. For 5€, it's a steal.",
            "review_score": "1"
        },
        {
            "review_text": "Don't research this game. Don't watch trailers of it, don't look at screenshots of it, don't read reviews of it. The less you know about this game going in, the better. This is a game about immersion and confusion; you want as much of both as you can get. Stop reading this, bef",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island is pretty ♥♥♥♥ing cool, yo. It's got ponies and it's got fences and then you gotta hop over the damn fences. Sometimes you gotta EAT HUMAN FLESH but that's cool, it's like, whatever, man, everything's gonna be all right I TORE OUT MY EYEBALLS AND I DRANK THE BLOOD THAT CAME FROM MY EYE SOCKETS a bit easy but I guess it's not really a game for hardcore players? If you're hardcore, you don't wanna waste your time with TAKE A BUNCH OF PENNIES AND PUT THEM IN YOUR MOUTH, AND THEN SWALLOW THOSE PENNIES ONE BY ONE. THAT IS WHAT HELL WILL TASTE LIKE I broke character by pretending I was a cat? I mean I was supposed to be a pony but every time I talked to the butterflies I typed in 'meow' instead of 'neigh' but that's cool, it's all YOUR SOUL IS NOT SPOTLESS, YOUR SECRETS ARE A THOUGHT AWAY, YOU'RE TAKING THE EXPRESS ELEVATOR TO HELL five stars out of five stars.",
            "review_score": "1"
        },
        {
            "review_text": "quite a good game very suscpensful.  BUT! I found it very easy. I don't know if it's me being awsome, or the games too easy.",
            "review_score": "1"
        },
        {
            "review_text": "WHO DO I TRUST WHAT AM I FIGHTING FOOOOOOOOOOOR",
            "review_score": "1"
        },
        {
            "review_text": "Play this game right now!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, this game has a foolish name. But it cloaks a really engaging game that, while short, will keep you playing for the few good hours it has. In essence, you're fighting against Satan the game developer in order to free yourself and others from his purgatory. And I was not expecting to use the phrase 'Satan the game developer' before I played this game. He's really good at it, and I'd commend him if he wasn't trying to get my soul all the time.  The end goal might be obvious, but its the journey that matters. The hacking-based puzzle game that forms the meat of it kept me engaged and thinking, especially with the twists and new additions to that formula that you instinctivly pick up on. And the ways it clevery uses and twists the interface, making it part of the puzzle too, adds so much to the overall experience.  It's worth the $5 entry price. And it offers more content than some other games that are double the price. Pick this one up without hesitation if you are at all interested.",
            "review_score": "1"
        },
        {
            "review_text": "Dont let it's initial cheerful appearance decieve you. This game has a dark story to tell.  The game grows in compexity as you go and has a few pretty good tricks up it's sleeve.  I enjoyed myself a lot more than I was expecting too. It's not incredibly long but I would say it is definitely worth while.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting psychological game that tries to mess with you in many ways. Can be beaten fairly quickly. Worth $5? Maybe.",
            "review_score": "1"
        },
        {
            "review_text": "  Bloody genius! Music rocks, graphics is cool, 4th wall breaking is awesom, plot is… Let's say that Bioshock's plot is straighforward compared to this plot. Aтв for this price… You cannot find anything better!",
            "review_score": "1"
        },
        {
            "review_text": "Great aesthetics and constantly mind-bending. Only a few hours long, so it doesn't outstay its welcome. The writing could be a little better, and the ending left a little to be desired. Takes clear inspiration from Undertale, but doesn't come close in quality. Certainly worth the $5 asking price, but not much more than that.",
            "review_score": "1"
        },
        {
            "review_text": "This game is what software development in Hell feels like.",
            "review_score": "1"
        },
        {
            "review_text": "I now question every time I receive a message.  10/10 would destroy 91 souls again.",
            "review_score": "1"
        },
        {
            "review_text": "Here you go, bud. I deleted it for you.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game. There is much more to it than meets the eye. While short, it is a great experience and is definitely worth the money. For what it is, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pony island is an amazing game to play if u want something new to try.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just a mindbending plot twist.",
            "review_score": "1"
        },
        {
            "review_text": "Short, Sweet, and to the Point!  What a great little indie game we have here! I have to be honest, I really wasn't sure what to expect when I got this game (and a few of my friends questioned what I was playing), but I absolutely loved this game. I do have to agree with the concensus that this game is definitely on the short side (took me a little under 3 hours), but for five bucks it's packed with enough humor, and satanic rituals to keep you hooked. Who would have known ponies and the devil would go so well together?  9/10 would ride a pony to free my soul again",
            "review_score": "1"
        },
        {
            "review_text": "Yes Master         it's a Mindf***",
            "review_score": "1"
        },
        {
            "review_text": "This Is Such A Cool Game! Just Jumping Through Levels As A Pony!.. Nothing Else Than Happiness And Rainbows!... Please.. H3lp.. 1m stuck 1n p0n7 1sl4nd............ But Seriously, This Game Is SUPER DOOPER COOL!!",
            "review_score": "1"
        },
        {
            "review_text": "recommended, nice idea and storyline  it's not often that you find a game with 88 codes to itself in a room  also, it's not what it seems to be    11/10 would worship satan again   ",
            "review_score": "1"
        },
        {
            "review_text": "It's very short, but worth your time to check out this gem. Great meta, indie puzzlie game. As a programmer, I found it even more interesting as you hack your way through the game.",
            "review_score": "1"
        },
        {
            "review_text": "Inserted my soul, graphics mode ponyisland text version is amazing.   Well worth the price of one soul.",
            "review_score": "1"
        },
        {
            "review_text": "peculiar game, basically a platformer but tons of meta-references",
            "review_score": "1"
        },
        {
            "review_text": "Absolutley brilliant and refreshing game.  I dont wanna say anymore as the game has to be played to fully understand why its so good.  Dont watch a trailer, dont look the game up in any other way, no walkthroughs or anything.  Just buy it and enjoy the experience.",
            "review_score": "1"
        },
        {
            "review_text": "Calling it now. This is the best demonic arcade themed puzzle game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game and play it's only 5 dollars and you will get every penny out of it in an experince and PLEASE don't search it up or you will ruin it",
            "review_score": "1"
        },
        {
            "review_text": "Battle a cyber Satan and his Daemonic Disciples as a pony? Yes 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely the best pony petting simulator on the market.  A++ Would pet again.",
            "review_score": "1"
        },
        {
            "review_text": "after spending a good amount of time to finish the game all I ask is please let there be a sequal to this with the same theme soundtrack, Dont know why but I love the ost of the game but was saddened by the fact that Ive completed the game AND listened to the sounds, will there be another one? I dont mind a second run",
            "review_score": "1"
        },
        {
            "review_text": "Stop reading and play it I said stop",
            "review_score": "1"
        },
        {
            "review_text": "Great game, made even better by a good story. Plus, 100% of people put positive reviews (something I just checked 5 seconds before writing this line), and there have been 120 reviews as of the time this was typed. If 121 people can't convince you to get this game, then you are either afraid of your friends calling you a brony for some reason, afraid your friends will think that you're playing a sissy game when they see you're playing pony island, or just afraid of the game in general. Trust me, if 121 people weren't disappointed, why would you be?",
            "review_score": "1"
        },
        {
            "review_text": "Imagine yourself on drugs, hacking, and while playing with ponies. Hard to imagine, right? So I highly recommend this game. There is NOTHING like it and never will be.",
            "review_score": "1"
        },
        {
            "review_text": "I got in a fight with a guy on my friends list. Then later the game made fake steam messages of him talking and making fun of my answers to a quiz, i told him to ♥♥♥♥ off, he unfriended me later that day, 200000/10 best way to loose friends",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Pony Island is an unusual puzzle and gallery shooter game that's fairly meta, but not nearly as intelligent as it wants you to believe it is.  My experience with Pony Island was not very thrilling. I was bored throughout most of it. I spent the first hour or two trudging onwards, telling myself that all the cool stuff was going to start happening eventually, and I just had to wait it out. Before long, though, I realized that that wasn't the case—that the repetitive pony shooter really was all there was to see here. There's some ticket-collecting gimmick here for all of the virtual crack addicts, but not much of substance—nothing that really makes you laugh, or feel things, or stop and reflect, like a good indie game would, nor is there much of a challenge. It's just kind of... a thing that you experience.  With that, I'm left wondering what the game's appeal was supposed to be. It's not really funny—I think I laughed a sum total of once—it's not really witty, and the music doesn't do much for me. The game is embellished with a few meta-heavy gimmicks and a narrative of 'the game is possessed by an evil force that is being a jerk to you', but the bulk of the 'gameplay' is split between a gallery shooter with a laser-shooting pony, and some 'put the right item in the right place at the right time' puzzles. With slight variations, you'll go through the same kinds of puzzles and shooter stages over and over, for bulk of the 3 hours of the game. With regards to this, I think it fair for me to summarize the game as being a one-trick pony. (Hah! Get it? My joke is almost as clever as the game itself.)  On the positive side of things, the game is competent. Stylistically, in terms of graphics and sound, it nails the atmosphere that it's going for. However, style doesn't cut it for me; I'm looking for subtance, and I found Pony Island lacking in that category.  Another positive: There  was  one boss 'fight' that I thought was kind of neat, and some of the meta stuff happening there really took me off-guard. But that's just 10-15 minutes of the game. I spent the rest in boredom.  Lastly, the game is only $5. This is a plus, because if it looks like the sort of thing that would appeal to you, despite my negative view of it, you're not putting a whole lot on the line to buy it and see for yourself.  In closing, there's a lot of hype surrounding this game right now, but I don't think that it's warranted. Pony Island is simply a repetitive game with very little to say. I think people lauding this game as an early contender for GotY 2016 are gravely mistaken, as I doubt that anyone will remember this game come the end of the year, much less 5 or 10 years from now, when an actual great game's legacy would still be vibrantly alive in its fans' minds. There's just not anything really memorable or insightful here.  In short, I don't recommend spending your time on Pony Island.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game about ponies, I'll never uninstall it from my Hard Drive.",
            "review_score": "1"
        },
        {
            "review_text": "Best game 2016 XXX Recommended !!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I dunno what i played, but i played it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite unlike anything I've played before, and I'm all about weird little games. It's short, but it's nuts and very cool. I recommend it, and I also recommend you go in blind. If you need a little convincing, I'll say it's not very difficult to beat, but it's tricky to get everything. Solving each problem is rewarding, the achievements are worthwhile and not excessive or a waste of time, the design is super clever, and you'll want to knock out this whole game in one sitting.  I hesitate to describe it beyond that. But I will say that you should get all the tickets.",
            "review_score": "1"
        },
        {
            "review_text": "what",
            "review_score": "1"
        },
        {
            "review_text": "I broke in Satan's PC account. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was enjoying it until the You Killed Jesus Level. After spending at least 15 minutes on that level I give up, as I started to feel trapped. Maybe I'll finish it someday and remove this review. And before anyone corrects me and says it's easy and you can do it, good for you but I honestly couldn't care less. If I want to feel salty I'd be playing [INSERT MOBA HERE].",
            "review_score": "-1"
        },
        {
            "review_text": "A distracting little title, but I expected more layers. Under the pretense of a suspence/horror game, pony island is actually extremely linear and streightforward. Peering deeper into the machine might net you a few achivements but it doesn't change anything about the story or gameplay. Even the story itself is completely face-value - once you get the basic premise, you've seen it all. 4th wall breaks were entertaining but gimmicky. Nothing has lasting impact.   I'm giving this a thumbs down in spite of myself because it's only 5 bucks and probably is worth playing, but compared to other games or to what it *could* have been, it doesn't make par. I'd be interested to see it improve if the developer keeps going - there's a lot of unexplored material to expand on, and it could be really excellent given more time and more levels into the conspiracy.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd say it's worth what I paid for it ($3 on sale), but I'm not sure it's worth the time spent. The game has some good ideas but the gameplay and the narrative weren't compelling enough to keep me engaged. It's reminiscent of Undertale in a few ways, but Undertale succeeded in hooking my emotions into the characters and backstory in a way Pony Island did not. When the game ended I did not feel any compulsion to dig into the rest of the story that I missed, to try to find secret endings, etc.  I'd say the first 15 minutes of the game are its strongest, when you first break through the facade and interact with the 'desktop' of the system and the narrative picks up. I don't feel the game delivered on that opening ambition.   I think the game would have benefited from a slower burn and actually trying to play up a psychological horror angle (not sure why it has that tag, I wouldn't classify it as such) with a bit less tongue in cheek. The antagonist(s) weren't actually all that menacing.   From a gameplay perspective, the core Pony game (and its variations) was adequate but not super fun in and of itself. The 'hacking' puzzles were okay but a bit clunky to move pieces around with the mouse. I appreciated how some puzzles had hints in garbled code. Hunting down tickets was moderately engaging.  I just wish the game had gotten me to care a bit more.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd say it's worth what I paid for it ($3 on sale), but I'm not sure it's worth the time spent. The game has some good ideas but the gameplay and the narrative weren't compelling enough to keep me engaged. It's reminiscent of Undertale in a few ways, but Undertale succeeded in hooking my emotions into the characters and backstory in a way Pony Island did not. When the game ended I did not feel any compulsion to dig into the rest of the story that I missed, to try to find secret endings, etc.  I'd say the first 15 minutes of the game are its strongest, when you first break through the facade and interact with the 'desktop' of the system and the narrative picks up. I don't feel the game delivered on that opening ambition.   I think the game would have benefited from a slower burn and actually trying to play up a psychological horror angle (not sure why it has that tag, I wouldn't classify it as such) with a bit less tongue in cheek. The antagonist(s) weren't actually all that menacing.   From a gameplay perspective, the core Pony game (and its variations) was adequate but not super fun in and of itself. The 'hacking' puzzles were okay but a bit clunky to move pieces around with the mouse. I appreciated how some puzzles had hints in garbled code. Hunting down tickets was moderately engaging.  I just wish the game had gotten me to care a bit more.",
            "review_score": "-1"
        },
        {
            "review_text": "Pony Island is trying to bite more than it can swallow only to realise that it doesn't have teeth in the first place. Repetitive in order to fill it's vacant parts only to bare the developer artistic erectile dysfunction. The game is too afraid to explore it's own ideas, too scared to move outside it's well established medium. It's even more sad that the game makes fun of things it deliberatly uses a minute later in order to artificially increase it's time footprint. It's satire is weak enough even without the game being prime and worst example of all the issues it makes fun of. The game tries too hard to create another layer of creative abstraction it stretches itself thin, stumbes across itself and then faceplants in the most unfunny and boring way. And it's not even self-aware. Like a 13yo girl trying to be edgy and artsy AF on her facebook. Because you need smart content in order for this to work, be actually self-aware, or at very least have well thought writting. As you might guessed Pony Island is a dumb game, lacks self-awareness, and has writting of elementary school caliber with an obligatory bit of 'scary spooky skeletons'. It's not even 'so bad it's good', it's just bad. It has tremendous pacing issues on top of that so it's simply boring. Pony Island is just an unfunny useless trinket that for some unknown reason became an injustified paid-for product. Are you that easy to impress?  In conclusion: a meta-game that miserably fails at both being 'meta' and 'game'. Want a real fourth-wall breaking horror experience? Buy Imscared.  Note: Just to be fair asmodeus.exe encounter is brilliant. It's 5 minutes long though.",
            "review_score": "-1"
        },
        {
            "review_text": "While this game is interesting, it suffers from a few fatal flaws.  Firstly, it is very short, you can blaze through it in less than an hour. Secondly, it borrows from undertale, the same way leatherface borrows people. It is the same down to the minute details of having a character teach you stuff, name ends with -ey and introduces himself by saying howdy!  And finally, while visually interesting, it just is unfun and not good on the story front. I would buy this for mabye 0.99 and that is a bit much.  (and I wasn't lying about the undertale thing, its ending is the same, down to the dialog. One of the bossfights does the samething a boss does in undertale, and it even uses old retro gameplay to put a 'spin' on the boring combat/platforming)",
            "review_score": "-1"
        },
        {
            "review_text": "I hear it gets more interesting, but the first 30 minutes didn't hook me.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok puzzle game for patient people. Some puzzles were frustrating, but the ending was pretty great.",
            "review_score": "-1"
        },
        {
            "review_text": "There were parts of this game that I enjoyed. The coding logic puzzles were okay and a few of the meta gimmicks were interesting, but most of the jokes and puzzle mechanics overstayed their welcome. I was pretty bored for most of my playthrough and I can't see a reason to go back and play more. Maybe worth it on sale, I guess.",
            "review_score": "-1"
        },
        {
            "review_text": "The idea behind this game is neat. It's a meta-game; a game that is aware that it's a game, and plays with that idea. Ultimately, however, it fails to deliver any message or meaning beyond its seemingly-deep facade. The plot twists are rather predictable once you figure out   it's literally hell  . I couldn't help but roll my eyes at the line   'but you have to delete the file to advance the plot'  .   Perhaps if you've never experienced this sort of playing with meta-concepts before, it might blow your mind. To me, it was sophomoric at best.  As an aside, there's a point where it makes it look like one of your Steam friends is talking to and mocking you. This break of player-developer trust is absolutely unacceptable; you don't ♥♥♥♥ with my relationships with other people.  Refund requested.",
            "review_score": "-1"
        },
        {
            "review_text": "It's basically Undertale, but actually good and enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "This game is fine...if you're a child. The 'demonically-possessed arcade' idea is cute, but ultimately serves as a gimmick to cover up shallow and simplistic mechanics. The only difference between this and the flash games of the early internet is that Pony Island costs money. Money that could have been better spent on anything else, like booze.",
            "review_score": "-1"
        },
        {
            "review_text": "While I would say that Pony Island is interesting and worth experiencing, I find it hard to recommend it for the 5Euro it asks for.  The gameplay consists of three sets of mechanics.   *puzzles where you manipulate the route of an arrow through the game's code. increasing or decreasing values to unlock new abilities or progress the story.  *Making your way through computer interfaces, communicating with the characters of the game.  *A side scrolling runner where you jump over obstacles, and defeat enemies,using a rechargeable beam.  The puzzles are interesting and bring some well balanced enjoyment. While the runner stages feel more like a chore, that you endure for the sake of progressing the story.  The story and aesthetics is what redeems the game. What they do with the puzzles, and the way they connect the story with the fact that you are inside an old computer is interesting to say the least. It doesn't leave much to the imagination, but makes you pounder what computer games can be.   This said, it is a 2.5 hour game, that consists a lot of running in a straight line, jumping obstacles. If you see this on a sale, grab it, but for the current price of €5, It's a thumbs down.   Pros: +Interesting puzzles +Unexpected Twists +Great Atmosphere  Cons: -Boring runner segments -Unclear objectives -short -  Unsatisfactory ending, the last fight didn't in any way show if what you were doing was progressing the battle, leaving you just running and beaming things seemingly at random.   ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is only a satire for conteporary game design. It's gameplay is utterly boring and UI is unusable. I think I need to buy some modern and dull nonsense just to erase bad taste after this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a ♥♥♥♥ sandwhich and I ate it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not fun and I dont like it.",
            "review_score": "-1"
        },
        {
            "review_text": "I figured this game would be interesting, but it just wound up being boring. Maybe its because I knew about the whole satanic possesion thing going into it, but the whole game just feels heavy-handed and extremely dull.",
            "review_score": "-1"
        },
        {
            "review_text": "Authentic Pony Experience",
            "review_score": "1"
        },
        {
            "review_text": "This game was really fun to play it got me to the edge of my seat with every second of playing. The story was awsome, its a great game to play",
            "review_score": "1"
        },
        {
            "review_text": "Crafts a decent story with simple components.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome. Only 2 hours though. Worth the price. You won't find any other game like it. Except Calendula. Kinda weird that 2 very similar looking games came out so close together. Anyway, Pony Island is awesome and you should play it.",
            "review_score": "1"
        },
        {
            "review_text": "You can kill Jesus. As a Pony. By blowing wind at him. 10/10 best game",
            "review_score": "1"
        },
        {
            "review_text": "Whilst I don't believe this is as fantastic as most reviews say, I do think this is an interesting time - and one that is probably worth $5 in the end. There is a great soundtrack, and some of the hacking elements are quite fun, if not frustrating at times. I can't say I've ever played something like this before.",
            "review_score": "1"
        },
        {
            "review_text": "Go into this game knowing nothing. No trailers, no reviews that mention the plot, nothing. Just go in completely blind.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely interesting. Very ambiguous plot line. Easy controls.  This is one of the most unique gaming experiences out there and I highly recommend it. Plus, it's only $5! It's hella cheep for the average consumer.  ",
            "review_score": "1"
        },
        {
            "review_text": "oh my god, just the best pony endless runner platform game. play it. don't look for more info, thats all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to pony island! Jump over hurdles, Get tickled by butterflies, and-.....GIVE UP YOUR SOUL.  66666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666666LUC1F3r",
            "review_score": "1"
        },
        {
            "review_text": "Usually I have plenty to say about a game like this. Overall, if this game did not have have the story telling elements attached to it, I would imagine this would be a horrible game. It can be repetitive, but it is the story that you are playing here.  For 5 dollars I feel like I got a pretty good expirience. Nothing to complain about, except that maybe it is a bit short. But I guess that just means I like the game that much.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun to play and, in my opinion, worth the $5! My attention was held throughout the whole first play through and there is enough content to bring you back to uncover the whole story. 9/10: wish the main story had more, but flawless gameplay, enjoyable experience, and a memorable title you'll want to share with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥♥♥♥t. You literally have to hack the game to beat most levels.",
            "review_score": "1"
        },
        {
            "review_text": "Most accurate pony simulator I've ever played.  10/10      (But really, this game is pretty well-done, these guys really did their best to try to make the entire thing as interesting for the player as possible. Although it can be occasionally frustrating, and there are parts where it can somewhat drag on, I would say it is really a unique experience you'll rarely find in any other game. Plus it feels awesome as you start playing through.)  (Recommending for people who are willing to invest a couple of hours on an interesting game, have a spare couple of bucks, and can both play platformers and puzzle games. NOT recommended for those who prefer alot of action in the game, are not willing to get challenged to the point of frustration occasionally, and those who don't have the cash)",
            "review_score": "1"
        },
        {
            "review_text": "I have always wanted to be a a pony spitting out binary code. NNNAAYYYYYYYY10011010110101",
            "review_score": "1"
        },
        {
            "review_text": "I have to tell you  Its awesome, seriously  The immersion is great, and its just very fun in general. Talk about breaking the fourth wall.  But enough from me, check it out!",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the most f'ed up game I've ever played.  Turns out it's just as entertaining to watch other people play it for the first time.  That being said, I definitely got my 5 dollars' worth.",
            "review_score": "1"
        },
        {
            "review_text": "Is This What Hell is like? Simulator gets a Short Meta-Narative out of 10",
            "review_score": "1"
        },
        {
            "review_text": "just play Eversion instead",
            "review_score": "-1"
        },
        {
            "review_text": "Love it so much I uninstalled it!",
            "review_score": "1"
        },
        {
            "review_text": "Worth the $5 will ♥♥♥♥ with some heads before it's over    not about ponies.",
            "review_score": "1"
        },
        {
            "review_text": "Neat little game to play. Didn't require a whole lot of time to finish (clocked in at exactly two hours) and I consider it just the right price (maybe a buck or two less might be considered more 'worth the cost'). I'm also a bit of a fan of chiptune, and so I enjoyed the soundtrack. I enjoyed the little 'programming' puzzles and the navigating through the computer bits.  Although, to be a bit honest, I would've preferred someone other than the devil himself be the creator of the arcade machine. It's a bit of a cliche theme. At some points during my gameplay, I found myself wondering if it was getting religious (I think I found a bible reference in there somewhere?) or if it was just being edgy. I'm pretty sure it was just being edgy.  Overall, if you've got five bucks and three hours to spare, enjoy chiptune, and don't mind satanic stuff being the main theme, perhaps this might be a fun little use of your time.",
            "review_score": "1"
        },
        {
            "review_text": "satan, a ♥♥♥♥ing brony?  you wanna talk about this man? I mean, that's even a bit too low for you.",
            "review_score": "1"
        },
        {
            "review_text": "OMG i just finishd the game...and its awsome!!! I have more than 170 games in steam and I havent seen such as uniq game ",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best games I've played recently. The atmosphere is great, and even if the gameplay is lacking, the story makes up for it. It's also got quite the mystery.",
            "review_score": "1"
        },
        {
            "review_text": "In which you're a tormented soul and Satan's idea of punishment is forcing you to play his shoddily coded game about ponies.  Truly a unique experience, a lot of neat storytelling aspects in here that only a game can present. Pony Island does a good job depicting you as being toyed with by an all-powerful being, trying to break out of his prison by slowly breaking down the rules until you find a flaw in the system.  Big complaint is the length of the game compared to the price. Not a lot of replay value, the game is pretty short (took me less than two hours), the gameplay is pretty bland (but you can argue it's intentional, after all Satan can't program a good game), and the ending is pretty unsatisfying. It could probably take less than 3 hours to 100% all the achievements if you knew what you were doing. I really liked the concept of the story, so it was disappointing that it was over so quickly.  Still though, really enjoyed this game. Asmodeus was one of the most unique and memorable interactions I've had in any game. Get it on sale, or if you're not into spending money, watch a Let's Play.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, played it a bit while being semi-asleep. Better to go in raw, but without any context you might lack motivation to try it. Oh but you should. Blurs lines between game and reality. Get your pen and paper ready. Write down codes. Will you need them? Who know. Nobody. All i know is that &lt;corrupted&gt;",
            "review_score": "1"
        },
        {
            "review_text": "I Uninstalled this game.  No. it was fantastic experience and brilliant. thats the reason why i uninstalled.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed every minute of this game. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "it's good. If I were to say anything else it would be spoilers. play it.",
            "review_score": "1"
        },
        {
            "review_text": "This is not about ponies, it's about fighting the horror of satan himself",
            "review_score": "1"
        },
        {
            "review_text": "A cute children's game about ponies and butterflies. Perfect bible studies distraction, you get to jump ponies over obstacles with an occasional puzzle break to refresh the beautiful atmosphere.  Wish more games were as peaceful and relaxing as this.",
            "review_score": "1"
        },
        {
            "review_text": "A must if you know some coding (if and loop are enough). very quick and very funny meta-game.",
            "review_score": "1"
        },
        {
            "review_text": "Do yourself a favour.  Don't read any reviews.  Don't watch let's plays.  Just buy this game.    What is this game?  Basically it's a puzzle game combined with a jump'n'run. That's all you need to know.  Still reading? Buy this game already!",
            "review_score": "1"
        },
        {
            "review_text": "Just play the game. Don't look into it, don't think about it, just play it.",
            "review_score": "1"
        },
        {
            "review_text": "It's truely an amazing game, did not expect me to like it so much!  If the combination of a puzzle game, a platformer, a mindgame, a game with a lazer spitting pony and a game with brony Satan sounds good to you, pick it up. You would be amazed.  If not, just buy it, and play it. I can't recommend this enough. It's only a couple bucks and it has an Overwhelmingly Positive score for a reason.  Truely an amazing game and so far my favourite game I played in 2016. Really looking forward to future work.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite possibly the best 8-bit game I've ever played. And, yes, I'll admit, I got a little emotional at the end, f you don't know what I'm talking about, BUY IT. Best five dollars I've ever spent.   (Hint: stay for the credits at the end! Trust me!)",
            "review_score": "1"
        },
        {
            "review_text": "Don't look up anything about this game. Just buy it. ITs 5$. Its a few hours long or so and throws you for a loop a few times. It isn't amazing, but its a pretty hilarious experience for 5 bucks. Better than a burger at McDonalds and causes way less bowel movements.",
            "review_score": "1"
        },
        {
            "review_text": "Yes. Well done. Completely unique. As to the story, I understand that it could have been a little predictable, but it is still amazing. I'm going to hop back in soon to get all of the tickets and !%#!&amp;!&amp;#%*1010!*$!&amp;%!))))00010101",
            "review_score": "1"
        },
        {
            "review_text": "This game does show a lot of promise, but overall has a few flaws to it as well. Perhaps this may stand as a bit of constructive criticism for how the developer may improve on their next game.  Pros:  -The in-game Pony Island is a rather fun platformer, starting off simple and getting only slightly more complex, but still being enjoyable throughout. -The puzzle segments are quite clever. -The game does pull off a few really neat tricks, like the semi-final boss fight containing plenty of very clever features. -The soundtrack is rocking and definitely makes me want to buy it too. -The humor definitely got plenty of laughs.  Cons: -Too meta. -Inconsistent in its meta. For best example: Who are we? The Player, or the Character we play as? -I keep hearing this is supposed to be a type of horror game, but not once felt in any way scared, paranoid, or unnerved. -Ticket collection contains plenty of very obscure puzzles, to the point the developer even had to give away the answer to one. The reward for completing it is... very dissatisfying. -Some of the secrets of the game require altering game files manually and cannot be viewed within the game. -Game asks me to uninstall it when over, and crashes itself at the end. Normally rather revolutionary concepts, but by now have gotten overused.  Overall, the game is fun while it lasts, but could certainly stand for some improvement.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, scary, brack 4th wall, what does this mean?.... ITS A GOOD GAME BUY IT.....Not later but today!",
            "review_score": "1"
        },
        {
            "review_text": "Made me consider Satanism. Because who else can help him make a better game?   Rating:  9/10 Broken Codelines",
            "review_score": "1"
        },
        {
            "review_text": "It is not what you think. Just play it. It is worth w.",
            "review_score": "1"
        },
        {
            "review_text": "Very short game, but kinda fun. Basically a game where you hack into another game. Gameplay is a bit on the repetitive side at some points. The hacking puzzle concept is pretty interesting though.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would Uninstal again",
            "review_score": "1"
        },
        {
            "review_text": "The creator of this game must have sad mind, pathetic and childish - Would recoment at least twice",
            "review_score": "1"
        },
        {
            "review_text": "its gud geam   mnid bolwn   puneis evriver   bay it naow",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that you have to play without any real knowledge to what it is.  But it is amazing, it will take you by surprise and blow you away.",
            "review_score": "1"
        },
        {
            "review_text": "FOR THE LOVE OF ALL THAT IS HOLY:  PLEASE  GO INTO THIS  GAME  BLIND.",
            "review_score": "1"
        },
        {
            "review_text": "More meta than you can shake a spoon at.  In other words, Excellent.",
            "review_score": "1"
        },
        {
            "review_text": "A game with disturbing implications. Am I no longer able to play a well constructed runner games without a meta narrative about an arcade cabinet that wants to claim your soul?  Are there just so many well crafted games out there that if yours can't be hacked so that ponies can fire lasers at the devil himself, my time could be better spent elsewhere?  Most troubling, indeed.  Game's good, though.",
            "review_score": "1"
        },
        {
            "review_text": "Crafts a decent story with simple components.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would get completely trolled by again",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a one-off experience of about 3 hours. Puzzles do get hard, so if that's not your bag play it with a friend who likes that stuff.",
            "review_score": "1"
        },
        {
            "review_text": "This game is totally amazing , one of my favourites -just love it.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I have no idea what caused me to buy this game and play it for an hour. But every second of it was filled with excitement and adventure around every corner. The little puzzles in the game make it all the more interesting and make it a little more than just a point and click adventure game. I really do recommend this game to anyone who is willing to pay for the game itself.",
            "review_score": "1"
        },
        {
            "review_text": "It's a rather short game about a pony jumping over gates and- I'm stopping there, play it for yourself. Seriously one of the best games I've played, even if it is on the short side.",
            "review_score": "1"
        },
        {
            "review_text": "Truly excellent game",
            "review_score": "1"
        },
        {
            "review_text": "it doesn't suck as much as the name implies",
            "review_score": "1"
        },
        {
            "review_text": "Tottaly worth to loss my soul for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Simple yet fun, a good story, entertaining.  Paid full price for it, tottaly worth every cent.  But really dude, buy a ♥♥♥♥ing unity license.",
            "review_score": "1"
        },
        {
            "review_text": "Game is unique, smart, trippy and disturbing. I can say you can call this ART. YOU MUST BUY THIS GAME. We need to feed that sick brain to create more this kind of unique implementation. It's like undertale in a hell setting. MUST PLAY.",
            "review_score": "1"
        },
        {
            "review_text": "This game was actually what David Bowie was singing about in 'Blackstar'.",
            "review_score": "1"
        },
        {
            "review_text": "The game title is misleading: This IS a game about ponies.",
            "review_score": "1"
        },
        {
            "review_text": "Be a beautiful pony frolicking and leaping over gates! Don't let the butterflies tickle you!  ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "This game is not what it seems. Behind all the coding and demonic references disguised as a cutesy game is an actual challenge, one that I have not had from a Steam game in a long time, if ever. If you like puzzle games, and you like side scrollers, and you love demon aesthetic, this is the game for you.  PS, Louey, if you're reading this, I'm so sorry.",
            "review_score": "1"
        },
        {
            "review_text": "Truly the best game evevevevEVEVEVEV-  possession.exe has encountered an error and must close.  Would you like to send a report to SatanTech?  _Yes No",
            "review_score": "1"
        },
        {
            "review_text": "You don't play this game. This game plays you.  It's hard to say anything about it without spoiling too much but know two things: 1. This is not a game about ponies. 2. Expect unexpected.  This game is short, very short. But I loved every second of it.",
            "review_score": "1"
        },
        {
            "review_text": "Not much I can say without spoiling the game, but it's really clever - and oddly punishing at times.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game. Story was great. mad me laugh with the satan jokes. 9/10 would really recommend for you to try this. Puzzle games were great and challenging. Takes about an hour and a half to complete",
            "review_score": "1"
        },
        {
            "review_text": "Interesting idea. Fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Little pone game with its fun gameplay and nice places its worth the buy",
            "review_score": "1"
        },
        {
            "review_text": "Game tricked me in an amazingly meta way. Cant spoil it. Cost me $5, That one moment alone was worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun i loved every second of playing :]",
            "review_score": "1"
        },
        {
            "review_text": "I... I don't know what to say. This game... it is so full of darkly humorous delights. You should buy it. I'm going back in. If I'm not back in 2 hours, call the president.",
            "review_score": "1"
        },
        {
            "review_text": "The only game that asked me to uninstall it...",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island is a great game for your friends, family and perfect for all ages! Outstanding and innovative gameplay include amazing jumping segments, fun and challenging puzzles along with really well made storytelling! All of that packed with the colorful, cute artstyle and cheerful music! Well worth the moṋ͕̯̬̘̫͡e̺y͎̼͕͕!       I̟̩̎̾̾͂̇ͅf̢̱̬̗̼̳̙͚̾̉̎̎ͩͯͯ̈́ ̴̛̫̻̂͋̐̌̎à̸̪̯̀ͧ̾ͬ͟n̴̵̯̻ͦ̀ͅy̴̒͐ͥ҉̧̻͙̘̟̰o̹͍̺̺͕͚ͨ̈n̷̮͚̣̲̰̥ͨͨ̉ͨͫ̅ͩͬ̓̀͟é̴̙̳̟͍̰̜̀̏̑̚ ̢̛̥̩͖͙͈̺̞̻̿ͬ̈̽̾̍̎̚o̡̭̳̥͈͈͂͛ͣͫ͆̈́ͅͅuͥ̈́ͥ̓̉͑́͑҉̥͇̗̲͕͓̬t͔̹͋ ̵̭̰͉̗͖̪ͩͥͅt͔͇͍̼ͦ̐̒ͨ͋̑́ͫ̚̕ͅḥ̣͓̩̱͕̩̇͊̈ȇ͔̝̫͍̣̪͍̰̀̕ŗ̴͙̮̻̊̏͊̀e̴̠͇͉̱̼͕̪̘̓͌̾ͯ̄́ ̠̘̤̙̜̥̞̥͂̌ͣͫ̏͝c͇͓̱̳͇̟̋̽̅ͦͤa̞̼͎̮̣͎͉ͬ̈̐̔n̡̤͖͕̼͆ͤ́́͠ ̙̖̲̺͈̩̰̭̩͛͒̆͛ͨ͑͒͂ͣ͜͜s̷̸̞̫̺̯͌̂̾̊͒̎ͨ̑́ͅe̽̇͑̈ͥ҉̻͖̜̣͖̫̠͖ę̷̱͈͓̝̬̫̹̏ͨ̃͢ ̺̬̲̻̫̩̼̜ͦ͑͜tͭͧ̒͜҉̰͖̬̪͙̲h̴͖̲̟̱̯̩̘̟͂̓͗͢i̧͖̳͚͚̗͌͗͑̕̕ͅṡ͔̮̘̓ ̡͈͍̮͉̹̑̒̀p̴̻̝̜̗̰̪̳ͪͥͨͣͬ͡l̨̬̠͓̲͚̘͖͗̓ͯ͜͝ͅe̸̞̙͔̞̠̯͛͑̂͑̈͞a̵̧͎̬̖͓̗ͦͩͫͨ̇̅̚ş̷̵̤̳̭̌̐e̴͉̯͍̣̩̓̊͊̇ͦ͛ ̨̾̐҉͚̲̠h̏̾̽ͯ͗ͯ̈̚҉͍̖̘̖ͅḛ̴̴̼̹͖̦ͩl̰̭̙̆̆̐̕pͭͦ̾̋́͊͏̡̜̼͖͕͚̯͎̭͜ ̟̭͉̭̖̝̿̑ͦ̕͝m̶̨̤̗̝͕̞͖̎ͦ͑̎͐͐̍̄͡e̸̝̙͕͗̌ͣͭͯͯ͢,̶̭̮̠͉͖̺̻̲̏̈̽ͭ̐͠ ̻͓͓͉ͪ̀͒ͯ͊̇́͞h̳̝̞̾ͣ͘e̷̼̱̮̳͐̓ͬ̋̒̚͠ ̜͉͛ͤ͝w̸̩̠̻̻̟ͥ̚͘o̶͈̻̣̗̔́͛̈́͛n̶̵͇̠̗͍͈̗̏̆ͫ'̙̺̙̱̣͓͒͒̊͛̃̇̑͠t͇̻̼̘̪͖̾̀̀̀͞ ̸̺̞̖͚̺̲̗̎ͤͭ̑̏ĺ̢͈̲̙̜̮̮͖́̒ͦ͛ͮ͑͐̐͠e̸̘̥̺͇̮̫̪̓t̐͋̈̅̓ͯ͋͑͢҉͓̠͙̩̝͔ ̨̰̦̌̾ͥ́m͇̗̱̜͇͈̤̈́̂͢͡e̫̝̘̤̺̜̗̰̾̓ͯ̉͡ ̵̘̪ͭ͂̈̅͐͘̕ģ͓͚͊ͥ̏̋̃͋o̢̫̫͉͙̩͍̻̝̔ͭ́.̘̳͊̍ͣ̂ͬ̃ͯ̊͜ ̴̗̱͎͂̈́ͥD̵̴̬̺͍̰͓̱̜͆ͩ̌o͙͖͕͎͓̠̾̒ͦ̓͟n̶̺̜͖̝͓̲͐ͯ͂ͫ̾ͪ͒̚͞'̄͗ͪ̔̇͏̥̟ͅt̯̠̪̼͎̯͉͌ͥ̍ͥ͋͟͞ͅ ̞̥̬͔̹̣͓͉̮ͣ̑͊̎͒̈ͯͫf̰̼̺͙͓̱̣̮ͥͥ̾͛͆͌̿a̶̢̫̼͖͉͙̫̖ͧ̂l̛̛͓͇͋̒l͊ͥͧ́͛͏͙̞͎͖͔͔͖̮ ͔̟̝̦̥͔̈͌ͩ̔ͥf̘̗͕ͮͦ̿̕o̸̘̲̙͂ͮ̈̾̇ͩͤ̚͡ŗ̬̱̜̻ͨ̿ͬ̀͟͝ͅ ̈́̆͘҉̣̝͇̣ͅh̢̭̪̫̩̮̖̑i̖͕͚̠̇̍̅̋ͥ̆͂͝͝ͅs̪̺̣͙ͩ͑̓͂ͬ͡ ̛̹̗̩̂ͨ̓͐ͮ̋͠ḻ̢̗̠̼̩͎̣̠͔ͮ̿ͧ̍̋ͭ̍̏i̇͐̑̅͆͐ͥ͞͏̜͉e̵̫̝̩̰̠̼̅ͬ̐͆͆̉̏͡s̛̩͉̺̬̲̣͎̋̇̈́͛ͯ̚͡,͒̂͐̈́̓͂ͦͯ͏͏͏̭͔͈̻ ͤ͒̑͗̔̇̌͆͏̮̺̙p̞̯̫̖͓̬̖̈͡͞͡ͅḻ̟̏ͯ̾͘͡͡ẹ̖̙͚̥̉̽́͝͡a̸̴͓͚̜̠͊̈́͜s̬̮͙̝͐ͦ̓̐̏̓͜ȩ͖̤̲͈͎̭̤ͦͦ̐ͫͩ͑ͧ͋͒ ̙͖̼̓̐ͦ̃͋s̝̠̼̦̪̺̤̣̆̉̔̄ͅtͯ̇͂͋͏̜͈a͕̳͙̬ͣ̂̉̇͛̌ͣ́ẏͯ͐ͦ͆͏̜̼̭ ̴͎̮̺̮̠̩̩̖̃̎̔͂a̠͉͍̫̼̻̲̒ͥ́̓̅͑w̴̎ͣ͑҉̶̪̺ạ̴̢͕͇̝ͪ̓̀y̸̢̯̙̝̰̻ͦͤ̌͋ͭ͆ͤ.̓͒̆̾̏ͫ̆ͨ͏̺͇͙̣̹̼͓ͅ ̥͈̳͖͉̦̯͙̠̅̒́R͚̙̱̂̑̂̆͋͛͜ų̪͍̹̬̄ͦ́̅̊͛̎̒ͦ͟n̵̼̯͙̤͍̙̘͂͘.͚̘́ͩͯ͛́́ ̸̣̺̩̣̜͍̙̄̄̒́͐͞Ṟ̠̣̳͉̙ͯ͡ͅų̎ͥ̏͑̉̇̆̀͏͔̳͚̺͚̮̠ͅn̥̳̤̳̋ͬ̈́̎͜͞ ͕̦̞̺̦͒͌̋̂͟a̡͚͍̗̬̖͌sͤ͛͂ͭ̃҉̹͇͖͎̦̱̕ ̻͖̔̌̐̒̆̓̈̂͜f̠̝̙̲̟͊̄̒̔̓ͯ̉ͧͤ́͜a̖̝͙̽ͪ̓͘͘r̢̲̜̳͂ͦ̐̿̅̎̇ͅ ̙̭͒̊̉̕ạ̵̸͓̏͒ͨ̒̀ͫ͆ͬ͗w̴͔̗ͥ̌̐̆ǎ̷͉̘̙̬͎̰̺ͩ̓̏̄ͅy̵̾ͥ̓͏̡͉̙͍͖̯̖̩̥ ̧ͥ̋ͨͦͧ̓̓҉̝̯̼̟̦a̡̳̩͙͒ͥ̓̉ͩ̍̉ͦ̐̕s̻͔̞̞ͥͣ͗̅̅̅͑͐̚ ͎̀͑̀y̞̭ͬ̅͢o̵̖̤ͦͦͨ͂̑̎̚͝u̦̫̗̺̼̥̤ͯ͆ͪͬ̄͐̽̎̍ ̪ͩ̎ͧͣͦ͐ͣ͋̕ć̖͓͓̍͂͊̓̂̕a̱̟͙̱̯̮̗ͯͨ̍̚͡͞n͉͕̩̜̝̩ͧ͒̊͒̓.̨̦̘̺̺̪ͣ̎͂ͯͣ̉͆ͧͅ        D̨̜̞͈̜̻̥̙͇̦̮̮̦̥̝͖̺̭̱̄ͪ͂̔ͬ͂̃̂̽͗ͪ̂ͦ̅o̢̜̘̳͇ͭ̉͋̂ͤͥ̍ͫͧ̇̈́͊̀n̢̈̿̅͛͡҉̢͎̜̱̙̠̳͇͈̣̜͠'̶̷̧̛̘̖͚̗̗̼̥ͮ̇̊̇̔̑ͫ͊ͭͪt̸̐̄̈́͑ͣ̈́̾͛̾ͪ̑͆ͥ̍͌͆̃ͭ́́҉̵̺̭̞̲̬̀ ̡̤̬̺̲̙̥̥̮̠̤̼̘ͪͣ̑̌̄͑ͬ͐ͤ͜l̶̵̪̦̯͈̪̣̙̙̟͎̹̎͑ͩͭ̇̅̌e̸͇̥̗͒̏ͫ͂̍̈́̏ͪ̿ͬͬͬ͞t͆̽̅ͥͭ̄̒͆͗ͯ͆ͣ̆̅̓͟҉͏͚͔͍͟͞ ̵̧͉͉̥̳̘̠͚̦̜̞̜̅͐͛ͤ͌͐̽ͭͅḩ̞͇͙͎͖̠̦͕̂͛͆ͣ̂͂̒̋̿ͪ͟ȉ̶ͤ̅̀̓̄͑̎̈́̍ͪ͜҉̼̘̱̲̰͎͇̤̖͙̫͈̥͠m̵̼̖͈̻͔̠̱̲̜̪͎͈̼̖̗̝͎ͯͤ̚̕ ̴̟̖͔͍̹̾̑́̀͛͒͊ͤͧ͑ͨ̓̓ͯ͑̎͑̎͘͘͝t͖͖̟͓̠̺̩̮͉͈̘̣̩̺̓̇̏ͨ͆ͭ͑̽͌̒̀̚̚͜͢a̷̵̡̲͚̖̙͈̻̝̝̥̗͙͎ͣ̿ͫ̆̂͐ͅk̼͇͕̟̗̝͓̰͕̙̜̖̜̰̬̂̎͐̑̏̆̑͗͆̇̑͑͌̓͌̏̆ͮ͘͞ȩ̨̻̫͇̠̦̝̜̺͎̥͙ͧ́̏̾ͣ̚̚ ̵̧̲̪̙͖͚̠̙͙̫͈̿̉ͧ̅ͨ̅͆̓ͥͥ͋ͦ͐̓ͮͯͮ̚͞͠͝ͅyͦ͗ͫ͊̾̈̈̋ͪͫ̓̄͆͆ͯ͏̲͉̦̮̤͖̘̤̣͙́͠o̧̭̥͙͈̩̮̗͚̿͗̊͊̉̂ͩ̈ͮ̃̕ṵ͎̪̯̜͈̪̜̣͉̳͔̼͖͙̥̫̋ͭ͛ͧͣ͛ͫͪ͆̚͟͟ͅř͆͊ͥ̆̽͌͂ͫͫ̍ͩ̊̃ͪͦ͟҉̢͓͚̻̣͕̖̙͎̞̬̼̮̣̀ͅͅ ͭ͐ͦ͒̇̍ͧͣ̋͏̶̢̛̲̼̹̭s̑͒̊ͣ͗̽͐ͮ̂ͩͧͭ̄ͫ͋͗ͩ͞͏̧̘̝̦̰̙̫͉̺͖̹͟͠ͅo̶͇̲̖̘̟̞̜̹̠̭̲̣̬͊̀͗̎̄͐̾͂ͧ̉̋͗̂͗ͮ͒̚͞ͅú̴͎̰̞̯͈͙̼̝̼͙̲̥̦̟͓̝̥̙̍̈̓ͫ̎̃̀ĺ̴͔̱͈͚̟̩͈̤̅̎̄ͯ͋͋ͯ̍͊ͮ̂̋͒̊͜  ",
            "review_score": "1"
        },
        {
            "review_text": "Best game totaly worh 5 Eu just try it #NoRegets ",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the name “Pony Island” scare you away. If you can shelve your pride at playing a game named like so, you'll be treated to a 2-3 hour game with some charm, striking (retro) visual vibe, and brilliant and sometimes laugh out loud moments. I certainly enjoyed my trip through this game as it flirts between action and puzzles and would recommend it to anyone. Do try to avoid overly spoiling yourself as there is some joy to be had from some of the surprises this game will throw at you.",
            "review_score": "1"
        },
        {
            "review_text": "I dont know what's real anymore. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You should go into this game blind, no spoiling it whatsoever. It's really, really worth it is all I'm going to say.",
            "review_score": "1"
        },
        {
            "review_text": "Short game, but really fun! Seriously worth a try. 10/10 would deal with the devil again. Kinda unnerving, but in a good way.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game that you should play blind (as in not knowing anything about it, not poking your eyes out before you play it)  To say too much would spoil what makes the game great, but it's well worth the asking price, and if you can get it on sale then just do it, no need to think about it, and prepare yourself for a dark, sinister ride...",
            "review_score": "1"
        },
        {
            "review_text": "Be careful with LSD",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you have a few free hours.",
            "review_score": "1"
        },
        {
            "review_text": "Strange strangeness that ever stranged.",
            "review_score": "1"
        },
        {
            "review_text": "This game sounded like a joke, but then I lost track of time as I solved its puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "for 5 bucks ive never been happier with a games story.  9/10 would give myself dementia and play again",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Uninstalling",
            "review_score": "1"
        },
        {
            "review_text": "i don't even know just play this game  don't read about it don't watch a let's play don't even think about it just play it",
            "review_score": "1"
        },
        {
            "review_text": "A strange and quirky game that uses satanic symbolism with very basic code puzzles, releasing virtual satan has never been so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is the coolest, freshest game I've played in a long time. No fluff here- every minute is a joy. The less you know about it, the better. Trust me and give this a look.",
            "review_score": "1"
        },
        {
            "review_text": "So funny, I loved playing this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a bad drug trip, but its really cool at the same time. It take something inosent and puts it on its head. But the way its done is amazing. If your bored and have some cash to spare, I fully recomend you getting this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is cool. Play it. Also, obvious choice for the 'game within a game' award.",
            "review_score": "1"
        },
        {
            "review_text": "A new take on a an old concept, the gameplay itself isn't very interesting but the story surrounding itself is atmospheric and thoughtful.",
            "review_score": "1"
        },
        {
            "review_text": "This is absolutely brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 amazing game would sell my soul satan &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Serious Review: The gameplay is a little repetitive, but overall the game's actual story makes up for that, and maybe even justifies it in a weird way.  7/10  Actual Review: If you want to play a game that plays you just as much as you play it, this is the game for you. It's like if Omega Flowey decided to make a game.",
            "review_score": "1"
        },
        {
            "review_text": "It's easy to be turned off by the name, but this is truly one of the most innovative games I've played in a while. The premise is that you're trapped playing a game made by Satan called Pony Island, and he desperately wants your soul. The only way to escape this is to follow the directions of another who are in a similar situation. The novelty comes from the unique puzzles and situations that occur over the course of the game, combined with some clever meta humor that leaves you wondering what's real and what's not.  It's not a long game, roughly two hours which is fine for a US$5 assuming that's you're kind of schtick. It's a short, enjoyable experience that doesn't wear out its welcome and is engaging enough to keep you thinking about it after the fact. It's real good!",
            "review_score": "1"
        },
        {
            "review_text": "Bounces between hacking puzzles, pony platforming and various other weirdness as you search for tickets and the truth. Strange, funny and clever.  As a terrible programmer, I empathized with Satan.",
            "review_score": "1"
        },
        {
            "review_text": "Should be priced at $6.66",
            "review_score": "1"
        },
        {
            "review_text": "My friend bought this for me, so i went in totally unaware of what it was. no pictures no videos. hands down one of the best games ive every played. Really well thought out, i will play it again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good, I uninstalled it ;)",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island was quite the adventure. Enough to have me finish it in one sitting.  -No Game Spoilers-  The game was solid and well made. Many kudos to the team behind it. There were no bugs at all. It had a well made story that kept me enthralled.   So if you are looking for a game to kill a couple hours and has some replayability, I highly suggest Pony Island. Plus its only 5 dollars. What could go wrong?",
            "review_score": "1"
        },
        {
            "review_text": "That damn pony is a boss.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game to spend a few hours on, definitely worth the $5.",
            "review_score": "1"
        },
        {
            "review_text": "I don't want to go into any details, because the experience of the game is best if you know as little as possible, so instead I'll just say that if you believe that the trailer looked good and even at all interesting, go for it. The trailer honestly does this game an injustice because it has to be really careful about what it's willing to show without ruining the experience, so if you think the trailer look like it might be a cool game to try, you might as well try it considering the low price and how good the game really is, ESPECIALLY if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful. Run at the speed of 1000 ponies and kill jesuis.",
            "review_score": "1"
        },
        {
            "review_text": "I have a lot of steam games. Most of them are rated in terms of how much I regret spending that money now. This joins a small group of games that I would pay for again if need be to keep them in my library. At the price this is going for, just buy it. Very entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "Most of all this game is interesting. Don't let people fool you: This is not and Undertale clone nor does it try to be. Its a puzzle and an Auto-runner in a very appealing package with a good dose of meta-ideas thrown in.  That being said, it does end up a little on the short side, but there is a collection feature and a bit of world building that is very interesting to dig for and should add at least two more hours if you don't use a walkthrough. So, if you want to play a game about playing a game about ponies that lets you hack the options menu then try it out. I liked how it went and played out.",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island really is an exceptional game. I can truly say that I have never played anything quite like it before. Essentially, you are trapped in a game that was created by teh devil and have to hack your way out.  However, unlike most hacking games, the hacking in Pony Island is really more of the puzzle variety, so a knowledge of coding is not necessary. To be honest, I have been getting a bit sick of the multitude of games using 8-bit graphics and sound, but Pony Island does it really well. The game is challenging, but not so hard that it will make you ragequit, which is something I found made the game progress alot smoother and allowed me to complete it without hoving one of those moments where you put a game down for a month because you cannot get past a certain part. The game is quite short. I think 2-3 max, but personally, I would reccommend it for it's originality, it's excellent retro sound and graphics and also for it's great story, which is a very original and quirky take on the whole deus ex machina thing. I honestly can't think of anything bad to say about this game, given what it is. For just one person working with Unity, I think it's a gem. In short, buy this if you want to play a game quite unlike anything you have played before and if you enjoy being surpised by games screwing with your concept of reality.. =)",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about ponies,cute little pink ponies.",
            "review_score": "1"
        },
        {
            "review_text": "0.5/10 Game is not about ponies.",
            "review_score": "1"
        },
        {
            "review_text": "Don't read any reviews. Don't look up anything about the game. Just buy it and play through the whole thing in one sitting. (about an hour and a half to two hours). You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to see through the blood pouring out of my eyes but from what I can tell everything is fine and everyone is happy.",
            "review_score": "1"
        },
        {
            "review_text": "Such ♥♥♥♥♥♥♥t my 100+ power pony laser can't one shot demons... WTF! Game needs balancing pass for sure.",
            "review_score": "1"
        },
        {
            "review_text": "This game is totally worth the money, this game messed with my head plenty of times.",
            "review_score": "1"
        },
        {
            "review_text": "I kind of regret playing this while having a mild headache since it only made it worst so jsut don't play it when you're not feeling good, other than that the game is just awesome, It's better to go 100% blind on the game since you feel a real experience of the story and the puzzles",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game. It's short, but it'a absolutly worth the $5. I don't want to say too much because this is one of those games that is best when going into it knowing as little as possible",
            "review_score": "1"
        },
        {
            "review_text": "Stop reading anything about this and just play it. It takes 2 and a half-ish hours and it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "0.5/10 Game is not about ponies.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this up during the sale in a spontaneous click-fest, this game is not at all what I expected which is part of the appeal of the game, haven't finished it yet but I'm hooked!  Main points of appeal:  - Retro Graphics - Amazing Soundtrack - Plot Twists - Suttle Humour - Perfect balance of difficulty in puzzles / levels.  I would recommend this game as one that you could pick up and play from start to finish",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island is a very weird game, but definitely was fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "Great game briilliant fun bought the game not expecting much but was really surprised 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Like the last time I got laid..              Over quick and worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Is it over?...I'll never be sure.  10/10 - Best $5 game on steam, hands down.",
            "review_score": "1"
        },
        {
            "review_text": "That damn pony is a boss.",
            "review_score": "1"
        },
        {
            "review_text": "This game...is very inventive, dark and funny. If you feel like taking a chance on something a bit different, do yourself a favour - don't read anything about it and just play.",
            "review_score": "1"
        },
        {
            "review_text": "Quite interesting. I think that if you liked Little Inferno, you'll probably like this. Felt like a similar vibe to me!",
            "review_score": "1"
        },
        {
            "review_text": "Such an entertaining game. 10/10 recommend",
            "review_score": "1"
        },
        {
            "review_text": "You get to play as a pony with lasers. 01100001 01110111 01100101 01110011 01101111 01101101 01100101 / 01101101 01101111 01101111",
            "review_score": "1"
        },
        {
            "review_text": "with a kickass chiptune soundtrack, very intriguing story, some cheeky jabs at the meta, and aesthetically amazing visuals, this is definitely worth the five dollars it asks for and then some.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game but I have no idea how to put my soul into pony island",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful. Run at the speed of 1000 ponies and kill jesuis.",
            "review_score": "1"
        },
        {
            "review_text": "what?",
            "review_score": "1"
        },
        {
            "review_text": "Ive spent hundreds on games I love yet this only costed me 5 dollars, This is legitimately one of my favorites now, i just finished it after buying it. Amazing work Mate!",
            "review_score": "1"
        },
        {
            "review_text": "I can say after 1 hour of gameplay that this game is freaking amazing.",
            "review_score": "1"
        },
        {
            "review_text": "It's a short game, but some of the concepts it plays with are absolutely brilliant.   It's only $5, and it'll serve you better than that McDonalds meal, you pig. Play this game instead of eating. There may or may not be additional costs once you've purchased the game *coughyoursoulcough* but I assure you it's all worth it.  It's all been worth it. I miss my parents.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Game, great controls and story telling but left me with more questions than awnsers. I am looking forward for the future of this franchise.",
            "review_score": "1"
        },
        {
            "review_text": "If you were a fan of undertale, this game will make you fall in love! The concept is simple: nothing works how you expect it to space bar as a shooter and left click to jump i am still mind boggled I'm only on my first play through and just got it today but i will be sure to play against and see all the options  creative and unexpected.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! Check it out! I promise you will not regret it if you're into puzzles and what not.",
            "review_score": "1"
        },
        {
            "review_text": "Not only does this game break the 4th wall MULTIPLE times, but it literally defines the phases 'dont judge a book by its cover'.",
            "review_score": "1"
        },
        {
            "review_text": "We all know the limbo had ponies, jesus and satan waiting for us. But no one said we would be fooled-- I'm finally cleansed now.  It's short, so come along and take a trip through the limbo.  Because hey, we're dead.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of my fav games i love the play style and the art and the plot so stop reading and get it",
            "review_score": "1"
        },
        {
            "review_text": "I can't say ANYTHING about Pony Island without ruining your experience, but I'm surely gonna try.  This game has puzzles (the 'directional' sort of puzzle, none of those horrid 15 tiles square puzzles), pseudo-platforming sections, and it's stuffed with clever secrets and tricks.  Buy Pony Island already. I mean, what could possibly go wrong with a game called 'Pony Island' right?",
            "review_score": "1"
        },
        {
            "review_text": "Great meta game experience. Anyone looking for a interesting puzzler and mild action game by this now.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderfully creative, fun experience that defies standard categorization. One of those games that, to expound on its content beyond the given summary is to spoil the experience. This is not, for the record, something akin to the Stanley Parable or the Beginner's Guide, though it will likely appeal to fans thereof. There are multiple genres of gameplay present, including various types of puzzles and shooters. But even if you're not just huge into either of those, this is a package that, in my opinion, amounts to well more than the sum of its parts. The experience is well worth it. Just check it out.",
            "review_score": "1"
        },
        {
            "review_text": "A fourth-wall budging game about ponies trapped on an island in a bad video game. It meshes an adventure game with a free running game while pushing on the fourth wall so far it comes dangerously close to pretention.  The gameplay is nothing complicated, the free running is simple with few obstacles to keep you from progressing. The adventure is where things get interesting, here you 'reprogram' the game with a set of logic puzzles and make decisions about how you may progress. Taken together it creates a surreal environment which paints a disturbing picture of who and what the protagonist is and what is actually happening.  As to where you are and what Pony Island is, I won't delve too far into details for risk of spoiling the experience. It is a carefully tailored experience to lead you to the proper conclusions and make you want to dig around in the game for more information.  Unfortunately, the game digs into insufferable pretention enough to make every hipster on the West Coast of the US roll their eyes until they go blind (a net positive outcome). The antagonist is an obvious author insert who spends most of the game telling you how much smarter than you he is and how you couldn't possibly develop a game like this, perhaps even lacking the intellectual capacity to enjoy it.  While there are annoying problems with the game's attitude, they are far outmatched by the quality and enjoyability of the experience, making this well worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Short game but very fresh and original. worth it for the price",
            "review_score": "1"
        },
        {
            "review_text": "This game is Undertale levels of good, I only wish it were longer!",
            "review_score": "1"
        },
        {
            "review_text": "the game has a really good atmasphere and good story.",
            "review_score": "1"
        },
        {
            "review_text": "2good4me, 3D glasses reccomended (for those who have two eyes)",
            "review_score": "1"
        },
        {
            "review_text": "666/10, would sell my soul to the dark lord Lucifer to play a pony game again",
            "review_score": "1"
        },
        {
            "review_text": "A simple yet interesting experience that dosn't take longer than it needs to and keeps up its unique humor the whole time",
            "review_score": "1"
        },
        {
            "review_text": "All I have to say is... damn. This game was an absolute adventure. The soundtrack is fantastic (and I've been listening to it nonstop ever since I completed the game!) The mood of the game was great, I love glitchy corrupted arcade stuff so this was right up my alley. There were awesome fourth-wall-breaking moments that seriously tricked me, and the puzzles were just the right level of difficulty.  Pony Island is an awesome and unforgettable experience. If you're prepared to be challenged, frustrated, messed with, confused, and maybe even afraid, this game is for you. No jumpscares, the game gets you psychologically.  Also, the ponies are cute.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awsome,immersive, surprising! It is a experience, an amazing, somewhat frightening, experience. And it's short! So everyone should play it, be it a hardcore gamer or some businessmen in a suit with just a little bit of spare time on the weekend.  If you are alive, play it!",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game through a few times and I can say without a doubt:  It's pretty good.  All jokes aside, this is a fantastic experience with an interesting plot that is very mysterious, and a dark underlying tone that you piece together as you play the game. Despite all this though, the game is a bit short for my liking but I guess the $5 price point more than makes up for that.  The secrets and tickets are also fun to look for and hard to find, providing a nice bit of replayability for ful completion.   Overall a beautiful hidden gem that is definitely worth your money.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good puzzle/action game",
            "review_score": "1"
        },
        {
            "review_text": "its a fun game i rate it 9.5/10  i like the game's style, its something original and i never seen a game like that.  would play again.",
            "review_score": "1"
        },
        {
            "review_text": "pony island is quite a game, wont spoil anything but damn.  takes about 2.5 hours to finish. took me about 5-6 hours to get all the acheivements and tickets. (including the 2.5 to finish) the graphics are great, its funny, its sad but most of all its fun! 10/10 would definitely spend 40 mins looking for the last ticket again!",
            "review_score": "1"
        },
        {
            "review_text": "Well, I think I beat it. I finished the game, and found all the tickets (albeit with a lot of assistance), played through the secret ending, but didn't get the secret secret... that's the only problem with meta games; you're never sure when they're done. That being said, this is quite the trip. This game seems simple, but then it goes in very... unique directions. There are puzzles, action sequences, conversations and secrets on secrets on secrets. It's fascinating, funny, frustrating, and a trip and a half. Go in knowing as little about it as possible. And then enjoy the ride.",
            "review_score": "1"
        },
        {
            "review_text": "Pony Island, to me, is a game that utterly exemplifies what the medium of gaming can be at its peak. People can go on and on about games being art or whatever, and that's a discussion for a completely other day. But to call Pony Island anything less than a work of art would frankly be insulting to the game.   Everyone knows by this point that the game isn't a cutesy little flash game. Yes, it's about Satan messing with you in a 90s computer game, with some angelic force helping you get out of your predicament along the way. In esscence, it's a basic setup that paves the way for a metafictional look at gaming.   Now, some may cry that as becoming too cliched, or tacky, or hamfisted at this point. 'Don't we have enough Spec Ops: The Lines or The Stanley Parables? Can't we just have a fun dang video game?' you may ask. To which I respond, this game is actually very fun. Challenging? Absolutely. But it's also very fun. I'm not gonna come out with the 'oh, it's the Dark Souls of this type of genre,' partly because I've never played a Soulsbourne game, and partly because that's a tired phrase anyway.   Basicaly, Pony Island is a very fun game. It's a good game on its own, and it's also a very good slice of metafictional narriative. I'd recommend it wholeheartedly. Just don't buy it for your kids, in all seriousness. If you've been fooled into doing so, then I am sorry for you on your behalf.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like puzzle games? Do you like getting ♥♥♥♥ed with to the max? Do you like not being able to trust anything (including Steam)? Do you enjoy cheating at a game like the WEAK MORTAL YOU ARE?  Then this is the game for you  10/10 ♥♥♥♥ you Steam, I can't trust you anymore.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Different take on puzzles that are fun and challenging and the narrative is excellent. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It might be a short game, but it is soo worth the money. Hard to even compare it to anything else, it is something that has to be experienced.",
            "review_score": "1"
        },
        {
            "review_text": "This game is seriously awesome. It makes your brain feel super human especially on a long night when you're. Brain dead.",
            "review_score": "1"
        },
        {
            "review_text": "Freaking Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "Usually when a game gets released during Q1 of the new year, there aren't high hopes for it succeeding due to the intense Q4 of the previous year with massive triple A titles coming out the cut and wanting all the attention. However, for Pony Island, this caught my attention after watching the Yogscast do a short episode about it. I was intrigued that some guy decided to make a game titled Pony Island.  But here's where I went wrong...  Pony Island isn't some happy go-lucky game where you control some person riding a pony and frolicking in the wilderness. It's a game where you know that the decisions you make impact you as the player and the character you are mimicking. When it comes to indie games, they love using dark themes because it provides that depth most games don't have. In Pony Island, there is no such thing as a linear story. There is reason behind each statement and it's a psychological thriller. Yes, clicking and shooting lazers is all fun and games, but when you are trying to secure your own freedom from the grasp of a devil like creature (Satan, in this case), you will do anything in your power to be freed from the oppression.  This is why I'm giving this game a definite 9.5/10. The story, art style, and music mesh really well together and gave me a positive experience despite the fact that some parts are really repetitive. I hope you guys enjoy the game as much as I did because man, this is one of the best games I've played so far that came out this year.  FULL RATING: Story: 9.8/10 Gameplay: 9.4/10 Music: 9.5/10 Art: 9.2/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice game about ponies.  Calm, Beautiful, and absolutly no mention of Deamon (That's actually what they are called), The Devil, 666, errors, or anything terrifying  10/10 would play with 5 year olds again",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! a puzzle game with a real twist. Simple, smart and funny. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm a brony and what is this?",
            "review_score": "1"
        },
        {
            "review_text": "Very funny (sometimes a little difficult). One of the games, which can be called art. Don't expect a graphic overflow, that's not the story of the game. I like games which brake the 4th wall.",
            "review_score": "1"
        },
        {
            "review_text": "Someone tell Satan i like his game.  He seemed butthurt that no one said they liked his game.",
            "review_score": "1"
        },
        {
            "review_text": "Best indie Game Ever IMO, I feel A bit R@p€d after this game, but i liked it. ",
            "review_score": "1"
        },
        {
            "review_text": "My mom always told me I would let the devil into my life if I kept looking at all that pony porn and well here we are.",
            "review_score": "1"
        },
        {
            "review_text": "It has a really neat story, and if you like puzzles and any kind of meta gaming youll enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "7/7 really great game",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice game about ponies.  Calm, Beautiful, and absolutly no mention of Deamon (That's actually what they are called), The Devil, 666, errors, or anything terrifying  10/10 would play with 5 year olds again",
            "review_score": "1"
        },
        {
            "review_text": "Best game totaly worh 5 Eu just try it #NoRegets ",
            "review_score": "1"
        },
        {
            "review_text": "Mind ♥♥♥♥ing all around",
            "review_score": "1"
        },
        {
            "review_text": "Me: &lt;UNINSTALLED&gt; Hopeless Soul: Thx m9",
            "review_score": "1"
        },
        {
            "review_text": "Delightfully mad. I love it. It keeps things moving and changing so it doesn't get dull. Though it's unfortunate they let you know so much from the store page, I understand if it was really described as a game about jumping fences as a pony they probably wouldn't have seen many sales.",
            "review_score": "1"
        },
        {
            "review_text": "Craziest game ever. Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "Do yourself a favor and don't read about this game upfront. Just trust the review score and jump into it. It's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet 3-hour long puzzle game. Don't get into Pony Island expecting to be mind-blown, but rather mildly impressed by what it has to offer.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ed up in so manys ways lvls are weird.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and memorable little game.  Sometimes the puzzles suddenly go from simple to stupidly difficult at times.  If you see it on a sale, it's worth picking up!",
            "review_score": "1"
        },
        {
            "review_text": "This game had a lot going for it. Unlike Calendula, Pony island understands exactly what it wants to be; what it needs to be. The real fascinating part about this game is honestly discovering how expertly the game screws with you, especially near the end.   as for how satisfied with it I am? well...   It's the best game I'll ever promise to keep off my hard drive. ",
            "review_score": "1"
        },
        {
            "review_text": "It's amazing. I don't know how else to sell a game that it's best not to anything about before you start. It's a bargain even at full price.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a pony game, it´s a puzzle game... I can´t really say more without ruining the whole experience. Dont look at trailers or read the description, just buy it... You wont be dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "Indeed not a game about pony's. It's not really a genre-breakdown either but it is just as horrifying as you would think! defenitly a good buy!",
            "review_score": "1"
        },
        {
            "review_text": "There are two parts to this game and, sadly, the 'game' part can drag a little bit. However, the central conceit and some of the puzzles are fantastic and more than worth the small amount of frustration.",
            "review_score": "1"
        },
        {
            "review_text": "The less you know about this game, the better it is playing it.",
            "review_score": "1"
        },
        {
            "review_text": "please uninstall right after completion",
            "review_score": "1"
        },
        {
            "review_text": "Good versus evil. Entertaining puzzles and many clever mind tricks. Lots of secrets and a hidden meta-story. The third boss totally threw me off guard, and it was wonderful. This game was well worth the cost and time.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this the day it released and didn't play it until now. This game is fascinating, hilarious, and completely surprised me. Don't spoil it for yourself - give it a shot, and be the best pony you can be.",
            "review_score": "1"
        },
        {
            "review_text": "Ur a pony Jump over sh*t Shoot sh*t Hack sh*t This sh*t was made by Satan He wants ur soul Not even kidding If ur still not interested then don't even think about playing this   ",
            "review_score": "1"
        },
        {
            "review_text": "I know what you're thinking. 'Ew, what is this crap, you play with ponies on an island?' No, it's not that, don't worry. The title in kinda weird, but the game is about a mini game called 'pony island', a game developed by the devil. And you have to hack your way out thanks to other minigames against demons and stuff like that. It's cool i guess. The only bad fact is the game length, but if you find it on sale you better get it",
            "review_score": "1"
        },
        {
            "review_text": "It's really good. I love the way it predicts your moves and makes you feel like it is real. I dont want to spoil it but it ♥♥♥♥s with ur head XD  9/10 Really cool",
            "review_score": "1"
        },
        {
            "review_text": "This fit my need for a nice farm island simulator. There aren't too many out there, and this is a great one.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would become satanist brony again",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Just play it and be amazed.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good kid game, fun for all ages.   6.9/10 educational",
            "review_score": "1"
        },
        {
            "review_text": "Great game for 5$ -- highly recommend playing, it can sometimes be tricky but the overall theme of the game is great",
            "review_score": "1"
        },
        {
            "review_text": "I dont know what's real anymore. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "worst pony game ever",
            "review_score": "1"
        },
        {
            "review_text": "Game is so good, I even called my ex-wife to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Game. Gain amazing muscles for the easy once of payment of your soul. Jump over fences, shoot butterflies, become the premiere alpha. Just don't kill Jesus.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute hilarious winner xD definitly worth being played !",
            "review_score": "1"
        },
        {
            "review_text": "You can beat it in just a few hours, but Pony Island is well worth getting for how well done it all is. The short playtime is packed full of clever and amusing little moments, a couple of which managed to catch me off guard towards the end.  Just try to go in knowing as little as possible about it, you'll have a lot more fun that way.",
            "review_score": "1"
        },
        {
            "review_text": "YOU'VE UNLOCKED JESUS",
            "review_score": "1"
        },
        {
            "review_text": "Went to the main menu to adjust my settings, mom walked in on me saying 'Why are you playing a girly game?'  Had to explain this wasn't a girl's game.   10/10 would embarass myself and say it's a satanic ritual.",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up on a whim and did not regret it at all. I dont want to spoil it, but this game is so engaging and such a cool concept. Difficult even at times. Ive only played through once, but there is a replay value in order to learn more of the story. You can play in one sitting, so it is a bit short, but there are so many cool concepts in it that it makes up for the length. I'd give it 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little indie game with lots of puzzles, different little gameplays to keep things interesting and the story engaging. The last demon was extremely enjoyable and justified the entire purchase of the game for the laughs.  For the $1.64 i spent for the steam sale, I am absolutely satisfied for the 2 hours of entertainment I got.",
            "review_score": "1"
        },
        {
            "review_text": "this game will ♥♥♥♥ with your head in ways you can't imagine. truly incredible.",
            "review_score": "1"
        },
        {
            "review_text": "  8/8",
            "review_score": "1"
        },
        {
            "review_text": "Complete the game, get an ending. Collect all tickets, get another, secret ending, In that secret ending, find a secret. Then, using another secret found within said secret, solve a mystery hinted several times before.  11/9 Would pony again. (also, awarded)",
            "review_score": "1"
        },
        {
            "review_text": "Everything about it is great, especially the music.",
            "review_score": "1"
        },
        {
            "review_text": "Best £4 I've ever spent. A game so good you'll never want to uninstall it!",
            "review_score": "1"
        },
        {
            "review_text": "honestly the best indie (kinda horror-ish?) game I've played.",
            "review_score": "1"
        },
        {
            "review_text": "It's a short game (3 hrs to beat, 4 hrs to do 100%). Not good graphic, though good astetic. Some puzzles, not really hard, but satisfying to solve. Really nice soundtrack and cool story.  Just remember to delete the game, when you finished!",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the most intriguing, most attention grabbing, most evil puzzle game I've played in years.   It's smartly presented, smartly written, and constantly keeping you on your toes. Love it.  Stay as spoiler free as you can &amp; just enjoy the pony ride!",
            "review_score": "1"
        },
        {
            "review_text": "Eerily and uncomfortably hilarious. Don't read about it. Just play it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "This game has some cool ideas, but it's edgy 4th wall breaking isn't as novel as it used to be. The puzzles and action are solid, though can occasionally get just a bit repetitive before you move on to something else. The story twist is a big yawn. Solid B/B- indie game. Worth the buy if on sale.",
            "review_score": "1"
        },
        {
            "review_text": "whoabro",
            "review_score": "1"
        },
        {
            "review_text": "I sold my soul to become a pony that pukes laser beams of binary to kill demons. Great fun.",
            "review_score": "1"
        },
        {
            "review_text": "Only 2 hours long. Unistalled it right after finishing it, and I don't intent to re-install it ever. This is the best pony game I have played this year!  PS: Appologies to Zant for the vile words.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and awesome game. Just the right amount of crazy mixed in with some good puzzles and side scrolling action. I wasn't sure what to expect when I first saw it, but I just had to try it. It's a rather short game but I think it has some replayability, there are collectables to find and various endings to see. Overall I was not disappointed with my purchase and would recommend this game to anyone looking to try something absurd. Plus it has ponies with lasers, how can you go wrong with that?",
            "review_score": "1"
        },
        {
            "review_text": "very cute game 100% recommend",
            "review_score": "1"
        },
        {
            "review_text": "Get it, It's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "It's weird, it's strange ... i still don't know what i played...",
            "review_score": "1"
        },
        {
            "review_text": "What is it?",
            "review_score": "1"
        },
        {
            "review_text": "Cool game took a bit to get into it.",
            "review_score": "1"
        },
        {
            "review_text": "Hacked by El Sombra",
            "review_score": "1"
        },
        {
            "review_text": "I have nothing to say... I am literly spechless, how can a game be this short, this cheap and still affect you that much... The only thing i have to say is buy this game and do not think twice..... 10/10 would uninstall ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful. I don't want to spoil it, so I'm just going to write a little bit.  Soundtrack: The music and effects are a large contributer to the game's appeal, but not worth paying to own separately, in my opinion. Play this game with the sound on.  Horror: It says this is a horror game, but don't expect to actually be scared by it. It's a horror game in the creepy, make-you-think kind of way. If you're looking at this game because you want to be terrified, this isn't the game you want.  Overall experience: This isn't a difficult platformer or a difficult puzzle game or a terrifying horror game, but it isn't trying to be any of those things. This game is an experience and a story - think walking simulator-ish story guiding with a witty charm, grade-A satire, and some puzzle and sidescrolling jump-and-shoot levels.",
            "review_score": "1"
        },
        {
            "review_text": "Quite interesting. I need to play it more to uncover more secrets.",
            "review_score": "1"
        },
        {
            "review_text": "What is it?",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about Ponies.  This game will mess you up. Why do you not have this game.",
            "review_score": "1"
        },
        {
            "review_text": "Suffice to say, the game I got was far, far different from what I was expecting, even given the obvious. Look for some tight jump-and-shoot segments, some puzzle solving, and just all around a wonderfully crafted experience. Would reccomend, don't pass this one up!",
            "review_score": "1"
        },
        {
            "review_text": "deleted after playing once 11/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "This game messed with me, like hard core i don't know WTF just happened kind of stuff. But i loved it, I loved every second of it.   10/10 buy it now ",
            "review_score": "1"
        },
        {
            "review_text": "This game will mess with you. 10/10 do recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game took a bit to get into it.",
            "review_score": "1"
        },
        {
            "review_text": "  Well that definately happened.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game if you are looking for something original. A must buy!",
            "review_score": "1"
        },
        {
            "review_text": "OBEY ME MORTAL!",
            "review_score": "1"
        },
        {
            "review_text": "This one of the best games I have played all year. 10/10 Just amazing.",
            "review_score": "1"
        },
        {
            "review_text": "After beating it.... Um. It's different. But different is good! A very trolly game, but well worth the purchase and play! Think Undertale but not so meta. Well I mean the game is hard, no lie. Like those games... I can't think of the name, that running and jump game! You know the one I'm talking about! Well this is with ponies.... or is it? Still, if you're on the fence give it a whirl! You won't go wrong with it!",
            "review_score": "1"
        },
        {
            "review_text": "Good mind screwing game. Quality over quantity, although 2 hours is a little dry. Oddly enough the actual pony part of the game was the worst part imo.   The support character gets really meta out of  nowhere  though; refrencing things like your hard drive and the plot of the game like he's dead pool.  I've dropped much more for much less all in all 7/10 (but because of the 2 hour run-time I'd grab it on sale)",
            "review_score": "1"
        },
        {
            "review_text": "Played through the game in one sitting. I had heard it was quite difficult but I didn't find it too bad so if you were concerned about this don't be.   It's a really interesting game and I enjoyed it. The concept is great and kept me engaged, though I did find the pony island game a bit tedious towards the end.  I picked this up for under £2 so can't complain at all, well worth it and I enjoyed the time I spent with it.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game",
            "review_score": "1"
        },
        {
            "review_text": "Excellently crafted game. Highly recommend going in blind as its the best experience. Super cheap game and very entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Fan-tas-tic game. The less you know the better, so just buy &amp; play it :-D",
            "review_score": "1"
        },
        {
            "review_text": "Fan-tas-tic game. The less you know the better, so just buy &amp; play it :-D",
            "review_score": "1"
        }
    ]
}