{
    "app_id": 405780,
    "name": "Alpha Polaris : A Horror Adventure Game",
    "release_date": "2015-10-21",
    "developer": [
        "Turmoil Games"
    ],
    "publisher": [
        "Turmoil Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 18,
    "positive_ratings": 124,
    "negative_ratings": 41,
    "price": 6.99,
    "description": "Alpha Polaris is an oldschool adventure game focusing on slow-burning character driven horror and environmental themes. It draws inspiration from such sources as Inuit legends and Cthulhu mythos.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/405780/header.jpg?t=1447378225",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 8.1, 10 Processor: Intel P4 or AMD Athlon 64 processor Memory: 1 GB RAM Graphics: Graphics card with DirectX 9 support DirectX: Version 9.0 Storage: 1000 MB available space Additional Notes: MINIMUM RESOLUTION 1280*768",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Alpha Polaris, is a interesting Point and click adventure with some horror elements set on the snowfields of Greenland.   Characters dialogue has voiceover which is nice. and even if its a game made on a old engine with only 1280x800 resolution it, looks ok.  Puzzles are fun and challenging. its Worth a buy if you want a good adventure game.          YouTube™ Video:  Alpha Polaris Gameplay - Part 1 - Walkthrough&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This is... not a bad game. I really like the character designs. The plot and even the puzzles strive to be realistic, although based on the premise I was hoping I'd get to do more sciencey stuff. Sadly the game is very short and despite the gore and scares I wouldn't call it a horror game because there's pretty much no tension in the storytelling. I'd still recommend it because it does have a certain charm and atmosphere to it - though perhaps not for the full price.",
            "review_score": "1"
        },
        {
            "review_text": "I could definitely recommend playing this adventure. Quite short (took me approximately 4 or 5 hours to finish) but very enjoyable. Story is catchy, interface is user friendly and most of puzzles are thought over and nice. Hope to see another piece from Turmoil Games in future.",
            "review_score": "1"
        },
        {
            "review_text": "A classic, fun point-and-clicker with an interesting story and somewhat challenging, logical puzzles over which to ruminate. Alpha Polaris is fun to play, and just long enough to be worth the admittedly modest price.",
            "review_score": "1"
        },
        {
            "review_text": "The story, setting, characters and music were very enjoyable. The animations don't look so great, but it doesn't take away from the great atmosphere. The puzzles were a bit different than usual at times. The only downside is that after building suspense for a while, the story starts to accelerate really fast and it's not long until the end after that, longer and more even build-up would have been better.",
            "review_score": "1"
        },
        {
            "review_text": "OK,  I've recommended this game based on the imaginary re-mastered version that solves all the clunky 'objects can't be used until their time is now' rule that truly frys this game. A great story poorly told until repairs are made.  Note to the genuinely innovative and amazing developers - Call me for a low-down on the mess. It wouldn't take a lot to make this game amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Just completed this game, as it was recommended to me numerous times and has so many positive reviews.  And it's horrible. You see, games like this one - they do not offer much in the gameplay department, so they have to have either a good story, good puzzles, or both. This one has neither. The puzzles are not hard - just tedious, and the story is a big mess of boring characters and failed attempts at horror.   Oh, and there is also an environmental message stuck in there somewhere, which sounds basically like 'Oh, you found oil? YOU ARE KILLING THIS PLANET!' Yup, the writing is THAT bad and pretentious. When an antogonist tries to lure you to the darkside by promising you will be able to 'save bears', and it's not even campy but tries to sound serious and dramatic... I mean how can you make somethig like that NOT sound funny? This game made me facepalm so hard I broke my nose and knocked out 3 of my teeth.",
            "review_score": "-1"
        },
        {
            "review_text": "A point and click adventure game that pays homage to 'The Thing', one of my favorite horror movies, I thought 'yes plz'.  However there is no hook for me in this game. The puzzles are logical and hard. I normally play this genre to veg out. I don't mind Indie games and this really is one. However its not polished. The voice acting is pretty good. The atmosphere is dull but it is the Arctic how exciting is that? I don't really care about any of the characters.  I just can't force myself to play this anymore.  ",
            "review_score": "-1"
        }
    ]
}