{
    "app_id": 406170,
    "name": "Vortex: The Gateway",
    "release_date": "2016-03-22",
    "developer": [
        "StormCube Games"
    ],
    "publisher": [
        "StormCube Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Captions available"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Survival",
        "Adventure",
        "Action"
    ],
    "achievements": 53,
    "positive_ratings": 204,
    "negative_ratings": 143,
    "price": 5.79,
    "description": "Vortex: The Gateway is an open world survival horror game with two game modes. If you want to survive then be alert, sneak, build and fight. Meanwhile life back on Earth changes dramatically. What changes? You will get bits of information through your adventure. Prepare for the worst!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/406170/header.jpg?t=1552397750",
    "minimum_requirements": "OS: 32-bit Windows 7 Processor: Core i5 / AMD FX 2.4Ghz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 560 / AMD Radeon HD 7790 DirectX: Version 11 Storage: 5 GB available space Additional Notes: Integrated graphics cards, such as Intel HD, are not supported.",
    "recommended_requirements": "OS: 64-bit Windows 8 Processor: Core i5 / AMD FX 2.4Ghz Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 760 / AMD Radeon HD 8990 DirectX: Version 11 Storage: 5 GB available space Additional Notes: Integrated graphics cards, such as Intel HD, are not supported.",
    "reviews": [
        {
            "review_text": "yes its a single player ...BUT i really like it !  Its interesting , nice graphics and easy to learn . The exploration is cool , and the endless possiblities ... Sorry those who diss it straight away as its a single player ....but i like it .",
            "review_score": "1"
        },
        {
            "review_text": "  i have been following the game since it got releasd and it has been getting better and better i love the game it still has lot to go and lot to be discoverd but stilll think it is my top fav game",
            "review_score": "1"
        },
        {
            "review_text": "First impression The forest meets the movie predators - seems interesting",
            "review_score": "1"
        },
        {
            "review_text": "This game has been in development for long enough for me to forget that I had it on my wishlist. Why does it still feel so incomplete? The character models need some serious work, and crafting is rather awkward.  It's like they took The Forest and cross-bred it with a cheap korean F2P MMO. I'm not a fan.  As of right now, it's not worth the half price. The visuals need to be replaced and it's not obvious where you get most of the materials.",
            "review_score": "-1"
        },
        {
            "review_text": "Vortex: The Gateway is a disappointing game in the open-world survival genre. It's light on content, buggy, and poorly optimized. It never ran above 30 frames per second, even with a GTX 970.   It's hard to see the point of most of the game's crafting features. Spears, made in seconds, kill most enemies in a few hits, I experienced one bug where all of the material needed to create buildings vanished from the game world.   There is a story mode, but it is undeveloped and does nothing to explore the cool concept. I was hoping for something like the game Miasmata, but instead, exploring and surviving are pretty trivial, and beating the story mode was a pretty anti-climactic fade to black.  You can safely skip this.",
            "review_score": "-1"
        },
        {
            "review_text": "To be honest this game isn't that bad. However the price is way too much. By judging the content and small difference between the two modes I would set the price at max 5 dollars.  Cant recomend it for the current price, but if its on sale for less than 5, be sure to check it out.",
            "review_score": "-1"
        }
    ]
}