{
    "app_id": 406550,
    "name": "Umineko When They Cry - Question Arcs",
    "release_date": "2016-07-08",
    "developer": [
        "07th Expansion"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Great Soundtrack",
        "Mystery",
        "Visual Novel"
    ],
    "achievements": 22,
    "positive_ratings": 322,
    "negative_ratings": 8,
    "price": 18.99,
    "description": "Umineko When They Cry is the 2nd series of Sound Novel released by 07th Expansion. The steam version features renewed character sprites which is swappable from the classic art.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/406550/header.jpg?t=1552080485",
    "minimum_requirements": "OS: Windows XP and up Processor: Pentium III 800 MHz Memory: 1 GB RAM Graphics: 1280 x 960 Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'Do you believe in magic, in a young girl's heart?'  No.  *****  Umineko no Naku Koro ni, 'When the Seagulls Cry,' is a Japanese visual (or 'Sound,' rather) novel written and illustrated by Ryukishi07, i.e. the Higurashi guy. If you don't like visual novels and think they're just clogging up Steam's new releases, this game probably won't do much to change your mind. If you've even a little patience for or interest in the medium, however, you're in store for something special.  Umineko is a murder mystery, one the reader is actually expected to solve, or rather is capable of solving should they put their mind to it. In this sense, it is much more a game than one might initially give it credit for. Many authors during the Golden Age of Detective Fiction considered their works to be 'Games,' long-form logic puzzles in prose form complete with rules and regulations governing what was and wasn't fair to expect from the average reader. Umineko takes this sentiment to heart, earnestly wearing its inspiration on its sleeves. The murder mystery provided in Umineko is not an easy one – and you’re not yet able to check your answers in the back with this release alone – but the experience of trying to crack it is still worthwhile. If possible, I'd recommend playing though it alongside a friend to compare notes and observations. I'd also advise keeping a notebook and pencil handy, but that's just me.  Even if you've no mind for mysteries, however, the core story and characters are still quite compelling. Some will find the game to be a slow starter, but hey: you bought a visual novel. Them's the breaks. There's a lot more to say here but I'll let the game keep some secrets.  Instead I'll comment on the music, the glue that holds Umineko together. As I mentioned at the start of this review, Umineko's more of a 'Sound' novel than it is a 'Visual' novel, and was even marketed as such in Japan. I'll not mince words: Umineko's OST is fantastic. The tracks themselves are excellent and memorable on their own merits, but when paired up with the game they really elevate the experience. Umineko's writing is fairly on-point in terms of telling the story it wants to tell, but the exact wording and phrasing of things is sometimes a little clunky. It is then the music which compensates, adjusting the tone and shaping the reader's mood. It is absolutely my favorite video game soundtrack, and anyone who turns it off or down or replaces it or tries to play with broken speakers is doing themselves a huge disservice.  On the artsy end of things, this release comes packed with Ryukishi07's own original art alongside some updated character portraits stripped from a pachinko machine. The new art is uneven and not nearly as good as the PS3 release's - there'll probably be a fan patch for that at some point. The old art is, putting it politely, 'Crude,' but full of personality and its own homespun charm. It's certainly how I'll be replaying the game.  Finally, it should probably be be noted that this is only the first half of Umineko, but it still constitutes a full-bodied game well worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "What is Umineko?  Umineko is difficult but incredibly rewarding. Umineko is a puzzle and a test. Umineko is the most game-like game I've ever played, all while having absolutely no interactive elements. It's sort of like a novel. It challenges you to think and imagine and test possibilities and theorise and realise that you were so, so wrong and that the answer was much more devious than you ever thought possible.  It takes you on a ride that is unlike anything else, and it's absolutely worth it.  There is some advice I feel like I should give in advance, though.  Don't be afraid to take the series slowly. Episode 4 is an absolute slog - it's the longest episode in the series by a fair way, and it's a tough read, so it's smart to have a bit of a break before reading it. Generally just allow yourself breathing room and time to think. The fun exists in between the happenings onscreen, the thinking that happens when you're away from your computer and can't stop thinking about it.  Absolutely give this series a go. The Question Arc contains episodes 1-4, and the second release will contain episodes 5-8. This will give you hours upon hours of entertainment, and is absolutely worth a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let these trailers submitted by MangaGamer fool you. Umineko is a great mystery novel with a clear inspiration from Agatha Christie's book 'And Then There Were None', but it also has it's very own touch of uniqueness. In fact, aside from this fact, I don't think there are many stories, if any, in any kind of medium, that resemble Umineko. But feel free to prove me wrong.  The story revolves around a rich family meeting taking place at the island of Rokkenjima, in a mansion built specifically for them. During this meeting, strange events begin to occur. There's an epitaph which speaks of the resurrection of the golden witch Beatrice, who has a deep connection to the island and the mansion. This epitaph predicts a series of sacrifices to be made in order to complete the rite. As you may expect, things begin to happen following these lines. Members of the family are killed and each case is a closed-room mystery apparently unachievable by any human means.   Were the perpretrators of these murders human? Or is there a supernatural force at work here? Are witches real? Many of the arguments to break the closed-rooms will involve these questions and you will probably feel lost at times. But this is where, in my opinion, Umineko shines most. You will find that there's a whole lot of metafiction involved in this story. Mystery (human-side) vs. Fantasy (witch-side), which side explains what happened?   If you feel like indulging yourself in this story for the first time, here are some aspects that may encourage you:  - Closed-room mysteries that will blow your mind. The author introduces some interesting concepts such as red and blue truths (the opposing truths, between sides) that bring these closed rooms to the very limit, defying what you would call normal logic. - Top-notch BGM. Seriously, top-notch. Watching the characters trying to unveil a closed-room mystery will literally feel like watching the final episode of TTGL. - Lots of interesting characters. Pretty much all of them have a good and a bad side.   Some aspects that you need to be aware of:  - Sprites are definitely not high-quality, especially if you choose to use the original ones. However, I would still recommend using the original ones as opposed to the newer ones, because, well, they're hilarious and, despite their amateurish look, you'll eventually notice that the author did put quite some effort on them. It just takes some time getting used to. - Don't take everything at face value. What you see may or may not actually be there. - The story takes a little while to pick up. You will have to persevere for a bit to get to the really interesting parts.  So, without further ado:  Welcome to Rokkenjima. The Golden Witch extends her heartfelt greetings. First, please put yourself at ease.",
            "review_score": "1"
        },
        {
            "review_text": "Umineko: When They Cry is a sound novel story told through eight different 'arcs', which are divided up into two games. These are the first four arcs, which introduces the story and the conflict that the main character, Battler, has to overcome - prove that witches and magic did not have any influence in what has become known as the Rokkenjima Island Massacre. Or, for Battler, the bloody and gruesome murders of his entire family. His enemy is Beatrice the Golden Witch, whom has lived for over a thousand years and can twist the events on the island to her will. What is reality? What is illusion? By purchasing this game, you will journey along with Battler on the emotional rollercoaster to the truth.  I finsihed the first episode in a little over 180 hours. But this was because I would sit and listen to the wonderful music, appreciate the very detailed sprites, or go over the tips and character biographies religiously to try and piece the mystery together. (Trust me, it's much more difficult than can be imagined.)   However, be warned. This is not a 'game' in the usual sense. You do not really 'play' it, merely spectate it. Much like reading a book with pop-ups, you can only follow along as the characters you have come to love be brutally murdered. Fun! It takes a while to start, but once it does, it will grip you by the throat and never let you go.  If you are a fan of mystery, intrigue, the occult, or simply a fan of amazing stories, the Umineko visual/sound novels are a purchase you simply must enjoy.  ...And this was all said in red, of course.  (NOTE: Nominated this for the 'Wooooooah man!' Steam Award. EVERYONE DO THIS!)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a visual novel in the truest sense. The text itself is front and center, overlaying the graphics. There are no voices, only very good music well-tailored to every scene. There are no choices, and there is no 'gameplay' built in at all.   But it is a truly fantastic novel. The excellent story is everything for this game. And while there are no mini-games or anything like that, a great deal of what makes this game great is the challenge presented to you: Find the truth, whatever that may be.",
            "review_score": "1"
        },
        {
            "review_text": "While the UI is inferior to 'Higurashi', the Story is imo superior. After buying this (which you should btw) you should turn on the CGs, which are unfortunatly disabled. The forum has you covered.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Mystery genre than this is perfect. this is my favorite Mystery story ever created, unfortunatly it's incomplete with only the first 4 episodes.  We will need Chiru To finish the story.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Great Story   Wonderful Soundtrack  A very complex mystery. Cons: Lack of Voices for Characters.  Will be picking up Chiru when released.",
            "review_score": "1"
        },
        {
            "review_text": "This is neither a murder mystery, nor a fantasy series - yet it is both. This is not an interactive novel, but a kinetic one - yet it will play with your mind and challenge you like no other.  Welcome to Umineko - When they cry, a series that not only deconstructs the mystery genre, but starts questioning the very way stories have been told so far. Throughout your journey, you will be trolled, mind♥♥♥♥ed, amazed, challenged, determined to get out of your comfort zone. You will cry with the characters, you will scream with the characters, you will have an intellectual and philosophical debate regarding the objective vs. subjective nature of truth, you will deny magic while drinking tea with a witch and, most important of all, you will be changed.  Umineko is a sound novel. It does not have any choices per se, however its interactive nature stems from the fact that is is a game between you - the reader - and the author. It is the best medium in which to experience this series, as the manga unfortunately cuts down on the interactivity part by giving you the answers one by one and  the anime was so disappointing, that most fans pretend it never existed  [myanimelist.net] . However, the sound novel has two major advantages.  The first is the atmosphere, created on one hand by the most amazing soundtrack I've ever listened to in a game (combined with the leitmotif sounds of rain, seagulls and the sea) and on the other hand, by the setting itself - the isolated island, the rich mansion, the rose garden - all beautifully illustrated by the realistic photo backgrounds. The second is the fact that it is, first and foremost, a novel - therefore certain aspects are left ambiguous through writing, enabling you to fill in the gaps either with personal projections of your own mind or personal theories regarding what happened.  The new art, featuring the sprites licensed from the pachinko Umineko game, is definitely an improvement to the original one (despite the fact that the original one - which I've played with in the past, before the Steam release - had its own undeniable charm). However, the new sprites make the characters pop out of the backgrounds better and is more consistent. Some characters may look a bit odd (mostly Battler, who desperately needs a haircut, and some of the female cast, who have beach balls instead of breasts). But most of the older characters look surprisingly better - they show their experiences on their faces.  It should be mentioned that Umineko had been ported to PS3 in the past with new sprites, backgrounds and voices - which Mangagamer couldn't license. However, an unofficial mod will mostly definitely come out for this version soon. Personally, I am not a big fan of it, due to the stiffness of the characters, the weird perspectives and cartoonish aspects of the backgrounds and the fact that voices take away some of my own imagination and make the read-through last much longer. So, for now, I definitely recommend the Steam version more - since it is closer to the original intent.  Regarding the content itself, this game only features the first 4 Question arcs, each requiring a reading time between 10 and 15 hours. The translation is an improved version of the fan patch, done by the wonderful team Witch Hunt. Each arc shows an alternative story of what happened on the 4th and 5th of October 1986 on the island belonging to the Ushiromiya family, Rokkenjima. Some arcs (for example the first and second one) start a bit slower, insisting on the relationship between characters and on a bit of backstory before setting the stage. However, some of these introductory parts contain very important hints to the overall mystery, hidden between layers and layers of deception. This makes Umineko have an amazing replay value, because you always notice things that escaped you on the first or second read.  Without getting into spoiler territory, the question arcs start as a classic mystery with allusions to magic... only to make you realize that the overall story takes place outside of the mystery itself, in a fantasy setting. Confusing, huh? Umineko manages to blend in various genres and bring forth themes such as the nature of truth, the possibility of multiverses, love, the cycle of abuse, accepting one's death, creating your own fantasy world in order to cope with the harshness of life, the importance of storytelling, the futility of miracles... and many more. Because of its very nature, it is a story which can be (re)interpreted according to each reader's vision within certain limits, which is probably why even now, 9 years after the release of the first Question arc, fans are still writing huge emotional blocks of texts debating theories on various forums, on youtube, or on any platform where Umineko pops up.  All in all, I recommend this game wholeheartedly - especially if you are a fan of mystery and suspense, of Higurashi, or just want a story that breaks the confines of classic storytelling. Sit back, take a pen and paper and write notes and try figuring out the truth yourself while reading. You'll most definitely fail, but the fun itself comes from theorizing and exchanging ideas with others. And hey, helping you figure out the truth with certainty is what the Core arcs will be for when they will be released on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Umineko is the pinnacle of visual/kinetic novels for me. Many, myself included, consider this the best piece of writing by its author, ryukishi07, who also wrote Higurashi.   A kinetic novel is slightly different than a visual novel. A visual novel is akin to a 'choose your own adventure' story book, where choices pop up here and there to allow you to explore certain 'routes' of the story. A kinetic novel contains no choices, and is essentially just a novel but with background music, drawn characters and background, and voice acting (though currently this Steam version doesn't have voice acting).    Even by visual kinetic novels, Umineko is LONG. Similar to Higurashi, Umineko spans over 8 chapters (the first 4 chapters are part of this sale and the latter 4 will be released at a later date), with the first four setting up the mystery while the latter 4 giving more clues to help you solve the mystery.   This is certainly one of the best pieces of mystery I've read, and I'm an avid reader of authors such as Doyle and Christie. The synopsis is as follows:   The protagonist, after being estranged from his family for a few years, joins his father and step-mother for a family reunion on an island that his grandfather and his oldest uncle resides on. He sees his aunts, uncles, and cousins, as well as maids and butlers employed by his family for the first time in many years. While he is reacquainted with his cousins, the rest of the family squabble over inheritance that will be left by his aging grandfather. As a storm isolates the island from the rest of the world, and with rumors of a witch that lives on the island, all these elements blend together for a close circle mystery that blur the line between dective-mystery and fantasy.   Does the witch actually exist? Was it magic that caused the events on the island? Read through the first 4 chapters of Umineko to formulate your own thoughts on the events on the island, and remember, without love, it cannot be seen.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me sad  As of now this game I not worth getting, the new art is the worst and the voices from the ps3 verion are no where to be found. Even the interface of the game is worst than the ps3 version. Umineko is not only one of the best games I've ever played but its one of the best things I've ever exprienced. Everything about the games story and voice acting and art was amazing and litteraly chanced my life after reading it. This game however is millions of times worse than that ever was. If you do buy this game then atleast wait a while for some modders to patch in the ps3 sprites and voices cause jesus christ the new sprites are awful.  In short ♥♥♥♥ this game, it does a disservice to umineko and will only be good when modders fix it.   0/10 would pirate sprites again.",
            "review_score": "-1"
        },
        {
            "review_text": "Deeply unsettling, with a fascinating story and music that lends itself to a powerful atmosphere, Umineko is insanely compelling. However, I would not recommend playing this at night, or without a wall to your back.",
            "review_score": "1"
        }
    ]
}