{
    "app_id": 406870,
    "name": "Eventide: Slavic Fable",
    "release_date": "2016-01-28",
    "developer": [
        "The House of Fables"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Hidden Object",
        "Adventure",
        "Casual"
    ],
    "achievements": 25,
    "positive_ratings": 440,
    "negative_ratings": 22,
    "price": 6.99,
    "description": "Explore the exciting world of slavic legends!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/406870/header.jpg?t=1530538839",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "  Game Information ",
            "review_score": "1"
        },
        {
            "review_text": "A visually appealing 'hidden object' game with a charming story woven in it. Mini games and point-and-click errands start very simple but towards the end it all seems very contrived and forced. The story is cute, the characters are cute, the painting style reminds me of Avatar, and all in all, I'm happy.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and kept good flow to story . Another win for Artifex Mundi !",
            "review_score": "1"
        },
        {
            "review_text": "I've played most of the games published by Artifex Mundi and it's one of the better ones. It's not created by AM but the overall quality is on par with their original works.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the story and the mini games. I just think it needs to be a little harder and longer. Maybe more to it and different things to do (like different missions for characters).",
            "review_score": "1"
        },
        {
            "review_text": "Decent game--would have liked to have to found more hidden objects. A good game, Just needed more spice.",
            "review_score": "1"
        },
        {
            "review_text": "Very nicely done hidden object game. Graphics clear/clean. Voice acting not the best, but tolerable. Unobtrusive music, pleasant. I Highly recommend. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles here are usually intuitive. The background art inthis game is gorgeous as well, although the characters look odd and the story is nothing to write home about.",
            "review_score": "1"
        },
        {
            "review_text": "This is just about my ideal Artifex Mundi game. Really gorgeous music and lovely art. Cute voiceovers, extremely enunciated, hehe--I always love That Guy Who Plays The Bad Guy (he's a few characters in this one). The puzzles were good, if on the easy side. Collecting bestiary cards is a great idea. Also, I'm not sure this is a plus for everyone, but I laughed every time the word 'Slavic' came up, like an exotic callout that doesn't actually mean anything. Don't go in expecting historical accuracy or anythin'. But it is cute, and they did borrow elements from real mythology, just toned down or modified and given really generic English names. It was a very cute game overall.  My only change would be to make the map a better map--rooms are gathered into chunks so map-teleportation is handy but not as handy as it could be.",
            "review_score": "1"
        },
        {
            "review_text": "Highl recomend! Great scenes, not to hard.",
            "review_score": "1"
        },
        {
            "review_text": "(Note: my 'play time' in Steam is under-stated because i played through this on Android, not Steam.)  Eventide is every bit as good as Enigmatis 2, if not better, and the theme likely has a wider appeal (while also being 100% family-friendly, unlike Enigmatis 2). It's possibly not as engrossing, as it's missing the 'investigation chart' from Enigmatis 2, but it nonetheless sports the same production quality. The activation zones in the puzzle involving several wooden figures are 'way off' (tried 3 times without success before Hint told me that it was indeed possible), but the rest is excellent - graphics, audio, pacing, characters, object interaction. Eventide and Enigmatis 2 easily set a new standard for Artifex Mundi quality, and i hope they make more titles like these, rather than more like their Time-traveler series.  If every HOPA were as well-made as this one, the world would be a happier place. i simply can't say enough good things about Eventide.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game. The story is not very deep but it's still a sweet and enjoyable tale. I like the use of Slavic mythological creatures, fables and folklore. The art is beatiful. The puzzles are not extrmly hard but they still frequently make you think.",
            "review_score": "1"
        },
        {
            "review_text": "Nice short game. Wonderful graphics. Good for english learning. Mostly solved without a hint.",
            "review_score": "1"
        }
    ]
}