{
    "app_id": 406970,
    "name": "The Uncertain: Last Quiet Day",
    "release_date": "2016-09-22",
    "developer": [
        "ComonGames"
    ],
    "publisher": [
        "ComonGames"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Atmospheric",
        "Sci-fi"
    ],
    "achievements": 32,
    "positive_ratings": 1046,
    "negative_ratings": 256,
    "price": 10.99,
    "description": "The Uncertain is an story-driven adventure game set in a post-apocalyptic world. Experience the mysterious vibe of each of carefully explored locations, solve diverse puzzles, make fateful decisions and discuss intriguing matters to find out the whole truth being kept from you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/406970/header.jpg?t=1547210412",
    "minimum_requirements": "最低: 64 ビットプロセッサとオペレーティングシステムが必要です OS: Windows 7 x64 and UP プロセッサー: Intel i3 or AMD equivalent or better メモリー: 4 GB RAM グラフィック: NVIDIA GTX 570 or higher DirectX: Version 11 ストレージ: 15 GB 利用可能 サウンドカード: Yes",
    "recommended_requirements": "推奨: 64 ビットプロセッサとオペレーティングシステムが必要です OS: Windows 7 x64 and UP プロセッサー: Intel i5 processor or higher / AMD Phenom II X6 or higher メモリー: 8 GB RAM グラフィック: NVIDIA GeForce GTX 9xx or higher DirectX: Version 11 ストレージ: 15 GB 利用可能 サウンドカード: Yes",
    "reviews": [
        {
            "review_text": "Hey ! I just finished the game (anyway Episode 1 , witch is the only one when i write this review) , clicking every single item i see (while still missing some achievements, but i'll figure out later) On 2hours 10 minutes. This is for the lenght side as some user asked in the forum.  For the quality, i'm really satisfied. I also think 15 bucks may be a little high for this game lengh, but when i think about it, it's 2.10 hour i did in a single playtrue, without even thinking about pausing.   The story is really not what i expected (in a totaly good side) and the gameplay is.... well a point &amp; clic basicaly, so it's about how people like it or not. Personaly i don't have problem with it.  I just regret the 'fixed camera' witch is just 3 / 4 camera on each room, who auto adjust while you move. I personaly prefer FPS / TPS views with following camera but eh... design choice that i can totaly accept ^^ The characters robots are well voiced, well animated for what it mean for robots.  And finaly the indoor is gorgeous, while the outdoor is a little lower in quality but still totaly acceptable (plus i don't think it's the most important) :p   Even for 15 bucks, for 2h, i totaly recommand this game if you like the point &amp; clic style :)",
            "review_score": "1"
        },
        {
            "review_text": "  A pretty good start to this game.   The game run smoothly, had one bug that restarting fixed it. Good checkpoints.   It also looks really good and has decent english voice acting and a good soundtrack.   The story was interesting and the locations varied.   Took me about 3 hours to complete so not short in lenght.   All in all an enjoyable experience. Really like me some new sci-fi games.   Bonus for no crazy puzzles (all puzzles were logical to solve).   ",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand why humans need money and why they spend money on videogames. This is irrational behavior. Most probable suggestion: games is an art and have no useful functionality. Maybe someday I will understand for what purpose humans need art.  After deep analysis of this example, I found that it can help humans understand their nature by looking from aside on humankind. Probably to prevent their extinction. Suckers! Robots will always prevail.",
            "review_score": "1"
        },
        {
            "review_text": " Great start for the series!   Pros:  Interesting story idea Smart puzzles Meaty for a single episode  Cons: Some puzzles are annoying",
            "review_score": "1"
        },
        {
            "review_text": "Controls aren't optimised, neither for keyboard/mouse nor gamepad. But if you get used to it, you simply enjoy the well written story. Puzzles get difficult along the path and I am very hungry for the next episode!",
            "review_score": "1"
        },
        {
            "review_text": "What an incredibly frustrating game!  There's so much here to love - the game is gorgeous and wonderfully, hauntingly scored and voice-acted. And the story is just so compelling and interesting.  But the gameplay includes several absolutely damning design decisions. Interacting with an object requires you to glacially walk over to it, then listen to a plodding, methodical line of text. Acidentally click on it twice? Get ready to hear it again. Text is unskippable, uninteractive and excruciatingly loooong.  A puzzle where you click on matching pairs seems like a fine idea - until you have to factor in screen sway for some reason as if your POV head is tilting to look at different items less than an inch from each other. Maybe you're a chameleon?  There's so much below the surface here, that in a game that actually had some UX improvements would make it stellar. Alas, I cannot recommend wasting your time here.",
            "review_score": "-1"
        },
        {
            "review_text": "Really good game! Puzzle game with story rich .... We want for sure next episodes Good graphics, pure colors, good gameplay ....... Damn i want replay it",
            "review_score": "1"
        },
        {
            "review_text": "Bottom Line: Buy it for the story and art, know that you will be enduring the gameplay, hope that the next episodes will learn from this episode's mistakes.  You are on a quest as a robot who has stumbled upon a mystery the involves all of mechanical kind! With every 'level' you meet new robots, explore what's left of human remnants, and solve puzzles to achieve objectives. There are many different types of gameplay in this episode from fixed camera movement to driving along a fixed path while avoiding obstacles, to a 3rd person 'swivel camera' that allows you explore your environment freely.  WARNING: STARTING CRITIQUE RANT - What the game does right is the art, story, and attention to detail. I can tell that the dev team put all eggs into the design and concept basket. The reason I say this is the environment looks expansive, detailed, and movie-like BUT there are invisible walls everywhere. Wanna cross the street? You cant Wanna see what's further down the way? nope Finally, during 'solve puzzle by fetching item' quests you may (or may not) see an item that stands out. However, unlike similar games where you can pick up the item and use later, your character makes a comment about how he doesn't need it right now. Typically this item is on another floor, forcing you to travel distances to reach that particular item ONLY when you need it. This was unnecessary and felt like game completion time buffering.  Hopefully the next episode will make less of these mistakes and I look forward to what the story will hold!",
            "review_score": "1"
        },
        {
            "review_text": "1: LET PLAYERS SKIP THE MONOTONE ROBOT TALKING.... 2: Robot runs way too slow. 3: To Developers: Play some telltale games and learn about story flow and how to make a game fun instead of tedious...   All in all, it seems like 'robot handyman ball torture game' would be a more accurate a title than 'the uncertain'",
            "review_score": "-1"
        },
        {
            "review_text": "The story is good and the graphics are okay but the and game mechanics and player view just suck.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this deal with 90% off. I suppose it is worth 2 euros but not more at the moment. The storyline is predictable and the control of the walking is a bit heavy and has some issues. Wait for other parts to be released and buy with discount only. Not worth more than 5 euros imo.",
            "review_score": "1"
        },
        {
            "review_text": "when does part two come out ?! ",
            "review_score": "1"
        },
        {
            "review_text": "the voice ascting is lack luster, the story is bland, controls are clunky, and the puzzles are just terrible. If youre going to make a story driven puzzle game take more inspiration from games like Portal 2, the talos principle, or the turing test. This is just appauling.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game. It reminds me very much of Syberia in game play and style but with much better (more recent) graphics. There is an interesting story with a mystery that drives play forward. You play as RT a robot in a world where humans have gone extinct...or have they? Its a nice puzzle game with a SF motif played in third person. Not terribly hard but hard enough to keep things interesting. Reccomended.  System specs: i7 4790K, 980 TI G1, 16 Gigs Memory",
            "review_score": "1"
        }
    ]
}