{
    "app_id": 407020,
    "name": "Star Sky - ブルームーン",
    "release_date": "2015-10-23",
    "developer": [
        "JMJ Interactive",
        "Mårten Jonsson"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Adventure"
    ],
    "achievements": 18,
    "positive_ratings": 152,
    "negative_ratings": 40,
    "price": 2.79,
    "description": "Star Sky is a game about a man taking a midnight stroll. You take the same road as many times as you want, each time hopefully unlocking new encounters. Can you unlock the mysteries of the night?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407020/header.jpg?t=1555564459",
    "minimum_requirements": "OS: Windows XP and Up Processor: 1Ghz Memory: 512 MB RAM Graphics: Onboard graphics card Storage: 80 MB available space Sound Card: Built-in Additional Notes: May experience slowdowns on retina displays.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It's one of those minimalistic games that makes it difficult for me to write about again.. *sighs and cracks knuckles* Let us get stuck into this.   Basic Breakdown:  A man takes a midnight stroll to find out what surprising adventures he can find in the night. There are a handful of different endings and a few different events that can happen within one nights play-through or many.   Graphics:  The one thing this game has to offer, if nothing else, is how pretty it is. It's so simplistically gorgeous and really sets a bar for how it should feel; atmospheric, magical and mysterious.   Soundtrack:  There isn't really much of one either. It's just the 'magical sound' that plays when you are close to a trigger event spot and honestly, it's trying a tad too hard to be whimsical and deep when it lacks a lot of content to be such.   Final Conclusion:  It's a tad bit pretentious with its 'I'm Adele kind of deep' take on itself, because in reality, it would need a lot of work and a lot added to it to in fact.. Be deep. It's pretty, and has good ideas, but doesn't execute them in such a way that feels meaningful - It just leaves you in awe of a pretty thing for a minute or so.  Trigger spots aren't distinct enough for them to stick within your memory - This is annoying simply because you can't step backwards, this means that even if you misstep once just outside of the trigger-zone, you have the replay the entire walk to find that spot/sequence of events to trigger and ending or scene. This would be fine to do if the environment changed substantially, or the events changed and it was just all random, but it isn't. It's the same thing over and over again that you have to reply to ~see all there is to offer~   I understand the idea of what the game is trying to achieve in the 'You can only move forwards' insinuation, as well as the making you patiently wait for your desired result, but even with those stretches it doesn't justify not being able to correct errors you may make a long the way. While you cannot erase them, you can fix them - the inability to walk backwards completely role-blocks that.  At the end of the day you really take what you want from it.  It is a pretty looking game, it won't cost you much to experience it, and despite all I have complained about, I'd still suggest you go play it for yourself. ",
            "review_score": "1"
        },
        {
            "review_text": "Really short, but sweet game ^^",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure I'd call it a game but I enjoyed it a short chill-out experience with nicely drawn minimalist graphics. while there isn't much overt story, it'll keep me occupied wondering what the heck is going on for a while. it is a good choice to unwind as nothing stressful happens whatsoever, although you could interpret the story in creepy ways. it does a good job of simulating a walk at night when you can't quite tell what things are, or a pleasant but confusing dream. the achievements took me a bit of thinking to work out and I think one was slightly bugged.  I can see how it might mess up the game to be able to go backwards, as there are very specific triggers and the logic would get confused by being able to go back and redo things in a different order, but I still would like there to be a wider margin of error with triggering things. sometimes I don't hear the event music in time and don't manage to stand in the exact right place.",
            "review_score": "1"
        }
    ]
}