{
    "app_id": 407060,
    "name": "AltspaceVR—The Social VR App",
    "release_date": "2016-03-31",
    "developer": [
        "AltspaceVR, Inc."
    ],
    "publisher": [
        "AltspaceVR, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Cross-Platform Multiplayer",
        "VR Support",
        "Partial Controller Support"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Massively Multiplayer",
        "Simulation"
    ],
    "tags": [
        "Free to Play",
        "VR",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 328,
    "negative_ratings": 83,
    "price": 0.0,
    "description": "Welcome to AltspaceVR, the easiest way to meet people from around the world, play interactive games, and attend free live events in VR. Choose from over 28 activities or attend live events with comedians, DJs, authors, celebrities, and more. Day or night, there’s always someone to hang out with.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407060/header.jpg?t=1512415661",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 SP1 or Newer Processor: Intel i5 Memory: 4 GB RAM Graphics: DX9 compatible dedicated GPU, 1GB video memory DirectX: Version 9.0 Network: Broadband Internet connection Storage: 500 MB available space Additional Notes: Min Req are for 2D mode (no VR headset)",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 Processor: Intel i5-4590 Memory: 8 GB RAM Graphics: GTX 970, AMD 290, or equivalent DirectX: Version 11 Network: Broadband Internet connection Storage: 1 GB available space Additional Notes: Rec Req are for VR mode (Oculus Rift, HTC Vive)",
    "reviews": [
        {
            "review_text": "This 'game' is one I've spent probably the most time with my Vive so far. It's meant to be a VR hang out space to just talk to people but with different events every so often and mini games throughout. If I ever don't know what to play in VR, I usually just play this.",
            "review_score": "1"
        },
        {
            "review_text": "A glimpse into the potential of the future. It is good to be alive.",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why, but this is one of the most fun thing i visit every single day, when i play with my Vive.  Last night i played : Cards Against Humanity with complete strangers  And i learned how to play Boss Monster.  This is awesome and i cant wait for more fun times :)   And the best part: ITS FREE!  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the most outstanding VR experiences you can have at the moment. You can easily hop on for 4-5 minutes, end up making a friend or two, and have your couple minute venture turn in to hours. There are a ton of different games and activities to partake in, with more on the horizon. There is typically always an Altspace employee on call to help you, or explain caveats of the game to you which is a unique approach that you don't see in most games.  Try this game! I highly recommend it, and you've got nothing to lose. But be warned, it can be very addicting!",
            "review_score": "1"
        },
        {
            "review_text": "Visually not the most beautiful VR experience but just as fun as the internet chat rooms of 90s.",
            "review_score": "1"
        },
        {
            "review_text": "Please allow users to 1) change their nicks in and out of game and 2) individually adjust volume of media (e.g. yt videos) being in played. Please improve sound damping based on distance between source and receiver.",
            "review_score": "1"
        },
        {
            "review_text": "The HTC Vive tavern in this is really fun! Talking to others in there is a blast. For this I give the product a positive rating.  For the devs, here are some things I'd like to see added:  The ability to upload your own avatars (Not sure if you can actually do this) Karaoke night (like in those old riftmax days) More games and updates, more environments (user generated)  Would recommend checking this out if you have a Vive!",
            "review_score": "1"
        },
        {
            "review_text": "My first VR experience was the after party. I had soooooooo much fun dancing around in my living room to the DJ. I can't wait for the next. Made my day.",
            "review_score": "1"
        },
        {
            "review_text": "  Never works. Doesn't start properly, and if it does it doesn't pair with the Oculus, and the cursor gets sucked into the corner of the screen. I've tried everything and can't get it to work.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashed twice with my Vive.",
            "review_score": "-1"
        },
        {
            "review_text": "lmao the developer banned me from this game lmao for nothing",
            "review_score": "-1"
        },
        {
            "review_text": "Awsome !",
            "review_score": "1"
        },
        {
            "review_text": "Revolutionary way to connect with people.  A few rough edges here and there, and could use some more polishing - but conceptually, this is an amazing experience. Body language in digital communication is the future.",
            "review_score": "1"
        },
        {
            "review_text": "Love it played for 4 hours straight with HTC Vive with two of my friends, and other people that I don't even know. I recommend it, and it's free. Also, made some friends too.",
            "review_score": "1"
        },
        {
            "review_text": "Great games with a lot of great people to meet. Everyone is friendly, and there are several rooms such as the YouTube Room where players can play any videos from YouTube such as music or a video. The staff are very friendly and try to make this social space better for users, for example helping users with controls and how to play, they are great for techincial support. There are a few bugs however this has only been out for a day, so I believe that the staff will be able to fix the bugs, as well as adding more amazing content. Overall I'd give it an 8/10 however in the future i'mn sure my judgement will rise :) Little_Red",
            "review_score": "1"
        },
        {
            "review_text": "Nice social environment especially since you can bring in your own 3D content from the web.",
            "review_score": "1"
        },
        {
            "review_text": "This is pretty cool because it allows everyone to interact as if they were in real life.  The downside of this is it allows everyone to interact as if the were in real life. I just saw another player bully everyone in the room. It made the experience not enjoyable at all for any of us in there. Even his 'friend' was a bit uncomfortable about it.  If you get a good room with nice people it's good.",
            "review_score": "1"
        },
        {
            "review_text": "Very high sense of presence in this virtual world! This is the successor to video chatting. Rather than just see other people in real time, you can also interact with them! Use your real hands to interact with the environment, and your real legs to walk around. Voice communication is clear. The graphics thou, are a throwback to N64 era. Regardless, social applications such as this one make the world a smaller place, bringing people together from all over :-)",
            "review_score": "1"
        },
        {
            "review_text": "Few bugs here and there and some games are buggy! BUT this was an amazing experiance! met new people! Had fun! Recomended!",
            "review_score": "1"
        },
        {
            "review_text": "This is an excelent chat program with a decent number of features. If you want to get in and meet internet people and socialize with VR this is the best place with a fairly large comunity and support for almost every VR device out there.  Cons: This really seems to cater to the lowest spec VR. While great for accessability it's not really something that will wow you in anything other than pure social interaction. The UI is a little clucky.",
            "review_score": "1"
        },
        {
            "review_text": "CAN'T WAIT FOR NEW YEARS IN VR. LETS pray it's a good party.",
            "review_score": "1"
        }
    ]
}