{
    "app_id": 407120,
    "name": "Soccer Manager 2016",
    "release_date": "2015-10-07",
    "developer": [
        "Soccer Manager Ltd"
    ],
    "publisher": [
        "Soccer Manager Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Free to Play",
        "Indie",
        "Sports",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Soccer",
        "Sports"
    ],
    "achievements": 0,
    "positive_ratings": 523,
    "negative_ratings": 218,
    "price": 0.0,
    "description": "Soccer Manager 2016 - Play for Free, Compete for Real.The most diverse FREE 2 PLAY football management simulator in the world. Take on a top flight club and test your management skills against the best or help a struggling, lower division team fight for glory.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407120/header.jpg?t=1447378317",
    "minimum_requirements": "OS: Windows XP or Later Processor: 1 GHz or higher Memory: 1 GB RAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game wanted my steam login mandatory, Im not going to trust it, Try it if you dare.",
            "review_score": "-1"
        },
        {
            "review_text": "  As a free game, its a great download. Its really fun if you just wanna pass some time or you're really bored. It would be great if they keep it a free-to-play but i wont mind paying a small sum for a more complete game which is more realistic..thats what they gotta do if they wanna compete with Football Manager. So, here are cons which could prove to be helpful in developing the SM17 game hopefully: - Unrealistic ratings. Most average players are 85+ rated and this is too unrealistic..developers should give more effort to giving ratings similar to Fifa, cuz thats the only football game out there with realistic ratings. Players like Sven Bender should not be 91 rated. - The results are very predictable. There should be more pressure given to managers to think hard and bump up their tactical game. - Narrow variety of features and customization. - No option to choose the currency of the in-game money. - Not enough changes made from SM15.  Once again, I dont mind paying for a game which is a few bucks well spent, FM16 is a great game but overpriced, so if SM17 is going to be around 2,3$ for a better and more complete game, its probably more thoughtful than keeping it as a free-to-play.",
            "review_score": "1"
        },
        {
            "review_text": "Free2play ,football* manager and fun why not?",
            "review_score": "1"
        },
        {
            "review_text": "For a free to play game its actually really good! It has a surprising amount of players and teams available and the game isn't 'pay-to-win' like a lot of free to play games are. Could do with a tad more music in the menus and stuff but that aside for the 'price' its easy to recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game that is free!  Pros: It's free, licensed player names and teams, Has domestic, continetial competitions as well as domestic league which in England goes to the fifth tier. A pretty good game, which has transfers, finances, training and scouting etc.  Cons: Matches get laggy most of the time but I am fine with that, need statistics for domestic and continetional cups. Needs player and staff contracts, more in-depth staff roles and tactics need more depth to have more of an impact on the match like Pep Guardiola and Jose Mourinho. Transfer budget is questionable, I mean, how are AS Roma buying Paul Pogba for 60 million but Real Madrid only have 40 million and that is one of the highest budgets in the game. If I were to play as AS ROMA, I don't think I would have 60 million, keeping in mind that I am also selling players for that money.   ALL OF THESE CONS ARE IMPROVEMENTS FOR THE GAME BECAUSE IT IS A FREE GAME AND HAS THE POTENTIAL TO IMPROVE, OVERALL THE GAME IS REALLY GOOD!  Overall Rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Yep , Super Fun Manager Game   Result : -Clubs - Umm.. 8/10 -Transfer 7/10 -Players Ratings 7.5/10 (A.Martial 80+ Rated WTF..?)  Overall - 7.5/10 Not Bad   I still recommended this game. lol,",
            "review_score": "1"
        },
        {
            "review_text": "It is a decent game, playable even without falling for the freemium store, which seems to only work if you link your Steam account to the game.  The biggest drawback of playing it without purchasing anything from the in-game store is that you may end up having to juggle money, players with low physical condition, and can't buy as many transfers when the markets open.",
            "review_score": "1"
        },
        {
            "review_text": "Great game so far, howeer the actual in-match mode for actually playing a match seems a bit buggy. Maybe its just because I am playing on an older OS. Love that I can mamage teams from the Seattle Sounders to the Chelsea FC. Overall 4.0 out of 5.0.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Manager Games I have played! And its free to play! There are some things you can buy but its defo not pay to win game!!!! Really like the new Interface! 2D match engine! AND ITS ALL FREE! What more can you ask for!?!?!",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for a couple hours, 2 seasons to be noted, since yesterday, and I'm pretty happy about its current situation, especially since it's free.  Although it doesn't have any ads, a *cash injection* is suggested from time to time, becoming a bit annoying in the end, but hey. The pitch is great, you can change tactics mid game, but it lacks a SKIP button.I think it would be a great addition, because even at 30x speed it takes a while and along with the occassional inj. and the half-time pauses, you can't just go away and be back when it's done.  Moving on, the ratings are a BIT off and the news chapter is lacking much variation.Tbh, might as well say that this game could be much more if the devs would go a bit deeper.  The gameplay is pretty smooth, overall being a nice starting point to the genre, but I did experienced some lag on 3 different occassions, every time after a couple games.    ",
            "review_score": "1"
        },
        {
            "review_text": "how to play multiplayer?",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥?",
            "review_score": "1"
        },
        {
            "review_text": "Better than Call of Duty Infinite Warfare!",
            "review_score": "1"
        },
        {
            "review_text": "It is so boring and u dont even see the actual players do stuff and u cant control them",
            "review_score": "-1"
        },
        {
            "review_text": "Its free !!!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO ♥♥♥♥ING LIT YO. Mans mourinho out ere,♥♥♥♥ING LITTTTTTTTTTTTTTTTTTTTTTTTTTT.",
            "review_score": "1"
        },
        {
            "review_text": "Shortly after i logged in the game started to downloading some game files. I guess it was the data base. However, there was no progress bar, or info on how big this download was. After 90 minutes i had to turn off my computer and the download was not finnish yet.   I have no idea what the download size is. I have no idea what the download speed is. I have no idea how long this download would take. I have no idea if i have to start the download from the beginning again or if it start where i left off. I don't even have a clue if the download was downloading or if it has bugged out..  But i do know that i can't sit around all day waiting for a download when i don't even know if the game is downloading anything or how long it will take. So i guess i will never find out if this game is good or not. What a crappy way to handle the download of the data base. Why not include that in the original steam download??",
            "review_score": "-1"
        },
        {
            "review_text": "+ quick and easy + real rosters + free - overly simplified - often crashes to desktop - you often concede cheap goals  - your players miss 99% of goal scoring opportunities they get",
            "review_score": "-1"
        },
        {
            "review_text": "Sign Zimbabwe Characters (except for sturridge).",
            "review_score": "1"
        },
        {
            "review_text": "Not bad - I like how you can actually manager ather than just playing",
            "review_score": "1"
        },
        {
            "review_text": "Im going to be honest I played soccer manager 2015 and thought it was boring I never really gave it a chance I had 6 minutes but I should of played it more cause this one is sooo much fun get it for a great time killer!",
            "review_score": "1"
        },
        {
            "review_text": "its fine",
            "review_score": "1"
        },
        {
            "review_text": "I like the game a lot but I think it could be better in the training department. Plus you get very little money for transfers each year",
            "review_score": "1"
        },
        {
            "review_text": "Must buy now",
            "review_score": "-1"
        },
        {
            "review_text": "In some point unrealistic, Messi always scores penality.",
            "review_score": "1"
        }
    ]
}