{
    "app_id": 407230,
    "name": "Legend of Mysteria RPG",
    "release_date": "2015-10-09",
    "developer": [
        "Labyrinthine"
    ],
    "publisher": [
        "EQ Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Anime",
        "RPG",
        "RPGMaker"
    ],
    "achievements": 6,
    "positive_ratings": 410,
    "negative_ratings": 182,
    "price": 1.59,
    "description": "An exciting JRPG by the writer of Labyronia. As tensions grow between factions of mages, you are framed for the murder of a demigod. Solve the mystery behind his assassination or risk a war that could send the world into chaos for millenia.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407230/header.jpg?t=1492976179",
    "minimum_requirements": "OS: Windows 98, XP, Vista, 7, 8, 10 Processor: Intel Pentium III 800 MHz Memory: 512 MB RAM Storage: 250 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "2nd game labyronia saga i do after Labyronia 1  It's really easy they a few fight for a RPG , little quest to do , find object , interact with good item on good people  You can play it , a good story for this little RPG maker game and don't take only for cards ;)",
            "review_score": "1"
        },
        {
            "review_text": "Disclosure: Received a review copy.   Labyronia part 3 is up to testing after getting a review key and to my great surprise it is not actually a real sequel to the first two games but instead a prequel to the events to come in part 1 and 2. In addition the game type has changed from typical JRPG style adventure to a more 'detective story' type of gameplay where Windir from earlier games is the protagonist who tries to solve a murder taking place in a mage school and clear his name as he is framed for the murder.   After some 6h i must say the game is of same high quality as the previous games in the series. i.e. what it lacks in original art and assets it gains in good design. I guess you could say the dev did not spend his time at the art drawing board but instead did good work on the design board and it really shows. Lots of details and well tested gameplay as i have not seen any bugs yet.   As it looks now Labyronia games are some of the best what this old game engine can offer and therefore a warm recommendation to anyone who wants good games for cheap with high production values.",
            "review_score": "1"
        },
        {
            "review_text": "Being the prequel to Labyonia I thought it was going to be action packed, but NOPE. Puzzles, puzzles and even more puzzles!   Pros : - Backstory to Labyonia   Cons : - It's a puzzle game! Nothing like Labyonia or Labyonia II at all. - Not enough action. Nothing like the two games it is based off of. - Having to re-do the same maze path multiple times just to get from point A to point B - No side-quests - Under 5 hours (compared to Labyonia which was 15 hours and Labyonia II which was 10 hours)",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really basic RPG but it is also quite funny and easy to play. Buy it when there is a big deal on it!",
            "review_score": "1"
        },
        {
            "review_text": " Review Upon Legend Of Mysteria RPG   Written by Rias Gremory    Pros",
            "review_score": "1"
        },
        {
            "review_text": "I've played several of these RPGmaker-type games, and this is one of my favourites.  Solid story, challenging puzzles and very little of the turn-based combat that you normally find in this type of game (which for me is a good thing). While some of the obstacles can be irritating and it's not always easy to find the right piece of information and where to use it, I thoroughly enjoyed this game and would definitely recommend it, especially considering how cheap it is.",
            "review_score": "1"
        },
        {
            "review_text": "Give me the card!",
            "review_score": "1"
        },
        {
            "review_text": "I only played it for a little bit. It's hard and really fun to play,but is ok I guess.",
            "review_score": "1"
        },
        {
            "review_text": " I have recieved this game for free as part of a promotion for the game. Regardless of whether I paid for it or not, I remain unbiased in all of my reviews. My reviews reflect my opinion, and my opinion only.    Something something powerful crystal, something something dark lord, something something RPG Maker.   I want to become engrossed in these games, I really do, but it's really hard to do when you see recycled materials used over and over again. I imagine it's really fun when you get into it, but I just done care what's happening anymore. I can't become immersed when I'm staring at the same scene with walls of text explaining the back story. If I wanted to play a game based on a light novel I would just read the novel. I couldn't even get into the combat, I was lost at the beginning. The music is pretty good though, from what I heard, but it was awkwardly misplaced...    It's like, two dollars though. That's like, the price of a soda, or a couple hamburgers from the dollar menu, so save yourself the diabetes and heart disease, try one of these things out and you'll see what I mean.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, refunded the bundle, got my money back, games in the bundle weren't deleted. Free games",
            "review_score": "1"
        },
        {
            "review_text": "Cannot recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Intriguing puzzle game with RPG elements (you don't level up). Liked the story, which is the main reason for playing in the first place. Check it out when it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good detective game, you have to read A LOT and pay attention to every ♥♥♥♥ing thing, the character are really cool too.  My only problem with this game is that It's hard to know who is who, It doesnt show the NPC name when they talk, and you need everyone names to solve some parts. (Theres a community guide that can help)",
            "review_score": "1"
        },
        {
            "review_text": "Great little game",
            "review_score": "1"
        },
        {
            "review_text": "quests made me die gets even boring after a while but better than bad",
            "review_score": "1"
        },
        {
            "review_text": "Legend of Mysteria RPG is a prequel to the Labyronia saga.  It has great a great storyline and BGM, however the amount of walking around the same areas you do is very tedious. From my expierence i was following the story perfectly and suddenly a ceratin action couldn't be triggered to free a character out of prison. Which pretty much forces you to restart the game again to get to that point. Which i didn't do.  Overall, It's a pretty alright RPG maker game. Would i recommend it? Yes, pretty sure an error wont happen to everyone, i might have not been an error from the side of the game but rather an error in my playthrough. Maybe you should give it a shot.",
            "review_score": "1"
        }
    ]
}