{
    "app_id": 407330,
    "name": "Sakura Dungeon",
    "release_date": "2016-06-03",
    "developer": [
        "Winged Cloud"
    ],
    "publisher": [
        "Winged Cloud"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Sexual Content",
        "Nudity",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Nudity",
        "Mature",
        "Sexual Content"
    ],
    "achievements": 37,
    "positive_ratings": 1041,
    "negative_ratings": 88,
    "price": 14.99,
    "description": "You are Yomi, an ancient fox spirit. Your dungeon has been stolen from you while you have been sealed away in a deep sleep. Capture monster girls, collect loot, explore the dungeon's depths and reclaim what is yours in this first-person RPG dungeon crawler.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407330/header.jpg?t=1485531240",
    "minimum_requirements": "OS: Win XP+ Processor: 1.2 GHz Pentium 4 Memory: 1 GB RAM Graphics: 1280 x 720 DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Review originally post at  www.theotakujudge.com   I have always wondered why adult games aren’t readily available to buy off the PSN Store or Steam. Sony’s console has age restriction features to prevent minors from playing mature titles and on the PC front you need a credit card to purchase software from Steam, which kiddies shouldn’t have access to. Deviants seeking smut have however been catered to in recent years. Developers are starting to sell all age versions of their products on Valve’s marketplace that can be uncensored through the wonders of patching. Thanks to this compromise under eighteens can safely enjoy Sakura Dungeon’s RPG gameplay whilst perverts get to ogle all the boobs they could ever desire by simply downloading a small patch.  OVERVIEW  Sakura Dungeon commences with a bashful adventurer named Ceri setting off on a quest to purge some catacombs of the monsters residing within its tunnels. Things don’t go well however when she awakens the dungeon’s former owner – a fox spirit named Yomi. After a brief tussle Yomi overpowers the knight, who interrupted her hibernation, before using sorcery to make Ceri her unwilling minion. With a new servant under her command, Yomi decides the time has come to venture underground and reclaim the lair she once ruled. Over the course of their travels Yomi and Ceri can bolster their ranks by recruiting defeated enemies to their cause. The well-endowed creatures guarding the dungeon won’t surrender willingly though, so violence (and garment stripping) may be required to humiliate the hostile monsters into submission.  Via the use of the capture command players can recruit an assortment of bunny girls, busty witches and anthropomorphic pandas to their group. By the time I finished the main campaign my party contained over forty voluptuous beauties, putting Tenchi Muyo’s harem well and truly to shame. In order to successfully capture a gal their health bar needs to be depleted first, which is accomplished by smacking them with special moves and magic spells. Every attack drains a character’s action points and has a chance of causing your target to suffer a wardrobe malfunction. With the adult patch enabled (which I only activated for the purposes of writing an accurate review) it’s possible to tear a cat girl’s attire so badly that her “♥♥♥♥♥” will be exposed in more ways than one.  VERDICT  Anyone who has previously enjoyed Demon Master Chris should give Sakura Dungeon a download, as both games share many similarities. Providing that you aren’t prudish, Sakura Dungeon is a good title for players trying out a dungeon crawler for the first time because, when compared to other examples in the genre, its difficulty isn’t too taxing. That’s not to say that the game is devoid of strategy though. Clearing each maze will require that you manipulate switches, circumvent traps, exploit the elemental weaknesses of enemies and shrewdly manage your team’s action points. There are tough decisions to be made too; such as picking what embarrassing outfit Ceri should wear. Will you opt for the bikini, maid uniform or bondage suit?  My rating for Sakura Dungeon is a four out of five. It’s probably the best game Winged Cloud has ever developed, as the increased interactivity masks the mediocre writing found in their wordier visual novels. Although funny at times Sakura Dungeon’s script could be better, but it matters not as the onus is on exploring labyrinths, levelling up your characters and admiring the top-heavy character designs. My save file indicates that the story took me sixteen hours to complete, which compares favourably with the franchise’s other titles. The game’s duration is long enough to justify the current retail asking price and short enough that you shouldn’t strain your wrist too badly (if you know what I mean.)",
            "review_score": "1"
        },
        {
            "review_text": "Been playing for a good 6 hours, and all i could say is that im quite impressed. If all sakura games were actual games like this , not specificly a dungeon crawling game, but just any other type of game. The action is pree legit, and and character models are the same 'type' as previous sakura games. Only complain i have so far is that during combat, the options like escape, use items, switch party members are not on the main screen, and there is no button to change from combat action to secondary actions like most rpg games does, instead you gotta go in ESC and do it, just very odd. You can go around capturing various girls, who can help you for your combat, do not worry if you cant play them all, since they all gain experience and level up just the same as your front 3 characters. No weapons, no armors, just weapons and skins, so it isnt complicated.  Out of all the sakura games, this is one that you should buy.   Giving it a 8/10   eNjoY =^-^=",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't expecting much when I first bought it, but that quickly changed. The RPG meets dungeon crawler meets visual novel formula works surprisingly well in this instance. The art work is great, the characters are unique and all have their own distinct personalities, the humor is very well done, and for such an ecchi/fan service driven game the soundtrack is phenomenal (completely worth the download).  As with any game like this, the 18+ patch completely sweetens the deal. Come for the ecchi, stay for the surpsingly addictive gameplay...and the ecchi.",
            "review_score": "1"
        },
        {
            "review_text": "Literally sexy yuri pokemon 11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has a great deal of assets. The unsensored visual ones being the greatest. Abundant variety is another. The battle interactions are simple, but I liked that. It is a casual, relaxing game. The best thing about the story is that it is long, you don't feel cheated at all. I would have liked less predictable reactions in character conversations, but heh you can use the scroll wheel to breeze through it. My first playthrough and after play was 70 hours. I got 29/37 acievements. I could of got 2 more, but I read they are bugged for now. If I want more achievements it will take another playthrough probably 50 hours. This was my first dungeon crawler so I have nothing to compare it to. Compared to all other video games I have played I recommend it, especially if it ever goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "*Corrects glasses*  Thank you Lost Pause and guy with the patch link.  It's impossible to waste my time with this game.  Buy it and get the patch. It makes the game double worth it.   *Uncorrects glasses and plays to his hearts content*",
            "review_score": "1"
        },
        {
            "review_text": "pretty good game if you need some arm exercises.  9/11",
            "review_score": "1"
        },
        {
            "review_text": "I've spent 7 hours playing and another 7 hours masturbating.",
            "review_score": "1"
        },
        {
            "review_text": "First person dungeon crawling with plenty of fanservice to keep you going. Pretty character designs, with a handful of yummy ample bosoms. A capture system so that cute enemy you were after you can make her your slav... comrade.  Outfits! Of course what better way to enhance the fanservice. .. i mean game... boobs.. ... ok theres a lot of boob and butt shots... Its great.. story.. yeah i guess there is one.. But seriously anime boobs plz...   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Oh my, whats in this random chest in the dungeon? Oh, it's two bikinis. Let's put them on because this game knows *exactly* what it's doing.   Combat system is passable, dialogue is pretty good. Each obtainable character has a unique line of dialogue to comment on each minor dungeon event, so a lot of work put in there.   Came for the ecchi, stayed for the ecchi. 10/10 would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Great game ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, enjoyed every bit of it, a bit too much I guess. Old-school dungeon crawler, where you need to capture girls and improve your party. This game has a lot of great features apart from being able to collect almost every sexy girl in the game. Every character has its own personality and most of the dungeons are unique and have interesting easy puzzles in them. 'Pokemons' themselves can get a little repetitive, but it is not a big deal, more = feel better! All this is accompanied with an awesome soundtrack! I just love it. The only disadvantage is: no voice acting. Apart from that it is a very good game with a catching story, but I am sure you are not planning to buy this game because of the story.",
            "review_score": "1"
        },
        {
            "review_text": "Can get a little grindy here and there, but overall, I'm impressed. It feels like they actually put substantial work into this game. One of the best parts is that your random party members will comment on different events, granting the illusion that they are actually living party members instead of just some pretty sprites. Art is awesome, the music can get downright gorgeous, and the combat is fast-paced and fun; though those wishing for some more strategy will be dissapointed.   Either way, definitely a good grab, though a little expensive. For 10-15, I would suggest it 100%. For 20? Mmmm... depends. For me, definitely worth it. Anime waifus galore are worth all the moneys :3  I really hope that they make another game, albeit with more features and such, in the future. I would definitely be willing to buy more from this series... and please, no more hack Sakura VNs... do more Dungeon! And more cat girls! :3  P.S. My congrats to the writer of the two main characters, fyi. Yomi is especially likeable and fun. Very good job.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Despite the repetitive nature of the gameplay, the design and UI prevents it becoming tedious. Plot is relatively predictable, however artwork exceptional and soundtrack: no issues. Delivers on its promises and has a lot of content to offer. Enjoyed that the gameplay and battle focus has a reasonable depth to it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm an OLD SCHOOL dungeon crawler guy, and I find this game a really nice suprise. Yes its got half naked anime girls, and anime humor but it stays fun and keeps to a dungeon crawl feel and playstyle. If you're a fan of dungeon crawl style games and women, you'll probably enjoy the game and its sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "If you like dungeon crawlers and ♥♥♥♥ you will like this one",
            "review_score": "1"
        },
        {
            "review_text": "First, I think the Sakura series is mainly VNs? This says that it has VN elements, and that's not entirely false, but this is not a VN, in my opinion. Just being a game with story in the form of lots of text doesn't make it a VN in my book. If that were the case, every final fantasy game I've ever played would be a VN. So if you're looking for a VN (which I wasn't), don't look here.  Even with the 18+ patch, the game isn't really fapping material, in my opinion. I bought this game because most of the helpful reviews were along the lines of 'got it for the ♥♥♥♥, but it's a good game anyway.'  It's a half-decent RPG, and while every character has almost the exact same body type as every other character, the art isn't that bad. I was surprised that I found myself interested in the story. I've been considering starting a playthrough on one of the easier difficulties just to blast through the story, but even without it, it's an enjoyable pokemon-meets-final-fantasy battle system with a charming dungeon perspective that reminds me of older '2.5D' dungeon crawlers like TES: Arena.  If anime chicks simply being naked (or half-naked without the patch) is enough to get you off, or you enjoy battle systems like this one, or character-centric story, this game is for you. Honestly, two out of three of those things is enough to keep me from uninstalling.  One final point: Controller support. It's not the best, but it's certainly good enough to play in bed. Everything works. I haven't played this game with KB+M at all because I mainly play it for some mind-numbing RPG gameplay (I play on Abbysal which is basically grind-hater's hell). The only things they could have done better are tutorial messages and button count. In the beginning, navigating the dialog was very confusing for me, and there was no explanation of how to do so. (This may be in the player's manual, but I am not going to read a player manual in 2016. We've moved past this as an industry.) Also, in battle, most of the controls were explained, but not all of them. I had to figure out how to chage targets on my own via trial and error. Finally, some of the menues have way too many highlightable elements for controller, and it could easily be improved by treating the sections of the menu as submenus. Highlight a section, press A, navigate section. Press B, highlight another section, press A, navigate. Everything can be accessed in it's current state, but it's very slow in these menus.  Other than my minor criticisms about the character designs and controller support, it's a decent game to fall asleep to.",
            "review_score": "1"
        },
        {
            "review_text": "I finished the game in under 3 hours, I believe I have the world record time right now :p",
            "review_score": "1"
        },
        {
            "review_text": "Fun dugeoun crawler, also has aspects of other games. Pick it up if your interested, or when its on sale",
            "review_score": "1"
        },
        {
            "review_text": "My right hand is pretty sore.   The game had a similar style of gameplay like Pokemon, which is why I liked it. And the plot was pretty good. ( ͡° ͜ʖ ͡°) Yo fam, go get dat patch, for the glorious nudity 8^)  Do you recommend this game? ♥♥♥♥ yes I do ",
            "review_score": "1"
        },
        {
            "review_text": "like pokemon but with t1tz. Get the patch.",
            "review_score": "1"
        },
        {
            "review_text": "I did it for the vine.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok. The gameplay could use some improvement too; it's not very challenging.",
            "review_score": "1"
        },
        {
            "review_text": "It's Good ",
            "review_score": "1"
        },
        {
            "review_text": "Hate to admit it, but I love this game.  Highly recommended 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)                    It was a good game.                     ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I just play it for the plot....",
            "review_score": "1"
        },
        {
            "review_text": "'The perfect blossom is a rare thing. You could spend your life looking for one, and it would not be a wasted life'",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°) The art in this game is astonishing ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "I friend gifted me this game. Now I want to die. Anime is for ♥♥♥♥♥♥s. ",
            "review_score": "-1"
        },
        {
            "review_text": "its ♥♥♥♥ the dungeon crawler not much else to say about the game",
            "review_score": "1"
        },
        {
            "review_text": "Recommended, but only if it's on sale - Don't pay full price for this game.  Recommended: Additional Dialogue  Optional, but recommended: De-censoring patch, Abyssal Makeover Mod  So as the review says, this game has an interesting clothes tearing mechanic (Which affects both heroes and enemies), though it doesn't really reach its full potential unless you go find the de-censoring patch. The battle mechanics get kind of stale pretty quick. Sure, there's new monsters, but for the most part, everyone uses the same handful of abilities., just with stronger stats. Minus points for non-hero characters - none of them can learn additional abilities unless you teach them with scrolls (Occasionally found or dropped by defeated enemies)  The music in this game, I pretty much muted it after the first few floors. The random encounter theme is ok, but gets extremely annoying extremely fast hearing that tune more than the dungeon themes... as you get into battles after a handful of steps. For this reason I just threw on my own music on shuffle wandering through the maps..  There were some funny moments and the ce-censoring patch adds some 'Bonus content' that can't be posted to Steam.  Overall though, I can't justify anyone paying $20 for this game. If you're looking at this game and it's on sale, consider it if you're a pervert.  If you're looking for solid RPG mechanics, either get this game and play it with the Abyssal Makeover Mod, or go find another game that will serve your needs better.",
            "review_score": "1"
        }
    ]
}