{
    "app_id": 407340,
    "name": "Strawberry Vinegar",
    "release_date": "2016-01-05",
    "developer": [
        "ebi-hime"
    ],
    "publisher": [
        "ebi-hime"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Adventure"
    ],
    "achievements": 28,
    "positive_ratings": 90,
    "negative_ratings": 4,
    "price": 6.99,
    "description": "&quot;Feed me, or I'll reap your soul!&quot;And with those ridiculous words, my whole life was turned upside down.Sakuraba Rie, aged nine, is a cynical and grumpy girl who cares little for her fellow classmates, and does not have a single friend.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407340/header.jpg?t=1534287843",
    "minimum_requirements": "OS: Win XP+ Processor: 1.2 GHz Pentium 4 Memory: 512 MB RAM Graphics: DirectX® 9 Compatible Graphics Card DirectX: Version 9.0c Storage: 1 GB available space Sound Card: DirectSound-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " A review copy of this game was provided by the developer, but has not and will not, in any way, affect this review.    Overview:",
            "review_score": "1"
        },
        {
            "review_text": "This game is arounf 4-5 hours long. Depending on your reading speed, really. Also it doesn't have a serious plot but instead gives you a sweet, fluffy, heartwarming and charming story of two cute girls who gains friendship and eats lots of nice looking food.   Artwork is very nice, it gives you lots of CGs, although most of it focuses on the dishes itself as a warning. I definately recomend this for people who wants to read something lighthearted yet engaging.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me hungry and showed me cute lesbians. It was basically Koufuku Graffiti, which is cool I guess 9/10 would fail at cooking any of this ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "More humor and less food than I expected from the descriptions.",
            "review_score": "1"
        },
        {
            "review_text": "The single most adorable thing on Steam the end.  Strawberry Vinegar is fairly short, taking only a few hours to reach the good ends. While not long, it is stuffed full of beautiful art, cute characters, delicious food, and good feels. I caught some bad ends early on and while that could have been frustrating under most circumstances, the way they were delivered made me realize that I had to think about how my character would act for each choice, as a gloomy reclusive 9-year-old girl. That realization helped me feel more invested in the characters and in guiding them well.  The CG art is beautiful and plentiful, featuring some of the most beautiful hand-drawn renders I have seen. The character sprites are expressive and varied. The music, while it doesn't stand out, suits the scenes and events perfectly. The characters themselves are interesting and engaging, although they may not be as easy to identify with for someone not familiar with anime tropes.  I chose to play one game 'day' per real day. This made the individual play sessions no more than an hour, but each day as work wound down I found myself looking forward to getting home so I could play again. I do strongly recommend this game.  However, despite the high production values, at a release price of 10USD I feel the game would be better served listing a few dollars cheaper, due to its brevity. My second recommendation is to wishlist the game, and buy it as soon as it receives a discount, because the experience it delivers really is very very good.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game to pieces. It's a nice little game about a nine year old girl, far too mature and cynical for her age, who gets forced into cooking for a little demon. The writing is great, providing both charming characters and fun humor, as well as descriptions of food that makes you want to try eat the screen. As a slice-of-life VN it works really great, and the epilogues were surprisingly rewarding. (Wish there was more epilogue, I want to see even more of that romance.)   One thing I personally would want to highlight is the parents of the main characters and the relationship they share. The mother and father are living in a BDSM relationship that seems to impact every aspect of their everyday life, something their daughter notices and reflects on. The father is really submissive, and basically functions as a cute housewife living to serve his mistress. The childs perspective on their parents BDSM relationship is really interesting in itself, and her insight provides some character growth to her parents. I really wasn't expecting this from a yuri VN that seemed to only be about fluff and food, but I adored what I got.  One of my main personal negatives would be the age of the main characters. With characters as young as nine years old I found it hard to relate to the romance. However, with them both being far too mature for their age it never felt like they were as child-like as you would expect children who actually were nine, so that could really help those of us who have a hard time relating to romance between kids. (And the epilogue is fantastic, which totally helps. Did I mention the epilogue being good?)  (For anyone ever planning on making their own game like this:) The user interface can't seem to decide on whether to call the settings for 'Preferences' or 'Options'. This is a minor problem with a minor fix; having consistent naming for screens and tools in UIs generally makes using it flow more smoothly for users.",
            "review_score": "1"
        }
    ]
}