{
    "app_id": 407680,
    "name": "Last Days of Spring Visual Novel",
    "release_date": "2015-10-07",
    "developer": [
        "Sapphire Dragon Productions"
    ],
    "publisher": [
        "Sapphire Dragon Productions"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Visual Novel",
        "Indie",
        "Casual"
    ],
    "achievements": 9,
    "positive_ratings": 64,
    "negative_ratings": 41,
    "price": 2.09,
    "description": "Last Days of Spring is a YA (Young Adult) Otome Visual Novel following a group of high school seniors in their last week of school as they come to terms with questions about love, life and destiny. Follow the steps of Yuka Kishimoto as she navigates across her final week as a high school student and sees her life come to a complete...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407680/header.jpg?t=1541991990",
    "minimum_requirements": "OS: Microsoft® Windows® Vista / 7 / 8/ 8.1/ 10 Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 1 GB RAM Graphics: Integrated Graphics Chip DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Microsoft® Windows® Vista / 7 / 8/ 8.1/ 10 Processor: Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory: 1 GB RAM Graphics: Integrated Graphics Chip DirectX: Version 9.0 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I bought this game for iPad a couple of months ago and was pleasantly surprised to find it in the 'Shopaholic Bundle 3' and am super glad to have it on both devices.  When I bought this game I was expecting your typical anime high school plot but boy was I surprised! This turned out to be an incredibly well thought-out and rather beautiful work of art. With a beautiful storyline, enchanting music and unique art style I was swept away into this world and really could see myself in the shoes of each character.   More of a kinetic novel than a visual novel as there are only a few choices sprinkled around but definitely insanely good vale for it's price!  Loved the story so much, I decided to read it again as it had so many inspiring and heartwarming moments.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "As I was playing this I bounced back and forth deciding if I should recommend it. While it is not a bad visual novel, ultimately I can't recommend it.  Music - The music is peaceful and relaxing but nothing memorable.   Graphics - The art is typical quality visual novel art. I didn't find most of the character visually appealing though. I also really disliked how the characters were essentially paper cutouts randomly pasted on a photo background. That being said, many of the backgrounds were quite nice.   Message Speed - Though you could click to fast forward, I prefer being able to configure the message speed before I start playing. This visual novel didn't give you that option. You could activate skip mode, but that's really not needed if you save in the correct locations.  Save Slots - Seeing as how most choices didn't matter, you had more than enough save slots. The game even told you when to save to get all the endings.  Achievements and endings - There are multiple endings and easy to complete achievements. Provided you follow the guide and save at the right points, you should be able to easily finish in under an hour. In fact only your last choice matters for the endings.  Story The visual novel tells the story of a group of student's last week in school and their days leading up to the 'sunset festival' (which is basically a traditional hook up day). The story started very dry and dull in my opinion but the middle was much stronger as your character talked to the various 'romance options'. The game even mixed in some seriously good advice about a person's future.  I found the Father - Daughter trip and talk particularly moving and think that many people could benefit from a relationship like that.  Unfortunately the endings were short and rushed. If they were better developed and fleshed out more, I probably would have rated it differently.  TL;DR - This VN had potential, but really needs the story to be fleshed out more.",
            "review_score": "-1"
        },
        {
            "review_text": "positives it has ok music   what i dont like it doesnt draw the photos it uses rea photos and the drawlings are just ew its so short  the 2nd game last days of springs 2 is cool again it doesnt draw the background but it has butiful drawlings",
            "review_score": "1"
        },
        {
            "review_text": "“A piece of philosophical, intellectual and introspective writing rarely seen in video games particularly in a VN. Get it now.  P.S. The soundtrack is absolutely gorgeous.“",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "Last Days of Spring is a Visual Novel where you play as Yuka Kishimoto during her last week of high school. To be honest, I wasn't expecting much from this game to begin with, and I got exactly that.  The only real good of the game was the character artwork, but even that has some flaws: every character only has one pose, so no matter what you're talking about or doing, they're always standing there smiling at you. For a game whose content is literally only artwork and story this is a cardinal sin. At the very least, every character should have some kind of reaction shot or two to better convey their emotions, especially since there isn't any voice acting.  Otherwise, the story itself was mediocre. While it has the feel-good lesson of 'follow your dreams', the dialogue feels unnatural at times (especially from Yuka's father), and the choices you make throughout the game don't actually affect anything. The only choice that actually changes anything is whether you'll walk to school or ride in the car, and the choice at the very end where you're able to pick the person you want to spend the Sunset Festival with. The game even warns you to save so that you can experience all of the endings.  Unfortunately, the endings themselves are very lacklustre, you get a few lines of dialogue either about love or friendship, and that's it.  If you want an easy 100% achievements or trading cards, go ahead and buy the game for less than $1. Otherwise, stay away.",
            "review_score": "-1"
        }
    ]
}