{
    "app_id": 407780,
    "name": "Lethe - Episode One",
    "release_date": "2016-08-01",
    "developer": [
        "KoukouStudios",
        "Faber Interactive"
    ],
    "publisher": [
        "Faber Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Action"
    ],
    "achievements": 19,
    "positive_ratings": 222,
    "negative_ratings": 27,
    "price": 11.99,
    "description": "Lethe is a first person adventure with survival horror elements. Explore an atmospheric and frightening world and uncover the dark secrets of your origins.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407780/header.jpg?t=1492160011",
    "minimum_requirements": "OS: Windows XP SP3 (32-bit) Processor: 2.0+ GHz Dual Core Memory: 2 GB RAM Graphics: 512 MB VRAM and Shader Model 3.0 DirectX: Version 9.0c Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 10 (64-bit) Processor: 3.0+ Ghz Quad Core Memory: 4 GB RAM Graphics: 2048 MB VRAM and Shader Model 4.0 DirectX: Version 9.0c Storage: 2 GB available space Additional Notes: 32-bit executable",
    "reviews": [
        {
            "review_text": "I have now finished episode 1 and decided to edit my review.  'Lethe - Episode 1' is a game very similar to the style of 'Amnesia - The Dark Descent', meant in the best way possible. It has a great emphasis on (minor) puzzle solving and has a 'hide and seek' style gameplay identical to Amnesia. The controls also feel natural as you explore the levels, and the physics are pretty good except for a few times when you have too many objects together in one place (things might bounce around a bit when trying to get past them).  The graphics are exellent and the creepy, near perfect atmosphere puts you in the proper mood for this style of game. If you decide to read the notes that are spread out through out the levels, you get a well written story that helps piece together the reason behind much of what is going on around you. If you decide not to read the notes, then not so much.  HERE IS WHAT PUZZLES ME! The game does say 'episode 1' which might alarm some people. I have read other reviewers claiming that the game is 7+ hours long, but personally I managed to finish it in about 3.5 hours. I explored everything and didn't rush through the game AT ALL! So I'm EXREMELY puzzled that most reviews have so many hours of gameplay??? I even went back into the game and replayed the ending to double check that I didn't exit the game pre-maturely... but no I did finish it :/ So unless other reviewers has left their game paused for long periods of time, I got no clue why they have so much game time.  So do I think the game is worth $15-17 even with only 3 hours of gameplay...? Absolutely! I don't think you will come across a better indie horror game this year (especially considering all the bad indie horror games that has been released the past many months).  Can't wait for episode 2! :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a FANTASTIC game -- if only for the atomosphere alone.   To me, the storyline could be a bit more clear, but that's okay because I expect to learn more in Episode 2 when it's released.   Love the similarities to 'Amnesia: The Dark Descent' -- but don't think that just by not looking at the spectres that they're going to overlook you. I wouldn't say it was too close to the storyline through.  I loved the music -- but then I turned it down, because in a game like this, to be able to hear every footfall is important.   Sure, it was bloody and gory, but not nearly as bad as Outlast (which probably goes for most games :) )  The length of play was extremely surprising for being an episodic game. Took me a few days to finish and some of the puzzles were quite challenging. I'd go look up a hint and go 'OHHHH' because the answer had been staring at me in the face all the time.   I would like to see MORE of the ghosts in the game though. I figured out I could hide from them early on and then they'd go away so I didn't have to deal with them as much.   I would ultimately give this game an 8/10, taking 2 off just because I wanted more monsters :)   DEFINITELY BUY THIS GAME and then leave a review so the devs know there's a dri8ve for an Episode 2!",
            "review_score": "1"
        },
        {
            "review_text": "Finally finished this game after little over 11 hours. Was it worth the price? I believe so. I easily got $16 of fun out of this.   It probably took me longer than others because I ended up needing to wait for the Devs to add the improved brightness sliders and more save points. I couldn't see anything in the game(black screen everywhere I went). I also had a problem with the save points before they were fixed. The monster hits VERY hard and you can get two shot if you're not careful. With the original system, you could lose a boatload of progress when you died and that wasn't fun. It's much better now!   I really enjoyed the story and the atmosphere as well as the puzzles, though I needed a little help on a couple. :P  I'm not sure about replayability as there isn't really much reason to explore aside from collecting notes or potions and most of those are gotten on your first playthrough. I think I would dust this title off again if I were doing a marathon playthrough of all the episodes. But there needs to be an episode two for that. Hopefully more folks support this team so they can get the ball rolling on the next one.   Grats to the Devs on a job well done and I look forward to the possible future Lethe: Episode Two!  ",
            "review_score": "1"
        },
        {
            "review_text": "What stood out to me most is the level design and how it's laid out. At first it feels like a set of confusing labyrinthine tunnels, but once you progress through each area you come to realise it's actually very smartly put together. It's linear in the direction you must go, but the way it twists and turns, and how you come to areas you could previously only see, and how puzzles are implemented, all adds up to giving the player a great sense of immersion and is also satisfying to complete each area. Couple that with the terrific atmosphere and depraved setting; it all works extremely well and will keep you compelled to finish the game.   My only suggestions would be to add a lean function for the player so you can peek around corners and objects. There were a few times I was instantly spotted and then killed when I was simply trying to look around a corner - a lean button would fix this. And I also think giving the ability to hide under tables, inside lockers, etc, just generally more interactivity within the world could add more depth of gameplay for when dealing with monsters.",
            "review_score": "1"
        },
        {
            "review_text": "Great",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Penumbra or Amnesia series, this is definitely for you ! - Great Atmosphere - Pretty simple puzzles - Health and Stamina bar - You can eat food and find some stored food to use when needed (max 5) - Collect pages in each level which reveals the story, which is amazing aswell - Physics are funny sometimes, you walk against a chair and it flies away - Must have if you enjoy this genre",
            "review_score": "1"
        },
        {
            "review_text": "Amnesia: The Dark Descent but it's in a mineshaft instead of a castle",
            "review_score": "1"
        }
    ]
}