{
    "app_id": 407720,
    "name": "Poker Pretty Girls Battle: Texas Hold'em",
    "release_date": "2015-10-21",
    "developer": [
        "Zoo Corporation"
    ],
    "publisher": [
        "Zoo Corporation"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Anime",
        "Card Game"
    ],
    "achievements": 0,
    "positive_ratings": 64,
    "negative_ratings": 72,
    "price": 6.99,
    "description": "Come and play at the Pretty Girls Casino! Select from 16 sexy girls for your poker battle. Featuring popular Texas Hold'em rules.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407720/header.jpg?t=1447378337",
    "minimum_requirements": "OS: Windows 7/8/8.1 Processor: 2Ghz Memory: 2 GB RAM Graphics: DirectX compatible DirectX: Version 11 Storage: 1 GB available space Sound Card: DirectX-compatible sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The H-game characters designed by Ayase Hazuki and Ishii Akira lend themselves out for yet another entry in the Pretty Girls series. This time, they bring a much more familiar game to the table: Poker! The joy of understanding this game quickly faded after playing a few rounds against the AI though. Pot commitment is the biggest thing it completely lacks in my opinion, which results in some very unrealistic and derpy moves.  If you ask me if I would prefer playing poker against sweaty men or pretty girls I would choose the latter, but when the AI can't even get the core of the game right there's pretty much no reason to play it. Unfortunately the game devs aren't known to add major changes to their games after release (example: not adding a proper tutorial to the Mahjong games which the majority of players asked for), so I'm afraid that this game will also end up not being played after extracting the Steam cards from it. However, if the AI does improve in the future then I will change this to a thumbs up review.  Current verdict: Stick with the sweaty men. XD",
            "review_score": "-1"
        },
        {
            "review_text": "First time i play texas hold'em rules and i must say that's not my favorite poker. But the main problem is : the game is slow and it's impossible to change the pace. And the AI is stupid. But sexy poker are rares, so...",
            "review_score": "1"
        },
        {
            "review_text": "Here's the how to win tip. All in the first chance you get, if lose keep retrying.",
            "review_score": "1"
        },
        {
            "review_text": "bishoujo girls and a poker game. The card duels are fast paced, it's a no stress kinda game. What you see is what you get, so if that sounds fun to you give it a shot",
            "review_score": "1"
        }
    ]
}