{
    "app_id": 407810,
    "name": "Hard Reset Redux",
    "release_date": "2016-06-03",
    "developer": [
        "Flying Wild Hog"
    ],
    "publisher": [
        "Good Shepherd Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "FPS"
    ],
    "achievements": 115,
    "positive_ratings": 772,
    "negative_ratings": 181,
    "price": 14.99,
    "description": "Hard Reset Redux is an action-packed and hardcore single-player shooter which embraces the best qualities that the genre has it offer. It includes over-the-top destruction, loads of enemies, great weapon variety, a challenging campaign and a beautifully realized cyberpunk setting.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407810/header.jpg?t=1535471879",
    "minimum_requirements": "OS: Win 7 or Later Processor: 2.5 GHz Intel Pentium 4 / AMD Athlon 64 Memory: 2 GB RAM Graphics: 512 MB NVIDIA GeForce 8800GS / ATI Radeon HD 3870 or better DirectX: Version 9.0c Storage: 5 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "You know what's funny? As soon as i started playing the game, maxing out every setting available, i was amazed by two things, the first one being the fact that the game ran pretty darn well, and the second one being the fact that the game looked a little bit poorly, even from memory of having played the original Hard Reset a couple of weeks ago, i could tell there was something wrong about the textures, they look... just... Muddy.  My fears were disregarded by a wave of hand coming from my head until i actually saw a comparison video on youtube about the game missing crucial things to enhance it's graphical fidelity, things like ambient occlusion, things like reflections, and lighting, or in my case, even the textures, i don't know what was the reason behind this 'downgrade' but it's a sad thing that you keep announcing this game as a 'remastered edition' from the original when in reality all that it does is add one new weapon, which i haven't even found yet, as well as a couple of small gameplay changes, like the dashing from Shadow Warrior for example.  What's the point of remastering a game, to downgrade it's graphics in the first place? I'm not even asking for better graphics, but what you're basically charging me for it's to play the game with only one new weapon, one new dashing move, a couple of balancing changes, and that's it, i hope to see some kind of patch, or something that at the very least brings up the graphics up to par with the original release.  The original, as well as this one, are great games, but when you're remastering something, the whole idea behind it it's to make the product in question better, not worse in any way, i don't understand... Maybe it was an accident... Who knows?",
            "review_score": "-1"
        },
        {
            "review_text": "Hard Reset Redux is the revised version of Hard Reset, a game released in 2011. The differences between both games are not too big. The developers added a katana to the weapons and zombies to the list of enemies. The level design remained the same. The most important difference is the difficulty. Hard Reset is considered a very hard game. Redux is far easier and allows for an 'insane' play-through which was almost impossible before. Like it's predecessor Hard Reset Redux is a very enjoyable single-player shooter that looks great and runs very smooth.  Pros: - nice graphics - fast, hectic fighting with very aggressive enemies - good level design - very interesting weapon design. Your weapon is rifle, shotgun, rocket launcher, grenade thrower and mine thrower at the same time. - old school shooter  Cons: - story - some achievements seem bugged",
            "review_score": "1"
        },
        {
            "review_text": "Never owned any previous version of Hard Reset, I wasn't impressed by the demo a few years ago, but having Shadow Warrior on my account gave me a nice deal here, so an initial 10 hours for €3 ain't too shabby, not one bit broseph.  First off, I don't like shooting robots and with the risk of sounding like an insane person, I prefer flesh over metal. But it's not a kid's game, it's pretty challenging in fact, even on Normal and not necessarily for the right reasons. Hard, Insane and Hero mode await those who are hungry for more. If it weren't for the quicksave option, I wouldn't have even considered it. An old school shooter with autosave only is a very bad mix, unless there's one around every corner, so avoid the Extended Edition. Speaking of 'old school', Hard Reset doesn't have crouch and for a game that has plenty of secrets, that seems like a gross oversight. Dash mode helps with getting to tougher spots, but it's hit or miss.  Story has never mattered in games like these and at one point those comic book slideshows with voice overs will eventually run out and then you'll just see loading screens between levels until the end of the game, when it's time for a final cutscene. Someone did something they shouldn't have and you're there to clean up their mess. Kill everyone in sight, end of story. I also shot the cleaning robots. They moved.  There are technically two weapons (with upgrades), three if you count the Katana, which isn't very practical here, but it's there if you need it. Weapon modes are nice, making up for the lack of guns that look different on your HUD but serve the exact same purpose. It takes a while to upgrade them, for the game to actually start getting fun and it wouldn't surprise me one bit if you don't get past the first 2 or 4 hours. There's nothing special about this game but I finished it, so there must've been something that tickled me. RPG and Railgun were my two preferred weapon modes, while environmental damage did the rest.   Hard Reset Redux is a serviceable FPS with 115 achievements, annoying enemies and tight spots full of explosives. Why is it that small non-human enemy types are usually goofy, clumsy and make silly noises? What's the psychology behind that design? Is it scary when you're swarmed by hordes of critters with sawblades, propellers and bombs? I suppose, but why do they remind me of children or circus folk? Why do the small guys in the Halo games behave like idiots? Remember manhacks in a game called Half-Life 2? Well, I didn't get that sense with those things or any other enemy for that matter. All of them scared the ♥♥♥♥ out of me and I wasn't thinking of children or circus folk. Is it the 'people are scared of clowns' or Children of the Corn thing at work? Well, it's not working, they're just annoying. Get this game on the cheap side, just in case.",
            "review_score": "1"
        },
        {
            "review_text": "Like Doom? Like Shadow Warrior?  no &gt; then dont buy it  yes &gt; then buy it  Its just mindless action - superb graphics - The setting for the story is really really good with great attention to detail in creating a cyberpunk world - really good destructible environments that can be used to kill enemies - Pew pew pew  btw i borught this on sale for less than £4 so absolute bargain  actually i have to add after having hammered this game for a good few hours now - this is an awesome game. The views in some places will blow your mind and the weapon seletion is cool and I like how they have simplified everything into 2 types of ammo then add to this destructible environments and you have a winner. The boss fights are good old Grindfests against HUGE bosses and satisfying when you win.   It also hasa great story which might get lost on some people - its a very hard sci-fi plot told in comic book cut sequences with great voice acting but if you loved movies like bladerunner and the matrix and you like games like Doom and Shadow Warrior you cant go wrong with this. Just dont play Hard Reset. play HARD RESET:REDUX. it is a shame that the bonus content has not been reduxed - would love to play it -  lol this game is so good i am replaying it on insane difficulty now - havent played an fps that I loved this much since quake came out :)",
            "review_score": "1"
        },
        {
            "review_text": "Just a great old skool shooter  Nice weapon system with upgrades  You need to find your way around the quite large levels the game doesn't hold your hand with mini-maps or a pointer it makes you think a bit about where you need to go &amp; what to do next  The game looks fantastic runs super smooth  Any FPS fan should get this  ",
            "review_score": "1"
        },
        {
            "review_text": "Cons: -awful, nonsensical story -short campaign (my first playthrough on normal took me 6 hours) -weapon upgrades felt kinda same-y  Pros -gunplay is a lot of fun -the world is what you would expect from a dystopian future  Would recommend if you can get the game heavily discounted.",
            "review_score": "1"
        },
        {
            "review_text": "Got it on sale for $3.  At this price it was an amazing value.  Things to know 1. The story does not make sense 2. This is a pretty decent shooter with tons of stuff to blow up every level 3. No really, every fight you'll see explosions or arcs of electricity 4. The story does not make sense  If you like old school FPS that don't use a lot of the cover mechanics ingrained in today's shooters I recommend it. I'll warn you just one last time. Play it like there's no story, try not to listen to the story. Story bad, shooty mechanics good.",
            "review_score": "1"
        },
        {
            "review_text": "This review is based on the game's status as of September 11th, 2016 (4 months after release).  Just some general information and opinions on Hard Reset Redux: This is not a gameplay/ story review. It is simply a technical comparison to the original.   Performance:  Below is a comparison of my min-max fps in the starting area from the original to the redux. [This is on a GTX 970 GPU and FX 8370E CPU at 1600 x 900 resolution and on max settings with the highest FOV] Original - 65 to 85fps Redux - 205-295fps Redux (200% render scale) - 120-140fps This fixes a problem I had in the original where certain areas ran below 60fps.   Graphics:  - You can't choose how much FXAA to apply anymore and they do not tell you for some reason) - Anti-aliasing has been added to the main menu icons and background so now everything looks smooth. - Less radial/zoom blur, which you can still disable. - Ambient occlusion is of a much higher quality and that's very noticeable in the menus right on startup.    Noticeable changes (in addition to the 'about' section):  - In addition to adding Shadow Warrior's dash (to sprint) ability and Katana, they added some other options from Shadow Warrior as well, including weapon inertia, which is customizable. - FOV change does not scale the viewmodel anymore and the viewmodel is positioned closer to the right and is even closer to the player than the original on the lowest FOV. - Raising the FOV does not angle/ zoom out the HUD and tilt the weapon angle. - Raising FOV causes a lot less of a 'fisheye' effect, making it a lot easier for sensitive players, such as myself, to play and enjoy for extended periods of time. - Better sprint animations. - Unlimited dash and sprint. - Changed to a font that is much easier to read. - Fast menu is on by default and you can't disable it. - Menu icons are larger.   Additional Notes:  - The .ini can barely be edited, if at all. If you try to raise some settings a little too high or too low, the game will just disable it. - I noticed that starting a new game on the original overwote my only other save game. This does not happen on the redux so feel free to create as many save games as you want. - Sucks that this isn't free to those who own the original, but it is 85% off for y'all, so I'm not complaining. - This game feels more like Shadow Warrior and I love it. - This is so much better than the original if you ask me.",
            "review_score": "1"
        },
        {
            "review_text": "They say it doesnt look so well, I say at least it plays well now. Great game, I enjoy it, even 5 years after original release.",
            "review_score": "1"
        },
        {
            "review_text": "Big Dumb CyberPunk Fun!   Love playing this game, makes me feel like I am inside of the brain of a young and mischevious Phillip K. ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "its worth it. totally.",
            "review_score": "1"
        },
        {
            "review_text": "I really got frustrated with the original hard reset. On easy it was just a face roll but on normal difficulty the enemies were just bullet sponges.i gave up after a few hours. With the addition of the dash, run and rebalance with the Difficulty I'm actually enjoying this game.  If you played the original then pick it up on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is your classic run and gun shooter. It's fun all the way through. The game is split up into 12 30+ minute levels. The gunplay is amazing, and so are the upgrades to the guns. The game always ran smoothly on high quality on my GTX 750 rig. If you've played the original, I don't really see a need to pick this up. If you haven't, this is a must play. You move fast, you shoot fast, and the enemies move fast. Your blood will always be pumping when playing this game. I don't know what else to say except go play this game right now. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Runs at about 250-500 fps, a MASSIVE upgrade over the first game. Looks/feels great, new enemy locations and spawns are awesome. Just like the huge shadow warrior update they made this game even better! &lt;3 Flying Wild Hog!",
            "review_score": "1"
        },
        {
            "review_text": "If you can't afford the new DOOM buy this! Got it dirt cheap and its fantastic! Can't believe I've missed it when it came out originally. Thanks for the Redux.",
            "review_score": "1"
        },
        {
            "review_text": "I'd say the game is so-so overall. I disliked the original when it came out but I loved Shadow Warrior, so I decided to give this a chance. For me the game plays much better than the original. I love the new dash mechanic (when my head doesn't bounce off the ceiling causing a fall damaged death, it's not well implemented) and the enemy encounters feel more balanced and less frustrating. More flying enemies makes fights more interesting. I definately recommend cranking the difficulty as Normal makes the enemies dish out little damage. Though considering the frustrating level design in the late game, I was perfectly fine playing on Normal difficulty.  As far as the graphics go, whether they look better or not is subjective. My issue with the original was that the effects and bloom and what-not obstructed my view and made enemies hard to see. I do not have this problem with the Redux, so they are improved as far as I'm concerned.  Unfortunately many of my issues with the original are present, as well as issues I had with Shadow Warrior. The weapons lack punch and aren't exciting to use, but that's not my biggest issue with the weapons. So many weapons are redundant. For example the Blaster has better range and spread over the shotgun, and seems to do more damage up close. I feel like the NRG and bullet gun could have been combined and overlapping weapons could have been cut. As far as the sword goes, it's fun in a silly way, but after the second half of the game the enemies deal too much melee damage for it to be effective. Oddly enough the bulkier enemies can be shredded with the sword if you time your dashes, but only if you have a lot of room to move.  In the last game I found the levels lacking. They can be hit or miss. For the most part I find them too flat with less height variation than Doom, just like in Shadow Warrior. Unlike Shadow Warrior, I found the levels way to samey and I was occasionally lost dispite the smaller and more linear levels. Many levels have sections and rooms that repeat. There's few markers to indicate progress and variation. Even dead bodies blend in with the junk. Level flow isn't great either. The open arena like sections can be interesting with all the envirormental hazards, especially with the enemies more fragile this time around. It's just ashame that the weapons couldn't be more exciting.  It's old school, but the game is more than generous with health and ammo packs. So no starvation AND no health regen is a huge relief. There's a regenating shield a la Halo, but whatever. I would have liked more old school features like automap, but I only got lost a few times.  I changed my review to Not Recommended because the third act is just awful in level design. I found myself constantly in claustrophobic stretches where I might get pinned against a well. It's frustratating and not well laid out. Everything up to the first boss battle is great, but man did it tank after that. This is kind of typical of shooter games as the end game content is usually the least polished.  The new version also has some signs of consolitis. Whenever the slo-mo upgrade is activated, my mouse speed doubles. Coupled with the adrenaline of having low health, I can't aim worth at damn when I need precision the most. The zoom function also changes sensitivity. This is a massive oversight and signs of an outsourced port. Hopefully this gets corrected.  I'm still slugging my way through the game to beat it. It's not very good, but as I said in my previous review most games are worse. If you play every shooter out there, then give this a go. If you're selective, don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "An Awesome Game To Spend Time On !  Get Your Mlg Skills Ready Cause It Is Time To Rek Some Robots !  This Update Kinda Thing Is Better Performed Than The Previous Game Development(Graphics,Performance,FPS,Shadows And More...)",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay's fine. You get experience points to make your gun do different things, and you shoot the robots, and it's whatever.  If you like story in your games, this one is completely asinine. You play a Corporate Cop in a cyperpunk city who has swear words and tryhard bitterness instead of a personality. When he isn't confused, he is complaining. At no point is it clear exactly what's going on, or what you're trying to do - even though it is not presented as a mystery - and at some point even the setting itself becomes unclear, not because of any plot-twist mindscrewery, but because it seems like the writers can't decide.  It's said that you're all personalities in a data matrix or whatever, but you're at war with machines with people struggling on the outskirts of the city. Then cyborg zombies start appearing and literally no one remarks on this as shocking or unusual, or even as a known phenominan. Just when it starts to seem like you're definitely in a real world whose technology is being hacked by a robots, a public monument statue comes to life and gains ballistic weaponry because of a virus.  You're implied to be some experimental messiah, and then they just sort of forget about that. It's stated outright that the Corporation isn't part of some conspiracy with the robots, but then they start trying to kill you because you don't report in after someone tells you you're cyber jesus. Then you (apparently?) complete your goal of... plugging into a construction robot(?), when you immediately fail in a cutscene, get dumped into a garbage bin, meet some people on the outside of the city after fighting through trash for three levels, and the game just ends with nothing apparently accomplished.  Half the game is told in blurry comic-book cinematics with some attempt at the messy art style of the Metal Gear Solid comics, and the hero stays silent during gameplay; then the comics stop happening, and the hero learns how to talk during gameplay. I thought this would help the story have more context, but it just gave him more opportunities to complain.  I don't know if it's a localization problem or what, but whenever this game isn't confusing, it's embarrassing.  Two of the three bosses are kinda rad though, even if they're not that interesting to fight. If you like neat skyboxes, this has some.",
            "review_score": "-1"
        },
        {
            "review_text": "When you finally get the sword, it spams kamikaze enemies that will kill you instantly if you fight in melee range.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Stylish although rather silly. Very simple gameplay with only a handful of adversaries but all set in some sharply executed blade-runner style environments. Clearly from a smaller studio and the level design and overall feel is not as plush as AAA titles but it's a fun experience and the fights are challenging and fun as the player needs to take advantage of environmental hazards to maximise the damage to enemies.",
            "review_score": "1"
        },
        {
            "review_text": "If you have Shadow Warrior, this isn't a wasted $3, but it is by no means SW quality.",
            "review_score": "1"
        },
        {
            "review_text": "A great game made slightly better.",
            "review_score": "1"
        },
        {
            "review_text": "Ill start with the positive, it's a shooter. An old fashioned shooter in much the same catagory as doom. Its core gameplay/genre is about its only strength.   The negative :  Monotony - The game looks feels and sounds pretty much the same throughout. Simplistic difficulty - Sponges and floods. Unintelligable - The game contrives so much to maintain its futuristic noir feel that it's story borders on unintelligability. It is full of enough technobabble to give CSI a run for its money.  Length- Pretty short.  Overall I'd give it a 3 out of 5. If I wasn't such a huge fan of shooters i'd rate it a 2.",
            "review_score": "-1"
        },
        {
            "review_text": "A very solid FPS that welcomes those who like mindless corridor shooting. The action does not stop and the shooting is downright welcoming and just right. Nice upgrade system for your two primary weapons as you can add grenade launchers, shotguns, and more.   If you played the original version, it may be worth a second playthrough as the game is still fun BUT really depends if you are a FPS maniac like I am.  I did feel that the original version had optimization issues and I notice faster loading times, crisper graphics, better movement, and shooting feels a little more tweaked.   ",
            "review_score": "1"
        },
        {
            "review_text": "  Very simple yet action packed 1st person shooter. The gameplay reminds me of DOOM.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must. Amazing level design. Game feel everywhere!",
            "review_score": "1"
        },
        {
            "review_text": "Rather than nitpicking the differences like negative reviews, see it as £2.25 DLC for the awesome new Cyber-Katana Weapon. Ace game!!",
            "review_score": "1"
        },
        {
            "review_text": "I like sci-fi themed games. With that said, that is why I purchesed this game. I quickly found it how simple the game is and how the enemies are copies of themselves. Varity is lacking is this dark world. It held my interest for two days tops. It is just a simple FPS.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Have the original, bought the redux. Why? Because it is worth to buy.",
            "review_score": "1"
        },
        {
            "review_text": "better than half life 2",
            "review_score": "-1"
        },
        {
            "review_text": "Explosions and Robots. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's a classic-style shooter that is decent enough to recommend to the fans of the genre. It doesn't feel as good as Shadow Warrior, Serious Sam, Doom etc. but there is some fun to be had in it for sure. It's also quite old by now so you can count on discounts - I bought mine at 5€ and a couple days later I see it for 3.  People are complaining about it being too easy due to the infiinite dash being included in the redux version - I see that as a valid complaint, but I'm not that great at those games so I'm actually happy about this feature and the game being easier in general. If it makes the game too easy for you, just don't use it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good oldschool style fast paced FPS. Definitely entertaining especially for gamers who don't mind sometimes reprtitive gameplay with not exactly very extensive or rich story. After long game plays it can become a bit repetitive, pretty much the same as can be said about it's 'brother' Shadow Warrior. Good to play after hard day at work to relax and let the steam off a little.  Big plus is that developers 'Flying Hog' are even responding to various questions on the Steam discussion forum, same as on, again, Shadow Warrior. This is highly appreciated and casts very positive light on the studio. Not 100% sure if I would buy the game for a full price but as a owner of Shadow Warrior I have bought it for roughly £2.50 which is excellent price.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, cool neo futuristic world. Played up until the first boss. Great action had fun with it!",
            "review_score": "1"
        },
        {
            "review_text": " Deus Ex  meets  Serious Sam  in a future where everything seems to explode on contact; just as satisfying now as it was in 2011. This updated version of  Hard Reset  has been heavily, and in my opinion, unfairly criticized despite being a significant improvement over the original release.  Let's start off with the basics:  Visually the game is as stunning as it's always been, arguably the most atmospheric cyberpunk game outside of the  Deus Ex  series and moving away from DX9 has only done it favors.  Redux  is a far more organic presentation; gone is the garish sharpening filter, excessive bloom and baked shadows, replaced by DX11's superior lighting and dynamic ambient occlusion.  Performance, is of course, massively improved in the process. As with the initial release of spiritual successor  Shadow Warrior  (later given a significant DX11 overhaul alongside the console ports),  Hard Reset  was notoriously unoptimized; the  Exile  DLC in particular gave me nothing but trouble.  Redux ? 1080p, max settings, solid 60 despite the never ending onslaught of chaos and particle effects. Flying Wild Hog has come a long way with their Road Hog engine and it shows in execution.  Gameplay has also been tweaked. The original release was, for lack of a better way of putting it, stupidly hard. Above average at FPS as I might be, even I couldn't make it through without dropping the difficulty along the way. Here, even Insane feels manageable, by all means unforgiving, but fair; splash damage is less punishing, unlimited sprint is an absolute godsend as is the  Shadow Warrior -inspired dash and anyone complaining about the addition of a melee weapon (cyber katana) has clearly never played through the more ammo-intensive segments of  Hard Reset's  campaign -- it's an absolute life saver.  But I am biased. Flawed as it might have been,  Hard Reset  managed to win me over years ago. Charm, gameplay, atmosphere... it had it all, and  Redux  doesn't jeopardize those qualities by any means; it just polishes them to an nth degree, and that's all I could have ever asked for in the end.",
            "review_score": "1"
        },
        {
            "review_text": "Man, this game is dumb...  In a really good way.  Honestly, I'm usually a sucker for plot and since this game's plot is utterly generic, while being hard to follow, you'd expect me to be running screaming, but man it is fun to switch off and blast away at enemies. There is a certain amount of thinking involved, but it somehow feels more like the primative lizard brain is in charge than the higher function.  With the dashing and (presumably the katana, I haven't got that far yet) it feels a lot like Shadow Warrior though, so if you haven't got that yet, pick it up first. It's the better game and it even has an engaging plot, if you're hear for that. I got this on the ridiculously cheap promo sale though, so I'm happy with my purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun game. Not sure why all the hate. Get it on sale and have fun!!",
            "review_score": "1"
        }
    ]
}