{
    "app_id": 407940,
    "name": "Hyper Bounce Blast",
    "release_date": "2016-05-27",
    "developer": [
        "Flump Studios"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Platformer"
    ],
    "achievements": 12,
    "positive_ratings": 74,
    "negative_ratings": 4,
    "price": 3.99,
    "description": "Hyper Bounce Blast is a stomach-churning retro shooter blended with classic platforming action. Bounce, shoot and dodge to survive the ever-increasing enemy attack. Bring it on!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407940/header.jpg?t=1479146021",
    "minimum_requirements": "OS: Windows 7 and above Processor: 1.8 Ghz Memory: 2 GB RAM Graphics: 512 MB video memory DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7 and above Processor: Dual Core processor of 2.4GHz Memory: 4 GB RAM Graphics: Nvidia Geforce 200 series or equivalent DirectX: Version 9.0 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "   Hyper Bounce Blast  is the latest game from Flump Studios, which you may have heard of from their successful titles, such as Horizon Shift.  Always faithful to the genre,  Hyper Bounce Blast  is a sweet and delicious homage to the 80-90's Shm'up wave, and it succeeds wonderfully in offering unique gameplay mechanics.  You're controlling a bouncing ship with the ability to wall jump and bounce on the ennemies.  As long as you're in the air, you're entirely invincible from every form of threat. But if you land on the ground, you'll be vunerable ! As compensation, you will also get to collect the points from the kills you've just made. And if you reach the ceiling, you will bank your chain.  And that is what the game is mostly about. You need to focus either on jumping or shooting, or maybe both if you're awesome like that.  Oh, should I talk about the Hyper ? When your Hyper bar is full, you can release your full power, and give headaches to your ennemies by going BWAAAAAAAAAAAAH for a few seconds. This can save your life, really. And give you hell of a lot of points, secondarily, but make sure to activate it as close as you can from the top of the screen!  As usual, you have access to different game modes, each with their own leaderboards. While I do wish the game the success it deserves, I must admit I love the small community it currently gathers, just for the fact you can have a say with your scores, as modest as they are. It's way more rewarding than ending up in the 100th page of leaderboards, where nobody will ever find you again.   I found  Hyper Bounce Blast  graphically stunning, and it runs smoother than ever. Every new game from the Studios is yet another big step towards indie professionalism (careful not to go too far, or you'll get tired, Paul!), and I'm really excited to see what is next to come out of their magic hat of high-quality games.  Whether you're a retro gamer, shmup-lover, or simply someone who wants to discover that genre, I can only recommend  Hyper Bounce Blast  : it is made with passion, doubtlessly.",
            "review_score": "1"
        },
        {
            "review_text": "  While it may look simple, Hyper Bounce Blast offers a wildly addictive gameplay mechanic that sees players bouncing off walls and jumping on enemies. It's a clever gimmick that is unlike any other shoot-em-up I've seen before and is worth the price of admission alone. That said, the 30 stages are over too soon and I wish there were more power-ups to play around with. But even though it never fully reaches its potential, Hyper Bounce Blast is a fun and unique 2D shooter.          YouTube™ Video:  Review: Hyper Bounce Blast (Steam) - Defunct Games&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  Curator Review:  'I thoroughly enjoyed this game and recommend it as an option for all bullet hell and shoot em up fans. 7.5/10'          YouTube™ Video:  TAP: Hyper Bounce Blast [Sponsored]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  This game.. OMG This game. Take bullet hell, take arcade style shooter, taking bounce chain mechanic from Mario, and some wall jumping, mix it all together and you get this greatness!  The gameplay seems simple but it's actually fairly difficult and that's what makes it addicting. I don't know about anyone else but it is SUPER satisfying to bounce through a whole level. And when you die when you're decently far, you just have to play again! So much fun!!  Soundtrack is upbeat and goes very well with the gameplay, not much more to say there.  And when it's all said and done you can even up the game speed up to 200% for some insanely fast bouncing shooting action. I was just laughing so hard as I struggled with this sudden need for speed but it's still so much fun!!  I got the game for free from the developers, they are super friendly, however this is a 5 dollars that is definitely sure to keep you entertained for hours!  5/5 =]  ~Dan   If you want, you can check out my first experience with the game below. Nothing too crazy but you can get my reactions to take my word for it!          YouTube™ Video:  Hyper Bounce Blast - Let's Play with DAN - JUST KEEP BOUNCING!&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  Hyper bounce blast isn't an easy game, if you're used to the games of the same developer, you know what I'm talking about. The game's a 'bullet rain simulator', as bouncing basically makes you invincible from everything, so you understand that touching the ground geanerally means instadeath. Gameplay is super fast, music is not bad, visuals are nice (framerate isn't super smooth tho), and skill is really all you need to beat the game. I know this kind of game isn't for every gamer, so I'd say this is a good value for those who like these hard challenging games. I hope I could help you decide buying it or not!  PS: Achievement hunters beware",
            "review_score": "1"
        },
        {
            "review_text": "  Disclaimer - Developer submitted me a free key for the game for review purposes.   Hyper Bounce blast is an interesting take on the Shmup genre. By combining it with elements of platform games and puzzle games, Hyper Bounce Blast is a unique, if unimpressive shooter.  The idea is to shoot the red enemies, and jump on the blue enemies while collecting fragments that the red ships leave behind. Once you've gained a plethora of these fragments, the aim is to 'bank' the points by jumping to the top of the screen before the wave ends.  The vector styled graphics suit the game well, and controller support is tight and responsive. It also makes you brain think asymmetrically as you have to figure out which enemies to shoot and when to shoot them, as shooting a blue enemy renders it unable to be jumped on, and jumping on enemies is the only way to make your ship impervious to enemy fire.   While the ideas around the game are great, keyboard and mouse movement lacks finesse, and it's very easy to lose track of your subtly coloured aiming reticle. The bosses and bullet patterns are also unfortunately very generic, seemingly ripped directly from Cave Shmups.  That being said, the game has a definitely high difficulty curve, and the price is right, so if you fancy a challenge, it's worth taking a look at. It's a good game, but not a great one.  My rating: 6 out of 10.  Video review here:         YouTube™ Video:  Hyper Bounce Blast Review for PC&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "  Another great Shooter, unique and with a great soundtrack Highly recommend! And the Bonus stage just makes me smile :) Great game ",
            "review_score": "1"
        },
        {
            "review_text": "  Wow. This is a SUPER fast-paced awesome arcade shooter. It made me fee like I was actually sitting in front of an arcade console. The bouncing is KEY in this, but you can't forget to shoot either! I had a LOT of fun with this game.   Thank you, Flump Studios, for providing me with what I'm sure will be hours of fun!",
            "review_score": "1"
        }
    ]
}