{
    "app_id": 407900,
    "name": "Princess Remedy in a World of Hurt",
    "release_date": "2016-01-01",
    "developer": [
        "Ludosity",
        "Remar Games"
    ],
    "publisher": [
        "Ludosity"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Pixel Graphics",
        "Free to Play"
    ],
    "achievements": 0,
    "positive_ratings": 2305,
    "negative_ratings": 53,
    "price": 0.0,
    "description": "Remedy, a recent graduate from the Saturnian healing school, must descend to Hurtland and use her powers to heal everyone from stray ducks to dark lords, and finally cure the ailing Prince Hingst. It's a short, whimsical adventure with plenty of heart(s).",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407900/header.jpg?t=1473450252",
    "minimum_requirements": "OS: Windows XP Memory: 50 MB RAM DirectX: Version 9.0 Storage: 10 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "ZX Spectrum level graphics plus a protagonist that could show Dr. Mario a thing or two about treating symptoms and ignoring the underlying causes.   All that for free... whattadeal!",
            "review_score": "1"
        },
        {
            "review_text": "It's completely free.  Takes about an hour to complete. Has mulitple difficulies and ending text.  Very self aware humor. Can run on my potato computer. No reason NOT to get this.   I also married a skeleton.",
            "review_score": "1"
        },
        {
            "review_text": "Saved the world. Married a duck.  GOTY 2016",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty great! With a good chiptune soundtrack, a fun combat system and some great, quirky humor it sure is worth the hour of playtime. The only con I could find is that the controls outside of battles are weirdly done (every action is on the same button). Since you get used to that pretty quickly it´s not that big of a deal. All in all a very nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Princess Remedy is a charming, short (about 2 hours long on normal difficulty) and amazing 'bullet hell' game with retro ATARI graphics. And it's totally free.   If you like the bullet hell genre, what are you waiting for? Challenging battles and tons of jokes are waiting for you. Go check them out, give this Remedy a shot.",
            "review_score": "1"
        },
        {
            "review_text": "This is a relatively short RPG/Shoot-em up/Bullet Hell sorta hybrid with a Gameboy aesthetic that's similar to games like Undertale that play with genre-bending. While not as in depth as Undertale takes it's narrative, gameplay and morality system, it still feels as fun to play, boasts a great soundtrack and offers one heck of a good time!    Starting with three difficulty options, Princess Remedy leaps from Saturn(?) and safely lands in A World of Hurt. In this world almost everyone is ill and Princes Remedy is the only one who possesses the cure. Enter “Healing Mode” after talking to a disease stricken NPC and get ready for some action! Ms. Remedy only shoots forward, which happens automatically. She just shoots nonstop. It's kinda funny. She's also equipped with healing flasks that act as grenades when pressing the action button. Don't worry, the action button is every button on the controller.    The shoot-em up segments ramp up in difficulty at a smooth pace and the game never feels too difficult out of nowhere. When you find a segment to be too difficult, just try helping someone else. Each time you finish curing someone, you are granted more hearts, or health, to help you on your journey. In addition to completing healing modes, you can find chests throughout the game that give you other stat boosting goodies.    Remember, it's free. Totally free and clocking in just under two hours for me on normal difficulty, you're not going to loose much. The soundtrack pulled me right in and once the gameplay picked up I couldn't put the controller down. The challenge made me want to keep trying to continue, but never became too difficult to make me stop. I had such a good time I've started a second playthrough on a higher difficulty setting. I'm not bashful to say that I fell in love with this game. I want to recommend this to anybody, but maybe it will only appeal to hardcore players. I don't think so and I urge everyone to give this one a shot because it's mother♥♥♥♥in' FREE, son!",
            "review_score": "1"
        },
        {
            "review_text": "Princess Remedy in a World of Hurt is one of the nicest little games I've played this year. As the titular Saturnian Princess, a recent graduate of healing school, you must descend to the tortured Hurtland below in order to heal the land's prince, who has somehow saddled himself with every illness in existence... And maybe fix up the rest of Hurtland along the way.  Gameplay is very simple, and only directional buttons and an action button are required. You simply enter various towns and caves from the overworld, and talk to sick-looking NPCs. To cure them, you must clear a small top-down shooter minigame, launching bandages at personifications of various ailments. (Unfortunately, you can only fire in the direction you are facing, but I suppose this can be attributed to style.) Each minigame you clear and person you heal will earn you another hit point, and various other upgrades like shot power and regeneration can be found in chests throughout the world. You'll need them, as the germs and creatures you fight will get progressively stronger. Don't worry, though- If you fail a heal-fight, you can try again with no penalty. The game has some amusing visuals and a lot of funny dialogue- most of the people you heal are grappling with some sort of silly condition, like a ghost who's scared of himself and a centaur who is worried because he believes he is real. (This is reminiscient of other games from the same folks, such as Ittle Dew- the protagonists of which make a cameo in this game.) Finally, the heavily retro graphics may look off-putting at first, but I got used to them quickly and soon enjoyed the old-fashioned feel. I also found them to be much more colorful and identifiable than I was expecting- definitely more so than the majority of the old stuff they take inspiration from.  Overall, Princess Remedy is a quick jaunt that is absolutely worth an hour or so of your time. My only complaint is that it's free-to-play, so I can't have it permanently associated with my account.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super cute and charming, and I love it. Play it!",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome retro game  short (about 1 hour)  though it may be. Feels and sounds like this game came from the NES era which is something I can appreciate. The controls are also very simple. Basically move with directional buttons and you have an action button to talk to people or use vials (bombs) in battle or bring up your stat screen or even to run while holding a direction. You can also use a  controller  which is what I did. Remmy (or remedy as reffered to in game) is sent down to hurtland to heal everyone including Prince Hingst. The main objective is to find him and cure him of his own ailments. You must go around the various maps and find people and other creratures to cure. To heal someone in this game you go into a  'heal mode' battle  where you face off against various virus creatures. Whichever direction you're looking is where you will shoot your healing powers. To clear the battle you have to destroy all of the viruses on screen. You do have vials to throw which can help with crowd control. It's a lot like a mini  pixel bullet hell  game with a bit of  rpg elements  thrown in. After my first playthrough I was addicted. I wanted to get a full completion file and played it again.   This time I got 101%    Now working toward doing that on the hardest difficulty.    It's a free game just try it already! Especially if you like a little shmup action. This game is a real gem and I think I've found my next speedrun game. ",
            "review_score": "1"
        },
        {
            "review_text": "A neat little shooter game which doesn't take more than an hour to complete. This is not necessarily bad - considering it's a free game and was created in four days, that's better time for your money than you'd get with some games. Play this if you're waiting for something, but don't have the time to delve deep into an hours-long game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little cheap game  Took about 45 minutes to finish on normal difficulty. I know from the guide that I missed a few things.  Nostalgic, some quirky humour, good time killer.  I married the duck.",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet, adorable and free. I married a seal.",
            "review_score": "1"
        },
        {
            "review_text": "Adorable, well polished, very good use of an hour.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't think much of this game at first, but it's actually a tightly designed heal-em-up that moves at a brisk pace. Even if you're on the fence, just download the game and play it for five minutes. It'll be more than enough to make up your mind about it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, short, and challenging. More secrets than you would expect, with charming dialogue and an open epilogue.",
            "review_score": "1"
        },
        {
            "review_text": "I married a duck it was pretty raduckal he quacks me up when I'm with him I feel like I'm on quack hold up gotta go get some quackers        duck",
            "review_score": "1"
        },
        {
            "review_text": "I married the empty chest in the secret passage of the final zone.",
            "review_score": "1"
        },
        {
            "review_text": "+Fun Gameplay (Heal Mode) +Funny Dialogue +Simple and easy to use controls (You can do everything in the game without lifting your right hand ( ͡° ͜ʖ ͡°) ) +Interesting World with a lot of secrets to discover +Great Replayability +Multiple Difficulty settings +In-game timer (good for speedruns) +Anyone can download this in 2 seconds and run it easily  -The whole game can be beaten in 45 minutes even on your first playthrough  Apparently a sequel will be realeased soon so now is the perfect time to play World of Hurt. It's defenitely worth your time and I'd say it would even be worth a few dollars if it wasn't free.",
            "review_score": "1"
        },
        {
            "review_text": "so hecking cute, i married the apathetic frog",
            "review_score": "1"
        },
        {
            "review_text": "I'd reccomend this to anyone. It's a semi challenging, under an hour, delightfull little adventure that I think anyone would enjoy.  Plus, it also has harder difficulties, for people that want a little more spice.",
            "review_score": "1"
        },
        {
            "review_text": "Short fun little game. Graphics are somewhat ZX spectrum-like. Gameplay is a little repetetive. I dunno what to say, it's just simple.  Bonus points: At the end of the game, you can marry any character in the game.  i r8 5/8 gg, but short. ",
            "review_score": "1"
        },
        {
            "review_text": "This is absolutely great! A kinda cross between a RPG and a 8-bit PC adventure with a shoot-em-up -- so basically, some of my favorite game genres! This absolute gold for a free game, period.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fantastick game with a large portion of humour and fun moments.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 WOULD...  SUFFER FROM A LACK OF BODY AGAIN BE SAD BECAUSE I WAS GIVEN A DUMB NAME AGAIN HAVE TEN LEGS TOO MANY AGAIN STICK BURGERS ON MY HORNS AGAIN BE SO COOL, MY FACE MELTED AGAIN  Prepare to immerse yourself in this nostalgic game featuring great music and gameplay. You explore a world in a 3rd person view similar to Breath Of Fire and Pokemon; in which you open chests to obtain objects that help advance your stats, and initiating 'battles' passively when you encounter a sick NPC.The battles are known as 'Healing mode' in which you face off enemy viruses by controlling the direction your princess moves and also where she fires 'medicine'. Another 'weapon' you have are flasks which can be thrown as grenades. Enemies range from non-moving patches to gliding ghosts that shoot stuff at you, trying to cut down your health bar. In later levels, the amount of enemy fire thrown your way could easily pass for a bullet- hell game.  The dialogue is hillarious with NPCs giving various funny reasons for their sicknesses and the ending offers many, many possibilities. Totally would reccommend. Has great playback value too, really suprised that it's free. It's short, and I was able to finish it with a 100% completion rate in around 50 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Quick and fun game that doesn't last long enough to become boring, even if you don't usually like the bullet style genre.  PS:  Once you end the game, make a new one and when select difficulty hold the 'right' key untill something happens :)",
            "review_score": "1"
        },
        {
            "review_text": "A great little game and best of all it's free. The graphics remind me a lot of the early ZX games. Princess Remedy is a nice looking game despite limited use of colour. The text is well written and amusing. The sound is catchy chiptune style music and it's just so playable. The shooting parts are were it shines, it's almost like 'press R to restart', but after a while it becomes second nature as the learning curve is very progressive. A great game.",
            "review_score": "1"
        },
        {
            "review_text": "It's short, but cute, fun and free. A good timekiller.",
            "review_score": "1"
        },
        {
            "review_text": "free game with 66 endings (y)",
            "review_score": "1"
        },
        {
            "review_text": "Short,cute and free.",
            "review_score": "1"
        },
        {
            "review_text": "really joels dad high fived me. im writing this review with the one hand i have left.  would high five again",
            "review_score": "1"
        },
        {
            "review_text": "Considering the staffing and time constraints placed on its development, Princess Remedy impresses both in scope and aesthetic adhesion. Yet beneath its low fidelity charm is a challenging shooter with its share of secrets and a plethora of 'endings.' The game ultimately benefits from embracing rather than denying its own limitations.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and it's free, what else is there to say?  Oh yeah, it's got a great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Very fun free game.",
            "review_score": "1"
        },
        {
            "review_text": "You will not understand true hell until you have played Princess Remedy on Master. There is no god.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I wish my mom and dad stopped fighting.",
            "review_score": "1"
        },
        {
            "review_text": "it's cute. had fun with it and the master difficulty actually had something to show, I guess. can't say i'm a fan of being forced to shoot in the direction i'm moving, but it's a 5 button game.",
            "review_score": "1"
        },
        {
            "review_text": "Ga...Ma...N...! Is he Romeo, or is he Lambo? I guess I can 'tolerate' this game.",
            "review_score": "1"
        },
        {
            "review_text": "Shooting.  Healing.  Jokes.  Cuteness.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, if short little game. 100%'ed it in less than an hour playing it for the first time. This game has a very innocent charm that very few games today manage to achieve, made me feel like I was a kid playing some family-friendly stuff for the Gameboy again. You can also marry anyone you want at the end of it and have a different 'ending' - really, just one extra line of text, but it's really fun to try out different marriage partners, so it becomes kind of an extra objective. I married the Dark Lord.",
            "review_score": "1"
        },
        {
            "review_text": "I Love the graphics! 8/8(bit)",
            "review_score": "1"
        },
        {
            "review_text": "was entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Brisk and painless single-button shmup with humour. It's free - so why not?",
            "review_score": "1"
        },
        {
            "review_text": "Better and less overrated than Undertale.",
            "review_score": "1"
        },
        {
            "review_text": "took 33 minutes to beat, but I enjoyed those 33 minutes",
            "review_score": "1"
        },
        {
            "review_text": "Supprised someone actually wrote something negative for this game.",
            "review_score": "1"
        },
        {
            "review_text": "'Of all the chests of this land, Remedy chose me!'  Free to play, atractive music, humorous, fun and addictive gameplay. Before you know it, you'll be on Master difficulty, yeah it's one hour long, perhaps a bit more, but hey, it's free to play!! The latest Battlefront won't even offer this much...  10/10 Would marry a jealous chest again.",
            "review_score": "1"
        },
        {
            "review_text": "May I pay for this game, please?",
            "review_score": "1"
        },
        {
            "review_text": "It's like Undertale, but it's better. I highly recommend it. Why? Because it's fun, you see, it's all a game need to be!",
            "review_score": "1"
        },
        {
            "review_text": "Of all the games that could've costed something, this one should've costed something the most.  Despite the developer's self-imposed limitations on graphics and audio, the visuals are still appealing and the music is pleasant to listen to. It has a charming and quirky dialogue and story. It has astonishingly simple controls and gamepad support, with anything besides movement buttons being all the same action button. It's also still reasonably challenging to complete when going for full completion in master difficulty. All in all it's a great, retro RPG experience, albeit short, but what can you expect from a game made by four-ish people within four days for the Games Against Ebola charity game jam?  Since I don't see the info on the store page, here are the credits in case anyone wanted to see:  Design, script, code, SFX edit: Daniel Remar Design, graphics: Anton Nilsson Music, SFX: Mattias Hakulinen Final boss music: Stefan Hurtig",
            "review_score": "1"
        },
        {
            "review_text": "A short bullet hell about healing people. 9/10. Would recommend.  Pros: -Cute story -Lots of fun characters -Lots of secrets and hidden areas  Cons: -Enemies have an extremely wide range of movement compared to the player (player moves and fires in 4 directions, can only fire forward; enemies can move 4 directions, fire in 8, and shots aren't tied to their direction of movement) -No invincibility frames, making it easy for enemies to trap you and keep you cornered until you die -Character impacts the environment, but the environment only effects the player (your 'bullets' break blocks, but enemy bullets pass through)",
            "review_score": "1"
        },
        {
            "review_text": "Heal the world, make it a better place. - Michael Jackson.  Cute little retro game with lovely low res sprites. It's free, really worth playing a few hours. Pump up the difficulty if you want a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "it's free and also very cute and you can marry a duck and you should play it",
            "review_score": "1"
        },
        {
            "review_text": "  Its a cute game that doesnt overstay its welcome. Also a sequel is in development.",
            "review_score": "1"
        },
        {
            "review_text": "+unique 1button gameplay +fun +gamepad, WASD, UDLR works seems dull &amp; confusing at 1st, but after 1st battle u'll get it...",
            "review_score": "1"
        },
        {
            "review_text": "A free, hour-ish game should not be this enjoyable. What it may lack in 'production' it more than makes up in heart (pun not intended).",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought it would have been a terrible game. But after finishing it, I married the jealous chest and it made every non-paid penny worth it.   11/10 would marry chest again - IGN",
            "review_score": "1"
        },
        {
            "review_text": "I feel that I need a space nurse to kill the bad things inside me.",
            "review_score": "1"
        },
        {
            "review_text": "  A short but fun game with easy controls. I'd still play it if it costed money.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 - Nice little game to play on a work break.",
            "review_score": "1"
        },
        {
            "review_text": "Cute, amazing, fantastic. So glad I stumbled upon this. It'll make you laugh (a lot) and will even touch your heart, and don't worry, it will get challenging.",
            "review_score": "1"
        },
        {
            "review_text": "I married a jelous chest!  10/10 will heal again.",
            "review_score": "1"
        },
        {
            "review_text": "I married the Apathetic Frog on accident.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game! Just, SO GOOD!",
            "review_score": "1"
        },
        {
            "review_text": "Got 99% (Wher is that last heart?) Shoot frogs from my hand, Saved the world, married a tall girl, a mummy, two flowers, a duck, an empy box, a jealous box, and an apathetic frog. 11/10 This game is great",
            "review_score": "1"
        },
        {
            "review_text": "It's free, it's short, it's good. that's all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "Just echoing what everyone else has said. Incredibly adorable game that kept me smiling from start to finish. And the soundtrack is absolutely AWESOME! One of the best retro soundtracks I've heard recently. Would have been more than happy to shell out a few dollars for this game in all honesty. Vast amounts of charm, incredible music, funny humor. Wonderful game!",
            "review_score": "1"
        },
        {
            "review_text": "There is much I can say that someone else didn't already cover in their review. For a short, simple game...it's fantastic. Cute characters, simple story and gameplay, and over all a nod to the old PC's of the 80's. Very well done. Looking forward to the next one.",
            "review_score": "1"
        },
        {
            "review_text": "I beat the game Master difficulty with 101% of completion. I think it's pretty good actually, challanging, the game has a lot of potential. It would be great to have a sequel with a 16 bit graphics and the monsters more elaborated.",
            "review_score": "1"
        },
        {
            "review_text": "It is not many a game that can ooze this much charm, look this GB-like, and get away with it. Looking forward to finding ever secret and getting all the things. Omg, AND there's a sequel planned! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good, especially for a free game. Try it out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super short, but super cute! I got a huge nostalgia blast from playing this game. It reminded me of a few games I used to play when I was younger. The characters are interesting and cute, and I love that they each have their own little personality to them. First glances at this game may make you turn your head away, or just seem pessimistic about the game like I was. It wasn't until I started playing the game where I found it quite fun! The gameplay is mostly easy, with a few challenging moments mixed in. I loved the final boss. It was an interesting change to the other character's fights, but while keeping the same aspects of the regular fight. I also love that the ending has a few different lines for every character. That made me want to travel back around the world to see all of the different endings. The music was quite entertaining as well! I do reccomend this game for anyone who's interested in short RPG games, or just something to pass the time. It's free too, which is a huge bonus! However, if you were to make a sequel to this game, I would suggest that you make it a paid game. I would've paid for this game if I had watched a few gameplay videos first. To anyone reading this, give it a try! You might like it. :)",
            "review_score": "1"
        },
        {
            "review_text": "this is a cool game. should be at least .99 cents.",
            "review_score": "1"
        },
        {
            "review_text": "As Princess Remedy, you have to explore the land in search of people to heal, banishing their ailments in a bullet hell mini-game by shooting pills and throwing explosive vials. The controls are easy with just 1 action button along with the directionals. The style is cute and the chiptune music is great. Played through with 101% completion on master difficulty and it was quite challenging. I would have gladly paid for this, but the fact that the game is free makes it even better.",
            "review_score": "1"
        },
        {
            "review_text": "I usually avoid playing game jam games because I get frustrated with how short they are, but this one looked too good to pass up. It's an ARPG/Shoot'em'up hybrid featuring a girl who heals people by throwing pills, syringes and glitter at them. It looks and sound like a lost gem from the gameboy era. The writing is consistently funny with that innocent, slightly absurd humor that I associate with 90's japanese games. It's also very polished and packed with secrets.   One thing I would like to see added is some kind of rating system at the end of each 'fight', it would make the beginning of the game more interesting for people who like being challenged. Maybe some incentive to finish quickly or without taking damage?  PS :   I married a slime  ",
            "review_score": "1"
        },
        {
            "review_text": "short fun charming game and its free so yes I recomend it.  I have only one wierd petty complaint its that every button can open the start menu which is kind of anoying at first.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, quick little game. I look forward to future installments.",
            "review_score": "1"
        },
        {
            "review_text": "A short and solid game. For the low, low price of FREE it's worth it. I healed the prince of his illness: everything. And then the king decreed everything.",
            "review_score": "1"
        },
        {
            "review_text": "this is a short slice of amazingness on a stick (and deep fryed in cotton candy) that is one of my favriote steam game by far just because its not making me buy the dlc its just that good. what im saying is BUY THIS GAME NOW its amazing",
            "review_score": "1"
        },
        {
            "review_text": "When I find whoever decided to make the jealous chest, I am going to bring them into my warm embrace and make them feel loved. I am going to be the reason they get up in the morning. When they are as open to me as they can, I will plunge a rusted knife into their gut. I will laugh as I watch the life drain out of them as they die a painfully slow death. In their final moments I will whisper in their ear 'you opened other chests first'.  10/10, good music, got 101% on hard. Cured a spider of his beauty and muscles.",
            "review_score": "1"
        },
        {
            "review_text": "So. This game is awesome, its free, and just yknow. Words. Play it if you dont suck at bullethells. But even if you do, try it anyway, its not that difficult.  Has a decent amount of replayability if you like 'different' endings. They vary minutely.",
            "review_score": "1"
        },
        {
            "review_text": "I stumbled upon this on mere coincidence, but damn, what a good coincidence it was. its a fun game that doesn't take itself seriously, its cleverly written, and has catchy music the game mode its very dynamic and it has a certain amount of replay value, I completely recommend it to anyone to pass some time. I'm sure I'll play it again soon!",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to be some kind of magic nurse-princess, shooting needles and pills at frowning monsters to heal sick people and cute creatures so they'll share some quirky one-liner with you? Well, have I got the game for you!  Order right now, and it can be yours for three easy payments of only.. uh.. 0.00$  Here's how to order",
            "review_score": "1"
        },
        {
            "review_text": "Utterly charming with a fun sense of humour, and tight enjoyable shooting action. Definitely recommended as a great use of an hour!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very short but oh-so-wonderful and funny! Enjoyed all the dialogue. It's definitely replayable. Go download it now, it's free! 10/10 would marry Frallan again.",
            "review_score": "1"
        },
        {
            "review_text": "this gameis so beautiful i cant explain why it means so much to me even though ive barely even played it  thanks for this game",
            "review_score": "1"
        },
        {
            "review_text": "Refreshing and cute.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME!!! I have to replay it for different endings! I love the simplicity, the feel and the retro style. It actually looks like an old game, not like some of the pixelated games that will rotate the pixels in a way old machines couldn't handle. I mean like a square shifting to a diamond stance and the square remaining the same shape instead of the pixels stacking in a pyramid formation on both sides like would actually happen. The music is great, love the characters, actually took time to talk to everyone because of the clever jokes that happened. My favorite being, 'Everyone in this town has sharp tounges, now I'm suffering from sick burns.' You can beat the game fairly fast, definately give it a try because you have nothing to lose, it's a really pleasant and unique experience. At the risk of sounding cliche, I feel it's a work of art!!!",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS A NICE LITTLE GEM",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. Smooth, charming, clever. Packed all the goodness of an old NES JRPG into a delicious bite sized morsel. Only regret is I can't pay for it!",
            "review_score": "1"
        },
        {
            "review_text": "World of Hurt is a delightfully simple game. It isn't very substantial, at a scant 30-45 minutes long, but it takes a bit of finesse and exploration to find everything that you can, and while it isnt extremely chalenging, it grows some fangs towards the later stages of the game, particulalry if you do nothing but barrel through the adventure as fast as possible and don't take your time to find the more hidden goodies.  While not every bit of dailouge is written the best, and some of its characters might have some... questionable motives, its all in good fun. If anything, this only adds to the childlike innocence and lighthearted tone. I also have to make special mention that this game was made for a chairity event. While I don't quite think the game exactly succeeds in being an impactful message for anyone who's lives may have been effected by travesty, the effort is still there and I always will apreciate people wanting to show thier support for others.  It's not particularly meaningfull, but its a charming little adventure that put a smile on my face. If nothing else, it's a fun, bite sized little distraction that is free to try out.",
            "review_score": "1"
        },
        {
            "review_text": "Simple top-down game that is a mix of exploration and bullet-hell. Can be completed in about 1 hour, and is quite enjoyable.  Graphics are extremely simplistic by design, making the game look like it is from ZX Spectrum.  The gameplay works like this: You explore the area, talk to people, and 'cure' their illness through a simple (but sometimes challenging) bullet-hell mini-game. And you open chests and get upgrades to your bullets. Rinse, repeat, until you get to the boss and to the ending.",
            "review_score": "1"
        },
        {
            "review_text": "after playing this game and marrying everything, you'll wish there will be a sequel/prequel to this.  10/10 would marry jealous chest again",
            "review_score": "1"
        },
        {
            "review_text": "you can marry everyone in this game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic! Just finished and I already can't wait to play again.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible game. Total snoozefest on Normal, wtf hard on Master, wtf impossible joke difficulty, half of the game is played for you and so your contributions are just moving around and throwing flasks if you feel so inclined. The game is fun when you're not playing the game parts of it.  8/10 it's free",
            "review_score": "1"
        },
        {
            "review_text": "Game completed in Hard Mode.  Princess Remedy in a World of Hurt is a short, fun bullet hell game for anyone looking for a quick introduction into the genre. As Princess Remedy, your goal is to heal everyone in Hurtland, as is in the title. While you do require a specific number of Hearts to clear the game, I would search for more people in need of my help just to read their interesting two-liners.  In Healing Mode, the battle screen for the game, controls are simple, move around avoiding enemy bullets while Remedy fires her healing bullets (automatic). Pressing any main key fires a vial/bomb which deals damage to an area, useful for if you feel over-encumbered by foes.   Death is not punishing as you can immediately challenge the stage again if you fail. No need for the hassle of looking at the main screen over and again.The game time can span from 1~2 hours, depending on your play style.  Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "is good it has the Undertale-esque twist where    you realize you've been playing the game wrong the whole time halfway through    and it has light-hearted humor. it's hard yet rewarding, the only other thing i could hope for is Steam achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Great Indie game Remind me of my childhood with those playtations.  GOOD GAME *GG*",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing game! suprisingly difficult but so fun to play. I definetly suggest playing it.",
            "review_score": "1"
        },
        {
            "review_text": "A cute little roam through a whimsical world where you solve everyone's problems by shooting them (the problems). The music is borderline 'too happy' but otherwise a fairly amusing experience.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and cute indie game with a nice soundtrack and charming dialog. Plus this game is free, so you should at least try it out. I'm actually excited for the second game to come out.",
            "review_score": "1"
        },
        {
            "review_text": "After seeing this game in my recommended list for several months, I decided screw it and gave it a try. Needless to say, this game was more than I ever could have expected.  The story is incredibly simple, but seeing as this game is only about an hour long, its still very satisfying and enjoyable. This game has a very large number of endings, each determined by whom you decide to marry at the end of the game, it's honestly astounding how many people you can marry, and its clear that a lot of effort and heart was put into the endings, as you can marry just about every NPC in the game, plus some stuff that isn't even NPC's!   The game itself is litered with fun secrets, hidden rooms, secret passages, etc. Plus a short sidequest near the end. The NPC diolouge is quirky and enterntaining, all of these help increase how immersive and captivating this game is.  PR in a World of Hurt is home to some extremley addicting shoot-em-up gameplay. There are three levels of difficulty- Normal, Hard and Master. Normal mode is pretty easy, but the two higher levels provide a real challenge for fans of bullet-hell senarios or people just looking for an excuse to snap their keyboard over their knee. Attempting to get a 101% on master is seriously one of the most painful and frustrating things I've ever done, but it's still loads of fun doing so. Throughout the game, you can collect upgrades by opening chests, which make you more powerful in a variety of ways. This leads into yet another way the game excells, it is paced perfectly. Even though you get stronger as the game progresses, the enemies and situations you are put in still get progressively more difficult, starting at pushover in the begging and get to decently challenging towards the end. You never feel overpowered or that the game is rigged against you (Except in master).  Princess Remedy in a World of Hurt, while it may be very short, it's honestly one of the best experiences I've ever had on Steam, or PC gaming as a whole, and games like this are a shining beacon of the possibilities of Indie games. This game is only about 50MB, installs almost instantly, and best of all, it's absolutley free! Given this, I see no reason why anyone should not try this game out, trust me, you will not be disapointed.",
            "review_score": "1"
        },
        {
            "review_text": "A fun half an hour, story and music mix well!",
            "review_score": "1"
        },
        {
            "review_text": "The vibrant neon atmosphere, humorous dialogue, and even a bit of challenge make this a charming game with personality. A fine way to spend an evening. I'm looking forward to the sequel.  Gamepad recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It is not many a game that can ooze this much charm, look this GB-like, and get away with it. Looking forward to finding ever secret and getting all the things. Omg, AND there's a sequel planned! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Supremely endearing with humorous writing and terrific presentation and music. While the gameplay is already fun, it's rewarded by the writing before and after each encounter. There's no reason not to play this one.  If you have a problem with getting the game to stop running, use the Safe Mode option when opening the game.",
            "review_score": "1"
        },
        {
            "review_text": "Tons of people say this game is short. ♥♥♥♥ing casuals aren't playing on Master difficulty and going for the chest you can only get by not opening any other chests before it. When you do this run its literally not fun. Its just hours of hating yourself. First 25 hearts are fairly easy to get without failing more than 2 times on a mission. But you sadly need 28 to get the jealousy chest. ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "This was a really well done game! The diolouge was very entertaining (I even laughed out loud at some points) , many of the battles were challenging and required different stratagies, and the music was solid. Short in length, but with high replayability. I hope to see more from this studeo in the future!",
            "review_score": "1"
        },
        {
            "review_text": "good game. cool game. fun game. cool ending fun stuff its free you should play it cool stuff.",
            "review_score": "1"
        },
        {
            "review_text": "A little bit challenging, a little bit short, and a lot of fun with a lot of heart. I'd definitely recommend it, especially at the low, low price of 'free'. It's an action rpg adventure with bullet hell sections, fun chiptune music and a unique look. Don't expect to be in for a long slog (I beat the game in an hour) but you'll definitely be coming back for more. I kind of feel bad for not paying anything for it.",
            "review_score": "1"
        },
        {
            "review_text": "Cute retro game with witty dialogue.   Aaaand, you can marry anyone you want, including, but not limited to:  = Prince = Dark Lord = Your ex = Mummy = Slime = Flowers = Duck Lord = Some girl",
            "review_score": "1"
        },
        {
            "review_text": "A cute charming game where you cure the hell out of some hurt, it's free and short and great so play it already!",
            "review_score": "1"
        },
        {
            "review_text": "This game is legitimately fantastic! Not only is the gameplay fun and entertaining, but the whole premise is great! The fact that the player is healing everyone of their various ailments (whether being simply bored, unwrapped, sick, or even heartbroken!) is really a great encouragement to those of us who need healing... and who are kind of tired of games where killing and blood is covering the screen. As a Teacher in Training, I wouldn't mind letting kids play a game like this in the classroom for fun (not educational reasons.) This game was worth way more than the price - which is free! I know I sound like a cheesy television promo but SHAM-WOW this game is phenomenal. Loved finding all the secrets, as well as playing it multiple times!",
            "review_score": "1"
        },
        {
            "review_text": "I married a 6 years old girl, then a seal, then a spider, then the guy who used to clean the Prince's chamberpot. 69/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an incredibly neat game!  I know I am late to the party, and they already anounced the sequel, but better late than never! The little interactions with each new character you help heal in game is just icing on the wonderfully nostalgic throwback cake. 10 out of 10 would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Fun little short game. Honestly, if you don't like it, it'll be over soon enough, so just give it a shot.  That said, it's pretty nice. Part of your dual-stick shooter senses might take over so don't forget that it's a one-button, one-stick game.",
            "review_score": "1"
        },
        {
            "review_text": "I married a jelous chest!  10/10 will heal again.",
            "review_score": "1"
        },
        {
            "review_text": "Two words BAD-♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "This is perhaps the most epic game i have ever played in my entire life.  better than skyrim better than the witcher 3 better than fallout 3  this game has set a standard so high that i honestly believe there will never be another like it for decades to come.",
            "review_score": "1"
        },
        {
            "review_text": "Great Indie game Remind me of my childhood with those playtations.  GOOD GAME *GG*",
            "review_score": "1"
        },
        {
            "review_text": "Cured everyone of everything except stupidity. Married random flower and lived happly ever after. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I think I spent more time marrying people than saving them.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, fun gameplay and interesting characters :) For free it's a sin not to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic mini adventure, ideal for fans of Binding of Issac who want something a little different",
            "review_score": "1"
        },
        {
            "review_text": "This game is super cute! I Really enjoyed it! It does have a pretty steep dificulty curb at the end, so be aware. the final boss was really frusterating. The Graphics and game mechanics are really retro and adorable. I would probably rate it at about a 7/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "It is free so I cannot really complain, but I got bored. It is worth an attempt.",
            "review_score": "1"
        },
        {
            "review_text": "Really loved this game, was looking for something F2P just to fill an evening and I ended up sinking a 'happy hour' into this one. The characters and art style are charming and the humorous dilect helped to get me invested. The gameplay is what impressed me most though, at first I found it frustrating but I quickly came to enjoy the challenge! Also, quick thanks for making the many unique endings so accessable with the save points, kept me coming back.",
            "review_score": "1"
        },
        {
            "review_text": "Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   Rage...  Loss...  Sorrow...  Can they really  be healed ?  The pain  lets us know   we are alive...  Your healing  is not needed  in this world!   ",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet, funny. Simple, but poignant. One of the best games I've played this year. It clocks in at just about an hour, every minute of which is immensely enjoyable.  Also, when the graphics go all ZX. +++",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game, cool battles and funny puns  Also it was kept short, so its a nice small experience",
            "review_score": "1"
        },
        {
            "review_text": "I am extremely displeased by the risk-reward payout of this game whilst shooting for 101%. Certain battles, for example the Old Queen and two of the battles in the Spider Cave, are highly luck-based at the point of the highest difficulty and the Moon Garden Secret. After spending a ridiculous amount of time (the majority of my 100 minutes), I have given up—and given into temptation to see what's in the pesky personified treasure chest. It's nothing but a generic power-up, which pales in comparison to the gross difficulty of taking on the first part of the game without any power-up pills.  TL;DR? The 'secret' chest requires a ♥♥♥♥ ♥♥♥♥ing ton of skill, luck, and time; it gives nothing of value. Not even an achievement to make it worth fighting for.",
            "review_score": "-1"
        },
        {
            "review_text": "If you enjoy a good challenge, don't buy this game. If you enjoy a game you can 100% with a bit of stubbornness and some time, play anything else. If you enjoy a game that feels like the gameplay was really thought through, don't look here. Remedy is a game I'd describe as a boring run though or a hair tearing teeth breaking monitor punching four hour frustration. The difference between master and normal mode is the difference between a bed of nails and a floor with a blanket on it. Unenjoyable, completely luck based, and god help you if you try to go for the jealous chest in master mode because you might just go postal before you even reach the right area. This game is for anyone who wants to hate themselves and spend hours trying not to punch their computer. Don't waste your time since it could clearly be spent playing a game that felt like it had SOME thought put into it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a one stick shooter, you can marry anyone at the end and get a seperate ending which I guess it's fine?  It's a solid game, but it's very short, I don't understand why people are so hyped about it. It's a good half hour game but you can get games that I would consider to be better on flash sites.  The only thing I thought wasn't medicore was the final boss music, that was rad as all heck.",
            "review_score": "-1"
        }
    ]
}