{
    "app_id": 407980,
    "name": "Sakura Beach 2",
    "release_date": "2015-11-06",
    "developer": [
        "Winged Cloud"
    ],
    "publisher": [
        "Winged Cloud"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Sexual Content",
        "Nudity",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Nudity",
        "Anime",
        "Mature"
    ],
    "achievements": 0,
    "positive_ratings": 286,
    "negative_ratings": 100,
    "price": 6.99,
    "description": "It's been a few months since Seiji last visited the beach. After enduring the chaos of his new daily life, another holiday with his childhood friends is just what he needs. However, the appearance of another girl whose love of space rivals his own ensures that his trip will be anything but peaceful.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/407980/header.jpg?t=1485965127",
    "minimum_requirements": "Минимальные: ОС: Microsoft Windows XP/Vista/7/8 (32 bit or 64 bit) Процессор: 1Ghz Оперативная память: 512 MB ОЗУ Видеокарта: DirectX® 9 Compatible Graphics Card DirectX: Версии 9.0c Место на диске: 200 MB Звуковая карта: Any audio output",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "First thing i have to say, it's i'm really fan about Winged Cloud game, but this time, i'm sorry but i have to trash this one.  All choice you can make don't have influence on the game,  you can make all choice you want that will never change the story, that's sad for this type of game.  Of course, in that way, you'll unlock all extra after end the game, so no difficulty, no 'challenge', nothing. But the first game was done in the same way.  And like the first game, no hentai patch, but it's not really important about this.  Anyway, This game is well designed like all Winged Cloud game, the story is 'ok' i guess.  So, in my opinion, in promotion, this game is worth to buy, but full price i don't really think so",
            "review_score": "-1"
        },
        {
            "review_text": "The second entry in the Sakura Beach   '    workout   '   games    ;)    Pros:    Great left hand work out    Experience the beach without actually having to leave your dark windowless room    Great 'Plot'    One of the girls has a body pillow with you printed on it    2 weeks worth of 'Workout material'   Cons:    No shiny boobies as with previous sakura games    Girls didn't actually let you go fishing when given the option    Adds the 7th game that I have to keep running   69/10 Would reccomend another VN with reused assets from the last game",
            "review_score": "1"
        },
        {
            "review_text": " Click here to see all the worst moments of the game.   As hard as it is to belive, this game is even worse than the first Sakura Beach.   It's clear that this game is a cheap cash grab. There's no additional background artwork, no new music tracks, Momoko and Ayumi have exactly the same character models as they did in the last game...  The best that can be said about Sakura Beach 2 is that it is longer than the first one by about an hour and a half; however, this turns out to not be a positive thing as the story is apallingly bad. Somehow, Ayumi's character has gotten far more annoying than she was in the first game, and by the end of the game you will find yourself hurriedly skipping through her scenes just so you don't have to listen to her cringe-worthy dialogue anymore.  For some reason, the appearance of a new girl makes the choice at the end of the last game completely moot, as none of the characters act like Seiji is in a committed relationship.   When you add in the numerous spelling and grammatical mistakes, it becomes clear that Sakura Beach 2 is the worst game Winged Cloud has ever made.",
            "review_score": "-1"
        },
        {
            "review_text": "although i liked this game, i want the next one to be more than the original with one new character",
            "review_score": "1"
        },
        {
            "review_text": "Went to the beach another time, found 10 bucks and bought another sakura game.   10/10 would buy another one.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't play Sakura Beach 1 before playing this game. But after going through the game, it was pretty stupid that the main character didn't want any 'girls' to either kiss them, or flaunt their goods in his face. Most guys in that position would happily accept the two-lovers thing. So having only two options for a majority of the game, was pretty silly. However, I quickly found myself engrossed in the story, and where it would go. I don't think I'll be replaying it anytime soon, however, I can definitely say it was worth $2.74. Is it worth $10? Maaaaaaaaaybe. I mean, the art is BEAUTIFUL! There is a genuine care for the characters, but there is a 'I wouldn't do that' feel to a majority of the statements, or choices made in the game. This game would benefit greatly from Telltale's The Walking Dead series, where they give multiple options for various parts in the game. However, I can fully say that I did enjoy the game, and after seeing through all the endings, I can say the game was good. I even felt myself feeling sorry for the other women, when choosing only one character.  All in all, I can say this is a good game. In my honest opinion, it'd be more affordable if it was $7 at most, but that's just me.",
            "review_score": "1"
        },
        {
            "review_text": "It's cute yo.",
            "review_score": "1"
        },
        {
            "review_text": "its ok  i give it a     10/10",
            "review_score": "1"
        },
        {
            "review_text": "Still better than Fallout 4",
            "review_score": "-1"
        },
        {
            "review_text": "The *cough cough* plot is very warmhearted, Smooth, provoking*cough* and nice! I love these graphic novels for the plot how dare you buy this for dirty things. 10/10 Novel.",
            "review_score": "1"
        },
        {
            "review_text": "People claim to be fans of Winged Cloud and Sakura games but doesn't seem to know that this game is made by a different artist than the other Sakura games and this artist doesn't do hentai scenes (yet anyway). Story is a bit shorter and it seems the choices doesn't really change anything in Sakura Beach 2. Winged Cloud has said that this is more of a side project so I didn't have any expectations going into it which means I wasn't disappointed by these facts.",
            "review_score": "1"
        },
        {
            "review_text": "Me dard Kiven bought me the game so he could get some time with mama and it turned into the best 6 hours of my life. Thank u papa",
            "review_score": "1"
        }
    ]
}