{
    "app_id": 408000,
    "name": "Cinderella Escape! R12",
    "release_date": "2015-11-16",
    "developer": [
        "Hajime Doujin Circle"
    ],
    "publisher": [
        "Hajime Doujin Circle"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Nudity",
        "Mature",
        "Anime"
    ],
    "achievements": 8,
    "positive_ratings": 259,
    "negative_ratings": 65,
    "price": 3.99,
    "description": "Cinderella is locked in the dungeon. What happened to her? Can she escape the dungeon? Cinderella needs your help!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408000/header.jpg?t=1540666766",
    "minimum_requirements": "OS: Windows vista, Windows 7, Windows 8 Processor: Intel dual core 2.0GHz or better Memory: 2 GB RAM Graphics: DirectX@ 9 Compatible Graphics Card (Shader Model 3.0 or better) DirectX: Version 9.0a Storage: 600 MB available space",
    "recommended_requirements": "OS: Windows vista, Windows 7, Windows 8 Processor: Intel dual core 2.0GHz or better Memory: 4 GB RAM Graphics: DirectX@ 9 Compatible Graphics Card (Shader Model 3.0 or better) DirectX: Version 9.0a Storage: 600 MB available space",
    "reviews": [
        {
            "review_text": "The Game has pretty much been summed up in other reviews, but I just want to give a quick insight. When I first saw this game on steam I thought that it would be a game in a similar vein to Illusion Software's titles, based around the neat-ish concept of Cindrella. I thought it was kind of cool something like this could actually show up on steam (on the front page), as it gives it a greater feel of legitimacy, and I couldn't resist the low price. I saw the R12 rating and done some research, obviously finding about the so called 'R18' version of the game, I installed the unoffical patch immediately before playing. See Paragraph 4 for differences.  I jumped into the game kind of expecting a different sort of experience to the one I got. I was expecting something light weight, and relaxing that didn't require a huge brain or time commitment and was perhaps mildy sexually stimulating. After Playing The First set of Dungeon's (basically the tutorial), It was clear it wasn't that, I expected some crazy over exaggerated japanese story to kick off (around the actually decent gameplay), with some explicit content in it.   The Game reminded me of Atlus' (excellent) Catherine for a bit, with the block puzzles and general themes. Sadly the similarities stop there. This game basically has no story content outside of the openining cutscene. After finishing the first set of Dungeons, I moved onto the second, only to be dissapointed. I only really went as far as I did due to nostalgia for how good that game was. The sad thing is the puzzles in this game are actually half competent. Someone has clearly put a bunch of work into making them, but the game needs some substance to hold it together, and it has none.  The Whole 'R18', 'Adult Game' thing is simply ridiculous, and truthfully a scam, as well as a marketing ploy. There is one file difference between the two verisons (file can be found via many steam community guides). And the fact they they are charging 3 times the price for that version is ludicrous. Even in the R18 verison the adult content is extremely light. I switched back to the R12 verison for tetsing purposes. The only additions in the R18 version are more sexy costumes to buy, the ability to remove her skirt (seriously no where near nude), Also a breast size slider (You can scale a polygon), and lastly the inclusion of Torture Traps. The last one is the most meaningful addition as it adds various traps you can interact with around the levels, which cause cindrella pain, They are generally very simple animations, definitely nothing to get *excited* over. I am not a fan of censorship, but this is hardly even that. The traps feel like they were part of the original game, the rest feels stupid and tacked on. There is no real reason why the R18 verison of the game couldn't have be put on steam, other than the fact it was being marketed as a game for adults, and probably so the developers could trick you into paying for their version.  The Gameplay itself is sadly ok. Nothing special but with an ok story and/or adult content elements (actually just and, there would really be no point in a remove all clothes button) this could be ok. It is a little buggy, jumping and movement could be a lot tighter, but it is sort of fun and somewhat challenging. If there was any reward for grinding through these levels at all (even if it was just a borderline bad story), then it might actually be worth completeing. And for some people it might still be worth completing. It is not a bad game by any means.  The final verdict is this game lacks substance in almost everyway. There is no story, it has slightly buggy gameplay, and the whole 'censored' thing is stupid. This game is very middle of the road, but regardless an interesting addition to my steam library and not a purchase I regret (Priced any higher I would have felt ripped off, but then I probably wouldn't have bought it). It's just a real shame the developer decided it wanted to market this game to pervets instead of gamers, with just a little susbstance, I would actaully go as far to say it's alright.   Reccomended Yes or No is hard, I am going to say not reccomended, simply due to scam that is the R18 version which I did not pay for.  Overall 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Cinderella Escape is a block puzzle game with 3D graphics. Your main goal in this game is trying to solve the puzzle to allow escape from current level. The game story a bit new variant of a original cinderella, she saw that when Prince murdered a King, Prince noticed that and after this she and her whole family been thrown to the dungeon. When you escaping you have choice to save your stepmother and two sisters. All this completed in a anime style. The gameplay is enough simple, you should escape from stages, for this you have a different ways. For escaping you have two limited resources, the jumping and kicking. After all stage you got a experience points, your level is growing and thanks for it you HP to. The controls in a game enough good, a camera view you can change, but sometimes its not help too much . Sounds are enough good, and game music also nice. The graphic is not bad, Cinderella looks good, environment a bit simple but fit for purpose.  So my verdict   +nice music +some moral choices +different way to escape +steam achievements  -no trading cards -a camera views sometimes not a best -a bit short  So i think if you like a lightsome puzzles, want check a one new variant of the original Cinderella story what confirmed in anime style, or want a rest a bit, I recommend this game for you. The game price is enough fair, so this cant be problem fro you, but if its get a bigger discount really can be must buy.  8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "A basic puzzle game, with not so easy from what I've played. A little bit of frustration to be had because it's all in 3D so rotating camera a lot, but I have found it to be quite enjoyable so far. Not sure what this is worth, but I guess the asking price is pretty decent.  +1 for physics.",
            "review_score": "1"
        },
        {
            "review_text": "It's short has good puzzles and who doesn't love a little fan service all in all cheap game to hold you over for a couple of hours.",
            "review_score": "1"
        },
        {
            "review_text": "It's a puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "A horny teenagers puzzle game. You play as a tied up cinderella with a loose crappy plot which is only thrown in to give the puzzles context. There's so much bondage content that it's obvious it was designed as 'How can I make a bondage game on steam and not have it taken down, I know. Puzzles'.  The puzzles consist of getting to the end door using limited jumps and limited kicks, the number of each is judged by your level which is increased by completing levels... Kind of tacked on really. You can glitch half of the puzzles by jumping at certain angles or walking into the door from an adjacent even leveled block, completely bypssing the entire puzzle of the stage.  It really is porely made, at first I thought the puzzle aspect was worth it but by the end it just didn't make up for the faults.  Skip this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The ♥♥♥♥ swing",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept, great puzzle game, not much to say about it. Its simple yet fun.",
            "review_score": "1"
        }
    ]
}