{
    "app_id": 408250,
    "name": "Eagle Flight",
    "release_date": "2016-12-20",
    "developer": [
        "Ubisoft Montreal Studio"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Action",
        "VR"
    ],
    "achievements": 35,
    "positive_ratings": 160,
    "negative_ratings": 83,
    "price": 16.99,
    "description": "Developed exclusively for VR Eagle Flight sends you to the skies of Paris to experience the freedom of flying like never before! As an eagle, you soar past iconic landmarks and dive through narrow streets in order to fight opponents and protect your territory.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408250/header.jpg?t=1513616534",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 SP1 or newer Processor: Intel i5-4590 equivalent or greater Memory: 8 GB RAM Graphics: NVIDIA GTX 970 / AMD 290 equivalent or greater Additional Notes: Compatible HDMI 1.3 video output / 2x USB 3.0 ports",
    "recommended_requirements": "Requires a 64-bit processor and operating system",
    "reviews": [
        {
            "review_text": "I've played for a little over an hour straight now as if writing this and I can definitely say it's a good game and it's one of the few VR games that just feel... professionally made. There are a few things that may put people off about this game and that would be:  1. No motion controls, gamepad only - I love motion controls just as much as anyone, but the control scheme in this is actually really well done and to me it feels like the best way to do it in a game like this. You use your head to turn and the gamepad to speed up, slow down, shoot and use your shield. All in all it feels great.  2. Price - Yes, the price may seem rather steep after the current trend in VR games and I definitely wasn't sure about the price either, but decided to brave it and I'm glad I did. You have to keep in mind that this is a game made by a big development house for what is still a VERY small market so the price will naturally be a little higher than VR indie games made by teams of 1-6 people and regular 2D games. I personally think it's worth the price right now.  3. Uplay - There's not really much to say here, I'm not a huge fan of Uplay, but I'm ok with it. I've had my gripes with Ubisoft in the past and I'm sure I will in the future, but they are one of the few big time developers/publishers that seem really interested in exploring the VR market and supporting them could push others into it as well.  The game itself is great fun, I'm loving both the singleplayer and multiplayer, but the multiplayer is especially thrilling. A beautiful, polished and fun game.  One thing I would like to see that I believe isn't in the game yet is multiplayer voice chat, all 3 big VR Headsets have a mic I believe, so lets use them! Social VR is best VR.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Love the feel of flight. Only wish they were to use tracked controllers somehow. But that's not a big deal. Very well done. Even the loading screen didn't drop out to SteamVR. It displayed the entire time.",
            "review_score": "1"
        },
        {
            "review_text": "So good. So. Good. F*CK its so good!  Runs great on my 970 i5 4690k - it does lag ON OCCASION but doesn't break the game.  To the guy who said 'it looks and feels like an android game' - will you please direct me to these android games you been playin? because this game is awesome.  At first i'll admit i wasn't sold on the hmd controls - mostly because of hating every game/software I've tried that implements it. This frees that stuborn hate from my heart and replaces it with the awesome power of eagles.  When i started out I was playing very much with my head and neck - it took a while to realize using your whole torso along with your head/neck is far easier to control, more accurate, and takes the strain off your neck.. I ended up sitting crosslegged on my bed and had good results.  ALSO.. this is the first VIVE game that i can play to its fullest WITHOUT STANDING! (i work on my feet so i'm not always excited to stand during my free time)   The story mode lacks a captivating story.... its mostly excuses to go do stuff in the city but that doesn't bother me in the slightest Every mission is engaging and immersive. The flying feels great especially once you learn the nuances (which is important so you don't break your neck playing). The speed races underground are amazing and intense.. The missions that have you flying thru the city and chasing other birds and bats feels incredible and the enemies move very realistically swooping and diving all around you. The levels are NOT linear but also not completely open world and are designed to flow VERY well.  Yayaya - 'Ubisoft sucks' and 'Uplay can bite a ♥♥♥♥' but lets just grow up a second here and take the time to realize this is the first AAA quality game for VR -- They made it cross platform. They made it muliplayer. They made it fun. AND at $40 bucks it may be pricey compared to other VR games but its on the low end as far as AAA goes and frankly its WORTH it..   If you justified spending $35 on the piece of digital trash that is Hover Junkers and don't buy this game I'd be curious to know how you sleep at night.  IMO Ubisoft deserves a thank you for being the first large dev to stick their neck out there from anyone whos excited to see VR grow into more than a collection wave shooters, room escapes, and other shovelwares.  tldr: buy it. its sofa king fun    edit: update:   being able to turn 360 is a major advantage in multiplayer.. also.. you get a skill when you beat the single player story (you might auto get it in multiplayer i dunno) that allows you to look around without changing your flight directioin... however.. this allows you to look directily behind you (or any direction) let go of the button and instantly change direction which.... breaks the flow aspect of the game and is SUPER op cause i don't think alot of people know about it.There is also no voice chat in MP and you don't even have the ability to gesture so it feels a little lonely",
            "review_score": "1"
        },
        {
            "review_text": "As much as I love indie games, this game is a great example of the polish an AAA game developer can bring to VR. If you were ever that kid who would always answer 'flight' when asked what kind of superpower you would want (like me), this game is made for you. It's exactly how I imagine it would be like to fly, simultaneously relaxing and exhilarating. It controls as satisfyingly as a hot knife through butter. And I love the smaller touches, like how you can always see your beak in front of your face (which surprisingly enough doesnt get annoying at any point).   One thing I did notice is how the developers seemed to take a shortcut with some of the challenges by just reversing the story missions, having you go from finish to start, as opposed to going from start to finish. Normally I'd be critical of something like that, but I feel that this is a rare instance in which taking a shortcut in game development didnt negatively impact the game. The tunnel and crypt levels are designed in such a way that going backwards through the level still provides a challenge. It took me until I was nearly at the end of the game before I even realized that the levels were being reused! When they are hidden that well, I'm willing to give certain developmental shortcuts a pass. If I had one thing I'd change about this game, it would be giving the collectibles some sort of purpose, outside of merely being collectibles for the sake of it.  Anyway, if you've ever wanted to bird, this game is definitely worth the price. This game taught me how to bird, and it turns out birding is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best VR games I've played so far, and the first that legitimately made me lose track of time. The gameplay is relaxing and (sometimes) challenging, and enjoyable at all times.  A good point (which I read in reviews before, but I've seen it a few times before in reviews in which cases it wasn't 100% true for me): Ubisoft perfectly got motion sickness (or lack thereof) under control.  A minor issue is that you cannot reset (as far as I can see) the orientation (it takes the orientation of th headset during the startup of the game :/) in game.  Movement is done very well though, and moving by titlting your head feels intuitive within seconds.",
            "review_score": "1"
        }
    ]
}