{
    "app_id": 408280,
    "name": "Message Quest",
    "release_date": "2015-10-22",
    "developer": [
        "Royal Troupe"
    ],
    "publisher": [
        "Royal Troupe"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Puzzle",
        "2D"
    ],
    "achievements": 18,
    "positive_ratings": 649,
    "negative_ratings": 103,
    "price": 1.99,
    "description": "Message Quest is a tiny stained-glass point-n-click adventure about laziness and her herald. Imagine yourself as the main hero’s conscience, the one that must make him work when all he wants to do is sleep.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408280/header.jpg?t=1449317098",
    "minimum_requirements": "OS: Windows XP+ Processor: Intel Core 2 Duo 2.8Ghz or equivalent Memory: 1 GB RAM Graphics: DirectX 9 compatible video card with shader model 2.0 support DirectX: Version 9.0 Storage: 512 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wow. Quality artwork. Great story. It's short but what a journey.   This is a point-n-click style game. A few puzzles, not very many and not very difficult. And a few 'battles' as well. Awesome graphics. There are voices but it is a nonesense language just for background effect, but it does portray the emotional state of the characters well. (Reminds me of an exercise in drama school where we had to do a scene and the only words we could say were 'Mary had a little lamb'. IT's amazing how much you can portray by voice inflection and stuff like that)  You help the main character become a reluctant hero. He just wants to sleep instead of doing his job. You have to literally drag him with the mouse to the edge of the screen in order for him to move on. He complains all the way through the game. He has to deliver a message scroll to a hero in order to save the land from impending destruction. Along the way he meets other characters that become involved in the story. I won't spoil anything for you, but there is a neat thing they do in the game after you reach the 'end' of the story they do a flashback and show what happened earlier but from another character's point of view. It gives a different twist to the story. Very nice storytelling.  One of the main puzzles is to create a path across a chasm by choosing small pieces that will fit together. Then there are the battles. You have to battle by choosing from a few options, like damage opponent or heal or defend, but they are not written that way. They have phrases that are specific to the characters. There are some battles where you have to do more strategy that just attack and defend. There's also an option to increase attack or increase health. So spend some time alternating between those and healing and then once your attack is high enough you can go for the kill. Though you don't actually 'kill' anyone. It's more like you defeat them, they give in to your demand.  There's lots of humor in this story. Sometimes it even breaks the fourth wall and talks to you, the player. I love that kind of stuff. Oh, and the game is kid-friendly. I dont' think there's anything that will offend anyone. It's really a game for all ages. It's not neccesarily aimed at kids but it's not aimed at adults only.   Graphics are cute, charming, kind of like stained glass or woodcuts or mosaics artwork.  Total playtime: about an hour or so. There are a few hidden things if you want all the achievements, so you might have to replay some sections.  tl;dr version:  great story great art point-n-click gameplay some puzzles (easy to medium) voices but not in a real language (like the schoolteacher in the old Charlie Brown and Snoopy movies) 1 hour playtime",
            "review_score": "1"
        },
        {
            "review_text": "Message Quest is a game where you must help the characters save the world. Wait that's not entirely right. Message Quest is a game where you laugh at while helping the ridiculous characters in the game and solve puzzles in order to eventually fight the Big Bad namely laziness and fear!   This game has cute art and funny little characters. It combines several different types of tasks, from jigsaw puzzling &amp; wave forming, mock RPG fights, to tetrising. Explore this world while helping characters achieve their true potential. Just beware, because not all may be as it seems.   Sound: Quite funny, but appropriate. The music is rather soothing, and the voice acting is ridiculous... but funny.   Graphics: Everything is made to look like stained glass, which is an interesting route for a game to take. Quite different and cute, the art is nicely done. Very unique in this case.  Story: Quite ridiculous. Actually made me laugh out loud a few times while playing. The characters have such weird motivations and interactions, but they tend to be amusing though they are ridiculous.   Overall: 7/10 - For an hour of fun, try to get a copy of this, it's definitely worth playing at least once. The price tag isn't too bad for what it is and you'll likely get a good laugh out of the game at least once. It was in a few Greenlight bundles and if it ever comes up in a new one, snag it. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Message Quest is a casual adventure/puzzle game done by Royal Troupe. Message Quest is done with entire stained glass art that's fantastic. It's about a extremely lazy hearld, whose the last to do a job after the location he's at has issues. He tries to find ways to be lazy about everything he does, but eventually comes around.   I recommend this game highly to anyone based on it's graphics, story and humor. When fighting the NPC's, I recommend muting the sound, it was a bit aggervating to hear repeated often. The game is incredibly short, but leaves you with a desire for more, more, more! It's a point-n-click style game with some puzzle elements that aren't incredibly difficult. For the price it's set at, it's a steal. I hope to see more from this developer sometime.",
            "review_score": "1"
        },
        {
            "review_text": " A gorgeous pop-up book that will never fray or tear beyond use",
            "review_score": "1"
        },
        {
            "review_text": "Cute little point and click, has a neat art style, likable characters, and a nifty meta sense of humor. For three bucks, it's a pretty solid buy.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really simple, and easy to play. The story is incredible, and left me wondering if there will be more of it in the future. There was lots of questions that I had that I wish I could have answered. It's really short, which was sad considering it was so much fun to play. It's also really relaxing, and a good way to releave a bit of stress.",
            "review_score": "1"
        },
        {
            "review_text": "Cool adventure game.  Nice!",
            "review_score": "1"
        },
        {
            "review_text": "Not a very long story, but what a great way to spend an hour or so. A very relaxing game, and it's pretty funny too! Definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute game. The puzzle were rather easy but took a little time to solve. I would recommend if our looking for a short game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Eeeeee~  So adorable and cute! gotta love it! ",
            "review_score": "1"
        },
        {
            "review_text": "I devoured this game in an hour. Beautiful and surprising in its twists and turns. I wish there had been more!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. Fairly short bur loved it! Hopefully more will follow soon!",
            "review_score": "1"
        },
        {
            "review_text": "Perfect to play with others and roleplay.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This was a very cute, well done game, but I thought it was too short. Looking for a cute, amusing story that you can complete in approx. 2-3 hours? Look no further.",
            "review_score": "1"
        },
        {
            "review_text": "It's ~1h of gameplay. I don't think there is any replay value, because even if you can change what the characters talk, it doesn't change alot, it seems. It's a cheap game, so it's worth it. Nice art and sound, nice plot and nice ending.",
            "review_score": "1"
        },
        {
            "review_text": "Very nearly the perfect game for a kid, just starting in gaming. It does however have a few moments which raise the appropriate age group slightly. I could picture someone useing this as an interactive bedtime story were it not for that.  +/- The game is very short &amp; The puzzles are simple enough for a casual gamer or someone new to gaming. + Handy game for acheivements &amp; cards. + Nice and unique visual style - No replay value  Q : 'Should i get this game?'  A: 'If you wan't a simple game, with a bit of a story &amp; some jokes mixed in. If it's quite cheap &amp; if you wan't a game you can relax with'  Side note, It seems optimised for a Tablet.",
            "review_score": "1"
        },
        {
            "review_text": "Get this as cheap as you can, because it is ridiculously short. The story and the format are PERFECT. I could have played it for days. Alas, there was not that much material. Even drunk, I finished the puzzles so quickly that I almost cried (but that might have been the vodka....). However, please buy it and support these guys. They have a lot of talent.",
            "review_score": "1"
        },
        {
            "review_text": "  Message Quest  is a beautiful storybook featuring charming characters and a strange little tale, unfortunately marred by obediently unimaginative gameplay and derivative puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "Short, relaxing and very sweet.",
            "review_score": "1"
        },
        {
            "review_text": "I am very sorry to say that I can't recommend this game. It's not that the game isn't beautifully made, the stain glass style is very beautiful and fully represents actual stain glass. I also like the idea of a young lazybones being forced to go on a journey. The parts I have issue with is the story.  It is a bit cliche to send the hero on a journey to save the world, but I could have looked over it if I didn't finish the game in less than two hours. This might just be my opinion, but saving the world should take longer than doing a load of laundry. As I played, I found myself getting bored not only in the story, but in the entirity of the game play. It is highly misrepresented as a point and click adventure when 90% of the clicking is so you can get through the dialogue boxes.  Another thing that I take issue with is the lack of answers I got at the end of the game. So many things were alluded to and just glossed over and then never mentioned again or explained that I actually felt relieved when it ended instead of satisfied.   It is not that this game doesn't have massive amount of potential, but it is far to short to be a satisfactory adventure game.",
            "review_score": "-1"
        },
        {
            "review_text": "A beautiful, adorable, short little game.",
            "review_score": "1"
        },
        {
            "review_text": "The worst part of this game was the brown refugees you have to rescue. Keep your political BS out of video games.",
            "review_score": "-1"
        },
        {
            "review_text": "It was a short an enjoyable game, it took me less than an hour to finish it with 100% achievements done (it appears less because I played it while offline). The artwork is nice, story is interesting, puzzles/fighting is fairly easy. My only problem was that the game is very short. Considering the price, I would recommend getting it on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty impressive little adventure/comedy/puzzle game. It can be easily 100% achievements in about 2 hours, without any difficulties, just finish the story and use the guide if you missed any achievements by mistake (there are 3 missable ones). The puzzles are quite easy, but sometimes it just takes time to figure out how to solve them because there are no hints on what you should do and how you should do it :).  I enjoyed every moment of playing it. The finctional language it's using is really funny to hear, dialogues are also really funny. Cartoonish graphics but in a good way.  I can recommend this game.  Indeed there'll be no replay value, but that's the same for all these point'n'click adventure games. It's definitely worth 1 playthrough though. Also bought it in a bundle, so almost got it for free.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  -Amazing art -Pretty good story  -Different, yet good battle system -Very cute overall  Cons:  -Very short, I finished under an hour -Puzzles either too simple or confusing -Sometimes unclear directions -Story seemed rushed -Ending was a little disapointing  Overall: A short, cute game with really, really good artwork. The story was decent, about as good as you'd expect. It's only $3, so it's good for it's price. Overall I'd rate it a 6/10",
            "review_score": "1"
        },
        {
            "review_text": "A short, cute game about a deserted guild of heralds and one young boy that has to go on a quest to find a hero who can save the world. It's predictable and it breaks the fourth wall in a way that I wouldn't consider tasteful, but the story is adorable and the combat is very funny (you attack with things like guit and exercise, it's a very quirky yet classic system). Like others have said, it's definitely a game that's more geared towards children than adults.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed the game. Wish it was longer.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little gem, well worth it",
            "review_score": "1"
        }
    ]
}