{
    "app_id": 408400,
    "name": "Swords and Sorcery - Underworld - Definitive Edition",
    "release_date": "2015-12-15",
    "developer": [
        "OlderBytes"
    ],
    "publisher": [
        "OlderBytes"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 20,
    "positive_ratings": 55,
    "negative_ratings": 12,
    "price": 10.99,
    "description": "Swords and Sorcery - Underworld is a party-based, first person view role-playing game with turn-based combat and a square grid 3D environment. The art was made by a professional comics illustrator.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408400/header.jpg?t=1466352833",
    "minimum_requirements": "OS: Windows XP or better Processor: 1.6 Ghz Memory: 1024 MB RAM Storage: 200 MB available space",
    "recommended_requirements": "OS: Windows XP or better Processor: 2 Ghz Memory: 2048 MB RAM Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I played Bards Tale in 1985. Lovely game.  99 Barbarians. Only being able to save in the Adventures Guild. The eerie music from the temples.  Brian The Fist. El Cid. A bard that needs to take a swig of his wineskin before playing some musical tunes. Four mage classes. A mad monk that fights with only his hands and feet.   I could go on. A masterpiece. Played it again for 60 hours a few years ago when the original games were included in the later and mostly useless comedic Bards Tale remake.  Between 1985 and this day I have always asked why no developers have wanted to create something like that. Where are the mainstream Bards Tale games?  So huge, HUGE credit to OlderBytes for not only asking the question but for putting their money in and developing this gem.  A dungeon crawler, turn based combat. Grid based movement. Locked doors. Treasure. Healing. Items.  Experience points. Exploring.  Exploration is one of the game's best points. You would think that map design on a grid is pretty easy. But I can tell you about some awful, awful games where the maps were obscene or even ♥♥♥♥♥♥♥♥. The maps in this game feel really well thought out. They really made me want to explore every nook and crook and are quite varied.   I reckon the game developer must be a proper gamer himself as in every town I visited, the place I wanted to visit first was the last place I found. Last place - each time. Diabolical game design or bad damn luck for me? I am talking about the shop or that one time I needed food. Where the heck are they?  The games graphics are very competent and unusual. Encounters can be interesting as the bestiary is quite varied. The game is smarter than it looks. Old school game play has been upgraded in some ways, such as requirements to plan ahead and create holy water for your priest. My Thief had a Stun option. I loved my thief as once hiding in the shadows he could one shot kill some nasties. He was also able to find daggers that had extra assassin damage - lovely. I can't imagine having a party without a priest as healing in the midst of battle was crucial to my experience.   Undead. More of those folks than in an episode of The Walking Dead. Another thing new to the genre is that my party had to be 'Blessed' before they could apply any damage to the foul creatures. I even came across a lava/ fire area I could not traverse until I remembered I had a 'levitate' spell. Cool.  The combat itself is quite interesting and requires full concentration as it is easy to get whacked if you assume spamming Attack will get you through. Combat is almost like little puzzles where you need to figure out who to go forward, who to heal, who to drop out of melee. There is even one option that allows one party member to protect another. My priest has a spell that allows her to read minds in combat which then builds up your Bestiary. At this point, I can't be sure whether this is useful in game or useful building a Steam Achievement. Still interesting reading the text.  It's not all hugs and kisses though. Just one thing.  One shot kills. Save scumming. I hate it and this game positively encourages it.  I would really love to know how many fights other gamers can go before saving. Really. What is the record so far?  It breaks the immersion of what could be a fantastic game. Behind every nook and cranny there is an encounter that can wipe out your whole party and kill you stone dead. No notice. No warning. Return to 'GO'. Behind every nook and cranny and even in nooks you have even visited before. It's the random encounter generator or level list or something.   Something that can really spoil the flow of the game. It stops me from giving this a 'I love this game' to 'I recommend you try this game'.  I will ponder on this final criticism of the game for now as I would like try it out for more.  Other thoughts?   Loot. Would be nice if some encounters left behind food or water.  Scrolls that can raise the dead if your party finishes an encounter a few men short. Encounters that leave behind food you can eat and heal yourself. Cough - some directions in town? Some unique save locations instead of save anywhere - would help immersion. Better armour/ equipment/ spells of mages. Those guys just die all the time.",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr - This game plays exactly like a game from the late 80s. Start out pathetically weak with no armor or weapons to speak of and pray to the RNG gods your entire party isnt 1-shotted. You're going to have to grind for gold and XP before you can even think about going and doing anything. Nice hand drawn art, minimal stereotypical sound, and some weird UI choices. Its not terrible, but it's not great either. Besides the cool images during conversation scenes, theres not muct to set it apart from the crowd. If it had come out in 1989, it'd be great, but modern grid-dungeons have come a long way since then. I'm only recommending it for hardcore fans of the genre who like games like the early Wizardrys where theres a lot of RNG luck and grinding just to stay alive.   __________________________________________________________  This is an true-to-the-late-80s turn based dungeon crawler with interesting hand drawn graphics. The graphics are rendered in great detail, with plot scenes being shown with static full screen brightly colored comic book-style art.   When I say 'true to the late 80s', I mean it. Unlike many other games that took what was great about that era's RPGs and left the rest, Underworld really makes you feel like you're playing a game created in 1990 but with a unique art style.  Your characters start out pitifully weak with nothing but an extremely low level melee and ranged weapon. No armor, no gold, One slap of the RNG god and you're going down to a random encounter due to how pathetic your characters are- one hit knockdowns are the norm until you reach level 2 and/or get some better armor and even at level 2 they're very common.   Fortunately theres an 'unconciousness' state that incapacitates a char before death, but one hit while in that state and its off to the temple to pay a fee for res. To get even semi-decent, you're going to have to run around town grinding random encounters for gold to get your chars even marginally equipped. I feel like I'm playing the early Wizardrys here. Did I mention how much I *hate* grinding? I did way too much of it in the actual 80s, I guess. There's a reason many RPGs dont have grinding anymore, its not fun to most people. Fortunately, there is an item repeatably dropped by a certain random enemy type you can trade to the guard blocking the catacombs for 100g and 20xp. Unfortunately, you have to run all over hells half acre trying to encounter that specific enemy type. Oh, and you can't just level, you have to train which costs gold. And it takes a *lot* of XP to level, but all you get out of it is 3 skill points.   Theres a mini-map in the corner (thank god), and apparently a larger world map that has places of interest marked. I still like making notations on maps - guess it comes from my graph paper and pencil days. Still, the minimap is nice - no graph paper needed. Once you get yourself equipped, you can head off to the catacombs and continue the plot, which revolves around a giant demon somehow being released and taunting the party when you leave the inn. Of course you are told by someone that your party has a great fate, which is, of course, to try and stop the demon.  Theres also sidequests. I'm currently doing a fetch quest at level 2. Level 2 seems to be a bit easier, not so many one hit knockouts. If this game progresses like most of the 80s games, you should get strong enough that the grinding isn't as required once you're out of the early game, but its still annoying and not a good start to the game.  The UI has some weirdness. Like most games of this style theres a bunch of quick icons on the HUD (char sheet, rest, system etc). I find it odd however, that in order to cast a spell you must go to the spellcaster's char sheet, then hit enter, then select the spell, but theres a quickbar icon for the tutorial. Which is a player going to use more? The tutorial, or the spellbook? But yet theres no quickbar 'cast spell' icon?   Also, to pick a locked door, you must bump into the door, which flashes 'locked' on the screen. Then you must select the 'unlock' icon. If you fail the picking, instead of just hitting unlock again, you have to bump into the door, get the 'locked' message, then hit 'u' or click the 'unlock' icon all over again.  For some unknown reason, when you fail picking a lock, it makes the same sound as the noise of someone going unconcious in combat. Which sounds like a punch/swing, and then a thud like someone getting hit and dropping to the ground. When you fail to pick a lock. Why? The first time I heard it, I thought there was a trap that went off. But no, thats just the noise it makes. The sound of succeeding to pick a lock is what youd expect, a metallic tumbler shifting and *click*. So why the weird fail sound?  Speaking of sounds, they are minimal at best. Theres a nice bird sound when you're in town. However, it plays even in areas that would be considered 'inside'. The rest is just the typical grunts, clangs, swoosh, growls and so on that are standard in RPGs. Nothing like that cool weird chant the brigands made in Wizardry 6.   Overall, Underworld is just OK. If you're a fan of the genre, its worth picking up ON SALE. But I hope you like grinding.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the old school Might and Magic and Wizardry games, you shouldn't miss this! I played the earliest version of this when Olderbytes first put it out it was great then and even better now. It really feels like what the old New World Computing folks did (minus an outdoor area, coming in the sequel) and brings back great memories of my first RPG (M&amp;M I), while still being fun and with a very nice art style.  The game is not easy at times, but you also don't really need to grind either (most levelling is just done via exploration especially after the first underground zone).  My only critques would be the lack of remapable controls or volume sliders (the game is rather loud compared to other games/media on my system) but those are minor.  Give this game a chance if you like old school RPGs - you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game with some high hopes and, in the main, it delivered. There was a VERY steep learning curve and battle was definitely not for the faint hearted. The old 'save often' slogan is a must in this game.   Once I got used to the holy water and rune system, I managed to slowly get on top of the game. Its not very generous on loot, in terms of equipment, but that only adds to the challenge. By the time I had cleaned out the town, catacombs and barracks and managed to defeat the arena, I felt I had a handle on it.  THEN I got to about L7 in the dwarf city and, all of a sudden, the game went into crash mode. Granted, the session I had just started was just after an update but whatever it was has broken the game and I just cant bring myself to go thru the pain and anguish of cleaning out the Catacombs and Barracks all over again.  Its a shame that the game is buggy as it had real potential IMHO  If the game wasnt broken, I could easily recommend it but, as it stands, I simply can't do that  UPDATE - Developer was very helpful and has updated game which appears to have heavily reduced the crashes and made the game very enjoyable. It still suffer from some sort of memory leak which frezzes you up occassionally but that is a minor hiccup and in no ay detracts from the game. Quite happy to change my mind on this one",
            "review_score": "1"
        },
        {
            "review_text": "Old school feel, perfect game for what it claims to be! I enjoyed it more than Might and Magic X. Sure in the graphic aera it is 25 years old, but all the RPG feel of the party evolution, the exploration and the ingenuity from the developer to make you feel like in an adventure with the somehow basic game he built were refreshing.  Well worth the 30 hours to finish and the 15 euros it worth.   ",
            "review_score": "1"
        }
    ]
}