{
    "app_id": 408640,
    "name": "Code of Princess",
    "release_date": "2016-04-14",
    "developer": [
        "Studio Saizensen"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Adventure"
    ],
    "achievements": 14,
    "positive_ratings": 125,
    "negative_ratings": 90,
    "price": 10.99,
    "description": "Code of Princess offers players an exciting yet unconventional experience, deftly blending the combo-heavy fighting gameplay of beat ‘em ups with the stat-boosting character customization of RPGs.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408640/header.jpg?t=1476981572",
    "minimum_requirements": "OS: Windows 7 / 8.1 / 10 Processor: Intel Core 2 Duo 2 GHz or faster processor Memory: 2 GB RAM Graphics: OpenGL 1.5 compliant video card DirectX: Version 9.0c Network: Broadband Internet connection Storage: 4 GB available space Sound Card: DirectSound Additional Notes: Controller recommended.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "i'm still early in the game but i like what i see so far, will update the guide later when i have more playtime  Pros - Great character design by Zero Escape artist, Nishimura Kinu! - Spiritual sucessor of Guardian Heroes (made by the same team) - 4 playable character in campaign and way waaaay much more for pvp &amp; stuff (i heard it's like 50 or something, you can play as everyone after all - including the npcs &amp; enemies) - burst system is really really fun, you manage your mp to do as many damage as possible - lock system is interesting for magic user, homing attack! - Level up &amp; equipment system - Multiplayer co-op works perfectly! - The game is pretty deep, at first button mashing works. Later you need to learn to block, when to change plane &amp; analize the enemy's behavior. As you get farther, learning when to use Burst correctly can really means winning/losing (burst can cancel your enemies' attack, very useful against aggresive mob).  Cons - I wish it's real 2D sprites instead of captured 3D sprites T__T - Some of the idle animations looks weird - Atlus quality translation (liberal)",
            "review_score": "1"
        },
        {
            "review_text": "A great port that runs well.  Pixellated sprites take a bit to get used to, but don't hamper the experience.",
            "review_score": "1"
        },
        {
            "review_text": "The character sprites could stand to be in higher resolution, but otherwise it's a decent beat-em-up reminiscent of the old arcade titles of the 90s.",
            "review_score": "1"
        },
        {
            "review_text": "Horrible clunky controls, annoying characters definitely disappointed..Please release Guardian Heroes.",
            "review_score": "-1"
        },
        {
            "review_text": "I have not played this for long, but I am enjoying it thus far. I really like the fact that it has Japanese narration. You can even change the text to Japanese, if you want to. Take the translations with a grain of salt, if you know or are learning Japanese. If you're catching on and understand the contextual meanings behind what they are saying, look at that as a positive to your knowledge. :-)",
            "review_score": "1"
        },
        {
            "review_text": "If you never played guardian heroes before, I feel so sorry about you.. so sad and sorry to know that you had no childhood at all... I mean I would sugest you to end it all since there is no point on living... BUT GOOD NEWS!!.. this game is the oportunity to get back all that lost time!!, is not as cool and fast paced as the original GH was, but Hell it feels good!, the extense characters pool, the instinctive combos, is all there, this is a spiritual succesor worth playing.. specially online so please DO BUY this jewel and jump over since for its price, is one hell of a deal for the fun it brings.",
            "review_score": "1"
        },
        {
            "review_text": "I really really tried to like this game but it is so bloody boring. Every freaking chapter is the same and you do the same moves over and over again my good cant believe it is so boring :/ If you must buy it, buy it when it is on offer.",
            "review_score": "-1"
        },
        {
            "review_text": "Input lag spoils the experience. :\\",
            "review_score": "-1"
        }
    ]
}