{
    "app_id": 408650,
    "name": "ChromaGun",
    "release_date": "2016-02-16",
    "developer": [
        "Pixel Maniacs"
    ],
    "publisher": [
        "Pixel Maniacs"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Action"
    ],
    "achievements": 22,
    "positive_ratings": 325,
    "negative_ratings": 34,
    "price": 9.99,
    "description": "Welcome to ChromaTec’s test lab! You’re here to test our state-of-the-art military-grade color-technology: The ChromaGun (patent pending)! Use it to solve our meticulously designed test chambers by painting the walls and droids. Remember how to mix colors from pre-school? Congratulations, you qualify!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408650/header.jpg?t=1494490557",
    "minimum_requirements": "OS: Windows Vista Processor: 2.0 GHz Dual Core Memory: 2 GB RAM Graphics: NVIDIA GT 460 or AMD Radeon HD 5550 w/ 1024 MB Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 8.1 Processor: 2.4 GHz Intel i5 Memory: 4 GB RAM Graphics: NVIDIA GTX 660 Ti or AMD Radeon HD 7870 w/ 1024 MB Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "I nearly didn't buy ChromaGun because I read in another review that the difficulty spiked and the game went from gentle puzzling to demanding serious dexterity. I'm glad I chose to try it anyway. For context, let me explain that I am an average gamer in my late-forties with serious sight issues, and yet I completed the game in around 10 hours with 100% achievements. The puzzles ranged from easy to mildly challenging. The basic mechanic of manipulating droids by changing their colour, or the colour of their surroundings, is a neat one. The devs have borrowed Portal's premise of a guy (or gal) going through test chambers. Critics might say this is unoriginal and I suppose they have a point, but at least it's better than the cheesy 'contestant in a deadly game show' format utilised by several of the other games in this genre. It also means Chromagun's levels are bite-size - some of them take a few seconds to complete once you're figured the solution - so if you screw up it's no hardship to restart and try again. This makes it a good game to boot up whether you have ten minutes to kill or wish to spend a few hours gaming.  To sum up, ChromaGun isn't an ambitious game. The graphics and sound are solid and unpretentious, it's slick and bug-free, and there's a welcome side serving of humour in the voice over. Recommend. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "  I loved this game, it is very good. I loved the fact you have to sometimes think outside of the box. The puzzles get harder as the game progresses and I found that to be a great thing for the game. This is a game great for all ages from young to old. I had a lot of laughs during my stream for my first trial of the game. I hope you all enjoyed the game as much as I did!   Pros: Great game design Fun Interesting Thoughful puzzles  Cons: A lot like portal with a twist A lot of white... I thought a little too short, additonal levels would have been nice. I think they should have made advanced. Speed-run is really long ",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that did a great update! Options for colourblind people! :) There are a lot of us out there that can't see all colours properly, so this was a refreshing update for this game. And it's dangerous to play, because time disappears. You always want to try 'just' another room, just one more...!",
            "review_score": "1"
        },
        {
            "review_text": "  ChromaGun is an entertaining puzzle game that has fluid controls, great music and Portal style looks and humour.  I enjoyed the overall feel of the game and the tutorial was very much part of the gameplay which didn't interrupt your flow. I found myself saying, 'Just one more level', constantly and managed to unlock many achievements. (Not all great or encouraging ones, but certainly funny ones.) I played this for a video and had a great giggle doing so.  While some puzzles are challenging and there is certainly a gradual increase in difficulty as you would expect. I found it to be a little too gradual for myself and was left wanting for levels offering greater challenge.  That said I will play it again, I want more achievements and I did have genuine fun playing it.  Happy Gaming Peeps!",
            "review_score": "1"
        },
        {
            "review_text": "Okay guys so i received copy of this game on my stream and i was happy that i can test this game by myself. Game us very modern and very cool. I love it big + for pixel maniacs. Thanks Alex. #niceboytv",
            "review_score": "1"
        },
        {
            "review_text": "  I finally finished the entire game, and did a full walkthrough/let's play of this game on my channel. Plus, I've earned all the achievements.  Anyways, I wish to thank all of the people who made this game, and with that, come with my honest opinion, so people can find this helpful, and as well, tell the people at Pixel Maniacs what I think.  Despite I got this for free from the company, I don't believe that should effect my opinion. The price should be lowered, since I can't see it being worth 13 Euros, when you can complete the entire game within a short period of time, around the 10 Euros would be more fitting.  I truly enjoyed the concept, the idea of a puzzle game, which involves colors, was something that I haven't tried before, and that was truly something different, than what I normally play. However, the game did seem quite short, and it has it's few moments that can be tricky. The only hard times, are when you're forced to make a wild guess. I believe that the game could've easily be longer, and a lot more challenging.  I must say, that I enjoyed the narrator and his evil voice, giving you some kind of hints now and then, but you barely heard from him later on in the game.  What I pretty much asked for, is more gameplay, and a greater challenge as you progress. With all this said, the game is not bad at all, it's worth playing, but it should be for a smaller price then, since it is as short, as it is.  Big applause to Pixel Maniacs for this nice game. =)",
            "review_score": "1"
        },
        {
            "review_text": "  Pretty sweet game! Has a Portal feel and the same satisfaction from solving puzzles!  P.S: There's a ♥♥♥♥ing cake in there, I'm not even kidding. Check the achievements.",
            "review_score": "1"
        },
        {
            "review_text": "  Nice game !",
            "review_score": "1"
        },
        {
            "review_text": "  I recieved this game for free with a request to stream and write a review. The Dev didn't pay my $32,420 sellout fee so recieving it for free didn't effect my review.  Let's start off by stating that I don't like puzzle games. I like to shoot bad guys, slay dragons, and bang sorceresses. I don't find great joy in being made to feel stupid by a game, thats what life is for. Ok, so onto the game.  Chromagun is a puzzle game where you use your 'paint gun' to change the color of walls and balls to move the balls where you need to solve the puzzle which opens the door to the next room. Sounds simple unless you make a mistake...I made a lot. And then there are these 'angry balls' that like to come ♥♥♥♥ with you...while the narrator talks ♥♥♥♥ to you. Still the game was pretty straight forward as I figured out little tricks to control the balls...I mean worker drones, just remembered WTF they are called, the game would throw tougher and tougher puzzles until I finally got to the point that the game was smarter and I gave up, proud of the progress I did make.   PROS: Easy to learn Smooth Controls Simple Concept Graphics were better than expected ♥♥♥♥♥ Narrator Challenging  CONS: ♥♥♥♥♥ Narrator  Should you buy it? If you like puzzle games give it a shot, it's pretty damn good. Still cheaper than most of your bad decisions and won't give you VD. If you don't like puzzle games obviously skip it.  8/10 would get chased by angry balls again",
            "review_score": "1"
        },
        {
            "review_text": "  Amazingly fun but tricky game.",
            "review_score": "1"
        },
        {
            "review_text": "  Pretty good game based off of Portal, but slightly trickier with 3 colors this time. I personally enjoyed it, and should be a consideration to many people. I may have gotten it for free, but I still had a great time with the 20 minutes I've so far put into the game.",
            "review_score": "1"
        },
        {
            "review_text": "  First of all, Thank you to Pixel Maniacs for the oppurtunity to make me as one of of the lucky person to try out this game for free Thank you so much  As for the game, nothing much to say It is a simple puzzle game which involve around 3 primary colors which are RED, YELLOW and BLUE The first 2 or 3 stages is simple but as the game progress, it will get more complex and you will die a lot ( at least for me xD). Secondary Colors such as Green, Orange and Purple comes after you beat several levels. This is where you need to remember the combination that you learned in your Art Class back in the day.  The puzzle is very challenging but not too hard. You can figure out everything pretty much if you are well aware of your surrounding   You can easily driven into this game because as soon as beat one level, you want to play more and more and more. The narrator in the game is pretty much like Stanley Parable but less annoying unless you die a lot xD. Always read anything on the upper board before entering the level, it have useful tips.  As for the performance of the game, it runs at 60 fps almost perfectly throughout the game but drops to 30fps at some occasion (like when the fire and explosion event occur). That was not a problem for me.  The game deserve a solid 9/10 for the price and the content. I hope it will have a sequel with more workerdroids and tertiary colors. I hate that brown workerdroids btw.  Thank you so much for the game, Pixels Maniac The after party scene is well made, I love it!",
            "review_score": "1"
        },
        {
            "review_text": "  I never thought colour mixing would be a useful skill in later life! P.s it's spelt Colour*",
            "review_score": "1"
        },
        {
            "review_text": "  I got this game sent to me for free, by the Community Manager (I think) of Pixel Maniacs. Thanks, btw! I did not even ask for the game, and just so you all know, this review is 100% what i think.  Pros: - Funny voice actor - Portal-style puzzles - It's unique, and that's important! - Puzzles are easy, yet solid (In a good way). They're challenging as you progress. - 8 chapters, all with quite a lot of levels. (I still haven't finished the game yet, but mid-way through recording) - Cool colour-mixing system. - Built-in speedrun mode! Cons: I couldn't find many cons with this game, but i did gather a few; - Limited colours, it would be nice to have a few more? - It would be nice to have some sort of checkpoints/rewind system, therefore you wouldn't have to restart the whole level if you mess up at the end. - Limited enemies/ball types.  Overall i really like it. Just, take breaks because it can get quite stressful... For me anyway. As i was recording, and i wanted to progress in the game, it was really annoying to get stuck on levels. However, i luv it lots lads. If i knew about the game before they sent me a free copy, i would've bought it for myself!",
            "review_score": "1"
        },
        {
            "review_text": "  Eventho I haven't played this game for that long, I really liked playing it and I appreciate it that the developers gave me a copy of the game for free so I could review it for my youtube channel. I really enjoyed playing it, it has funny puzzles to solve and I really would recommend it since you can give your own fun turn to it aswell.",
            "review_score": "1"
        },
        {
            "review_text": "  A fun Puzzler! With some similarities to Portal 2, but the speaker ist more like from Stanleys Parable. It is addictive, I started and couldn't stop util the end. The puzzles are all fair, with rising difficulty of course. If it is on a Steam Sale, grab it.",
            "review_score": "1"
        },
        {
            "review_text": "  Chroma Gun is the FPS for people who can't play FPS. The few moments of 'oh my God, faster, FASTER' are just enough to feel accomplished when successful, but not so frequent that you feel overwhelmed by the technical aspects. The story is basically non-existant, and that's o.k. The puzzles will keep your head scratching and then when you've solved them all, going back and speed running the entire game keep you engaged for even longer. There are some frustrating moments, certainly, but it's all from the trial and error nature of the game. Once you learn: it's great!  Full disclosure: I received a review copy of this game from Pixel Maniacs. The review itself is mine and they had no influence on its outcome.",
            "review_score": "1"
        }
    ]
}