{
    "app_id": 408770,
    "name": "Highschool Possession",
    "release_date": "2015-12-09",
    "developer": [
        "Straywire"
    ],
    "publisher": [
        "Dharker Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Nudity",
        "Indie",
        "Sexual Content"
    ],
    "achievements": 2,
    "positive_ratings": 100,
    "negative_ratings": 41,
    "price": 7.19,
    "description": "A visual novel game following a young man who wakes up in the body of another student... Learning his friends may not be living the perfect lives he thought they were.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408770/header.jpg?t=1545573454",
    "minimum_requirements": "OS: Windows XP Processor: 1.66 Ghz Memory: 1 GB RAM Graphics: DirectX compatible card Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've played both versions. Indeed, Highschool Possession on Steam is censored but Darkher Studios allows you to download a patch uncensoring it, from their forum. Just follow the instructions on the discussions here and you'll enjoy naked girls and some NC-17 scenes.  I would have probably skip the adult content if the censored version wasn't making me wondering what happened. But let's begin by the beginning.  Highschool Possession isn't really sex or a guy torn between his two crushes. It goes deeper. Indeed, the main character, Hikaru, is switching bodies with Akiko and Kasumi, his two friends. By doing so, he discovers their secrets and they're clearly life-changing. Hikaru will have to make choices to help them, while his body is in a coma.  There are four endings: ending with Akiko, ending with Kasumi and two endings where Hikaru is alone as he didn't make the right choices for the girls (though they're still alive). The story is well-written as it's concerning two serious degrading situations for the girls: Akiko is emotionnaly abused and used as a toy while Kasumi is bullied. In both cases, the girls are doubting of themselves and lost their own self-confidence.  I've never been bullied at school nor used like Akiko was but I can relate to these characters as I'm myself lacking self-confidence, though I've now more faith in me than before. You get attached to these girls and to the story at the point that downloading the uncensored patch is just curiosity at how these NC-17 scenes are inserted in the story (though that they're suggested by the censored version). As for the scenes for themselves, they're not really a lot - I mean they're only there where they were suggested and there is no scene outside of that. They're quite 'shy' compared to some arts I've seen when I'm searching fanart for my OTPs. However, still, they can be triggering, though I think that it's the whole subject of bullying and emotionnal abuse that can be more triggering.  The art is ok here, though some scenes aren't of the same quality of the rest but Kasumi and Akiko are well-designed, though I don't know why people doing visual novels need to put breasts that aren't going with the bodies (Akiko being the prime example of that, the poor girl must suffer with a huge chest like that).  The soundtrack is nice, though sometimes not really reflecting heavy moments.  Highschool Possession is a good visual novel, mainly for the subjects inside. You don't need the uncensored patch if you don't want to see any x-rated picture, however, be aware that Akiko's story is more expanded with it, as she's the one that has more sexual scenes. I've enjoyed the game without the patch, so, many of you will enjoy it. Still, the soft scenes are suggestive and they're clearly done to give you the envy to download the uncensored patch. Seriously, for the price, you have there a good product, with a story that you want to know and with serious content, changing from the usual guy with girls around to date.",
            "review_score": "1"
        },
        {
            "review_text": "interesting concept let down by the length and the limited choices and minimal achivments ,im a little disappointed because there was great potential and Dharker Studio has far as im conserned a good rep especially with games like beach bounce  this game may be woth a go its you can get on a massive sale .",
            "review_score": "-1"
        },
        {
            "review_text": "I was really expecting something totally different. But way different.  Highschool Possession is another VN developed by A.J.Tilley (now known as Dharker Studios) about a guy romancing schoolmates, female if you were wondering. The story goes around a guy whose name I don't remember and his relationship with two of the most beautiful girls in his highschool. One would say that there's nothing weird with that, a typical VN, but this is not the case.   Warning! Some Spoilers Ahead",
            "review_score": "1"
        },
        {
            "review_text": " 'Swimgirls in a contest'",
            "review_score": "1"
        },
        {
            "review_text": "now this was a good visual novel. i think it really hit the spot on the stories. 2 very important ones that a lot of people have been through. there are a lot of people who can relate with bullies or someone treating you like a sex object and not care for you. i think they did a great job on this one.   my time spent is completing every option and seeing both sides of the coins.",
            "review_score": "1"
        },
        {
            "review_text": "For as happy as this game seems to be advertised, it's surprisely dark. After you 'disappear' you take on the body of one of the girls you idolize and you keep flip flopping between them. One of which is being horrifically bullied while the other is in an abusive relationship. You help them while in their bodies without them realizing it. It sounds like a wonky Freaky Friday piece of crap but I actually enjoyed it. I felt like I was actually making a difference. I was filled with determination! I felt empowered and good about myself that I was able to help them realize the power in themselves.   It's a short game so it won't eat up too much of your time and since it IS a dating sim of sorts you can end up with the one of the girls you possess at the end. But the real take away here is it's not quite a fluffy, highly eroticized sort've game. It's got some depth to it that other VN's lack and I can honestly say I appreciated that a lot.   10/10",
            "review_score": "1"
        }
    ]
}