{
    "app_id": 408760,
    "name": "Pro Cycling Manager 2016",
    "release_date": "2016-06-16",
    "developer": [
        "Cyanide Studio"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "In-App Purchases",
        "Steam Cloud"
    ],
    "genres": [
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Simulation",
        "Cycling"
    ],
    "achievements": 47,
    "positive_ratings": 186,
    "negative_ratings": 123,
    "price": 14.99,
    "description": "Become the sports manager of a professional cycling team and take part in a great 2016 season that will let you travel the world in over 200 cycling events.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408760/header.jpg?t=1515088090",
    "minimum_requirements": "OS: WINDOWS VISTA/WINDOWS 7/WINDOWS 8/WINDOWS 10 Processor: AMD/INTEL DUAL-CORE 2.2 GHZ Memory: 3072 MB RAM Graphics: 256 MB 100% DIRECTX 9 AND SHADERS 3.0 COMPATIBLE ATI RADEON HD 2600 XT/INTEL HD 3000/NVIDIA GEFORCE 8600 GTS OR HIGHER DirectX: Version 9.0 Network: Broadband Internet connection Storage: 11 GB available space Sound Card: DIRECTX 9 COMPATIBLE Additional Notes: INTERNET CONNECTION REQUIRED FOR GAME ACTIVATION AND ONLINE GAME - WINDOWS XP NON SUPPORTED",
    "recommended_requirements": "OS: WINDOWS VISTA/WINDOWS 7/WINDOWS 8/WINDOWS 10 Processor: AMD/INTEL DUAL-CORE 3.0 GHZ Memory: 4096 MB RAM Graphics: 1024 MB 100% DIRECTX 9 AND SHADERS 3.0 COMPATIBLE AMD RADEON HD 6850/NVIDIA GEFORCE GTX 460 OR HIGHER DirectX: Version 9.0 Network: Broadband Internet connection Storage: 11 GB available space Sound Card: DIRECTX 9 COMPATIBLE Additional Notes: INTERNET CONNECTION REQUIRED FOR GAME ACTIVATION AND ONLINE GAME - WINDOWS XP NON SUPPORTED",
    "reviews": [
        {
            "review_text": "Game crashed four times during the first three stages of my first race. I see that many others have this issue. It's unacceptable, really.",
            "review_score": "-1"
        },
        {
            "review_text": "I actually enjoyed the first season of my career. There are some bugs here and there, but nothing game breaking to me. However, when reaching the second season, I was hugely disappointed. As far as I can see, there are no variants, meaning that ALL stages are the same for all races in 2017, as they were in 2016. Not a single race route has changed for the new season, except for the World Championships. The Tour de France, Giro, Vuelta, etc. are all the same.   Very disappointing and lazy by the game developers.  The problem will probably be fixed over time by the communities who create variants, but since stages have to be updated in order to work with the new game, it's a lot to expect from the community in order to save the long-term durability of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "For people who dont like long games, for people who dont watch cycling, DONT buy it,  If you like cycling, then this game is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Great game -- I've played nearly 1,000 hours. I'll probably play another 1,000. The negative reviews are just odd.",
            "review_score": "1"
        },
        {
            "review_text": "First time playing this game other than a quick trial a few years ago. A little glitchy, occaisonal crashes, but good fun. Mixes my two favorite activities: bike racing and video games. Like Zwift but without having to pedal:) Rider stat's are suspect in a few areas - I know what they can and can't do.   Races seem to play out the same way every time so far, pretty predictable, early break gets chased down in last kilometers before sprint or mountain finish. It doesn't always go that way in real life. Where are the mid and late race attacks? I imagine it's different online playing other people, though. If I could just find a way to connect for more than a few minutes.  Still waiting to see anything in the Steam Workshop, appears empty as of writing. Where is Wiggins team?!?! I wanna play as Dan Patten!!! :)  Finally getting my revenge on theses dudes after 14 years of getting my a$$ handed to me in Pro races! 'Go get me another feed Menzies!'",
            "review_score": "1"
        },
        {
            "review_text": "As always pro cycling manager is one of the most addicting games of the season. I have enjoyed every single version all the way from 2010 to now. Obviously there is alot they can/should change in the game but still it is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, no doubt about it. It runs much more smoothly with much crisper graphics, steam workshop works a treat and is so easy to work, pro cyclist is great fun, career is much easier to set up at start. It's just great. The only problem I have is that you can't control the training of some of your smaller riders. Although the 'leaders' concept is great and really easy, it would be nice to have the option to directly change your rider's training routine. Only fault in an otherwise great game. If you're suffering with the 'steamauthfailed' bug, a neat trick is to press enter whilst having the cursor clicked on your username, and then immediately press backspace. Works a treat.",
            "review_score": "1"
        },
        {
            "review_text": "Played them all.  This is the best PCM ever. Great!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game for anyone who is a fan of cycling.",
            "review_score": "1"
        }
    ]
}