{
    "app_id": 408930,
    "name": "ePic Character Generator",
    "release_date": "2015-11-05",
    "developer": [
        "Overhead Games"
    ],
    "publisher": [
        "Overhead Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Steam Trading Cards",
        "Steam Workshop"
    ],
    "genres": [
        "Animation & Modeling",
        "Design & Illustration",
        "Photo Editing",
        "Utilities",
        "Web Publishing",
        "Game Development"
    ],
    "tags": [
        "Design & Illustration",
        "Photo Editing",
        "Utilities"
    ],
    "achievements": 0,
    "positive_ratings": 77,
    "negative_ratings": 89,
    "price": 0.0,
    "description": "ePic Character Generator lets you create realistic character images you can use as assets for your games, illustrations for your stories, or avatars for your role-playing sessions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408930/header.jpg?t=1546265298",
    "minimum_requirements": "OS: Windows速 XP Processor: Intel速 Pentium速4 1.5GHz Memory: 512 MB RAM Graphics: 1370 x 770 pixels",
    "recommended_requirements": "OS: Windows速 7 or better Processor: Intel i3 @ 2GHz or better Memory: 1 GB RAM Graphics: 2560 x 1440 pixels or higher desktop resolution",
    "reviews": [
        {
            "review_text": "I have messed around with it for some time and made a few great looking characters and a few hilarious ones. It has some glitches here and there, but I am liking it overall.",
            "review_score": "1"
        },
        {
            "review_text": "This software is a godsend for anybody who needs inspiration or help visualizing a character they have in mind. I think the DLC gives a good amount of accessories and additional features that the free ones don't provide. I like having options like aura, comanion 1 &amp; 2, and the many different accessories. The backgrounds are amazing and I like the ability to export with a plain background as well as options for cards and tokens. I might actually try making a board game one day for me and my friends.    It took me a while to figure out a few things. Depending on dlc that you use, there is many different options. EX, when using companion, it took me a while to find the toggle to display behind the character. Either way It did alot more then I expected to in the begining. There is many options to customize your character and its made mostly for people who want it to be simple with very little configuring or work.   If I could change anything about this software, I'd like the ability to import other items into the software, but I can see where that can run into issues with compatibility. The items provided are very good quality. I like how easy the software is to use.   I can imagine it took alot of work into making this software so i'd say the DLC is priced very fair. Also the price for the pro version seems fair if you intend to use the content for something you are creating. Even so, with the free version its still very useful.   Overall I definately recommend this for any devolopers out there, or anybody just seeking inspiration. This will get the creativity flowing!",
            "review_score": "1"
        },
        {
            "review_text": "Very funny tool. It is extremly useful to supporting your roleplaying sessions if you can't draw your hero or villain by yourself. I bought the dwarf packs and there are plenty of content in the those two DLC compared to the demo packs. I love the random picture generate feature too, it can create angelic dwarf or pixie dwarf with wolf companion;) If you have own more packs you can combine the elements between them.",
            "review_score": "1"
        },
        {
            "review_text": "This is a simple Character Generator. There is a bunch of adders you can pick up as well for different models. If you have a new start up game that you are trying to get ideas for characters, this is a good inexpensive way to play with different models to see what you like. I highly recommend this for anyone that creates games. You can lose hours in a day by just playing with different characters and costumes.",
            "review_score": "1"
        },
        {
            "review_text": "This is DEFINATLY worth your time. WASTE ALL OF YOUR MONEY ON IT AND YOU MIGHT ACTUALLY GET A DECENT GAME!!!!11!! Not.",
            "review_score": "-1"
        },
        {
            "review_text": "You have to buy all the content. In essance, downloading this is just a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "The default resolution was incorrect. One has to complete the automatical tutorial before using the software. Even after completing the tutorial, the software appears to be missing basic workflow like start with a blank character and add to it. It appears largely to be a means of selling already created content.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, just going by the basic pack alone, its just a glitzier version of Hero Machine 3. But even Hero Machine will (with a lot of work) allow you to move the limbs around. Trying to equip the base female figure here with weapons makes most of the weapons hard to see. Not sure I like having to link my account to them either.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10",
            "review_score": "-1"
        }
    ]
}