{
    "app_id": 408960,
    "name": "Zombasite",
    "release_date": "2016-08-23",
    "developer": [
        "Soldak Entertainment"
    ],
    "publisher": [
        "Soldak Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Indie"
    ],
    "achievements": 61,
    "positive_ratings": 108,
    "negative_ratings": 31,
    "price": 14.99,
    "description": "Zombasite is a zombie apocalypse action RPG set in a dynamic, evolving, fantasy world for Windows, Mac, and Linux.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/408960/header.jpg?t=1536791955",
    "minimum_requirements": "OS: XP or newer Processor: 2.0 GHz Core Duo (or other equivalent) Memory: 512 MB RAM Graphics: GeForce 2 or better Storage: 350 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "PROS: -Procedurally generated world. -Dynamic living world and content. -Many classes to choose from or create your own with dual class selection. -Clan and relations management. -Tower defense elements. -Multiple ways to play and win.  CONS: -Not noob friendly (tutorial system could use an upgrade). -Clunky user interface. -Sounds and music (or lack thereof) could use some improvements. -Some dated ARPG elements that needs to be left behind, such as identifying items and limited town portals. -Dated graphics.  OVERALL SCORE: 8/10  SUMMARY: As a gamer that spends most of his time playing nothing but isometric ARPGs, I have to say Zombasite has brought something I never played before.  Most dungeon crawlers are all about killing a ton of enemies, looting items, and leveling up your character. But Zombasite combines other genres such as town management, tower defense, and some lite survival simulation. It all somehow works and keeps you engaged far longer than the usual grinding for loot and leveling you'll find in typical ARPGs. It really is a breath of fresh air that the dungeon crawler genre needed.   If you can look passed some of the game's weaknesses that I mention above you are certainly in for a treat. It is not an easy game to get into at first since there's a lot of intricacies to learn. But if you stick with it, you'll soon find a diamond in the rough.  It's almost criminal, how little to no press this game gets. I feel bad that this game doesn't get the recognition it deserves. It has a lot of great things going for it. Don't let the graphics or funny title of the game fool you and give this a shot (free demo). And if you are an isometric ARPG fan like I am, do yourself a favor and try it!",
            "review_score": "1"
        },
        {
            "review_text": "The game is a bit clunky and the graphics are bad, but it more than makes up for it in content and interesting features. Its like a mix between Diablo, Rim World, and Shadows of Mordor",
            "review_score": "1"
        },
        {
            "review_text": "Soldak fanboy reporting in.",
            "review_score": "1"
        },
        {
            "review_text": "This game is confusing (not the intruiging type of confusing)  It's overall boring. If you are looking for an ARPG diablo style game, this is not it.  It's just weird and not a good weird. The graphics are bad, the textures are bland. The combat is choppy and sluggish and hitting an enemy doesn't feel exiting enough. The introduction to the game is terrible, instead of visually walking you through what the game is about, your screen gets overloaded with 100000 tips. You spend the first hour reading before you can actually play properly.  But the biggest sin of this game is the TERRIBLE Map and UI. The UI layout is not detailed enough, neither are the NPC's and Vendors, and if you had to use this game's map to find water in a dessert....your effed.  Enemies attack your base from god knows where and all you get for notification of this is a tiny red flash around your screen which is barely visable. You can only teleport back to your base once per area, so if it gets attacked again your either effed, or have to run in game for 10 minutes to get back there.   Once your inside your base it will take you another 5 minutes to find whos attacking your base, and where from because the Map does ♥♥♥♥ all to tell you.",
            "review_score": "-1"
        }
    ]
}