{
    "app_id": 409160,
    "name": "Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist",
    "release_date": "2015-12-04",
    "developer": [
        "Crows Crows Crows"
    ],
    "publisher": [
        "Crows Crows Crows"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Captions available",
        "Partial Controller Support",
        "Commentary available"
    ],
    "genres": [
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Comedy",
        "First-Person"
    ],
    "achievements": 6,
    "positive_ratings": 7642,
    "negative_ratings": 529,
    "price": 0.0,
    "description": "A 15 minute heist game by Crows Crows Crows &amp; Directed by William Pugh (The Stanley Parable). Slip into the soft-soled shoes of the mastermind responsible for the greatest heist- oh god I can’t do this any more, i’m joining the strike. good luck writing the steam description.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/409160/header.jpg?t=1454678278",
    "minimum_requirements": "OS: Windows XP SP2 or higher Processor: 1.80GHz Processor Memory: 2 GB RAM Graphics: Video card with 512MB of VRAM Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Exciting heist game! There are multiple approaches to entering the mansion, in my playthrough I chose the roof. Taking down the snipers with the tranquilizer gun was fun, at least until the chimney I was climbing collapsed. Not sure if that was scripted or a trap? It brought me right to a garden level where there was a cool chase sequence involving a tiger. After that it was back in the mansion and on to the vault. The patrolling guards' narrative was amusing with a couple of in-jokes, although their AI needs a little work. I crouched right by one and they didn't see me. The game has good weather effects though, which actually distracted them so I could get to the elevator leading down. Some weird dialogue in the elevator made me think I was missing something, but anyway after that it was straight to the vault and the emerald. The game seemed to glitch a little on picking up the emerald but I guess that's why it's free... all in all a good game experience!  The good: -thrilling stealth gameplay -exciting chase sequence -funny narrative  The bad: -long load times -weird muffled dialogue throughout -some audio and visual glitches making me think the game crashed where it didn't.",
            "review_score": "1"
        },
        {
            "review_text": "Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist is a game made by the guy who brought us The Stanley Parable.   To explain the plot it would ruin the game, so I will keep it simple. You walk around the game while the voice guides you around and forces you to do stuff (I know that this is a horrible description, but I can't summarize it any better)  The game unlike The Stanley Parable only has one ending so apart from the one playthrough there is no replay value.  The game is incredibly funny and one of the funniest games I've played to date. I loved every moment of it.   There is not much to say about this game other than play it. Anything I say can spoil the entire experience so I'm gonna end the review right here. Just play it.  Final Rating: 8/10 - Play It  If you liked this review please consider giving it a thumbs up and if you disliked post in the comments on what you disliked about the review.  For more reviews follow Snort's Review curator page  here  - follow for regular updates on reviews for other games!",
            "review_score": "1"
        },
        {
            "review_text": "Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist is a unique heist game where the player's goal is to steal a prized emerald from a mad scientist's mansion undetected.  Pros: Unique stealth mechanics Funny guard dialoge (think Thief Gold style) Very atmospheric Fine balance between humor and 'seriousness'  Cons: Tiger attacks can get a bit annoying Guard AI is finicky at times  Tips and advice: Guards can often be picked off one by one, don't take them on all at once! If you must fire your weapon, do so during lightning strikes to conceal your shot.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a 20 minute Stanley's Parable. I genually laughed and had a blast and would totally pay for a longer version. Go get it - it's free! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist is an amazing short indie game. It takes you on a small adventure, behind the scenes of a 'game'. As you would expect from a William Pugh directed game, it had a comical script, which accompanied the amazing atmosphere quite pleasantly. The achievements provide a bit more replayability, with challenges such as collecting all the pretzels or turning off all the lights.  If you enjoyed The Stanley Parable you'll definitely enjoy this game. It has the same concept as The Stanley Parable with it's comedic aspects and also it's creative scenery and story-line. A unique game with an amazing concept with the ability to play it for free. What's not to love about Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist.  Overall, I had no regrets playing this insanely creative game and would gladly purchase the game or a sequel as the narration was just too hilarious. My time well spent with a humorously different ending!",
            "review_score": "1"
        },
        {
            "review_text": "The fact that the designer of The Stanley Parable directed this little game should give enough of a clue to what you should expect out of it.  It plays with your expectations from the get go, while simultaneously providing comedy. Your first time playing it, you'll likely unlock just the achievement for finishing the game. There's more content strewn around the game world if you look through all the nooks and crannies.  I really don't know what else to say about this without spoiling too much of it. Go download it, it's a fun 15 minutes (an hour for completionists).",
            "review_score": "1"
        },
        {
            "review_text": "I like these kinds of things. It's funny and worth 20 minutes of your time. Also its ♥♥♥♥ing free, just do it, will you?  ",
            "review_score": "1"
        },
        {
            "review_text": "Yes, just write your review there. Yup. In that box, with the cursor, yeah.  Well, um, you could just draw emoji poops, yes, that would be one way to approach that whole review question. How many emoji poops would you need to represent 17 full minutes of trope-bending absurdity? Shall we say, six? Does that sound fair?   I score this game six emoji poops out of &lt;VARIABLE REDACTED&gt;.",
            "review_score": "1"
        },
        {
            "review_text": "Exceeded my expectations! It's a 20 minutes very amusing game. If you liked 'The Stanley Parable' you will definetly enjoy this.   Totally recommended.    Edit: I still need to find all those pretzels.",
            "review_score": "1"
        },
        {
            "review_text": "Lights didn't work and I heard people talking behind the walls. But the tiger was great, very realistic, and so was the voice acting of the Doc. Sadly, I couldn't find the Emerald.  There's really no reason why you shouldn't download this right now, it's short and free fun!",
            "review_score": "1"
        },
        {
            "review_text": "Managed to steal the emerald first time, guard routes could be fixed up a bit though. Tranq pistol is far too OP once you get it too. Great game, incredible voicework. When is the pencil game coming out?",
            "review_score": "1"
        },
        {
            "review_text": "Very short but very fun and humorous, and it's free! Worth playing even if it isn't for very long.",
            "review_score": "1"
        },
        {
            "review_text": "I will never look at Tigers the same again.",
            "review_score": "1"
        },
        {
            "review_text": "The purest stealth experience since the original Thief, packed into 15 minutes with a good story and given away for free. Play this game now!",
            "review_score": "1"
        },
        {
            "review_text": "[ENG / FR]  [ENG]  Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist is the latest creation from The Stanley Parable developer. In order not to unveil its content, I will only sum the game up through some characteristics.  + Voice acting and sound ambience are very carefully made, like it was the case with The Stanley Parable + Leaves a good memory once finished + Steam cards and achievements extend its lifetime + Completely free  - Rather short (About twenty minutes) - Limited replay value  This game is recommended to everybody, even if you never tried The Stanley Parable before. The making of this little game has taken much more time that you will spend on it but it really deserves your attention, especially at this price.  ▬  [FR]  Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist est la dernière création du développeur de The Stanley Parable. Afin de ne pas en dévoiler le contenu, je vais me contenter de donner que quelques caratéristiques le concernant.  + Doublage et ambiance sonore soignés, tout comme pour The Stanley Parable + Laisse un bon souvenir une fois terminé + Bénéficie de cartes et de succès Steam qui prolongent sa durée de vie + Entièrement gratuit  - Plutôt court (Une vingtaine de minutes) - Rejouabilité limitée  Ce jeu est recommandé à tou(te)s, que vous ayez joué à The Stanley Parable ou non.  La conception de ce petit jeu a dû demander bien plus de temps que vous n'y passerez, mais il mérite vraiment votre attention, surtout à ce prix.",
            "review_score": "1"
        },
        {
            "review_text": "Do you love stanley parable? then you should play it. No? ................. Shame on you, but still play it. only thing bothers me is why my gun doesn't work if i am seeing the tiger, and funny thing is guards cant see me even im on their front lol.  9.7/10 would chase the tiger with my useless gun again",
            "review_score": "1"
        },
        {
            "review_text": "Quick game, but rather enjoyable for the price. The best part had to be the epic chase scene through the Orangery after stealing the Emerald with the Tiger still loose. If it was not for that last minute bird I released I would have been shot up by the Yakuza. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Short &amp; sweet. You'd be silly not to play it.",
            "review_score": "1"
        },
        {
            "review_text": "It's short and it's free and it's by half of the Stanley Parable and SIMON AMSTELL",
            "review_score": "1"
        },
        {
            "review_text": "Soo, should you waste your time on Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist ? Well, apart from the bad title (which is intentional), its actually a good 15-30 minutes small and funny game. Its certainly got the comedy of Stanley Parable, and its even in the same genre as the Stanley Parable, which is a walking simulator adventure game. Its more like try yourself to see the beauty in it kinda game, soo there's not much that i can say except that its really funny and will makes you laugh out loud or at the very least, it could makes you smile a bit. If you really like the comedy though and haven't played the Stanley Parable, you should pick that up and laugh at every jokes that game throw at you.  The story, hmm.. If you see the description its a compelling game about heist... Wait a second.. a strike ?! There is something strange here... To know what is this game and why i recommending it to you even though its strange description, you got to try it yourself. ;)  Its a free game that will make you laugh out loud and at the very least, smile a bit. If you want more than that ?? I-i guess you are the reason why a lot of people in this game go on strike !",
            "review_score": "1"
        },
        {
            "review_text": "The Heist is super tough but you can do it!",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable. If you like the Stanley Parable, you will definitely like this. Same sense of humor! About a 10 minute game to complete!",
            "review_score": "1"
        },
        {
            "review_text": "Short, fun, reminiscent of the Stanley Parable, and free. You have nothing to lose so check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Do have the slightest bit of humour? Then try it! Why? Because it's free, it's only about 20 min and it might make you smirk. If you like it, there is even some replay value...   Cheers, Itezos",
            "review_score": "1"
        },
        {
            "review_text": "An exemplar production!  An immersive experience with terrific effects and suspense! The tiger! That escape sequence! I was on the edge of my SEAT!  I suppose if I had any minor quibbles, sometimes it became abundtantly obvious that I was not, in fact, commiting a heist in a mansion (the production team REALLY should get a handle on their crew; I heard whispering going on off stage more than once. Unprofessional. Likely overstaffed). I also didn't feel as if my choices had much impact on the overall experience (what if I didn't WANT to steal the emerald? Freedom and choice should be a priority).  But it hardly detracts from a solid, fulfilling experience that is sure to give every audience member an exciting story to tell once it ends.  5 stars!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. My favorite bit was doging the guards. For a source game there was really good AI present, requiring you to use alot of strategy to avoid them. If I hade to gripe about one thing though, the tiger was really annoying to get past. Once it's released, it's on you like that, so you better start running. Took me a few tries to even barely miss the thing. The ending was really worth it though. I don't want to spoil what's in the vault, so it's best experienced firsthand. I can definetley reccommend this game, especially since it's free.",
            "review_score": "1"
        },
        {
            "review_text": "A better heist game than PAYDAY 2",
            "review_score": "1"
        },
        {
            "review_text": "A perfect 10/10 game in my opinion. It doesn't overstay the length of the joke, but provides precise meta-humor and wonderful voiceover to boot. BAFTA will be sniffing all over this.",
            "review_score": "1"
        },
        {
            "review_text": "Must play",
            "review_score": "1"
        },
        {
            "review_text": "Get a buckle on it.",
            "review_score": "1"
        },
        {
            "review_text": "As free as perfect.  Get it.",
            "review_score": "1"
        },
        {
            "review_text": "If you like eating garbage, punching yourself in the face and pretentious, showboating pseudo-philosophy... well, you should probably see a doctor, that can't be pleasant. Also, this game is good.",
            "review_score": "1"
        },
        {
            "review_text": "You had me at 'You can't go in there, I'm sorry. It's a single player game.'",
            "review_score": "1"
        },
        {
            "review_text": "This is a 15 minute breath of fresh air. In such a short time it injects levity and joy into what is essentially a walking simulator. Never have I been immersed so quickly and so thoroughly by a game. A must play",
            "review_score": "1"
        },
        {
            "review_text": "Hello friends this game is ace 13/10 would reccomend to every human around (also its free so why wouldn't you just try it??)",
            "review_score": "1"
        },
        {
            "review_text": "A really great Free game.",
            "review_score": "1"
        },
        {
            "review_text": "8.3/10 - A worker on the set of The Running Man  You are suposed to be the next person to play the game but some issues arise. In addition to a studio strike you are the only one left to rectify some issues.. so that you can play the game. Essentially, this is the first movie studio PA simulator I have ever played.   This was just the first part. When you finally make it to actual game you will be be extremely suprised!  FREE so check it out! 30 minute game!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly short game for what it is. Although Crows Crows Crows did a good job and you definately get that Stanley Parable vibe from it I was a little disappointed in what I got but grew to enjoy the game for what it was - on a single playthrough that is. Although I'll be giving it a good review there are aspects of this game potential players should be aware of to prevent possible frustration.  Achievements are broken.  You can only get one achievement at a time. Don't even think about trying to knock them all out the park at the same time because it won't work - and don't even think about opening Steam Overlay in game or there goes your chance of getting an achievement.  The reason for nearly 3 hours of gameplay was, play once; gets the 'Start the Game' achievement. Close the game and re-open, get the next achievement; close the game and re-open to get the next achievement and so on. This is what makes the game boring. You're playing the same game 6 times just to get all the achievements which isn't the best way around making a short game longer. Unless you're an Achievement Hunter, don't bother with this one.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game from the designer of 'The Stanley Parable' and his team.  Pros:  The narrator is nerotic as hell when the player doesnt awser th phone;  It really reminds of stanley parable  Most of the acheviements are easy  Requires a second run to complete all of them.  Cons: Its short The Coin acheviement has some detection bugs, and some textures of the coins can make the player's life difficult.  conclusion: Narrator wants me to pick up the phone? Player says NO  ^^",
            "review_score": "1"
        },
        {
            "review_text": "If you got time and just want a strange experince should give this a try. It's free and enjoy the voices.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone loves this and The Stanley Parable but ask them about Gone Home and you'll see them blush with anger, mad that a game would dare attempt drama. 'Walking Simulator' 'Not a real game' 'They tricked me into feeling so now my first emotion is rage'.  Either way, I loved the part with the Vault, though underutilized, I enjoyed the reference and mechanics of it. 101/111",
            "review_score": "1"
        },
        {
            "review_text": "Funny Game, but it is too short. It could be longer. You should play this game. ",
            "review_score": "1"
        },
        {
            "review_text": "A hilarious little game. Reminds me of the Stanley Parable (source mod). Definitley worth the time it took to download.",
            "review_score": "1"
        },
        {
            "review_text": "There is only one word who can describe this game: What?",
            "review_score": "1"
        },
        {
            "review_text": "Very fun short game, got a good laugh out of me, and a nice break for anyone that needs it.",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to download this game? Yes. Yes you do. Why? Because: +The controls are tight, and volume doesn't start out too high meaning you won't have to turn it down. +Speaking of sound, the game's music is some of the best... ever, and completely nail the 'heist' theme. +The plot is easy to follow, but not too simplistic. It has a deeper meaning that you won't find in most other heist-games-that-are-definitely-heist-games. +Dr. Langeskov's voice acting is delicious to my ears. Would be a bit better as Morgan Freeman doe. +The 'Cursed Emerald' was... wait no, I won't spoil it. It has some downsides, though. Such as: -The grapple controls are a bit too much to take in. -The 'Cursed Emerald'... dammit, I can't spoil it. -Too many memes. -Very little replay value. -Some of the puzzles were a bit too cryptic for me to understand.  Overall 9/10 a very solid heist game that is about heisting and definitely has a tiger in it.",
            "review_score": "1"
        },
        {
            "review_text": " GAMEPLAY TIPS FOR THE FIRST ACT OF THE GAME, WHEN THE SCARY PENCILS COME TO ATTACK — 'WHAT DO I DO?':",
            "review_score": "1"
        },
        {
            "review_text": "The reviews are filled with spoilers. It's free and trust me, it is amazing.  Just download the game and have a lovely 15 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "I'm pretty sure the emerald wasn't haunted and there may have been only one or two guards.  Really did like that driving part! It wasn't anything special but I must have been going really fast.  But the tiger! Oh man yeah that tiger.. ...I dunno it looked more like a lion, may have gotten that one wrong    I may join the strike.  ",
            "review_score": "1"
        },
        {
            "review_text": "its to short.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an astonding show of stealth gameplay. The only thing I would have against it is that the game feels unfinished. For example, on my first playthrough the lift took forever to move after pressing the button, while on my second playthrough the lift started going down before I pressed anything.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really great! I would buy this, if it wouldn't already be FREE! Looking forward to many new games from you guys!",
            "review_score": "1"
        },
        {
            "review_text": "Cool.",
            "review_score": "1"
        },
        {
            "review_text": "About a half-hour's worth of game, with about an hour's worth of additional game if you're an 'experience everything' kind of person. Also, Justin Roiland. Also, pretzels. Also, it's free. The only things you risk losing are your time, and control over your bladder.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty neat and made by the designer of the Stanley Parable.   Also it's free.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Can't wait for the pencils DLC.",
            "review_score": "1"
        },
        {
            "review_text": "A small little free 15 minute game by one of the creators of the Stanley Parable. There isn't much to say other then its free and great. I really recommend it",
            "review_score": "1"
        },
        {
            "review_text": "A delightfully daft free little game, starring Simon Amstell and sprinkled with a little Rick &amp; Morty goodness. What's not to love?!  Has achievements and trading cards too!",
            "review_score": "1"
        },
        {
            "review_text": "A very clever little gem 10/10 whould sort of play again.",
            "review_score": "1"
        },
        {
            "review_text": "This is an absolutely hilarious short game, better than some 3 hour long games i've paid for. Really worth your time if you fancy a laugh,",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't have any real gameplay elements, but for free and such of short experience (~20 minutes) it was definitely worth my time. Narrative was excellent and it shows how flexible games can be. Go play it!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and hilarious game that really makes me want to play The Stanley Parable :)  9/10",
            "review_score": "1"
        },
        {
            "review_text": "A nice game   pretending to be another game  . And it's free! You probably will only play it for 30 mins, but it will be worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Short but entertaining. Makes you question how games  actually  run. But it's free. What'cha gonna do.  Play The Stanley Parable for more humor. Cheers. ~Pie",
            "review_score": "1"
        },
        {
            "review_text": "I love this game's humour, Highly reccomend it to anyone, even just to try it.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, this game can take about up to 20 to even 30 minutes, but for free, this game is a steal. It's funny as hell, I love it. Not to mention, it's made by the designer of The Stanley Parable, William Pugh, who is awesome.  ALSO JUSTIN ROILIAND IS HILARIOUS IN THIS EVEN THOUGH I HAD NO IDEA HE WAS IN THIS HEHE AWESOME  10/10 greatest stelph game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "You loved stanley parable? Play this game (well, it's not really a full fledged game... short game? demo? just one middle-sized map? uuh, yeah, i'll stick with demo i think).",
            "review_score": "1"
        },
        {
            "review_text": "I think these guys are my new favorite devs. 10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "This is a really clever unique game quite similar in style to The Stanley Parable which William Pugh also worked on. It tells an unusual story in a first-person perspective just like The Stanley Parable does and is definately worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "This game absolutely was'nt waiste of my time. I like it and enjoyed it. Its absolutely not like THE STANLEY PARABLE, but it's just kinda funny 20minutes that I enjoyed most as I can :-) Thanks all for that game. I am glad that I could have play it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is by a designer of the stanley parable..saying anything else would be extreme spoilers.. its free and short and weird and good  play it",
            "review_score": "1"
        },
        {
            "review_text": "Loved this! Can't wait to see what Crows Crows Crows do in the future!  ",
            "review_score": "1"
        },
        {
            "review_text": "A lovingly made, free-to-play game from some of the people behind The Stanley Parable.  If you don't like pretzels and lasers you might as well forget the whole thing.",
            "review_score": "1"
        },
        {
            "review_text": "Not much 'gameplay'. Just like The Stanley Parable, the author knows how to use this medium for lulz. Great comedy game! (SPOILER: there is an ARG of this, if you like those things check it out after you finish).",
            "review_score": "1"
        },
        {
            "review_text": "A very unique and very creative game, letting you... take control of your game experience, in a way. It's definitely the most whirlwind of heists and it's worth every minute in the short but sweet time you will be playing.",
            "review_score": "1"
        },
        {
            "review_text": "Whirlwind might be the most apt part of the title. A briskly paced, hilarious romp through a very British, very nonsensical storylie, Dr Langeskov et al had me smiling for the entirety of its brief stay. A great way to spend a spare 20 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Woah! That was super hard. Even though escaping the tiger was easy, the lazers were super hard to manouver and the vault code was super hard to memorize. But all in all. The guards were wimps and went down the second you shot them in their ankle.",
            "review_score": "1"
        },
        {
            "review_text": "A marvelously unexpected gem of an adventure.  A short and entertaining experience that you can enjoy over a cup of tea; lovers of The Stanley Parable's sense of humour and its commentry on games should definitely check this out.   ",
            "review_score": "1"
        },
        {
            "review_text": "This is a very short game, like 15 minutes, but it was an extremely delightful 15 minutes and it was free! You can't go wrong!",
            "review_score": "1"
        },
        {
            "review_text": "It's short, but quite fun",
            "review_score": "1"
        },
        {
            "review_text": "The Tiger isn't especially friendly.",
            "review_score": "1"
        },
        {
            "review_text": "This 'game' is like a very short version of The stanley Parable. Its cute and worth the 15 minutes for a smile. The only negative I have is that listening to the cassettes is painful. Is this on purpose or is it supposed to be funny? Its like listening to some homeless druggie chatter. ",
            "review_score": "1"
        },
        {
            "review_text": "really enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "This is a game you play while your character is waiting to play a game of their own. Made up of meta-humor, it constantly refers to the upcoming game like an amusement park ride that is being ridden by another person when you arrive. It's hard not to be left wanting at the end, but it's short and free. Have a few laughs.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun quick game, make sure to pick up all the coins!",
            "review_score": "1"
        },
        {
            "review_text": "nice environment, gorgeous voice actin', marvellous visualty but there's not much thing to do. I really would like to see that game goin' places but I dont know even if it is intended to. figures, contets, denotation, humar.. all great. just with a toily story (haha get it?) it could be one long excitin' journey!",
            "review_score": "1"
        },
        {
            "review_text": "Some ♥♥♥♥♥♥♥ just released a tiger on me and I died...",
            "review_score": "1"
        },
        {
            "review_text": "Quick harmless fun. Listen to monologue, push a button, listen to monologue, push a button. Nice visuals.  Don't go to forum, nothing but useless gags there. Yes, the game is a joke, there's no game. The pie is in the sky.",
            "review_score": "1"
        },
        {
            "review_text": "I give it a maximum score of 5/7.",
            "review_score": "1"
        },
        {
            "review_text": "I think I found a pencil. Not sure though. It may have been a Tiger or an orange.    Anyway... I'm just going to go stand in the corner and practice being a planet.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Amazing game! :D Voice acting is brilliant. It's free but I even would pay for it! :)",
            "review_score": "1"
        },
        {
            "review_text": "this game has really good voice acting and is really funny",
            "review_score": "1"
        },
        {
            "review_text": "This game is very funny but I'd be lying if I said I found it as entertaining as The Stanley Parable. The most major reason for this is the fact the game is not at all what it advertises itself as. It pretends to be about a heist being performed on a mansion, so I went in thinking it was going to be a choice based game like The Stanley Parable, but instead of searching an office building for your missing colleagues you'd be stealing from a mansion. The trailer describes a lot of interesting scenarios such as incapacitating guards and secret passages. The mere addition of combat, other characters and stealth could have really added to The Stanley Parable's formula, but no. The game's story amounts to this: There's another player playing the game so you can't play it yourself, so the narrator decides to make you perform tasks around the studio to help the player currently playing to have a better experience. While you perform these actions there are a lot of jokes and Easter eggs to experience. These are what make me recommend this game, although they are slightly hurt by the lack of major decisions throughout the game. There are small things you can do to make minor changes to the dialogue, but nothing major like you could in The Stanley Parable and when interacting with the environment is the only gameplay in your game, being able to make major changes is a bit necessary. Graphically the game is on par with The Stanley Parable, meaning it's passable, but nothing special. Looking back, the trailer and screenshots are mostly from the studio and the description sort of eludes to the twist, so I probably should have worked it out. But everything else is so convincing. The achievements all seem to be ripped from a heist game and the trailer I just mentioned ends with a close up of a vault that never shows up in game. Even after the game itself tries to make you think you're going to play a heist game. The menu is a getaway vehicle, the loading screen is full of tips for the heist, while you're going around the studio the narrator talks about things in the game. I kept thinking that the studio bit was just a fun little diversion before the main game, or maybe it was trying to show you what to expect when you actually perform the mission. But no, when you go through the doors at the end and you get the achievement for starting the heist, another player comes along and releases the tiger, killing you before the game really begins. I know the game's trying to play a joke, making you think you're playing heist game before pulling the rug from under you, but it feels really cheap.  Verdict: Good, but not that good.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, very short but worth the time playing",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game. Too many pretzels however.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "There's really no downside to this game. It's short, it's free, it's very funny, it looks great, it sounds great, the voice-acting and easter eggs are fantastic, and surprisingly it even has a bit of replayability appeal... Go ahead and get it. I can't imagaine you'll ever regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Loads of laughs... Not something you would expect, the visuals and narrative make the game almost one of a kind. The narrator suggested that I was cheating by Shift+Tabbing to check if I was on the right track for an achievement. Weird, quirky, funny and all in all a game you should to play.",
            "review_score": "1"
        },
        {
            "review_text": "Sends off sort of 'clever' You Don't Know Jack 90s vibes. Self- absorbed narcissistic drivel about some heist designers 2nd album depression.  Consequences of not following orders are zero. if making games is such a pain to you, just leave it. sorry  too linear, hates its audience and   everyone  .",
            "review_score": "1"
        },
        {
            "review_text": "This is a cute little meta-game in the style of The Stanley Parable that is certainly worth 15-20 minutes of your time.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with a litany of charismatic, witty characters and impressively well-done mechanics, and while a first-time playthrough will only last about twenty minutes, the game is one of those ones that will stick with you for a long time.  Also, best running-from-a-tiger-simulator 2015 10/10",
            "review_score": "1"
        },
        {
            "review_text": "best ,stealth, EVER!!! I also loved the parkour!!",
            "review_score": "1"
        },
        {
            "review_text": "20 minutes of fun and humour. I personally believe everyone should play this game (especially since it's free) - gamers and non-gamers alike.",
            "review_score": "1"
        },
        {
            "review_text": "Better than PAYDAY 2.",
            "review_score": "1"
        },
        {
            "review_text": "dat charm tho.",
            "review_score": "1"
        },
        {
            "review_text": "Just play it. xD",
            "review_score": "1"
        },
        {
            "review_text": "Interesting concept, but I would still call it a walkin simulator. The game just doens't have many things to do, honestly, other than pressing buttons. The dialogue is reminds much Wheatley from Portal 2, but not as entertaining in my opinion. Your action have very little consequence in terms of dialogue at least from what i've seen. Now despite all this the game is still fun, the dialogue has it's moments, and being a free game the standards aren't high. Overall I did enjoy the game and i would recommend it. Something short and sweet. I will play the game once more since I heard only in the second run can you pick up and hear the cassette tapes.",
            "review_score": "1"
        },
        {
            "review_text": "This was incredible. From the scary weather effects to the threatening clunky elevator ride it gripped me at every moment moment. I couldn't recommed this game more, you just have to see it. I just wonder why I sometimes heared a phone ringing in the background.",
            "review_score": "1"
        },
        {
            "review_text": "This is honestly one of the best games I have ever played, you should play it... avoid the tiger though...",
            "review_score": "1"
        },
        {
            "review_text": "lel i thought it was a heist",
            "review_score": "1"
        },
        {
            "review_text": "What a great game! I had goosebumps when I encountered the tiger. Can't wait for the sequel, 'Our hope is a boat (and it's sinking)' :)",
            "review_score": "1"
        },
        {
            "review_text": "The guns are not there. 0/10 IGN  UR SKRUB ",
            "review_score": "1"
        },
        {
            "review_text": "it's a very good game, involves stealth and mystery solving like thief only more modern",
            "review_score": "1"
        },
        {
            "review_text": "I'm not on for heist games, but this one was actually rather impressive, the guard AI was good and quite a challenge. Overall its a great and difficult heist game but helpful for all people wanting to get into heists game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its fun and so but! when im playing it im not playing the heist im playing as a guy that help the game! so... where comes the heist name? and when i walk through the big game starting door to the heist THE GAME ENDS?!? do i do something wrong? plz answer me!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really lovely little game! The grappling hooks and tiger fights give way to some charming writing by Jack DeQuidt (@notquitereal) and beautiful visuals during the latter half of the game. Having played the original prototype from the magpie collection I knew what I was getting into but it was still a joy to play through. I do miss the original voiceover by Top Letsplayer Keith J Carberry but Famous Comedian Simon Amstel does a fantastic job. It only takes 20 minutes! Give it a go!",
            "review_score": "1"
        },
        {
            "review_text": "Oh man what a heist! Fast paced and straight to the action! Just watch out for that darn tiger!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a really great in-depth stealth game! Mnay fun levels with great level design with a fair amount of challenge. Choose from a wide range of super-cool heister gadgets, and take down a really big job as the mastermind criminal, theres also a really cool tiger boss fight! While there are some frustrating things here and there, like the OP levels and the badshit crazy AI the gaurds have, though this is a must-buy for any good stealth fan, and even if you arent this game might hook you it's so good! 10/10!!!!    Happy? Good!           Okay, okay, i know you arent, and for a 15-35 minute game, none of those things ive mentioned inhabit this game, heh, not even close, what what it does have, is the charmy charm-charm of the Stanley-Parable, it's so clever it almost hurts.  Here's the rundown, you are ABOUT to play the totally fantastical game i mentioned before, but becuase another player is still occupant IN the game, you have to wait, and the incredible voice actor leads you away from the waiting, to help out with the supposed game the 'other player' is playing becuase all of the workers have quit or something idk. You go do some stuff, its free so no reason to spoil it, but yes, you do come across the tiger, but not a boss fight. Just sayin. The totall game is brillinant, and have a very 'indistructible' metal cover that lures the player in to something cool, at the end, you do eventually get to go to the room to play the game, but the game sadly exits to the title screen. The reason i am writing this part of the review is to tell confused players that there is kind of an inside-joke in the steam community to keep this game as it's advertised. Let's keep the ball rolling, starting with you!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "If this game doesn't put a smile on your face, throw your computer out a window.",
            "review_score": "1"
        },
        {
            "review_text": "Get it and have a little fun",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Best pretzel collecting sim 2016  ",
            "review_score": "1"
        },
        {
            "review_text": "wow, just wow. Loved it. Much cred &lt;3 yes nwn  really tho The Dr. Langeskov, bla bla bla:a whirlwind heist was awesome. It's short ant fun with beautiful commentary. I had a few problems with the graphics but that could just be my computer acting up. great game, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "short, but great!!!!!!!!!!!!!!!!!! how is this free????? just download it. it's funny as hell if the like is game, check out the game 'temple of no' by the same studio. it's a free browser game on itch.io",
            "review_score": "1"
        },
        {
            "review_text": "a tiger ate my face 0/10",
            "review_score": "1"
        },
        {
            "review_text": "a tiger ate my face 0/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is about pencils and little tommy getting naked. then the tiger drinks a lot of soda. best game ever - 10/10! mmmmh pretzels!",
            "review_score": "1"
        },
        {
            "review_text": "Well it was first like 'stanley parable'. Supposed be funny and clever, but for us certain players it sometimes does insult our intelligence and it gets boring. It's free, try it. quite good for a walking simulator. When you start the actual game after the intro 'game'; watch out for the tiger, it can eat you so easily and it's frustrating as hell.",
            "review_score": "1"
        },
        {
            "review_text": "This game is going to be great!",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't play the game, someone else was. ",
            "review_score": "1"
        },
        {
            "review_text": "Honestly pretty good game for being free. I really enjoyed the part where you have to hide from the guards and take then out with booby traps it reminded me of splinter cell, The best part was probably running through the lasers as its was very challenging but fun. The intro was short but once you start the game its honestly sick. On my second playthrough I hope to find all the gun parts and take out the boss. I think its awesome how the story has so many diffrent endings like the car chase was pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "I do not envy, the William Pugh. 'Not Stanley Parable' begins each review. The narrative was good, the setting quite funny But unless he does gods work, they'll say its quite crummy.  The judgement of F2P browsers, their gaze burns a hole. Through the impressive writing, atmosphere and game as a whole. I was impressed; so entertaining and yet free! But depression sets in from opinions of those that aren't me.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would get eaten by a tiger again.",
            "review_score": "1"
        },
        {
            "review_text": "Nice funny but short game (around 30min). It's from devs of The Stanley Parabel and free.",
            "review_score": "1"
        },
        {
            "review_text": "This 'whirlwind' game is worth it just for the v.o. narration. Quick, easy, totally fun. A real win for anyone who appreciates a wry sense of humor. Replaying is totally worth it, too -- to indulge in listening to the tapes and reading all the crazy post-its.",
            "review_score": "1"
        },
        {
            "review_text": "The pencils, they are attacking. You run to the hills and take off your clothes.",
            "review_score": "1"
        },
        {
            "review_text": "i like this compony but this game should have a heist.",
            "review_score": "-1"
        },
        {
            "review_text": "Just like PAYDAY 2 with more heists or Killing Floor 2 BUT WITHOUT DLCs MIKING THAT KILL THE REPUTATION OF A DEVELOPPER AND A FRANCHISE!",
            "review_score": "1"
        },
        {
            "review_text": "Love it! You should try it!",
            "review_score": "1"
        },
        {
            "review_text": "A short but good game. If you enjoyed the stanley parable you certainly won't yawn of boredom on this one.",
            "review_score": "1"
        },
        {
            "review_text": "Can't answer the phones.",
            "review_score": "-1"
        },
        {
            "review_text": " Note: This review is very personal.   A 15 minute heist game with a voice which keeps talking something that doesn't interest me for 5 min.  Bla bla bla.  And when I was trying to figure out how this game works, bla bla bla.  And when I was trying to focus on information given by pieces of paper scattered around, bla bla bla.  And then, I lost interest in this game.  Sometimes, too much talking can only annoy people, when they want nothing but a moment of silence.",
            "review_score": "-1"
        },
        {
            "review_text": "Its hard to down vote a free game from a tiny team...It frankly just a very linear waste of time. While free, its still not worth it. IMHO. I loved the Stanely Parable though, so to the developers, good luck in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "New rule: if a game has any broken achievements, it gets a thumbs down. Broken achievement definition: I did everything that was required, but it didn't unlock the first time i did it.",
            "review_score": "-1"
        },
        {
            "review_text": "The game apparently bugged out on me, the game was way too dark (and yes, I did check the settings, the game was as bright as I could make it). After I hit play, my game was pretty much a black screen, and after a bit of blind wandering I died to the tiger (Whom, again, I couldn't see). This is a game breaking issue, please fix.",
            "review_score": "-1"
        },
        {
            "review_text": "Most of the positive reviews are trolls trying really hard to be funny.  In this game, there is no ...      tiger        heist        guard        mansion        tranquiliser gun        stealth element        vehicle chase        laser corridor        vault        secret room        multiple endings        puzzles     Sure, it's free, but this 'game' is neither particularly funny, nor entertaining. The only reason I played this for more than an hour was because I was desperately trying to get all the achievements. Turns out they are buggy and you have to try several times until they finally work. Don't waste your time like I did.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and not funny",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage. You walk around for 20 minutes pushing buttons and pulling levers. There's no story, there's no choices, there's no game. It's stupid. Pretty sure the only reason it's popular at all is because some people who created it worked on Stanley Parable. This is NOT Stanley Parable. It's worthless trash.",
            "review_score": "-1"
        },
        {
            "review_text": "I found this to be a pretty hamfisted and uninteresting take on fourth-wall breaking. A big part of that was probably the writing for the narrator, it just never clicked for me. About a third of the way through I was completely disengaged from what was going on. There was also a weird sequencing problem, where because I performed actions in a way the programmers hadn't anticipated, the narrator's reactions didn't make sense.  It could very well be that this just isn't the sort of game for me. Your mileage may vary.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was bugged, I had to help another person that WASN'T ME play then the credits played when it was my turn.. 0/10 a terrible sequel to The Stanley Parable",
            "review_score": "-1"
        },
        {
            "review_text": "This is free, so do as you please, however... I didn't find this funny or interesting enough to be worth messing around with. The self aware humor is kind of like Stanley Parable, only not as funny or clever. There's really nothing you can do that has any real effect except for very slight changes to the narraton. And there are some fairly tedious achievements to earn. Without spoilers, the concept is... behind the scenes of a videogame while a player is going through a level, if a videogame were a physical thing run like a play. Yeah, it's a little hard to explain.",
            "review_score": "-1"
        },
        {
            "review_text": "Trapped and cajoled. Constantly touching things and looking for coins. I wish the notes weren't so cryptic and illegible. I wish I could interact in more ways. Just prod and zoom at things I don't care to touch or look at. Tired of games feeling like amusement park rides. Quirky idea that fell flat in conception. I would be on strike, too.",
            "review_score": "-1"
        },
        {
            "review_text": "Free and diverting but ultimately not worth the time you spend going through it. I wanted to like it, I wanted to laugh but ultimately I did neither. I went through it twice, discovered some new content but was still stuck with the limiting linear path. It's not a terrible game and I definitely can't complain about the price but ... well maybe this is some kind of joke and I just didn't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "i hate to say it, but this is crap. its a walking simulator with a a guy in the backround constantly telling you what to do (which does get a little annoying). no action, no proper content. the weird thing is that downloading the game took longer than completing it for me",
            "review_score": "-1"
        },
        {
            "review_text": "The trailer to this game is very misleading and makes you think this is a fun and adventure filled game, where you play as a thief and you are trying to steal something from a vault. NO. NO. NO. That is not the case, you are a character that just walks around and listens to what ever the narrator has to say, when you think you changed something, it really didn't make a difference. The ending is the same, there are no lasers, vaults, or that car you see in the beginning. This isn't at all like Stanley Parable. I'd rather pay for Stanley Parable game than get this game. This game is ABSOLUTE CRAP. Also, it's been out almost a year and the creators didn't even stop to think, to maybe at least put an alternate ending or you actually get into the mansion and enjoy the sneaking, lasers, and adventure that the trailer lead you to think. It's a free game and I know it shouldn't be amazing but at least make it fun, and the Comedy isn't funny.",
            "review_score": "-1"
        },
        {
            "review_text": "I would like this game if i was able to play the actual game I thought I was playing. But no, they decided to pretend like I didn't want the game and that I wanted to play this. It's not funny it's not a good experience and it is a waste of space on my computer. now if you exuse me I am going to play this one story game where all I can do is play the game over and over again and over again and over again and over again and over again to try to get to the mansion bit where I THOUGHT I was going.",
            "review_score": "-1"
        },
        {
            "review_text": "How? How did you manage to make the HOMESCREEN lag? Not to mention the game itself... I got about 2 spf (seconds per frame), and I have about double the mentioned neccesary specs! Cardboard graphics setting doesn't seem to change anything, both performance-wise and visually. Normally I'd ask for a refund in this scenario, but the game didn't cost anything anyway. GG, devs.",
            "review_score": "-1"
        },
        {
            "review_text": "Not fun and not enjoyable. You are basically a guy who just wants to play the game, but someone else is already playing it so you go behind the scenes and make enemies appear, turn ON the lights and etc (real meaning of the story: you are a developer who makes bad games). Other than that, it's just really boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Just because it has the same director as the game that popularized the style doesn't make it any less of a slog.  Mincing narrator wasn't even funny  still give it 9\\11, can't wait for Kotaku to jump on this and call it groundbreaking",
            "review_score": "-1"
        },
        {
            "review_text": "Wait wut u ont s th tig th no lasas so shot pls i no s tig ppl say u c it i no c it its to asy to fast how o ppl lik it?",
            "review_score": "-1"
        },
        {
            "review_text": "A nice quirky and entertaining free game!",
            "review_score": "1"
        },
        {
            "review_text": "I fell through the floor and looked at a white and blue screen for 15 minutes trying to decide if it was a bug or part of the game.   10/10. Would look at a skybox again.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely Fun Heist Action, I snuck by the guard, then lured the tiger into falling in the lasers! Insanely hard, full of trial and error gameplay, for instance, when you first walk in, when you get to the obvious trap door you must    crouch as you walk in, an axe swings and will chop your head off.   There is no save feature, making this a difficult journey, but makes every new area feel satisfying to reach, and I imagine the ending must be wonderful (Will Update when I reach it.) I managed to get to   The fake emerald, the trapdoor always kills me, can someone help me?    Protip: People say the game is only about 20 minutes, this is false, that is a fake ending, like the    Part where you nearly get incinerated    in Portal (Like most people don't already know.) The gameplay is great, and the dev team is quick about fixing glitches, such as the grappling hook glitches, and the achievement bugs. I heavily recommend this game for everyone to play. It's suprisingly in-depth for a free game, and slightly more forgiving than I Wanna Be The Guy. I'd consider donating to the devs to support them to make more wonderful games. 10/10 a wonderful game, One of the best free games.",
            "review_score": "1"
        },
        {
            "review_text": "RIght, well, it's a free game by WIlliam Pugh and has Simon Amstell narrating. Is there any further reommendation needed?",
            "review_score": "1"
        },
        {
            "review_text": "best 20 minutes of my life.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest Heist game of all time!                From what I hear...",
            "review_score": "1"
        },
        {
            "review_text": "When I first played this game, I honestly thought I was going to end up attempting to pull off a heist, since I didn't really know anything about the game, even though the description (or lack thereof) should've been a clue. So, when I started seeing papers with guard patrol patterns and the like, I picked them up and tried to memorize them. I even took some of the hints during the loading screen seriously. I think it was the room with the tiger (yes, I know, that's pretty late to realize something like this) that I realized how wrong I was and an already enjoyable game became even better.  I enjoyed everything about this game, from the voice acting, to Simon Amstell's stellar performance, and even how inept my character was, especially when it came to answering a phone. It's only fifteen minutes long and it's free, so you aren't losing out on anything by trying it out.  Just don't tap the cage. Or do. I don't care, it's your hand",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun. Short and sweet",
            "review_score": "1"
        },
        {
            "review_text": "how do you get in mansion i dont understand this cuz every time i get done i go to play the game and only thing that happens is the tiger i guess kills me in the dark i only here tiger growling and then End i dont get it on the video it talks about you doing extra stuff like a secret passage behind a bookcase or saomething can someone please help i really want to play this and see how fun it will be so please someone help :(",
            "review_score": "1"
        },
        {
            "review_text": "This was quite a hard stealth game. How did they even get a tiger in there? IT LOOKED SO REAL! And what's with the elevator scene? I pressed the down button and nothing happened for a few seconds. I heard some wispers and it got REAALLY creepy. But eventually, I got to the emerald, and the game crashed. I came to this weird waiting room...     (All jokes aside, Crows Crows Crows needs to fix the achievemnt glitch. Wasted 30 minutes eating pretzels. Still an amazing game for FREE. I would pay 9.99 for this thing. (19.99 if it actually had the stealth game, even though crouching is pretty stealthly))",
            "review_score": "1"
        },
        {
            "review_text": "I said yes I recomend this game, but I had to stop and think if that was true. Over all it's a great game and fun to play ONCE THROUGH. After the second or third time (besides achievements) I wanted to uninstall. Game mechanics are great, you can pick papers, spin coffee cups, pick up/hand up phones, and all that great stuff. If the game were longer, I would really appreciate the game mechanics, but with a 15 minute game it was a waste. SPOILERS AHEAD, READ AT RISK OF GAME: If you actually did the Heist, then I would have said YES! hands down best game. But because of there not being an actual heist, I lost interest in the game very quickly. The game mechanics were a somewhat waste, but I still liked it the first time I played it, because I expected a heist but those hopes and dreams were crushed by some kid who likes flipping switches that let loose tigers. END OF GAME SPOILERS. Over all great game, but too short to enjoy multiple times. If you like this but got bored, I highly recommend The Stanley Parable.",
            "review_score": "1"
        },
        {
            "review_text": "Much like the Stanley Parable, this game is an experience. But it's better than that because it's free! In all seriousness, stop reading reviews and don't watch any videos if you haven't already. Download the game, play it, and experience it yourself. The less you know going in, the more pure and enjoyable the experience.  Also, it's a better heist than anything PAYDAY 2 has to offer, and...yup still free. No microtransactions.   10/10 would whirlwind heist again",
            "review_score": "1"
        },
        {
            "review_text": "Great gaming experience. Not quite a stanley parable but still funny and worth a play especially with it being free.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like humerous narration? Did you ever watch 'Never mind the buzz♥♥♥♥♥'? Do you love Hidden clues, with mysterious and vicious tigers? Do you love stealing stuff? Punching in codes? Avoiding lazers? Sneaking past guards?   Then you will absolutuly love this game. Because you do all that AND MORE!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I really loved it, and it was VERY comedic. only down side was it kinda tricked me, its not a stealth game, it is a VERY SHORT game. really fun tho :D.  20/10 -DoctorBroLovesThisGame",
            "review_score": "1"
        },
        {
            "review_text": "Not wanting to spoil too much, it's a short game, and by no means as good as the stanley parable. It has its funny moments, and given that it's free you might as well play it. Voicing is good and the environments are pretty interesting. Lots of nice things to interact with, and accompanying narrations for them. I guess you could say there are quite a few high concept interactions you can discover hidden throughout.  Basic unity game, controls well enough, although a mouse sensitivity slider would have been nice. The graphics are ok. Ha sa few 'collectible'-style achievements if you want to play through it a few times.",
            "review_score": "1"
        },
        {
            "review_text": "I was lucky enough to be a beta tester for this, and in the interests of full disclosure I am a friend of one of the team behind the game.   That being said, this is a tremendously clever, beautifully presented little game, which is refreshing in its sense of fun. It looks great, it sounds great, and it features some brilliant voice acting.   Having also tested it on a 4 year old MacBook Pro, and a HP Mini desktop (in Windows 10) I can confirm that it runs very nicely (albeit with a bit of tinkering with the graphics settings on the older Mac!)  Thoroughly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Short but fun to play with. (That's what she said)",
            "review_score": "1"
        },
        {
            "review_text": "Holds your hands tighter than any Call of Duty game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very clever :) Very neat premise",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good heist game! It has a good stealth mechanic and the controls are as smooth as a baby's bottom.                                                                    but really the title lies, there is no heist. Just a big ♥♥♥♥ you/troll. Funny game though, good to play if your bored.",
            "review_score": "1"
        },
        {
            "review_text": "Super epic heist, cant believe this wasnt made by a AAA dev, better than Payday 2 and GTAV combined...",
            "review_score": "1"
        },
        {
            "review_text": "Still can't pick up the telephone.",
            "review_score": "1"
        },
        {
            "review_text": "Though it is a bit buggy, I am positive taht you should play this game-it's a must-see stealth experience!",
            "review_score": "1"
        },
        {
            "review_text": "Didn't find it funny",
            "review_score": "-1"
        },
        {
            "review_text": "Best 20 minutes of my life.",
            "review_score": "1"
        },
        {
            "review_text": "im dissapointed thought there was going to be a grappling hook a heist to steal the emerald but in the end i just got the backstage :( i thought you had to do it before hand and everything and when the game ennded i just ended up dissapointed just checked on youtube if my game isnt bugged and its not so now i have to sit dissapointed with myself kinda feel betrayed too",
            "review_score": "-1"
        },
        {
            "review_text": "Loved the game  ",
            "review_score": "1"
        },
        {
            "review_text": "lol it was cool",
            "review_score": "1"
        },
        {
            "review_text": "Just download and play it already ;D",
            "review_score": "1"
        },
        {
            "review_text": "how do you get past the tiger",
            "review_score": "1"
        },
        {
            "review_text": "Tiger is bugged. It can teleport into the wall and I can hear some screams when it happens. Maybe that's planned, I don't know.",
            "review_score": "1"
        },
        {
            "review_text": "This is just a short review as I need to get back to playing, I am nearly at the vault but the tiger is still chsing me.  Pros:  50 hour campaign Tiger Epic loot  Cons: The rain is a bit intermitent...as in it just sometimes starts randomly On some of the levels you can hear a phone ringing but I can't find it to answer I was stuck in a lift for like 3 hours before it started moving  In summary wasn't worth the $50, would be ok for around $20 though if you can get it in a steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "this is a truly amazing game. Not a full length several hour game, but one that is still better than most new games today (and this ones free) it is long enough to leave you satisfied and looking foward to more games from this company. Trust me, play this game you will not be disapointed. Did i mention there's a tiger?",
            "review_score": "1"
        },
        {
            "review_text": "It's free, short, refreshing and made me laugh a couple of times. A wonderful teaser for more possibly great games to come from this studio.",
            "review_score": "1"
        },
        {
            "review_text": "THIS WAS SO FAB!! So kind of them to put it up as free, amazing gameplay, neat idea and I love SImon too. (fave comedian also fabulously awkward as the stage manager) even if its not your thing, its free so give it a try, what could you possibly have to lose",
            "review_score": "1"
        },
        {
            "review_text": "incredibly new and different game expirience from anything else ive ever played. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A truley unique and hilarious uh... 'game'?  If you have 20 minutes to spare and want to spend a whopping $0.00 for a laugh, download this now.",
            "review_score": "1"
        },
        {
            "review_text": "didn't expect to scare a tiger back to its cage using a pop tart and a hairdryer  and sometimes, the wind blows so hard that you can't get out of the vents  oh,and they have replaced the old grappling hook that snaps everytime you try to use it  gg  i rate strait 5/7",
            "review_score": "1"
        },
        {
            "review_text": "TROLLS TROLLS TROLLS. YOU ARE ALL TROLLS LOL. This game is Amazing for the comedy",
            "review_score": "1"
        },
        {
            "review_text": "We really need this heist in PayDay 2 and GTA Online  So to the review: +Good Voice acting +Free +Nice Comedy +Got Achievements to play it for a second time for them -But there is this problem with steam that you may not be able to get the achievements  -Short (but free)",
            "review_score": "1"
        },
        {
            "review_text": "What a lovely game. Really bringing an obsure narative to a fun game in an intresting way. Totally worth your 15 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "If I had paid money for this practical joke I would be infuriated but since it's free I'm mildly amused.",
            "review_score": "1"
        },
        {
            "review_text": "Just try it, and enjoy. Im not going to say anything more.   Well ye, just, ITS FREE. So dont wait more.",
            "review_score": "1"
        },
        {
            "review_text": "A short but funny game, nice voice acting, the controls are good and so are the graphics. Definatly a good game to play if you want a little laugh or if you are bored.",
            "review_score": "1"
        },
        {
            "review_text": "There is a LOT of prepwork you have to do before you can really play the game, but it is WELL worth it!",
            "review_score": "1"
        },
        {
            "review_text": "I love the grappling hook, and the random timing timing of the laser activation. The guard-duty is a bit tedious, but the orangery heist makes up for it!",
            "review_score": "1"
        },
        {
            "review_text": "better heist game than gta5 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "It's a really fun game and i would recommend it for anyone who liked the stanly parable.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little gimmick, definitely worth downloading. Plenty of humor, although a little short. How much can you complain for a free game though?",
            "review_score": "1"
        },
        {
            "review_text": "The game honestly happens in your head. It uses the players imagination to reduce the scope of the game. Overall, an interesting short experiment that is an excellent marketing tool for anything Crows Crows Crows comes up with next.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly good for a free game. Great humor, amazing voice acting and well polished. If you liked The Stanley Parable, you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "i dont like this game, i think its boring, i was disapointted when you here supposed to start the game.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing the Stanley Parable, I wanted something else to satisfy my now-whet appetite for interesting games. I will say no more about it. It's free, it's short, and there's some amount of replay value with the new updates. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice 15-20 Minutes of entertaiment, dont expect a lot of gameplay, but its definitley worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "If you like grappling hooks and heists you are gonna love this game. PVP was excullent, weather effects were excelent, telephones were excellant. 10/excellent.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun. It's free. It has lasers. And a tiger. Outstanding voice acting. Just play it, alright?",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy 'walking simulators' like I do you really can't go wrong giving this game a shot. It's free and it's about half an hour long so there's pretty much no risk.  I'm not sure if it's a joke or not, but the achievements didn't work at all for me. If it isn't intentional and you care about achievements, maybe hold off until they're fixed.",
            "review_score": "1"
        },
        {
            "review_text": "The guards have periphrial vision they dont forget you were there grappling hooks work perfectly!! great stealth game!!! [in all seriousness though this is legitametly NOT a stealth THERE i spoiled it but great comedy overall!!!]",
            "review_score": "1"
        },
        {
            "review_text": "Advertized as British Wit, with German efficiency.  Got German Wit, with British efficiency.  1/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me just say this before I get into anything. Not my kind of game; I'm into Demon's Souls, Vanquish, games that are games. But this is free and can be completed in under 20 minutes so I decided to check it out.  I hated this narrative walkabout, non-game, non-sense. 'Oh, but it's in the same vein as The Stanley Parable which was so terribly witty and meta,' you may say. To that, my response is, 'Bite my ♥♥♥.' This narrative walkabout was an annoying and obnoxious 18 minutes. The only good thing I can say about this 'game' is that I now know I never need to play The Stanley Parable because I will likely hate it just as much.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyable, creative, different fun. It's a short game, about 15 minutes, but there is absolutely nothing wrong with it that I can see.   Not game of the year, but 10/10",
            "review_score": "1"
        },
        {
            "review_text": "shut up little tommy",
            "review_score": "1"
        },
        {
            "review_text": "Let's help the developer to help us to help the developer to help us to help the developer to make this game all right.",
            "review_score": "1"
        },
        {
            "review_text": "I was having a great time, but then got stuck in the elevator for seventeen minutes. The button to go down didn't do anything for the longest time, it was really an immersion-breaker. Plus, I'm pretty sure I heard someone talking while I was sitting there. Super unprofessional. Not recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Very short (about 15 minutes) but entertaining and smart game from the creators of The Stanley Parable. I recommend for those who are in a mood for fresh, thoughtful and funny experience.  8/10 Creative and funny.",
            "review_score": "1"
        },
        {
            "review_text": "For a fifteen minute game, this heist was really elaborate. I would LOVE a full paid version of this game with multiple heists of this quality. The grappling hook is a lot of fun to use, and the guards have suprisingly good A.I.  For fifteen minutes, there is no reason you should not play this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played the Stanley Parable, you'll really enjoy this one. It's short, fun, and silly. Plus, it's free, so you should probably just try it. Take 15 minutes of your life, enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game thank you but the achievments arent working so maybe can you fix that please and thank you.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome, but short.",
            "review_score": "1"
        },
        {
            "review_text": "Long title, but amazing and funny game. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of -- if not THE -- finest stealth-action games that I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "I know it's a free game and I shouldn't complain but I just didn't find it funny, I wasn't interested and overall I felt like it was a waste of time both for me and the developers.",
            "review_score": "-1"
        },
        {
            "review_text": "The tiger is the most frightening beast I ever saw. Or didn't see. I mean... Just play this game and see for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fun, definately something i've never played anything like before",
            "review_score": "1"
        },
        {
            "review_text": "This game was hilarious.  Some of the pieces of paper where tricky to collect and could not be read well in the gloomy light, but then moving to brighter light meant dropping the paper, it couldn't be 'carried'. But aside from that, and the fact the cursor disappeared once the game completed, it was hilarious. A very entertaining 20 minutes!!",
            "review_score": "1"
        },
        {
            "review_text": "It's creative and genuinely very funny. Simone Amstell's delivery makes the whole thing worth while. It looks really nice, too  Totally worth your time",
            "review_score": "1"
        },
        {
            "review_text": "Oh my Giddy Aunt this games comentary is just amazing i definately recommend it :)",
            "review_score": "1"
        },
        {
            "review_text": "I DONT RELLY LIKE THIS GAME IT SCARES ME",
            "review_score": "1"
        },
        {
            "review_text": "15 minutes of good fun",
            "review_score": "1"
        },
        {
            "review_text": "This is The Stanley Parable's younger sister. Trying so hard to be cool like her big bro, and big bro's like 'Good job everyone likes you &lt;3' and everyone does because tiny sis over here is cute and funny and who wouldn't love her to bits.   Yeah that's pretty much this game   and I love it ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best intentionally funny games I've played in a while. Voice acting really makes it.",
            "review_score": "1"
        },
        {
            "review_text": "Really liked it.   Vote: 4 / L",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. The only bad point is that the gun models are not realistics but this is a videogame after all.",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere was awesome, and that tiger was so realistic and lifelike. Definitely a must for anyone who's fond of stealth type games.",
            "review_score": "1"
        },
        {
            "review_text": "damn you other player!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutly brilliant. I can't recomend this enough. Better than some games I have paid full price for.  Can you open the door to let me out now please? ........ Please?",
            "review_score": "1"
        },
        {
            "review_text": "Simply brilliant",
            "review_score": "1"
        },
        {
            "review_text": "It's free.  It's 20 minutes long. You have basically nothing to lose.  (P.S. It's a great game)",
            "review_score": "1"
        },
        {
            "review_text": "This is a great 15 minute heist game. The tiger scene was really fun, and the enviroments are fantastic, I had stop and stare at the textures inside the elevator! The story arch with the emerald was incredible and I had a hell of a time playing it. Everyone has to experience this.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly complex heist game from the designer of The Stanley Parable.  Will you succeed at pulling off the most ridiculous robbery in European history? Or will you play the part of the detective out to stop it?  No.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious little game.",
            "review_score": "1"
        },
        {
            "review_text": "it was an alright game, not too long, or too boring. though there were limited actions and was kinda like portal/portal 2 especially with the voicing.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the weird part of steam,  there is a room for you,  you can check out any time you like,  but you can never leave!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and stylish little jewel. If you liked Stanley Parable — play it, you won't be disappointed. Actually even if you have no idea what Stanley Parable is — play it still, it's free! If you liked Dr. Langeskov consider trying out SP, same guys = same good humour. Cheers.",
            "review_score": "1"
        },
        {
            "review_text": "you dont actualy play the heist its 15 mins of pressing random buttons backstage",
            "review_score": "-1"
        },
        {
            "review_text": "My friends and I stared playing this game togeather first it is a really good game 10/10 -IGN. But it was so goood little did my friends no but i was orgaseming in my chair the whle time.   Specal thanks to jeff",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the $60 price tag. Play as the charismatic    Dr. Langeskov    , execute a daring    heist    to steal a    terribly cursed emerald   , or fail and get eaten by a    tiger   . Has some limited multiplayer too.   10/10 stripes. Would get eaten again.",
            "review_score": "1"
        },
        {
            "review_text": "Just delightful!  Quite akin to the Stanley Parable in humour (and that demo, in length), this is an instant way to brighter your day and I can't believe that it's free! What were you guys thinking?! Well, thank you devs for your generosity and for brightening up my day (again). I'll buy whatever you've got!",
            "review_score": "1"
        },
        {
            "review_text": "Not what i expected its a good game",
            "review_score": "1"
        },
        {
            "review_text": "In a very similar spirit than the Demo version of The Stanley Parable. Fun, clever, with tons of references and decent graphics.   About the achievments, I'm pretty sure I got all the P. without pausing the game, swithcing windows, calling the prompt or using the Steam overlay, and still, the P. Door won't open. I don't know whether it's a bug or it means I had to do something more...   About the C., same thing. Got them all. All of them down to the last I could find, without buying stuff, pausing, swithing, calling the prompt or the overlay, and nope, nothing.   So...I just give up. I'm done looking for food in odd places and scrubbing floors.   No really, the game was free, they even tried to pay me, alright, but no I can't stay into that place; not anymore. I'd rather be off to play the Beginner's Test. (Brain lemmigo now, it isn't funny anymore.)",
            "review_score": "1"
        },
        {
            "review_text": "I was very entertained. Really liked the sets and lighting.",
            "review_score": "1"
        },
        {
            "review_text": "Okay then",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Honestly didn't see the tiger coming.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly cute little game, absolutely incredible stealth mechanics and WOW - what a grapling hook! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "better heists than in gta5",
            "review_score": "1"
        },
        {
            "review_text": "Truly excellent, especially for free.",
            "review_score": "1"
        },
        {
            "review_text": "It only had 15-20 minutes of gameplay, but it was so much fun. The commentary reminded me an awful lot of Portal, and the gameplay was hilarious and engaging. I recommend trying this out, especially since it's free.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥, the experience is just amazing",
            "review_score": "1"
        },
        {
            "review_text": "The game is well worth the 15 minutes you'll spend playing it. The only fault I can find with it, and I'm pulling for straws here since many games also have this issue, is that it's a story based game but the story doesn't change with interactivity. It sets out to do what it wants to do pretty much perfectly and it's free, you can't argue with that.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest heist games of the decade; especially in regards of graphics, storytelling, and gameplay. 10/10 Would play again. Absolutely the best free game on the market.",
            "review_score": "1"
        },
        {
            "review_text": "It's free. Just play it.",
            "review_score": "1"
        },
        {
            "review_text": "A short, awesome example of interactive storytelling. 20 minutes well spent.",
            "review_score": "1"
        },
        {
            "review_text": "feeling naughty?  try this.",
            "review_score": "1"
        },
        {
            "review_text": "just play it",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious, excellent voice work and well written. Two big thumbs up from me.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice short game to play if you're bored :)",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting game. Achievements are about as weird as the Stanley Parable.",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist enough. This lovingly crafted game is amazing. It has a story of twists and turns, keeping you surprised and guessing, encouraging multiple playthroughs.",
            "review_score": "1"
        },
        {
            "review_text": "A lovely game that made me laugh - a genuine hearty laugh - which is a definite achievement.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game I ever 100% Finished with all achievements before. Getting all of the achievements was more fun than complicated! It had lots of funny bits, and plenty of childish jokes, espicially when you didnt listen to the person that speaks. I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "i liked but altough it was fun i wished i could do more in the game and maybe more comedy",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a good free way to have 1 to 2 hours of fun messing around, this game is for you. (p.s.   there's a secret box hidden in the wall to the left of the plant in the purple pot   ",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly funny, breezy to play, and free. What more can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "'Game within a Game' award",
            "review_score": "1"
        },
        {
            "review_text": "Probably the BEST STEALTH GAME ever made. Like it's A REALLY GOOD STEALTH GAME.",
            "review_score": "1"
        },
        {
            "review_text": "when u expect it to be a heist game.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. Worth downloading. You dont play the game, the game plays you! x)",
            "review_score": "1"
        },
        {
            "review_text": "A lovely way to waste half an hour.",
            "review_score": "1"
        },
        {
            "review_text": "I'm giving this a recommendation, solely because the choices Steam gives you for recommendations are 'yes' or 'no'.   Is it worth playing? Yes. Was it as funny as the writers presumably think it is? No. Still, a semi-interesting idea that doesn't outstay its welcome.",
            "review_score": "1"
        },
        {
            "review_text": "Came in expecting a short The Stanley Parable, and got exactally that.  20/10 would dowload for free again",
            "review_score": "1"
        },
        {
            "review_text": "Really great heist game, brilliant gameplay, and the controls are tight and responsive. The tiger is a particularly cool mechanic that I haven't seen before! The game is pretty short, only about 15-20 minutes to complete, but it's free and totally worth your time. Give it a look if you're interested in a beautful indie stealth game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty short, but it's free and hilarious so you should play it. There's also some stuff that you might not discover on the first playthrough, so I'm off to play it again.",
            "review_score": "1"
        },
        {
            "review_text": "A great 20 min game. its awesome made me laugh too much and its free. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "A. It's free. B. It's hilarious. Which is a difficult proposition in the world of vidjagaermes.   I've played through it twice in one sitting. It's decidely British.",
            "review_score": "1"
        },
        {
            "review_text": "This is enjoyable. It doesn't take up too much of your time, and costs your debit card even left. I laughed, I felt fear and I hung up telephones.",
            "review_score": "1"
        },
        {
            "review_text": "420/69",
            "review_score": "1"
        },
        {
            "review_text": "Realy good game I almost want to say it should not be free. But anyways its a realy cool, fun and 4e dimension breaking experianse! I realy recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, original concept, nice graphics, good voices, etc.  Good (but short) game! I reccomend you download it.",
            "review_score": "1"
        },
        {
            "review_text": "This was a fun, clever game. It was definitely worth the twenty minutes of my life that I gave it.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, it's free!  Funnest damn 15 minute game I've ever played...  You go 'behind the scenes' on what it takes to run a video game while someone is playing it, and it's a lot like the Stanley Parable",
            "review_score": "1"
        },
        {
            "review_text": "funny enough to have a few laughs in a short time.",
            "review_score": "1"
        },
        {
            "review_text": "absolutely wonderful and funny when you're baked",
            "review_score": "1"
        },
        {
            "review_text": "This is the best free game I have played.  10/10 Would troll Narrator again.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, well worth your time. Just a tip, try not to use the Grappling Hook too much. You find more stuff that way.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game all in all, but I can't help but be annoyed that they implemented a limited inventory in such a short game... I can't steal all the oranges in the orangery without missing out on a bunch of other stuff q-q",
            "review_score": "1"
        },
        {
            "review_text": "The stealth mechanics sucks, but good game.",
            "review_score": "1"
        },
        {
            "review_text": "the funnyest games a have played in quite a while... and is FREE¡¡¡  what more do you whant in life?  great game, AND ITS FREEE  HAHA¡¡",
            "review_score": "1"
        },
        {
            "review_text": "best 15 minutes of my life",
            "review_score": "1"
        },
        {
            "review_text": "you run away from the pencils and you take off your clothes",
            "review_score": "1"
        },
        {
            "review_text": "I dont normally write revies but this one deserves it! :) Great game, loads of fun, witty, and just plain brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining and creative. I actually laughed several times. Also has a kind of a twist you would not expect, very short but made you reflect about your expecations. Definatelly worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "When i'm play this game ..  .. in my heart ... .. like to say ... .. 'this is how you waste your 60 minutes in your live and you get nothing ...... at least you get confusing and fun'.. and at this far ... this is the best confusing game ever...     i am still confusing..",
            "review_score": "1"
        },
        {
            "review_text": "Cost: 20 minutes of your life Gain: 20 minutes of un-ending laughter Good trade, will play again",
            "review_score": "1"
        },
        {
            "review_text": "I was having fun up until I realized the I actually finished the game. I know this was a free game, but I still feel like you owe me a '15-minute heist game'.",
            "review_score": "1"
        },
        {
            "review_text": "Never played a game like this, so for a first time experience, i Have gotta say it's pretty cool. Both times that I have finished though, it's been in the same way. I feel like I need to keep coming back and doing something different xD",
            "review_score": "1"
        },
        {
            "review_text": "Antagonizing pretty much the only staff left in a 'game' mansion. In the style of Stanley Parable. Pretty good start, I'd actually pay for a longer version (maybe at least 3-4 hours long for 10 bucks or less). Probably worth your time for a 230MB download (game takes up 600MB but the download is much smaller).",
            "review_score": "1"
        },
        {
            "review_text": "Good prelude game to what the devs are about to reelase.   Features Simon Amstell, may recognize him from 'Never Mind The Buzz♥♥♥♥♥'",
            "review_score": "1"
        },
        {
            "review_text": "Short and funny.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, funny, brilliant.  Free game with incredible voice acting.  When does the pencils game come out?",
            "review_score": "1"
        },
        {
            "review_text": "The game was really well made, however, the player is left with many unanswered questions.   Who is Dr. Langeskov, and what are his motives? Why does he break into a mansion and steal an orange?  I guess we will never know until Dr. Langeskov, The Tiger, and The Terribly Cursed Emerals 2.  ",
            "review_score": "1"
        },
        {
            "review_text": "Short, free, and by the maker of The Stanley Parable. What's not to like?  10/10, would get eaten by tiger again.",
            "review_score": "1"
        },
        {
            "review_text": "Short and linear, a genuine walking simulator - but it's free and it's funny, with Simon Amstell perfectly cast as a sane(-ish) person going quietly off the rails as the rug keeps being pulled out from under his feet.  It won't have a huge amount of replay value, I suspect, but just as I rewatch favourite sitcom episodes from time to time, I suspect I may well find myself returning to this occasionally to see what little details I might find.  Light and enjoyable. It costs you no money and very little time. Well worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "Heyyy! I'm a giant cucumber, check me out!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 the tiger looked almost real",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun with some challenging moments. The guards AI Pathing is perfect, the Lazer part was just, UGHHHH SOO GOOD! This is one of the best heisting games ever!  Well as long as someone else isnt playing...",
            "review_score": "1"
        },
        {
            "review_text": "It's very quick but it's worth playing.It's funny,stupid [in a good way],   is nothing about the title, and makes you want to play again.  ",
            "review_score": "1"
        },
        {
            "review_text": "It I uh It was yeah 100",
            "review_score": "1"
        },
        {
            "review_text": "'That was cool' -you after playing",
            "review_score": "1"
        },
        {
            "review_text": "A very accurate depiction of the company I work for. I kinda wish I was joking here.",
            "review_score": "1"
        },
        {
            "review_text": "Did you like The Stanley Parable? I did.  It had great writing and voice work.  Lots of fun ideas and humor. This is like a tiny version of that. It's short. It's free. It's fantastic. Go play it! ",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game and it's FREE! Makes me excited for the projects we'll see from these developers.  PS. Make sure to play the game more than once and listen the recordings scattered around the game. They sure will make you laugh :)",
            "review_score": "1"
        },
        {
            "review_text": "What couldn't do EA games, CrowCrowCrow did. They made a good game. The game itself is like a theatre play. It had atmosphere of a dusty backstage. I loved that. I applaused during credits. True story bro. ---------------------- + A good game. + Jump scares. Well, a one jump scare. + 'Little' easter eggs.   Like a vault door.   + The book titles. + All the small details. + The tiger. + Has reload maped on R button. + Drop the BROOMS! + Spin the CUPS! + Collect ALL the STICKY NOTES! + Emerald, Gold, Cooper and Cardboard graphics settings. ---------------------- - A short game. - Doesn't have guns.",
            "review_score": "1"
        },
        {
            "review_text": "Wow!  The first thing I heard about this game was seeing the launch trailer. As soon as I saw Simon Amstell was involved, I was sold, doubly so when I saw the Stanley Parable name involvement.  This is a fantastic little game. I just played through it for my fourth time in one hour. It's interesting, entertaining and made me laugh out loud at points.  It's also free, so you have no excuse.",
            "review_score": "1"
        },
        {
            "review_text": "All I have to say is: If you enjoyed The Stanley Parable, you'll DEFINITELY enjoy this one. It's a great game with a great sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "So what is there to say. Ummmm..... A tiger Thievery Funny things  Did I mention a tiger. He is umm... kind of hungry. Just um don't mess with the tiger or anything for that matter. The hiest can go real wrong so fast.",
            "review_score": "1"
        },
        {
            "review_text": "I expected a fun heist game.    I got assistant to the stage manager simulator 2015          10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would not pick up the phone again.",
            "review_score": "1"
        },
        {
            "review_text": "This is what happens backstage when you play a game..",
            "review_score": "1"
        },
        {
            "review_text": "so short plz make it longer it fun and funny but it is like ten mins and you have finished the game could you make a more to the story like when you go to area where the tiger (ending room) could you make more to that but you don't have to make the heist but just make more room and more thing like the stanley parable there was lots of rooms and more achievements but otherwise the game is awesome even for the state that it is in now but it is a great game and you should get it becuase it is really funny and the consept the game it amzing and it good free game but i still wish there was more stuff to do but other than that it is a great game   GG william keep making these games are awesome! :D",
            "review_score": "1"
        },
        {
            "review_text": "The best parts of the experience are the audio tapes. If you like odd humor, disobeying orders and mystery then this is the freest, best game to kill an hour with. Brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "--------spoilers ahead---------                            Really fun game which involves another whole story which was told",
            "review_score": "1"
        },
        {
            "review_text": "The tiger animation was simply sublime: Kudos! But I have to say that sadly, Dr. Langeskov herself was a bit of a downer. Next time, please hire a AAA Hollywood star.   Despite that little bit of a hiccup, lighting was perfect (loved the sunset) and the AI was excellent (quite the nostalgic throwback with those one-liners! Awesome!).  But for the next episode: please, please cut the Depth of Field! I couldn't even make out those baroque corners and I bet the artists were very disappointed. Quite the mansion though (got lost three times, had to backtrack hehe ;) - no walkthroughs though, promise!  Can't wait for the next episode. Are we going to finally use that pencil we got in the inventory? It was the only item I couldn't use. Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "Really loved the game. I Am definitely looking forward to a full length game from this company. The game was a great ride. The people behind this seem like such witty and interesting people from this game. Get this game. It's only 20 minutes of your life and they'll be the best 20 minutes you spent today.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and immersive experience!!  (I fell down into the floor at one point, but i just restarted it)",
            "review_score": "1"
        },
        {
            "review_text": "Beware of the Tiger.",
            "review_score": "1"
        },
        {
            "review_text": "I mean, it's funny. But WHERE THE F*CK IS THE GAME?",
            "review_score": "1"
        },
        {
            "review_text": "Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whielwind Heist is a game where you play as a master thief, in search of The Cursed Emerald.   The game is brilliantly designed; in fact, this may be one that could rival that of other stealth heist games, such as Payday or even Splinter Cell. With tons of variety when it comes to the heist itself, this game is a cut above the rest and is something everyone should play.   Plus, it's free!   How could you beat that?",
            "review_score": "1"
        },
        {
            "review_text": "A game that makes you laugh with or without trying.   10/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best free game I've played. I don't think I should compare it to Stanley Parable but if you liked it, you'll like this one. Even know the end is pretty easy to guess, the story is simple and well made and the voices are awesome. A good game if you've got 20 minutes to chill. Then, you can discover all the little secrets hidden in it wihich is also awesome!  UPDATE: Everybody's talking about grappling hooks and lasers but I didn't see any. I think the game is just an endless cycle but I'm not sure...",
            "review_score": "1"
        },
        {
            "review_text": "it was ok i guess but it would be better if they had a part two so we could play as that character",
            "review_score": "-1"
        },
        {
            "review_text": "this is my kind of humor",
            "review_score": "1"
        },
        {
            "review_text": "Can somebody PLEASE tell me how to actually play the game. I always get 'backstage'.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastically laced with amusing secrets, this game is most definitely one of the best of its kind.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME BUT MISLEADING? ",
            "review_score": "1"
        },
        {
            "review_text": "Love it.",
            "review_score": "1"
        },
        {
            "review_text": "Although I've only taken a peek at some of the RLV that preambles this title, it stands on it's own as a pretty amusing bit of interaction. It wasn't spectacular but it was interesting and a little bit cryptic. I can only hope that there is a bit more of a rabbit hole within the game itself to be discovered.",
            "review_score": "1"
        },
        {
            "review_text": "Love the comedy and a game that you should be able to enjoy for yourself !",
            "review_score": "1"
        },
        {
            "review_text": "It's a 15-minute game. I enjoyed it. You might too. ^_^  Note: Don't take the discussion forums *too* seriously - unless you're familiar with the Octodad meme, in which case you'll likely know exactly why I'm saying this. :-p  (Also, buy yourself an orange soda if you get the chance.)",
            "review_score": "1"
        },
        {
            "review_text": "Came for a heist game, left with a stolen heart.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "so i do all the thing the guy tells me.and ♥♥♥♥ him off.then the 'player' pulls the tiger switch.and i died. thats what you get when you ♥♥♥♥ ppl off",
            "review_score": "1"
        },
        {
            "review_text": "Absolutelly hilarious, certainly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like the Stanley Parable?  Well, this is a game that is similar to it but provides a new experience. Even if you haven't played the Stanley Parable it is still worth playing this game as it defies the local trend of many games.  Overall, it is a wonderful game that needs to be played.  P.S. It is a F2P game that doesn't have DLC or pay to win features included.",
            "review_score": "1"
        },
        {
            "review_text": "It's free, funny, short, clever, and has Justin Roiland in it. No excuse to not give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent short game. Has a fun premice like all other William Pugh projects, so go play it. It's free, so there's very little reason to skip out on it.",
            "review_score": "1"
        },
        {
            "review_text": "Really charming. Short, linear game, but very well written and executed.",
            "review_score": "1"
        },
        {
            "review_text": "it was stupid but in a funny way.",
            "review_score": "1"
        },
        {
            "review_text": "Short little game, but it's funny. 10/10 for being clever and sarcastic. :) Plus free to play",
            "review_score": "1"
        },
        {
            "review_text": "You've really got no excuse not to play this. You have the time, you can afford it and it's very good. Stop reading, start playing.",
            "review_score": "1"
        },
        {
            "review_text": "The most best heist game evir!",
            "review_score": "1"
        },
        {
            "review_text": "It's free, 20 minutes short, conceptually novel and very funny. You will get more out of this 20 minutes than many games give you in many hours.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played it I thought it was funny and witty, a 20 minutes well spent.  Then I read about the 'pretzel update' and decided to try the game again, this time listening to tapes and collecting pretzels, and it has a whole, great addition to the normal game. It is now one of my favorite games. :) 10/10 4 pretzels",
            "review_score": "1"
        },
        {
            "review_text": "Love TSP. This is remotely funny. Not worth my time though.",
            "review_score": "-1"
        },
        {
            "review_text": "I played it before it was cool.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game the way you dont actualy play the game you set it up for somone else and when its your turn somone messes it up",
            "review_score": "1"
        },
        {
            "review_text": "Very funny game, short enough to hold anyone's attention and has a really good basis.",
            "review_score": "1"
        },
        {
            "review_text": "I could of sworn someone was behind the elevator....must be rats.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game but it is really short and i am not sure if it is supposed to be like the stanley parable and how are we supposed to get all teh acheivements will there be an uppdate to the game where you can actually play the real game i dont know but i would like to see it",
            "review_score": "1"
        },
        {
            "review_text": "[Spoiler?] The entire time I was wondering what kind of marvelous adventures the player was experimenting with the aid of my careful interventions and at cost of no little ammount of anxiety and feeling that I may be completely useless and incompetent and the player's enjoyment depended exclusively on me. The trees in the lighting room looked amazing, the snow in the elevator room... Looked like a lot of fun. I finally made it. And the other player refused to cooperate. Such is life. Hilarious and reminiscent of Stanley Parable, of course. Need more from this studio now.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. I don't want to spoil anything because half the fun is seeing how it plays out, but it's hilarious from start to finish. It's also a great length. Any longer and it may have gotten old, but the game ends at a perfect point.",
            "review_score": "1"
        },
        {
            "review_text": "i played a game where it told me what happens while youre playing a game 11/10 ign would play again",
            "review_score": "1"
        },
        {
            "review_text": "VERY short but very entertaining! Witty and funny and pay no attention to the top rated reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Takes The Stanley Parable and waters it down to you standing in a room and listening to a British narrator pleading for you to press the next button, he stops talking, you press the button, he pleads again till you press a button, repeat. It's a waste of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist pegs itself as a 15 minute heist game, so I will peg this as a 15 minute review. Whether or not I wrote it in 15 minutes will be indiscernible by you so I guess you will have to take my word for it. This is a heist game at a whirlwind pace involving an cursed emerald, terribly cursed in fact, a tiger, and... oh what's the point? Everyone else has left, so why shouldn't I? I'm just the unpaid intern copying bits from the full review into the Steam review. You know what, I'm joining the strike myself. I refuse to work under these conditions. -Carl",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know what I would expect. I thought it was nonsense. But, it was gorgeous! I never thought you could fit in a heist game that is well-written and has lots in action in it in 15 minutes more or less. It left me baffled and wanting for more! I need a sequel to this! Kudos!",
            "review_score": "1"
        },
        {
            "review_text": "It was ♥♥♥♥ing awesome experience.",
            "review_score": "1"
        },
        {
            "review_text": "The Stanley Parable formula starts to show its limits.",
            "review_score": "-1"
        },
        {
            "review_text": "A hour long spectacular heist of a game, beautifuly executed stealth mechanics, thrilling conclusion, and a wonderfully realized tiger.",
            "review_score": "1"
        },
        {
            "review_text": "a wild romP into the straNge and sublime. 10/10, woulD bang, and a tip For ThOse who don't know - Some of tHe papers thaT look lIkE jibberIsh? thaT's hexidecimal code. there'S more to this than at first glance.",
            "review_score": "1"
        },
        {
            "review_text": "Found this quite funny played through a few times now, each time feeling as if i missed something, or if i did something diffrent. i highly recomend this game, i would also recomend signing up to there email list too, quiet funny email's.",
            "review_score": "1"
        },
        {
            "review_text": "i mean the tiger is really buggy and keeps clipping through walls but other than that 10/10 stealth game",
            "review_score": "1"
        },
        {
            "review_text": "The best character devolopment eveer in a game to be honest. And in 20 minutes! Dr. Langeskov is the most fleshed out and beleivable chaacter in a game since Witcher 3 or something.",
            "review_score": "1"
        },
        {
            "review_text": "this game is beautiful",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful little game everyone should take a break and spend 20min on. Think of it as this days 'stop and smell the roses'-moment.",
            "review_score": "1"
        },
        {
            "review_text": "Completely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Wow...  That was one of the most interesting concepts for a game I have ever seen. Behind the scenes of the ga...  I mean, Um, Wow, what a great heist! so many ways to get the emerald!",
            "review_score": "1"
        },
        {
            "review_text": "Stylish, funny, and free. There is literally no reason for you to not play this game right now.",
            "review_score": "1"
        },
        {
            "review_text": "Not the longest game, Im hoping for more, but was AMAZING!! I just loved it! I totally recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "I definitely reccomend this game if you're looking for a game that is a good 20 minutes of laughing, confusion, and a broken fourth wall. Seriously awesome I was shocked when it showed the end credits but I still think that for a free game it was awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Should you download this game? Yes. The less you hear about it before playing it the better. You'll love it, or your money back. ",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Best of 2015.",
            "review_score": "1"
        },
        {
            "review_text": "I swear I haven't had this much fun in a stealth game in the longest time!! But there was some weird.. muffled talking in the elevator part. Is that part of the lore or... Or are the sound files messed up?",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic little game. it made me laugh out loud. It is very short. And it's free.   ... Go play it already!",
            "review_score": "1"
        },
        {
            "review_text": "Birdman: The Game",
            "review_score": "1"
        },
        {
            "review_text": "I was in a whirlwind of confusion the whole time, and i loved it",
            "review_score": "1"
        },
        {
            "review_text": "Going into Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist I had no idea what to expect... but I did expect something different. Without giving anything away the game takes about 15 minutes and is 100% worth your time and effort. Loved the Stanley Parable, love this can't wait for more  For a full spoiler ridden playthrough visit our video below.     The Game Tutor's Playthrough  [www.thegametutor.co.uk]     ",
            "review_score": "1"
        },
        {
            "review_text": "I know this may not sound the greatest review, but the game was good. It had a cool and funny story, and a good fill to it.",
            "review_score": "1"
        },
        {
            "review_text": "Just playing it once shows you how great it is. Oh man. What a work of art. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "wow what a brilliant game, i recommend u play it if ur a stanley parable fan (like me)",
            "review_score": "1"
        },
        {
            "review_text": "Really short game. I was a bit let down when there wasn't an actual game. Funniest bits were the audio tapes lying around. Hint: pick up tape recorder on the table at the beginning.   10/10 would fap to Tommy's voice again",
            "review_score": "1"
        },
        {
            "review_text": "It's free. It is greatly amusing. You should play it. 10/10 would heist again.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Bafta guys will be all over it, this heist will win awards. One small problem though, I kept getting stuck on the roof of the summer house mid playthrough, which would be fine but that tiger can swim...",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. I'm sure it is the first masterpiece of many to come from this small new game company. Best wishes to Crows Crows Crows.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, tiger boss was hard.",
            "review_score": "1"
        },
        {
            "review_text": "Robbed the princess, slayed the bank, and saved the dragon. 10/10 I could tell a lot of money went into this game.",
            "review_score": "1"
        },
        {
            "review_text": "Funny and short.",
            "review_score": "1"
        },
        {
            "review_text": "It's free. Takes 15 minutes. It's fantastic",
            "review_score": "1"
        },
        {
            "review_text": "In my opinon this is the best fourth wall breaking game ive evered played",
            "review_score": "1"
        },
        {
            "review_text": "Ok so this game... don't expect a heist just don't why because the next player sends in a tiger but you never get to play   THANKS FOR WASTING 1 HOUR OF MY TIME TRYING TO FIGURE OUT IF THERE WAS A HEIST  Edit: so I can see a lot of people saying that there was a heist so unless i missed something important then i missed the heist if someone can tell me if there is a heist and if so how to get to it then i will change my review",
            "review_score": "-1"
        },
        {
            "review_text": "It's cute.  A very nice narrative idea, close to Jasper Fforde literary works.  That idea is turned into a 15 minutes walking game (at best you press one button) in a huis-clos, with a very smartly written monologue told by a very good voice actor, quite reminiscent of Wheatley from Portal 2.  And that's it. But it's free. You may enjoy that ride, with a coffee in your hand, for fifteen minutes. Do recommend in that spirit.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing stealth game! I would personally put it up against Payday 2 and related games. The actual heist itself was outstanding! All of the reviews have so little play time because the game is that insane!  PROS +Sneak aspect is done very well +Guards aren't clueless +Realistic times that aren't too long at the same time +15 minute heist that can be played over and over again +Endless number of ways to unfold the heist +Very inovative stealth/heist game  CONS -Literally none  11/10 would steal emerald again",
            "review_score": "1"
        },
        {
            "review_text": "i like this game very interactive m8",
            "review_score": "1"
        },
        {
            "review_text": "Good graphics and this game need more story line to complete. It's okay for walking simulator, some jokes and good music while pressing the numbers.  My downloading time is longer than playing this game. no regret to download again. like it 8/10 for free game",
            "review_score": "1"
        },
        {
            "review_text": "So, this will be a spoiler-free review.  What can I say about  Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist ? I admit the ending took me off-guard and I smiled, but with knowing  The Stanley Parable  already, it didn't have such an impact on me. While the former made me laugh on each subsequent play (until I ran out of endings, that is), this is an one-time gem. Once you play to the end, the magic is gone.  Also, apparently I'm one of these 49% of players, to whom the achievements aren't working.  On the plus side, this game is free to play, so you're not loosing anything in trying, so once you have need to pass the time, get this one and play.",
            "review_score": "1"
        },
        {
            "review_text": "Nice and funny short game!",
            "review_score": "1"
        },
        {
            "review_text": "I would say this was a very entertaining experience much in the same lines of Stanley Parable... and this one is FREEEEEEEEEEEEEE!  Great humor. Interactive world. And it's technically a game. (Interactive experience, is more accurate, however.)  So, yeah, go do the thing, and hit the play button. You'll not regret the 30mins to an hour you spent playing DLTTTCEWH!   It's also GREAT for streaming at least once!",
            "review_score": "1"
        },
        {
            "review_text": "I still don't know what happened...",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend this to anyone, amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Ok first of all this game consists of you walking around backstage so that 'another' player can continue through the 'game'. That's it. There is no replay value. I liked the atmosphere of the game, though, and I must admit that I laughed at the narrator's reactions whenever I did something he didn't ask me to. Hanging up the phones in the game were probably the best part. It is free and worth the one time play through.",
            "review_score": "1"
        },
        {
            "review_text": "I wondered to myself why this seemed so much like the stanley parable, well now its obvious. Its free, and maybe 10 minutes long but all very worth it if you want a good 10 minutes to sell you on a new games studio",
            "review_score": "1"
        },
        {
            "review_text": "Great short interactive concept :) 8/10",
            "review_score": "1"
        },
        {
            "review_text": "IS FREE AND IS OK",
            "review_score": "1"
        },
        {
            "review_text": "what/10",
            "review_score": "1"
        },
        {
            "review_text": "It takes about 20min to play and is well worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "The game wasn't bad, and I liked the part where we got free pretzels.   BUT.    I feel like it could use a few more pencils, hills, and italian men.   Oh, and some easier-to-use phones. That'd be swell.",
            "review_score": "1"
        },
        {
            "review_text": "Best heist game I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Takes stealth games to the next level. You have to duck past guards, lazers, AND a tiger.",
            "review_score": "1"
        },
        {
            "review_text": "Can't recommend it enough Grappling hook mechanics are amazing. Replay value is incredible.",
            "review_score": "1"
        },
        {
            "review_text": "Was stuck on the treeline walkway for ages, but otherwise a lot of fun. WRITE DOWN THE VAULT CODES! ",
            "review_score": "1"
        },
        {
            "review_text": "Add a discount Portal 2 Wheatley and you have yourself a waste of harddrive space and data to download such a ♥♥♥♥♥ wank fest",
            "review_score": "-1"
        },
        {
            "review_text": "Only 15 minutes for whole game, but those are fun minutes. Keeping in mind the price of this game - it is perfect.",
            "review_score": "1"
        },
        {
            "review_text": "A really interesting game, with awesome graphics and storyline. You need to listen to instructions because otherwise you may not know what you are doing. A good game which I reccommend but it might not be worth downloading because it is very, very short. And I managed to complete it in about 15-20mins.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice and funny game. Not very long, you just need at maximum 2 hours to finish it with all achievements, but its full with jokes and funny moments. And you can mess around a little too: (spoileralarm)   Step on the tables in the white room ;)    I really recommend the game, not only cause its for free. :D",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of Stanley Parable. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A cute little thing, well worth the time and price!",
            "review_score": "1"
        },
        {
            "review_text": "once you find all the tape recordings on the second run through it is actually hilarious, 10/10 for Justin Roiland (from rick and morty) for doing a real good job on the tape recordings and hiding those pretzels so damn well ;D",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game in the world ever that I've completed twice. I think I'll complete it a third time.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, But there is no heist, All these reviews talking about how smart the 'Gaurds' are is a lie lol.",
            "review_score": "1"
        },
        {
            "review_text": "A short simple game thats Free, I mean how can you beat that price?!",
            "review_score": "1"
        },
        {
            "review_text": "Its fun. Its free. You would have to be stupid not to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my... Just oh my...  This is an amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly clever game. If you haven't played it already, what are you doing with your life?",
            "review_score": "1"
        },
        {
            "review_text": "Yes, I recommend this game, as long as it's free. It's pretty short, and really has no replayability other than watching friends play it. It's basically the poor mans version of The Stanley Parable.. as long as that poor man only likes having one possible ending to his quest, and doesnt like making that many choices that effect anything.  In short, good game, but not much to it.",
            "review_score": "1"
        },
        {
            "review_text": "Super game. Ate pretzels, listened to tapes of odd people, tipped over brooms, picked up coins and sticky notes. Oh, and the game was ok too.",
            "review_score": "1"
        },
        {
            "review_text": "When you get to the elevator, be careful. There's a glitch where it tends to wait a darn long time before you go down. I'd expect this kind of glitch in a 'My First Videogame' not in a well polished indie masterpiece of a stealth game.",
            "review_score": "1"
        },
        {
            "review_text": "PROS:  *Theres a tiger  CONS  *No tiger   10/10 would reccomend to everyone with a computer running Windows XP or lower",
            "review_score": "1"
        },
        {
            "review_text": "It's funny and cute. Short but a good time.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the bit with the Terribly Cursed Emerald.",
            "review_score": "1"
        },
        {
            "review_text": "A really good free game that makes you want Stanley Parable&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "it is just great",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious, and awesomely free-to-play, short playthrough of a game",
            "review_score": "1"
        },
        {
            "review_text": "This was genuinely amazing. The story telling and the length of it and the general plot reminded me a lot of the Stanely Parable Demonstration. It only took me 15 minutes to complete but it's just really good story telling. But without too many spoilers, there is no Dr. Langeskov or a terribly cursed emrald, or a whirlwind heist. But there is a bit of a tiger.   Trust me, you will enjoy this game a lot if you get it. I would definitely pay money for this if it wasn't free.",
            "review_score": "1"
        },
        {
            "review_text": "This game is odd. Honestly, genuinely weird. But not in a bad way.  I can guarantee that you will have a mindf@!k moment at least once whilst playing this game. I can guarantee that you will laugh whilst playing this game. I can guarantee that you will have no idea what the hell is going on whilst playing this game. I can guarantee that you will question every single aspect of the game whilst playing this game. I can guarantee that you will sit back and say 'what the f@!k...' after playing this game.  I can guarantee that you should buy this game. And it's free, so you have literally no reason not to.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my favourite games ever.   Please make it a real game ;)",
            "review_score": "1"
        },
        {
            "review_text": "If you have played The Stanley Parable (which you should) and liked it (which you should) you should play this. The idea is similar, and so is the player's range of interaction with the world. It's short, ~30 min, and it's free.  And watch the trailer.",
            "review_score": "1"
        },
        {
            "review_text": "Quick and loads of fun! Definitely something to play over and over again for a good chuckle!",
            "review_score": "1"
        },
        {
            "review_text": "An amusing and interesting game, and easy to miss the subtlety (i.e. the real game). I wonder if the project they are working on is a primer on the rules for Mornington Crescent, though I fear they will merely bowlerise Stovold's mighty tome(s)  Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game with great : voice acting , music , choreography and great humor. this is one of my favourite games to date, in conclusion I highly recomend and well done to the creators",
            "review_score": "1"
        },
        {
            "review_text": "wtf is going on???You can't play the heist, achievements are trolls...I liked it",
            "review_score": "1"
        },
        {
            "review_text": "This game, for how short it is, is incredible. The atmosphere is amazing. The lighting (the storm was really cool), the swelling music, the colors and the art style...it was all SO perfect. Really made me want to see more!  The controls were easy to master, though the AI pathing is a bit wiggly at times. The tiger was a nice surprise -- any by nice, I mean terrifying. I'll never forget that chase sequence. The lasers got me a few times, but after a couple of runs it was easy to see the path I needed to take.  Some things felt a little OP though. Also, there was some weird audio in the elevator???  All that aside, 10/10, would steal The Terribly Cursed Emerald again.",
            "review_score": "1"
        },
        {
            "review_text": "So good, it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is short, but that is it's only downfall. It's hilarious, and deviously clever. I would consider it a sequal to the Stanley Parable- seeing that it's made by the same people as the Stanley Parable.  I would reccomend this game. It's quick, easy, and can easily make you laugh.",
            "review_score": "1"
        },
        {
            "review_text": "Very short and fun its worth your time ; )",
            "review_score": "1"
        },
        {
            "review_text": "I looked at this game saw a bit of the preview and said, 'heck this could look like a very INTERESTING game'. To my surprise it was interesting in a way I did not expect. While yes it is a short 15 minute experiance it will be one of the most THRILLING 15 minutes you will probably experiance from a game. I genuinely can't wait for anymore games from this developer.   9.8/10  P.S.  Those of you looking at reviews to see how good this game is do not read past this!",
            "review_score": "1"
        },
        {
            "review_text": "Greeeeeeeeat game!! Love everything about it especially Little Timmy! Good job CrowsCrowsCrows!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Go go get it! play it! its awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Oh this was a lot of fun. Loved it.",
            "review_score": "1"
        },
        {
            "review_text": "  You can actually activate the dramatic lightning you hear in every movie and game....  10/10 would dramatic again I also got this game as a gift.",
            "review_score": "1"
        },
        {
            "review_text": "What justed happend?",
            "review_score": "1"
        },
        {
            "review_text": "Directed by William Pugh (The Stanley Parable designer), Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist is a fifteen minute free game. It has the same troll-ish playstyle as The Stanley Parable, really give this a download if you've got a few minutes to kill :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Love it. Played it over an over and over (Yeah I have no life)",
            "review_score": "1"
        },
        {
            "review_text": "if you have 20 mins to spare just give it a try. and getting the achivements makes the games much fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is a hilarious experience, thats all I can say.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, you should I really consider playing it if you have not already; it's free! I'm looking forward to future Crows Crows Crows projects.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the Stanley Parable, heist games, action, tiger fighting, and oranges, this is the game for you.  It's free, takes 20 minutes and will probably make you laugh- just play it :)  Best part was sneaking out of the mansion through the vents",
            "review_score": "1"
        },
        {
            "review_text": "OK this game is hard, and i only beatthe tiger ONCE out of playing it 2000000 times. But the hardest part is the vault because you have to enter a code and the code you can easily miss because to get it you have to avoid the pencils running towards the hills and getting rid of your power points.Once you have the code you have tell the code to a parrot who will repeat what he hears and the vault door will open to reveal a planet being chased by pickles and cucumbers and a bunch of stuff like that. Beneath this there is a long green garden thing and if he gets you you die.  I hope you found this helpful",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the Best games of all time no joke.I played through this game multiple times and had fun each and every time I did.",
            "review_score": "1"
        },
        {
            "review_text": "all around good game",
            "review_score": "1"
        },
        {
            "review_text": "This game was brilliant, extremely short but sweet. It is incerdibly funny and ejoyable. I have never cared about or avoided spoilers in the past, I usually read them without a care, but with this game, be spoiler free when you play it! I cannot stress that enough. This game is free and that makes it even better, and it seems to be able to run on virtually any machine. You have no excuses, please play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Funny game. 20min long but its free ps i whant a longer game like this! :)",
            "review_score": "1"
        },
        {
            "review_text": "Just play it, it will take about 20 minutes and its free!",
            "review_score": "1"
        },
        {
            "review_text": "An excellent but small heist game.  If you're a fan of Thief, Resident Evil (the old ones with the puzzles) or the Uncharted series then this is a must play!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best game I never played",
            "review_score": "1"
        },
        {
            "review_text": "It's free, it takes about half an hour, it's got Simon Amstell in it and it's fascinating.  Do yourself a favour and download it.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "my only complaint is that it's not longer",
            "review_score": "1"
        },
        {
            "review_text": "This is a life changing game.If you are having a very bad day like me just donload 300MB and get a very very good mood! Congratulatons to the devlopers of the game,best singleplayer game i ever played!!!",
            "review_score": "1"
        },
        {
            "review_text": "this is a hilarious game love it so much i love the sneak mechanics and the mansion part was sooo good!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "how do you acctualy get into the hiest because im always in the helping bit and cant do it",
            "review_score": "1"
        },
        {
            "review_text": "Would hiest again!",
            "review_score": "1"
        },
        {
            "review_text": "cool right. i am right so dont say no cause im right",
            "review_score": "1"
        },
        {
            "review_text": "Pretty funny, but I wish it were longer.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  not enough stanley parables to parablize my parable. ",
            "review_score": "1"
        },
        {
            "review_text": "  A fun and funny walk-em-up where nothing goes wrong. Easily completed in a thirty minute session. And totes gratis! :-)",
            "review_score": "1"
        },
        {
            "review_text": "Sure, why not",
            "review_score": "1"
        },
        {
            "review_text": "I literally cannot write anything to make this spoiler free, so if you want to do in blind (or don't want to read) heres the:    TL;DR",
            "review_score": "1"
        },
        {
            "review_text": "funny querky and what you'd expect from the makers of the stanley parable could've used a bit more variety but it's afree game and it's good it set out what it set out to do",
            "review_score": "1"
        },
        {
            "review_text": "Super funny game, especially for someone who works in the live theatre industry. 'Pencil' tapes were hilarious. The achivements do gltch out quite a bit though, the coin one still isn't working for me. It's free, it's funny, you waste nothing.   As for the description, it's the continuation of the click-through puzzle game A807 that is on the crowscrowscrows website.",
            "review_score": "1"
        },
        {
            "review_text": "This was a very enjoyable experience and I would highly recommend for those people that enjoyed Stanley Parable or quirky walking simulators in general. I would have liked to have seen more, but honestly the length of the game feels about right for the story that is told.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This was an interesting game. When I read the name of this amazing game I thought it would be about you trying to rob a vault. But I was suprised. I highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Funny! but sadly short. :(",
            "review_score": "1"
        },
        {
            "review_text": "Best Heist simulator I never played. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "The tiger eats me every time. Pretty funny anyway  + On point humor + Really nice voice acting + Well... it's free!  4/5",
            "review_score": "1"
        },
        {
            "review_text": "Great game, considering it doesn't seem to be finished yet. There were constant bugs, such as when the tiger began chasing me long after I did what I assumed to be the trigger for it. I could hear muffled footsteps and talking at the elevator area, like one of the guards had clipped through the wall, and the elevator wouldn't go up for about thirty seconds. None of these were necessarily game-breaking, though, mainly annoyances. Along with the elevator and the tiger, it seemed that every trigger was a bit delayed. Aside from all that, pretty solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Posibaly the best game i have ever play. It may be short but sweet. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "it is a funny short narrative walk simmulator with funny comments made by the narrator but getting some achievements are a bit tricky (besides the finish the game achievement) and also it only follows one story that cannot be altered by the you the player but still I recomend it for its dialoge and its fitting play time.",
            "review_score": "1"
        },
        {
            "review_text": "I love it.  C'mon. It's free. It's small. It's fast. It's funny. You have absolutley nothing to lose from playing this but a half-hour of your life, and while time is valuable, I found it to be a worthy investment.  Just watch out for the tiger!!",
            "review_score": "1"
        },
        {
            "review_text": "was a really fun game it reminded me of the stanley parable alot a shame some of the achievements are broken still but other than that i absolutely enjoyed it and the concept was interesting enough",
            "review_score": "1"
        },
        {
            "review_text": "Best 15 minutes of my life so far.",
            "review_score": "1"
        },
        {
            "review_text": "Only flaw : would have loved to play an hour version of this one.",
            "review_score": "1"
        },
        {
            "review_text": "Quick and quirky. A fun little game.",
            "review_score": "1"
        },
        {
            "review_text": "great game and very well hidd- you know what, I'm meant to write a review but I'm joining the strike team, have fun continuing this -Aiden-",
            "review_score": "1"
        },
        {
            "review_text": "Pure hilairity at its finest.",
            "review_score": "1"
        },
        {
            "review_text": "This game, (going to refer to it as that due to the lengthy title) is amazing. You wouldn't believe it to be possible for a small Indie Dev to pull off such an immersive action-packed stealth game. As said by others the AI of the guards is spectacular, meaning that you have to co-ordinate well-planned attacks to get into the building unnoticed. The fact that all of this is on top of a mountain with breath-taking views makes the game visually-stunning and emmersive. The real-time combat system and the open world destructable environment makes this nothing short of a skyrim with guns, in the future mixed with a James Bond film, with one scary tiger.",
            "review_score": "1"
        },
        {
            "review_text": "Heavily recommended--the vault cracking was some of the tensest crap I've ever seen!",
            "review_score": "1"
        },
        {
            "review_text": "Don't download this until it supports multiplayer and they fix up the crashes and bugs. I run this with an i7 and get no more than 20FPS, and that's if I'm lucky. Though the next-gen graphics sure are worth the wait!",
            "review_score": "1"
        },
        {
            "review_text": "  This game is quickly becoming one of my favorites. Still on the hunt for pretzels.",
            "review_score": "1"
        },
        {
            "review_text": "Well, so at the end I just couldn't stop laughing, that says enough I think...",
            "review_score": "1"
        },
        {
            "review_text": "  I love this game! The narrator's lines crack me up! my only complaint is the length.  Its too short!     Look money, brooms, desk lamps, and pretzels!  ",
            "review_score": "1"
        },
        {
            "review_text": "It's free. You should play it. It's great. I can't say anymore.",
            "review_score": "1"
        },
        {
            "review_text": "  this is a great game that is all i can say i dont want to spoil it",
            "review_score": "1"
        },
        {
            "review_text": "Heartily recommend. : )",
            "review_score": "1"
        },
        {
            "review_text": "  Justin Roiland Voice acting,,, and Developed by creator of Stanley Parable. oh my god.... and its free... Best day of my life. Small game, But totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "Awesome story line, amazing game! Though a little bit too short... 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Love these kinds of games, beautifull and a great story",
            "review_score": "1"
        },
        {
            "review_text": "I can't say anything without spoiling. Just play it, it's free! It's a great experience, 7/10!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic game, definitely keeps you on your toes. 5/5!",
            "review_score": "1"
        },
        {
            "review_text": "Short and hilarious. A must-play for anyone who liked the style of humor in The Stanley Parable.",
            "review_score": "1"
        },
        {
            "review_text": "there were tiger noises 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest Free to Play games that I've played in a while. The Crows Crows Crows team really pulled off an excellent heist game, absolutely stupendous. My only negative complaint is that the tiger sections were a bit too easy. I mean, it's bright orange for gods sake, I can see it coming from a mile away.",
            "review_score": "1"
        },
        {
            "review_text": "This game is free &amp; hilarious.     I totally love picking up phones and hanging up. :'&gt;  ",
            "review_score": "1"
        },
        {
            "review_text": "Is the voice from Soviet Womble? so hilarious",
            "review_score": "1"
        },
        {
            "review_text": "For a short, free game, this is great. It's funny and not too long, I really recommend you give it a try. Plus after you beat it, you can run through it again and there will be cassettes you can pick up that have Justin Roiland (of Rick and Morty fame) doing random bits and characters that are just hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "  It's kind of a shame that it's not the completely live experience it paints itself out to be, but at least I'm not getting eaten by a tiger.",
            "review_score": "1"
        },
        {
            "review_text": "a short narrative indie game. Try it, it's 'free'",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game I liked messing around with it and it reminds me of the Stanley Parable which is awesome in my opinion. I think that it should be more spontaneous like Stanley Parable and include more player story paths to divert from the main story. You kind of have to just play the game out and I would like to have an alternatve to that.",
            "review_score": "1"
        },
        {
            "review_text": "Short sweet and worth more than what the devs ask, brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "Very quick, very funny, and very worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, The graphics on the tiger are so realistic that it's unreal",
            "review_score": "1"
        },
        {
            "review_text": "Its a free laugh",
            "review_score": "1"
        },
        {
            "review_text": "A game where there are 2 players One of them is playing Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist. The other one is you.",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet :)",
            "review_score": "1"
        },
        {
            "review_text": "FInished it in 30 minutes. eh, its free anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game I love these types of games",
            "review_score": "1"
        },
        {
            "review_text": "The fourth wall has been broken into a million tiny pieces, and then each atom of those pieces was split into its constituent parts, and then everybody died because of the nuclear explosion that then commenced.  Needless to say, this short game was very fun to play, and 'Dr. Langeskov' itself was so amazingly disappointing that it was great.",
            "review_score": "1"
        },
        {
            "review_text": "A nice short game, the main source of entertainment is the 'Stage Manager' voiced by Simon Amstell. It reminds me of the beginning of Portal 2.  If you're aiming to collect all the acheivements, be careful as they de-activate if you press Shift + Tab. so load up a guide on another browser first, but it's just as fun to explore on your own.",
            "review_score": "1"
        },
        {
            "review_text": "Kids, let me tell you a story: Once upon a time, there was a 26 year old guy called Tony. Tony had been playing games since the early days of the PS1. The first game he ever played was Spyro. He loved it, and from there on, he became a made gamer, going from the PS1 to the PS2, to the PS3 to the PC. He started with the rig he is currently writing this review on: a Toshiba Sattelite. Call him a noob, a ♥♥♥♥♥, a ♥♥♥♥♥♥, a ♥♥♥♥♥♥♥♥, a ♥♥♥♥ dub, a ♥♥♥♥♥♥, a dumbass, an ♥♥♥♥♥♥♥, a ♥♥♥♥♥ucker, a ball-licker, WHATEVER. He prefers to call himself an inovator. He beat Sleeping Dogs, Fallout 3, Fallout: New Vegas, Westerado, and is yet to buy and play the hell out of Worms Clan Wars. Tony always had a softspot for F2P games, for them being, well...free, and because that allowed him to find good and stable games that he could enjoy, run, and play on an otherwise ♥♥♥♥♥♥ machine. One day, whilst browsing the 'Free Games' section on Steam, he found a game that was being praised like God on both the Steam forums and on YouTube: 'Dr. Langeskov, The Tiger, And The Terribly Cursed Emerald: a Whirlwind Heist' He played once for about 20 minutes, because that is actually howlong the game takes to beat, and he imagined there were other endings other than the one he got, therefore the Achievements he didn´t get and the descriptions for said achievements. Steal an orange from the orangery? I didn't even find an orangery! And I beat the damn thing! Either way, thanks for reading my LOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOONG review 'till the end and please, install this game, it's from the creator of the Stanley Parable for God's sake!",
            "review_score": "1"
        },
        {
            "review_text": "That was quite a fun game.",
            "review_score": "1"
        }
    ]
}