{
    "app_id": 409100,
    "name": "The Purring Quest",
    "release_date": "2015-11-12",
    "developer": [
        "Valhalla Cats"
    ],
    "publisher": [
        "Valhalla Cats"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Cats",
        "Indie",
        "Platformer"
    ],
    "achievements": 23,
    "positive_ratings": 883,
    "negative_ratings": 153,
    "price": 6.99,
    "description": "Have you ever wanted to be a cat? You will be able, thanks to the aventure platformer The Purring Quest. Take on the role of Kimchi the cat and meet famous cat of the internet in a journey full of humor.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/409100/header.jpg?t=1501688685",
    "minimum_requirements": "OS: Windows 7 Processor: Pentium(R) B960 2.2GHz, i3-2365M 1.4GHz Memory: 4 GB RAM Storage: 3 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I gave it a thumbs-up because I am really hesitant to thumbs-down a game that can easily be fixed with a few tweaks.  Pros: The game is done in a really nice aesthetic; I feel the graphics and sound are very nicely done. The theme is cool, and from what I've heard thusfar of the soundtrack, it is rather nicely done. Some cool mechanics (like hiding) etc are nice.  Cons: Game might be a little simplistic for some, but then it is a 2D sidescroller.  What needs fixed:  1). XPadder for some weird reason does not like this game. This is the only program that can tell XPadder is running. I have never seen any program or game be able to tell the difference between keyboard input and XPadder. I bound the Q button and the spacebar (attack and jump respectively) to different buttons on my joypad using XPadder (because the game ONLY allows 360 controllers). When I pressed the button for jump I'd sometimes jump, but sometimes attack. This obviously wasn't going to work, so I was forced into using WASD controls instead. (Side-scrolling on a 360 analog stick is a huge 'NOPE!'). Not sure what to suggest here, other than perhaps looking into enabling more controllers than just 360 controllers.  2). The first stage's boss's hitbox is really wonky. In fact, the character's attack hitbox seems a bit off. The first boss is very erratic, it seems to be entirely random if you hit the boss, or the boss hits you, or you trade hits. Given that he takes more than 6 hits to kill and you can only take 6 hits yourself... yeah, good luck with that. I think the best thing to do here, is to give the player character a slightly bigger hitbox with his attack. Also, it'd be nice if we could attack in mid-air, the first boss seems a bit frustrating when you spend most of the fight waiting for him to attack you (and you'll probably just get hit in mid-swing anyways, no matter when you time it). Also for some weird reason, the boss's hitbox seems to be 'off' too -- when he flies side-to-side, he was 'hitting' me even though he wasn't actually touching me.  3). Sound/Music FX sliders would have been nice in the first config dialogue popup before you actually get into the game. I have a strong pair of headphones, and most programs I need to turn the volume down considerably or I get my eardrums blown out. Being able to set volume levels before actually entering the game is a godsend, so it'd be really nice if you could include that.  ",
            "review_score": "1"
        },
        {
            "review_text": "Yes, I like this game. It's a simple and straightforward platformer, nothing really new. I only bought it because it's cute, totally worth it. Loved the music, too. Almost shed a tear while doing the piano playing part. Didn't encounter any bugs. Oh, and it's quite a short game, took me 3.8 hours to 100% which to me is a good thing, as I get bored of games easily. This one was perfect length.",
            "review_score": "1"
        },
        {
            "review_text": "The Purring Quest is a short, but sweet, platforming adventure game that really touched my heart. The premis of the game revolves around a kitty, Kimchi, who is in search of her human who has gone astray. During her adventure Kimchi runs into all sorts of obstacles and baddies while searching for lost kitties, collecting fishbones as well as other goodies. While the game is short -- about two hours to complete for myself -- it's definitely something I would replay just for the story itself. The only annoyance I had experienced with The Purring Quest was the atrocious control that made me feel like Kimchi was on roller skates, but I stuck it out and I'm glad I did. While playing this game I couldn't help but think about all the kitties I've had as a part of my life, how they've touched my heart and all the ones that are still out there who need homes that I wish I had room for. I'm grateful that the developer donates a portion of the game's proceeds to charity to help these innocent souls. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Very cute game and challenging! The keyboard controls are a little awkward, I recommend using a controller instead. Very fun game!",
            "review_score": "1"
        },
        {
            "review_text": "Cute side scroll game! Perfect for a hangover sunday.",
            "review_score": "1"
        },
        {
            "review_text": "Played with a ps4 controller, it was plug and go but read the keys as an xbox controller (or wii u? the a and b were switched from xbox). Some movements were a bit slippery but I figured that was part of the challenge. Pretty laid-back except for a couple of the bosses. Short but sweet, 3.7 hours to complete. (That rhymed!)",
            "review_score": "1"
        },
        {
            "review_text": "Love it. :)  I grew up playing 2D games, and loving cats so it was a no-brainer to try the game out. :D Plus, they donate a portion of the sales to cat rescues, so that's a plus.  The game is very nicely drawn and the music is so relaxing.  I completed the game at 100% (getting all the fishbones and completing each level) in about 5 hours. I went back and got any achievements that I missed afterwards. I guess I'd consider myself a pretty hardcore gamer, but even with a lot of gaming experience, the game was still a bit of a challenge, but not in a frustrating way. There were many ledges I'd miss, and the last level I can't count how many times I fell. xD I would have loved more levels where you're forced to go as fast as you can, while having to collect fishbones.  That was using the double jump. There are two jumps to choose from and if you want a challenge, I suggest picking the other. xD  I do plan to have another run through the game because I enjoyed it so much. :) Hope to see more from the creators!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just as cute and annoying as your average cat.   The animations are adorable and the levels offer a decent amount of variation, but the controls are pretty damn sluggy. Aren't cats supposed to be graceful? I'm giving this game a thumbs up for the cute idea and nice artwork, but if I had bought this game for the full price, I'd give it a thumbs down due to the fairly simple design.",
            "review_score": "1"
        },
        {
            "review_text": "I would consider myself a platformer junkie &amp; some of the platformers on Steam do smell like the inside of a litter box. This is NOT one of them. Great animations, great controls, and the titleis tough yet fair.   B++   Would like to see more from the dev.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this purely on my affection for cats and not on a whim. As a platformer it is very casual and it didn't give me many headaches in that respect and that is just fine with me. If your looking for a hardcore challenge then you need to look elsewhere.  Having said that, what you will find here is a sweet and charming game that has moments of beauty and humour that cat lovers will enjoy. The game is played out over five varied levels each with their own unique art style and challenges. I did struggle with the end of level 4 which has what I would call a Guitar-Cat-Hero type mini game. If you are into these types of games then you are in for a treat. If however like me you are purely inept at them, you will struggle. The dev kindly finished this for me and allowed me to carry on my way (he also gave me the OST which was a gracious gift so +rep for that one) to level 5. The soundtrack is also rather fitting and raises a smile while you bound along the levels in superbly animated fashion.  With hidden cats to find and fish to collect there is a little something in here for most cat lovers and casual platformers. My only gripe is that it is on the short side and only took me a few hours to finish, but then I did stop to look at the level detail and read the cat's monologues. A lot of work and affection has clearly gone into this title and I can only recommend it, and buying it supports animal charities - so do so.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me very aware of everyday cat struggles like dogs, pigeons, flower pots that drop down on your head for no f'ing reason, or being chased by helicopters. But you also get a little taste of the awesome things in a cat's life like pushing mugs from office desks....  Seriously, this game is kind of stupid, but who wouldn't want to be a cat? I'd rate it 3/5.",
            "review_score": "1"
        },
        {
            "review_text": "Super cute game, though several of the fishbones are nigh-invisible against the background and I had trouble with some of the jumps. Also a little hard to tell what areas are active places to stand, particularly in Level 5. Not too difficult to get all the achievements with a bit of patience, though!",
            "review_score": "1"
        },
        {
            "review_text": "I found this game when searching 'cat' in the store. I'd been wanting a cat-themed game with this level of cuteness. Even more, it has real-life famous cats! This game is a must-buy if you're a cat-lover like me. I might update this review when I've played more.",
            "review_score": "1"
        },
        {
            "review_text": "Fun overall game, would rate 200/200 green fish bones. Honestly its fun though, the controls are a bit interesting to get used to but it took me about an hour to beat the game and about another hour running through to collect. Fun game and I love the famous Felines though.",
            "review_score": "1"
        },
        {
            "review_text": "If you love cats this game is made for you! I love the graphical style and atmospheric music. Have only completed the Graveyard level so far, but it has been quite challenging. The game is a platformer at heart, so if you are used to platformers you will know the frustration you feel every time you misjudge a jump and the satisfaction when you finally get it right. The controls are ok, but if you are using the keyboard having to press 'S' and then 'Space' to high jump can be a bit fiddly at times. You will need patience to enjoy this game and if you don't enjoy platformers you migh want to stay away.   But as a cat platform game it is pretty good and I must say I am enjoying it so far. I like the main cat sprite and meeting the other cats is cool. Overall its a very polished looking game and I heartily recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A very short game, all said, I'm not sure it's worth the price.  Then I remember, cats. That's all you need to know.",
            "review_score": "1"
        },
        {
            "review_text": "  Watch out for the feels train.   The Purring Quest Punches you in the gut in the first minute like a Pixar movie.  Now I'm hooked needed to see where the story would take me.  ITS ALL CATS! CATS EVERYWHERE!  5 levels, tons of collectables. My kids love it.   Like Cats? heres your dream game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. The best i played",
            "review_score": "1"
        },
        {
            "review_text": "Will say i love it but the controls are so sensitive you pretty much die all the time so maybe fix that",
            "review_score": "1"
        },
        {
            "review_text": " SPOILER-FREE   I feel a little bad about it, but overall I must give a thumbs-down on this purchase.  It is cute. It has nostalgia and feels and cats. It has very nice music. (I  do  recommend buying the soundtrack.) And there are some puzzles that made it interesting.  The killer was the keyboard control. Other reviewers mentioned this issue, but it wasn't until I played the game myself that I understood how badly it affects the playing experience. It is way, way too sensitive! I couldn't even enjoy the ending of the game because I was too mad and frustrated and Not Feeling The Warm Fuzzies to appreciate the conclusion - in fact, I felt disgust that I persevered through the final level and all I got was, well,  that . If The City had been the first or second level, I would have been able to utilize Steam's refund policy and spared myself the angst. (Sorry, I know some proceeds go to animal foundations but geez!)  TL;DR - Good   Great atmospheric music - recommend buying soundtrack   Nice animation and art design   Interesting level design   Cats.  Bad   The Engrish. I've seen worse, and it's apparent to me that an attempt was made at good translation, but definitely needed more review.  Ugly   The horrible keyboard control / movement. I am not one for swearing, but the city level had me dropping F-bombs everywhere.    ",
            "review_score": "-1"
        },
        {
            "review_text": "Holy cat. I thought this was going to be an amazing cat-venture but it was just a total mess. The platforming style of this game makes me wanna shoot myself. The controls are stupid and the things that can kill you are dumb as hell. This game's really cute but it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "I will say that if you're picky about controls, this isn't the game for you. It feels slow and janky and you sometimes lose lives because of it.  Why do I recommend it then? It has a lot of charm and I had fun with it. I like collecting all the fish, I enjoy finding a cat in each level and there aren't a lot of enemies meaning most of the time the control problems are simply annoying instead of game breaking. Also the life system is remarkably generous (7 lives with infinite continues) and the checkpoints are frequent so dying isn't the biggest deal. The art style really appeals to me, it has that slight amateurish charm to me. It could use some polish but overall the aesthetic works for me. I like the puzzles so far, I've done three levels and I've never been stumped for a long time. I'm not a huge puzzle platformer fan so this is a plus in my opinion but I can see people finding it overly simplistic.  If there was a middle of the road option I would pick it since there are a million platformers with better controls but I love the cat theme and I enjoyed myself. I think that's enough for a recommendation. I don't think it's worth full price unless you really want to support the developer or something.",
            "review_score": "1"
        },
        {
            "review_text": "If you love cats you must play that game!   Pros: +Nice music +Short, but beautiful story +Funny interactions with other cats +You can hide in boxes  Cons: +I had problem with xbox controller when pressing forward and jumping at the same time, Kimichi (main cat) sometimes wasn't responding to it",
            "review_score": "1"
        },
        {
            "review_text": "i sucked so this game is bad",
            "review_score": "1"
        },
        {
            "review_text": "The game is a typical platformer with some interesting boss mechanics. The controls are not smooth enough so the must retry some levels over and over again. The cat movements ar well done and seem to be realistic (that's a giant plus) - and it's so cute! It's family friendly and I doubt anyone could hate it   (if you do, you are not a human)    8 freed kitties out of 10",
            "review_score": "1"
        }
    ]
}