{
    "app_id": 40970,
    "name": "Stronghold Crusader HD",
    "release_date": "2013-10-21",
    "developer": [
        "FireFly Studios"
    ],
    "publisher": [
        "FireFly Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Medieval",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 4079,
    "negative_ratings": 170,
    "price": 7.49,
    "description": "The highly anticipated sequel to the best-selling Stronghold, Stronghold Crusader HD throws you into historic battles and castle sieges from the Crusades with fiendish AI opponents, new units, 4 historical campaigns and over 100 unique skirmish missions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/40970/header.jpg?t=1548159838",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 with latest service packs Processor: Intel Pentium 4 1.6Ghz or equivalent Memory: 512 MB RAM Graphics: 64MB DirectX 8.1 Compatible DirectX: Version 8.1 Storage: 850 MB available space Sound Card: DirectX 8.1 Compatible Additional Notes: GameRanger software will be installed for mutiplayer matchmaking support",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've learned that people don't need food when they have enough beer",
            "review_score": "1"
        },
        {
            "review_text": "They dont make games like this anymore.",
            "review_score": "1"
        },
        {
            "review_text": " An old masterpiece came to Steam - in High Definition (or atleast high resolution...)",
            "review_score": "1"
        },
        {
            "review_text": "Start Game 'Wood Needed' 'Not enough wood m'lord' 'Wood Needed' 'Not enough wood m'lord' 'Wood Needed' 'Not enough wood m'lord' 10/10 would need wood again",
            "review_score": "1"
        },
        {
            "review_text": "Pure nostalgia 10/10 'Your food stocks are dwindling, my liege'",
            "review_score": "1"
        },
        {
            "review_text": "in time of war,, people dont need food,, they need beer...",
            "review_score": "1"
        },
        {
            "review_text": "What you will hear upon playing for the first time:  Can't place that there m'lord. Not enough wood m'lord. Wood needed. Wood stocks are too low, Sire. Stone needed. Wood needed. Stone stocks are too low, Sire. Wood needed. Not enough change in the treasury m'lord. Wood needed. Your popularity, is falling. Wood needed. You are the second greatest lord. Wood needed. We are under attack! Wood needed. 'My plans worked PERfectly! You are no MATCH for me.' Wood needed.  When you start out, you will be beaten by the easiest AI in the game most likely, The Rat. But once you get the hang of how to play, this game is full of strategy and fun.  Wood needed/10",
            "review_score": "1"
        },
        {
            "review_text": "'Retire my lord?' Me- Ok another game.(plays for 6 hrs)  100/10- IGN",
            "review_score": "1"
        },
        {
            "review_text": "Old 2D strategy games got better graphics than new 3D strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "If you buy this,you get the Extreme version too. It's worth it. Just buy at sale.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant classic, one of my all-time favorite games. I had the disc for years and played it so many times I don't think I could even count them. I was happy to support this fantastic game and buy it again on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "In my point of view, this game is still one of the best games at this category. A hard game, perfect for intelligent people.",
            "review_score": "1"
        },
        {
            "review_text": "Low taxes is good taxes that's my motto... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "After all those years Stronghold Crusader did not get old. It is entertaining as it was years ago and by getting HD version it looks better on modern PC screens.  The most important things I'd like to recommend are: balanced gameplay; interesting and long single player campaign; multiplayer mode; good AI of enemies controlled by computer; great soundtrack; oldschool (but in a positive way!) graphic; user-friendly mechanics. It also runs smooth. I know the game's old, but I remember it was good optimized years ago and now, on modern computers, it still runs well.  What else to say? This game is a game of a high quality, definitely. If you haven't played it yet then you should, because Stronghold Crusader is truly one of the best RTS games ever made (at least in my oppinion).",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Needs a lot of training to learn. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "I felt the power",
            "review_score": "1"
        },
        {
            "review_text": "14 years old game but still fun to play",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite Stronghold game by far. I've played Extreme and Stronghold 3 along with this one, and this game is the perfect balance between difficulty and freedom. It takes a little while to get the hold of it but once you've mastered your kingdom's economics and tactical warfare, it's an excellent strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "My first stronghold is a minigame that came along with a game magazine that you controls three arrowmen to fight incoming enemies. Your last resort is a engineer pouring down oil that kills most of enemies down stairs.  The minigame acts like a trailer to the upcoming game that brought to my attention, the Stronghold game.  It was my eight year old I believe. And it has been over twenty years passed, and now I have repurchased this game on steam.   What a great childhood memory, and what a game when I could play both as a child and as an adult. xD  Cannot say too much. Rating 10/10.  P.S. Do not play stronghold 3 as it is nothing comparing to the first one. I haven't played the second one so I will not comment. But the third one is nothing, literally nothing comparing to the first one. I have to repeat myself.   Overall, enjoy the game guys, and definitely you shall buy it on this week sale. :)",
            "review_score": "1"
        },
        {
            "review_text": "It's my first and last strategy game. My childhood. 10/10  P.S: Wood needed. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, Just Amazing, if you like building fortresses this is a game for you",
            "review_score": "1"
        },
        {
            "review_text": "Although, I haven't played this through Steam yet, this game is the greatest Medieval RTS game that there is. Besides the out dated graphics - if you're a veteran RTS player, you have probably played worse - this game is fantastic.  This game was the first video game I really got into on the PC. I played countless hours, and if I had to make a guess, I'd say well over 2000+. Since September 2004, this game has stayed within my top 5 because it is simply just that good.  I always find myself coming back to this game, year after year, never being dissapointed in the challenge that the computer opponents offer. When I played this game day in day out and finally mastered it, I could beat all 7 wolves on a team on my own. Now I don't play this game as much, but I still find myself going back to it, whenever a friend wants to play.    Lets talk about what the game has to offer and compare to other games in it's series",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Stronghold games",
            "review_score": "1"
        },
        {
            "review_text": "Awesome castle sim, has some chelenging levels that when you get past them you are more proud of yourself than you will ever be. EVERYONE NEEDS THIS GAME!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A classic I loved to play as a kid along with the original. Don't let play hours fool you, I've played the cd version on and off since I first picked it up with my dad at EB games! (yup that long ago, EB games!!) A great and worthy sequel to the orginal!  Pros -More awesome voiceovers, in arabic this time! -Good graphics for its time -Skirmish mode addon -New characters -Multiple campaigns -Arabic units -Desert theme -Same old game we love, they didn't ruin it, they didn't fix it either becase they didn't need to, it was perfect in its orignal release! -Historical missions  Cons -The campaigns are less personal than the orginal, no big story that is, hearing the villians plot their schemes, or fireplace cutscenes, just some back story on the time and event and a massive campaign that is a string of skirmish missions put together, its still fun to beat though!  Overall A game that has and will stand the test. Definitely better than the awful Strongholds 2 and 3. Firefly seriously just needs to go back to its roots and expand upon this game within the 3d engine, not change everything, and have better quality control! I digress, get the original for its amazing story, and get this for its awesome skirmish mode!  10/10 Classic Castle Building Sim",
            "review_score": "1"
        },
        {
            "review_text": "My childhood game i love it",
            "review_score": "1"
        },
        {
            "review_text": "We'll be...invincible.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a sky (no pun) view game where you build castles to defend/attack against either A.I.'s or other players. Team up with friends, fight against them, team with AI, or fight them This game for me is really fun I love these types of games!! Keep track of your popularity your food your men and their happiness..!",
            "review_score": "1"
        },
        {
            "review_text": "When it comes to gameplay, this is the best strategy game I have ever played. The economic system is brilliant, it is very realistic but at the same time simple and easy to understand. The castle and warfare mechanics are brilliant. There are numerous ways to build your castle and defend it, and a variety of options to defeat your enemies. While most strategy games tend to require the same tactics with just slight differences, this game takes strategical thinking to a whole new level.  In fact, a game of SC is not that different from a game of chess.   When it comes to graphics, of course, this is an old game.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game! I have spent lots of hours behind the monitor playing it and when it came out in steam i was like 'Yep, i will buy it again'   10/10 Experience Buy this game - really worth your money :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest RTS games by Firefly. Played SHC for countless hours before buying for myself on Steam. Would recommended to anyone who enjoys an RTS and the Medieval era.",
            "review_score": "1"
        },
        {
            "review_text": "Love it! Been playing it for years!",
            "review_score": "1"
        },
        {
            "review_text": "Wood needed. ",
            "review_score": "1"
        },
        {
            "review_text": "A great classic made even better in HD.",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold...",
            "review_score": "1"
        },
        {
            "review_text": "One of the most criminally underrated RTS games of all time. Also the best game in the Stronghold franchise in my opinion, way better than any of the garbage newer games Firefly has released.",
            "review_score": "1"
        },
        {
            "review_text": "That's my personal best stronghold of the series. It has everything and it's on the right place. I'm pretty sure in the future, I will playing it again. Only a few games can achieve that. Well done devs!",
            "review_score": "1"
        },
        {
            "review_text": "This is Stronghold Crusader 2. There is no other Stronghold Crusader 2.",
            "review_score": "1"
        },
        {
            "review_text": "Ahhhhh It vary vary good good Game ever . I have play this game At 10 years ago and now I can't stop playing this game . ",
            "review_score": "1"
        },
        {
            "review_text": "Food, food ,food...I'm putting on so much weight.",
            "review_score": "1"
        },
        {
            "review_text": "The good old classic with new multiplayer support. If you liked the original back in the days you are probably going to like this game to. It has'nt really changed and I did not encounter  a bug that was not also in the original title yet.   If your're not into this series or old RTS games in general you should not touch this. If you are: 100% recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "This game take me back quite a ways. I always played it on my fathers computer having the best of times, this was the very first stretegy game I played on the PC and I adored it. Every time I launch this game I get a nastolgic eel of being back in 2006 of fall, impatiants growing as I make my way home! Would definitely recommend this game to people whom that enjoy strategy! Juts not Stringholds 2 or strongholds 3.",
            "review_score": "1"
        },
        {
            "review_text": "Its a funny Game to play with Friends or Alone. It brings fun for a few Hours and make still fun. Sadly there is sometimes a Problem when Starting under Windows 7, simply reinstall the Visual C++ redis. which is installed from Sronghold.  How many Hours of Fun did i have: Over 50 Hours for the Singelplayer and over 100 Hours in Multiplayer Reccomend: Yes, totally for that Price  Addition: Dont use the 'HD Patch' Available. It look really bad, cause its simply the old Grafics on 1920*1080",
            "review_score": "1"
        },
        {
            "review_text": "its a shame the RTS industry is dieing out because i love games where i am in total control",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the best part of this game is the character Nazir because even if hes on your team all he calls you is INFIDEL, imagine that in some high pitched squeal and you got Nazir",
            "review_score": "1"
        },
        {
            "review_text": "  Amezing game i used to play this all the time ! if you have not already plz go buy it it is so worth it",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "The best strategy game of all times! You must try. The one and only.",
            "review_score": "1"
        },
        {
            "review_text": "Really high quality and peaceful game. 10/15",
            "review_score": "1"
        },
        {
            "review_text": "  .",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my all time favorites. The music was so well made and beautiful that have them in my song library. I have 200+ hours in this one and its not just because im a die-hard fan (though i am), there are 95+ missions in game with a good amount of AI with varying difficulty. Also includes a map editor for you to make your own maps and seige missions. If new to stronghold, it has a realistic economic system for your castle to thrive (ex.- need crossbow men? frist you need a cow farm, then a tanner who takes the cows for the hide armor, then you need the crossbow its self to be made from a flecher and both craftables placed in the armory). This game is an absolute gem. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "top ",
            "review_score": "1"
        },
        {
            "review_text": "SZTOSIK GIERKA POLECAM 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The screen is flickering and flashing the background and desktop constantly, making the game not enjoyable.  Get it only if you really want to play, I do not recommend it otherwise.",
            "review_score": "-1"
        },
        {
            "review_text": "Could play at frist,  Now can't even connect using TCP.",
            "review_score": "-1"
        },
        {
            "review_text": "Severly disapointed by the fact that this game doesn't work. This was one of my favorite as a kid and i can't relive those memories now because the game fails to open properly.",
            "review_score": "-1"
        },
        {
            "review_text": "When I purchased Stronghold HD, Stronghold Crusader HD came bundled with it and since I loved the original (my review of Stronghold HD can be found  here ), I had high hopes of it. The original was a great and unique combination of a castle/city builder and siege-simulator and this game is no different, basically the same game all over again, except that it's not that great anymore. The game feels like an expansion to the original game and not a sequel, mostly because it uses shamelessly everything from Stronghold HD, which wouldn't necessarily be a problem, but it  remains inferior to the original in almost every aspect .   The milieu is the (not so) vast deserts of the Middle East in the Holy Land mostly during the Third Crusade. The so called historical campaigns are separated from each other and seem rather inconsistent, so there's hardly a plot which makes the single player game unsatisfying. The skirmish missions are even less entertaining, so those don't help the game either. There's also an expansion called Stronghold Crusader Extreme HD, which is super disappointing and all it does that it allows the player to set custom games (which we can do in the main game as well) under extreme conditions and fight multiple opponents at the same time who tend to start with more resources than us... I managed to beat 2 at the same time, but it was a very poor experience, reminding me of old-school 'real-time strategy' games that functioned like meat grinders, where you train more and more troops and just unleash them on your enemies. Some 'strategy'...  The main difference between the original game and this one is mainly the environment: instead of the beautiful English forestry, we get to play in deserts. It makes the game harder because now anything can catch fire and that introduces the only (!) new building (the other new one is basically a tent): the well. Yes, we can only put out the randomly appearing fires using wells (or instead of several small ones just one big well). Of course the wells also require workforce, so it is vital to have a few extra peasants. Naturally wells can't prevent the occurrence of fires, so the building on fire is going to take damage and if it's the armoury full of weapons... well, we're in trouble. The other factor is the oasis, which is the only suitable area we can build food production buildings on and needless to say, their size is quite limited. At least the oasis makes the game harder in a good way (requiring careful planning), as opposed to the random fire occurrences.  In a few missions we can play the Muslim side, but these are commando missions (can't train units, have to make do with the given ones) only, so we can forget about larger sieges, the main strength of Stronghold. Of course there is sense in the Muslims having no buildings: they should look different than the ones the crusaders have... By the way the crusaders do have Middle-Eastern looking buildings which is a bit strange, but at this point it's really just one of the smaller problems.  There are Arabian soldiers, mercenaries we can hire from the previously mentioned tents, for gold (instead of resources). This is an interesting formula as it can speed up the process of training quite a bit, but again, it can turn the game into grindfests at the expense of sieges. The new soldiers are fun (the slingers are fast and cheap but are weak and can attack at short range, the horse archers have great range and are very fast, but expensive and not as accurate as the normal archers), but they are mostly reused versions of the already existing units with readjusted strengths, except slaves (super cheap and weak units who can set buildings on fire) and the assassins (can climb walls and open castle gates). The assassin does have potential and can make a siege more interesting and a bit easier for the attacker. There's also a new fire ballista, a perfect tool for decimating defending archers on towers and it's also a welcome addtion to the attacking side.  Some issues that were in the original are also present here: the transparency of the buildings is still a problem when rotating the map and trying to rebuild certain sections of the castle wall and the lack of hotkeys is fatal in the fast paced matches when trying to vanquish multiple opponents. The voices of the peasants are still provided by the same person, which was fun at frist, in Stronghold HD, but this time it's obviously budget related.  Stronghold Crusader HD is obviously a letdown, not mainly because it feels like an expansion, but because it seems like a rather cheap duplicate of the great original. The new setting with all its accessories is a setback and the developer must have also felt the absence of the evil characters of the first game, because in the last mission we can meet them again (don't ask). Accordingly I can't recommend Stronghold Crusader HD to anyone: not to newcomers and especially not to fans of the original. If you want to experience a good siege just load up Stronghold HD again.   PROS + some useful additions and readjustments to the game + last mission is challenging  CONS - less emphasis on castle sieges - issues from the original are still present - campaign is not as enjoyable as the one in the original - feels like an expansion rather than a sequel - cheap ways to make the game harder  RATING 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "The Mouse is ♥♥♥♥♥♥♥♥... When my Mouse is over something it shows in the game that it hovers over something else. Way to ruin the Good game.",
            "review_score": "-1"
        },
        {
            "review_text": "unfortunitly i dont know why but i love all the other Stronghold games but this one wont seem to run i downloaded and it added a program then launches but crashs and gives no error code so im going to have to say dislike as much as it pains meto do.",
            "review_score": "-1"
        },
        {
            "review_text": "Cant place that there my lord",
            "review_score": "-1"
        },
        {
            "review_text": "Stronghold Crusader is a somewhat obscure RTS designed around maintaining an efficient economy while also defeating an opponent in the traditional RTS sense. Peasants are the lifeblood of your castle as you struggle to feed them, keep them happy, and tax every last cent out of them in order to turn them into soldiers.   As the page says, it is a castle simulator, meaning you run a castle economy, can build castle walls in designs that are only limited by the imagination, and lay siege to your opponent's castles with trebuchets, rams, ballista, and catapults (and more).  The skirmish mode, map editor and Crusader Trail (50+ skirmish scenarios) highly enhance the replayability of this game. The AI comes in many flavors from the annoying and vindictive Caliph, to the overwhelming force of the combat loving Lionheart, or the 'Zerg Rush' of the Abbot and his massed monks. Each AI adds a different level of challenge, and learning to take them all on is quite fun.  Despite being an older game, multiplayer can be accomplished with a tool such as Gameranger, and the multiplayer works quite well.   Overall I highly suggest any RTS lover to pick up Stronghold Crusader HD, it is quite a fun experience that no current game quite manages to capture.  11/10 'Not too much water' -IGN",
            "review_score": "1"
        },
        {
            "review_text": "I've never played a game so fun in my life!",
            "review_score": "1"
        },
        {
            "review_text": "why wont this game work for me?",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time not too complicated, but still super fun AI are a bit dumb though, can easily crush 7 v 1 Lionhearts",
            "review_score": "1"
        },
        {
            "review_text": "I tried to run it on my pc soo many times before, and now it is on steam in HD, great game:D",
            "review_score": "1"
        },
        {
            "review_text": "Fun, even after all these years. Stronghold Crusafer might be the best in the series imo. It's well balanced and provides a lot of fun. The Scenario Builder is of particular fun for me. It's strange there haven't been more castle builders as technology has progressed.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Ah, Stronghold Crusader. I remember this game when I was maybe......6? This game really brings back memories with the floppy disk games. Anyway lets review! Note: Buying the game will also include Stronghold Crusader Extreme but that is so terrible so I wont review it.  THE GAME Stronghold Crusader HD is a castle sim with I think 4 modes. Career/Story: Really just a set of tutorials and starting battles to get you ready to play the all grand skirmish mode(I think thats what its called) but never the less it can be fun but only sometimes.  Skirmish/Battle: This is probably what makes this game grand. It puts you in a screen where you decide things like the map, how many players fight, where they fight, difficulty, starting money, etc. Then you start building a castle and an army to help you crush the other players while not getting recked yourself. THIS IS WHAT YOU GET THE GAME FOR. I bet it would be fun in MP but none of my friends have it :(  Castle Builder- Just the mode if you want to build a huge castle, no enemies just you, your people, and that annoying flippin guide. (WHY?)  Multiplayer- If someone wants to add me to play this mode please do ;_;  AUDIO The game has solid voice acting from every character and they talk to you at the right times sometimes indicating how you should prepare, like telling you 'youre kingdom will get crushed' could indicating that they're lanuching an assault at you. The fighting audio is good but the people getting hit by arrows sounds like there coughing and screaming. Your castle based on how many people actually work it gets more or less chattery and theres less sounds of nature. The only REALLY bad voice acting is your guide, he doesnt change his accent when you change to like a british guy and his voice is just annoying but funny to abuse sometimes. Audio-8/10  GAMEPLAY Well as I explained in the modes section you are usually fighting other players, but most of the time youre trying to get people in your kingdom and keep them in your kingdom by maintaning food, taxes, and atractions for your people (like a dancing bear strapped to a pole wtf). Gameplay 9/10  STORYLINE I really dont think i should rate this but I will. The game yes has a story mode but it's mostly a tutorial with basic battles. The games story really comes mostly from the gameplay. Think of games like dota 2, CSGO, and TF2 mostly the story comes out of what you do and see, not whats told. Storyline 7/10  Graphics The graphics would obvioulsy be outdated for a game as old as this but you can see whats going on and not feel like you cant see what that means or indicates. Pretty solid graphics if you look at its age. Im gonna count the score as if I was rating this in the year this was released. Graphics 10/10  AI  Since this is what most people have to play with ill make a section for it. As I stated in audio the AI will give you hints about whats about to happen but it might not always happen, making them pretty clever enemies. Each king has a different tactic. Some build the castle a lot others go and start buiding an army, and some also try to build up they're economy so they could buy troops late game. But each kind changes his tactic depending on what he sees so the AI is different every time. It could use polishing sometimes though. AI 9/10  REPLAYABILITY As I just said the AI's tactic always changes so you never have the same game twice. Also there are TONS of different maps. By tons I mean like 30 maps each ranging on how many maximum players there can be and I think you are able to get more maps (IDK though). Replayability 10/10  VERDICT Stronghold Crusader's 10$ price tag is well worth it for such and old and polished game like this. FINAL RATING: 8.6/10    ",
            "review_score": "1"
        },
        {
            "review_text": "No one will ever create such a great game as Stronghold Crusader.",
            "review_score": "1"
        },
        {
            "review_text": "Just getting back into some IMO classics...  This is one of the best out of them all.  stronghold 2 is imo the best.",
            "review_score": "1"
        },
        {
            "review_text": "20/10  More Wood is needed.",
            "review_score": "1"
        },
        {
            "review_text": " Pros:  -Stronghold perfected -In depth economic system -Rebalanced religion and ale mechanics (religion is no longer wildly overpriced for the benefit given) -Multitudes of new units, including arabic units that need only gold, and monks that can be trained at the cathedral -Wide variety of maps and play scenarios -Challenging, fun campaign mode -Computer opponents are widely varied, memorable, and fun to fight -Active online community -Massive replayability   Cons:  -No plot; campaign is just premade skirmishes -No fast-forward option   Overall:  This is it. This is the best stronghold game. Everything after, while sometimes good, failed to measure up. And Stronghold 1, while perfectly fine, didn't have the added depth this game has. While this game lacks a proper story mode, it focuses on what there really is to love about this game - the gameplay. There's a main campaign which consists of 50 skirmish matches against progressively harder scenarios, and another 20 in the 'expansion' that comes included with the HD version.  There are a multitude of different computer opponents to fight as well, and they can range from comically inept to frighteningly capable. Maps have a wide range of setups, from the vanilla 'everyone starts with the same basic setup and resources' to the maps which have no farmable land, to the maps that give one player every resource and all the others very few at all. The game is fun, and there are so many different ways to play that it will continue to challenge and entertain you.  One of the only real downsides is that there are still times when you watch and wait as your economy chugs along and your opponent builds his army, and there's just nothing for you to do but wait. Firefly did a good job of reducing that so it isn't as stark and noticeable as it was in Stronghold 1, but it still happens. A fast forward option would have been nice. Even more so if you like using swordsmen in sieges - you will legit wait five to ten minutes for them to get from your stronghold to the other guy's stronghold. Still, this is a very minor complaint in an otherwise flawless game.  There's a strong online community creating more maps and scenarios that can be downloaded and played. The addition of the arabic units with all their unique traits gives Crusader even more depth than before, and really just rounds out an already fantastic game. This is one of those games I've kept coming back to over the years, and probably will continue to do so for another decade.   Bottom Line:  Absolute recommend",
            "review_score": "1"
        },
        {
            "review_text": "bring's back my childhood memories,good castle sim game spending most of my life in the game(in original game backthen).   more wood needed my lord...10/10",
            "review_score": "1"
        },
        {
            "review_text": "This and Stronghold HD are the best two Stronghold games ever. Stronghold 2 was enjoyable but you can't find it on store for some reason Stronghold 3 was a 5% finished game with large potential thrown into the shop.  Campaign is challanging even on easy at some points. Great managment systems, nothing too complicated but still can get complex. Game of my childhood, still as good as i remember it",
            "review_score": "1"
        },
        {
            "review_text": "I can not save the game  Please help me (",
            "review_score": "1"
        },
        {
            "review_text": "Wood needed. Stone stocks are too low, sire. Not enough gold, m'lord. Can't place that there, m'lord.   10/10 would build a market again",
            "review_score": "1"
        },
        {
            "review_text": "Simply put...this is one of the best strategy games I have ever played. It easily surpasses any other game in Stronghold series.",
            "review_score": "1"
        },
        {
            "review_text": "from my favorite strategy games and i can understand the arabic talk When it gave the orders  And i like the music in the background and i like many things in this game &lt;3 i give it 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Old but need more gold!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. From being able to Build, form armys, destroying others in skirmish, campain, and More. this strategy game suits all my needs, even the Map Builder, if you like games like this, I truly Reccomend you get this. Thanks for reading.",
            "review_score": "1"
        },
        {
            "review_text": "A true classic and a must have RTS. Brings me some memory back. Graphics are good, but there are many to fix. UI can be improved maybe changed now that we have bigger resolutions available. Overall it's a good deal under 5$, but I hope this game will keep receiving more updates.   By the way I haven't tried multiplayer ...",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game but mission impossible to play co-op",
            "review_score": "1"
        },
        {
            "review_text": "One of my all-time best strategy game.  This is my childhood in a nutshell  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good and well made RTS game. Lots of variation in levels and lots of different options and playing styles. Would recomment and can take up hours of your time!",
            "review_score": "1"
        },
        {
            "review_text": "classic game!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It feels like a more in-depth version of Age of Empires. Crusader is better as you have to deal with the popularity and the taxes. But I will be making videos on this game for my Youtube Channel. Be sure to check out my Channel: LBH Productions. Hope to game with you all sometime. Who knows you may even be in a video one day.",
            "review_score": "1"
        },
        {
            "review_text": "Of all the stronghold titles I found this to be my favourite and probably the easiest to get into. I could never really bond with the other titles like I do with this one. Its great seeing it in HD. You also have the option of installing the extreme version which will literally let you have thousands of units on the battlefield as opposed to hundreds with the standard edition. There is tons to keep you occupied in this game from historial campaigns to your own customised game setup. It may look a bit dated now but it runs like silk on todays modern computers. Definetly one for medieval RTS fans.",
            "review_score": "1"
        },
        {
            "review_text": "This is more of a notes review for those who have played RTS games and enjoy them, on the more prominent differences A special RTS this and the series are. Buildings and Units are made instantly, but resources take time to come in. If you come from AoE series or similar then you may have a hard time grasping it initially. There is a pop limit, but not one so to speak, its not a worry at all. You don't create villagers, you have peasants, and you have a popularity to maintain and which can be influenced positively and negatively by a variety of things. Resources are based on a chain, both individually and overall. Eg Wheat Farms take time to plant the wheat, grow it, and harvest it. THats and individual production. Then the wheat must go through a Mill and a Bakery, then to the Granary for the bread to be used. I automatically think the Anno series if i would compare the economic chain too. THe amount of resource income you have is totally dependent on how much resources there are and how wisely you use the space. No assigning 20 villagers to 1 stone deposit. More like 10 Quarries which take 3 peasants each to run. Stronghold Crusader is known mostly for its 50 mission Skirmish Trail, with just a Campaign based on historic events as more of a bonus feature. And another 20-30 Skirmishes in the Warchest. I for one love this, as SHC is just made for deathmatches of all sorts. Theres a couple hand fulls of opponents, each with a personality, castle build, unit selection, all which creates their difficulty. There is no selective difficulty. Note that the game and opponents is relatively easy, its the context in which you play that gives mission difficulty, as you will find out playing the Skirmish Trail.  It really is a fun game and one you will remember. It has a special place in my heart.  Remember there is also websites and YT channels and videos (im slowly working on some myself) with walkthroughs and mission help, as quite often people need it!  Worth $15, and on sale, an absolute steal.",
            "review_score": "1"
        },
        {
            "review_text": "It's about as fun as I remember it in my childhood.",
            "review_score": "1"
        },
        {
            "review_text": "No stronghold has been the same since the release of this game. Even years later this game still feels fresh to me. This game has a very dear place in my heart as I remember spending literally hundreds of hours playing this game in my youth (Like seriously I've probably put 500+ hours into this game back in the day).   The mechanics are simple but man does building an awesome castle addicting (build a ♥♥♥♥♥ castle if you want w/e works, works). This is a classic and no stronghold game will ever be as fun as this.",
            "review_score": "1"
        },
        {
            "review_text": "A classic that's still able to amaze.... and you're still able to play multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "it's like Crusader kings but without the gay incest",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. I've played since it came out and have always been so intrigued by this game.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia is overwhelming on this one ;&gt;)",
            "review_score": "1"
        },
        {
            "review_text": "If you are a stratagey person like me, you will love this game. Stronghold Crusader HD is the best stratagy game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!!! I received a previous copy of the original Stronghold Crusader a few years ago and bought hte HD version a month ago. No regrets what so ever!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "One of my all-time favourites.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the first pc games ive ever played and it still is fun today. This game made me fall in love with the rts genre.",
            "review_score": "1"
        },
        {
            "review_text": "This game is perhaps overlooked by most people these days, considering there are others out there, like StarCraft, Age of Empires, Civilization, and plenty of lesser known RTS games.  Yet, this game has a certain charm to it that I think can't be found anywhere else. It's set in the Arabic desert, where you must fight for survival by mastering as many factors as you can, including some staple RTS features, like economics, resources, troops, and workers. This game also features two main ways to determine whether you succeed or not. This comes in the form of managing how much gold you have to buy troops, and how much food you have collected. Running out of food will cause your castle to start losing happiness, and people will begin to leave if it gets below halfway.  Since the food plays a major role in your economy, lacking it presents a severe problem of unbalanced gameplay; people won't be able to keep your economy going if they leave, which means that, if you don't have enough gold to buy food, you're basically doomed. You can't buy troops since you don't have gold, and if, by some chance, you happen to be out of other supplies, it's best to give up if you don't have any allies. Even then, the allies aren't guaranteed to help you, especially if they're A.I players.  This is where the unbalanced issue comes into place, because not everyone is good at managing their economy, and pitting people with little to no sense of economics against people who do know means that the latter are going to win. Every single time.   This is still a great game, though. If you are willing to learn how to manage economics, I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, i remember playing this game when i was 9years old on my old dinosaur PC :D. Very good game after all!",
            "review_score": "1"
        },
        {
            "review_text": "old but still a great and challenging game",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing it since 2003 and I still enjoy it! One of the best stategic games of all times ",
            "review_score": "1"
        },
        {
            "review_text": "This game is my very dear memory of my childhood, its fast and interesting at the same time. I would like that there is more games like this today,",
            "review_score": "1"
        },
        {
            "review_text": "Was thinking which game to nominate for the 'Best use of a farm animal', then I remembered the cow catapults. Cowtapults. Shame the damn thing doesn't work on my Win 10.",
            "review_score": "1"
        },
        {
            "review_text": "Wood needed!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite strategy game from my childhood 9/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game of my childhood :P",
            "review_score": "1"
        },
        {
            "review_text": "Stronghold Crusader is a must for strategy gamers and city builders out there.  I recommend buying this before you buy all the other titles that came after this particular Stronghold game. This one is the best, in my opinion, in the series.  The only problem is the multiplayer. For some reason it has always been very bad. It is lags from time to time, or just stops completely. Playing in singleplayer mode is worth it though, you get so much satisfaction when you finished the campaigns!  They have tried to resurrect the feeling the players got and get when playing this game with Stronghold Crusader 2, but they failed horribly. (Again, in my opinion.) This one stays the best.",
            "review_score": "1"
        }
    ]
}