{
    "app_id": 40980,
    "name": "Stronghold Legends: Steam Edition",
    "release_date": "2016-09-15",
    "developer": [
        "FireFly Studios"
    ],
    "publisher": [
        "FireFly Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Medieval"
    ],
    "achievements": 60,
    "positive_ratings": 404,
    "negative_ratings": 123,
    "price": 11.99,
    "description": "Catapult werewolves over castle walls, incinerate troops with dragon fire and command the Knights of the Round Table! This remaster of the mythical ‘castle sim’ features Steam multiplayer, Workshop support, new maps, achievements and DLC campaigns.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/40980/header.jpg?t=1548158909",
    "minimum_requirements": "OS: Windows XP/Vista/7/8/10 Processor: 1.6 GHz Equivalent Intel or AMD Processor Memory: 1 GB RAM Graphics: 256 MB Video Card DirectX: Version 9.0c Storage: 3 GB available space Sound Card:",
    "recommended_requirements": "OS: Windows XP/Vista/7/8/10 Processor: 2.3 GHz Equivalent Intel or AMD Processor Memory: 2 GB RAM Graphics: 512 MB Video Card DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card:",
    "reviews": [
        {
            "review_text": "  So if Steam logged all the time I had playing this game on the Disc, I would legit have over a couple thousand hours. This game was my childhood, and a few years ago I convinced my friends to play the multiplayer with me. Once we were finally all into it and knew the mechanics, they closed the multiplayer servers not two months later. Devestated, I still played through all the single player modes, but I did so long for the multiplayer back. But, Steam delivered, and upgraded the game to the Steam edition, reviving the community for the game and allowing us to play multiplayer again (While adding a few new cool features! Workshop is so nice). While my friends and I (Sadly) don't play this game as much currently, as League of Legends has consumed our lives, whenever we get bored, or when I'm feeling in a particularly mediaval mood, this is always the first game I turn to, as every time I play it I am filled with that sense of nastolgia, and am able to relax to the nice sounds of my catapults tearing down my enemy's walls.",
            "review_score": "1"
        },
        {
            "review_text": "The best decision ever, a warm thank you from a fan. 2 thumbs up from me :D",
            "review_score": "1"
        },
        {
            "review_text": "I missed this game so much, I used to play it all the time when I was 8. Thank god it's back and working!",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold. The best strategy game i ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "  About Stronghold Legends: Steam Edition",
            "review_score": "1"
        },
        {
            "review_text": "Nice refresh for this game... i was looking for the disc and couldnt find it so when i saw this i saved my money for once and thank gosh that i did",
            "review_score": "1"
        },
        {
            "review_text": "Nice Mytologic Game All of Time",
            "review_score": "1"
        },
        {
            "review_text": "i do not like this game but i think that you should get it if you like RTS games i don't really suggest  its kinda in the middle you know i suggest it and don't get it if you want i don't care",
            "review_score": "-1"
        },
        {
            "review_text": "A truly poor excuse for a Stronghold game.",
            "review_score": "-1"
        }
    ]
}