{
    "app_id": 409920,
    "name": "Brilliant Shadows - Part One of the Book of Gray Magic",
    "release_date": "2015-11-02",
    "developer": [
        "Ithaqua Labs"
    ],
    "publisher": [
        "Ithaqua Labs"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Simulation"
    ],
    "tags": [
        "Adventure",
        "Visual Novel",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 163,
    "negative_ratings": 10,
    "price": 4.99,
    "description": "Brilliant Shadows is a visual novel that follows the story of Veronica Ashmar, a new graduate of the Mountain and a necromancer. Tradition dictates that upon graduation, necromancers and paladins are to perform the pairing ritual.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/409920/header.jpg?t=1518550300",
    "minimum_requirements": "OS: Windows Vista / 7 / 8 / 10 Processor: 1.5Ghz Processor or better Memory: 1 GB RAM Graphics: Integrated Graphics Chip Storage: 400 MB available space",
    "recommended_requirements": "OS: Windows Vista / 7 / 8 / 10 Processor: Pentium 4 or better Memory: 2 GB RAM Graphics: Integrated Graphics Chip Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I'm gushing about this game. I just found it yesterday through Dodger on YT and had to rush to buy it. The diverse races and sexual orientations for its characters set this apart from a lot of other games. Ash, Prude, and the gang all feel very real and the voice acting cast is really good too. I'm finding myself craving another chapter and look forward to supporting this game in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Refreshing, unique, and captivating.  A little background about myself - I'm not a big visual novel 'buff', the most experience I have in such games would be the Phoenix Wright games on handheld, but after watching a youtube video of the game, I was immediately drawn to the story presented, and after doing a little bit more research, promptly purchased the title and completed my own playthrough several times to get the different endings, and little changes in plot based on choices.  Given that I've just explained I'm not big into visual novels as a gamer, I still enjoy a good story, and this title definitely has a good story. Presenting a very different world from the norm in most media, with Necromancy not necessarily being evil but instead another school of magic that's balanced out by Light magic, the game does a good job presenting the basic principles of the world at a good pace, and the player also gets the opportunity to learn more about the world if the right choices are made.  I learned that the voice acting in the game (FULLY voice acted) was actually a stretch goal of it's kickstarter, and I have to say it helped breath life to the characters, and it was quite refreshing to hear new and different talent in an industry that sometimes feels only a handful of voice actors are always given work. (I hear voice actors like Jennifer Hale and Steve Blum across a LOT of titles, across different mediums, and while definitely great voice actors, it's once again so refreshing hearing new talent). While the writing can also stand on it's own, the acting definitely helps you understand what kind of personality each character exhibits, and makes them that much more memorable. From the character designs to the backgrounds, the artstyle is also beautiful to look at, and speaks of the artist's talent in presenting this world and the people who live in it.  There are some games, or even TV shows, that you can play or watch for a while, and then you need to take care of something else. Then there are others that grab your attention so much that you forget where the time went, or you're compelled to finish in one sitting. This is one of those games. I finished my first playthrough until the wee hours in the morning (totally worth it xD). I'm so glad this is part one, as I cannot wait to see what else this indie dev will bring out next in the story.",
            "review_score": "1"
        },
        {
            "review_text": "I like visual novels, I like visual novels that have voice acting more. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Not usually a fan of VNs but this was really good, quality voice acting and very authentic feeling characters. Definitely worth replaying to get all 3 endings.",
            "review_score": "1"
        },
        {
            "review_text": "It was about 1am. I figured I would just check out the beginning and go to bed. Next thing I know it's 5am and I'm still awake, grinning like a dork because I just blazed through the kind of story I've really wanted to see.  Ash's personal struggles struck a lot of familiar chords and most of the characters were interesting enough to keep my attention throughout the story. Would recommend for people who want magic heavy fantasy with a side of gay romantic hazards + unsettling intrigue at times.",
            "review_score": "1"
        },
        {
            "review_text": "there are some similarities between this game's plot and that of the anime Familiar of Zero. However, this game had me bleeding from the nose at one point for some reason (perhaps I just need to see a doctor?), Familiar of Zero did not (it should have though). so... I'll leave that to your interpretation?",
            "review_score": "1"
        },
        {
            "review_text": "While it is part 1, it was a full story. engaging, interesting and reminds me of PC adventures from the 90s",
            "review_score": "1"
        },
        {
            "review_text": "It was a truly Enjoyable experience. The Characters were rich and developed, VA was awsome, the world was introduced slowly with hinting at greater adventures and settings. Action and fights were well written",
            "review_score": "1"
        },
        {
            "review_text": "I regret not buying this game sooner because it was absolutely amazing from begining to end. The voice acting and the art are really good and add a lot to the overall experience. I would recommend this to anybody who mght be interested in these types of games as this is one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "great story.  Only problem is having to wait for the next part.",
            "review_score": "1"
        },
        {
            "review_text": "Art is gorgeous, music is great, voice acting is top-notch. I feel that there are a few hiccups in the story (pacing- and continuity-related), but it's gripping and interesting enough to ignore those altogether. So a definite thumbs up from me.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a big fan of visual novels. I think they seem to drag a lot of the time but this one kept my attention right up to the very end and a little longer to see the bloopers. The story is great and all the characters to and I can't wait to see the part 2 already.   Actually I'm dying for it to come out. I can't wait. &gt;w&lt;",
            "review_score": "1"
        },
        {
            "review_text": "To just to make clear, I actually completed the game and got at least 1 ending, regardless of going though twice and making some different choices.  Really loved this game alot. The artwork is pretty good, the plot and learning bits about the world is VERY interesting, love the characters and the voice work is excellent, despice the game not costing that much to buy.  I guess one thing I hoped for is an ending where Ash ends up with Prude. If there is one, I would love a guide to it. If not, then I'm OK with that.  I highly recommend buying and playing this game, you will not regret it and I hope to see the next chapter to this story soon!",
            "review_score": "1"
        },
        {
            "review_text": "No spoilers: even though at first it feels like your run of the mill 'emo mary sue original character donut steal' kind of game, it's most certainly not. Every character seems fleshed out and completely 3D. Definitely one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "WOW I am so impressed with this game. The artwork is so beautiful, the characters are all unique and their voice acting fits their personalities. I loved the concept and how it was executed. I even stopped a few times to admire the scenes. At first I got ending 1 and was very pleased with it. I replayed it (there is a skip option that goes until a choice or new lines come up) changed all my choices, got ending 3 and damn... those two ending were complete opposites. There are so many different ways that part 2 can go, I am definitely looking forward to it.",
            "review_score": "1"
        },
        {
            "review_text": "Bare in mind I'm not really much into visual novels. But if one catches my eye because the design and story I may give it a chance. And I wasn't wrong at all. I just finished it for the first time and got the first ending. Played it 7 hours straight and now my eyes are on fire, but the crying while playing helped to hidrate them.   Now in a more serious manner. I loved the characters, really well done, some more likeable than others (maybe some people will like the ones I didn't like and hate the ones I did like), the story had me hooked, all the magic, balance, pairing stuff. It was like a methaphor about human relationships And the suspens made me wanting to know more.   The twists got me good, I had some moments flipping stuff from my desk (I have a messy artsy desk don't judge). The jokes were funny, the blooper reel was a really nice touch.   So... yeah, I REALLY DO recomment this game. And I'm waiting for the 2nd book!! I'm really happy to been able to get the good ending first since it leaved me with a great sensation.",
            "review_score": "1"
        }
    ]
}