{
    "app_id": 410110,
    "name": "12 is Better Than 6",
    "release_date": "2015-11-20",
    "developer": [
        "Ink Stains Games"
    ],
    "publisher": [
        "HypeTrain Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Shooter",
        "Singleplayer"
    ],
    "achievements": 46,
    "positive_ratings": 3192,
    "negative_ratings": 576,
    "price": 6.99,
    "description": "12 is Better Than 6 is a dynamic top-down shooter with stealth elements, presented in a Wild West theme. The story puts you in the shoes of escaped slave fleeing to the United States in 1873.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/410110/header.jpg?t=1544807860",
    "minimum_requirements": "OS: Windows Vista / Windows 7 / Windows 8.1 Processor: Intel Pentium 2.9 Ghz or equivalent Memory: 2048 MB RAM Graphics: 512 Mb DirectX 9 compatible video card with shader model 3.0 support DirectX: Version 9.0c Storage: 300 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'Neither yes or no'; Steam ratings need a 'neutral' recommendation option.   A simple game much in the style of 'Hotline Miami' except mostly with gunplay rather than melee+thrown items. The gameplay itself is basic and clean, but poor level design, a lack of progression, and a pointless money mechanic lead to a confusing experience overall.  Overall, its barely an OK game for $3 or less at best.   PROS: -A few different guns that need to be operated correctly (♥♥♥♥ the bolt, re-load, etc).  --Weapons are: Knife, 6-shooter (pistol), double-barrel shotgun, and rifle.  -Gameplay is fast and clean. AI is tough but not cheap.   NEUTRAL: -There is a story of some kind but I skipped past it. The story was told entirely through text and ruined the rapid pace of the action gameplay.   CONS: -Environments are re-used almost verbatim.  -'Random' encounters are pointless and annoying. You will get interrupted between travels to get attacked by 1-3 enemies. (complete with load screen before/after the encounter) -Money in the game serves no purpose. There are upgrades to buy but they only appear at certain points through the adventure and next to each vendor is a guy that offers you unlimited 'mini missions' for bonus money so you can afford the upgrade. A pointless grind....just give the upgrades for free and ditch the money. NOTE: There is NO other purpose for the money (you do not buy bullets etc). -Gun looting mechanic makes no sense. You can NOT take bullets out of dead enemies guns. This means it usually makes more sense to drop an empty gun and pick up a dead guys gun rather than to reload because if you reload and run out of bullets, you can not take the bullets out of the guns on the ground (??).  -The '12 is better than 6' upgrade which makes you dual wield pistols is BUGGED. You cannot reload the guns normally (your bullets just disappear, they DO get used up but no reload happens). Instead, you need to switch to your knife and switch back to your pistols to get them to auto-reload. This is especially embarassing considering this upgrade is literally named after the game.  -Dead enemies leave their hat behind. Since the game is 2D top-down view, it can be difficult to distinguish living enemies from dead ones in the middle of a fight. -Similar problem to above, but sometimes its simply hard to SEE the enemies. The art style is a very simple black-and-white line drawing and the hats have almost no variation/distinction to them.",
            "review_score": "-1"
        },
        {
            "review_text": "Obvious comparisons with the Hotline Miami cannot be avoided and it’s influence is widely spread through the game. Still, 12 is Better Than 6 somehow manages to better its paragon is some aspects.  This top-down, kill everyone and everything shooter has somehow unexpectedly landed on-top of my desk the other day and I’m still having trouble letting it go, despite finishing the campaign several times.   Addictive and distinguished, 12 is Better Then 6 (or as I like to call it ‘Hotline Texas’) provokes that perfect mix of having fun while constantly trying to better yourself throughout its surprisingly short campaign but hugely rewarding campaign. With no health bar you will die from one well placed bullet most of the time. So get ready to die a lot. That makes room for planning two, three and sometime even four or more steps ahead in order to finish a single level.   Finishing any level feels like a reward but at the same time levels are designed with such care and precision that it shouldn’t take more than a couple of retries to compleat any of them. And it never ever feels unfair. There are over 100 levels in total spanned throughout four acts, each about a couple of minutes long if you know your way around it.  Combat revolves around quick reflexes and tight aim, complemented with unique „♥♥♥♥“ mechanics. Basically it works like a real gun does, you have to „♥♥♥♥“ (the upper trigger) your bullet inside the barrel to take the shot, repeating the action every time you take a shot. I found that mechanic to be a breath of fresh air in the shooter genre in general and hope to see that gameplay mechanic being implemented in more games.  Graphically hand drawn in exclusively black &amp; white tone, with only the blood being red, I see why some players might find this game to be repulsive, or even jump to a wrong conclusion of lacking the in-game depth. I myself enjoyed the simplistic overhead presentation as it allowed me to sharpen my senses to the fullest and just get on with what the game wanted me to do.    Disclaimer: Key was provided by developer for testing the game and for review purposes only    FULL REVIEW  [pcgamesnnews.wordpress.com] ",
            "review_score": "1"
        },
        {
            "review_text": "This is not a bad game, but the thing is everybody is giving a good review (at the moment the users review are very postive) and this game is not perfect. The devs are still working on it so perhaps I'll be changing this to a positive review soon.   Let's start with the  good points  :     The game has got a great soundtrack    Hotline Miami like gameplay    The whole cocking the gun thing is weird at first but pretty immersive after a few tries, you feel like a real  cowboy  pistolero.    Nice graphic (even if sometimes they will get you killed because the black and white can make ennemies hard to spot)   So to sum up it's a fun game. I would actually recommand it, except I wanted people to know what's not great about the game, to be warned. As I was saying it's fun BUT let's get to the  bad points  :     Melee fight : you have no range, and you don't OHKO if you don't aim perfectly (unlike HM) so sometimes stealth is a real pain in the butt    When you die to reset the level you have to click, and there's a short lag so some people like me will spam the click, and when they spawn shoot, destroying stealth, getting caught and killed, starting again, being mad so clicking even more, leading sometimes to 5 missions failure in a row for nothing. Why don't the devs just put it on R like every die and retry in the story of humanity? (of course you can't change that control).    The story (I mean you're a racist mexican killing people to find back your memory, I've seen better)    Well it's not really in the game but some updates destroyed my saves, which is pretty sad.    The reloading is really weird, ennemies don't drop ammo but guns and you can't transfer ammunition from one gun to another so you have to take the gun with the most amo in it. As for the reloading mechanic after over 10h of gameplay it still doesn't make any sense to me (I mean it's reloading how hard can it get, shouldn't it be : take ammo from the ammo stock to refill gun, substract the amount used from the ammo stock? Not randomly reshuffle the ammo in the gun and the stock sometimes loosing some in the Great Void). So basically you use a gun until there's no more ammo in it and go grab another one. You might say 'well it's the same in HM and it's not a problem' but as I said, in this game melee is very poor so without a gun you're dead, and if you're going to put a mechanic in a game, might as well make it at least a little useful.    Last thing there's a cool feature that allows you to chose among several hats, which is fun BUT the games put your sombrero back at each level so you have to pause, go in the menu and put back the hat that you like (and you don't have an overall view, you can only click left or right to see the next sombrero, until you find the one you want). That's a pain so you just stop customizing your hat which is a shame.   Without these bad points I would recommand this game 100%.  Unfortunatly on top of the rest, two of the good points of this game (my favorite parts) can be found otherwere (on Steam) :    Hotline Miami's gameplay -&gt; well in  Hotline Miami , and it's better in HM    Far West feel -&gt; in  Call Of Juarez : Gunslinger   ",
            "review_score": "-1"
        },
        {
            "review_text": "Relaxing top down view shooter with great pencil painted graphic and variety of weapons, each is operated another way. Many levels to play. Similar playstyle to  Hotline Miami  but way better. And a Mexican guy.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, when I played this game for the first time, I simply loved it. To its hand-drawn aesthetic, to its gameplay that is greatly inspired by a popular game known as Hotline Miami. But as I continued to progress through the storyline, the game started to slowly get boring and bland as the time went on. Before we get on to the negatives on the game, let's first start off with its pros.  + Its Art Style  Unlike other games, 12 is Better Than 6 values its hand-drawn environment the most. It's unusual art style really adds to the uniqueness of the game which makes it stand out from the crowd from games that rival Hotline Miami.  + The Reload System  On several occasions I have frantically panicked to reload my gun to pop off another shot, only to then get killed by a mob of enemies. The reload system is basically the saving grace of this game. Compared to Hotline Miami where it's one mag and yoathis game is different. You actually have to load your gun manually, bullet by bullet. This can lead the player to create many memorable moments where the player may have fought off 10 enemies with a six-shot revolver in an open area. Because of this system, it adds to the experience of being in the Wild West.  Now, the wretched cons  - Enemy encounters and repetitive levels  Throughout the middle of the game, you'll be traveling to different destinations. Now you can't choose where to go, the game does, so this limits the player's freedom in the way. However, as you travel, you can get random enemy encounters, and your job is to somehow escape from these 'vile beasts.' At first, this could be seen as a wise decision from the developers of the game, to keep you focused on the action, rather than just waiting to arrive at your next area, but as you travel more and more, it just gets repetitive and the game starts to lose its touch. After getting encountered by enemies countless times, the levels start to repeat itself over and over again, until you start getting annoyed when you get yet again, another enemy encounter. The repetitive levels aren't just for random encounters though, because they happen every other time you do a mission for one of the townsfolk in your area. It's gotten to the point where I've almost memorized every level layout the game throws at me every time I do a job for more money, just to get a single perk. Speaking of the perks...  - The Perks  Most of the perks   don't benefit you in anyway, and just end up hurting you.   are what I call barely an upgrade once you buy them off of the shelves. I've never ran into any moment while playing this game, where I thanked one of my perks for saving me in a vicious gun fight. For example, (minor Spoilers)    loading two bullets at once. This perk doesn't really benefit you in any way, considering that you would be spamming r to reload your gun in a fight in the first place. Having to wield two revolvers at once, hence the title of this game. It may seem cool, but again, it doesn't really benefit you, as it encourages you to waste more ammo, rather than shooting accurate shots at your foes. Finally, having the ability to attach a stick of dynamite to a rat. Once deployed, the rat would chase any enemy that it's closest too. But this perk itself is a simple debuff to your character. Way before I got this perk, I used to kill 3 or 4 people with my throwable dynamite, but now with this 'upgrade' I only get to kill one    (end of spoilers). Therefore, the gameplay just remains bland and dull with its boring stages.  - Its disappointing ending  The ending to this game was beyond disappointing. I won't spoil anything about it, but the ending was just confusing and so sudden that just made me think, 'Is that it?' I can't really say anything else; just unsatisfying.  - Its short playtime  As shown from my playtime, I finished this game in about 3 hours, all in one sitting. For a 11$ you would expect something longer; and to that I would say... NOPE. All there is at the end is an endless survival mode, and because of its ending, you wouldn't even want to continue the game. Due to my cons listed, my total experience wasen't very pleasent indeed.   In the end, I can't recommened this game, to its repetitive levels to its terrible perks, I would suggest to get this game on sale rather than to buy it at its full price. However, if you're begging for a Hotline esque game and don't care about these cons, this game would be for you.  EDIT: Aug 8 2016  With the latest update to the game, my progress with the game has now been deleted automatically for some reason. A costume of mine is gone, and now all of the acts that I have previouslly unlocked are now no longer avaliable for me to play, since I have 'started over.' None of my opinions have yet to be changed with this game",
            "review_score": "-1"
        },
        {
            "review_text": "🌞🕛🌞🕛🌞🕛🌞🕛high noon hIGh no౦n🔫🌞 it's hIiigh nooN🔫🔫 right there🌞🌞 if I d0🕛🔫ƽSAү so my self 🔫 🌞thats what im talking about right there right there (chorus: step ʳᶦrigʰtᵗ up) mMMMMᎷМ🌞 🌞🕛НO0ОଠOOOOOОଠଠOoooᵒᵒᵒᵒᵒᵒwdy 🌞🌞🌞🌞🕛🔫 🌞 🌞 🌞 🔫🔫 High noon",
            "review_score": "1"
        },
        {
            "review_text": "I am not a fan of topdown shooters, maybe its because I suck at them but 12 is Better Than 6 was one of the most enjoyable indie games I've played for a long while. It is tense, creative and offers a good challenge which you can approach in many different ways.  Pros: - Incredible soundtrack. It is excellent, fits the game perfectly and gets you going all the time. - Manual bolting and reloads add so much depth to gunplay thus makes the game rise above the other topdown shooters. - Story. It does not have so much depth and certainly not a piece of high literature but it shows that developers have analyzed the tropes of western genre thoroughly and executed the story with a good sense of humor. - All the weapons feel unique and your weapon of choice impacts your gameplay greatly, which makes more than one playthrough a viable option. Especially bow and shovel work quite unexpectedly well which is a nice change from the usual guns (revolver, rifle, shotgun) - Upgrades are well thought of and they all serve a good purpose, unlike filler upgrades in many other shooters. - I am not an expert on topdown shooters but stealth being a viable option most of the time is pretty good. - When talking about stealth of this game, I have to mention the knife. The way they designed the knife is amazing. If the enemy is unaware of you, you will kill him with one knife hit if you are close enough to the head and two hits if you are a bit far. If the enemy noticed you, you have to get behind his back and it will take four hits to kill while front hits won't do any damage. Simple details like this greatly increases production value of the game - You have to manage your ammo and know when to reload.  Cons: - A few minor bugs which usually causes you to get stuck in a place, but it is nothing to worry about. - Tutorial part is not very good, while it teaches you most of the basics, I did not understand how to reload and ammo count for a while. - A few random chatboxes were not translated into English and were in Russian but I have encountered this for twice, so it's ignorable. - Game has enough content for its price, but a co-op mode and workshop support for user made levels (which should be easy enough I'd guess as the dev made levels seem to have include a small amount of assets) could have increased the longevity of the game.  I think 12 is Better Than 6 is a must play for everyone in its current state, therefore I shall give a final score of 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Fine fast-paced top-down shooter, such as Hotline Miami, set in the Wild West with a good soundtrack. Simple but pretty visual style.  Few bugs here and there.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Hotline Miami then you'll like this for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Im not a expert in writing reviews but here are my 2 cents   The Good",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game. I like the simple yet effective graphics a lot!",
            "review_score": "1"
        },
        {
            "review_text": "Good game! Great mechanics; only problem I have is that if you look too far away with the SHIFT-look thing, you can't move your character and will likely die.  9.75/10, would play again",
            "review_score": "1"
        },
        {
            "review_text": "It's Hotline Miami meets the Wild West, what more could you want? :-) Great hand-drawn graphics give the game a really distinctive look which is complimented by an equally great sound track. The controls to aim and reload are unique to each weapon which makes them feel free really different, but are quick to learn and satisfying to master. An average play-through looks like it will take 3 - 4 hours, but definitely money well spent!",
            "review_score": "1"
        },
        {
            "review_text": "its like tactical hotline miami, with unique graphics and awesome soundtrack. very good game",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, good story, amazing art, really nice gameplay.  I love using the bow and picking up the arrows i shot, so infinite ammo in some way.  A must have piece of art!",
            "review_score": "1"
        },
        {
            "review_text": "Overall the game was awesome, funny and just fun to play. But the ending was ♥♥♥♥, LIKE UTTER PANTS and the game was over far too soon :(  We need other games like this",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing amazing game. Same basic principle, but very minimal and straightforward story. Great gameplay, a number of weapons that feel and play very differently and are suitable for various situations. Plays great, extremely smooth and completely bug-free. Took me around 2-3 hours to finish and just felt great. Full prize is slightly steep considering it's very short and replay value is scarce, but on sale, it's very much worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Glitchy as ♥♥♥♥ but fun as hell play, it's like hotline miami but a western.",
            "review_score": "1"
        },
        {
            "review_text": "This is an extremely simple game: you see someone, you shoot him. If you're not fast enough, you're shot to death. And yet this game brings its simplicityto the limit, making it comple amd enjoyable: you have to ♥♥♥♥ your relover. You have to reload every single bullet. You have to wach out for ammo. You have to plan out your shootouts. You have to watch out for patrols. You have to think before gutting someone with your knife. Moreover, this game has an actual story! Yes, it's cliche, but it gives you the reason to shoot almost anything that moves.  Although, controls are frustrating at times, I really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Similar to Hotline Miami, with cool story and unique design. Fits really good in wild west era and I like that each weapon is handled a bit differently. Only issue I had is that you can't pick up bullets from dead enemies.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, exciting, addicting top-down shooter. You can be stealthy or go in berzerker style, guns blazing. Interesting and consistent art style. A few standard weapons to choose from (pistol, shot gun, etc) and game play does get a bit repetitive, but it's a short (6ish hour) game. Overall a pleasant experience.",
            "review_score": "1"
        },
        {
            "review_text": "[Buy on Sale] This top-down Western Themed shooter is by no means as good as Hotline Miami, but it's still pretty decent in terms of fast-paced gameplay and music but the game lacks in content. The story isn't very interresting, but it's quite rarely important in a Western. I would recommend it at 50% of its price.",
            "review_score": "1"
        },
        {
            "review_text": "I really dunno about this one, but it did made me interested.  Pros: + The soundtrack and its names fits the atmosphere! I literally searched the meaning of them :v + Upgrades. Yeah... + Oh hey, you can kill animals on the game c: +  10/10 Hat simulator 2.0 after Team Fortress 2 gg m8.   Cons: - The 'Enemy Encounter' was WAY too annoying when you're on the way to the destination. - You can't buy ammo from a store or whatever or get more ammo from dead gringos (except for bow and arrows(?) ). Like, seriously? - Sometimes the gringos were hard to see. - On a episode at the Act 4 (I can't really remember), I was lagging so bad. Same as when I hold Shift to look around.  8/10 would instant-killed by meele weapons again.  But it on sale if you're going to play this.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, decent story and gameplay.  Expect not to have all your questions answered by the end.",
            "review_score": "1"
        },
        {
            "review_text": "You're a mexican and you shoot people... it's just awesome",
            "review_score": "1"
        },
        {
            "review_text": "IT'S HIGH NO-(death cry)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot like Hotline Miami in the way you play, but there are a lot of differences. Its fun and addictive, just like cocaine!",
            "review_score": "1"
        },
        {
            "review_text": "If Cummings played this, he would say  break onetwothreefourfive pigeonsjustlikethat  -------------------------------------------------------------------- Jesus BA-ANG I WAS A HANDSOME MAN",
            "review_score": "1"
        },
        {
            "review_text": "The math doesn't lie.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, has a decent story and great gun play. Anyone who loves Hotline Miami will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "I am a huge fan of Hotline Miami but have not been able to get into this game. Movement is clunky, the gun-cocking mechanics make the game a struggle, and overall it just really rough around the edges.",
            "review_score": "-1"
        },
        {
            "review_text": "  Really addictive top-down hand-drawn shooter. Smooth visuals and nice sound.",
            "review_score": "1"
        },
        {
            "review_text": "Great game the bad reviews i'd like to say are little kids who got a spraying trigger don't fire off a shell ♥♥♥♥ing kiddo you gotta hold down the mouse button. Great game worth full price shoot those people and kill all those gringos with a angry revolver crazed mexican.",
            "review_score": "1"
        },
        {
            "review_text": "apparently there's hotline miami for your gardener now.",
            "review_score": "1"
        },
        {
            "review_text": "I already love this game, but there are a few flaws that make it almost unplayable.   Settings can't be changed, so I can't see the entire screen whether full screen or windowed. I can't even 'trick' it to be the right size by resizing in windowed mode. This is a crucial feature missing from the game &amp; that alone makes it so I can't play it, along with many others I've seen in the community. I wouldn't include this in my list of flaws, but it also can't be edited in an .ini settings file. I looked &amp; looked, but there it wasn't.  Another major problem is controller sensitivity. I am using a SixAxis PS3 controller that gives me zero issues with any other game, but aiming is almost impossible because character &amp; crosshair rotate very sporadically rather than even a slightly fluid motion.   The last big issue is the inability to easily see the barrel of short guns or the knife. If the player can't see it or has to work to do so, they'll just die &amp; die &amp; die. Not all of us have massive monitors capable of top-notch resolution. If you guys are catering to only that group, you've done it right. But c'mon, don't deny those who can't/haven't upgraded our displays a game that looks so rad.  Please, devs. They seem simple enough fixes. I'd like to give this game a thumbs up, but until you guys at least communicate with those of us who are having issues, I'm giving this a thumbs down. Please, guys. Just, please.",
            "review_score": "-1"
        },
        {
            "review_text": "This is... super game!",
            "review_score": "1"
        },
        {
            "review_text": "  cool its fun",
            "review_score": "1"
        },
        {
            "review_text": "Very good ideas ruined by A very very bad art style and awful reloading system the game feels weird first with no explanation at all of that very weird reloading system but after 1 hour maybe i got used to it and i tough wow the game seems now very good but nooooo the art style is very confusing you can hardly tell enemies from environment and it gets harder when trying to tell friendly from enemy and the camera some times shakes in annoying way which give me headache game had potential but badly executed with very stupid decision regarding the art style and reloading system",
            "review_score": "-1"
        },
        {
            "review_text": "this game has realy changed my life and if you want to feel entertained on friday night this is something for you! the game has cool weapons hats and cutscenes. but the main character is so baddass!!!!!! so great and should defs play it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Bean and cheese burritos have nuthin on dis! (easy achievements too)",
            "review_score": "1"
        },
        {
            "review_text": "Tutorial does not teach you enough about how to play the game. Very racist game, but apparently that is ok if you are killing Americans.",
            "review_score": "-1"
        },
        {
            "review_text": "Such a big bug:Out of memory!!!! Alway!!!Shi TTTTTTT!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "The game is not as good as it's looked. Too violent and boring :(",
            "review_score": "-1"
        },
        {
            "review_text": "What I always wanted! A black screen with the title music playing!",
            "review_score": "-1"
        },
        {
            "review_text": "The concept is nice, the soundtrack is good, gameplay is ok, but it crashes every change of chapter.... a shame, i really felt like supporting this guys, now i just feel it was a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Just filling the void until Midnight Animal or Hotline Miami 3 comes out. It's a fun game, and has cool graphics. The guns work kinda funky and can be confusing. It's worth the buying if you liked Hotline Miami though.",
            "review_score": "1"
        },
        {
            "review_text": "I really love the western theme on this game. I used to love western movies and pretty much anything related to that when I was a child.  The game is really good and I really enjoyed the story. The only thing that gets boring are the road fights, but I would recommend you to buy it if you like this kind of games. ^^  8,5/10 for this game.",
            "review_score": "1"
        }
    ]
}