{
    "app_id": 410290,
    "name": "Acorn Assault: Rodent Revolution",
    "release_date": "2016-03-02",
    "developer": [
        "High Tale Studios"
    ],
    "publisher": [
        "Black Shell Media"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Casual",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 43,
    "negative_ratings": 10,
    "price": 7.19,
    "description": "Acorn Assault is a quirky, tail-bobbing turn-based strategy game. Raise an army, overthrow a tyrant King and save the oppressed squirrels in the Rodent Revolution! Hone your skills in single-player, then duke it out with players around the globe in online multiplayer!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/410290/header.jpg?t=1484515387",
    "minimum_requirements": "OS: Windows 7 (32-Bit) Processor: Dual-core 2.0 GHz Memory: 2 GB RAM Storage: 1 GB available space Sound Card: DirectX 10 class GPU with 512MB VRAM",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "UNINSTALLING. It's very suspicious that all the first reviews are very possitve when this games fails to deliver a good experience... very fishy. I really loved the idea of the original characters. It's a cute twist to this kind of game. Silly me, I thought it'd be an easy and enjoyable game, the kind you just want to play after losing so many matches in that other game you play. How wrong I was. The strategy of this game is good, the idea seems ok, but it's just hard. It almost seems like it's permanently switched to Hard. The first stages are fine. Later on, it you get the feeling the computer is cheating. The computer gets more stuff to plant and ends up on top no matter what even though you get more HP from the begin. Another thing that throws it for me it's how slowly it takes place. Imagine a hard game that takes place in slow motion.  It's a cute idea and the price is good, but that's all. This is less fun, fair and entertaining than your average phone FREE game. Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "NOTE: This game was given to me by the developer for review purposes. This did not influence my review in any way.   ========================================================== ---------------------------------------OVERVIEW------------------------------------- ==========================================================",
            "review_score": "1"
        },
        {
            "review_text": " A Turn-Based Strategy Game",
            "review_score": "1"
        },
        {
            "review_text": "  Overall, it is a mediocre strategy game. I wouldn't say anything about this game is revolutionary but they did a fine job with the storytelling.  If you like the animal theme and strategy games like Stratego, this is perfect for you then.",
            "review_score": "1"
        }
    ]
}