{
    "app_id": 410380,
    "name": "HEX: Shards of Fate",
    "release_date": "2016-04-19",
    "developer": [
        "Hex Entertainment"
    ],
    "publisher": [
        "Hex Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Steam Trading Cards",
        "In-App Purchases"
    ],
    "genres": [
        "Adventure",
        "Free to Play",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Trading Card Game",
        "Free to Play",
        "Card Game"
    ],
    "achievements": 0,
    "positive_ratings": 1055,
    "negative_ratings": 580,
    "price": 0.0,
    "description": "HEX: Shards of Fate is a new breed of digital card game, combining classic TCG gameplay with elements of an online RPG. Create powerful decks from over 1,000 unique cards, battle your way through the single-player mode, or test your mettle against other players.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/410380/header.jpg?t=1521331966",
    "minimum_requirements": "OS: Windows® XP/Windows® Vista/Windows® 7/Windows® 8 (latest Service Packs) Processor: Intel Core i3-2120 CPU 3.30 GHz Memory: 2 GB RAM Graphics: 1 GB DirectX 9.0c compatible video card DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I logged on today figuring I would just do the tutorial and see what the game was about. 9 hours later, I'm still playing and having a blast. As a beta era mtg player, 2+years on hearthstone, I can safetly say this is one of the best tcgs/ccgs I've ever played so far and I've only gotten into the pve campaign! It is worth a try if you like card games in any form. The addtional mechanics of talents, charge abilities, equiptment (pve only), really makes the game stand on its own as a fresh game.  The way the economy is player run and the easy selling of in game currency for real money curreny makes obtaining the decks you want relativley easy for a f2p system (and thankfully pricing is fair) compared to others....cough....hearthstone...cough...sorry bout that, something stuck in my throat.  I cannot wait to start trying out the different tourtaments they have set up (you can pay to enter or join in the constant free ones) the prizes and way you get to keep all the cards you draft. Not to mention any cards you buy from the store or win in tourtaments have a 2% chance to spawn a bonus 'Primal Pack' that contains nothing but legendaries and rares which either sell by themselves (the packs) for a lot of the real money currency, or you can open them and hope for a super rare legendary and be set for life $$ wise :P   Also note, I saw all the negative reviews due to some server issues, earlier today the devs made a statement about it, found the problem, and have since fixed it. Not at any point during my 9 hour spree did I suffer from lag, disconnects, or game crashes. So ignore the mixed status as of now and the negative reviews going on about lag and disconnects, its been fixed and the devs showed great passion for their game by their fast answer and fix. Their quick response has given me a lot of hope for the future of this game, I can definetly see myself playing it for years to come.",
            "review_score": "1"
        },
        {
            "review_text": "(Although my Steam hours have just started, I've been playing HEX since Alpha for many many hours)  There isn't much I can say, which hasn't already been said. So in my review I will focus on a very specific demographic.  Hi there, long time Magic: The Gathering players! The answer to your question is a massive  YES .   YES , this is that game you've been waiting for all this time. Frustrated about the fact that Wizards of the Coast is apparently stuck in 2002 (looking at you MTG Online) and you see all these shiny new digital TCG/CCG coming out? You've been looking at your humongous collection of cards neatly stacked away in a closet. And you nostalgically think about the times you used to play MTG for days with your friends. Friends who have since moved far away and don't have time to get together for this anymore. It's 2016 now, surely there could be some way of reliving the joy of MTG digitally?  Well, it's time to rip apart that Chaos Orb! HEX is here and it will give you everything you've been waiting for and so much more! And that, my friend, is a promise. It's MTG, but with all the nice things you can only do in a digital environment.   I've read people complain about the fact that PVP isn't free-to-play. Well, we, as long time MTG players laugh about this. Haha! The amount of money we spend over the years on buying booster packs and single cards will never come close to what HEX costs in a long long time. ;) But I think this is one of the things I really like about HEX. Why?  No, it isn't F2P if you really want to get competitive into the PVP side of things (but PVE is totally free). But that's also why HEX is a  T rading Card Game. That  T  actually makes a huge difference in comparison to other digital cardgames (one with Murlocs for example). You can buy, sell and trade single cards in HEX. Just like you can with MTG. There is an actual auction house and there are third party store websites, which buy and sell singles. So, yeah, you can buy that booster pack for $1.50 and pull out a Vampire King, which is currently valued at $30. You can then sell that Vampire King and buy yourself a stack of boosters or a couple of other singles you want. The money I spend in-game is actually more of an investment. And not a bottomless pit even Harrison Jones wouldn't dare to venture down in...  So, bottom line, I can wholeheartedly recommend this game to anyone looking for the best digital TCG currently on the market. Look no further, it's HEX. And if you look at the things these guys have in store for us in the future, this is only going to get better and better. See you in game!",
            "review_score": "1"
        },
        {
            "review_text": "I'm a Twitch streamer. Hex has been my main game to stream for over two years, and I would not cast a game for that long that I didn't personally enjoy. However, Hex may not be for everyone. Read on, and let's see if the game is something you'd be interested in.  If you are looking for a card game, where the primary focus on the game are rich and strategic interactions between cards, Hex might be a game for you. Especially if you enjoy deckbuilding and brewing. With over 1300 cards available and all sorts of effects and synergies spanning all its modes, there is already many cards to take in and explore. Though, if discovering cards and deckbuilding sounds like a chore, perhaps it isn't for you.  If you enjoy card games, and like to compete against other players, Hex might be a game for you. The PvP is modeled like many competitive Trading Card Games in its tabletop roots. A small entry fee and some luck and skill can turn into awesome prizes. And at the highest level of play? Perhaps you'll win a qualifier and play in an Invitational tournament in front of an audience for a large cash prize! But if you don't like PvP play, this won't be a compelling reason for you.  On the other end of the spectrum, if you don't like the pressure of competing against other players, and just want to play out your amazing combo, Hex also has you covered. Its single player PvE play, in the form of a RPG-inspired campaign to explore and grow your own champions (that will be expanded upon in the coming years!) and an Arena mode to take on a gauntlet with a fully-geared deck. An experienced player should find about 10 hours for a single once-through playthrough. Cards, equipment, gold, loot to gain, and this is all free! But some aren't interested in single-player modes, if that is you, then feel free to ignore this section.  Do you like collecting stuff? Does the prospect of turning extra things into stuff you want sound compelling? The T in TCG stands for Trading, and Hex prides itself on its economy. The terrible feeling of getting an extra of an amazing thing, and being unable to trade it, is not in this game. Open a legendary in a pack, get a rare dungeon drop, or receive an exclusive promo in an event... and find someone who wants it in the Hex Auction House. Turn your extras, tournament winnings, farmed gold or bought platinum into anything you can find a buy or trade for. Though, if economy is not your thing, then it's not.  Well, there's a bunch of reasons I have for liking Hex. If you've read through, and one or more of those reasons intrigue you, give Hex a try. It's free to make an account, the campaign and PvE is free and you get stuff, random PVP games are free, and you have full ability to buy packs of cards if that's the kind of TCG player you are.  Hex has given me over 2 years of fun, and will likely continue to. And if you're like me, you'll like Hex too.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a veteran trading card game player and this review is primarily addressed to players already familiar with classic paper trading card games.  If you want a digital trading card game that retains the complexity of classic trading card games then HEX is for you.  Everything except card sleeves is tradable within the game which means that everything in your collection has a real world value. The game offers a great ruleset that allows a huge set of interactions, veteran card players are going to feel at home with familiar concepts like The Chain (The Chain in WoW TCG, The Stack in MTG), activated abilities, triggered abilities, combat and resource systems similar to MTG, and a lot of other things. HEX also innovates a lot in the digital space; modifiers on cards can be tracked throughout different zones (even in zones hidden for players, like your deck), cards can interact with zones without revealing/shuffling/searching or other shenanigans, effects allowing you to see cards in your opponents hand without them knowing, transforming cards into other cards, etc. etc.  The game offers a great PVP experience with both constructed and limited formats (draft, sealed), and as in classic trading card games, you get to keep all cards and packs obtained in these game modes which justifies the small entry fee. There is also a PVE part of the game that is completely free to play, at the moment this includes a campaign with character progression, talent tree, dungeons, quests, equipment, and card rewards. HEX has a superb economy with two different currencies: Platinum and Gold. Platinum is bought with real world money, while Gold is given as a reward in PVE. Entries to PVP tournaments has a small Platinum fee, but opening packs yields Chests which in turn needs Gold. This results in paying players needing Gold, and since everything is tradable the paying players lists cards and items on the Auction House for Gold, hence everything in the game can be obtained by just playing for free (however there is a lot of grinding involved to get the most expensive cards).  All in all, HEX is a great game with a great future! Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous art, deep and intricate gameplay interactions and a huge number of cards that have wonderful flavor.  I've spent an awful lot of time just planning out and trying different themed decks - a relentless march of zombies endlessly rising from the grave when killed, an army of evil spiders that bury the opponent in deadly eggs, a set of weak dwarves that construct enormous killer robots, holy paladins that harness the power of healing to become almost invincible.   It's caught my imagination like few other games I have played.   Overall a great game, marred only by the glacial pace of development.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game has been fantastic so far. Stole me away from magic, and I have played that for like 20 years. Came to this from playing magic duels which felt like an insanely arduous grindfest trying to build decks. Was stuck for like 2 months opening one pack maybe every two days and using the same starter card decks over and over to grind against cpu with his decks filled with gold cards and planeswalkers.   This has been a breath of fresh air. Campaign is fun, and you can earn a lot of really good cards in there. Best way to build a deck is to make 4 guys of same race and do the first part til you clear both bridges and get a full playset of their core cards.   You can then build a good deck to play arena vs AI to get gold and it doesnt feel like a grindfest. I have aquired more cards to build my deck in 3 days on this game than I did in magic duels in 2 months after spending 10$ on both to start with.   Auction house is also a great part of the game that lets you put that gold you got from the arena and campaign to good use. You can buy singles, or equipment which can enhance cards, or sell off some of the stuff you have extras of or doesnt fit your playstyle.   Best card game out there digitally I have played yet, especially if you want to enjoy it for a while before deciding to invest money. I have broke down and bought some packs and platinum, but it really doesnt feel like you have to since ive built some really good decks just by playing the campaign.   If you ever played magic duels of the planeswalkers 20 something years ago in shandalar and liked it, you will love this. If you didnt, you will probably still love this.",
            "review_score": "1"
        },
        {
            "review_text": "Would be flown to California all expenses paid and win $40,000 again. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "I backed this game years ago during their kickstarter and im still going strong and still playing. There have been shaky times and rough edges quite often but in the end I still believe in the dream. Hex is a great game and will hopefully be around for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: As of 4/22/2016, Plat pricing on the steam client is now in line with the standalone!  Dont let the game time fool you, I've put a ridiculous amount of time into this game since last september.  Hex got me hooked almost immediately. As a long-time MTG player (started around 1st Mirrodin block) I was able to pick up the basics of the game fairly quickly. But even now I'm still discovering new card interactions and ways to play. Don't get me wrong, I adore Magic, but I've drifted away from the card shop scene, and Magic's digital offerings are completely garbage. Hex, while fairly similar to Magic in many ways (part of the appeal to me imho), has enough uniqueness to both set it apart from Magic and elevate it in many ways. Hex fully embraces the possibilities of a digital-only card game, and I can't wait to see what Primal Dawn (set 4) will bring to the table.   ---  Pros: -Digital nature allows for some truly bonkers card design. Super fun! -Collection has real value -PvP is competitive and fun, even though I still suck at limited :P. Will be even better once ladders are implemented. -PvE was a blast my first time through, and I still keep coming back with new characters and decks. Lots of potential. Wish there were more character slots though. -Legitimately one of the best communities in gaming. You run into the occasional salt factory in pvp every so often, but most people are super friendly and willing to help out newbies. When I first started people were giving me tons of tips that really helped me learn the game. A few players even sent me cards to fill out my collection some more! Now that I'm a more established player I've been doing that myself. -Dev team listens to players and are very passionate about their game.  ---  Cons -A little bit more RNG than I'd like in some of the card designs. -Devs can be slow to release content and are a bit afraid to post release dates for content, which is a source of frustration among the community. I'm sympathetic, and the devs are definitely making an effort to improve this, but this could turn off some people.  ---  A note for new players: Presumably due to the cut that steam takes out of sales, you get about 10% less plat when purchasing through the steam game client than you would in the standalone client or on the website. I would recommend players to go to  us.hex.gameforge.com,  visit the 'my account' page, and click 'top up on plat' for any plat purchasing. More money for Hex Ent, more plat for you, everyone wins! (cept steam)  ---  Some new player resources:   fiveshards.com  - Articles and podcasts almost daily from some of Hex's best players. They also host free constructed weekly tourneys, which are great fun.   hexmeta.com  - Up-to-date decklists and other info on the hex constructed scene. A great resource for keeping track of the constructed meta.   hexprice.com  - Price tracking and history for just about any tradeable item in Hex. Great for those looking to get good deals on the AH.   hex.tcgbrowser.com  - Probably the site I use the most. You can set up an api to import your card collection and automatically maintain a wishlist/tradelist that syncs as your collection grows. I make tons of trades using this feature alone. On top of that you can look up any card in the game, brew decks and analyse them, and view tons of player decks for both PVE and PVP.   hexprimal.com  - You can buy or sell cards/equipment here, and they periodically post articles about the hex economy and guides for PvP and PvE decks. Highly recommend their pve campaign series for new players.   hextcg.com  - The official website, with regular contributions from the community and updates from the dev team. I check it daily!   board.hex.gameforge.com  - The official forums, very active! You can find just about anything you could want here.   twitch.tv/hextcg  - Hex has a great community of streamers! Dinotropia, SilentSnake76, Sithos, Alucard, infam0usn3o, and many others stream regularly and are very welcoming for new players!  ---  That about sums it up! For any new players, feel free to message me ingame (IGN: Stigro) if you have any questions! Welcome to Hex! :)",
            "review_score": "1"
        },
        {
            "review_text": "HEX: Shards of Fate released to Steam and met with mixed reviews.  Since the release Hex has improved in several ways: 1. Increased the rate that they introduce new sets of cards. 2. Implemented the ladder ranking system for both limited and constructed formats that allows you to earn rewards. 3. Started a new Socketable Gem rotation, adding new ways to play even older sets of cards.  If you were on the fence about Hex, I suggest you give it another try.  Starting again now, you can easily be prepared for the lauch of 'Adventure Zone 2' the next stage of the games PVE element.",
            "review_score": "1"
        },
        {
            "review_text": "Having been a long time TCG player (MTG since Arabian Nights!), Hex has brought to the digital space an amazing new take, being able to do things with card and game mechanics that just aren't possible with a TCG that also has to conform to a physical card game. Add to this the new PVE content which fits my solo play style, and I've found my heaven.  While technically this is a free to play game (and infact you are given a good number of cards by completing tutorials and playing the PVE campaign), if your goal is to complete in constructed PvP, you will likely end up spending money or time. However, there are also limited PvP competition options, like drafting (where everyone is on the same foot, only relying on knowledge of cards, deck buidling, and lady luck in what is passed/opened), or swiss style where you open packs and create your deck from that pool.  Over all, while I still play other games, this is my go-to when it comes to TCG's. I highly recommend giving it a try, since you can try for free. Play through the tutorials and some of the PvE campaign to get a feel and aquire some free cards and in-game currency (gold). Before jumping into PvP, watch some of the many Twitch streamers for draft pointers and to get a feel for the game mechanics. And if you have questions, ask in chat. The community is awsome and loves to help out with whatever info you might need.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing HEX since the release of Frost Ring Arena (2 PvE updates ago now) as a strictly F2P player. In that time, I've racked up a collection of rares and legendaries worth about $500 without any special effort to min-max, or to play the Auction House (player market). Since this is a proper *Trading* Card Game, (not merely a CCG), that $500 isn't an idle figure, either - if I wanted to cash out tomorrow, I could cover all my utility bills for a couple months!  'So what,' you say, 'it's $500.' And you're completely right! I could have made more in a minimum-wage retail job for the time I've spent on the game.  But I haven't been slaving away at minimum wage; I've been having an absolute blast with the most innovative card game available today, filling up all 10 character slots available right now with max-level characters spanning 8 races and 3 classes, participating in both official and community-run tournaments, and opening dozens and dozens of packs... all without dropping a dime!  Check out HEX today! The only regrets will be those of your other virtual card games, which will wonder where you disappeared to.  UPDATE: Nominated for the 2016 Steam Awards for 'Best Use of a Farm Animal' - Let's be honest, not a *huge* category, but I defy any of you to find something better than the 'Llamafy' spell in my game library =P",
            "review_score": "1"
        },
        {
            "review_text": "This is like playing Magic without physical limitations. For an avid Magic (or other TCG) player, this is easily a better client than MTGO and one of the most accessible ways to get your card playing fix outside of a friday night. Yes, the PvE is still in early mode but it's not like MTGO even has that.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really good and fun. It reminds of MTG with abilities and leveling your champion to get talents that will add a new layer of deck customization. No problems with the aspect of being a F2P with in game purchases as it all is also available via normal playing in a fast pace. The real thing is, althought they have a fun and full of prizes campaign mode, the game has a great focus on the multiplayer aspect (something that was lacking in MTG).",
            "review_score": "1"
        },
        {
            "review_text": "The bad reviews for this product are a bit perplexing. Compared to Hearthstone, Magic 2015, and MTGO, this is, by far, the most comprehensive, well designed, feature packed, and entertaining TCG available. There are dozens of hours of campaign content; all free and much more immersive than anything hearthstone has produced. There's a robust and active auction house where thousands of great cards are actively available; even with gold (the pve currency). You get card packs for doing pve quests which can produce rare cards you can sell for platinum (real money currency) so you could technically never spend a dime on this game. There's thousands of cards with interesting mechanics. The interface is clean, crisp, and very well designed. Again, this is without a doubt the best online TCG I have encountered to date. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked MTG on the table but hated it online, you have to try this game out!",
            "review_score": "1"
        },
        {
            "review_text": "I kickstarted HEX day 1 and been playing since first day of Alpha. I come from a TCG background, mostly MTG and WOW-TCG.  For me this game is everything Hearthstone and Magic Online is not. Hearthstone has to shallow rules, Magic Online is unpolished and expensive. Don't get me wrong, decks in HEX can cost a bit of money. But a draft is around 7$, compared to about twice that on Magic Online. Cards hold value (some are 30+$) and I feel like I don't loose the money I invest like I did in Hearthstone.   Competitive play is good in HEX. There are drafts fiering often, Gauntlets doesn't have waiting times that are to long. There can be a bit of wait during off-times, but on primetime you can get your competative fix quickly. There are also free touranments with 100+ players each weekend (confirmed for at least 2 more months at the time I'm writing this)  The game has problems. The developer, HEX Entertainment is new with developing games and it shows. There are bugs, and have been delays in features. But one thing they have shown throughout the entire lifetime of the game is that they want to do right by the players. Another thing is the passion. You can feel how passionate the developers are when playing.  The community is probably one of the best I've been a part of. Most are friendly and might even give away commons and uncommons to new players. This game is the closest you can get to a paper TCG and by far the best digital card game around!  I hope to see you in game^^",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Digital TCG out there! It is very deep, with many cards and infinit deck possibilities! ..and the art of the cards is amazing!  You have constructed, draft tournament format (with more to come)  You have a real nice singleplayer campaign were the devs put a lot of effort into.  You also get the frostring arena (mostly to grind gold)  Its free to play: Yeah you have to grind a lot (really a lot) to get good rare cards or booster without spending money,  but that's ok the the collection gets a value because of that!  You have a auction house where you can sell everything except sleeves!  And its a real TCG not a fake one which has trading in its name but no way to do it! You can send cards to friends or anyone and trade what you like!  I loved this game from the start!  And there is much more content to come beside new sets! (New Formats, Guild stuff, other tournament formats and much more!)   ",
            "review_score": "1"
        },
        {
            "review_text": "Great game.  Fun gameplay, similar to Magic: the Gathering.  Nice music and atmosphere.  Various single and multiplayer modes including a campaign mode and draft based tournaments.  Great community as well, the more experienced players are very helpful and are willing to give advice and free cards to new players.  The IU is also really nice looking Its also way better than anything MTG related on steam.  If you enjoy card games or want to get into one, give this one a go.",
            "review_score": "1"
        },
        {
            "review_text": "Kickstarted this game it's a fun mix between a TCG and an MMO No regrets on kickstarting it at all.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand why the reviews for this game are mixed?   PRO: This is a fantastic card game. I'm an avid MTG player and even this has me putting MTG down. And everybody saying that it's not f2p needs to calm down. If you played any other 'free' TCG you'd understand that yeah i'm going to have to grind to get some cards. But you start out with an immense amount.   CON: I will say the one con is that I wish I could play ranked or something similar without having to front cash for tournaments. I definitely love that there is that option, but I still want free ranked.  Also, the auction house is the most abysmal slow/delayed thing i've ever used. I LOVE that there's a TCG auction house, but damn it's so outdated, unless you know the exact card you want and search it to deal with as little delays as possible, it's not worth using.",
            "review_score": "1"
        },
        {
            "review_text": "If you come to HEX for anything (which there is tons to appreciate; rich backstory, complex yet intuitive deisgn &amp; gameplay, etc etc.) come to it for the community. People here are just insanely amazing, moderators are actively around along with Nobles and the outreach of player base trying to help one and other do well is something beautiful in itself.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game since the beginning when it was in Alpha. If I had to describe Hex in one sentence I would say, It's the most frustrating and rewarding experience I've had with a video game. My biggest complaint has always been a lack of content in a timely manner.  Fortunately for all the new players who find this game on steam, you will hopefully not have to experience the growing pains from the past.  Hex is a TCG and the first thing I would ask anyone is please don't apply what you know about Hearthstone to Hex. If you are bored of Hearthstone and want something with more depth, then Hex is the next perfect step. It has multiple offerings for people into any and all things; PVE campaign and Arena for people interested in a free to play experience and Limited Drafting and Constructed for people who are willing to invest some money into Hex. If you have no idea what any of those things are, feel free to ask in client chat and you will be amazed at how many people will be willing to help you.  Whichever you are interested in, give Hex a shot!",
            "review_score": "1"
        },
        {
            "review_text": "Want to play MTGO on Steam but with far better interface / technical support and half the price? Now you can!",
            "review_score": "1"
        },
        {
            "review_text": "Solid. A fun card game that will be very familiar to anyone familiar with MTG.   A lot of the mechanics are fairly unique and would only work well with a PC version of a card game - the art is wildly varied and pretty fun to look at. The decks feel familiar with regards to color, but also do have their own bits of nuance.   Most of all, though, I personally love the addition of a 'character' atop it all - complete with talents and equipment that affect your cards, troops, etc. Clerics are biased towards blessings and buffs, Mages are big on actions/instants, and Warriors bolster troops nicely.   There's also a seemingly pretty robust single player campaign, which rewards you with cards and boosters as you go along - and they don't appear to be totally static as far as what you get.  My only complaint is some of the UI/click actions are a hint delayed feeling and sluggish, but that's really it. Again, the neat mechanics are what make it for me - stacking buffs to the next card of a certain type you draw, cards that scoot up in your deck as turns pass, creation of 'random' cards (any card, not just ones you own), etc.  There's also a nuance in their resource system - it's essentially like MTG with one big difference. In Hex, cards just have a flat cost, i.e. 4 'resource', much like MTG. In MTG however, you might need a total of 3, but two had to be blue. In Hex, you may only have gotten two blue 'resources', but all your resource is lumped into an overall pool, and the colors add a 'threshold.'  Meaning that if you had gotten 2 blue and 5 white, you'd have a total of 7 resource, with a 5 threshold on white and a 2 threshold on blue. As such, you can cast two cards that cost 3 each, even if both require 2 blue, because you meet the 'threshold' amount for those cards. It's a subtle difference but it makes decks a lot friendlier to multicolor and you don't end up getting cornered by needing one more of a color or another as desperately. Most cards I've seen only need one or two threshold, so a multicolor deck can easily squeeze by with just one or two of a resource with a bit of bad luck far longer than you could in MTG!  All in all very fun, great art, lots of interesting mechanics. Solid recommend in my opinion!",
            "review_score": "1"
        },
        {
            "review_text": "Hex is one of the best Trading Card Games I’ve ever played; and I’ve played a ton of them throughout the years. I love the lore as well as their exploration of the digital space.   Hex is currently having some growing pains due to the huge influx of players but Hex Entertainment is quick to fix server issues. If you stick with it, you will be rewarded in the long run.",
            "review_score": "1"
        },
        {
            "review_text": "Far better and well supported for Magic Duels. This is very similar to MTG.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the kind of deep strategy you get in Magic: the Gathering then you'll like Hex  I've been playing since day 1 of the alpha so I'm under no illusions about the game being perfect - but it is a ton of fun (and way better than the MTGO client to boot)  When I was a kid playing MtG it was great but I never had any money to keep up, now not only are boosters / drafts cheaper than the MTGO equivelent but also there is all this cool PvE stuff I can do for free",
            "review_score": "1"
        },
        {
            "review_text": "UPDATED REVIEW: At the time of posting I am top 100 on the limited ladder and top 200 on the constructed ladder. I have spent less than $40 in over a year of playing. You can buy packs for about a dollar on the secondary market and use those in tournaments and if you focus and get good at the game you can do very well for yourself. I do not own any vampire kings or many other blingy cards but you can excel on the cheap if you use your head. Yes at the very highest level of play there are $200 decks, it is a simple matter of supply and demand, but the same applies to hearthstone or mtg.  Like in most games trading in the auction house is arguably the best way to go free to play, and you can do very well engaging in the gold trade.  The PvE is getting better over time and there is no limitation on what you can do. You can just get in game, ask around for cards, and start dueling with friends as well.   One last crucial bit, is to definitely go check out HEX on twitch. There are very helpful streamers that will happily show you the ins and outs, some of whom even give away valuable cards for free. The community in hex is very friendly and mature, I can count on one hand the number of times somebody was bm to me in Hex.  ORIGINAL REVIEW 4/23/16: Been playing for 9 months (prior to the steam release). Haven't put it down since.   Am something of a free-2-play success story, so trust me it's doable. It's slow the first month or two, but learn to use the auction house. Ask lots of questions. Watch streams on twitch to learn the game.  In 3-4 months, you'll be beating alpha players in constructed queue.  The game has a little bit of everything for everyone and can be both as casual or as hardcore as you want. The game is under ongoing development so there is much more to come (such as a ladder system), but there's lots of fun stuff to do already.",
            "review_score": "1"
        },
        {
            "review_text": "Seing that the game got a lot of negative feedback thanks to a rough start, i have to chime in: Now, i backed the game on Kickstarter, for a lot actually, and i'm still missing some features that made me back in the first place (Guilds, more PvE, Raids and the actual MMO aspect). Nevertheless the game at this point is very solid and in my opinion one of the best F2P Games. Now, you might have a different opinion what a good F2P game is, but for me its one where the developers actually can make money and the players and especially new players don't feel like playing a P2W game.  Now hex is a card game, and therefore you are only as good as your cards, and cards cost money. But hex gets around that by nailing the TCG aspect perfectly. You can buy/trade/sell your cards, your items and your packs, something i have never seen in a CCG/TCG game before. Blizzard for example would never let you trade your unwanted cards for free to other players. Hex does that! You can grind for gold, buy a pack from the AH sell it for plat and ... BOOM ... you never spend a dime but got the actually real world money currency in the game, and do with it what you want (pay the entry fee to a tournament for example)  So in short: The game still misses a lot of features that were promised, but they went with something that allows them to build a community and especially create a business model, and i respect that. The game is solid, the PvE is great fun, PvP is doable especially drafted tournaments. And you are in this game NOT limited by being a F2P player, except for the time sink.",
            "review_score": "1"
        },
        {
            "review_text": "The only reason I recommend it is that it's free, and the single-player campaign is enjoyable enough on its own.  I can't speak for the PvP side of things, because it would take a lot of free grinding to get to the point I have a deck that can compete. But, again, the game is enjoyable enough for free.  The main problem right now is you can't play. The game has been down two days in a row. But the fact that I keep refreshing it waiting to get in is a sign that it's fun to play.  EDIT: Game is down for the 4th time in 4 days... I do not recommend spending any money buying in-game currency until they make this game stable.",
            "review_score": "1"
        },
        {
            "review_text": "(There seems to be a limit to the length of a Steam review. I did not know that. Please see the comment section for parts II - VI)  ************************ PART I ************************  Hi, friend. Welcome. You are clearly interested in TCGs, or card-based games in general, so let me tell you a bit about HEX.  First of all, this game has only been on Steam for a few days, but I have been playing since 2013, when the game was in the Alpha stage, so my hours played are closer to 500–1000. And that is a conservative estimate. So I believe I am qualified to tell you a bit about this game.  Now, I am going to do this a bit differently. I will not try to cater to all players in general. I will speak directly to the players who are like me, because I would want to know about this game as soon as possible, and I will emphasize the points that made me fall in love with the game. Subsequently, this review will be long, because I would not mind reading a long well-written review myself, and I would want to know about all these features I will soon write about. Additional caveat: if you are not willing to truly immerse yourself in the game and properly learn all its myriad features and possibilities, this game might not be for you. This is not a very casual game. This is for true gamers who love complex mechanics and enjoy the incredible freedom HEX provides for the innovative player. Still here? Great! Let us jump right in.  Have you always been looking for that one card-based game that would finally have a good single-player campaign, where you can collect cards simply by playing? And better yet, the cards you can collect are not limited in any way, so you can actually collect every single card in the game. Are you tired of all these “campaigns” in card games, where the solo content is simply a series of text boxes? Are you fed up that you can only complete them once, and then you are pretty much forced to play PvP if you want any further rewards? Why do card games never really build a world where you can adventure, like in an RPG? You might still remember Shandalar (nod to older gamers), where you could actually walk around on the world map, do quests and buy cards from taverns. Why is that not ever attempted anymore? Well, your search is finally over. Enter HEX, the most ambitious card-based game that has ever existed.  First of all, I would strongly recommend you watch the video on the Store page, where you can see this strange bearded guy with glasses. That strange bearded guy is one of the biggest reasons you should invest your time in this game. Let him tell you about it himself. I will come back to this point a little later. Let us explore the game first.  HEX has two distinct sides. PvE and PvP. I will talk a bit about the PvP in the end, but quite frankly, that is an experience many other games provide as well. There are plenty of reviews out there that concentrate on the competitive side of HEX. I am not a competitive person, so I will mostly talk about how you can enjoy HEX without PvP. That is what drew me to the game, and if you are like me, that is the only thing you want to hear about.  HEX has well over a thousand cards (I do not know the exact number, but it might be thousands at this point). There is a robust Card Manager that lets you combine them however you wish to make decks, and let me tell you, you can make some pretty fun decks. I have a deck that copies and replicates troops named Time Bug that aims to give myself infinite turns with the card’s ability. I have an Insect deck that only has disgusting crawlies. I have a life gain deck that aims to win via getting as much health as possible. I have a spider deck that will bury my opponent in eggs that actually go into your opponent’s deck (not possible in any non-digital TCG). I have a burrowing deck, where all the troops go underground and dig themselves up at the exact right moment to kill my opponent (again, only possible in a digital environment). All the decks play completely differently, and all are incredibly fun. I am constantly coming up with new deck ideas. If you enjoy deck-building, HEX is heaven. There is no limit to the number of decks you can create, and I currently have approximately 112 decks. All completely different. Are you starting to see the scope of this thing?  There is an entire Campaign where you walk on the world map. You can choose your path and do quests and side quests and get to know the world and lore. You can delve into a dungeon, which are longer, story-driven locations with better loot. You actually create a character and choose a race and class, and every class has their own talent tree, like in a real RPG. These talents in turn change the way you play the encounters or how you build your deck. There are not many classes to choose from yet, but every PvE patch will add more content. That is what makes it so exciting. This journey will never end, as there will constantly be more places and characters to explore. Just like in an MMORPG. Speaking of MMOs, there will eventually be co-operative raids, where you will take on huge bosses with two of your friends in a 3-against-1 scenario. These will naturally drop the most epic loot. There will be guilds as well, with guild banks, where you can presumably loan some cards from other members of your guild for that one particularly nasty encounter.  But wait, there is more. You can also collect equipment for you cards. Think about that for a second. You can equip your hero like in an RPG. Equipment can drastically change what a card does, which in turn changes how you play with the deck. Guess what, your possibilities just doubled. There are hundreds of pieces of equipment in the game, and even I have not come close to testing them all yet. In fact, every single card will eventually have 1–2 equipment. That is a mind-boggling amount of customizability. Some of them do really wacky things. Some of them are a great help against a particular boss for example. I have won encounters simply by changing some of the equipment in my current deck. You can find equipment during your adventures as loot, or you can get them from chests after opening packs. Wait, what?  Yes. Every time you open a pack, you will get a treasure chest as an additional reward. Just for opening a pack. These are of random rarity, and can range from common to legendary. The chests can contain equipment or cards, including rarer alternative art cards, which you can either keep or sell to buy something else you want. You might not want to open a chest immediately though. You see, there is one more additional level of rewards added to the pack opening experience. You can spin your chests with in-game earnable currency before opening them. Spinning yields some of the best rewards in the entire game. Or you can just save your gold and open the chest right away. The choice is yours.  Then there are Primal packs and chests. Every time you purchase a pack from the in-game store, there is a possibility that it will generate a Primal Pack. These are insane packs that only contain rares and legendaries. Oh, by the way, did I mention that a HEX pack has 17 cards, so you get more cards per pack than in any other card game I know of. Primal Chests can only be obtained by spinning a chest and getting an upgrade. These chests contain some of the most sought-after rewards in the game, like extremely rare sleeves for your decks.",
            "review_score": "1"
        },
        {
            "review_text": "  I'm a TCG Player, and I like to be able to play it whenever I want.   For everyone that is saying it is a pay to win or pay to play, it is a much P2P as MTG, Pokemon TCG, or any other physical TCGs out there, even less cause is much cheaper. So stop complaining plz. Competitive deck in this game, cost between 20$ and 100$, competitve deck in MTG are over 500$, enough said.  Almost everything has been said in other reviews, i'll do a TL;DR version   Pros :  - Gem, champion and set rotation which makes the Meta in constant change. - I Like the 'digital only' mechanics of this game. - Champions w/ ability. - Cards equipment - Cards geming. - Campaign is awesome - Sealed Gauntlet limited format - Primal packs :) (pack with 13 rares and 2 legendaries) - Ladder - Auction house and mail system - Competitive Scene with 5000$ of prize pool every 2 months - Community Tournament supported by HEX Entertainment with tons of exclusive price. (Cards Alternative Art, Booster Pack, etc.) - New set every 4 months, new Adventure Zone in between. - PVE has now Boats and mercenaries which are awesome.  Cons : - Slow development (Edit: Getting faster now, since the fundation of the game is almost finished)",
            "review_score": "1"
        },
        {
            "review_text": "The best TCG out there, thought it can be a bit intimidating to new players. Start off in the PVE mode and play around a bit to get a hang of the mechanics, and be sure to ask in chat if you are not sure how to progress - people are always willing to give some advice!",
            "review_score": "1"
        },
        {
            "review_text": "Short Review:  This is a great TCG with interestingly designed cards and a unique PvE mode that is finally starting to grow into its potential.  Detailed review:  Hex is a 'full depth' card game with a priority system that allows you to react to almost everything your opponent does with any quick card or power. There is a lot of fun and interesting card design, many of which exploit the digital nature of the game (i.e cards whose effects would be painful to nigh-on impossible to keep track of in a physical card game, but which work fine in a digital space as the client does all the book-keeping for you). A good example of this is a fun deck archetype which can implant large numbers of different types of eggs randomly in the opponents deck, which spawn spiders for you when drawn (or milled).  A unique side of the game is the PvE, where you have a character who levels, with various skills to chose which have various effects on your deck, or give you various powers you can use while in battle. You build a deck for your hero, using any of the normal PvP cards and also a wide variety of PvE only cards, which are allowed to have slightly more wild effects. In addition, you can equip your hero, with each equipment improving one specific card in your deck. This allows an incredible variety of deck ideas to be explored, which is one of the most fun aspects for me. Until now this mode has been a little underdeveloped, but is now really starting to take shape with a much larger campaign and the addition of mercenaries. You can choose a party of them to accompany you on your travels and build individual decks for each (utilizing their unique powers), and use either yourself or one of your mercs to play with when trying to beat an encounter.  The client has had a few problems in the past, but is pretty solid nowadays. I'd highly recommend this game to any card game fans, but in particular those who enjoy coming up with and trying out new deck ideas as the PvE side provides so many more crazy deckbuilding possibilities.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun. I really like the PvE side of the game.",
            "review_score": "1"
        },
        {
            "review_text": "definitely worth playing if you like magic the gathering. this game is much better than hearthstone though  pros - amazing game, very well done  cons - marketplace could use some work. would rate this game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing HEX for 7 months now ( I have LOTS of hrs on the standalone client) This game is amazingly fun, the Community is awesome. ( I have made good friends) I play both PVE and PVP. It is pay to compete yes but it can be done as a Free To Player... Grind gold and sell it for Plat in the Trade Chat, and buy cards with Gold. I have 30.00 in the game and done the rest by Winning twitch giveaways, trading cards and nice people have gifted me cards as well. AZ2 is comming soon as well.  My IGN: RandomInSociety  Plus I stream HEX: When I feel well enough to stream lol  My twitch is the same as my IGN.   &lt;3 Jen",
            "review_score": "1"
        },
        {
            "review_text": "If you have ever played a TCG before, you probably have the basics down. This game offers that and so much more.  The community (at the time of this writing) is very friendly, helpful when questioned and overall a good bunch of people.   the game itself though is where things shine.   with the release of the PvE Adventure Zone 1, new ways of obtaining Gold and Cards are available. If you play through as one race and class and get to a point where you are a bit stuck, create a new champion and go through a few of them. Just by playing the storyline you are granted packs which contain very useful items. If they aren't useful to you, the Auction House or the Trade Channel can help you find a way to trade/sell it off and get something which pertains to your deck in question.   Once you get some strength, you can then take on the Arena. A gauntlet match of 20 boss fights, lose 3 times, and you have to start over, but every 5 fights you qualify for prizing.   There are three big reasons to do these events. Cards, Equipment, Gold. Not to mention the fact you get to learn a bit more of the game as you go. Got a dungeon your deck doesn't work for yet? fine tune it with different cards. You may have to change things up to win these encounters.   Plenty of replayability, specially with the different race/class types.   The PvP events are a lot of fun to do as well. If you do want to Draft, start off with the 'Swiss' version, this lets you play all the rounds and you can learn a bit more of the cards. Once you are confident, go on to the Competive modes which are single elimination with a bigger payout.   All in all, this game has been a blast to play since the Alpha, I just wish i could play more.",
            "review_score": "1"
        },
        {
            "review_text": "Best digital collectible card game out. As deep as Magic mechanically, better visualization and board functions than MTGO, release sets as regullary as you'd want, PVE available to grind up gold for packs if you want to play for free (there is a method for this), good draft formats including guantlets and enough of a playerbase so you don't waste your time in ques.",
            "review_score": "1"
        },
        {
            "review_text": "As a backer of this game, the potential here is limitless. Take elements of Magic The Gathering and meld them with the advanced gameplay mechanics that Cryptozoic has spent years refining with their modern card games. I highly suggest this game to anyone interested in something with fresh ideas!",
            "review_score": "1"
        },
        {
            "review_text": "Hex is a fun to play card game. It is worth to try it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a very cool blend of RPG and TCG.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing the game since the alpha release. I backed the kickstarter, with the idea knowing what that entails. Because of the similarities to MtG immediately pulled me in to play the game. I can now say after playing countless hours in the game, (obviously before steam), that it is totally a blast. Though some people may argue that they deliver content at a slow pace, and that may be true, but I would honestly rather a more polished product if it means taking a bit more time. All and all, a great game and I look forward to the future content this will have to offer. PVE is fun :)",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing Hex: Shards of Fate since alpha and haven't stopped enjoying it since. I am a father and now play games casually, unlike when I was in college and could play days on end. This game really makes me wish I was back in those days! This game spoke to me because of the ability to have a variety of options to play this game. I have always enjoyed collectable card games but never had anyone to really play with, so they always fell to the wayside (Magic, Star Wars, Pokemon, Warcraft). When Magic went online, I just couldn't get back into the game like I had once before, feeling it would just take too much time to learn the online mechanics. Hex felt streamlined and I was able to get right into the game without even going through the tutorial. I liked that it also added in a PvE element into the game. I have always enjoyed PvE in games more than PvP, since I can play at my own pace that way, but I have actually enjoyed the PvP in Hex just as much, and sometimes more, than the PvE. I like the challenge is provides when facing an opponenet, the complexity of the interactions between the cards and the dynamic gameplay that it presents. In PvE and PvP, there are always differnt ways of approaching your opponent and Hex sets it up for you to do so.  There is always an occasional frustration when things just don't go your way, but while I may not like it at the time, I always reflect that it is not always the way it goes, making it realistic in my mind. Makes me enjoy the times I do best an opponent and be able to share a good win with a community member. The community itself is amazing as well and helps make the game even more enjoyable. You have a lot of helpful players out there who offer advice and tips for playing. I relearned my TCG mechanics and lingo from streamers and learned how passionate people were about the game, like myself. I see myself playing this game for years to come and looking forward to all the incoming content for the game. If you like to play any games with cards, you will surely enjoy this one.",
            "review_score": "1"
        },
        {
            "review_text": "Hey guys I know this says I only played the game for 30 seconds but I downloaded this specifically to write a review. I have an account on the original Hex TCG place 'MountZion' you can look me up. I have been this game since kickstarter and wanted to share my 2 cents.  I have loved MTG growing up and played a little of MTG online during college when it first started. Yes I am a little old.  This game is the best version of an MTG online out there. The PVP is phenomenal. Yes you need to pay real money to play PVP but trust me drafting is one of the best TCG experiences out there. My mind was blown when I first learned about draft tournaments and how to play it.  If you are looking only for a F2P single player game, than this game can also be for you. So pleases give this game a try and just understand what it is. It is a serious, deep and well made TCG game with MMO ish aspects.  Give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "This takes me back to Jyhad.  Great art direction. Looking forward to getting into this CCG.  Great Music.  I like the addition of the quick play mechanic, where you can add effects during attack phase.",
            "review_score": "1"
        },
        {
            "review_text": "Playing HEX from day 1. I barely touched any other game since then.",
            "review_score": "1"
        },
        {
            "review_text": "I've seen some prices in platinum equivament to MTG standard. This is by no means a cheaper alternative to MTG but a lot of content is completely free. I have been playing the campaign for 24 hours and i'm having a lot of fun. I suppose most of the negative reviews come from people who have never played a real TCG.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, finally some thinking required.",
            "review_score": "1"
        },
        {
            "review_text": "Hex is an amazing digital TCG. While it does stand on the backs of other great TCGs, it still stands alone as its own game. Built from the ground up as a digital game, Hex is able to have many creative and new mechanics that a tradition TCG could never dream of implemening. Great game with a great community.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, borrows very heavily from Magic, but takes advantage of the digital format.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and free single-player campaign with a decent amount of PvE-only content, reminiscent of the old Microprose Shandalar game. The story is the bare minimum and dungeons are clearly designed to run repeatedly until you get all the rare drops, so expect some grinding.  The PvP seems difficult to access unless you're ready to spend money (haven't tried yet except 2-3 attempts at ladder), even though some players pretend that you can manage it by grinding the PvE campaign and Frost Arena.  The interesting thing is that in this game, you can sell your cards to other players on the auction house, so it's a true Trading Card Game not just a CCG.  Very low player count at the time I write this review, in some game modes such as Unranked I waited 5+ minutes to find an opponent.  I should also mention that the game client has bugged out on me several times (thankfully reconnecting to a match you started works well). The UI is functional but doesn't feel great, with key missing element such as a log of what happened in the turn, and resolution options are pathetic (no borderless window for a card game, seriously?) The whole thing is also badly optimized: graphics are occasionally nice but not cutting-edge, yet there is regular stuttering on a gaming PC that runs Witcher 3 on medium smoothly.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent digital TCG with trading mechanics not seen in other digital CCGs.   Great PVP with multiple weekly tournaments for money and multiple hourly in game tournaments for packs.  If you like TCGs give this one a try.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent digital TCG with trading mechanics not seen in other digital CCGs.   Great PVP with multiple weekly tournaments for money and multiple hourly in game tournaments for packs.  If you like TCGs give this one a try.",
            "review_score": "1"
        },
        {
            "review_text": "Best TCG for your money, hands down. Campaign has great replayability with zero investment needed and the competitive modes are varied and lots of fun with great payouts.",
            "review_score": "1"
        },
        {
            "review_text": "Been playing since January and loving it. It's like a better version of Magic the Gathering where they didn't ban the Urza sets and just kept going with the combo themes. Spider decks will make your hair fall out.  If you've played Magic, you've played something like HEX before. Not much else to add. It has a few twists due to being a digital TCG which allows for things you can't do in real life. NOT like Hearthstone. The campaign mode is fun and free, getting expanded every few months and will have 3-player raids in the future.  The closest game to this is actually the rather ancient game of Shandalar, a Magic the Gathering solo campaign mode from the dark ages of computer gaming. Look it up.  Tired of not having people to play card games with at all hours of the day and week? Then come play here. Replace your physical cards with digital ones, which still have real world value and can be sold for cash, and come play draft/constructured or PVE with a game not completely revolving around Legendary spam.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with many great ways to play. perfect for casuals and the more competitive player. highly recommended for anyone who enjoys card games",
            "review_score": "1"
        },
        {
            "review_text": "nicely made game but rngesus hates me",
            "review_score": "1"
        },
        {
            "review_text": "Its very polished and pretty impressive with the speed and fluidity of the turns. I backed the kickstarter and pretty much tried it in closed Alpha and wasnt impressed back then. It had alot of bugs and gameplay was slow. I pretty much forgot this game for years (quite literraly). When it released i relunctantly booted it up not expecting much and wow i was impressed with all the combinations and so much more content. Also the fact you can pve and get gear and level up your champion you create with different abiolties and skills.. its like a kinda light RPg which is nice and make sit personal to play and to accomdate your style. Its fun to get gear on your favorite troop and actually make it viable in the campiagn. Also there are right now 45 Champions to chose from for PvP and constructing your deck. All with different health and abilties, and its quite orginal and unique instead of the usual each person has X amount of health starting. The differnt clases are differnt too, Rogue,Warrior,Mage, Cleric, Warlock, and Ranger. All in all very impressed and have alot of faith and having lots of fun and im BARELY scratching the surface. As a long time MTG player, this defintly has alot of take from that but not in a bad way. Actually more like an 'Upgraded successor' to MTG with its OWN unique elements and an actual online interface program that WORKS and is fun,fast. I found no bugs so far and i have been TRYING to do everything possible to look for some playing with options and doing silly things. I did get disconnected twice in 2 differnet matches, BUT i simply rebooted the game and within about 20 seconds i was back and reconnected to the same game . ITs free to play, but give syou ALOT of cards and the fact you can do about 10-15 hours of Campaign you get even more gold and items/cards is great. There also will be Co-op campaigns in the near future which will awesome to work and 'raid' bosses or go on adventures/campaigns together with friends. I honestly have been so jaded with so many Free to play CCG games the last few years i ASSUMED this was going to fall to the wayside and be at worst 'Bad' and at best 'Mediocre'. Instead its Fresh breath of ingenuity and actual FUN!!",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: This game was everything I wanted out of a Magic the Gathering client. Then it added a boatload of MMO and RPG elements to the mix. Now it's something I didn't even realized I wanted out of a TCG.  Absolutely well worth a try.  PS: One day I will kill those bloody pirahnas...",
            "review_score": "1"
        },
        {
            "review_text": "good version of an mtg like game. The pve is also fun and fi you play through it you should have enough gold to trade some boosters and platinum for some limited expirience.",
            "review_score": "1"
        },
        {
            "review_text": "Not for me but probably good for those who like these types of games.",
            "review_score": "1"
        },
        {
            "review_text": "I love that game so much :) 100% F2P save my life !",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I really like playing MTG and I couldn't get into Hearthsone but i really liked all their visuals and sound. This game is a combination of the 2. You feel like you're playing Magic but with way cooler graphics and sound. I thought the card mechanics were fun and alittle different. Playing mana is basically the same but there are some really nice improvements. This is a great game if you like taking your deck solo thru campaigns and adventure. All the PvP modes and tournys are there too. Great game, really enjoyed it much more than magic. I am very surprised about the negative reviews, i dont get it. Cant wait for some DLC and campaigns. Well done guys!",
            "review_score": "1"
        },
        {
            "review_text": "Hex is unusual. It owes it's roots to Magic: the Gathering like almost any other trading card game, sure--but being digital-only has allowed it to evolve in complexity and provide more options than any other paper-based TCG.  The ability to sell or trade cards from your collection gives that collection real value, something that collectible card games like Hearthstone (which I also enjoy, but for different reasons) just can't do. Keeping watch on the card economy and tracking the value of individual cards is a game in itself for me.  You can engage in the same tournament formats that paper-based TCGs provide at hobby stores and game conventions, but from the comfort of home any time of day or night. This is a huge bonus for me, as I simply don't have the time to go to these events. As the game evolves, more formats (such as Evo Sealed) get added--and the game is constantly being updated.   Most of all, though--it's fun! PvP is fun, the PVE campaign is fun, it's just a well-crafted game. The card themes are clever and the art is just amazing. The world of Entrath is a compelling fantasy backdrop, and you can tell that a lot of hard work has been poured into it.   A note about the game mechanics: Hex uses a resource system that is similar to Magic the Gathering (although, IMHO, it's more forgiving), and the variable nature of it is enough to frustrate some players who want less random chance in their games. I personally don't mind it--it's just one more factor to consider when deck building, and the variance is just as likely to work for you than against you.   I've played hundreds of hours of Hex before it even came to Steam, and I expect to be playing it for a long time to come. As a former competitive paper TCG player, it scratches the itch quite well, and is much more convenient and less expensive than its competitors. If this type of game is in your wheelhouse already, you really owe it to yourself to give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "If you like card games, you will love this, my other half has been playng this for 2 plus years now, &amp; can't get enough of it. So the other week I thought what the heck lets see what it is all about then. I didn't even have my own Steam acount before then! I've not stop playing it since.  Ok I did get a litte helping hand to start with, a few cards etc but nothing I could not get by myself. He will not give me any of he's best cards! If you put the time in &amp; farm gold, cards etc, you can then buy what you want from the auction house. I almost spend more time on the AH selling/buying, than playing the game! The PvE campain is where to start, which I belive is about to be up-dated very soon. You can then move on too PvE, if you want too. All in all very good fun.",
            "review_score": "1"
        },
        {
            "review_text": "great game worth spending money on but it is free to play id give it a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like TCGs Hex has innovative and dynamic systems plus amazing PvE in AZ1 and AZ2 is just around the corner and offers a lot of gameplay",
            "review_score": "1"
        },
        {
            "review_text": "I'll start this by saying, 'I wish the rating system also gave a neutral/undecided rating'. With that being said, however, my balance would shift to recommending this over not for the simple reason of it is fun, it is strategic, the would be cool in pvp elements of pve cards, and a seemingly refreshing take on a genre that is all of a sudden growing exponentially.  No, I'm not an original backer, no I haven't been playing for years or even months, honestly, i picked it up over a weekend and invested a massive amount of time into the game, I shouldn't need to list my creditials by citing all the TCG's online or not that i've played, because they count for nothing in giving an unbiased review of the 'current' state of this game.  A lot of positive reviews, start off by comparing it to the table top era of TCG's because that is nearly how it plays, and i cleary mean that it hasn't evolved to incorporate gameplay concepts to reduce player input or speed up actions for quality of life purposes; for example: Being able to quickly use a card ability or dealing with having multiple, it would be nice to set an automatically use on opponents end step, or just by clicking or right clicking on the action itself to perform.  In diving into why this game was once glorified and continues to be pushed by the core populous, is what this game could/would/will be if and when they deliver on their promises and incorporated those features that would have and would even today, put an incredible spin on the genre. At this point it is little more than your generic online TCG. Equipment is a nice addition, but is severly limited outside of PvE, the RPG element of leveling and having a talent tree, and introducing something that could be an amazing experience is again limited to PvE only, but that portion is further limited to campaign only. Sockets again interesting and allow for a modular effect and can be used in PvP, it offers senergistic possibilities with cards, you may want to continue being in your deck, however they are lackluster at first glace, for instance a 3 drop 2/2 has a socket and can gain flying... across all TCG's that is a very generic normal 3 drop, but as stated it is modular, so it can crossover into different deck possibilities, with the same card, for instance gaining the ability to attack on the first turn, attacking with the troop will give it +1/+0, damaging a player makes you draw a card, a few others i won't mention.   I do love TCG's. I do enjoy the time that is spent, however if you have short attention span and want something quick and fast paced this isn't it, you sit down for a game of Hex be ready for 15+ mins or more depending on skill level of time per match.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Bearded Princesses",
            "review_score": "1"
        },
        {
            "review_text": "cards man",
            "review_score": "1"
        },
        {
            "review_text": "Update 12/9/2016:  So I've played this game since alpha and invested hundreds of dollars into, and for the first time since this game was open to non-backers, I am tenatively moving my recommendation from no to Yes.  The (Still) Bad:  To be clear, two of my biggest complaints with the game remain, the game is still extremely expensive, and the AH ,which could have helped to mitigate that, is still so outdated (surpising for such a new game) and a chore to use that it ends up serving the opposite purpose, making it feel, at least for me, both considerably more annoying and considerably more expensive to collect the cards I want then in digital card games with no trading but a discenchant and craft system. Whether or not you want to argue that this game can still be played F2P or not, if you want to get even close to everything, you better be willing to spend in the thousands of dollars, and if you just want one really good deck, you better be willing to spend a couple hundred dollars, then go back to having nothing when key cards from it rotate out. Its business model at its core is still a less easy to ever cash out MTG model and the primary thing that always kept that game niche was the price point so they've forever limited themselves to the same niche of players it seems.  The (New) Good:  But enough doom and gloom retread, what has changed that's made me finally recommend this game? Well for one, the PvE content is finally taking shape. The second chapter is live, and with it, there is finally enough meat to PvE for me to recommend this game to some one for whom PvE is likely to be the only format they'll ever really want to play. It won't sustain you forever, but it feels like a enough to be worth your time instead of ending abrubtly just as it was starting to get good as it had before. Whats more, a number of the core frameworks of the game are now live, such as account leveling and the mercenary party system, which combined with the already very creative and cool equipment system I feel really seperates Hex from other similar DTCG and make it a worth while and unique DTCG experience.  I should note that the game still is MTG at its core, the gameplay and rules aren't just inspired by MTG, they were flat out lifted from it with only the most subtle of changes here and there, and whether or not thats a good thing to you will be determined by whether or not you like MTG, HOWEVER, they HAVE finally made another huge change I've begged for for years which has improved the gameplay experience exponentially in my estimation. For the first time, the game makes use of the digital medium to reduce the rate of outlier opening hand draws. Basically, whatever the most likely number of shards (lands for MTG players) you are to draw is based on your deck composition, the system makes you more likely to draw that number and less likely to get really unlucky and draw none or too many. This has dramatically increased the number of matches which are not obviously lost at the opening hand, while still allowing them to keep in the Mulligan mechanic, since everything is still technically random, only the worst case scenarios have been reduced (though if you had a deck with only 5 shards in 60, it would actually make you LESS likely to ever draw them in your opponent hand since drawing a shard would be the unlikely event it would reduce but I think thats a good thing personally).  The (Still) Okay:  My last update to this review had been to talk about the addition of a free Ladder to PVP with rewards, and I still stand by the fact that this was an essential addition which will be very good for the health of the game long term. Unfortunately, in the short term, perhaps because of the size of the player base (or at least the ones interested in PvP), the ladder is a murder's row, where I've played numerous top tier decks in a row at the lowest ranking of said ladder. Unless your willing to spend money on limited formats, or spend money to build a top tier deck, PvP is probably not even worth your time, which is still rather sad.  Final Thoughts:  The game IS fun, both single player and multiplayer (if you can find some one of similar skill and card ownership, which unfortunately is pretty tricky right now unless your willing to spend big). And for the first time, I can say there's enough fun here for most types of players, that its actually worth recommending. It does stil have some significant core flaws, but if the AH is ever upgraded those may be mitigated at least a little. Will this game ever be a good F2P game, thats debatable, some might argue it is already, but I'm not one of them, this game feels like it expects you to invest at least a little to really be able to enjoy it. But maybe, just maybe thats okay, for the quality of experience Hex is providing if you do make that investment.",
            "review_score": "1"
        },
        {
            "review_text": "Before I begin my actual review, I have to say one thing. The creators of this game deceived people who financially backed them. According to comments made by the developers during the game's creation:  Hex was promised to feature feasible methods of attaining cards through pve. At the moment, packs and cards through the campaign are few, far between, and (seemingly) highly limited.  Hex was promised to feature group pve--which we were told was 'almost finished' a year ago. This was put on the back burner and the game launched without group pve.  Given that the game's philosophy has changed in favour of blatant money-grabs (despite the game's primary investors being its playership, no less) and given that this type of developer deception seems to be happening more and more lately, I'd feel morally obligated to give a negative review even if I felt this product were otherwise satifactory.  The single-player campaign (your only option for attaining cards without buying one of the lackluster starter decks or selling your organs, one by one, to roll the dice on randomized microtransactions) suffers from pacing problems. It's writing is nice enough, but there are so many encounters to get through any story arc. Each deck you fight is essentially the same as the last, with the only change being in your opponent's charge-based abilities. That wouldn't be so bad except 4/5 times an encounter's rewards are: 1/8 of a level and a handful of coins that have almost no value. Calling the Hex's grind tedious would be an understatement.  Hex's other appeal is as a clone of old school MTG and, I've gotta say, it succeeds on this front. The interface is very impressive and very clean, and I *would* praise it for offering a way to play MTG online with friends. The only problem is that anyone who's played MTG *knows* how expensive the habit can be. Buying packs is like the original microtransaction--but at least then you have a physical copy.  To bring that model online--to require your players to spend money for a *chance* to get 1 of the 4 copies of a card they need--is deplorable. It's one thing to steal a game's style to make it more accessible for people. You're still a thief but you're kind of a hero too, like Robin Hood. When you do it just to get a cut of the money, you're a thief and a scam artist.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, I really wanted to like this game, I backed the kickstarter, I put money into it since then, but it just feels like the company making it has tried to do way more than they have the capacity to deliver on.  It's been over 3 years now, and many of the features that people like myself backed this game for are still no where in sight.  Those features you think of for online RPGs, things like guilds, raids, proper levelling content, etc. Yeah, none of those are in yet. The current PvE content can be completed in 4-6 hours with a good deck and it takes Hex more than 12 months to add the same amount of content again.  In short, by the time the PVE side of this game gets anywhere, some other company which actually knows something about developing computer games will have probably come along and done it better.  It basically leaves Hex as an ok PvP digital card game, without much to distinguish it from any of the dozens of others floating around on the market. If that's what you're after them maybe give Hex a go, but I still think you'd be better of going to Magic or Hearthstone or one of the other smaller games out there than sinking time and money into this game.",
            "review_score": "-1"
        },
        {
            "review_text": "F2P? For a while. Then it becomes impossible without spending money. Game mechanics are good, but that's moot as it's impossible to proceed without spending thousands of dollars.  So your three choices are:  1) Play it for free for a while and risk that when it becomes impossible (and it's time to give up) you'll instead spend money you didn't intend and probably a lot more than you'd bargained for. 2) Pay to Play, and pay a lot. 3) Don't play at all.  Note that the difference between commons and rares in this game seems to be MUCH more severe than in Magic: The Gathering. Commons are very poor, so I estimate that it will cost you more than that (at a comparable level of set release), more than it's worth IMO.",
            "review_score": "-1"
        },
        {
            "review_text": "Three years ago, this game made a record-breaking 2.2 million dollars on Kickstarter, entirely because they promised to be  'the world's first real MMO/TCG' . Three years later, there are exactly zero MMO features. No raids, no guilds, not even a 2 vs 2 mode! There's only 1v1 and single-player, a far cry from the  'engaging, social MMO'  we were promised.  Instead, they've spent their time releasing new card-set after new card-set. Also, the game recently 'came out of beta,' despite missing nearly all their promised features, because being a beta  'is hurting our ability to attract new players' .  What this tells me is that they're moving towards becoming yet-another  Magic The Gathering  clone, set up to suck as much money as possible from their users. Don't get me wrong, I love MTG; but 'here's another MTG game' is not what we were promised, and not what we paid $2.2 million for.  Until Cryptozoic proves they're actually committed to making the game they promised to make, I'm avoiding this game, and I recommend you do the same.   [Edit]  I just learned that  (as of Nov 2015)  this game is published by GameForge, a publisher  widely known for ruining games  [www.trustpilot.com]  by using every scambag tactic to suck as much money out of their customers as possible. Just another reason to avoid this game.",
            "review_score": "-1"
        },
        {
            "review_text": "For now this game's campaign is unplayable. I'm new to this game and still trying to learn the ropes but due to the laggy server and freezes every now and then, that is not possible. It's kind of sad that a game's campaign would even lag, I haven't tried pvp yet but I can just imagine.",
            "review_score": "-1"
        },
        {
            "review_text": "Clone MTG and then change it just enough to avoid ANOTHER (yes they have already been sued once by wizards for blatantly copying all of MTG's mechanics) lawsuit from Wizards - this is Hex.  Positives: Nice graphics and card art. Good single player campaign. Cheaper than MTG Online. Pretty cool RPG like 'summoner powers' and equipment slots to augment your cards (pve only).  Negatives: TERRIBLE SERVERS - get dropped EVERY 5-10 minutes and have to relog...... Always online single player campaign. Name changes from obvious MTG mechanics feel cheap (steadfast = vigilance, speed = haste etc). Can't buy boosters with currency earned in game like in MTG Duels (technically you can, off other players, for 120x the price). PVP is 100% pay to win. The most obnoxious and annoying White Knights i have ever seen in any games community, literally blinded to any/all negative points about the game. Cards are supposed to have 'real world worth' as this is a tcg not ccg, but with no-one playing apart from the whales, there is no one to sell your rare cards to, so they end up being just as worthless as ccg cards, except you had to spend money to get them. Did I mention how bad the servers are?  If you're here for a free to play PVP experience then you're probably better off looking at Magic Duels as you literally never have to spend a single penny to have enjoyable PVP battles, unlike in Hex where it is a necessity, unless you don't mind losing 19 times out of 20. If you are looking for a (slightly) cheaper alternative to MTG online (not Duels) however, then you may have more joy.  If you are here for a decent amount of hours of free single player campaign though then you should have fun, again, if you can get past the terrible servers and always online single player that loses connection 3 times per game. A small saving grace here however is that the game remebers exactly where you were in your game and can take you back to that exact scenario. A negative point however is the dev's seemingly apathetic attitude to fixing any bugs etc that exist in the various PVE modes, why 'waste' money and dev time on the free part of the game right?  Oh and their 'RNG' is absolute rubbish, the last thing it is, is random. In any PVE mode it is very obvious that the 'RNG' is stacked against you, especially in Arena Mode, where you can draw 0 mana 5-6-7 times in a row or get a starting hand with 4 or 5 mana and then proceed to draw 4 or 5 more mana in a row. Now if this only happened once in a blue moon then it could defo just be down to randomness, but it happens ALL THE TIME, and therfore definitely NOT random.  Overall I cannot recommend this game! The server issues which still persist months after initial release will have you tearing your hair out as you will be disconnected from the servers every 2 - 10 minutes, because of this I have cancelled my monthly subscription and will probably hardly ever play this again, shame!",
            "review_score": "-1"
        },
        {
            "review_text": "It's a great game, i enjoyed it very much the few hours i could spend in it..not cause i lack time. Sadly the servers seems not to be ready to support the incoming wave of players from Steam, therefore the server (serverS as they said) keeps going down since i download it yesterday..atm im being waiting 5 hours to play today, still not able to.  On the other hand the game is great, easy learning curve (easier for those that played MTG), cool graphics and gameplay, and even better PVE quests/missions, a lot of cards and a trading system that makes easier to get the cards u need and sell those u don't.  IMO = 5/10 (It's a great game, but u need to be able to play the game, wich is not happening right now)..",
            "review_score": "-1"
        },
        {
            "review_text": "HEX seems great at first and then you realise its just another pay to win game. Pay and you get good cards, don't and you loose.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool game but it crashes all the time for me, every 15min or so. should be renamed to Crash:Shards of a Game",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot reccomend this game because I simply didn't enjoy it. It seemed as though I was getting no decent cards I could actually work with, on the other side, they were getting the perfect cards in order to ruin my day. Wouldn't bother downloading if I were you.",
            "review_score": "-1"
        },
        {
            "review_text": "Not the best first impression. Create an account and can't log in. This is 15+ hours after 'fixing' server issues. Then there the start up and title screen. Since I couldn't get past it I've had plenty of time to notice how un-optimized it is. It felt jaggy and had a slow down. I hope this isn't a foreshadow of what to come when I can finally sign in. For now I'm not going to recommend this game until this sign in fixed. Until I can't leave this reveiw as it stand until actaully play the game.  Now that I've had time to play the actual game I still got to give it a thumps down. It defintely poorly optimized. There are games out there with higher requirements the my laptop can play with no problem, but I have to hold down my mouse button until my action is register. I have to navigate to my group chat each time it fades away, still has bugs that break my perfect statagies, and forgot tring to use the steam overlay. All the slow down issue multiple tenfold. It a shame such a fun card game has these issues. I'm willing to give another try once they get their kinks worked out.",
            "review_score": "-1"
        },
        {
            "review_text": "Almost good game but crash every 2 seconds.  2stars only",
            "review_score": "-1"
        },
        {
            "review_text": "to slow",
            "review_score": "-1"
        },
        {
            "review_text": "Bloated POS Magic clone. No wonder there was a lawsuit and settlement.",
            "review_score": "-1"
        },
        {
            "review_text": "My first feeling: Hex's core is 100% based on Magic the Gathering. During first few hours I felt like I'm playing 100% MTG with deck full of commons from core set. This game is already like 'lets play for one week and uninstall it'. If you hate untested games with lots of minimal glitches you shouldn't download it! Just wait half year and then try it. It isn't friendly for lazy players. Many things are time-absorbers, minimal glitching, not important animations (if you dont care about them) which you can't turn off. This game have braindead inventions LOL, which are annoying, and which shouldn't pass beta testing. For me Hex can be very, very good in the future, but now I don't recommend it. Really, just wait half year and then give it a try.   + *Good if you're looking for something easy, and MTG is too hard for you. Maybe becouse MTGO isn't friendly for new players, unless you know a bit MTG. *You can upgrade card's art, I love that! *Cards and card's balance is almost 100% from MTG. Core of this game is based on MTG, one of the best TCG games so far. *You can pickup equips which can upgrade cards effects, also you can socketing cards. Idk how exactly this works, but I know there's sth like this.   - *Very bad music and sound effects. *Sound options doesn't work, you can only adjust master sound level. *Campaign is very monnotony. Like in most TCG/CCG games, I didn't found anything new or interesting here. *Campaign lore isn't interesting too. *Boosters can be bought for real money and for ingame gold but, the prices are 20k gold per pack, I played 5h and my gold balance is only 4.5k. So, this doesnt satisfying me. Maybe in late game there're much easier ways to make gold. *You can't turn off effects, so you have to wait 1-2 seconds to watch an animation 100th time, 1-2 sec isnt much but during one match there's many animations and they extend match lenght by 300%. So, this game isn't friendly for lazy players who doesn't cares about effects. *If both you and your opponent have many troops (mtg: creatures) on table you will be extremally confused with very bad made 'laser' arrows which shows who attacks who etc. Becouse of that sht you can miss many important moves during match. *Glitches or heavy lags, sometimes you have to right click on card 10 times to see it in larger version. *Very, very small font in cards what are in hand, so you have to right click them one by one to see larger version, this is waste of time. *In deck editor you CANT use arrows to rotate between cards, you have to right click them one by one, again waste of time, normally in other TCG games I need around 2 minutes to check 100 cards, here you will need 15min.",
            "review_score": "-1"
        },
        {
            "review_text": "I personally find this game not amusing at all. I find this game pretty boring looking at the fact that all the animations are dull and not that exciting. Thats what i disliked about the game, it just plays our super boring ( all of this is my personal opinion)",
            "review_score": "-1"
        },
        {
            "review_text": "This is Magic The Gathering with everything renamed. Oh, except it has a hero power, so I suppose there's maybe 3% Hearthstone in there too.  It doesn't play or look better than digital MtG either. You often have to click things twice for the game to react. The screen real estate is poorly used with much of the text and details tiny beyond miniscule. The years of development (probably) has led to massive gaps in graphical cohesion - some things are nice and flashy looking but others look like designs made in Powerpoint with default fonts and colors.  If you're new to TCGs you may enjoy the game, it's based on a much-loved classic after all, but I'd have to think the niche for this game is slim.",
            "review_score": "-1"
        },
        {
            "review_text": "No UI scaling option? Card text seems to be 'bitmapped' and it impossible to read at 4K resolution without zooming in on the card. Issues logging in ('parse error').",
            "review_score": "-1"
        },
        {
            "review_text": "15 mins strugle to create account (wich you have to create separately from Steam account - wich is ♥♥♥♥ing ♥♥♥♥♥♥♥♥ in a 1st place)  After my account created it self magicaly since I couldnt do it game fails to start and after it starts again magicaly it doesnt show the section for log in info to type in. At games internet site (wich doesn't work at all btw) you cant do ♥♥♥♥ 'cause its buged as ♥♥♥♥. So what do I think about game - I have no ♥♥♥♥ing idea since I can't turn it on,but from my my perspective comparion it to other TCGs - THEY ♥♥♥♥ING WORK and you can atleast start them. Developer team - you're morons. Nice game.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, Lame Cant say much more",
            "review_score": "-1"
        },
        {
            "review_text": "The game copies Magic a lot, many cards lack creativity. The game is too random, with needed mana cards and plenty of random effects.  A bad thing about the game is that there are no rewards for F2P PVP, so you have to grind PVE for cards or pay. This reduces the player count in PVP.  The UI isn't very good.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game, So-So Community. Terrible Support and Devs  Devs will ban you for any reason and payment system will lock your account sometimes. Yes, I was a K Backer.  PLUS GAME IS STILL    NOT FINISHED!!!!!     Buyer Beware!",
            "review_score": "-1"
        },
        {
            "review_text": "  Who made the tutorial for this game has autism. He is a complet moron that makes tutorial of 30 minutes of playing, and you can't do ♥♥♥♥, because they make you choose what card to play and when to atack, you can't do anything on your own, you are theyr ♥♥♥♥♥, so DO NOT PLAY THIS GAME IF YOU DONT WANT TO WAIT 30 MINUTES FOR THE TUTORIAL TO BE FINISHED.",
            "review_score": "-1"
        },
        {
            "review_text": "What a piece of crap game. Just another PAY 2 WIN game hidden behind the word FREE lol. I love their shills trying to say it's not. Just like all the rest you MIGHT can get all the cards for free but do you know how long that will take? If you don't PAY for good cards you'll never be competitive just like ALL THE REST. Cory Jones is a Joke. Trying to make you believe that it's so easy to get ALL the cards and it's not JUST LIKE ALL THE REST. Listen to him (trueist sense of the word. lol) You just try to be COMPETITIVE and I mean win 98% of the time with the crap cards they give you vs the good cards they will let you BUY!  DO NOT BUY....just another PAY 2 WIN game. :)  UPDATE MAY 17th....Spending a little more time with the game I've discoverd that the AI cheats beyond measure.....we're only suppose to get 4 cards of any one card and the AI can basically have any card it wants and in large quantities. It has a habit of playing 6 of one card in a row if losing. It also appears to go in the deck data file and pull the perfect counter card for the card you played. Many times when I'd play something it would play a like something and usually more than one. Flyers for instance. I've watched it play SIX cards in a row of the same card cause I eliminated the others and was winning. It played 6 spider cards that generate 3 spiders in your deck SIX times in a row one game in the prologue.  The game is a horrible grind with a frustrating AI. Oh it's beatable but the time it takes to beat it is the kicker. Spending 30 minutes beating it just frustrates to no end. I can see why they are doiing this now. The longer it takes and the more frustrated you get they HOPE you will BUY plat from the store to play in tournaments where the REAL pleasure of the game is located. But, making you take days to earn enough plat for one tourney is rather boring an unfun. The grind in the Arena and cheating AI is the same there as it is in the campaign.  So, in my opinion they want you to go through hell to make any plat. Frustration leads to two things...Either BUY PLAT and CARDS or quit.....I chose the latter. It's not worth my time to grind like this or the frustration. You're just wasting your time for really nothing. Even the tourneys are just money grabs if you don't have any plat.....You'll have to BUY it with real money. So, basically it's just like I said above a Pay to Play in the name of Free to play....yeah it's free to play alright but if you really want to do anything that is fun you'll end up paying to win/play.",
            "review_score": "-1"
        }
    ]
}