{
    "app_id": 410430,
    "name": "Morphine",
    "release_date": "2015-10-28",
    "developer": [
        "Kerim Kumbasar"
    ],
    "publisher": [
        "Kerim Kumbasar"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 24,
    "positive_ratings": 414,
    "negative_ratings": 138,
    "price": 1.99,
    "description": "An independent story-based cinematic FPS game describing the drama of a student 's. Story is based on experienced emotions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/410430/header.jpg?t=1480627221",
    "minimum_requirements": "OS: Windows XP, Windows Vista Processor: Intel® Core™ 2 Duo 2.4 GHz, AMD Athlon™ X2 2.8 GHz, or higher Memory: 2 GB RAM Graphics: Shader Model 3.0, 768MB VRam DirectX: Version 9.0 Storage: 3 GB available space Sound Card: DirectX 9.0c-compatible, 16-bit",
    "recommended_requirements": "OS: Windows 7, Windows 8 Processor: 3.0 GHz Dual Core Processor or higher Memory: 4 GB RAM Graphics: Shader Model 3.0, 1GB VRam DirectX: Version 9.0 Storage: 3 GB available space Sound Card: DirectX 9.0c-compatible, 16-bit",
    "reviews": [
        {
            "review_text": "Terrible Game  -Kerim Kumbasar everywhere, I get it. You are proud of your game. -Overly used Screen Effect where it doesn't make any sense -Lots of Bug -This is no Horror -Jumpscare with the jumpscare sfx and camera doesn't sync if you keep on moving your mouse during cinematics. Making the jumpscare a jumplaugh  +Graphic is nice atleast  I tried to give it a chance, play it as far as it will let me. Upon reaching a certain point where the ugly rabbit pushes me off to the abbys, the game crash. I will never run this crap again. The moment it crash is the moment I uninstall the game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a mess.  -English is terrible -Pacing is really slow in several spots -Final level the names of the protagonist and antagonist are reversed -Epilogue just recaps Climax and adds nothing  However, I believe everyone should play this game. Morphine is to gaming as The Room is to movies. It is terrible, but needs to be experienced to make the world a better place.  Also it is not a horror game. It has 2 jump-scares but I think they are mostly there because the author didn't know how to transition between scenes for the first half of the game.",
            "review_score": "1"
        },
        {
            "review_text": "That rabbit is creepy!",
            "review_score": "1"
        },
        {
            "review_text": "  Has anyone noticed that at the end of the game, the main character's name changes to be the bully's name instead? I really don't see how the creator missed that. So tragic.",
            "review_score": "-1"
        },
        {
            "review_text": "  its good",
            "review_score": "1"
        },
        {
            "review_text": "another ♥♥♥♥♥♥ game attempting to hit it big with ♥♥♥♥♥♥ scares that don't work.",
            "review_score": "-1"
        },
        {
            "review_text": "This time I'm not gonna be 'official' neither I will do review in that style.  Simply, for 7.5 bucks you get narrative physiological triller with scary elements here and there. It's long approx 1.5 hours, made in Unity engine yet a bit more different with more passion and feelings involved while developing which can be noticed even by casual gamer who played a lot 'unity' games.  Not sure are models in game custom made or bought, but atmosphere and concept of the story come before anything else so you dont really pay attention to that.   Basically from story/atmosphere/concept side game is pretty good, really makes you feel different and leave you with hard impression after beating game. Although from technical side there are quite few cons and problems which might get some gamers not to like this title. No voice acting at all, not impressive graphics although I've seen much terrible titles in Unity engine khm khm Rake khm khm. So based on both concept and technical side I would summary this under positive impression.  Game is dark, describing bullied kid and his world through his eyes and unfortunately well-known outcome in most of the situations where same thing happen. There are scary jumps here and there but dont expect regular horror style at all.  As developer Kerim stated, game is not based on true experiance but its based on true feelings. Were you bullied in school or not I think that you are going to imagine yourself on Peter place while you play this game and its gonna make you think a bit how those kids/persons feel in that kind of situation.  Overall, good job ! Also good pricing and not going crazy since game is longer comparing to some others.  P.S I did recieved couple review copies, but this is completely my thought and impression. I usually record gameplay/short review and I end the game, this time I completed game all the way till end without rushing and I didnt realized that 90 minutes passed. So good job.",
            "review_score": "1"
        }
    ]
}