{
    "app_id": 410890,
    "name": "Higurashi When They Cry Hou - Ch.2 Watanagashi",
    "release_date": "2015-11-13",
    "developer": [
        "07th Expansion"
    ],
    "publisher": [
        "MangaGamer"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Visual Novel",
        "Horror",
        "Anime"
    ],
    "achievements": 15,
    "positive_ratings": 318,
    "negative_ratings": 10,
    "price": 5.59,
    "description": "Higurashi When They Cry is a sound novel. The music, backgrounds and characters work together to create a world that is the stage of a novel for the user to read. They laugh and cry and get angry. The user takes the point of view of the protagonist to experience the story.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/410890/header.jpg?t=1552024969",
    "minimum_requirements": "OS: Windows XP Processor: Pentium III 800 MHz Memory: 512 MB RAM Graphics: OpenGL Compatible Card DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7 + Processor: Pentium 4 1.4GHz Memory: 1 GB RAM Graphics: DirectX or OpenGL Compatible Card",
    "reviews": [
        {
            "review_text": "My neck still itches",
            "review_score": "1"
        },
        {
            "review_text": "Compared to Onikakushi (which works as a standalone story), Watanagashi is less about personal psychological horror and more about digging into the mystery of Hinamizawa. The ending on its own is unsatisfying, but taken as part of a series, it's clearly leading up to a reveal that will cast the events in a new light on a second reading. Avoid if you haven't read Onikakushi and/or don't intend on reading the rest of Higurashi, but otherwise recommended.",
            "review_score": "1"
        },
        {
            "review_text": "You’re in a small village, Hinamizawa where an event takes place every year during June; and each event will always have a mysterious death, with someone going missing along with it. No one knows why this is…but it only happens each year after the event. Will you be able to find out who or what lead these tragic events?   Graphics: 7/10  The graphics are practically the same as the first novel, they have added nothing new here but that’s not to say that it looks any worse. It just looks exactly the same as the first novel. Although, there were a few different locations that were seen in this novel, but apart from that; the way the characters were drawn are the same.    Storyline: 8/10  Again, the story starts off very slow and gradually picks up around chapter 10. This time, the main culprit is actually shown and told in a very obvious manner (It’s pretty obvious once you get some ideas within the story). This ruined the mystery for me once I found out who the culprit was as the main character was still ‘not accepting’ the ‘person’, it got a little frustrating. Although, it is a still a great read, but I do prefer the first novel.    Sound: 6/10  Apart from a few different soundtracks here and there, it does borrow the same soundtrack heard from the first novel. They did not improve it in any way of form, but they also didn’t change it too drastically that it would mismatch the novel.    Gameplay: 9/10  Same deal with the first novel, you get the exact same options. In addition, there were no translation errors that I spotted which is a plus. However, as with the first novel the game crashed a few times, so make to save often to avoid losing progress.    Price: 10/10  With a base price of £5.59 it is worth significantly more than the first novel for nearly the same length. That’s not to say that this is not worth reading, this is a really good visual novel that is worth picking up if you want to read the 2nd chapter of the series.  ",
            "review_score": "1"
        },
        {
            "review_text": "Have you played Chapter 1? No? -&gt; Go play it. Yes? -&gt; ... Why are you reading my review? Go buy/play it!",
            "review_score": "1"
        },
        {
            "review_text": "I was surprised when I played this game. I was expecting either a prequel or a sequel to the first game but this is neither. Each chapter in the Higurashi series tells the same story, with a number of subtle things changed around to yield different events and outcomes. Apparently there are four such chapters, with those that come after explaining the mystery behind the previous stories. So far, it seems like you could play the chapters in either order, but I suspect they will have more impact if you play them in the numbered order and that was probably the intention of the developer.  Given how the series is set up, if you're reading this review and have played the first chapter already, you may be iffy about wanting to go through the same story again. But although the characters and setting are the same, most of the minor events and major plot points are different, and it gives you more insight into what might be going on in the town. In fact, it's different enough that it almost feels like someone wrote two different novels with the same premise, setting, and characters. Only a few things stay the same, and I had no idea what was going to happen until it was all over, even though I had read the first chapter.  If you've played the first chapter, buy this too. If you haven't and are interested in the Higurashi series, start with the first one.  In terms of the writing, I still think too much time is being spent on the cringe-worthy anime slice of life stuff. I understand that it is needed to help us get invested in the characters and to contrast with the actual seriousness of the plot, but it is still very badly written. I watch a lot of anime, and I've never seen slice of life writing that made me cringe as much as the stuff in Higurashi. But maybe that is because of the story's main character? His behavior at the end of the story is so unbelievable that it actually broke my immersion. So maybe the school life stuff seems everything we see is from the point of view of the main character?  Overall, it is a good visual novel and I recommend it highly. If only the school life portions weren't so childish and ridiculous...",
            "review_score": "1"
        },
        {
            "review_text": "Best cult classic anime themed novel series in my life.  추천한다.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  you will laugh, you will feel, and you will probably not be able to sleep that night. prepare your body for the answer arc",
            "review_score": "1"
        },
        {
            "review_text": "Creating even more questions than the previous chapter, you'll lovingly drown in the frustration of Hinamizawa's secrets.",
            "review_score": "1"
        },
        {
            "review_text": "Huge fan of this series and these games so far have been great. From the high quality character art to the translation they did a fantastic job.  For anyone new to this series or just this chapter, this is probably one of the darkest(trumped by the answer chapter later down the road.) The story does a really great job of luring you into a false sense of security with a calm and serene life in a small village playing with your friends only to blindside you when everything gets dark and terrifying quick. This series features a deep story with addictive characters all while keeping you unnerved and questioning everyone around you.  As someone who watched the anime first, being able to see what the main character is thinking that leads to his actions and choices through this game really expands on the overall story I loved.  Whether you're new to the series or not this is very much worth picking up, and I love seeing it on steam. Let's hope they get all the games here.",
            "review_score": "1"
        },
        {
            "review_text": "night lights are $10 on  amazon.com ",
            "review_score": "1"
        },
        {
            "review_text": "As far as thrillers are concerned, few video games make it anywhere near the skillful story weaving present within the Higurashi series. Higurashi When They Cry Hou – Ch.2 Watanagashi is yet another look into the Watanagashi mystery and makes us want to know even more. Not only that, but it provides even more aspects to consider as the associated deaths and disappearances now appear to have quite the different resolution. What is “real” between each of these storylines — what are they trying to reveal to players? The answers still aren’t apparent yet and that’s exactly what compels fans to read and re-read each tale. The wait for Ch.3 will be a tough one, but well worth it to get yet another look at the mysteries revolving around Hinamizawa.",
            "review_score": "1"
        },
        {
            "review_text": "have to write something",
            "review_score": "1"
        },
        {
            "review_text": "Keiichi Maebara digs too deep into a village's history and ♥♥♥♥s everything up again: Part 2",
            "review_score": "1"
        },
        {
            "review_text": "Fun chapter to play. In this Higurashi chapter u focus more on the mystery's of Hinamizawa.  Prepaired to get creeped out when the game starts to get into the creepy parts. One part in particular scared me. But I knew it was going to happen because I saw a walkthrough of this. In my opinion the new art was creepier than the other one I saw.  One thing I do want to say I wanted to slap Kei-chan soooooooo hard on the face. I won't go into details to avoid spoilers. But man some of the decisions he made where just stupid as heck:(   All in all beside Kei-Chan making dumb decisions this chapter was a lot of fun to play:)",
            "review_score": "1"
        },
        {
            "review_text": " Dive deeper into the dark.",
            "review_score": "1"
        }
    ]
}