{
    "app_id": 410850,
    "name": "DRAGON QUEST HEROES™ Slime Edition",
    "release_date": "2015-12-03",
    "developer": [
        "KOEI TECMO GAMES CO., LTD."
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 12,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "Action",
        "Hack and Slash",
        "JRPG"
    ],
    "achievements": 50,
    "positive_ratings": 698,
    "negative_ratings": 327,
    "price": 24.99,
    "description": "DRAGON QUEST, one of the most iconic RPG series from Japan, now comes to PC as a full-scale action RPG in DRAGON QUEST HEROES: The World Tree’s Woe and the Blight Below.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/410850/header.jpg?t=1549382635",
    "minimum_requirements": "OS: Windows 7/8/8.1/10 (64bit required) Processor: Core i7 870 2.8GHz or better Memory: 4 GB RAM Graphics: NVIDIA GeForce GTS 450 or AMD Radeon HD 5770 DirectX: Version 11 Storage: 20 GB available space Sound Card: DirectX 9.0c over",
    "recommended_requirements": "OS: Windows 7/8/8.1/10 (64bit required) Processor: Core i7 2600 3.4GHz or better Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 650 Ti or AMD Radeon HD 7870 DirectX: Version 11 Storage: 20 GB available space Sound Card: DirectX 9.0c over",
    "reviews": [
        {
            "review_text": "This game is just   fun.   I have a ton of fun playing this game. When I play this game, I smile. Many other games are fun. Dark Souls is fun. I don't smile when I play Dark Souls, though. I smile when I play Dragon Quest Heroes. Or any Dragon Quest game for that matter.  This game just oozes charm. The colorful graphics, the campy dialogue. Nothing is too serious in this game, yet I find myself growing fond of the new characters, and loving the iterations of all my favorite ones returning in this title.  The combat is fluid and hectic, but still requires a bit of strategy and thinking. Got to protect this location? Drop a golem coin while you push the front. Giant mech giving you trouble? Zap that guy with lightning, and wail on him while he's short circuiting. Getting creamed while you keep getting put to sleep? Craft a charm that gives you sleep resistance, then go to town.  It's a hack and slash game that requires just enough thought to where you can't completely zone out, but still laid back enough to where you won't be constantly frustrated. I love this game. And I think you should give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played this my mind was blown.  'Amazing'  I was like wow 'every interesting DQ char in one game. and in the first game too!'  Now let me be clear.  If you have come here looking for a standard dragon quest game, you will be dissapointed as this is a musou game. Do not play DQH looking for that classic DQ experience, this isn't that sort of game.   Also if you are looking for a multiplayer game. This game doesn't offer that experience either. Even though it look like one with the musou style.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic Warriors game in a DQ setting. Great graphics, many graphic options and runs flawlessly in 60 FPS. Certainly one of the better Koei Tecmo ports.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Simple, colorful, fun. A nice blend of Dynasty Warriors combat and classic DQ RPG mechanics. pros-good story -fun combat against the monsters -colorfull world cons-limited custamization",
            "review_score": "1"
        },
        {
            "review_text": "Do you like dragon quest games?  This is porn for you.",
            "review_score": "1"
        },
        {
            "review_text": "ok  now this is not a bad game not by a long shot but there are a few things i want to point out **Simple things take waaay to long to do** IT TAKES WAY TO LONG to do stuff, for example healstones, if you're trying to imbue your stones with healing powers you can't select all and do it no, you have to do it slowly ONE BY ONE and the  same goes for equipment bought at the armorer or orbs.  YUP if you have more than one character that uses the same type of equipment you'll have to buy the item ONE by ONE instead of... you know... buying all at once? everytime you access the church to imbue your stones you first select the stone, pay the required amount of gold, watch a boring animation with church like music playing on the background and finally you imbue your stone. Now do that a couple more times cuz you have at least 3 with you. gladly the animation only plays once that is... if you dont exit and reenter the church lol **QUESTS**  only played 5 hours but i can already tell that the quests are kinda annoying and low in variety. for god's sake this is a musou style game where you blast through hordes of enemies with flashy skills and movement  putting that in mind the quests are really stupid. for the majority of my short gameplay it was always about  protect the city gates, escort this guy, take this machine to that place don't let it get destroyed, protect the roots of yggdrasil.  STOP!! a little bit is ok but not EVERYTIME  you can summon monsters to block the path while you're busy killing monsters that come from the other side ( it's a cool system) but most of the times the enemies ignore you're summoned allies and start attacking the thing that you're trying to protect, so.... they are kinda useless.... making bodyguard missions very annoying. I hope the quests will gain variety as i advance to end game. (you can revisit areas and just kill everything in sight to get exp and items) **CONTROLS** the controls are bad if you're playing with a keyboard and a mouse.  i know this was originally a console ONLY game and these kinds of games are better played with a controller but this is PC! A LOT of players play PC only games so they do not have a USB controller in hand  and since you're putting this on PC... you guys should have changed the UI for better mouse and keyboard compatibility  i DO play with a keyboard and a mouse and i had a hard time changing the controls cuz everything is translated to gamepads. btw i played on playstation since i was a kid so to me the buttons are square circle X and triangle  not Y X A or some strange SHEET like that lol and that made me even MORE lost when i was setting up the game  that's all i guess everything else is good as far as i could see during my short 5 hours of my first day after picking this game up.  in conclusion this is a great game i definetly recommend it  but it could have been better",
            "review_score": "1"
        },
        {
            "review_text": "This game is my first Dragon Quest game and it is great all of the best elements of a hack and slash RPG with none of the hassles that ussualy come with a title in it's genre. Traveling to world is a breeze encounters / missions take place in large magnifcent looking areas combat is great you feel really powerfull with your amazing looking combos to rack up tension so you can go super sayain and really put a hurting on those monsters all while collecting there soul coins to summon and strategicly defend objectives or have them fight with you this game is a blast! I hope to see more titles in this franchise come to PC via steam and I just may have to pickup a 3DS XL to play the ones on there.",
            "review_score": "1"
        },
        {
            "review_text": "If you like DRAGON QUEST you will like this. if not you may not but it is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "It crashes sometimes, but it has auto-save after finishing it mission so... u should not have a big problem if the game crashes (i played for 7 ours and only crashed once)  I can only play windowed, and not full screen (or it crashes) Camera on this game is an issue, is too close up, too zoomed in, but u get used to it after 1 hour and a half. I had fun to be honest, and i only played dragon quest VIII. It doesnt have a very deep story, but sometimes u rather dont have too deep stories and have more action like this game. It reminds me of zelda but with spells! :D   I recommend if u liked any of Dragon quest games.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game to all Dragon Quest fans and lovers of action games. However, unless you have a rather powerful computer to play on, I must recommend you go for the PlayStation 4 version over this one.   This is my first 'hack-and-slash' kind of game, and I love it. I'm not sure if I would particularly enjoy just any game of the genre, but the alure of Dragon Quest is enough to get me to try anything once, and this was impressive enough that I'm already sold on the upcoming DQ Heroes II. However, since I do not have much other experience with the genre, I'm not well equipped to compare or contrast it with other games.  I can, however compare this version to the PS4 version, which I owned until recently (and intend on purchasing again when I can get a copy of the Collector's Edition). The requirement for an i7 processor seems to be irrelevant - the one listed appears to be on the lower end of the i7 scale. I'm about 3 hours into the game and haven't had any problems with my i3-2120 @ 3.3GHz. (I'm not an expert, your results may vary.) However, I was a little dissappointed with the graphical requirements. I had to fiddle with the settings quite a bit to get the game to run at 60fps on my machine, and even now it occasionally dips around 30-ish at 720p. (I'm currently using an Nvidia GeForce 640GT.) I had to drop all the graphical settings between the low and medium settings to achieve even this resolution and framerate. It's not quite as pretty as the PS4 version this way. But I'll give it this: It looks much more beautiful and fluid than the Japanese-only PS3 release, which is locked to 1280x720 @30 fps, with much less impressive textures and shaders.  One last thing to note: While I didn't particularly expect it, I'm still disappointed by the lack of native DualShock 4 support. Even though Sony has released official drivers for it, I have yet to find a single game that supports the controller natively (without treating it as a generic DInput device). Though I was able to get around this inconvenience using an XInput wrapper (the one I use is called DS4Tool), it's still annoying, as I figured a previously PlayStation-exclusive title such as this would be a good candidate for DS4 support. Also, the rather basic-looking XBox button prompts do the job well enough but look like they were just thrown in without consideration for how they look with the rest of the HUD. They'r rather flat, with a boring font and light colors, and look rushed. (This is also the case for the PC port of the Japanese-only Dragon Quest X... Looks like a pattern to me.)  I'd give the game a 10/10 overall, 8/10 for the PC port specifically.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Used to play Dragon Quest 9 on the Nintedo DS and when i saw this on steam i had to buy it. Its very different from DS game because you have levels to complete instead of travelling from town to town yourself to complete the story. In this game you complete levels after levels of killing monsters and saveing towns and villages. It brings back loads of memories when the classic tunes play. Recomend this to anyone who has played any of the other Dragon Quest games!",
            "review_score": "1"
        },
        {
            "review_text": "It's not as strategic as the main Dragon Quest games, but it is a lot of fun to play and sometimes even challenging.  The missions and quests can be tedious sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing for dragon quest/hack and slash fans alike. definitely recomend this game it is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "It's a buy.  Get it.",
            "review_score": "1"
        },
        {
            "review_text": "I seriously want to cry. Being a lover of the Dragon Quest franchise, this has been a sad experience. Don't buy this without a good GTX graphics card - my Lenovo Z50-70 has an integrated GeForce 820M chip with 600 and something MHz. Nowhere near good enough, my game ran at 10fps on the lowest settings. I'm honestly heartbroken and getting a refund. Please, however amazing this game may be, DO NOT BUY if your system isn't good enough!",
            "review_score": "1"
        },
        {
            "review_text": "So far so good. The beginning of the game is pretty linear, but the levels are still fun. I'm hoping that the game branches out a bit more after the first few stages (fingers crossed).",
            "review_score": "1"
        },
        {
            "review_text": "Pretty standard Musou affair with the best combat in the genre.  Looks and sounds and runs fantastically.",
            "review_score": "1"
        },
        {
            "review_text": "If your a fan of Dynasty warriors type of games this is the best one around and runs pretty good for the most part. Only notice a few frame drops when you first load in but it quickly fixes it self. Having a blast so far.",
            "review_score": "1"
        },
        {
            "review_text": "Must play for Dragon Quest fans Note: this is not a dynasty warriors game, it a really Dragon Quest game (action RPG game)",
            "review_score": "1"
        },
        {
            "review_text": "Dragon quest heroes is a fantastic action hack and slack with dabbled in bits for rpgs elements. The combat reminds me of dynasty warriors or Hyrule warriors and is really brought to life by Akirya toriyama's art and dragon quests vast monster library and lore :D",
            "review_score": "1"
        },
        {
            "review_text": "Good port from KT. Its Dragon Quest on PC, what more do you want.",
            "review_score": "1"
        },
        {
            "review_text": "Runs abysmally on my PC which should be able to eat through ANY CURRENT game you can throw at it at 1080p or 1440p 60+FPS. Frequent Crashes. Little to no help in the forums or online. Tried most if not all the 'solutions' that people were telling me to use with and does not work well. It seems to be the 'norm' for this developer to release half-♥♥♥♥♥ ports from PS3 and PS4 games, that is unacceptable. I do not recommend this game in it's current state and doesn't seem like the developers are going to do anything about it anytime soon (they haven't released an update since it launched and no words from the developers since DECEMBER. It's March 4th). Completely horrendous port of which seems like an amazing game and I am a fan of the Dragon Quest series I might add. Such a shame.  Specs: i-7 4770K GTX 980TI 32GB RAM Win 10",
            "review_score": "-1"
        },
        {
            "review_text": "Koei Tecmo finally got a game with 1080p 60fps, it's a start on something great. Next step is supporting newer resolutions (like 21:9 PLS)  Charming hack and slash with a cartoon aesthetic, and since it's Toriyama behind the character designs, ofc you can go Super Saiyan. Very polished, all the voiced cutscenes are perfectly lip-synced to the JP audio. Anti-aliasing needs some work, there are jagged edges.  Would be cool if there were borderless windowed mode on this. Also load times are kinda long, but that's about it. I bought this for the voice cast... like i always do AMIRITE",
            "review_score": "1"
        },
        {
            "review_text": "As someone who only has an Xbox One, PC has become a bridge between Xbox and PS4 games. This is a game that without a PC, I wouldn't be able to play. If you enjoy Dynasty Warrior type games, this is right up your alley! It even mixes in some tower defense like elements to keep things interesting. I've never played a Dragon Quest game outside of this, but have always wanted to. I found the story easy to follow and the characters enjoyable. It even has English and Japanese voice options depending on your preference (usually Japanese is the way to go in games like this, but I can't be bothered to read subtitles while in the heat of the battle).  Overall I feel this game was worth it. At $60, it might be a bit steep. But when it's on sale again, definitely pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "I really don't understand the negative reviews. I very much LOVE it so far, I guess because I'm a dragon quest veteran and have been playing the series since the dawn of time. I wish it was more open world like I anticipated, but nevertheless, still gold. Also, for those complaining about the game not working on their computer, the requirements that they gave was for an extremely low end computer. It doesn't mean it will run smootly. &gt;_&gt;",
            "review_score": "1"
        },
        {
            "review_text": "The game just doesn't work on Window 10 with an nVidia GPU. The game suffer major (over 1s freeze every 2 secondes) stutters right from the start (after the cinematic) and is juste not playable. I try to play with all the options and nothing seems to work. I hope that a patch is coming to change this, but it's very disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my money back for every other x-Warriors game I've ever purchased. This game pimp.",
            "review_score": "1"
        },
        {
            "review_text": "Help i downloaded this and it just frezeez straight i need help",
            "review_score": "-1"
        },
        {
            "review_text": "OMG THIS GAME IS SOOOO GOOD TO JUST FIGHT STUFF 10/10 BUY ITTTT ",
            "review_score": "1"
        },
        {
            "review_text": "This game will only be awesome if you are a Dragon Quest fans like I am. I like this game so much. It feels so much like Dynasty Warrior, with extra RPG and Dragon Quest touch. It's really fun to play",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun game but it needs updates just i was wanted to play this so much but it seems like the requirements are too high",
            "review_score": "1"
        },
        {
            "review_text": "This game is broken.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this with pretty high hopes, looked fun, had quirky graphics etc. Then I got in game... First off don't get me wrong this isn't a 'OMG this game sux if you get it I hate you' type of review, hell the combat in game feels pretty good and is the only reason I even want to finish the game.   One problem I think the game has is that it's so suited as a childs game that the difficulty is pretty low and many things in the game throw out logic that only someone of young age would ignore.  The mission system has its own problems as well, you go into a place with some objective (usually defend point A from wave of monsters or kill everything usually the defend thing though because the game is so easy that without something to defend you could broadway through every mission in no time) complete the objective and someone from the party will be like 'aw that was tough better rest at camp till we wanna go to the next thing' even if the next area is literally across the bridge where you ended off at before, not to mention they let you have areas in the cities that you have completed as grinding zones for no reason other than the fact that people you dont have in the party get almost no experience if any when you do stuff and thus fall way behind in levels quickly.  My last issue is the story, putting it bluntly it is really crap. to sum up what I've seen thus far with as little spoilers as possible (not that they matter in this game -_-) People live in harmony with monsters, weird black wave goes across the land (the player can see what caused it but the characters don't know) all monsters go aggressive, while saying you want to save your friend monsters you mercilessly slaughter all that come across you without a second thought. and of course once the token flying ship is in place you go around saving the towns from the aggro monsters completely ignoring the giant mountain in the middle of the land masses that is spewing black darkness.   Also if you are reading this as someone who already owns the game I hope you can agree with me that if I was the MC of the game I would pretend healix turned evil and kill him without holding back, I freaking hate everything about him/her (voice, over-used goo and slime puns, etc) he/she really lacks as a mascot character  So yeah I could see where someone would get off liking this game but I honestly wouldn't recommenc this to anyone, I've played games that cost less than 10$ with better stories than this one... ",
            "review_score": "-1"
        },
        {
            "review_text": "As much fun as I am having, and will continue to have with this game, I cannot reccomend it to anyone unless they are a Hack and slash fan (like myself) or a massive Dragon Quest fan.  The game has great music, i recognised a few tracks from DQ8&amp;9, it runs really well (60fps mostly) and it does well to capture the looks of the series. The sound effects, the hit bubbles, the slowdown on boss kills all of it is great.   However there are a few issues i have with the game.  -Having to go back to a hub area after every mission is somewhat annoying -The inability to buy multiple pieces of equipment at once is also annoying -I have 9 characters avaliable to me at the time of writing this review, 3 of them play the exact same -The fact that you can swap characters mid battle is cool, but i wish they roamed around the map instead of following you everywhere. -60fps gameplay, but 30fps cutscenes(both story and ultimate skill usage)  All in all, I personally like the game but i can't see very many others liking it.",
            "review_score": "-1"
        },
        {
            "review_text": "Apparently  Velasco  Cao Cao wasn't satisfied with just ancient China and has now decided to conquer the world of Dragon Quest as well.",
            "review_score": "1"
        },
        {
            "review_text": "Can't play in full screen.Framerate is not good. So I refund it. Goodbye...",
            "review_score": "-1"
        },
        {
            "review_text": "GAMW DOES NOT WORK AT ALL RUN IN COMPATIBILTY MODE YOUSING THE TOOL AND ON RIGHT CLICKING THE LURNCH ICONS AND STILL DOES NOT LURNCH DONT BUY IT.",
            "review_score": "-1"
        },
        {
            "review_text": "I WAS EXCITED TO PLAY AND AFTER THE DOWLOAD IM TRYING TO PLAY UT NO MATTER WHAT RESOLUTION I PUT IT LOOKS CHOPPS AS ♥♥♥♥, DISAPPOINTED!",
            "review_score": "-1"
        },
        {
            "review_text": "game doesn't work in fullscreen and the resolution is locked to 1360x765 and if I use the borderless gaming software the game just freezes",
            "review_score": "-1"
        },
        {
            "review_text": "I miss the turn based",
            "review_score": "-1"
        },
        {
            "review_text": "bad game. nothing like the older games",
            "review_score": "-1"
        },
        {
            "review_text": "Since Dragon Quest 10 has already been released (not in NA) and Dragon Quest 11 is in the making... Would this game be Dragon quest 10.5 or Dragon Quest 12? Who knows, but this game is basically a response to Hyrule Warriors and I love playing it so far, it's just so fun and I loved seeing Yangus and Jessica being apart of this, along with Terry. :u",
            "review_score": "1"
        },
        {
            "review_text": "So cool.",
            "review_score": "1"
        },
        {
            "review_text": "Game runs surprisingly smooth for what it looks like, not to mention extreme amounts of fun! Would recommend if you're in the mood for smashing 1000's of creatures' faces in within a couple of seconds to release some anger/stress.",
            "review_score": "1"
        },
        {
            "review_text": "Runs perfect on Windows 10, even with my 16:10 custom screen. Perfect mix between a kids game and a hack and salsh Dynasty Warriors type of game. The Bosses are fun to beat. Cool graphix.   If your having problems on windows 10 just make sure you have DX12 installed on your computer. the gane runs fine. I even tested it out on a surface 3 computer. I had to lower the resolution and details but now I can continue to level up when Im away from home.   This is exclusiveley a PS4 game and we are lucky to even have the rights to play it on PC. 10 out of 10 score in my opinion. You get everything you pay for.",
            "review_score": "1"
        },
        {
            "review_text": "I'ts fun and enjoyable. Around 30 hours to beat it without doing extras. Have that console feal. Get it on a sale.  The game could have been much much much better, but still oks. Its not a perfect game by any means, it have many issues, but still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Years of playing Dynasty Warriors since DW2 desensitized me from the usual Musuo style gameplay.  Maybe it just doesn't get old.",
            "review_score": "1"
        }
    ]
}