{
    "app_id": 410990,
    "name": "Master of Orion 3",
    "release_date": "2016-08-25",
    "developer": [
        "Quicksilver Software"
    ],
    "publisher": [
        "Wargaming Labs"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Space",
        "4X"
    ],
    "achievements": 0,
    "positive_ratings": 26,
    "negative_ratings": 34,
    "price": 0.0,
    "description": "Experience first-hand the challenges of leading one of 16 different races into unequalled galactic supremacy and face a universe of decisions. Set policies, explore, build, declare war, negotiate - put all these elements into motion to guarantee your place in the annals of space and time.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/410990/header.jpg?t=1481191296",
    "minimum_requirements": "OS: Windows (XP, Vista, 7, 8, 10) Processor: 1.8 GHz Memory: 512 MB RAM Graphics: 3D graphics card compatible with DirectX 7 DirectX: Version 7.0 Storage: 2 GB available space Sound Card: DirectX 7 Compatible",
    "recommended_requirements": "OS: Windows (XP, Vista, 7, 8, 10) Processor: 1.8 GHz Memory: 1 GB RAM Graphics: 3D graphics card compatible with DirectX 9 DirectX: Version 9.0 Storage: 2 GB available space Sound Card: DirectX 9 Compatible",
    "reviews": [
        {
            "review_text": "MOO 1 and 2 were fun (but seem dated now since they run in a DOS box). But MOO 3 suffers two problems:  - poor game play mechanics - buggy data displays where one screen will tell you a planet has characteristics X and a different screen will tell you the same planet has characteristics Q. And they do it consistently so I have no idea what that planet is really like.   I'm sorry I purchased the bundle, and would like my money back. 49.99 is too much for a very dated MOO 1 and 2 and a buggy MOO3. Steam may want to pass off the bugginess of software they sell as a manufacturer problem, but that's not who I paid money. I paid Steam. So Steam either needs to work on fixing the software, or not sell it. Have some pride.   Why? Because selling terrible software like this hurts the Steam brand.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Going back to the glory days of I and II, loaded this up with excitement. What a failure. Graphics, interface, and programming makes it look like master of orion 1 beta. Graphics don't even take up the full screen. Freezes the computer. I swear this was deisgned 25 years ago. I feel ripped off. I own dozens of games on steam and this is my first review. All I can say is do not buy. If you want a good game grab galatic civilizations 3 or x-com 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy it for Moo2 what is this garbage of a game.",
            "review_score": "-1"
        }
    ]
}