{
    "app_id": 411080,
    "name": "SHOWTIME 2073",
    "release_date": "2016-02-12",
    "developer": [
        "Nicolas Bernard"
    ],
    "publisher": [
        "Microids Indie"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "FPS"
    ],
    "achievements": 0,
    "positive_ratings": 206,
    "negative_ratings": 54,
    "price": 1.59,
    "description": "The best shooter SHOW in 2073.Explosive, Fun &amp; full destructive !",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/411080/header.jpg?t=1496934057",
    "minimum_requirements": "OS: 7 ++ Processor: Dual Core Memory: 2000 MB RAM Graphics: FX Sound Card: ANY",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "SHOWTIME 2073 Platform: PC MSRP: $0.99 Link to Lair Gaming's video review:         YouTube™ Video:  SHOWTIME 2073 - Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Although this game needs many improvements as many other people have said, it still is fun and worth $2.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. shoot. run. collect. it's been done before but there a reson for that. It's fun....",
            "review_score": "1"
        },
        {
            "review_text": "It's a quick and simple game. It can certainly be challenging, and not all of that is fair- touching the outer walls kills you instantly, and enemies love to kick you into them. Overall, though, it's just simple fun. My only problem is with the sound: the music needs to be turned down and the enemies be given audible footsteps, I can't count how many time an enemy snuck up behind me while I was dealing with the ones in front of me.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. shoot. run. collect. it's been done before but there a reson for that. It's fun....",
            "review_score": "1"
        },
        {
            "review_text": "This game is very well done For what it is this is perfect...looks great, plays great,and is really tight. For a dollar you cant go wrong..",
            "review_score": "1"
        },
        {
            "review_text": "It's a quick and simple game. It can certainly be challenging, and not all of that is fair- touching the outer walls kills you instantly, and enemies love to kick you into them. Overall, though, it's just simple fun. My only problem is with the sound: the music needs to be turned down and the enemies be given audible footsteps, I can't count how many time an enemy snuck up behind me while I was dealing with the ones in front of me.",
            "review_score": "1"
        },
        {
            "review_text": " PROS     Good rush    Easy to learn, hard to master    Atmospheric, in spite of being a shallow game    Good for short, intense runs    Nice music   It's the year 2073. There's nothing people like better on tv than a show that has a plasma gun armed contestant placed on a electrified walled maze, filled with killer kung fu robots, and, basically, act like pac man.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun but i cant seem to find a save button and when i pause no menu comes up",
            "review_score": "1"
        },
        {
            "review_text": "really worth it for this price. No complains for less than 1 euro",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great game for $1.07. I was a little skeptical at first but it's an interesting little game that can keep you sucked in. It doesn't have a lot to it which can make it repetitive to some but it only improve I think :)",
            "review_score": "1"
        },
        {
            "review_text": "I play this game every day for a few minutes (and beat it). It's my warm up before I play other games.  Consider this a playable music video and the $1 price tag pays for the song you will be listening to while playing.  It's FPS pacman and it's just a blast to play.  Would love to see DLC add more songs and levels at $1 for each batch.",
            "review_score": "1"
        },
        {
            "review_text": "I want to test the beta multyplayer. I think this game is amazing. I think a custom map creator would be really cool. More weapons and a weapon shop to put them in. You could win money after each match and use that money to buy weapons, weapon upgrades, character upgrades, and power ups you can use for the next match. Maybe even custom weapons on the Steam workshop that other players make. You could even make a shop that sells the weapons that players downloaded from the workshop. Finally steam cards and achievements wouldn't hurt.",
            "review_score": "1"
        },
        {
            "review_text": "Before you buy this game i would like to say its good but it has a lot of problems i bought this game about a year ago and it hasnt gotten better the range on the electric fence is everything from 5 cm to the middle of the map the enemies when they hit you they stagger you they hit you so fast you have no chance to get out",
            "review_score": "1"
        },
        {
            "review_text": "It's not lag, it's procedurally generated slow motion!",
            "review_score": "-1"
        },
        {
            "review_text": "You see that Unity setting box pop up when you launch a game, and you know there's a 99% chance the game's going to be junk. For this one, run around in circles for 10 seconds, die, repeat. Escape is Alt-F4, a baffling design decision.",
            "review_score": "-1"
        }
    ]
}