{
    "app_id": 411000,
    "name": "Sorcery! Parts 1 and 2",
    "release_date": "2016-02-02",
    "developer": [
        "inkle Ltd"
    ],
    "publisher": [
        "inkle Ltd"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Adventure",
        "Choose Your Own Adventure",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 235,
    "negative_ratings": 38,
    "price": 9.99,
    "description": "An epic adventure in a land of monsters, traps and magic. Journey across the deadly Shamutanti Hills and through Kharé, Cityport of Thieves. Armed with your sword and over fifty spells with weird and wonderful effects, embark on a narrative adventure of a thousand choices where every one is remembered.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/411000/header.jpg?t=1549288043",
    "minimum_requirements": "OS: Windows Vista Processor: 1.4 Ghz Memory: 1 GB RAM Graphics: Requires OpenGL 2.1 DirectX: Version 9.0 Storage: 500 MB available space",
    "recommended_requirements": "OS: Windows 7+ Processor: 2 Ghz+ Memory: 2 GB RAM DirectX: Version 10 Storage: 500 MB available space",
    "reviews": [
        {
            "review_text": "I sorta, kinda, all-but promised myself that I'd take a break from all the recent Fighting Fantasy gamebook adaptations. Sure they remind me of my childhood, and therein have a certain weighty sentimental appeal, but they ultimately frustrate me on account of how appallingly arbitrary and ruthlessly trial-and-error they can be. In spite of this, I got just the tiniest bit excited when I saw this particular product, because, well...ahem...let's try to justify ourselves here...    Firstly, the Sorcery! books were never Fantasy Fantasy books, strictly speaking. They were more of an off-shoot series authored exclusively by just one of the two FF founders - Mr Steve Jackson - and were an attempt to do something a bit more ambitious and immersive than the FF books. Secondly, while Tin Man Games have actually done a very good job of faithfully adapting a number of FF books, the fact that this series was being tackled by a completely different company, in a slightly LESS faithful manner, made me think...hmmm, perhaps inkle Ltd have actually eradicated some of the aspects of the ye-olde gamebooks which I've never been so keen on. So...have they? Well, kind of. A little. But not a whole HECK of a lot, no...    This is definitely more of a 'video game' than the Tin Man adaptations. It has lovingly-rendered maps, around which you can move a figurine of your adventurer, and combat this time isn't so strictly governed by virtual die-rolls. The combat system employed by this game is...well, different. Possibly even a bit more strategic than sheer-and-utter RNG antics, but...not by much. It still felt pretty random and luck-driven to me; though in all fairness, it's entirely possible that I just didn't 'get it' (but hey, at least the illustrations were nice). Oh, and the spell-casting system is actually pretty nifty, and handled in an atmospheric manner which helps to deliver the player from the potentially 'stuffy' realms of interactive fiction, and into the decidedly more 'spiffy' realms of modern video-gaming.    The Sorcery! books were also a tad less guilty of the ultra-linear, anti-backtracking style of FF gamebooking, in which you'd better hope that you fluke the right direction at the three-way T-junction or it's GAME OVER for you, buddy-boy. Add to this a 'rewind' button kindly provided by the devs of this adaptation, allowing you to go back one, two, maybe even three decisions, and I actually managed to get through Part 1 on the FIRST ♥♥♥♥ING TRY. Perhaps miracles CAN happen, after all? Alas, by Part 2, we were back to old tricks again, and I managed to die in a spot in which hitting the rewind button just threw me back to the same no-win predicament, not just once, but TWO PLAYTHROUGHS IN A ROW. The exact same frigging spot, despite me attempting to handle the situation in a different manner both times. So for the time being, a third attempt is just gonna have to wait...'cause I really don't have the heart to do it all over again so soon. Nice while it lasted, though, and at least having a number of different 'paths' to follow gives it all acceptable replayability (even if all roads do, ultimately, lead to Rome).    So would I at least recommend this more than the Tin Man adaptations? Yes. Slightly. The Sorcery! books were in all honesty never my favourites when I was young - I was always a tiny bit more partial to Ian Livingstone as a writer, and more 'refined' illustrators like Ian McCaig - but this game at least TRIES to rectify some of the shortcomings which these books have always suffered from. Or, in other words, your chances of actually completing the game are SLIGHTLY improved this time around, and the experience is a tad more digitally immersive. It's also better value than the Tin Man products, on account of this purchase netting you not one but TWO gamebooks, for the exact same price; and what's more, it's a four-part epic (the last two parts soon to come) in which you can carry on the same character and inventory from one Part to the next.     An absolute must-buy for all you 'gamebook' freaks out there, but I'm not quite sure about everyone else. Still, a good enough place to start, should one be curious...    Verdict: 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Many many moons ago, before the age of modern computer games, I owned and enjoyed some of the original Fighting Fantasy books by Ian Livingstone and Steve Jackson. These books were great, but as a young and novice adventurer I was terrible at them. And they were really, really hard; death awaited at every turn. Fortunately you could always flip back a few pages and take a different turn.  These digital versions of the Sorcery series of books are no different, but still immensely enjoyable, so long as the idea of reading page upon page of (beautifully written) text doesn't trouble you. Fortunately the adapation to a new medium has allowed Inkle to take out the pain of managing a character sheet, as well as adding variations and mechanics that simply wouldn't be possible in a purely written form, and some other graphical touches such as the map, spellcasting, combat, and gambling.   What really shines through, thanks to the text-based narrative, is the ability to take a huge number of different paths through the game, and the feeling that every choice you make really does have big consequences later on in the story - unlike the far more limited narratives of supposedly choice-and-consequence based games by, for instance, Telltale. This is apparent on numerous occasions throughout these first two episodes, and since your character and decisions and carried over into subsequent episodes (part 3 is out already) there is plenty more of this to come. It really manages to feel like a dynamic, living and breathing world.  I would highly recommend these games to any fans of the adventure genre, particularly if you ever enjoyed oldschool text adventures or Fighting Fantasy books. The only real minor criticism I have is the interface seems designed much better for touch than for trackpad, but it is still a very simple interface and very easy to play on any device.",
            "review_score": "1"
        },
        {
            "review_text": "This is a classic choose-your-own adventure story made into a video game format. You play as a wizard from another country who must retrieve the Crown of Kings that was stolen by the evil Archmage. Yes, I know it sounds cliche but the story is actually interesting.   Also, your choices actually matter and they do carry over to Part 3 and Part 4. Overall, this game is great. I spent way too much time perfecting my choices. x_x",
            "review_score": "1"
        },
        {
            "review_text": "This game is excellent. The magic system is so creative thatI enjoy going back and seeing what else I can do.. or find unthinkable surprises which would seem unapplicable with this or that spell.  There are so many paths and choices that still weave to a central narrative, also allowing for outcomes that aren't always the same.  Pro/Con ratings are 1-3 + or - signs. Based on how good or helpful they are, or reverse for the negative. Pros: +++Versatile magic system based on words. Some secrets here. Some require items and you will likely be able to find what you need later if you missed the earliest chance to gain the ability to cast whatever spell.   ++ You can rewind, useful to experiment with magic or various ideas for strategies. GREAT for those moments where you are supremely frustrated with what ends up being a bad idea in the extreme. I recommend you use it sparingly unless you are just having fun with it. At least play through once without/with minimum use.  + Combat is not bad, extremely unique but ultimately good and removing it would be much worse. Not a great system but very unique in how it's done. Definitely would not change it.  +++ Most spells are infinite use, some require limited items, 'Stamina' [HP and 'Mana'] is used for health, fighting, and various other things. Food and potions restore it. All this is very well balanced so you can't abuse magic that doesn't require limited use items.  + Stamina restoration is well balanced and can periodically prayed for if in a bind.  - Stamina restoration can sometimes be very hard to keep up but rewinding lets you easily get out of 'broken' situations without frustration. If you rewind only in 'broken' situations then you will need to be sparing with your stamina restoration and be familiar with your options. This is not bad so much as requiring to be psychic or overuse of rewinding. Overall a petty problem though.  --/+ Combat is extremely dangerous. You can lose a lot of Stamina with little to no reward. This gets a plus too because it depends on your opinion. I feel it's a bit unbalanced as far as the return is often not worth the combat so I tend to overuse magic to avoid it.  -/+ Dice is fun but hard to figure out for me. Good system, decent tutorial built in, not much worth. There ARE items and special things/reasons to play though. Worth figuring out.  --- Biggest complaint: Some spells are mysteriously unusable despite being fairly expected to be usable in some situations that are not. I don't mean 'all spells should have some use always'. But spells are sometimes mysteriously unable to be cast even if you can in other situations.  Overall a great CYOA game. The best pure one/series I've seen. Outside of text-only ones like Choice of Games... those are a mixed bag though. This is best overall.         ",
            "review_score": "1"
        },
        {
            "review_text": "I never did play the original FF books, but I'm no stranger to Choose Your Own Adventure style books. Sorcery! feels exactly like playing those again, weighing up the options, trying to guess what might lie ahead, hoping that the next page turn won't end in death. My main concern coming to this was how the combat was going to be implemented, but inkle have managed to give it the same risk/reward feel as the other decisions in the story, albeit somewhat dominated by RNG, but you can always retry any disastrous combat.  In fact, you can re-take any decision. In a brilliant development choice by inkle you can rewind to any previous decision to try out another option without starting the whole book again. Some might say that this renders decisions meaningless, and that's a valid view, although there's nothing stopping you from never using the rewind feature. Personally I think this makes it even more like a true CYOA experience, speaking as someone who kept his thumb in the previous page...  The presentation is beautiful, laid out like a hand painted boardgame, and the sounds are great, adding to the atmosphere without overpowering or distracting from the text which is obviously the focus.  If you're a fan of story driven gameplay where decisions have consequences then you should definitely pick this up. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is deceptively toothsome, fitting in a lot of heart without going treacly in your mouth. The art is gorgeous. All I can say is that the rendering is thoughtful. It's well laid out, it's mindful of space and balance, and even the fonts are aptly chosen. This game is a pleasure to look at and spend time in.",
            "review_score": "1"
        },
        {
            "review_text": "It's like one of those old choose your own adventure books. And it's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "The best parts of a good D&amp;D group, charming visuals, great writing, a touch of wit.  Great little game; very polished, highly recommended if you're into that D&amp;D/fantasy kind of thing.",
            "review_score": "1"
        },
        {
            "review_text": "it is cool",
            "review_score": "1"
        },
        {
            "review_text": "While the game is conceptually interesting, it crashes immediately upon launching, and thus remains purely conceptual for me.",
            "review_score": "-1"
        },
        {
            "review_text": "The game system is basically just playing 'rock paper scissors' with the computer.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a visual novel made for tablets. Steer clear.  It forced me to sleep, which insta-killed me because I was too tired to wake up.  It's a memory game of 'pick the right way until you win'. Choices mean little as they all lead to the same goal. Combat is pointless and boring (pick bigger number than opponent to win).  The game doesn't tell you what your quest is besides to find a crown. Doesn't tell you what the crown is or what it's for. Doesn't tell you why it's important or why you need it. Doesn't tell you anything about the area or game world. The only visuals are paper cut-outs and a game board.  Nearly 500MB for a text file seems pretty over the top. They should distribute it as a simple TXT file. You'd save a ton of space and headache.",
            "review_score": "-1"
        },
        {
            "review_text": "great adaption from the books",
            "review_score": "1"
        },
        {
            "review_text": "It's a choose your own adventure book adapted into video game format. After reading that sentence, you've probably already decided wether you will love this game or hate it.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit my endorsement of this game comes from nostalgia of rolplaying in my youth. I didn't play the original Books by Steve Jackson but other fighting fantasy books. Diehard fans of the this genre will love it, and so will any fan of rollplaying in general. My one nitpick is that i wish it had an Iron Man mode were you could not reverse your decisions. Still it gets my recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the game books back in the 1980s, you will probably like this as well. In this version combat has a little bit more strategy to it than just rolling dice. The storyline is mostly the same as in the game books as I remember, though they've added some things to part 2 - enough to keep it fresh, but not so much to ruin it. Another big plus for nostalgia fans is the game features the original artwork from the books.",
            "review_score": "1"
        },
        {
            "review_text": "An game that is the perfect port of a table rpg to the computer. The game give you the feelings that you're really on a tabble playing with friends, trhowing dices and listening to the dugeon master.It's a masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "Reminiscent of the old Fighting Fantasy books - and just like old times. The execution is fairly basic, but you don't play for the fancy pictures. One of the grandfathers of the modern RPG.",
            "review_score": "1"
        }
    ]
}