{
    "app_id": 41100,
    "name": "Hammerfight",
    "release_date": "2009-10-28",
    "developer": [
        "Konstantin Koshutin"
    ],
    "publisher": [
        "KranX Productions"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Physics"
    ],
    "achievements": 0,
    "positive_ratings": 1051,
    "negative_ratings": 514,
    "price": 3.99,
    "description": "Hammerfight is about 2D battles of flying machines equipped with various slashing, piercing and blunt weaponry.A unique combat system is based on realistic physics simulation, and it ties the movements of the rider to the movements of your mouse. As you wave the mouse, your rider swings his warhammer, smashing the foe into the wall!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/41100/header.jpg?t=1447352589",
    "minimum_requirements": "OS: Windows 98SE / ME / XP / Vista Processor: Athlon / Pentium III 2 GHz Memory: 256 Mb Graphics: DirectX 8.0 compatible with 64 Mb VRAM DirectX®: 8.0 Hard Drive: 150 Mb Sound: DirectX 8.0 compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you can get over the somewhat difficult to understand story and the occasional bug, this game is fantastically fun. I spent hours swinging around weapons and smashing ships and flying maggot things. It's incredibly satisfying landing a strong hit on a creature or an opponent and send them careening into the walls/ceiling. If nothing else it's a fun little physics game.",
            "review_score": "1"
        },
        {
            "review_text": "I was not expecting a game about whirling your mouse around in circles to swing a mace to be so fun and have a deep, complicated, story.  From a VERY frustrating start, it takes until mid to late game for things to start rolling, but when they do ♥♥♥♥ gets real, real fast. One thing you'll want to do, is set your mouses' dpi (in the menu, not your actual dpi) to be lower than the game predicts, because it can make it very hard to move if the sensitivity isn't cranked way the hell up. With the quite sizable armory you build up, missable weapons and armor, and alternate endings and mission choice, the game has quite a huge amount of replay value to.  I mean, ♥♥♥♥, it's crazy just get it.",
            "review_score": "1"
        },
        {
            "review_text": "Hammerfight is a ludicrous physics game that is tough to get into, but rewarding once you get the hang of it. The story is convoluted and confusing, and is presented like the player is meant to know exactly what the hell everyone it jabbering about even though they do not - this is not necessarily a bad thing though.  Pros: *The game is (usually) fun *Physics combat is fun *Campaign is decently long *Branching storylines with varying rewards and endings *Convoluted story that is neat, but takes a long time to get your head around *Encourages experimentation with equipment and techniques *Minigames are alright - though unlocking some involves playing against cheating AI (e.g. hammerball)  Cons: *Game has a very steep learning curve *Enemy choppers do not have to follow the laws of physics *Enemies can do things you cannot (e.g. spin their weapons without momentum, manually aim their guns) *Unlocking most minigames is a frustrating experience for first-time players *Particle effects and smoke make it extremely hard to see what is going on at times *Large HUD also gets in the way at times *No new game+ options means starting from scratch every time you want to view the other story paths *You need A LOT of room on your desk to be able to play effectively - clear out a wide area around your mouse or it will do it for you...",
            "review_score": "1"
        },
        {
            "review_text": "This game is overall very fun. The physics combat is very well done and enjoyable. The controls are responsive and well implemented. Do not play this game for the story, though. It is confusing and intricate, not in a good way. The game has its physics bugs but they don't interfere with the gameplay too much. The ai is well done, and there are a large variety of weapons that can be dual-weilded. It allows for a range of combat styles. There is no multiplayer, unfortunately. An arena gamemode offers more gamplay beyond the story. Overall, the game has solid gameplay but is lacking on other things.",
            "review_score": "1"
        },
        {
            "review_text": "A really good casual game !",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique and awesome games I've ever played. It's got a decent story, fantastic visuals, great music and a FANTASTIC game feel. You can FEEL the weight of the weapon on your craft and you can FEEL every hit and every impact. It's a great experience to play. For the low price, I cannot recommend it enough.  EDIT: Just nominated this for the steam awards because this game DESERVES more recognition.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually really fun. You get to smash about your foes with a wide variety of weapons, including a hammer, sword, axe, mace and etc. You can even get guns, giantic throwing daggers, and explosives to use on your foes. Sadly, while there is no online multiplayer, you can get a friend to plug in their mouse on your computer and you can smash about each other with whatever you have. The storyline for the campagin is fairly interesting as well, with great characters and a non-linear plot with multiple endings. And then there's the arena mode, which you'll probably spend the most time in. Get reading for one hell of a hammerfight. I give this game a solid 9/10, being orginial, fun, and it never gets old smashing the living ♥♥♥♥ out of your foes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit dated but it's still lots of fun. The controls take a bit to get used to, but once you manage to land some powerfull blows it'll feel great. It's a bit rudimental and I think it's part of its charm.",
            "review_score": "1"
        },
        {
            "review_text": "  Hammerfight Review",
            "review_score": "1"
        },
        {
            "review_text": "Hammerfight is an interesting game with quite an interesting concept - it is set in a fictional world reminiscent of a medieval Middle Eastern setting, complete with swords, maces, flails, shields, et cetera. The most intriguing concept in the game is the inclusion of steampunk technologies - in the game you take control of a flying machine, utilising the laws of physics to attack with the weapons attached to your machine. A great game to have in your collection.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated games ever. Story is difficult to follow due to it being a Russian game translated to English, but the gameplay is great if you want to kill a few hours by smashing steampunk airships with giant hammers.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with great physics, I still go back and redownload it to play through the whole thing every now and again!",
            "review_score": "1"
        },
        {
            "review_text": "Do you desire to meet your foe honorably in single combat? Do you wish to earn glory through your great deeds? Does the desire for vengeance plant a seed deep in your heart? Come and join the halls of the great warriors and vie for the title Senechal! GO FORTH YOUNG WARRIORS AND KILL! KILL!  The only thing I find lacking in this game is the absence of online multiplayer, I wish to fight warriors of a greater caliber than what is offered by the AI.",
            "review_score": "1"
        },
        {
            "review_text": "one of best indie game ever made check it out for yourself",
            "review_score": "1"
        },
        {
            "review_text": "The satisfaction of smashing one enemy with your hammer, and shooting another simultaneoulsy cannot be understated. Or stated, for that matter. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a terribly designed game. While the mechanics are there, and are very fresh and unique compared to contemporary games, with the generic, copy-pasted storyline and mind-rendingly poor level design, this game was just plain difficult to enjoy. Every level in which I had played had some sort of auto-loss subquest that was nearly a toss-up success. Either it was protect the dude, protect the dude, or the brand new, top-of-the-line, franchise-defining protect the dude quest, all of which had about a 70% chance of failing regardless of your game strategy. The controls are very unique, but overall awkward and have a steep learning curve that the game does not offer time to develop. The creators of the game also spent so much time and effort trying to make the game appear old or indie-retro, the overall experience was damaged. It did support the arcade style of gameplay, but just seemed too pushed.  I expected a lot from this game; I was honestly impressed by the new and unique style of gameplay, but was quite heavily let down by this flawed product. Hammerfight gets an overall 3/10 from me.",
            "review_score": "-1"
        },
        {
            "review_text": "actually i don't undresyand this game..worst game i've played in ma life!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I got this in the Humble Bundle with a bunch of other games. I hadn't heard of it before, but I started playing, and it's actually a fun physics combat game. In its simplest you have a little bot that you move by moving the mouse. As you move, you swing a weapon (say a flail, or a sword) around yourself and try to hit others without getting hit yourself. Mix in lots of game modes, a fun story section, different weapons, some sieges and it's actually a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is a seriously underrated game. I never hear about it, not even sure where I got it anymore. Took me a couple tries to get into. It's a skill game and once you figure it out it gets addictive quick. This is one of those rare games that when you do well you feel extremely rewarded. It has an interesting story if you take the time to play long enough for it to develop, has lots of interesting mechanics and the visual style is extremely unique.",
            "review_score": "1"
        },
        {
            "review_text": "loved this game, played during free weekend, story is short but combat is satsfying and fun. reccomend for a quick play.",
            "review_score": "1"
        },
        {
            "review_text": "The AI on this game is SEVERELY broken. During hunts the AI will get in your way, hit you, fire explosives at you (why the ♥♥♥♥ did you give the AI explosives during a mission where they're allies you stupid ♥♥♥♥?), and generally are in the way or shoving you in the walls.  Either change the AI or remove the 'help' from the hunt portion of the game altogether. DO NOT BUY THIS PIECE OF ♥♥♥♥. It is extremely buggy and has a variety of issues that I doubt will ever be resolved. It's hard to remain civil and composed having paid for what is, effectively, a worthless piece of ♥♥♥♥ because you can't win the game without playing the same mission 10x or more... simply because of the random glitches, terrible mouse control (your slider works BACKWARDS AND DOESNT MAKE ANY SENSE YOU DRUNK), and crashing... as well as the severely mentally handicapped AI. It's almost as if they gave their AI the same IQ as room full of drunk, ♥♥♥♥♥♥♥♥ Russians: 0  Fix that ♥♥♥♥♥♥♥t and I will change my review entirely. Otherwise I'll do my best to make sure this game never sells another copy because the developer doesn't deserve the money.",
            "review_score": "-1"
        },
        {
            "review_text": "The idea seems simple and fun, but unfortunately the controls are rather messed up. Allowing you to control your craft with the arrow keys or controller, or to have a cursor which your craft followed, would be far better. As is, it 'tries' to calibrate the game to your mouse, which in my case made it almost impossible to control up or down.",
            "review_score": "-1"
        },
        {
            "review_text": "Boy, this game sure looks interesting! What a shame the developers had to saddle it with such a ♥♥♥♥ing terrible combat and movement system.",
            "review_score": "-1"
        },
        {
            "review_text": "It's actually a very clever concept for a PC game--just poor execution. They've tried to create a game where the mouse acts like a Wiimote and you use it to directly control a flail attached to a flying machine. It kind of works, but a mouse is really too clumsy to be whipping around in continuous circular motions--it just feels unnatural.",
            "review_score": "-1"
        },
        {
            "review_text": "What ♥♥♥♥♥♥ thouht controlling everythig through your mouse was a good idea? Don't get it, it's ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Total garbage. A tech demo at best.",
            "review_score": "-1"
        },
        {
            "review_text": "This game.. is hard.. and confusing.. I have no idea what the heck i'm doing.. despite the faqs and the walkthrough. The computer, however, knows exactly what its doing.. and has no sense of mercy. If you enjoy games that will make you comtemplate going to mow the lawn to have some fun, this one is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Good concept, but way too buggy. Lags randomly, catch doesn't always work. Enemies sit just offscreen. Not worth the frustration at this point in time.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10",
            "review_score": "-1"
        },
        {
            "review_text": "I like how is seems different from other games but it is difficult to control.",
            "review_score": "-1"
        },
        {
            "review_text": "Waaay too slugish to control, boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game had the potential to be a heck of a lot of fun. The mechanics were refreshingly unusual, but not horribly complex, the violence level was just right to be cathartic and amusing, and it was (at first) challenging enough to be fun without having being utterly impossible. Sure, there were levels that took several repeat attempts to get past, but it was always possible to see that you _could_ succeed, if only you'd managed a better hit at first, or dodged a little more skillfully, or not hesitated so long in that one spot, etc. It got more difficult as I progressed, of course, but not so much so that my skill level couldn't progress enough to keep up with it, if I gave it enough tries. And then.....  Then I hit a level where I ended up dead in a pit somewhere. I won't give away the plot by saying how (and to be honest, I didn't pay that much attention to plot, other than to note that, surprisingly for this sort of game, it actually had one), but the only way out was to grab a disgarded weapon and fight several respawning guards. At which point the skill curve became a skill cliff... a skill cliff coated in ice filled with caves full of yetis armed with grenade launchers, while I didn't have so much as a rope. I spent an entire day trying to get past that single level, and I have no idea if I even came close. Three out of every five attempts ended before I even managed to pick up the stupid hammer. I enjoy a good challenge, but to go from levels that were challenging but possible to achieve in, at most, two or three repeats to something that a full day of cursing, teeth-grinding toil couldn't conquer isn't so much challenging as it is frustrating... and, of course, due to the game's linear nature, it makes it impossible to continue the game.   I played this game during the free preview period here on Steam, and had fully intended to buy it. If I had not reached that level during the hours I played for free, I would have bought it, happily, and been exceedingly disappointed. So, sadly, I cannot recommeend this game unless you either believe yourself to be the ultimate god of arcade games, or you enjoy an exercise in frustration. I really wish I could.  ~Velvet Wood",
            "review_score": "-1"
        },
        {
            "review_text": "Really cool game, just a bit hard to control, thats all.",
            "review_score": "1"
        },
        {
            "review_text": "i remember playing this wile it was on armor games but i cant remmber what it was called help?",
            "review_score": "1"
        },
        {
            "review_text": "The control is unique, far different from any games I've played. Interesting gameplay. Nice story. A game I'd get.",
            "review_score": "1"
        },
        {
            "review_text": "True not-casual indy for true gamers.",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely long and difficult, which usually make for a good game. The only problems I had were some parts were impossibly difficult and the story is very hard to follow with multiple choice paths. Overall I liked the game because of how the phisics were used and the way one has to move their machine.(speaking of which, it would be nice for a choice of machine type in a future update) I give this game an 8/10 and recommend it for hardcore players looking for a challenge!  If you dont know if this game is for you try the demo ;D.",
            "review_score": "1"
        },
        {
            "review_text": "meh. didn't care for the game mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "So, yeah, I havent played that much of the game, however Ive already run into some issues. The npc ships seem to blow up on their own from just moving, and it makes it impossible to beat a level in these instances since the whole point is to protect them. Fortunately I didn't pay over $2 for the game, but even then its still, at least in my case, nigh unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Was a cool game. reall frustrating at times and not interesting enough to continue after mission 3. Uses mouse only, try it for yourself.  5/10 - Just really disliked it.",
            "review_score": "-1"
        },
        {
            "review_text": "I cannot fathom how this game made it out of development. I can understand how it got into development, someone had an idea for what might be an interesting combat mechanic. Have flying machines swinging weights attached to them at one another. It is one of those, 'It's so crazy it might just work,' ideas. However, I would have guessed that 5 minutes of play testing would have disabused the developers of that notion. It didn't and thus the game was released. Much to the detriment of my afternoon and pocketbook.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are very confusing and the physics don't act consistently, ruining what otherwise might be a fun game.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are awful. It has you continually moving the mouse, and moving the mouse farther doesn't increase the effect, nor does moving it back the same distance reverse it... so you'll always be running your mouse off the mousepad or missing a target because you ran out of desk space.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Not worth installing. I could barely get past the first level.",
            "review_score": "-1"
        },
        {
            "review_text": "swirling swirling hammer fight. it's ok but nothing amazing",
            "review_score": "-1"
        },
        {
            "review_text": "Really good game. Haven't seen the mechanics used anywhere else, the controls are easy to understand yet hard to grasp at first, which adds to the challenge of it. Definitely a great game to waste time on, be it 10 mins or 2 hrs.",
            "review_score": "1"
        },
        {
            "review_text": "An intresting game thats hard to get a hold of... really cool idea",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the worst game in my library, Hammerfight has some interesting ideas, however the atrocious controls basically means it is unplayable, at least for me. Awful art and full of jankyness, Hammerfight was a pain in the ♥♥♥.  1,5/ 5",
            "review_score": "-1"
        },
        {
            "review_text": "Underappreciated game with a really unique concept. Beyond the clunky UI and occasionally indecipherable plot lies a gem of fast paced, hard hitting fun and havoc.",
            "review_score": "1"
        },
        {
            "review_text": "There are many reasons I have eagerly dumped over 100 hours into this game. Try the demo.",
            "review_score": "1"
        },
        {
            "review_text": "While a fun concept, the dizzying swinging motion of the combat is tiring. Hammerfight carries a lot of potential but I can't wholeheartedly recommend it.  +Cool Middle-Eastern Setting +Interesting and Original Combat System   -Too Much Flailing -Not Enough Control Over Your Craft",
            "review_score": "-1"
        },
        {
            "review_text": "alexethington12",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the worst game in my library, Hammerfight has some interesting ideas, however the atrocious controls basically means it is unplayable, at least for me. Awful art and full of jankyness, Hammerfight was a pain in the ♥♥♥.  1,5/ 5",
            "review_score": "-1"
        },
        {
            "review_text": "Just need to... can't... what the hell...  This game is frustrating. Perhaps I'm doing it wrong, but I can't hit crap with my hammer-mo-whatsit, and that seems to be the entire point. I can't get past the first level.  [edit] Reviewing this years later. I hope now I can.. wait... damnit! Nope.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the few truly innovative and addicting games alive.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addictive physics fights.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing hidden gem that desperately needs a sequel. Criminally underrated.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a real mixed bag.  First, the negatives: The story is completely bonkers and relies on made up words to create the sense of an otherworld, but as a result is just confusing as all hell.  The graphics, while nice, obscure the gameplay. You can't easily tell foreground from background, and the smoke and light effects obscure combat. In a twitch game this is pretty close to unforgiveable. The difficulty is incredibly uneven. A number of fights start with the enemy barrelling toward you, which means forced restarts. The armory / weapon selection is pretty pointless. The controls are entirely mouse based, despite the fact stuff like throwing weapons or activating guns could have been better handled via keyboard. The Hammerball game is ♥♥♥♥ing garbage, and if you select the mission you have to play it several times. The game is just real janky.  But then the positives: When it works, the combat is really really fun. The control scheme is simple (just move your mouse around) but when you're fighting a series of challenging enemies it's just so much fun to tear through them, dodging attacks as you prep your own. There is planning involved because of the need to attack via rotation. There appears to be meaninful choice in story progression. I haven't run through more than once, but there are divergent mission selection points as well as pure story options. The graphics are nice and evoke an otherwordly Dune type theme. The missions are short, so even with the uneven difficulty, they aren't too much of a slog. And more than that, there is an ability to skip missions after you fail them several times, though I did not use it.  Overall, it's worth a playthrough if you have it, at least for an hour or so to see if you can stick out the jankiness to get to the heart of the game. The main game itself is only like 4 or 5 hours long.",
            "review_score": "1"
        },
        {
            "review_text": "Went to review the reviews (Heh) and realized this game is getting a lot of negative reviews for some reason. Realized also that mine wasn't very well written, so here it is:  This game is not by any means the best it could be (Oh but if only it were...), as it is, it's a game I and a friend constantly come back to just to play it again. Is it hard? At times, yes, but you learn to get better and suddenly it isn't so hard anymore. Is the storyling a bit convoluted? Yeah, a bit... Goes a bit wonky torwards the end tbh, but it's not unfollowable, and not horrible either. Is the gameplay fun? You bet your ♥♥♥ it's fun! Still one of my favorite games in my collection, all the way from when I bought it off the only source available, some shady russian website! My only regret is that there has not been a follow-up to this gem.",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't exactly recommend this game to myself, but I suppose the majority of the players in the world may enjoy this game. I for once, however, am not one of them. But hey, the game is pretty nice with the music and the voice-acting, although there could be more voicing in the game. But I don't recommend buying this game because it's pretty hard to play at the start already, so I can imagine it would be far more harder if I were to progress further in the game, thus, I think the difficulty should be a little easier. I just think the price should be lower.",
            "review_score": "-1"
        },
        {
            "review_text": "-_-",
            "review_score": "1"
        },
        {
            "review_text": "Swing your mouse in circles to swing your flying machine and its weapons into enemies! It's so fun I kept playing after the game gave me carpel tunnel syndrome!",
            "review_score": "1"
        },
        {
            "review_text": "unique gameplay. This game is very fun! but somehow it's difficult at first.",
            "review_score": "1"
        },
        {
            "review_text": "controls are so weird, you'll only be making huge circles with your moose thinking... 'what am I actually doing ?'",
            "review_score": "-1"
        },
        {
            "review_text": "Good game. I give KranX Production credit.",
            "review_score": "1"
        },
        {
            "review_text": "Horrible game. All you do is swing a bloody ball around you and try to dodge EVERYTHING. If anything.... and i mean ANYTHING hits you.... you take MASSIVE damage. Concept is alright but gameplay and just about everything else is garbage. I'd rather have AIDS than play this game again.",
            "review_score": "-1"
        },
        {
            "review_text": "Funny game. you must try it :D",
            "review_score": "1"
        },
        {
            "review_text": "Good game but hard for newbies",
            "review_score": "1"
        },
        {
            "review_text": "Tons on hammer smashing goodness",
            "review_score": "1"
        },
        {
            "review_text": "this game is worst for its genre",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awful to play. The controls are a chore.",
            "review_score": "-1"
        },
        {
            "review_text": "I like beating things with inertia filled hammers!",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the most entertaining game I've played that involved momentum combat.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant idea crippled by absolutely awful mouse sensitivity issues.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the first games I got on steam, didn't really know what to think when I first picked it up. Now i wish there was a sequel or something, as this premise and play style seems a bit wasted on a single game, regardless of how fleshed out that game is.",
            "review_score": "1"
        },
        {
            "review_text": "A neat physics game that lets you control a flying robot swinging a gigantic hammer, to smash other robots swinging gigantic hammers. What more do you want?  The learning curve of Hammerfight is very steep, and you'll have to fiddle with the DPI settings for mouse sensitivity the first few times you play. But it's worth the trouble once you get the feel for it.  There's a nice storyline to the Solo game-mode, but it isn't intrusive. In some levels you'll have to protect an ally, or dodge an enemy while chained to a wall, weaponless, but most levels let you focus on mayhem and destruction. With unlockable modes such as Arena or Hammerball, you can fine-tune the gaming experience you want.  Smash the armor of your enemies with a heavy mace, or slice open exposed parts with a sharp axe or sword! Hammerfight offers an impressive and diverse arsenal, including ranged weapons such as the arquebus and throwing knives!  Definitely worth its low price.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "I appreciate some of the ideas in this game. The control scheme is novel, the lore is creative, and the customization of your craft is a nice touch. However, none of these ideas are implemented well. Using the mouse to flail your weapon around and control your movement is frequently frustrating, especially when all of the smoke and particle effects obscure what is happening. I often had no idea what was happening until I died and then realized I was taking damage. The lore is creative but it feels hollow, like the authors just picked creative arrabic names because they sounded interesting instead of planning how those names would read in game. Finally the customization system is flawed. I could never figure out a way to choose what I was buying. I am unsure if it is randomly generated, developed along a tech tree, or if the GUI is just not informative enough to let me know what to do to change the selection.   To close, its rare that I stop playing a game out of frustration, especially one as novel as Hammerfight. But the flaws outweigh the fun for me. I think they will for you too.",
            "review_score": "-1"
        },
        {
            "review_text": "Had fun playing this with my leap motion controller =)",
            "review_score": "1"
        },
        {
            "review_text": "Do you like moving your arm in circles? No? Well, TOO BAD.  You should really play this at least once.",
            "review_score": "1"
        },
        {
            "review_text": "you will be kicked in the nads, but utterly brillant",
            "review_score": "1"
        },
        {
            "review_text": "One of the most addictive physics-based games on the market. Tons of replayability, and has a habit of instilling a crazy load-blowing feeling whenever you land a good hit on an enemy.",
            "review_score": "1"
        },
        {
            "review_text": "Move your hand in circles for a while while that works.  When that stops working, move in parts of circles.  Get sore hand.  Don't use any bonus features and finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "Like sykrim with hammers.",
            "review_score": "1"
        },
        {
            "review_text": "Played it in the past. Tried to reload it today on a W10 box, but it reliably crashes at startup when you (try to) calibrate the mouse. Had to run it over and over again to accumulate the 5min minimum to post this warning to prospectrive buyers... you are welcome. Not recommended for purchase until this program is fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "Great, and for a very fair price!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun game about steampunk helicopter battles.",
            "review_score": "1"
        },
        {
            "review_text": "if you have the ability to crank the sensitivity to unheard of extremes then you will enjoy this game. otherwise you may need a lot more desk space",
            "review_score": "1"
        },
        {
            "review_text": "Set DPI to really low and set effects to 0.3, otherwise you won't be able to see ♥♥♥♥. That said, EPIC SMASHY SMASHY COMMENCING!",
            "review_score": "1"
        },
        {
            "review_text": "Yes, the game is a bit buggy but I recommend it none the less. Hammerfight is an extremely unique little game that I had a lot of fun playing.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, the game is a bit buggy but I recommend it none the less. Hammerfight is an extremely unique little game that I had a lot of fun playing.",
            "review_score": "1"
        },
        {
            "review_text": "I wish Steam had more than an upvote and downvote for games, cause this is a great game as an example for why we do.  This game is balls to the walls hard, sometimes seemingly unfair, and can be downright annoying at times.  So why am I still reccomending this game to you?  For one simple reason.    The core mechanics and principles of the game.  What are they you ask? Why, simple. Flying around in a steampunk machine and beating the ever living ♥♥♥♥ out of literally everything you see with a weapon crudely attached to your machine in such a way you have to swing it and build up momentum for a hit. You control the flying machine with your mouse. And whenever you hit anything with your weapon at high velocities/you hit the at the perfect time the game slows down time and gives you a massive movement speed and control boost, meaning you can do it over and over again given the right skill level.  Now there are some problems with the combat as well, some pretty big, like the fact you can be stunned by your enemies, and 9 times out of 10 you will be outnumbered and out gunned, meaning you have to fight tooth and nail just to survive. I cannot count the number of times I have gotten stunned and then just died because of it. The sound design is also quite lackluster, as whenever a bomb goes off it feels like someone shoved a blaring smoke detector in my ear, and in the later levels of the arena, THERE ARE A LOT OF F***ING BOMBS.  Oh yeah there is also a pretty cool story mode set in a steampunk arabian/middle east world. It's pretty cool. It evne has multiple endings depending on what you choose to do and who to fight.  All in all, even though I do reccomend this game, it is only to someone who is ready and willing to get his ♥♥♥ handed to him several times before getting down the core mechanics. Then, and only then, are you going to really enjoy this game.  Also, THE DPI CALIBRATION IS COMPLETELY AND UTTERLY BROKEN AND YOU SHOULD NOT TRUST IT. Set it about half or less than it says you should set it to, and then try and play. If that still doesn't work you can always change them in the main menu.",
            "review_score": "1"
        },
        {
            "review_text": "Yo, play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a pleasant surprise.",
            "review_score": "1"
        }
    ]
}