{
    "app_id": 411370,
    "name": "Melty Blood Actress Again Current Code",
    "release_date": "2016-04-19",
    "developer": [
        "FRENCH-BREAD"
    ],
    "publisher": [
        "Arc System Works"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Anime",
        "2D Fighter",
        "Fighting"
    ],
    "achievements": 53,
    "positive_ratings": 1205,
    "negative_ratings": 117,
    "price": 18.99,
    "description": "The final episode of the series, &quot;MELTY BLOOD Actress Again Current Code&quot; is now on Steam!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/411370/header.jpg?t=1478671620",
    "minimum_requirements": "OS: Windows 7 / 8 / 8.1 Processor: Intel Celeron 440, 2.0GHz and above Memory: 2 GB RAM Graphics: GeForce 7900 / Radeon X1600 and above DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: Direct Sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "One of the finest fighting games to this date.  Featuring the richest character variation, incredible animations, an outstanding soundtrack and refined mechanics, Melty Blood has been the masterpiece of developer French Bread, also recently known for Under Night In-Birth and Dengeki Bunko Fighting Climax.   With the Steam release, Arc System Works brings the game in its final and most recent version to PC and even adds a full English localization, ingame controller configuration, Steam matchmaking, rankings and a long awaited lobby system for the (currently wonky) netplay.  Melty Blood has gifted me with  thousands  of hours played over the years from its first version in 2002. Thousands of hours of fun playing, enjoying watching great players, listening to the soundtrack, spending in training mode to discover new things about the character I play, getting mad at strong characters and players, improving my own skill and never getting tired of it. Ever.  I'm happy to see the day this game gets its proper treatment after years of being available only via illegal methods due to the limited stock of the BluRay it came with. It's about time.  See you in Melty.",
            "review_score": "1"
        },
        {
            "review_text": "It's Melty Blood. You can finally buy it for real instead of pirating it.  If you can look past the low resolution character sprites there's a deep game underneath, with so many characters that you could spend a lifetime mastering. Or you could be me and play just one.  Love the game, but... The netplay is ATROCIOUS.  Arcsys, please. Fix this.",
            "review_score": "1"
        },
        {
            "review_text": "Review On MBAACC  Pros -Huge Variety of characters  -3 Different play styles for each character ( Crescent Moon , Half Moon and Full Moon Style ) -Great Music -Ryougi Shiki  -Hisui is best maid  -Ciel's Curry  -Interesting Gameplay Mechanics eg: The Heat Meter  -Although it takes time , It's fairly easy to learn how to play a new character  -English Translated   Cons -Network play can be laggy at times -Netplay is not Beginner Friendly  Basically the only Negative issue is the poor netplay and the huge % of skilled players there.  Really happy that Melty blood is now on steam and that it's translated. Since Ive been playing for 2 years without know anything about each individual character's win quotes and Story Mode in the Arcade.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game for Tsukihime lovers. Contains all the features available in all the previously unavailable games. High competitive, but very rewarding with an excellent cast of characters.",
            "review_score": "1"
        },
        {
            "review_text": "The netplay works great, so now anywhere can be a Dennys bathroom floor!",
            "review_score": "1"
        },
        {
            "review_text": "  This is a fighting game I always thought wouldn't come officially to the West. Thanks to Arc System Works though, they brought in one of my opinions, one of the most balanced fighting games around.  With over 30 characters and three different styles(Known as Moons) there is a lot of experimentation with who and how you play the game.  If there's one flaw I have to give this game though, it's the poor netcode which at least to me, has some lag online. Other than that, for people who enjoy Tsukihime or fighting games(or both) this is worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "anatomically modern humans emerged in approximately 198000 BC, and since that time the entirety of human endeavour has been slowly leading to this masterpiece  thank god for melty blood  ps madsci confirmed that rollback netplay is on its way",
            "review_score": "1"
        },
        {
            "review_text": "Move aside, it's MELTY TIME!   Seriously, get this game now. Sure it looks ancient, but it's better than the majority of fighting games. This is the gateway drug for fighting games, and it might be the only drug you need.  Pro: Playable on STEAM and in ENGLISH! Great soundtrack Fast paced and balanced gameplay Easy controls but can get as complex as you want it to be Huge cast of players and different playstyles = something for everybody Lobby and netplay works as expected Ability to change controls within game The Dank memes surrounding this game/series  Cons: Delay netcode - Needs rollback netcode Horrible font for menus and dialogues - at least make it more pleasing to the eye Intro song not translated - (can be inserted with easy mp4 override) No Ryougi scene - bamboo trees",
            "review_score": "1"
        },
        {
            "review_text": "Melty Blood, the second most ghetto game of all time and also the second greatest of all time. Buy this ♥♥♥♥ and support your animu.",
            "review_score": "1"
        },
        {
            "review_text": "it's an anime fighter what more is there to say",
            "review_score": "1"
        },
        {
            "review_text": "Yes, finally!  I've been waiting for this game to be released in the US officially on Steam!   Melty Blood Actress Again Current Code v1.07 with all the latest patches had been put together well and without the need of a workaround and fan-made english translation patch to make the game work. However, if you've used the Mirror Moon fan translation patch that was still being worked on, you can tell the dialogue differs much from this release. Also, remember to use CCaster if you want good online gameplay and better matches.  The gameplay is awesome, smooth, and fast-paced with combos that can be easy to make and air dash combos are very fun to pull off! There a total of 31 characters if you count the three moon styles for each character. So, you're going to have a great time to discover and play with most of the characters to familarize and creating yout mains. The animation for each of the characters are great and fun to look at.  This game series is a underrated gem and when I share the game to people; they either never heard of the game before or any of the Type-Moon universe at all! Even, when they're average gamers, too bad they messed out on this hidden gem!  Melty Blood is an niece fighting game that is pretty well known to the fighting game community thanks to being released back in December 2002 on Japan followed by the Re-Act expansion and the later the arcade sequel Act Cadenza both released 2004 and 2005 respectively. Then the Act Cadenza Ver. B was released in 2007 with balance issues fixes and bug fixes plus unique added features such as tag team. The first Melty Blood is the sequel to the famous Tsukihime visual novel from Type-Moon, the story takes place about 1 year after the events from the visual novel from the true Arucied ending of Tsukihime.  Type Moon and French Bread did a wonderful job of updating and fixing the game with many updates and the later updates is Actress Again and the first revision came out in 2008 and the final update which is v1.07 with the 1.4.0 patch is Actress Again Current Code which was released only Carnival Phantasm Season 3 Blu-ray limited edition! The set became extremely rare and hard to find in Japan, so many Type-Moons such as us won't be to buy and play the game officially instead we'd have to pirate the game with the fan translation patch.  Due to how awesome this fighting game is compare to other ones is how there are 3 fighting styles to each characters plus the nature of accessible to newcomers and veterans alike! The combo and air combo chains make Melty Blood an awesome game! The elegant memorable iconic characters, story, setting, vampires, and the wonderful music will make you keep coming back to play again and again! Melty Blood is still being talked about today after the final revision update came out back in December 31, 2011 on Windows PC.   My most favortie characters is the following: Vampire Sion/Sion TATARI, Arcueid Brunestud, Kouma Kishima, Ryougi Shiki, and Riesbyfe Stridberg. They're one of my mains, so I enjoy using them a lot I love Sion and Vampire Sion the most, I love her personality and character! She is not a vampire fan and pretty angsty about her condition if you know her backstory. It is why I love her and enjoy her stotic determined intelligent nature and at the same time controlling her vampiric impulses.  Melty Blood Actress Again takes place after a year from the true ending of Melty Blood folliowing the events of the expansion pack Melty Blood Re-ACT and Melty Blood Act Cadenza. A event known as 'Hologram Summer' appears repeating the events from the first Melty Blood.  I am grateful to the Mirror Moon staff of working hard on the english translation patch and the able to understand and play the Melty Blood series on PC which was a Japanese only release.   I love Melty Blood and I am a huge fan of the game series, I collect almost all of the scale figures and the prize figures plus the physical copy of the games and the Carnival Phantasm Blu-ray Complete limited edition set! I am also a huge Type-Moon fanatic so I am obessed with the Nasuverse and the Fate series too! But I enjoy and love Tsukihime more and I can't wait for the Tsukihime remake visual novel to come out in Japan sooner and later with a english translation patch later on!   This is the first Melty Blood game ever officially released on Steam.  Whether you're new or old to this series, I recommend to buy this game now and hopefully it will convince Arc Drive Systems and French Bread to release the earlier Melty Blood games on Steam!   I still suck at this game and not too good when playing aganist opponents, because I get destroyed easily. I should have discovered Melty Blood and the Nasuverse a long time ago but I was a fool then...Melty Blood is what started for me to discover Tsukihime and the Fate series!  So buy and enjoy playing this awesome cult-classic fighting game which not too well known to the masses due to being Japan-only release at that time and it's a Vampire fighting game which is pretty rare!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing this since 10 years ago, and will still be playing this for another 10 years at least. Solid fighting game like no other.",
            "review_score": "1"
        },
        {
            "review_text": "Had to wait a few days before I can be sure to give my opinion.  Melty blood was one of the few series that i kept following as I first found out about the game through mugen with the Melty blood characters and after some time I got interested in it so it's nice to play something that I wasn't able to do in the first place and to be honest the game feels smooth. the game is great and, of the recent patches, they are trying to make the online more tolerable since 1 out of 10 players I played against did have bad lag but that's mostly me limiting my findings with 2+ connections so I am mostly limiting on how many different players I find. still even if you don't want to play too much multiplayer it's still a nice game to try out on your free time. ",
            "review_score": "1"
        },
        {
            "review_text": "Great BGM BTW how to pause/show ingame menu ?",
            "review_score": "1"
        },
        {
            "review_text": "I have enjoyed this game through all of its iterations and finally getting a Steam release is good. That said, the netcode is not. Arc System Works is currently working to improve it, which is a welcome thing. However, if you are like me and have little to no interest in online and prefer to play with friends locally, this can be a great addition to your library. The game engine is fun, the characters are all varied and there are many of them. Even better, each character comes with three gameplay variations, so in a way, you get thrice the amount of characters advertised. The music is enjoyable and the story mode is quite funny with its comedic skits and pop culture references. A negative thing might be the lack of modes and the aforementioned (currently) bad netcode.   All in all, highly recommended.  Also, rest in peace, Miyu Matsuki, voice of Hisui and Mech-Hisui. This was one of my favorite roles of hers.",
            "review_score": "1"
        },
        {
            "review_text": "While Melty Blood may look very fast-paced and intimidating for newcomers to fighting games, it has a very low entrance skill level. Anyone can pick it up and be able to play in a couple dozen minutes. This is not to say that the game has a low skill cap; in fact, MBAACC is a very hard game to master. There are many mechanics and 3 'Moon' styles for each character on the expansive roster that create many different combinations of how each character can be played.   In terms of execution, Melty Blood is not as execution heavy as some other ArkSys games like Guilty Gear. Take that how you will, but personally I do like the fact that my performance is not solely based on mindless button pressing.  Note: My hours on Steam do not reflect my total time playing the game, as the game was just released a week prior to the writing of this review.",
            "review_score": "1"
        },
        {
            "review_text": "Use CCCASTER instead of this game's terrible netcode.",
            "review_score": "1"
        },
        {
            "review_text": "I was utterly stunned when I saw this on Steam. This game has been around for a long while, but was almost impossible to get a proper copy of: it only came with the boxed-set version of a parody anime called Carnival Phantasm.  Now it's here, well.. put it this way: it's the best 'doujin' style fighter by a country mile. It was made INTO an arcade machine. Now, yes, it is 2D, it uses drawn graphics so it's not completely smooth and they are a bit pixelated because it was made for an unusual resolution, but still, the gameplay is fantastic.  Highly recommended for anyone who likes fighting games, even if some of the characters are a bit weird (and unless you're familiar with the backstory of several obscure visual novels you won't recognize them). Oh, and go watch some Carnival Phantasm subs on YouTube too, it's hilarious, especially after you've played this game..",
            "review_score": "1"
        },
        {
            "review_text": "YEAA MELTY-BLOOD TIME FOR PARKING LOT TOURNYS AND BATHROOM FINALS",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Best Airdash Battle Best waifus No anime adaption MC can kill servants Do u love touhou? u will love this then  Cons: Most likely anyone who is good at this game had hours of experiences matching the history of gaia itself. Type-earth gdi",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay and characters! Very good 2D fighter. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Pros -game is pretty much filled with women (31 characters and only 6 of them are guys) -from Arc System works which mostly make good fighting games -Online seems to work -Simple to play but you can learn how to be advanced in days -It's fun to play it in a Parking Lot tournament -It's anime  Cons -No functional local mulitplayer (because controller bug) -its now $25 for a game thats kinda been out since 2010  -It's not relevant enough to featured at tournaments like EVO anymore -The long name -The oringal base story kinda came from a Hentai -It's anime",
            "review_score": "1"
        },
        {
            "review_text": "I call Darcueid 'Drunkueid.' I suggest you do the same.",
            "review_score": "1"
        },
        {
            "review_text": "nice game very very very very nice",
            "review_score": "1"
        },
        {
            "review_text": "so poverty my girlfriend had to buy the game for me",
            "review_score": "1"
        },
        {
            "review_text": "Pros-  aoko best waifu  aoko blue waifu  Cons-  ♥♥♥ nero",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, i'm a fan of the tsukihime world, and to have also shiki from kara no kyoukai is just too much for one package (or game, whatever).",
            "review_score": "1"
        },
        {
            "review_text": "I never played much of Melty Blood before but I've noticed it talked about in high esteem plenty of times, so I gave it a buy.   Pro      Large and colourful character roster.    Works with all sorts of controllers. Detected my PS4 fightstick and 360 controller without issue.    Plenty of resolutions available as well as monitor selection.    Showing special move inputs on the side is an elegant way to work around the aspect ratio.   Con      No borderless full-screen option.    No reworked/updated graphics. Don't expect BlazBlue level graphics out of this.    Hefty price for a port on a niche platform when it comes to anime fighters.    Network play seems hit or miss.   Verdict   Seems to be a port in the purest sense of the word. However, it ♥♥♥♥ing works and it's actually legal. If you're into anime fighters and/or want to encourage more devs to bring fighters to pc, get this. Melty is a classic.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's a great fighter with a huge amount of depth. Buy it and show your support for localization.",
            "review_score": "1"
        },
        {
            "review_text": "I had this game before it was out on Steam and loved it but due to the nature of that 'purchase' the online features were not working. I was so pleased to see that it has finally been released on Steam and I purchased it right away. The game is amazing! If the anime appearance isn't your thing then try to look past it because there is tons of technical potential and the characters are all unique. Now lets put that unique character potential up by 3. Each character has 3 variations or styles that play significantly different which counts for endless hours of training mode. The pace is fast and intense with mixups and damage being extremely high depending on who you play. The music is great; some being funky club kind and others being operatic and epic for the battles. I've heard the online isn't always great but I haven't used it yet and there's always room for updates and tweaks. If you have someone in your area to play with then I'm sure the connection shouldn't be too bad, if at all. If you like fighting games then try Melty Blood. It's one of the best original fighters thats been around for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Melty Blood Actress Again Current Code is one of, if not THE best fast-paced anime fighting game on the market. Being the perfected form of the now aged Melty Blood series, AACC adds new mechanics and near seamless play that only gets more fun as you improve. If you have no idea what I'm talking about when I say 'Melty Blood series,' it's fine and actually one of the very few issues with the game. This game caters greatly to fans of the visual novel Tsukihime and the Melty Blood fighting game series associated with it. The issue with this however is the fact that neither Tsukihime nor the Melty Blood games have been officially released outside of Japan, making this a sort of super-niche game. The game's story mode is based heavily on the events of previous titles, though some are just comedic plotlines to fill up arcade modes for each character. The real meat of the game is in its rich and complex gameplay. The movements and combinations are very smooth and don't take crazy skill to do most of the time. The wide variety of characters adds great depth to the game, and since most characters are viable you can pick your favorite and go far.  Overall, this game is a wonderful present from TYPE-MOON to its international fans, and as such really shines brightest when you have a history with the Tsukihime franchise. If you're just looking for a lightning-fast, high-skill fighting game with some interesting anime characters, I couldn't recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "It has inputs for the specials on the side, therefore it is superior.",
            "review_score": "1"
        },
        {
            "review_text": "Worst netcode ever, we need a 'Ccaster' pls",
            "review_score": "-1"
        },
        {
            "review_text": "It's quite an accomplishment to have a netcode that's almost as bad in Super Smash Bros Brawl. Like, it's not just bad. It's unplayable. Combos that you are able to do 100% of the time offline are almost impossible to do properly thanks to the huge delay.   And yes, background animations have been turned off.   *Waiting for someone to get CCCaster to work in this version so that I can recommend this game because it's otherwise good*",
            "review_score": "-1"
        },
        {
            "review_text": "To be honest, I really want to like this game. I was so hyped because of Type-Moon's Tsukihime and Kara no Kyōkai. However, the netcode really needs some work to it, so until that gets fixed, this review would be a 'not recommended'.  Pros: -Offline play is fun from my limited experience with it -Wide variety of characters   Cons: -Netcode's extreme lag. I experienced about 3 seconds of input delay in my most recent few games. In the beginning, the netcode was working fine with no lag, so I had no issues then, but after my 2nd game, the multiplayer just constantly lagged halfway through the first round. The input delay kept getting worse and worse from there, hitting about 3 seconds of delay at the end.   Overall, I'm waiting to see if the netcode lag will be fixed in a few weeks, because if this remains like this, I'll have to return it because the multiplayer is often unplayably bad.  I'd definitely recommend it if the multiplayer worked.",
            "review_score": "-1"
        },
        {
            "review_text": "Forces Steam Cloud to be turned on in order to play ranked matches, for absolutely no reason. Also doesn't save stats from player matches if you have Steam Cloud off, again for no reason. At best I imagine this is a stupid anti-piracy measure, but it's still a pain in the ♥♥♥♥.",
            "review_score": "-1"
        }
    ]
}