{
    "app_id": 411310,
    "name": "Codename: Panzers, Phase One",
    "release_date": "2016-02-18",
    "developer": [
        "Stormregion",
        "THQ Nordic"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Includes level editor"
    ],
    "genres": [
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "War"
    ],
    "achievements": 0,
    "positive_ratings": 112,
    "negative_ratings": 14,
    "price": 13.99,
    "description": "Codename: Panzers is an incredible real-time strategy thrill ride. Nerves of steel are required when you're a tank driver. One direct hit and you're done for, but you must throw yourself into the battle, because without your support, many will die. You are the tank commander - make the hard decisions that win wars!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/411310/header.jpg?t=1531221673",
    "minimum_requirements": "OS: Windows XP / Vista / 7 / 8 / 10 32 or 64 bit Processor: Intel or AMD 1,0 GHz Graphics: 64MB 3D Video Card with Hardware T&amp;L DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX compatible",
    "recommended_requirements": "OS: Windows XP / Vista / 7 / 8 /10 32 or 64 bit Processor: Intel or AMD 2,0 GHz Graphics: 256MB 3D Video Card with Hardware T&amp;L DirectX: Version 9.0c Storage: 3 GB available space Sound Card: DirectX compatible card",
    "reviews": [
        {
            "review_text": "Great game, if Co-op was fixed it would be much better.",
            "review_score": "1"
        },
        {
            "review_text": "One of my earliest and most favorite WWII Strategy Games, that I started playing when it was originally released. Every once in a while i used to install it. Now that it's available via steam i can rip the CD (thumbs down for not letting me register the retail version on steam ...)  tip: if you have difficulty finishing an mission try Infantry Spam. It is absurd good since Sniper and Bazookas do ridicuoulos damage to infantry or tanks. Just equip them with binoculars, put some medics in betweeen them, some close combat troops and you're good!",
            "review_score": "1"
        }
    ]
}