{
    "app_id": 411560,
    "name": "Reveal The Deep",
    "release_date": "2015-12-04",
    "developer": [
        "Lazy Monday Games"
    ],
    "publisher": [
        "Lazy Monday Ltd"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Horror",
        "Atmospheric"
    ],
    "achievements": 9,
    "positive_ratings": 1081,
    "negative_ratings": 194,
    "price": 0.79,
    "description": "Reveal The Deep is a short exploration game set in the wreck of a 19th century steamship. Navigate through expansive levels, uncovering the stories of the ship's demise and it's passengers. Keep your nerve, your wits about you, and prepare to reveal the secrets of the deep.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/411560/header.jpg?t=1478181761",
    "minimum_requirements": "OS: Windows XP Processor: 1.2GHz or Higher Memory: 1 GB RAM Graphics: DX9.0 Compatible DirectX: Version 9.0 Storage: 70 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "30 minutes to complete first chapter. i think there are 3 or 5 in total.  The game is beautiful , very nice sound, like the ship is crackling, and light effect.  this game is simple but worth it.   you play as a diver on a old hunted ship, with monsters watching you. there are mini puzzles   please note, there is no save option.  the game only saves once you have completed the chapter.",
            "review_score": "1"
        },
        {
            "review_text": "PLayed the first chapter. The story is great. Im shocked this game is only $1 not to mention on sale. Worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "What can I say, this is an outstanding game. I have spent about 30 minutes to get past the first chapter; 5 of those were afk and about another 5 getting to the conclusion of how to pass a monster. This game, for me, has come out of the blue. The 'trailer' and pictures gave me a sense that this would be a good game. It broke those expectations of just being a good game. First through the game they have a good tuturoial bit that pushes you straight into exploring the ship. You soon learn how the dev(S) have utilized a certain control to change your entire enviornment at times. It's breath takinging if you ask me. This begins to allow you to be emersed in the story, or more so the history of the ship. Charcters begin to pop up in this history and whoever drew them, great job!! The characters had a sense of looking of their era while also giving off personaility traits. Somthing like that in an indie game is superb. Among the scenery you also have lighting that ties into the control I spoke of before. Again emersing you into the history. Most of the time though you are just left with the creepy sounds of a ship, along with sounds of being watched?? It's all simple yet so complex in it's own way for story telling. If that makes sense. Some reviewer said 'you get an empty vibe'. And that is exactly how I would explain it. Anywho some more downsides of this. Since it doesn't have a save feature sometimes it can be a bit weird. Some animations and pixels are just a bit eh but most are really fluent and fun to watch. Srsly though, go get the game. It is more worth 2$+ if you ask me but I guess having it this low right away will help get the game publicity and the developer.  Second monster ♥♥♥♥ed me up with my heart pouding for a good minute, simple yet complex, no save only between chapters, super awesome, puzzles can make you think, go get this. 9/10 maybe for the type of game it is. 8.2/10 for overall ness if that makes sense. :D",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric, interesting plot, puzzles, 66 cents, and I actually jumped at the first jumpscare. Play this game with headphones on and with fairly loud volume.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I am very sad to say that but... I feel I've wasted 111 minutes of my life on this. It started nice: dark, underwater horror. But then it became totally boring - both gameplay (poor platforming and forgettable mechanics) and story-wise. The only redeeming factor is low price. I hope that devs learned a lot by creating this game - and they will make better games in the future. :)",
            "review_score": "-1"
        },
        {
            "review_text": "Reveal the Deep is a short gaming experience. It took me approximately 3 hours to finish. The atmosphere of the game is very well constructed. The SFX and focus on lighting are the strongest contributing factors towards the lonesome and (occasionally) fearful emotions this game invokes. There is a very minimalist combat system with a unique twist, and the level design feels well paced. The plot starts out a little confusing, but if you stick with the game, answers will come!",
            "review_score": "1"
        },
        {
            "review_text": "Cute and worth the 49 cents, will keep you interested for about two hours!  While the ambience successfully spook me, cant help thinking a soundtrack would have added to this game.  The only real critique I have is the lack of a simple saving system. Had to restart twice in the first chapter after I made progress.",
            "review_score": "1"
        },
        {
            "review_text": "I don't often get dollar-store games from Steam because they tend to be often underdeveloped products and/or not worth my time. Reveal the Deep is something I would consider underdeveloped, yet I felt my time was respected. (For the most part.)  Price is something I don't often take into consideration for reviewing the game's quality. However, I do think for an indie team's (or lone developer's) first game on Steam, the price point is low enough that if the game doesn't interest you then you won't have much buyer's remorse.  With all that being said, I hope Lazy Monday Games learns a lot from this project to create something more substantial gameplay like The Swapper while also keeping all the great aspects made in Reveal the Deep.   A Little More than A Walking Simulator",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, which doesnt hold your hand and makes you do everything alone. Beware of the underwater monsters though ;) 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Great hour-long spooky romp with haunting atmosphere and sound design, not to mention a cool little mechanic to reveal the story along the way. For a dollar, this is hardly one that can be passed up if you're into this sort of game.",
            "review_score": "1"
        },
        {
            "review_text": "The fact that it costs 'only 99 cents' does not make this game good. It looks pretty, but I've seen enough retrogames and it's not enough to impress me at this point.  The gameplay is extremely boring, and the puzzles are super easy. The light system does not make any sense, you just change dimensions all of the sudden when turning your light off? The journals and stuff aren't interesting and seem very generic.   Overall, it's just plain boring, it could be good but I don't think it's worth it as it is now. It is just boring. Basically, you jump and do very basic puzzles.   One thing I liked was the athmoshphere and the sound design. Other than that, not too impressive. The price doens't make it good and I don't think it's worth even a dollar.",
            "review_score": "-1"
        },
        {
            "review_text": "For the price they are asking, Reveal the Deep is one of the best little indie games on Steam. The story is simple but compelling with some nice twists in the final act, the gameplay is accessible, and the puzzles are comfortably solvable even by those who are unused to the genre.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game, wonderful story. This mini game is good enough to own it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game! Atmosphere is great and it made me scared as hell a few times. Totally worth it! I loved it. :)",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for lore-driving horror you've come to the right place son. This game has so far been the best horror game i've played in a long time, not only for it's use of audio to make you jump or the visuals (which are amazing for pixel graphics I might add with the whole blue underwater scenary you'll fall in love with), but for it's use of lore to drive the player into looking deeper into this story and the ship itself. The letters left behind by passagers of the ship plays a huge part when it comes to the scares because of the way it's introduced and how it affects you overall. The game overall is short and isn't noticed as much, but it should get more attention for how amazing all of this has been crafted together to make this game. I recommend you all to play it even if you don't like it in the end.",
            "review_score": "1"
        },
        {
            "review_text": "This is honestly the best value I've had for a dollar in a long time. If you like creepy, atmospheric games with vaguely Lovecraftian elements, this quiet game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Reveal the deep is 99¢ worth of spooky atmosphere. Spook your socks off at a bargain.",
            "review_score": "1"
        },
        {
            "review_text": "Just completed the first chapter..great atmosphere and sound design. Worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Fun, short game worth the money. It took me almost 6hrs to beat, and 49 cents is worth it for that amount of time (I got it on sale). Great game, I would rate this 85/100.",
            "review_score": "1"
        },
        {
            "review_text": "Wow.  Just simply amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, you truly feel as if you are the first person in a hundred years to traverse through its decaying corridors. The sound design is very fitting and the mystery that unfolds is intriguing. I would have liked to have known who much character is though, and have the ability to change the controls. I would give this game based on the 2 chapters I completed a 9/10. :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best indie games out there. The gameplays and the stories are very interesting and mind challenging. It might look hard at first, but, trust me you'll definitely going to enjoy the excitement that this game offers. ANDDDDDD IT IS ONLY FOR RM3 (0.66$). Perfect game. I'll give 10/10.   Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "For the price of this game it is worth it, it could be a bit more scary but that is just me. If you do not mind reading then this is a good game for you",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant little game. Nice mechanics, good but not too difficult puzzles, and amazing atmosphere. A little too short, I'd love to explore this world further. Maybe in the next game, devs?",
            "review_score": "1"
        },
        {
            "review_text": "A short game to kill time for a couple of hours. The atmosphere is creepy and inspires a menacing sense of dread. It isn't Amnesia-scary, but probably as scary as a side-scrolling game can get. The few puzzles along the way adds to the overall quality of the game.     It is best to use a pen and paper for the last puzzle.   ",
            "review_score": "1"
        },
        {
            "review_text": "So far I have completed two out of the [I think] three chapters, and I absolutely love this game thus far.   Pros:   - Really good story (if you read all the notes) - Scares are EXACTLY how I like them i.e. no popups; instead there is sound, atmosphere, and fear of the unknown - The sound has been used VERY effectively  - Atmosphere is amazing - Helmet light mechanic is cool where you can see stuff how it was before the ship sank - Puzzles are a perfect difficulty level - Game design is good: you can go back to the start anytime you want inside the level (which is good incase you missed a note) - Super cheap price - ITS WORTH - the time it takes to beat the game is two hours-ish  Neutral: - Graphics are pixelated (in my opinion that is effective in a game like this, but some people don't think so, so that's why it's a neutral point)  - Pace can be slow sometimes, but in other times there are adrenaline rushes, which makes this a neutral point  Cons: - No in-level saves, and the level takes about 40-ish minutes if you play at an enjoyable pace collecting all notes - Can't change window size/resolution (no fullscreen) or graphics quality -- don't really need to, but still   Overall Rating: 9/10 Strongly Recommended  ",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best cheap game I've ever played. No it's not scary the simplicity of it is beautiful and the music makes it breath.",
            "review_score": "1"
        },
        {
            "review_text": "Holy spoop this gave me the chills. I tried turning off my light to not disturb the eyes in chapter 1 but JESUS CHRIST DID THAT NOT HELP!",
            "review_score": "1"
        },
        {
            "review_text": "This game really gave you the atmospheric horror feel that I was hoping for, but not only the atmospheric horror is cool but it develops a story that you can kind of piece together of all the crew member's lives. At the moment I have just completed chapter 1 going on to chapter 2 now!",
            "review_score": "1"
        },
        {
            "review_text": "Worth your pittance for the atmosphere and sound design alone. I didn't think it was possible to design a slow burn horror video game, but this one proved me wrong and I spent 60 cents on it.  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Some interesting puzzles, and introduces them to you gradually throughout the level.  ",
            "review_score": "1"
        },
        {
            "review_text": "A Not So Critical Review of Reveal the Deep:  Reveal the Deep is a super cheap, super short, super fun game that caught me off guard. It is a fantastic exploration horror game that executes the basic concepts of tension beautifully. It only took me about 90 minutes to beat the game, which may be a turn off for some people, but for less than a dollar, I feel I easily got my money worth. I wouldn’t only recommend this game to people tight on time or money, but also to any aspiring environment or sound designer as it shows how vital simple and small effects can elevate a generic exploration game to something pretty special and standout.   Pros: • Creepy atmosphere • Fantastic execution of horror elements • Sound design makes you feel alone, especially if using headphones. • Fun thematic puzzle mechanics  Cons: • Multiple input bugs • Ending that seemingly comes out of nowhere with little explanation  Check out the full review at:  tmblr.co/Z1PuXi1-mAJZS   ",
            "review_score": "1"
        },
        {
            "review_text": "TOTALY RECCOMENDED!  EVEN THO I PLAYED IT 10 mins ITS SOO GOOD even tho i was especting a jump scare everytime but it in the end there was no jumpscare perfect game! ill look in the future to play more! worth all the 99 cents!",
            "review_score": "1"
        },
        {
            "review_text": "3/5 Average game  Short and sweet game with lot's of atmosphere. Really, the lighting and sounds were top notch. You could consider it an adventure game or walking simulator since you're only exploring the ship.  I wished there was a map and that you could check all the stuff you already found in a gallery after you finish the game.  Also, you can sequence break the final part and do the last puzzle without even killing Tom with the box.  The only downsides is that it has no replay value whatsoever and that the final puzzle isn't explained very well. I had to actually search for the solution because though you get a clue to half the puzzle, there's 8 possible solutions that meet those requirements. I was thinking that I needed to find another clue somewhere in the ship. But no, you are forced to try a few times until you get it right. Had to look up the answer myself.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible - I bought this not knowing what I'd get from it, then was delighted to discover this incredibly polished explorative horror. In it, you control a scuba diver navigating a sunken ship and discover clues about the deeper mystery of why it sunk in the first place. Clever, well designed, and oozing with atmosphere, this is way more than I would've expected for $0.99! I'm sharing this with everyone I know.",
            "review_score": "1"
        },
        {
            "review_text": "First, let me just say, this is not a bad game. It's priced fairly and will kill about 2 hrs of your time. It does what it set out to do, however, I personally can't recommend it. In my opinion, the puzzles weren't tough and the story and atmosphere didn't captivate me. It felt like there wasn't much to reveal and lacked depth. In the end, I had just moved the character through the levels from start to finish.",
            "review_score": "-1"
        },
        {
            "review_text": "Just played the first chapter and i´m blown away. This game stuns with simplicity and cleverness and beholds quite the lovecraftian horror. Can´t wait to dive deeper, for the eldritch and cyclopean secrets lay there to be uncovered by those who are foolish enough to dare. :)",
            "review_score": "1"
        },
        {
            "review_text": "A horror game done right, surprisingly.",
            "review_score": "1"
        },
        {
            "review_text": "it may be short, but it has great atmosphere and is mildly creepy. I totally recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Great little game. Excellent atmosphere. Interesting story, really enjoyed it   Cons: A few niggling bugs, which can cause you to restart some chapters over. Could have done with some achievements. ",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but spoopy",
            "review_score": "1"
        },
        {
            "review_text": "Got an actual headache playing this game. It's flawed at best, yet for the price it still an experienceI more adventures people might like it ",
            "review_score": "-1"
        },
        {
            "review_text": "Confusing and disorientating in the best way – really atmospheric.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, tons of fun and the story is well thought out and complex",
            "review_score": "1"
        },
        {
            "review_text": "The game won't run on (every) linux. As a workaround I could start it from the commandline: java -jar rtd.jar  The game itself is ok.",
            "review_score": "-1"
        },
        {
            "review_text": "you dont know what to do xd buy it",
            "review_score": "1"
        },
        {
            "review_text": "Good game, nice atmosphere but does not let me finish it? :&lt; Also...what does the Deep reveal?    Nothing really? Not sure? Was kind of bummed out after finishing it.   ",
            "review_score": "-1"
        },
        {
            "review_text": "this fkn game sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't enjoy this pile of crap.",
            "review_score": "-1"
        },
        {
            "review_text": "AWESOME simple game with a fantastic story. Price is amazing too.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, scared the crap outta me at one point. Wish there was more, and an answer.",
            "review_score": "1"
        },
        {
            "review_text": "i decided it was a good idea to play this game at 3 in the morning. i was not prepared for the spookies. RIP crab.",
            "review_score": "1"
        },
        {
            "review_text": "A decent and short little pixel game about a man in a suit. You dont know his name, you dont know why he is down here in the depths of the ocean on this little ship. But things will eventually piece together. This game was maybe 3 hours long in gameplay (alot of aimless wandering for me xD) and its pretty nice and creepy in some points. I would say its enjoyable slowly unveiling, one note at a time, what happened on the ship. I recommend it for its few points it has. Again I hate that its rather short and to be honest it leaves you wanting more explanation by the end but its nice for its price.",
            "review_score": "1"
        },
        {
            "review_text": "A nice game with a bit horror in it. It's a lot of interesting things about the story. The story is nice, and the puzzels are good and sometimes hard to make.",
            "review_score": "1"
        },
        {
            "review_text": "i have 19 min in this game and i got the S**T scare out of me   dont be detrerd by graphics GET THIS GAME  IM BAD AT SPELLING OK!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best dollar you'll spend on a game. There's a few small draw backs like a checkpoint system rather than just saving, but they're small. Definitely made me jump a few times, and a great story too.",
            "review_score": "1"
        },
        {
            "review_text": "Had alot of fun with this game. I dont normally enjoy maze games but this one had a good story keeping me going. Sort of a ♥♥♥♥ off when the filler of the game was made up of time consuming tasks, like pushing blocks. Then you would get lost in the maze and end up needing to push the same block around multiple times. That was a little teeth grinding but all in all, 11/16 thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good for 66 cents. 2spooki4me",
            "review_score": "1"
        },
        {
            "review_text": "Everyone beats the game with just 1~2 hours. I've played 3 hour until now and just got to the chatpter 3 now. I feel dumb...  It's a OK game, by the way... The exploration is a important thing here, but I don't feel rewarding with what I found or the progression. Next to the end of the game (chapter 3), the story turns more interesting. The control is a little 'heavy' (it's frustrating sometimes), but I think it's because of the suit of the character. Overral, the game reminds me of the good game 'Lone Survivor' (reason that I bought this game). The price is fair by what the game offers.  NOTE (04/09/2016): At the end of the game, it let me pass to an area that doesn't have a way back. This is ♥♥♥♥ing frustrating. The leves are way too big and dark, so you easily get lost and stay hours searching where do you have to go... I don't finish the game because of this and uninstall the game.  -------------------------------------  EM PORTUGUÊS PROS AMIGO BRASILEIRO:  Todo mundo termina o jogo com apenas 1~2 horas de gameplay. Estou com 3 horas de jogo já e ainda vou começar o capítulo 3. Me sinto muito burro...  Aliás, o jogo é OK... A exploração é algo importante aqui, mas eu não me sinto recompensado com a progressão ou com o que encontro. Perto do final (lá pelo capítulo 3), a história começa a ficar mais interessante. O controle é um pouco 'pesado' (o que é frustrante, as vezes), mas acredito que seja por causa da pesada roupa do personagem. Em geral, o jogo me lembra o bom e velho 'Lone Survivor' (motivo pelo qual o comprei). O preço é justo pelo que ele oferece.  NOTA (09/04/2016): No final do jogo, o jogo permitiu que eu progredisse para uma área que não tinha como voltar. Isso é muito frustrante, pois os cenáriso são muito grandes e por serem escuros, são confusos e acontece de as vezes você ficar horas procurando onde tem que ir. Não consegui terminar o jogo por causa disso e desinstalei.",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty amazing game. For its price it is an absolute steal. There seems to be a very interesting story which you uncover by finding notes and writings through the ship. There is a genuinely clever mechanic that leads to some great puzzles and gameplay. There is no fighting, only exploring. The game is wonderfully creepy and chilling. It's not perfect however, but this is to be expected with the price. All in all a must own.",
            "review_score": "1"
        },
        {
            "review_text": "For the price you pay this game is a great time. It's creepy, interesting, unsettling, and above all just fun to play. The movement is a bit clunky and the UI looks pretty amateur (though to be fair there is very little of it) but that kind of works in the games favour for the most part.  All in all this game is probably worth a little more than its current price. It does a lot with very little. Also the level design is pretty damn clever for the most part. It manages to give the player just enough information for them to progress without becoming overbearingly handholding.  I'd say this was a good use of 2 hours. I would  highly  recommend this to any Lovecraft fan.",
            "review_score": "1"
        },
        {
            "review_text": "The game is about an hour and 20ish minutes long and costs 1$ It costs less than a candy bar and gave me more joy.  Basically what I'm say is skip the candy bar and give this neat little spooky game a chance.",
            "review_score": "1"
        },
        {
            "review_text": "First off, I should at least mention that I'm not a huge platformer fan, but occasionally when I come across something that looks like it might be up my alley, I don't mind taking a punt. I'm very glad that I did exactly that after watching the trailer to Lazy Monday's, Reveal The Deep. Over three chapters, all of which come with the purchase of the game, the player explores the sunken remains of a Victorian-era cargo ship which has met its mysterious demise. As seems to be the current norm in independent games under $2, Reveal The Deep uses pixel-style graphics. In this case however, the story-critical information is fed to the player in a series of short handwritten letters and diary entries, supplemented with hand sketches of the various characters and their discoveries. The plot threads are evenly spaced enough to keep the player engaged in the story, and do a good job of breaking up the rather nominal difficulty of the gameplay. Indeed, Reveal The Deep is far more of a walking sim than a true platformer, and not being particularly fond of platformers, that was something that delighted me. I hate being punished for a poorly timed jump, and I certainly don't like to be rushed when I play games for enjoyment; so I was in fact, relieved when it became clear that I wasn't going to have to repeat the same sequences over-and-over because I'm more like Woody Harrelson than Wesley Snipes, and that I was actually going to be allowed to enjoy the premise of the game: To explore a shipwreck.  Lazy Monday have done a great job of capturing the romance of being an explorer at the turn of the last century. Considering there is no voice acting or narration, no flashbacks or cutscenes, they have still been able to paint a wonderful picture for the player despite the minimalistic approach to the inclusion of text in the game. Anyone who has read a bit of similarly-themed literature, will understand what I mean when I say that what Lazy Monday have done is to include only what is needed. And in my mind at least, there is a very subtle art to that that really should be appreciated and applauded.   Normally one of the things that I get excited about when I play indie games is the soundtrack, but Reveal The Deep instead does something that makes a lot of sense for an underwater exploration game. Rather than trying to tell the player how they should be feeling using music, the lack of it in this case gives the game an unnerving quality that suits it very well. There are some very contrasting moments in each chapter that utilise this to great effect, and all the while the player is hearing the muffled sounds of their own breathing and heavy footsteps against the protesting groans of the sunken wreck. Again, the Developers have made a great choice to leave something out rather than put something in as a matter of course. I think that the only reason to use a soundtrack in this game would be to take it in more of a horror direction, but doing so would only serve to pull Reveal The Deep more into the mainstream, and thereby do it a great disservice. Indeed, I would much rather have seen a little more creativity in the use of lighting than any type of accompanying soundtrack, as the former would have added much more artistic value to the game, and added yet another layer to an already enjoyable game. If you want the full diving suit experience, be sure to put on a good pair of headphones, they really do make a huge difference to the amount of immersion you can draw from this little gem.  With their debut offering, Lazy Monday Games have delivered something that emphasises how keeping it simple can often yield the best result. I'd love to see what they can do with a bigger budget, because there is a lot to like about how Reveal The Deep has been produced. I just realised today is Monday, how strange...",
            "review_score": "1"
        },
        {
            "review_text": "for 99 cents its very well put together but it lacks in some places but hey it was 99 cents ",
            "review_score": "1"
        },
        {
            "review_text": "I fond this this to be a fun little game with a great creepy atmosphere if you like 2D puzzle platformers then give this a go.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game! Over my expectations... I reccomend it to everyone who like simple puzzles, retro, funny to play games. I want to re-play it :)",
            "review_score": "1"
        },
        {
            "review_text": "pretty spooky and atmospheric. i dont really get the symbolism of the stuff at the end but it was enough to convince me it was smart, i need no more than that to enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "I normally don't buy $1 games but, seeing that this is an atmospheric-puzzle-exploration game with    Lovecraftian    horror, it caught my eye. Then, I saw the sale of it being 51% off. This was strange for an already curious game. So, I gave the game a chance.  Reveal The Deep is short and sweet. It manages to capture the idea of    Lovecraftian    horror when other games don't understand the source material. This game did cause me to look over my shoulder in game and in real life when there was an unusual noise or passing by an open door. This horror game utilizes other horror motiffs to achieve their atmosphere instead of jumpscares. There are some genuine startling moments in each chapter.  There were times the paranoia depleted when I became lost in the maze-like ship. The pacing can suffer if the player becomes lost. My advice to any new player is this:   Keep moving forward. Avoid backtracking as much as possible.    If this game sounds interesting, then you may enjoy it. The game is worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended... Good story and Atmosphere",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good I feel kind of guilty for buying it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the atmosphere and I found the story pretty interesting. It's a short game of puzzles and creepy sounds. Not really any horror or jumpscares, and pretty good overall in my opinion.",
            "review_score": "1"
        }
    ]
}