{
    "app_id": 411570,
    "name": "Zombie Exodus",
    "release_date": "2015-10-23",
    "developer": [
        "Hosted Games"
    ],
    "publisher": [
        "Hosted Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Zombies"
    ],
    "achievements": 25,
    "positive_ratings": 118,
    "negative_ratings": 13,
    "price": 5.79,
    "description": "It starts with a daring escape from a zombie-infested city; it ends at Zombie Exodus, when a horde of zombies swarms outlying settlements like locusts.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/411570/header.jpg?t=1538628206",
    "minimum_requirements": "OS: Windows 7",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Made that red haired girl fall into a pit of zombies 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ohhh Mindy I wish you were real... :( ",
            "review_score": "1"
        },
        {
            "review_text": "Aight, just finished it. Took me about 8 hours, nice writing and plenty of choices to go with. Got me invested in characters and i'm already contemplating a second playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "I played the demo entitled 'Zombie: Safe haven' which had crafting and scavaging. Zombie: Exodus has none of these features and instead features a very linear story. I feel quite bait and switched given the implication in Safe Haven of skills and resource managment. The game itself is short and has some choices you can make, however they hardly alter the story and towards the end all choices kill you unless it is the option the devs want you to take. A more involved plot with more variety in gameplay, non-linear storytelling and more pictures would really bump this type of game up. I am giving this a thumbs up however really my review is 'meh', for which there is no option.",
            "review_score": "1"
        },
        {
            "review_text": "Man how to start this review so many tings to say... I LOVE THIS GAME. Now that that is out of the way it is a very fun game. From the choices i made it was not to hard not to easy. At points it got pretty boring because you would do the most annoying things like chose people to do jobs. At points I would become sad that a person who i liked died because you build the relationships. I would love for anyone reading this to buy this game and play it all the way though because it is so much fun and wish it didn't end.",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting game highly addictive to read and take part in, well worth the money spent.  A word of warning however if you appreciate text games where your decisions matter to shape the story then this game is for you. If you want a zombie shooter I sugguest left for dead or DayZ.  Looking forward to more work would like to see a military point of view in a zombie apocalypse especially the end game for them",
            "review_score": "1"
        },
        {
            "review_text": "There's alot of reading content and survival management in this text-based game to go through, more than how long it takes to finish other Choice of Games' products like the 'Hero Rises' games and 'Choice of Deathless'. The price of this game is fairly justified.",
            "review_score": "1"
        },
        {
            "review_text": "Real interesting but id suggest buying it real cheap still very good",
            "review_score": "1"
        },
        {
            "review_text": "This game is really badly written. The overly used 'you' and many grammar errors, the badly made skills set. I mean, i'm a soldier who trained a lot firing with different weapons, but i find myself uncapable of hitting 1 hit kill at any given moment. This is ridiculous. Also, the close quarters combat is almost impossible, since even if it is one-on-one, there are parts the the zombie will overcame your powers, embrancing you while eating your flesh. And i've tried multiple times at the same part, with a combat knife, with a chivalry sword, even an spiked bat. It could be good, but it isn't. I gotta admit though, although i did not like the 'book' at it's plenitude, the path between the beginning and the end was slightly pleasant.",
            "review_score": "-1"
        }
    ]
}