{
    "app_id": 411740,
    "name": "Yet Another World",
    "release_date": "2015-11-30",
    "developer": [
        "energy milk"
    ],
    "publisher": [
        "energy milk"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 51,
    "negative_ratings": 12,
    "price": 5.79,
    "description": "Yet Another World - funny hardcore platformer in minimal style and relaxing ambient music.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/411740/header.jpg?t=1449815424",
    "minimum_requirements": "OS: windows 7 Processor: Intel Core 2 CPU Memory: 2 GB RAM Graphics: NVIDIA GT/s 4xx or Equivalent DirectX: Version 9.0c Storage: 150 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "So, after playing a decent amount of levels on this, and spending around nine and a half hours on the game (at the time I am writing this) here's my overall impression of the game:  The story doesn't make a whole lot of sense, if you are looking for some immersive story-rich experience. Some alien being has stolen your cows while you were sleeping, and you are on a mission to get them back at all costs. I guess a lot of platformers can be kind of vague in this regard, with very limited story, so I don't really have much to complain about with this, but it is worth mentioning. I don't really understand what is going on, but the idea is to collect at least 3 of the 10 'o rings' in each level in order to open the portal gate thing to get to the next stage, while avoiding traps, pits, falling objects, creatures, and other obstacles. I've been working on collecting all 10 rings per level so far, and it is fairly difficult on some levels, partially due to the need to have a responsiveness adjustment for controller or keyboards. Your lives are unlimited, but you will lose a collected ring from the level you are on with every death you incur.  I really like the graphic style, and the mood and setting. The art is nicely done, in my opinion, and the Gameplay is pretty responsive, but for me, a bit too sensitive. Music is light and doesn't overburden the experience. I also like the small square gates you can enter in the levels that will take you to small subterranian tunnels to usually find an 'o ring' or something similar. They're generally scattered around the levels as you progress. I also like some of the small in-level objects you can 'eat' or 'use' to create other effects with your environment, whether it is cooling yourself to tolerate heat better for a limited time, eating various fruits that grow from the regular green trees that will cause farts when jumping, which I believe can potentially kill things. I am not certain, but I think I might have killed a fish with one at some point, though I am not entirely sure at this point. There are also some black root-like structures that will grow when you get near them which give you some explosive powers when you jump that will lower spike traps very temporarily. I also like that you can find hidden bonus items in many levels that you can use from the menu that will help you temporarily as you progress. They are limited, to my knowledge, so best used wisely!  While I like the art and style, a little more variety would be nice, as progression seems a bit slow at times, due to the fact that I am collecting every ring in each level, perhaps. I have noticed water as I've progressed though, which is nice, and a few other things every 10 or 20 levels I move onward. I've had a difficult time using a controller, since the sensitivity cannot be changed at the time I write this. This can be a bit frustrating at times. When I use the keyboard, it is much easier to do smaller movements left and right, but still not as easy as a lot of similar style games. Some areas can be fairly difficult, where you need the smaller movements, which my controller overcompensates for, as does my keyboard - would be easier to play if I could lower the movement speed or sensitivity with a sort of in-game slider or something.   I haven't figured out one squirting button I noticed on controller, and I'm not sure what that does, or if it is useful for anything. As far as bugs, if I hold down the squirting animation, and jump away from it, the stream will stay in the same spot, I noticed. I also noticed you can hear jump noises, or farting noises if the game is paused, and this also happens if you die and try to jump over and over. Also, if I exit the game, I have noticed that it will default me to the wrong page, rather than what level I was just on, so I will have to go back a bit to start over, if I completely quit to the selection menu. Once or twice upon falling off the screen, my ring appeared in places where it would be impossible to retrieve it and still collect all 10 rings in the level, making me have to restart the level entirely.  Overall I do like the game, but there are some things I hope can be worked on with some time as it is developed and improved further. In particular, I hope there will be a controller sensitivity slider that can be used because I find it moves a little too quickly for me with my controller compared to similar platformer-style games. The glitches are fairly cosmetic, and have no real effect on gameplay, aside from the missing or unobtainable rings prompting a restart. I feel it is a little bit pricey for what it is at the moment, but for the amount of levels it has, I would say at maybe half the price, it would be a good deal if you were planning on spending a good bit of time playing. There seems to be at least 140 levels, and from what I have played so far, they have been fairly challenging to collect all 10 rings in each level. It definitely is not a bad game by any means, and I will probably continue to play more and see what happens as I progress further to beat up this alien and get my cows back!   ** Disclaimer: I was given a key to review the game. This had no impact on my rating** ",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game? Graphics are pleasant as the ambient music and sfx. The goal of each level is to collect at least 3 rings and get to the exit. This is easy, unless you want to collect all the rings on the level. However I haven't found any reason to do so, unless you want to take some challenge. Overall it's a nice platformer. Totally worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. And I'm the first!!!!!!!!!",
            "review_score": "1"
        }
    ]
}