{
    "app_id": 412230,
    "name": "Infinitrap Classic: Ohio Jack and The Cup Of Eternity",
    "release_date": "2015-12-22",
    "developer": [
        "Shadebob Games"
    ],
    "publisher": [
        "Shadebob Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Steam Workshop",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Casual"
    ],
    "achievements": 14,
    "positive_ratings": 43,
    "negative_ratings": 12,
    "price": 0.0,
    "description": "InfiniTrap Classic is a fast paced puzzle game for hardcore players.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/412230/header.jpg?t=1532116816",
    "minimum_requirements": "OS: Windows Vista (if you can live with it) Processor: Intel Pentium D or AMD Athlon 64 (K8) 2.6 GHz Memory: 2 GB RAM Graphics: Intel HD Graphics, AMD Radeon HD 2400, NVIDIA 9600 GT Storage: 220 MB available space Sound Card: No sound card is required but it will kind of suck if you are not deaf",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  not that satisfactory as expected. You only have a new options to exploit and the narrative isn’t that extensive. The graphics and sound are a great match though and you’ll be hearing Ohio Jack moan more than once. If you have some spare time on your hands, this game will serve its purpose.  Pros Fun concept interacted menu Steam achievements &amp; trading card sound effects   Cons  More extensive story  rather short",
            "review_score": "1"
        },
        {
            "review_text": "If you think this game's easy, wait for 'Banana Jump', this stage is insane !   Ps : i would love to be able to slide jump :P maybe next update!!",
            "review_score": "1"
        },
        {
            "review_text": "I have never really played a game like this before. It is quite difficult, and on one of the levels I played through and died about 30 times in a row before I figured out what I was doing wrong. At first I found myself wishing for a tutorial, but then I realized that figuring it out on my own made me feel like I had really accomplished something. You know, sort of like when you don't understand some math homework, but then suddenly the answer dawns on you.   Since I have young game players in the house, and also because I prefer not to watch bloody and gory animations, I truly appreciate that the developer included a 'no gore' option to make the game family friendly. It's always a positive when gamers are given a choice, and it shows that the developer is willing to put work into the game to make it accessible to everyone.   Since I grew up in Ohio, I'll admit that I'm a bit biased toward liking the title. Control works excellent with my Xbox 360 controller. Difficulty level is high, and I suppose that could be frustrating for some, but I felt that it was worth the money.",
            "review_score": "1"
        }
    ]
}