{
    "app_id": 412480,
    "name": "Turtle Odyssey",
    "release_date": "2015-10-21",
    "developer": [
        "Realore"
    ],
    "publisher": [
        "Qumaron"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Action",
        "Casual",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 36,
    "negative_ratings": 2,
    "price": 1.99,
    "description": "Help a brave little turtle get his shell back in this exciting adventure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/412480/header.jpg?t=1542719447",
    "minimum_requirements": "Минимальные: ОС: Windows XP/Vista/Windows 7/Windows 8/Windows 10 Процессор: Pentium III 800MHz Оперативная память: 128 MB ОЗУ Видеокарта: Graphics card with 32MB Video RAM Место на диске: 30 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Turtle Odyssey is one game that I really would recommend to people who want a fun but challenging game. In this game you play as a turtle who at first gets his shell taken from him. But then he finds out that something much bigger is at stake and from here you must travel across different types of terrain, fight 4 unique bosses, and all at the same time. DIE A LOT! I MEAN A LOT! This game will present you with many different types of traps that will trick you and treasures that will be hidden throughout the maps. As of enemies you will face anything from bullet shooting fish like creatures to really wierd sounding sea urchins.   Even though this game if fairly long I kind of wish that it was a bit longer and that there was a new setting for each map instead of having the same four maps repeat eachother twice well the only difference the second time is that it is a bit harder.  Overall I would give this game a 4/5 since it is a great game but I wish it was a bit longer and I also wish that the maps didn't repeat.",
            "review_score": "1"
        }
    ]
}