{
    "app_id": 412400,
    "name": "GASP",
    "release_date": "2016-01-19",
    "developer": [
        "Dark Day Interactive"
    ],
    "publisher": [
        "Dark Day Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Casual",
        "Free to Play",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Space",
        "Simulation"
    ],
    "achievements": 10,
    "positive_ratings": 293,
    "negative_ratings": 1159,
    "price": 0.0,
    "description": "This game takes place in the same universe as our upcoming tittle Secluded; you take control of a lone astronaut that lands on the surface of a planet, miles away from the other members. And it’s your job to meet up with the other astronauts.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/412400/header.jpg?t=1519751005",
    "minimum_requirements": "OS: Windows 7 32bit, 64bit, Windows 8 Processor: Duel Core 2.6ghz or Higher Memory: 4 GB RAM Graphics: 1.3GB Graphics Card or Higher DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 32bit, 64bit, Windows 8 Processor: Duel Core 3.0ghz or Higher Graphics: 2GB Graphics Card or Higher DirectX: Version 11 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "Jumped into an asteroid, did 2 damage, glitched me partially under the ground, couldn't walk properly. A ♥♥♥♥♥♥ walking simulator, and incredibly untentertaining. I also saw rocks fly through the ground, and dissapear infront of my eyes. It also burnt up my ♥♥♥♥ing CPU at the end cutscene. This only shows that the sequel to this game's just going to be horrible. DLC, really? FOR THIS!?  Please don't release anything anymore, just don't. I'm begging of you, take this horrid piece of work off the steam store. I can probably make a better god-forsaken game in RPG maker, even. And I don't know how to use it, either.  Here's why, (I DID NOT WRITE THIS SPECIFIC PART.)  Also, here's a reminder of what these 'Developers' have done.  1) They ban you for negative comments on their forums. I got a permanent ban for pointing out that they had run 5 kickstarters for this game (2 successful). They said it was a false accusation, but you can go to Kickstarter and see it for yourself (although they've changed the names around to make it harder to find).  2) They delete all negative comments on their Greenlight submissions.  3) They have a UnitZ asset pack in the Steam store.    (I didn't write the list above.)  Now, the reason why they went F2P with this game, is because they thought that they'd get more money by having a 'Free' game, and hope people would buy the DLC.  The dlc's just a bloody reskin of the game, by the way. Same, horrible graphics and gameplay.  Please, check the developers out, first. People like this, who constantly shelve out horrible games, need to get booted off of here. Take your horrid, putrid, stupid games off of my community, you fiends. I've been on here for seven years, and not ONCE. NOT ONCE, have I played a game so horribly, mind-bogglingly terribad as this. Atleast temper tantrum had unique gameplay, ATLEAST I COULD SAY IT WAS ORIGINAL FOR THE GAMEPLAY ASPECT AND IDEAS, BY MAKING YOU SMASH FURNITURE. But this brings nothing new to the table of walking simulators, get off of my steam, you dlcks.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't even pay for this game and I want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "walk for miles in 5 directions that all lead to invisible walls, while you get pelted by aimbot astroids from space.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt; Launched the game &gt; Crashed &gt; Launched again &gt; Crashed &gt; Rebooted PC &gt; Launched again &gt; Actually worked &gt; Tries the Mars-like planet &gt; DLC (3 euros) &gt; Tries the 'free' planet &gt; Kid screaming in microphone &gt; Graphics don't look half that bad for the size (between 100-200MB, 20% the size of a pixelated game) &gt; Walks to closest waypoint &gt; Gets hit by small asteroids &gt; Gets hit by an asteroid the size of a house &gt; Did 2% 'damage' &gt; Repeats last 4 for about ten minutes &gt; Almost there &gt; Invisible wall &gt; Quits &gt; Uninstalls  Final thoughts: They should've paid people for trying this game  -10/10",
            "review_score": "-1"
        },
        {
            "review_text": " A Walking Simulator / Space Survival Demo",
            "review_score": "-1"
        },
        {
            "review_text": "1. Installed 2. Started 3. Get screamed at by a 12 year Old 4. Press W for 10 minutes 5. Found the Radio 6. Nothing Happens 7. Closed the Game 8. Uninstalled 9. Worth It",
            "review_score": "-1"
        },
        {
            "review_text": "GAME IN A NUTSHELL... WALK FROM ONE PLACE TO ANOTHER ONLY TO GET TOLD TO WAIT FOR A NEW GAME COMMING IN 2016 ....................../´¯/)  ....................,/¯../  .................../..../  ............./´¯/'...'/´¯¯`·¸  ........../'/.../..../......./¨¯\\  ........('(...´...´.... ¯~/'...')  .........\\.................'...../  ..........''...\\.......... _.·´  ............\\..............(  ..............\\.............\\...",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Just terrible. Why is it even on steam?",
            "review_score": "-1"
        },
        {
            "review_text": "My expirence with GASP -   -Ears bleed -Holds down W for 1 hour to get to first objective -Nothing at objective -Meteors target you and come to you instantly -Trys to go to next objective -Gets hit by 50 meteors -Dies -Can't get back in game -Puts in recycle bin -Uninstalls  -Writes this horrible review of this game -Rages because I wasted an hour downloading this horrible game -Goes and plays CS:GO",
            "review_score": "-1"
        },
        {
            "review_text": "Game is very immersive and scary just what you would expect when you crash landed on the moon.....            ...until you hit and invisible wall....",
            "review_score": "-1"
        },
        {
            "review_text": "  I can't get past the loading screen.",
            "review_score": "-1"
        },
        {
            "review_text": "Your mission if you choose to accept it (don't), is to spend half an hour holding down the forward key, only to run into an invisible wall that blocks you from getting to your destination.  It's total crap, don't waste yoru money or time, mostly your time.",
            "review_score": "-1"
        },
        {
            "review_text": "Gives you a valid excuse to shove your head into a jet turbine. ",
            "review_score": "1"
        },
        {
            "review_text": "Most boring thing I've ever experienced.",
            "review_score": "-1"
        },
        {
            "review_text": "Starts game, badly voice acted mission control telling me about air.  play model has no legs or arms   avoid bouncing astroids by leaping like a kangaroo  reach 'unkown signal'  game ends, tells me to buy full version  - no multiplayer  -30 mins of gameplay  10/10 ign would defy physics again",
            "review_score": "-1"
        },
        {
            "review_text": "not what i expected. i hoped for a good game which delivered fun entertaining content in space. and what i get is a preview for another game. if your gonna tie it with another game. include the tag Demo.",
            "review_score": "-1"
        },
        {
            "review_text": "This game helped me master Pyro in Team Fortress 2.",
            "review_score": "-1"
        },
        {
            "review_text": "I´m very confused",
            "review_score": "-1"
        },
        {
            "review_text": "ILL give you a Like if you add a creative mode to the game. This game has Aesome Graphics but i do not like games where i cannot do something. This needs to be more 'Survival'. Something like constructing Habitats, Oxygen state, Rovers ect. Ive expected more then this Exploring s***.",
            "review_score": "-1"
        },
        {
            "review_text": "Yup. My uninstall feature still works.",
            "review_score": "-1"
        },
        {
            "review_text": "i didnt know a game could be so amazing... ly bad",
            "review_score": "-1"
        },
        {
            "review_text": "The question is  If there wasn't an invisible wall, would i would have kept the game?  Nope.",
            "review_score": "1"
        },
        {
            "review_text": "so first of this isnt horrible ppl just suck at games u can dodge the rocks pretty easy i got hit by like 3. next ive gotta say dont tell me free game then i play a demo not cool this is no game it a demo period. finally the movement was well done i enjoyed it made me feel like i was walking on the moon. so for me this game 3/10 biggest thing that losses this games rating is the fact that its a damn demo not a game ",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed playing it the first time I played it, but I just installed it on a new device and the game won't load, and has the (unknown error) message pop up instead. Is this an installation bug or something because even when I uninstalled it and reinstalled it it did not work...",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to 'Universe's Public Enemy Simulator 2015' Quick guide on how to survive :  1/ Go straight to the nearest point 2/ Pray for 10 minutes 3/ The end  I can't say 'don't try it' because it's free, so take a look if you want to experience 10 minutes of random meteorites crash.",
            "review_score": "1"
        },
        {
            "review_text": "If you like having your ears bleed every second, like these next gen graphics, meteors falling every 0.00002 secs, crashes so much you get aids, then this is the game for you! I really love this game, everytime I play this I want to commit suicide. 10/10 would hang myself again. But really, this game sucks, it looks like 2 yr olds made this game.",
            "review_score": "1"
        },
        {
            "review_text": "For what it is, not bad really. While it is keep in mind it is a very early demo. I enjoyed the feeling of being an astronot stranded out in space. I really hope they add a building element or something but I really did like it. Just that for the love of god change the metor hiting freqency. I had to bounce every few seconds or I got hit.",
            "review_score": "1"
        },
        {
            "review_text": "its good just not completed",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for a total of 20 minutes I can confirm that I have been diagnosed with multiple cancers and I'm pretty sure that this game triggered it. Also my friend who was watching me play lost all of his teeth. So if you're looking to slowly commit suicide through incurable ♥♥♥ cancer then this is the game for you. 10/10 - I would highly recomend playing this.",
            "review_score": "1"
        },
        {
            "review_text": "*booted the game *got to unknown signal *couldn't interact *gave up *quit *unistall *has good unistall",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥ is this garbage ♥♥♥ game holy christ",
            "review_score": "1"
        },
        {
            "review_text": "Ran into an invisible wall that prevented any advancement.  Not that I wanted to advance anyway...",
            "review_score": "-1"
        },
        {
            "review_text": "some ♥♥♥♥ing invisible wall",
            "review_score": "-1"
        },
        {
            "review_text": "its not working when I log in and I am mad these people need to fix ther game! NOW!",
            "review_score": "1"
        },
        {
            "review_text": "well its cool and it does make you 'gasp' but its so short all you do is walk get hit by an astriod walk some more and boom done the game is over",
            "review_score": "-1"
        },
        {
            "review_text": "Oh hey, I'm in space...",
            "review_score": "-1"
        },
        {
            "review_text": "did not like this game, i was stoaked cus i love spacew games, and i really just wanted to try this out, i was about to tell my friend to download it and play it with me but then i got like 1 1/2 min, hoping ther ewould be somehting interesting about it... not a damn thing. i was honestly excited.. until i hit an invisiable wall.... and kept getting hit by invisible asteroids which never give a danger icon... and notice that i moved at the speed of molassas",
            "review_score": "-1"
        },
        {
            "review_text": "very boring and the game is broken, invisible walls prevent you from reaching destinations",
            "review_score": "-1"
        },
        {
            "review_text": "Great concept, but was executed terribly. After a long, slow, boring walk dodging meteors every 2 seconds I got to a marker and nothing happened. What was I suppose to do once I got there? Why is Mars DLC? Why is this game on steam?  69/420 - would get drunk again on the moon",
            "review_score": "-1"
        },
        {
            "review_text": "Very boring ...",
            "review_score": "-1"
        },
        {
            "review_text": "what a truly awful game you get to the checkpoints and there's a thing on the floor, but you can't do anything else  lmfao this is just so hilariously bad  Pros: -I liked the movement system. -I liked the texture quality. -I liked the cataracts-style visuals. -I liked bouncing the meteors on my head.  Cons: -I didn't like the annoying, 14-year-old, American girl talking to me. -I didn't like the fact that the rocks seemed to always be aiming for my precious face. -I didn't like music. -I didn't like the rocks. -I didn't like the signals. -I didn't like this game.  It took me three minutes to download this game. It was totally free and I'm at no loss for playing it...  ...yet I still want a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "YOU CANT EVEN ACESS THE WHOLE MAP",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible! this game was a waist of time, yea played less then 1/2 hour thats all it takes to know it sucks. can only get to one point which is a bag that you cannot do anything too. the other ponts have an invisible wall before them.. you cant to a single thing in thie worthless game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a lot of potential, very good graphics. Minor map bugs, astroids disapear and hit me out of no where, but sill good. I can only seem to go to one of the signals. The others wont let me past 745-750 meters. If an update comes out I'll play more of it, possibly record it and put it up on my YouTube, but right now, it is not good enough. It was fun, but I 'died' and it didn't stop me. Graphics need touvhed up, brightness on the moon needs to go way down, but it ooks really good.",
            "review_score": "1"
        },
        {
            "review_text": "okay so at first im like 'oh this is kinda cool unrealistic for a change XD' then i start walking for a few minutes... oh look theres an invisable wall! -.- then i just closed the game and im never playing it agine... and the people who made this game if you want to make money make it more realistic no invisable walls and have some sort of back story of why theres so much stuff falling from the sky! and then it will still probebly be a crappy game but sell it for like 4.99 and hope you get some $$$ and also make it so theres more to it like you have to gather oxegon and build a place to survive and get food and such dont make it just endless WALKING AND WALKING to an invisable wall... but i mean what did you expect from a game called GASP? xD",
            "review_score": "-1"
        },
        {
            "review_text": "dumber than a bag of hammers",
            "review_score": "-1"
        },
        {
            "review_text": "I never thought a space walking game would be terrible so when i saw the mostly negative I was entirely like: there's no way it can be THAT bad, i arrived at ONE site, becauset that's how big the map is, i tried walking to some of the further signals and just couldn't get there because of the old native game changer: invisible walls, 0/10 would not play again",
            "review_score": "-1"
        },
        {
            "review_text": "You hit the edge of the world before the finding the markers! It was impossible to continue walking 'on flat ground' (Jumping to get out of large craters worked)  More testing need - thumbs up for effort :)",
            "review_score": "1"
        },
        {
            "review_text": "You can't do anything in this game but jump around and get hit a stupid amount of times. At first it was super cool but you can't do sh*t. It would have great potential if you could actually play without hitting walls and having the game crash.",
            "review_score": "-1"
        },
        {
            "review_text": "This game feel like you're playing someone's suicide note.",
            "review_score": "-1"
        },
        {
            "review_text": "invisible wall preventing to move to my objective.................. uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Quick to uninstall   Cons: Game does NOT hold your hand.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible game. The asteroids there to hit you yet they fail to even do that. Then there is the objective which you cannot reach because of some invisible barrier.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just a moon walking simulator, do not waste you time with it. If you want you can pay for a Mars walking simulator, but that just a terrible skin. You walk to these signals and if you walk to one that is too far away you walk into a invisible wall. The 'enemy' is asteroids that really pose no threat they just hit you and bounce away. Your only real challenge is not killing yourself for playing this awful game. This is game was so bad I had to write a review, enough said.  Note to the devlopers, quit trying to make game and go work at McDonalds so you are contributing the soicty because I promiss you are not as devlopers. I would go as far as saying you are making the world worse.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is horrible do not play ever",
            "review_score": "-1"
        },
        {
            "review_text": "impossible to win, invisible walls right by all the signals so i cant really play the game, how in the hell did this get on steam? how has it not been taken down? questions i ask myself as i realize it is impossible to win, so dont get this game its a waste its stupid it shouldent exist.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont get your hopes up, if you managed to have any.  For a game focused on objects hitting a surface, the impact LOD is very poorly done (rubber ball physics and despawns)  For a game focused on walking in space, the space walking is poorly done (invisible walls everywhere)  For a game that warns you at load that dying is your fault... I found it very hard to die.  Actually, I'll just stop the list here - its all very poorly done.  PROS: You dont have to wait for Valve to refund the game after logging less than 2 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "Walking Simulator 2016  You walk and walk and ignore everything and when you get close to your objective you realize that the developers have an invisible wall preventing you from moving more than like 1500m from your ship and most of the signals are 2k+ out  Save your time. This 'game' is a total rip off, even for a free game. No way to win or lose, getting hit by asteroids does nothing (You can even see THIS in the trailer), and running out of oxygen just displays 'DEAD' on your screen without actually killing you, allowing you to walk around like the zombie you feel like when you 'play' this 'game'. Heavy emphasis quotes. There's the traditional red screen flash for damage, but it happens at random intervals and the 'damage direction' doesn't point to anything, and there's no health system anyways so it's pointless.",
            "review_score": "-1"
        },
        {
            "review_text": "Why does this even exist? BTW DON'T GET THIS GAME.I beat it in 20 minutes",
            "review_score": "-1"
        },
        {
            "review_text": "Yep. They were all right. This game blows. I made it to the closest signal and HEY nothing happened. I just stared at a box on the ground. And so I made my way to the next one. But it was walled off by some invisible wall. Cool. All the while I was being pelted by asteroids/meteors/golf balls that should not exist, because if these rocks ACTUALLY fell on the moon at this alarming rate, then they would either eventually destroy the moon or the moon's surfaced would be covered in individual boulders. Unless of course there's some nearby planetary catastrophe that this game just declined to tell us about. SO whatever. It blows. Good job making a functioning program for computers. Bad job making it fun at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I can not possibly describe how bad this game actually is. I read all the bad reviews and promised myself i would beat this game. You dont have to play more than just a few minutes to find out its impossible to beat the game.  Problems? Oh i dont know...  1. Only instruction is to meet up with the 'others' who dont even seem to really exist. 2. Once you actually get to the signals, it doesnt tell you what to do, there is no interaction with the signal and there's not even anything at the signal. 3. Im pretty sure 5 asteroids the size of small houses dont hit the moon ever milisecond. 4. No matter what direction you are walking in, no matter how high you jump, every asteroid is flying directly at your face. 5. Just because every asteroid is flying at your face doesnt mean they kill you, they do a max of -3% to your oxygen level. 6. On the issue of damage, why am i always recieveing random damage from 2350 meters away from where i am? 7. Random invisible wall... no way around... 8. Barrell rolls... a lot of barrell rolls... involuntary barrell rolls... 9. I dont understand why or how the mouse is only partially tied to how you look around... the cursor is still visible and can move the whole way across the screen before you even turn 90 degrees. 10. The suit is a prototype... a PROTOTYPE... and you are making me walk for thousands of meters... in a PROTOTYPE SPACE SUIT!? 11. Why is a child telling me what to do and yelling at me? 12. Wait... you mean to tell me this game came out in 2015 and had issues like THIS? 13. Useless achievements are useless. 14. It's a permadeath game (once you die you start all over), that would be perfectly fine if there was anything to lose when you died... you gain nothing from anything. the signals are dead ends and literally nothing happens when you get to them. what is the point of losing all progress when you dont even make any? 15. The game exists. 16. Its a prequel?.. or something?.. idk, its just bad.  Pros though? 1. It's free. 2. Um... no, one is all it has...",
            "review_score": "-1"
        },
        {
            "review_text": "An honest opinion of this game.  Upon the game, You are greeted with a message which tells you you only have one life in this game. I have no problem with this feature, if only it actually worked. Death is a very hard thing to achieve in this game. The closest you can get to death is a bloody screen and the word 'Dead' on your O2 meter.  Graphics are not overly bad in this game. I only have a standard quality graphics card and it ran smoothly on it. The wallpaper that is meant to be space is rather inacurate. The size of some of the satelites would mean that they had been somehow frozen in time as they fell towards the Moon (unlike the unrealistic amount of generic meteorites only capable of making you blead out of your face). The walking animation is just... interesting. It seems as though you are attempting to take the longest strides you possibly can in an attempt to walk the 3 miles a bit faster.  The objective of the moon map (as issued by a 10 year old sounding boy/girl) is to locate other team members before your oxygen runs out. There are too many issues with this objective. You don't find team members, you find small metal flashing objects laying on the floor. These objects cannot be activated and 4/5 of them cannot even be reached. Invisible walls stop you from reaching most of the objectives. Meaning you just spent 20-30 minutes walking towards a piece of metal and a wall.  10 minutes after my O2 meter started reading 'Dead', the meteorites stopped hitting the ground. Instead they just despawned in the sky above me. Unfortunately for me, this was when I was contemplating running into the meteorites in order to attempt to kill myself and end it all. I decided to head back to the crash site and wait for the game to just kill me. In the end, I just quit of boredom.  If you plan on confirming the functionality of your 'w' key or your steam uninstall feature then this is a good game for you!",
            "review_score": "-1"
        },
        {
            "review_text": "ive seen blank paper thats less bland and boring than this",
            "review_score": "-1"
        },
        {
            "review_text": "  Why, in an open world game setting where the players objective is to reach a certain waypoint, would you have invisible walls keeping the player from reaching four of the five waypoints?  The asteroids are a bit excessive. I understand the developers needed something more then just the players lack of oxygen, but throwing non-stop asteroids at the players face that take away large amounts of 02 is simply rediculous. Especially with the asteroids occasionally changing directions.  The game has potential, but thats it.",
            "review_score": "-1"
        },
        {
            "review_text": "dit some in the dev team make a mistake releasing the game early",
            "review_score": "-1"
        }
    ]
}