{
    "app_id": 412660,
    "name": "Klang",
    "release_date": "2016-09-22",
    "developer": [
        "Tinimations"
    ],
    "publisher": [
        "Snow Cannon Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Rhythm"
    ],
    "achievements": 24,
    "positive_ratings": 80,
    "negative_ratings": 19,
    "price": 10.99,
    "description": "Klang is an innovative take on traditional rhythm games that pushes the genre beyond pressing buttons to tempo into a world of fast-paced exploration, platforming and combat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/412660/header.jpg?t=1537548259",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Windows 7 Processor: Intel Core i7-2670QM 2.2GHz Memory: 4 GB RAM Graphics: GeForce GT 630M DirectX: Version 10 Storage: 2 GB available space Additional Notes: Because Klang is a 2D game, some laptops will default to running it off of their integrated GPUs. If you plan on playing Klang on a laptop, we recommend that you run the game off of your dedicated gaming GPU. (NOTE: If Klang detects that your laptop is using its integrated GPU, instructions for how to switch to your dedicated GPU will be provided in game.)",
    "recommended_requirements": "Requires a 64-bit processor and operating system Graphics: GeForce GTX 580 Additional Notes: For an optimal gameplay experience, we recommend playing Klang on desktop computers with PC monitors.",
    "reviews": [
        {
            "review_text": "Stylish rhythm based combat and platform game, with super cool art, great music, interesting story sequences with good variation in challenges and pacing. If you dont like this game then you are the problem, I am sorry. Will have your tapping you feet and smiling within a minute of playing.   And it refuted my wife claim that I don't have any rhythm. Next, the dancefloor! ",
            "review_score": "1"
        },
        {
            "review_text": "It's days like today when i'm especially glad my gaming rig is hooked up to a home theater with a big sub. Sounds siiiiiiiiiiiiiiiiick. Hardest part is staying in your seat.",
            "review_score": "1"
        },
        {
            "review_text": "Met the dev and composer at PAX West and they were fanstastic. You could really tell how excited they were for the game and in turn it got me SUPER EXCITED. I am so glad the game is out now for me to listen to this soundtrack all. day. long.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game a lot. its great very fast",
            "review_score": "1"
        }
    ]
}