{
    "app_id": 412740,
    "name": "Audioshield",
    "release_date": "2016-04-05",
    "developer": [
        "Dylan Fitterer"
    ],
    "publisher": [
        "Dylan Fitterer"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "VR Support",
        "SteamVR Collectibles"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "VR",
        "Music"
    ],
    "achievements": 0,
    "positive_ratings": 2080,
    "negative_ratings": 426,
    "price": 14.99,
    "description": "Block the beats! Audioshield puts you at the point of impact for every hit in your songs. Block incoming orbs with your shields and feel the music. Works with any song!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/412740/header.jpg?t=1538782448",
    "minimum_requirements": "OS: Windows 7 SP1 or newer Processor: Intel® i5-4590 / AMD FX 8350 equivalent or greater Memory: 4 GB RAM Graphics: NVIDIA GeForce® GTX 1050ti / AMD Radeon™ R9 290 equivalent or greater Storage: 900 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a drug for my brain, I zen out in a reality that doesn't exist then look and see an hour has gone by, I'm sweating and tired and out of breath.   This is, without a doubt, the number one reason to have a Vive.",
            "review_score": "1"
        },
        {
            "review_text": "Simplistically awesome game.   1. Stop sitting down, 2. Stand Up. 3. Get your headphones on. 4. Stick the volume up as high as it will go. 5. Select your track. 6. Hit start. 7, 8, 9 &amp; 10 . Smile :)  Yes, there are things that could be better but saying that, there could be for over 99% of all games out there.   Enjoy it, embrace it.   My VR Project ",
            "review_score": "1"
        },
        {
            "review_text": "VR's version of Dance Dance Revolution -- but hundreds of times better. Really great game for VR parties, and definitely a must have for the HTC Vive.",
            "review_score": "1"
        },
        {
            "review_text": "You can play any song from Soundcloud, and browse Soundcloud easily within VR. Like other rhythm games, it doesn't really match well at easier difficulties. So set that puppy to Hard and get... shielding?",
            "review_score": "1"
        },
        {
            "review_text": "I lost 12 pounds in 4 weeks with these easy and simple steps!:  1. Purchase Audioshield (Vive not included). 2. Play Audioshield until you've mastered the hardest difficulty. 3. 'Screw this, I'm getting a modded difficulty, I can totally handle it.' 4. Cry in a corner after spectacularly failing the modded difficulty. 5. Make up an excuse to not use modded difficulties. 'This isn't an official difficulty, bleh.' 6. Play Audioshield while knowing you'll never be anything like a DDR professional, you pathetic pleb.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wonder what it is like to be ATTACKED by your favorite songs without the use of LSD? Or perhaps WITH the use of LDS? (Whichever your preference.)  Well, look no further. (RIGHT?!) You can search your favorite songs on youtube and at Hard or Elite it's a complete onslaught, depending on the tempo. And it has LEADERBOARDS!  I love the songs that start slow then absolutely HAMMER you. Something like, 'Peter and the Test Tube Babies - Let's Burn'. (Stinkfist)  For some reason my favorite in this game is, 'Sticky Fingers - How To Fly' IDK WHY! But I find myself moving just like him in the music video!! (It's f'king weird...)  I wasn't expecting much from this game. And i KNOW i look like a g*ddamn IDIOT playing but I know I'm doing that VR smile and don't care. Search your songs on Youtube. It's pretty awesome.  My g/f said I was punching like crazy. (now she has a PFA on me.)  A few WISHES i have are... 1) Remember what I last played. (sick of searching the same songs) 2) See what songs people have played recently. (I wanna challenge them on THEIR favorite song!) 3) Maybe a favorites list? Save the URLs? IDK. SOMETHING!  THOSE are my ONLY gripes. They have a Popular songs section, but screw that. I want to know what people are playing RECENTLY.  Other than that, it's lovely. Make sure your momma don't walk in front of you. You might pop her in the jaw with a mighty SHORYUKEN uppercut... (or Tiger Uppercut. Depends how tall you are..) and she'll look like like a Deadhead.  If Bruce Lee were still alive.. he'd be the master of ELITE. You gotta be QUICK! I could see this game being beneficial for a boxers training regimen. POW! Goodnight IRENE!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome! It works with so many different genres of music (I've tried classical, rock, jazz, film scores, Disney...) and the only one that didn't work quite so well was techno, as the algorithm struggles a bit with the music's 'stuttery' nature, messing up its reading of the tempo. While playing it with some songs, it really helps you appreciate the different layers to the music, often that I didn't even realise were there. And when pieces slow down or speed up, its really easy to feel it happening with the action. 10/10 the best one I played on it would be Hall of the Mountain King by Edvard Greig. Its build up feels legendary!  TL;DR More than worth your money .",
            "review_score": "1"
        },
        {
            "review_text": "Audioshield is very good, but I wish development was more active. There is still such potential for this game but who knows if it will ever be fully featured. Crashes normally, orbs can be retweaked, but still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Audioshield has to be the best bang for the buck VR currently available and a truly unique VR game too. I would describe it as a Guitar-hero-esque rhythm game in a catch the missle style.   The game has many many reasons to be bought:  -With a price of 19.99 Euros, it is one of the cheaper VR-titles -It runs fine, even on mediocre Pc´s -While playing, the risk of smashing something is rather small, as you do not have to move around a whole lot ( if you aren´t going batshit crazy when playing the game) -The ability to use your own music is a godsent, but even without a huge music collection, you are provided every day with a playlist of popular songs to play -The representation of your songs is very often on point, far better than I could ever have imagined! The game is not perfect, as only the most prominent notes are being picked up, even if it isn´t the melody or the bass-line, which is to be expected. -Leaderboards provide a welcome challenge, and the possibility to be notified by mail, when you have been beaten in a song is a funny addition too  However, there are also a few ( nitpicky ) downsides which aren´t to be ignored:  -For me, the sound output which I activated in the VR menu isn´t being respected, the sound then suddenly coming from my speakers when the game starts, even tho´ I put the output to the HDMI output. I solved the problem by mirroring the sound output to both my speakers and the HDMI. -The game is far too easy. Even when I pick the hardest difficulty, there have been no songs in which I had under 90% of correct notes - The music-selection menu gets a bit cluttered, the songs not being separated on pages but one ongoing cluster with all your songs  Furthermore, I have to give the devs credit for fixing reoccuring problems very quickly. For me, the game is a must buy for any VR- or Music-enthusiast.",
            "review_score": "1"
        },
        {
            "review_text": "Audioshield is made by the same team that made Audiosurf. It's a rhythm-based VR game with a very simple premise. You have a blue shield in your left hand and an orange shield in your right. You choose a song to play to, which can be a suggested song or one from your music library (same as Audiosurf).  As you play, projectiles are fired towards you; these are either blue, orange or purple in colour. As they reach you, you 'block' with the corresponding colour shield. Purple shots are blocked by holding both shields close or pulling both hand controller triggers (on HTC Vive).  At the end of the song you're rated based on how many shots you blocked but also how artistic you were and how much energy you expend. Basically, play enthusiasticly, move around a lot and you'll get a better score provided you still manage to block shots well.  The difficulty curve is well done; the lowest difficulty is extremely easy, but high BPM songs in higher difficulties can be a huge workout.  Overall I think this is one of the 'killer' apps for Vive; just give whoever's playing a lot of space as you tend to lash out a lot! Very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Much like Audiosurf, Audioshield is made to react to not only music from the internet, but to your own music as well. Each motion control is a different color shield, as you frantically or 'artistically' match them with the corresponding colored bubbles flying at you. The faster the song, the faster the bubble velocity. The harder the difficulty, the better it syncs up to the chosen song, although do not expect the algorithm to be perfect, it's very much like Audiosurf and does not sync well with every single song. Global, local and friendly leaderboards keep track of who's the best at the game for each song, assuming they're not constantly pausing the game. Either way, it is loads of fun within the HTC Vive and probably currently one of the best virtual reality games available on the market. Equipped with a few graphical options and a couple different environments, this extremely immersive, fun and a bit psychedelic game will give you a work out. That is, if you have more music in your library than slow, sad songs.  The game is being patched up quite nicely and it is hands down, loads of fun.  Buyer Beware: This game does not read Protected files. If your music library, usually consisting of content bought from iTunes back when DRM was an issue, has Protected file types, then Audioshield will not read them. Almost all other music file types are supported. However, this game now supports YouTube search &amp; streaming.",
            "review_score": "1"
        },
        {
            "review_text": "Turns any song into a virtual reality rythm game that will have you punching and flailing to keep the pace.   This game is not only a hell of alot of fun to play, but is also a fairly decent workout...  If you want to really get a workout, get yourself some arm weights, and edit together a few songs into one long song.",
            "review_score": "1"
        },
        {
            "review_text": "This is easily one of the favorite games to play on our Vive in our living room. My SO is not a huge gamer but enjoys the Vive and she *loves* playing this game. Playing the end of Daft Punk's 'Giorgio by Moroder' in this game is one of the best, most intense VR experiences I've had so far. I'd love to see more work on this game: The UI could use some work when picking the song and starting a game. I'd love to be able to restart songs I've already played. We'd love to get the full screen properly displayed on our TV when someone is playing. But when you're in the headset fighting a song, all is forgiven. So much fun and a great way to get your heart rate up.",
            "review_score": "1"
        },
        {
            "review_text": "This game is too buggy at the moment to recommend. It crashes often and doesn't close in the background which means you can't relaunch the game or any other game either. You will have to restart your computer or find the program in task manager if you know what to look for and close it down. Very annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "A must-have!   Multiplayer mode would be be nice ;)",
            "review_score": "1"
        },
        {
            "review_text": "This is a must have game. Seriously, I wake up early everyday to play this. If it were the only game available for the Vive I'd still recommend buying a Vive just for this.",
            "review_score": "1"
        },
        {
            "review_text": "Audioshield is a must-have game for VR. While it isn't perfect - in particular, the algorithm could do a better job synchonizing with the beat in some songs, and a constant note speed instead of variable based on the song tempo would be much better - those cons are far outweighed by how fun it is.",
            "review_score": "1"
        },
        {
            "review_text": "Now that I feel completely certain that they've resolved the crash on launch bug I was having I feel like I can finally recommend this game.  How much mileage you'll get from Audioshield really depends on a couple things:   Do you love music?   Do you love feeling like a badass but looking like an idiot to bystanders?   Do you want to burn off some calories from all that beer you drink?  If you answered, 'Yes,' to any of these questions, chances are you'll enjoy Audioshield.  The gameplay itself is fairly limited, hopefully they'll add additional 'modes' at some point that mix things up a bit. There are only two different stages you can play in, and the code for syncing the orbs to your music can be a bit hit or miss (I'm  really  hoping they can improve on that).  But, when everything syncs up properly, and you're pumping your arms to your favorite music like some kind of maniac while trying to fend off hundreds of colored orbs.. It's a truly magical feeling.",
            "review_score": "1"
        },
        {
            "review_text": "One of the few games that still makes me smile like the first time I was in VR",
            "review_score": "1"
        },
        {
            "review_text": "When I watched videos of this game in action, I honestly wasn't interested. But I gave it a try and I can certainly say this is one of the best games for vive avaliable at this time.  The game is extremely immersive and addictive. Would highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun and amazingly simple. Even the people I've shown this to that don't play any video games seemed to have enjoyed the experience. Very very fun. With the right song playing, it makes you feel like you are a superhero saving the world.",
            "review_score": "1"
        },
        {
            "review_text": "Audioshield is probably the most important VR game to come out. Not only is it an engaging way to experience your music but it is also one of the best VR games out at the moment.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play and works up a sweat while listening to your favourite tunes!",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely incredible experience for me. Once I'm in Audioshield I'm in for a while as I hunt through the perfect songs to flail around to. I'm usually knackered afterwards though!",
            "review_score": "1"
        },
        {
            "review_text": "I like to call this White Boy Dance Trainer. Sick of your old white boy moves? Your sprinkler move not getting them wet? Baconator not getting the sizzle you want? Running man causing all the gals to run away? Well if you feel the need to be a 'Jerk' because you have no rhythm and run away to find yourself joining the carnival and making it big inventing glasses handlebars then this is the game for you! Immerse yourself in the game until you come out a new man. Then you can go to your next block party with confidence! Pull out your best Audioshield AC/DC Thunderstruck moves and watch all the girls say that you are pretty fly. For a white guy.",
            "review_score": "1"
        },
        {
            "review_text": "Ugh. I wish I could give it a thumbs up. But I just can't. The main reason is that I don't feel like the movements match the music. I feel like I am chasing colored balls while listening to music, rather than leading an orchestra. For that reason I feel like the main object of the game has been missed.",
            "review_score": "-1"
        },
        {
            "review_text": "Think I'm going to end up refunding the game. I understand why people like it, but the randomness really irks me. I want to get into a pattern with the music (like you do when making music) but your constantly forced out of the song and adapt it it's chaotic randomness on what it thinks you should be doing.  Id really like to see a version of this game where, like Osu!, players can choreograph the songs more intelegently and share their files.  Also the lack of sound in the game is perplexing. There's not music in the menus, just dead silence, and I'd expect some kind of audio feedback for hitting the orbs (which would be adjustable). To me it's like there two different things going on: Cool music you like, and a VR pong game that doesn't quite match the music.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game for the Vive, a must buy for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "I can't decide if I like it or not. Aside from Bugs and crashes (the 720p-beta branch helped me avoid those at least).   The idea is great, but somehow it just isn't as fun as I expected.  You can choose your own songs, which sounds great, but actually isn't, because the speed of the bubbles seems to depend the frequency of bass.  If it's a quick song with only a few low bass notes, it feels extremely weird, because the bubbles actually stop moving for a second until the bass hits again. At first I thought that it just wasn't running smoothly, but I testet it with different songs and there is definitely a connection.  I expected the general speed of the song to determine the speed of the bubbles and the heigth of the notes influence the position of the bubbles which would feel a lot more intuitive, I think.  All in all, I feel it's not actually worth 20 bucks. It's fun, but feels more like a tech demo rather than a full (-priced) game.",
            "review_score": "-1"
        },
        {
            "review_text": "I very much enjoy this game or experience as it more so is. It is an absolute blast to play.  Think of it as your own private dance party. Easy reminds me of when playing other rhythm games on easy, helps you learn the mechanics, but switch to the next level quick and it's actually easier as it follows along with the music better.  I haven't tried putting in my own music yet, but the search does a decent job of grabbing most of what I want off SoundCloud so far. I highly recommend this, it may quickly just become my top VR experience, I have a top 3 and I promise this is in there and won't fade anytime soon. The workout you get from it is also just simply amazing, almost always panting and maybe sweating a bit after each song, get it now!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. It gets you moving.",
            "review_score": "1"
        },
        {
            "review_text": "If you're planning to use this with metal music, you probably will not get good results. Same goes for calm music. But the songs that the game handles well, are amazingly fun.",
            "review_score": "1"
        },
        {
            "review_text": "buggy as hell. Does not run at all! Don't waste your time when you're just gonna get a refund after you discover how horribly unplayable it is. Also, orbs rarely sync to the music. Would be fun if it worked properly!",
            "review_score": "-1"
        },
        {
            "review_text": "Videos don't really capture how fun this game is to play. Really satisfying. As with the Audiosurf games, the UI is kinda ugly and a little clunky, but all those issues kind of fade away once you start punching beats.",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun. This is deffinately a must buy for the vive. My only complaint is the currrent shields, I would love a boxing glove type shield.",
            "review_score": "1"
        },
        {
            "review_text": "I had no idea I would like this game this much! Before getting the Vive this was probably my 10-15th most anticipated game, now it's easily in my top 3 favorite Vive games so far. I used to like DDR back in the day, and never really got into any other rythm/music game so I was a bit apprehensive but man, there's just something about getting in a good song and feeling like red and blue paint is flying down on you while you play... so fun!",
            "review_score": "1"
        },
        {
            "review_text": "While the game itself is awesome and I loved it first, the developer's support is non existing. So if you've got some problem or suggestiongs never expect any reaction, unless that's something that affects absolutely everyone and is game-crashing. That attitude killed it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Block the beats of your favourite tracks. Utterly awesome. So muchore compelling than you'd imagine.  It'd be perfect if (a) there was a harder difficulty setting and (b) you could chain together songs or do whole albums. It's a great workout!",
            "review_score": "1"
        },
        {
            "review_text": "One big problem: The balls should shine, sparkle or change the colour when its the perfect moment to hit them!!! By that you know if you are in the rhythm or not. Else you dont know if you punch too early or too late. It's actually really easy to implementate, so please do this and i will change this comment to a postive one :)",
            "review_score": "-1"
        },
        {
            "review_text": "Before the new updates, this was by far my favourite Vive game.  Now whenever you miss an orb its like getting hit with a flashbang.",
            "review_score": "-1"
        },
        {
            "review_text": "Music synthizer is ♥♥♥♥.  Any song with little beat doesn't work with this at all. Buy another better VR game like Space Pirate Trainer or Hot Dogs, Horse Shoes and Hand Grenades  ♥♥♥♥ing sucks/10",
            "review_score": "-1"
        },
        {
            "review_text": "I bought it due to hype. Play it, didn't like it. It gets repetitive. I guess if you like to listen to music all day, you might enjoy doing some activities that go along with it, this might be for you. Also, tracking was out of synch for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This has been the key game to share and play with people. It is fun and physically demanding. It is also a great way for you to blow off some steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sooo much funs! I love playing french ouse songs and rave type songs like from scooter. They will kill your abs @_@ If you are looking to lose weight in vr this is the only option i know of. The syncrinization in amazing! When the song has little to no notes to sync to it can cause the balls to behave differently like reverse or slow down wich i thought was super fun. The only issue i can think of is sometiems the balls like to go through my shields and im not sure if it is because im punching them sometiems so i just let them come to me and i block them. Anyone who is thinkign about buying this trust me you will have so much fun and work a sweat!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! It is a great way to listen to new music and groups, and it is a great workout! A must have!  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is the only reason I'm keeping my Vive. I do wish that there were more backgrounds, either made by the dev or importable through the workshop. Other than that, it's a perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "So awesome! Excellent party game!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best vr experience I've had ever had. Moving with my arms made me so tired because of this game.  And the best thing is that you have the choice to play online music or from your music library.  Faded by Alan Walker and Call me a spaceman by Hardwell are awesome songs to play with in my opinion.   The only downside of the game is that sometimes the notes aren't synced.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this is awesome. I felt like such a bad ♥♥♥. Totally felt immersed.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Guitar Hero/Rock Band, you will like Audioshield that much more. Awesome visuals to upbeat music makes for a super enjoyable environment. The frenetic pace of the gameplay is incredibly fun and makes you feel like a badass. This is a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "So far one of my favorite Vive games. Heck of workout to boot  No game is perfect and neither is this one but the negatives are minor. The most glaring is not having to have mp3's if you want a decent sized selection of music. If only you could use more streams.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game but it could have more options like ball color or a steam workshop for arenas",
            "review_score": "1"
        },
        {
            "review_text": "Amazing VR game! Depening on how you play basically dictates the type of workout you could get. If you want to take it slow, you can, but if you want high 'artistic scores' you've got to really go at, using some force and moving your body like you just don't care!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic game. Needs Spotify integration though. Get on it!",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people are really high on this. It's a VR rhythm game. I wasn't big on it, but it isn't top expensive and it's still the best music experience in VR",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best VR experiences available! If you have a vive, this is a must buy!!",
            "review_score": "1"
        },
        {
            "review_text": "One of my main go to games for a work out but its gotta be played on hard.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to give this a hesitant yes, and I'll tell you why in a moment. First, what I love about it.  It's an incredible party game and it's fun to play by yourself. Put a fan on you, put on something with a nice beat, and you will be immediately immersed in the game. Certain music works better than other types - I've found electronic stuff, namely stuff along the lines of Porter Robinson or Madeon, to work incredibly well.  Now the cons. This game has SO much potential and, in its current form, it's incredibly limited. If it weren't for the fact that you could play with your own music, it'd have the depth of a $1 cell phone game or a VR software demo. You block different colored blobs with one of three shields in two different environments, and that's it.  I may be wrong, but even though this is one of the most heralded games on the Vive, the dev seems to have dropped off of the face of the earth and, at the very least, doesn't seem to be interested in all at improving the game.  Don't get me wrong. I don't regret spending the $10. I've had plenty of fun weekends with friends playing this game, but it has so, so much potential to be built upon.",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive VR rhythm game done right. This is a must-have. Audioshield is one of the first games I get friends to play when demoing the Vive. You can use your entire music collection to create unique levels - including leaderboard support. Be sure to check and update your MP3 tags and cover images (google MP3Tag), otherwise the leaderboard function won't work correctly. All in all, money well spent.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, If you get some wrist weights and have the song bruno mars uptown funk its a great workout. and yes you can select different sheilds and difficulties (as well as upload your own songs).",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Needs an adaptive difficulty level.",
            "review_score": "1"
        },
        {
            "review_text": "First VR game I bought, absolutely fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game! I was a fan of Audiosurf prior to this, so I somewhat knew what to expect going in. But with VR I had no idea, it's incredible. When the music matches up with orbs it's a fantastic experience and on the harder levels can be a decent workout when paired with the right song. The only request I have would be Spotify integration which should be possible with a premium account e.g. DJay2 app and others.  Definitely worth the price, it ranks #1 most played in VR for me with Hover Junkers coming up behind it.",
            "review_score": "1"
        },
        {
            "review_text": "When it works it's fantastic. Slightly buggy for me though - often crashing on startup. Some additional diversity in game play &amp; backdrops would be nice in future updates.",
            "review_score": "1"
        },
        {
            "review_text": "Rhythmic, almost therapeutic, challenging in parts depending on the song and it's just so  satisfying  when those little blobs explode!  A must for the Vive.",
            "review_score": "1"
        },
        {
            "review_text": "  DDR on a Vive.   5 / 7 would reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "I've played about 25 games on my Vive so far and this is definitely my go-to favorite. I just pick a song from my iTunes library and have a great time punching blue, red, and purple glowing balls.",
            "review_score": "1"
        },
        {
            "review_text": "its a really fun game for the htc vive, this is a must own for vive owners.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the easiest games to use as a demo for VR since it is not only immersive, but also a lot of fun to play. That means I or anyone that is playing it forgets themselves and just blocks to the music. It is relaxing or exciting depending on the song you play. The procedurally generated songs are hit and miss, but when they hit, they really really hit. Definitely worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked games like Audiosurf, Beat Hazard and DDR, you'll enjoy this.  It procedurally generates a dance move pattern from your MP3s that you follow with the Vive controllers. There's extra points for 'style'. It also has Soundcloud support, so there's a huge library of tracks to play with (if you normally subscribe to a music service).  It works well in a group -- unplug the headphones and play the music through speakers.  It's really easy to overcook the arm movements, and pull muscles in your elbows and shoulders. :(",
            "review_score": "1"
        },
        {
            "review_text": "If you love Music, then you will love this game. Playing Dubstep/Riddim, Drum n Bass, and other genres of electronic music are a blast in this game I definently reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how and why, but this game makes me laugh and giggle like a child. It is a very positive and happy experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great rhythm game for the vive. A lot of fun to punch orbs to your favorite songs.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addicting, what more do you need. (its also a great exercise when going for global scores)!",
            "review_score": "1"
        },
        {
            "review_text": "Such an amazing game. It's so simple yet so unbelievably addictive.   A few more shields and stages would really benefit the game though (maybe with workshop integration for the stages).",
            "review_score": "1"
        },
        {
            "review_text": "So far the game i've played the most in VR, it has great replay-ability and promotes playing thanks to global high-scores. Great for people who love rhythm games and like to be competitive. ",
            "review_score": "1"
        },
        {
            "review_text": "The interface is a bit simple clunky, the music analyzer isn't perfect and the game could really do with some loading screens.  But besides these issues, this is an AMAZING VR experience! A must have for your Vive!",
            "review_score": "1"
        },
        {
            "review_text": "fun as hell and i am pretty sure i will lose 10 lbs playing it hahaha.",
            "review_score": "1"
        },
        {
            "review_text": "there is nothing quite like punching mini comets in the face to the beat of good music",
            "review_score": "1"
        },
        {
            "review_text": "this game gives me a giant ♥♥♥♥ eating grin on my face,",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most amazing games that I have eve played, VR or not, for its simplicity. If you are even considering buying a Vive, this should be in your collection.",
            "review_score": "1"
        },
        {
            "review_text": "+ The more fun you can have with vr right now + Its close to dancing + The fact that you can choose your own music makes the OST of this game awesome :) + The bubbles colliding with your shields feel great + The generator of bubbles patterns is between good and excelent   +- I have a huge mp3 collection, but if you dont, it only uses soundcloud for songs. The popular ones on soundcloud are good enough but Youtube access would be a great adition to look for songs (and maybe video playing) +- UI is not very polished. I cant favourite songs, I dont have access to previously played songs, navigation is slow, it doesnt rememver your shield selection from the previous song, etc. Good enough tho +- Harder mode is not that hard. Ive had almost perfect songs on harder mode on my first try. Not bad per sé, but id like to have room grow and try even harder settings for songs I like +- At first, you try punching the bubbles instintly, which makes the shape of the shields feel weird. After you realize you are supposed to 'shield' from them like they were arrows, it feels better. They kinda encourage punching them with points (artistic value points, aka movement), so im not sure they got that idea right  - 'Slow' loading times. There is no reason you cant select the song and play on the same virtual scenario. It would make the loading times dissapear - Not a lot of variety on terms of what you have to do. Id like more shields, more colors, more scenarios, more complexity :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. It looks simple, and is simple in premise, but if you enjoy rocking out to music, this gives you something to move to while doing so. You can get sweating, too. Works with a variety of music types, though some songs work better than others. It is not always predictable what songs work best--I've been surprised by some slower songs that end up having more complex ball patterns.",
            "review_score": "1"
        },
        {
            "review_text": "I have been going 2 hours a day on this game. It is probably the most fun rhythm/dance game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, Audioshield is the Vive's 'killer-app' launch title.  It's basically sort of like Dance Dance Revolution, but with your hands, crossed with Audiosurf, except in first person. Rereading that sentence, I don't know if I've made it sound pedestrian or exciting, but I assure you it's the latter.  If you own a Vive, this is pretty much a must-own. The menu UI is a little rough-around-the-edges, but the game inside it is so good (and pretty, for that matter) that you won't really care about that.  PROTIP: Don't use your library of soothing smooth jazz for this game. :P Bust out something uptempo with a lot of energy behind it instead-- dubstep, heavy metal, hard rock, house, hiphop, eurodance, etc. are all good choices. (If you want a real endurance challenge, try 'Sandstorm' by Darude.)",
            "review_score": "1"
        },
        {
            "review_text": "This game allows you to enjoy all of your favorite songs while smashing glowing orbs flying at your face. If that doesn't sound awesome, I don't know what is. It is easily one of my favorite games for VR, and is my most regularly played games since I got the Vive.   Unless you hate music, get this game!",
            "review_score": "1"
        },
        {
            "review_text": "A Vive Must have.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, priced just about right for VR games at the moment. However, if this game was 2D for example and was played with a controller id say maybe $8 tops. But the VR part makes it worth it if you are on the fence.",
            "review_score": "1"
        },
        {
            "review_text": "I can see myself putting alot of time into this game. Right now I have plenty of new and exciting software to test and play around with. But audioshield remains one of the VR experiences I keep returning to between new games.   Huge amount of replayability with the ability to add your own music and search online for tracks to set high scores with.   Good sound good graphics. The controls are intuitive.   I would like to see more arenas in future.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, yes, yes, get this game. But developers! Where is my co-op/multiplayer DLC? I haz monies, you can haz them for friendships! Honest to goodness, this is my absolutely favorite VR game... and my wifes even though she hates video games.   Now back to being a hero saving the world from the orbs.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the main reason for why I enjoy my Vive so much. It's true that the beat isn't always in sync with the music, but despite this, I play this every day constantly trying to beat the scores of others while enjoying some fast-paced music I don't normally listen to. It's expanded my taste in music and has given me a new appreciation for music I've listened to before.  The only real con I find in this game is its soundcloud integration. There isn't a huge selection for artists on soundcloud; maybe only 5-7 songs per artist. If more people/artists uploaded to soundcloud, this would be far more incredible than it already is. You'll have to stick with what you have for the moment.  Would highly recommend this over most other VR titles.",
            "review_score": "1"
        },
        {
            "review_text": "This is great fun. Not every song is perfect but, most of them translate really well to the experience. I'm having a blast rediscovering my old library of mp3s, and getting a workout while doing it. I would suggest downloading a difficulty mod. I use the 'expert' mod myself and it makes the whole thing 10 times better. It's deffintly worth 20 bucks, and so far, it's the most enjoyment I've gotten out of the Vive.",
            "review_score": "1"
        },
        {
            "review_text": "As an former breakdancer thtat has gotten out of shape, this has been best and the most enjoyable workout in a while!  10/10 Summer body 2017 here I come!",
            "review_score": "1"
        },
        {
            "review_text": "This shouldnt be fun. Why is this so fun?  You wont regret buying this",
            "review_score": "1"
        },
        {
            "review_text": "One of the best VR experiences so far. Also it's a great light cardio training. Awesome.",
            "review_score": "1"
        },
        {
            "review_text": "It's the base game mode of Audiosurf except you have to punch the coloured notes with the correct fist. Very basic but a good workout. My experience is that notes will only sync up to the music about a third of the time depending on song type, so it might be disappointing to rhythm game players.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best part of this game is you can play anything from your own music library in it and not have to download countless songs like other rythem games. The game is fun, it's a great work out, and I have really enjoyed it. I don't see myself sitting down and playing it for hours on end at a time, but I like to go in and play a couple songs before heading into another VR game. I hope they expand more environments for playing in, it's a good challenge on hard and higher modes, and still a good work out but not too tough on the lower settings. I have had no bugs or crashes with this game, works everytime. Lots of replay value here, just not something your going to play hours at a time unless you want a heck of a workout.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended!  I didn't think I'd like this game nearly as much as I do. At the very least you're going to et a good workout =)",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this game. Totally recommending it to anyone who loves music games like guitar hero etc. You can import all songs from your PC, so unlimited fun is guaranted.",
            "review_score": "1"
        },
        {
            "review_text": "possibly the best VR game out there. I like it a lot. well done :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Dear Devs,  This game is amazing!  Please add, at some point, the ability for people to create and share their own charts. No offense to the algorithm, but humans can make better charts than machines can (see: DDR, Osu, StepMania, Beatmania IIDX, etc). Even if you add the ability only to make the rhythm file (with the algorithm deciding on note placement and color) that would greatly enhance the experience!  Thanks, jipkin",
            "review_score": "1"
        },
        {
            "review_text": "Nothing short of delightful to play. The beat-charting algorithm could use a bit of work because sometimes the paintballs feels mistimed to the music, but when it's working this game is phenomenal. My most played title in my first week of owning a vive.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite VR games so far. Unlimited replay value, fun gameplay.   Hope they add workshop support soon!",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't make sense until you experience it. I was cackling my first time, and my girlfriend cried when she played it. If you have Vive, play this. Without question.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that adds a new dimension to the rhythm genre.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very fun, and it tricks you into getting a good workout. :)  Searching for songs can be kind of annoying so I recommend just throwing whatever songs you think would be cool into your music folder and navigating there from the explorer.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the easiest recommendations to make. From the developer of Audiosurf, the game that allowed you to ride your music, comes Audioshield. The game that lets you... fight your music? It's very easy to get so wrapped up in the experience that you only regain conciousness after the track has ended and you're covered in a slick of sweat.  Gameplay Breakdown: Brain-dead control scheme. Load your song and select a difficulty level. Block blue orbs with your left hand, orange with your right, and purple by bringing both together  Pros: +Easy control scheme and difficulty levels lets all skill levels enjoy this title. +Choosing your own music makes this one of the most replayable titles available. +The combination of song and difficulty level creates a unique challenge to beat. +Moddable arena keeps the game visually fresh. +Difficulty ranges from sort of relaxing to sweat drippingly intense.  Cons: -Requires a music collection to fully enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "the good: add your own music, absolutely anything in MP3 format GREAT cardio if you go for the HIGH STYLE, not technical good party game with your friends Works pretty great with some songs, considering that its automated (try give it away by the Chillis) lots of fun, addictive with your own music.   the bad: automated rythm games have bad rythm (you can't rely on the targets to be on beat) some songs totally SUCK because it can't pick out the rythm at all faster songs don't get more targets, even on difficult (I tried SLAYER) I'm expecting my headset cushion to need dry cleaning soon crashes out to the launcher sometimes after youve finished a song (score NOT saved) Theres no super bonus type stuff, no indication of what style is better, etc.",
            "review_score": "1"
        },
        {
            "review_text": "One of the must-haves for the Vive. Just make sure you have some CDs, MP3s, or are willing to buy some music from Amazon.",
            "review_score": "1"
        },
        {
            "review_text": "Pros - I can use my own music. Its just fun, thats the only way to describe it. Simple good time for any music lover.  Cons - I have to wait my turn because my girl and kid demand their turns. Ugh.",
            "review_score": "1"
        },
        {
            "review_text": "If you got a vive you should have this game too.",
            "review_score": "1"
        },
        {
            "review_text": "Audioshield is probably my favourite VR game at the moment. It's essentially uncharted Guitar Hero in VR. The ability to play music on Soundcloud is a great implementation as you're then able to play songs that you don't own as well as the ability to play your own music. Another nice addition is leaderboards for your own music. if the metadata of the file that you're playing matches other files that were played with the same metadata, you get your own leaderboard for that song, which is a nice touch. The game itself is very enjoyable and probably has the most replay value of any other game I own. You feel very powerful smashing the notes with your shield. It really shows off the power of VR. You're even awarded points for hitting the notes harder, so you're made to work for the highscore. This game is simple, yet a lot of fun. I would absolutely reccomend it for the price but beware - it is VERY buggy at the moment. I usually have to restart the game 2 or 3 times when opening it because it'll just crash for no apparent reason. This seems to be a very widespread issue so hold off if that's going to bother you. Hopefully the issues will be fixed soon.",
            "review_score": "1"
        },
        {
            "review_text": "Audioshield scratches the part of my brain that wants to punch blobs of paint to the beat of my favorite music. Must have for Vive owners.",
            "review_score": "1"
        },
        {
            "review_text": "I really expected this game to be rather boring. Never liked rythm games and music games. But it really is something else in VR.   The feeling punching away at the balls and comets is just fabulous. I love the estetics, the buzz of the haptics, the firework from the exploding balls. Excellent workout also - set the game to hard or harder and you will be sweaty if you get dancing/boxing away.  The game has excellent menus, nice options, good leaderboards. I would appreciate if the game did start quicker, but it could be my internet connection that is slow. The list of tunes and the music is downloaded unless you prefer to do your own music files - the game seems to accept any mp3, at least. I would like to play a podcast or an audiobook. Workout and bookreading at once! :)  Seriously though - this is in the top three VR titles for me on HTC Vive so far. (I have tried about 25 titles)",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, and a good thing to use when showing off VR to others",
            "review_score": "1"
        },
        {
            "review_text": "Whole new augmented visual/musical experience. GREAT!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game.... When it works but that hasn't been for a while now. It crashes constantly, and the developer seems to be MIA. How about an update?  I don't recommend until this gets updated.",
            "review_score": "-1"
        },
        {
            "review_text": "I think this might be my favorite VR game right now.",
            "review_score": "1"
        },
        {
            "review_text": "Dylan Flitterer back at it with another great audio game! Hope to see more!",
            "review_score": "1"
        },
        {
            "review_text": "Addicting and fun. Really good when you get the right song. Most asked for feature I've seen is user creation of the beat maps.  Good workout if you really get into it.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Be prepared to sweat - a lot.  This game is fantastic fun and a great workout. I recommend playing to EDM because AudioShield seems to really excel at that genre, but the most important thing is to just play music that you want to jam to. Because trust me, you REALLY get into the music in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I have to review this one because everyone has to know something important. VR games look and feel completely different than watching them. I already hear people saying, 'Why should I buy a game to punch colored balls with my colored shields?' Because, you punch colored balls with your colored shields to a beat. The audio makes all the difference. If your on the fence about this one, buy it, play an hour, and if you hate it, by all means return it, Steam's return policy is somewhat generous now. But I promise you, if you play for an hour, you'll see the appeal.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into rhythm games and music, this is the thing to get.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. It's kind of addicting. I'd skip the easy mode and go right for the middle or most difficult mode. I wish it had playlist support and/or Spotify support. A playlist would be great because just when I'm getting into song, it ends and then I have to wait for the score and go through the screens again (side note: being able to choose a default shield style, location, and level would be great instead of having to go through it each time), which kills the momentum.  But overall, the game is polished and a lot of fun. It's the game I've played most since I got my VIVE.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game  huge replay value   play the songs you want as you can chose from songs on youtube and the game converts it in to the game   a game i keep coming back to",
            "review_score": "1"
        },
        {
            "review_text": "Good game, great way to keep you active, have only run into an issue with a level not loading once. I would recommend it, the hard setting is really hard which is great.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite VR game. Such a great way to combine music with gaming with excersise! I can also confirm that is Does work with Oculus Touch, despite not being advertised as such yet.",
            "review_score": "1"
        },
        {
            "review_text": "This is a VR rythm game that lets you choose your own music. Your controllers are the colored shields (with haptic feedback) and you gain points as you block the matching colored orbs. If you're new to VR this is a safe game to buy with no chance of motion sickness. Just an all around fun VR game with tons of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Brings a smile to my face every time and I love that I can just search for songs on youtube.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  - Great idea  - One of the best VR experience  - Support local and youtube songs.  Cons:  - WE WANT TO CUSTOMIZE OUR SONGS! - Bubbles doesn't go with music rythm, sometimes it just come randomly (I'm pretty confident with my feel for rythm) - Bubbles doesn't come with fixed speed - Bubbles can go very high in view and you'll have hard time see what's next hits  Overall I really like the idea of the game, it was a pretty good workout, but I kind of get tired of it. Hope to see some improvements.",
            "review_score": "1"
        },
        {
            "review_text": "Easily my favorite game in VR, love that you can play from YouTube. Awesome game. Some more arenas would make it better though. I strongly recommend buying this title if you have a headset",
            "review_score": "1"
        },
        {
            "review_text": "Did not work for me. IMO the visuals are absolutely detached from the music, even on harder difficulty.",
            "review_score": "-1"
        },
        {
            "review_text": "The visuals often don't sync up with the music if you're using a song that didn't already come with a game. In a game like this, syncronization is everything.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like any time of music/rhythm game this is a must have.  I find myself always coming back to this game, there's really nothing quite like it atm.   This game is one of the most immersive experiences I've had in VR. The only thing I didn't like was the hard mode wasn't hard enough for me so I resorted to a Expert Mod which amped up the game so much I can only concentrate on what the hell is going on in-game and forget about the outside world entirely but according to my fiance I look like a maniac playing.  ",
            "review_score": "1"
        }
    ]
}