{
    "app_id": 412730,
    "name": "Days Under Custody",
    "release_date": "2015-11-23",
    "developer": [
        "Abraham Carreola"
    ],
    "publisher": [
        "Groupees Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Horror"
    ],
    "achievements": 5,
    "positive_ratings": 51,
    "negative_ratings": 89,
    "price": 3.99,
    "description": "Days Under Custody is a title made as a classic horror adventure game where a dramatic story, unique puzzles and an enemy stalking you all the time, will test and keep you tense to discover the history behind a lot of inexplicable events.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/412730/header.jpg?t=1455020803",
    "minimum_requirements": "OS: Windows XP or above Processor: Dual Core AMD or Intel / AMD E-350 APU Memory: 1 GB RAM Graphics: Intel HD 4000 / Radeon HD 6310 DirectX: Version 9.0c Storage: 150 MB available space Additional Notes: Mouse required to play.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "good job restoring keys quickly",
            "review_score": "1"
        },
        {
            "review_text": "Solid game. Especially now when the dev's (and/or valve?) sorted the mystery with the revoked keys.",
            "review_score": "1"
        },
        {
            "review_text": "Bought in a bundle, and either the devs requested all bundled keys revoked, or Valve decided to take it upon themselves and do it anyway...either way, bad business practice man.  UPDATE: Seems the devs got this issue sorted, so, am adjusting my recommendation. Though this issue SHOULDN'T have happened to begin with.",
            "review_score": "1"
        },
        {
            "review_text": "Edit - 6/14/16 Apparently I should feel bad for the miscommunication between the developer and valve. Here is a quote which is not really explained so I am left still feeling pretty negative as it's the only title out of several thousand to be revoked, a little alarmed still, could even happen again, how come no other developer\\publisher has made this same recall attempt or at least made it in such a fashion to not clearly explain, 'please don't remove the game from everyones computers ever'. The way I see it, developer\\publisher made a poor business decision, this is what happens when you sell yourself to bundle sites. Unless you got hacked and all your keys were stolen there is no one to blame but yourself for the position you have put yourself and everyone affected in. Without much explanation you can see I still feel pretty much the same, I mean back to what I said, out of 3400+ games I have, about 90% purchased from various bundle sites, this is THE ONLY GAME to have ever been revoked. It's unfortunate but it's something the developer\\publisher should live with. I honestly live in fear that I won't always have access to this game. Thus my review isn't based at all upon the content of the game but my experience owning it.  Only information given to the consumer.  'We apologize for this issue. It results from a miscommunication with our contact at Valve. All keys were not supposed to be revoked, just extra keys that were not previously distributed in bundles. As some of you may know, there is a big issue with 3rd party sites selling Steam keys. It is causing lots of issues and was one of the major topics of conversation at GDC this year. We were simply trying to ensure that extra keys were not going to make their way to these third party sites. We are working with Steam to correct the mistake and will ensure that folks who purchased the key via Indie Gala or DIG will have their game restored.'   Edit - As of 3/23/16 the game has returned to my inventory and no frightening notice has been given of its return.    Original  I have this game for over a year, then steam says  'A Steam Product code you activated has been removed from your account.  Your recent Product code activation has been revoked due to a problem processing payment for this item. The games associated with this product code can no longer be played as a result. This could be due a problem with the payment methods you used to acquire this item from a third-party seller; or a problem with how the third-party seller acquired the Product code. Please contact the seller you acquired the Product code from for assistance.  If you would like to purchase the item, please visit the Steam Store. Otherwise you may choose to delete the local content associated with these games.'",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry this adventure isn't too great. Engrish is plainly present so everything written is generally a mess. So collecting notes to gather the story is rather humorous rather than scary. Instructions are vague ('Find key *in* computer' (yup), but nope, you need to go to the kitchen. The door you need to lock gets a generic line will another door gets the 'I need to lock this door' and then you spend minutes trying to see *how* to lock it) and the protaganist shows a severe amount of psychic abilities. I can't see anyone else picking up a strange phonecall and knowing they need to go to the first floor from that or getting a chest from a ghost and just KNOWING the code is in the attic, where it is. Seriously, and that's what we need to take serious?  Also achievement hunters beware, they are all broken.  I suggest you check out the 2 video's uploaded in the community hub, they give a pretty good indication what you can expect playing this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It fails the Morgan Freeman test",
            "review_score": "-1"
        },
        {
            "review_text": "I like the overall concept of the game, and it's visually nice, the graphics work too. But I have no idea what's going on. And the poor grammar doesn't help at all. Better use an english native next time to proof read the texts.",
            "review_score": "-1"
        }
    ]
}