{
    "app_id": 413030,
    "name": "Mytheon",
    "release_date": "2015-12-08",
    "developer": [
        "Petroglyph"
    ],
    "publisher": [
        "Petroglyph"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "MMO",
        "Co-op"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Action",
        "RPG",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 54,
    "negative_ratings": 37,
    "price": 6.99,
    "description": "Enter the world of ancient Greece where humans are at the mercy of Zeus and the pantheon of gods. Grab your friends and adventure through swamps, Greek ruins, and the Underworld itself to upgrade your armor and forge new weaponry. Collect stones of power to summon mighty companions and spells.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/413030/header.jpg?t=1478033453",
    "minimum_requirements": "OS: Windows XP, Vista, 7, 8, 10 Processor: Pentium 4 2.0 Ghz Memory: 2 GB RAM Graphics: GeForce 6600 DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space Sound Card: Onboard Stereo/Audio",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I played this game when it available for a limited time several years ago.   The game is a bargin at $4.99. The core mechanics are really interesting. Odd combination of deck-building, RPG and some RTS elements. I am not aware of anything quite like this.",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game I have asked for a refund on.   The game is more suited to single player as the server was dead when I played. Also its more of an on rails game than an mmo with freedom. There was lag during gameplay which I saw no reason for as no one else seemed to be online.  If the game took away the need for an internet connection and launched itself as a single player game then I would recommend it but as it is I can not. If the devs closed the server you would be left with a game you can not play. With the lack of players Im not sure how long the devs can continue to support this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay is much more akin to something like WoW than traditional ARPGs - i.e. a lot slower paced and enemies in general are more threatening (at least the first few areas I've played at low levels). The skill system is really unique and refreshing although a lot of the summons feel like reskins of each other. There is not many people playing currently, which is a shame as I think this would be a lot more fun playing in a group. Worth 4 bucks easily.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when first launched, loved it then. Was excited to see it again  graphics are good game play is good  soloability is decent, final boss mobs are tough ussually need atleast a duo to kill, its much easier to lvl with a group anyway. I read they have an expansion near done from previous, so my fingers are crossed there is more interest here on steam. throw 5 dollars at it, u wont be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome. I played when it was released and playing again with the new expansion...  You get stones that create towers! or cyclops or pegasus! or are spells!, and you build your 15 stones set (3 max each). You can figure out combos pure Magic the gathering style... or you can go the easy way and just add the ones you like. Visually the game is quite satisfying...  In combat 6 random stones from your deck are available at a time. You enter a stage kick some mobs's asses and go for the bosses that give the cool loot.  There is also: -Pvp duels -Items, recipes, crafting... -Market -You can play stages in a party or solo  I really recommend it. By the way, i saw some comments on lag. I have none.",
            "review_score": "1"
        },
        {
            "review_text": "I don't get why this game has so many positive comments about how it's crazy fun, I found it really sluggish and unexciting.",
            "review_score": "-1"
        },
        {
            "review_text": "I requested a refund on this game. For me, it is difficult to grasp how to play the game, other than the very basic press this number, does damage. There is no one in game, and at that there is only one server. I wouldn't advise someone to purchase a game with this few people unless they are trying to play this 100% on their own and never even touch PVP. It is not worth th $4.99 discount price, let along the $9.99 normal price.",
            "review_score": "-1"
        }
    ]
}