{
    "app_id": 413480,
    "name": "101 Ways to Die",
    "release_date": "2016-03-17",
    "developer": [
        "4 Door Lemon"
    ],
    "publisher": [
        "4 Door Lemon Vision 1"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Strategy",
        "Action"
    ],
    "achievements": 30,
    "positive_ratings": 28,
    "negative_ratings": 6,
    "price": 7.99,
    "description": "In this puzzle-platformer you'll need creativity, cruelty and an absolute lack of morals as you help the evil Professor Splattunfuder complete his life's work -  to create the most horrific recipe book ever, 101 Ways To Die!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/413480/header.jpg?t=1535041168",
    "minimum_requirements": "OS: Windows Vista or later Processor: Quad core 2.5Ghz minimum Memory: 2 GB RAM Graphics: DirectX 11 class graphics card with 1gb of video RAM Network: Broadband Internet connection Storage: 400 MB available space Sound Card: DX11 compatible sound card Additional Notes: Xbox 360 pad or compatible supported",
    "recommended_requirements": "OS: Windows Vista or later Processor: Quad core 2.5Ghz minimum Memory: 4 GB RAM Graphics: DirectX 11 class graphics card with 1gb of video RAM Network: Broadband Internet connection Storage: 400 MB available space Sound Card: DX11 compatible sound card Additional Notes: Xbox 360 pad or compatible supported",
    "reviews": [
        {
            "review_text": "  After a couple of months of owning the game and multiple e-mails with the devs themselves to solve an issue which rendered this game unplayable I have finally got to the bottom of the issue and fixed it - myself, although the team (Nick Parker) were very attentive and helpful.  The game does not like recording software - AT ALL. So if you are running recording software, close it down before playing this! Otherwise, it simply will not work.  The game is actually very enjoyable and wonderful in design. Think Lemmings, but rather than rescue the blighters, you have to murder them.. in the most horrific ways.   If you like challenging titles, this may tickle you in all the right places. I have found it very challenging in places, yet adorable in its brutal way.   The team seem to have put in a lot of work in to this and although there does appear to be an issue with recording software (Which, if sorted, will hopefully give the game much more coverage, which I feel would be deserved), I believe it is actually worth a purchase.  The two recording progs I was using were Plays.TV which would auto run in the background and Action! - both of these kill 101 Ways to Die. I am unsure how others have managed to record game footage, but if you want to enjoy this little hidden gem, ensure you have shut down both of these.  Please see my original review below:  The game does not work. After contacting the team (after being advised to do so by the devs on the discussion page), I have not received a response. It appears many people have found the game to not be working too. Very frustrating as I was looking forward to this. Until a fix is found I would 100% advise you to steer clear of this game as it is broken.",
            "review_score": "1"
        }
    ]
}