{
    "app_id": 413680,
    "name": "Statues",
    "release_date": "2015-10-27",
    "developer": [
        "Room710Games"
    ],
    "publisher": [
        "Room710Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 9,
    "positive_ratings": 151,
    "negative_ratings": 69,
    "price": 3.99,
    "description": "Do not even try to close your eyes. You can't let the fear go. It is real. It is more real than you can imagine... &quot;Statues&quot; is a mix of survival-horror and action-adventure developed by Room710Games. The game based on the creepy enemies that only move when you're not looking at them.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/413680/header.jpg?t=1484516364",
    "minimum_requirements": "OS: Windows Vista, 7, 8, 8.1, 10 Processor: Core 2 quad Memory: 2 GB RAM Graphics: GeForce 8800 DirectX: Version 10 Storage: 5 GB available space Sound Card: DirectX compatible sound card",
    "recommended_requirements": "OS: Windows Vista, 7, 8, 8.1, 10 Processor: Core i5 Memory: 4 GB RAM Graphics: GeForce GTX 480 DirectX: Version 11 Storage: 5 GB available space Sound Card: DirectX compatible sound card",
    "reviews": [
        {
            "review_text": "To start, I have some mixed feelings about this game. First off, it was fun and interesting, not to mention scary, but there are certain things that this game has some problems with.   First off, when it boasts 'different types of enemies' mostly it means different designs. There are only really four different types. Some of the '7 various locations' you are in, you are in for less than a minute or two. Another problem I experienced was that I would get stuck in random places. For example, when I ran into a supply room I rubbed against some debris on the ground and suddenly I couldn't get out of that spot and had to restart my checkpoint. This happened several times, but sometimes this is unpreventable in games and it really didn't happen too often. Then there was the blinking. The blinking was a very interesting concept, one I have seen in several other games, but it's duration is much too long, almost two seconds. I don't know anyone who blinks for two seconds. But I suppose if they wanted to add it to the game they needed to make it to where it could really make a difference in your meeting with a statue. Another problem I had was the lack of information. For example;   *SPOILER*  At one point you have to escape a massive statue, which I have nicknamed 'The Divided,' and as you run away from him he will every so often jump into the air and suck up everything in his path. If the player fails to be in an alleyway they will get sucked up and killed. I discovered what to do by complete accident after dying several times. This lack of information frustrated me and really took away from the game's experience. Plus the whole giant statue battle(s) really differed from the main game in an unattractive way.  *SPOILER END*   Now for the pros! This game was very scary. The first 'statues' you encounter are skinless medical mannequins. These terrifying creatures will follow you, banging down doors until they catch you. The gameplay is very similar to Slender, but it does it very well. There are indeed several levels, each with similar but differing objectives.  *SPOILER*   Once you are given the hammer, however, it becomes less scary and more of a challenge. You avoid the statues while collecting the necessary items, only now you can destroy the statues.....temporarily. I loved that addition and it certainly made it more challenging. *SPOILER END*   The game was also very beautiful. The graphics were smooth and everything was shaded very well. It is obvious that they tried very hard on the appearance of the game and it really sets the atmosphere. I bought this game on sale, but I feel that 10 dollars isn't too bad of a price for this game. But maybe buy it on sale. Again mixed feelings. I enjoyed certain moments, but quite a few took away from the experience. I suppose I would recommend it.  Fun 3/5, Scary 4/5, Originality 2/5, Mature 3/5, Graphics 4/5, Worth the price? 3/5",
            "review_score": "1"
        },
        {
            "review_text": "i highly recommend this game. This game is awesome! and terrifying. I have stopped and quit the game for like a couple days then keep going cuz i get so scaredXD especially on hard mode.",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't finish this game, but for a coimpletely personal reason. I was only able to put in a couple minutes before I had to quit because of motion sickness.   Something about the FP in this game was nauseating and I couldn't continue past the hospital. I really wish I could continue, but completing the game isn't worth vomiting and a severe headache. So if you have rather bad motion sickness like me (as in, so bad that simply moving your head while sitting in a car is enough to induce dizziness), this game may not be for you.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't finished the game yet, but I've played enough to give a good review. After playing for around an our for my YT channel, I think this is a well made game. The goal is to complete a set of objectives in different locales to advance to the next locale. Meanwhile, inanimate manniquens or statues are coming for you while your back is turned. This creates an intence level of stress as you cannot leave your back turned for too long. It gets really hairy when you have to complete objectives that are on the wall so you're forced to keep your back turned, always looking over your shoulder.     The visuals are really well done, and the darkness creates a very creepy atmosphere that makes it difficult to see the oncoming threat. The auido is great as well, as you can hear (very faintly) the footsteps of the statues coming for you if you listen well enough. Overallm Statues is well done and makes for a very scary experience that is best when in the dark and wearing headphones. Just like any good horror game. I look forward to finishing the game soon.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy playing this game gives me a brand new experience in this genre.",
            "review_score": "1"
        },
        {
            "review_text": "One hell of an excuse for a 'horror' game",
            "review_score": "-1"
        }
    ]
}