{
    "app_id": 413870,
    "name": "Sickness",
    "release_date": "2016-01-20",
    "developer": [
        "Zetsubou"
    ],
    "publisher": [
        "Unwonted Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Violent",
        "Action",
        "Adventure",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Visual Novel",
        "Indie",
        "Violent"
    ],
    "achievements": 10,
    "positive_ratings": 97,
    "negative_ratings": 7,
    "price": 6.99,
    "description": "Sickness is a visual novel centering around Suoh Tesla, an amoral high school student whose life is rapidly deteriorating. Following the deaths of his parents, a brief stay in the hospital, and the emergence of his “Sickness”, his daily life quickly devolves from carefree school days to a life of crime.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/413870/header.jpg?t=1532780363",
    "minimum_requirements": "OS: Windows XP Processor: 1Ghz Memory: 1 GB RAM Graphics: DirectX or OpenGL compatible card (capable of 1080p output) Storage: 2 GB available space",
    "recommended_requirements": "OS: Windows 7 Processor: 1.5Ghz dual core Memory: 2 GB RAM Graphics: DirectX or OpenGL compatible card (capable of 1080p output) Storage: 5 GB available space",
    "reviews": [
        {
            "review_text": "9.5/10 - Finally, A Game That Indulges Ones Darker, Twisted Side.   I started this visual novel without knowing anything about it; I just saw the $15 price tag and thought it would never live up to my expectations for such a premium price. I was wrong! This game exceeded my expectations in a dark, devious and calculated way.  This game won't be for everyone! However, if you don't mind twisted thinking, blood and guts you may have to check this one out! Your choices matter in this visual novel and your ending will be determined by them. I honestly didn't know what to expect throughout the story which is refreshing to say the least. This campaign lasted me 11.5 hours with a combination of auto-advance and personal clicking. You definitely get a good value for your $15; but that doesn't mean you shouldn't grab this on discount.   Worth the $15 for sure! Once this title is on sale… GRAB IT!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly good VN on moral relativity, one that stands out in an overwhelming mass of crap that we are being served.  Despite having some incoherences or unrealistic behaviour/lines of the characters it was able to restore some of the faith I had lost in the genre after contact with other, so called, mature VNs.   Definitely not for children or anybody seeking H-content. There is a lot of brutality but it serves a purpose instead of being a goal itself.   I just wish the creators dropped the 'sickness' idea of the 'Sickness'. It's completely obsolete, there is enough psychpathology in everyone of us to include obvious psychotic symptoms. ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing visual novel with epic character art. 10/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "  Dude,    Being a psycho serial killer is fun....  Also, being a psycho serial killer,   and being payed   to be a psycho serial killer while working for an underground crime boss, is awesome.  10/10 would kill (virtually, of course) again",
            "review_score": "1"
        },
        {
            "review_text": "Dark story that holds your interest.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and believable multi layered story with wide range of emotions, relatable protagonist and likable characters. This is a story about finding a light in a world of darkness. It may not be 'Saya no Uta' but I did very much enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "These kinds of darkly themed games are right up my alley, but with this one having so few reviews on Steam, I didn't know what to expect. I was so pleasantly surprised at how much I ended up liking it. I play visual novels pretty sparingly because they bore me if they're too lighthearted, focused entirely on romance, or have overly perfect and sweet characters. This one, however, had my attention all the way through.  I will say that it didn't feel like there was a whole lot of choices, but I liked the story enough to not care. It was much more intriguing than I thought it was going to be. I liked nearly all the characters and their personalities were very believable. Most of the art is pretty good. Not always perfect, but certainly passable. The soundtrack was nothing memorable to me but it suited the game well. Took me just under 8 hours to finish one playthrough. I think anyone that likes a twisted story would appreciate this one.",
            "review_score": "1"
        }
    ]
}