{
    "app_id": 414290,
    "name": "Princess.Loot.Pixel.Again",
    "release_date": "2016-04-15",
    "developer": [
        "EfimovMax"
    ],
    "publisher": [
        "EfimovMax"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "achievements": 24,
    "positive_ratings": 955,
    "negative_ratings": 167,
    "price": 3.19,
    "description": "PLPA is a dynamic platformer with a combo system and special strikes, there is also a bit of rogue-lite genre. The principal aim is to get through all floors of the Dark Tower and outfight the main antagonist a Evil Mage. That’s not easy due to a instant death which is followed by a full castle structure regeneration.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/414290/header.jpg?t=1544519193",
    "minimum_requirements": "OS: Windows Vista or newer Processor: 2.0+ GHz Memory: 512 MB RAM Graphics: Integrated Graphics DirectX: Version 8.0 Storage: 80 MB available space Sound Card: Integrated Audio Additional Notes: Gamepad",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "this review for 0.81 early access  right now 8 floors in Princess.Loot.Pixel.Again, (takes about 20min.) You rescue and then have to hit 'ESC' on your keyboard to return to the title menu, no special victory screen no featuers that would make you want to run it again.  I was really hoping the 'Again' in the title would be key to my feelings towards the end of the game. Maybe after they get out of beta.  I paid $2.74 for this on sale and I wouldn't even recommend that price at this stage. Pretty much buy this only if you want to support the developers.  for what it's worth though I believe it holds potential so maybe when they finish I can change my review  **update**  Well it looks like the final version of the game is released and the only added feature from the beta, after you beat the game you are now left at a black screen 'again?' as opposed to before where the game flat out tells you to hit escape to restart.... personally I found the 'hit escape' more useful than 'again?'",
            "review_score": "-1"
        },
        {
            "review_text": "Very similar to Rogue Legacy, except there's no legacy. You die, you're dead. Start over. Platformer. Solid controls, great music, little bit of roguelite element (which items will show up)  I got it cheap in a bundle or something, it's worth buying if you see it on el cheapo.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Dark Souls mixed with Binding of Issac, with a dash of permadeath.",
            "review_score": "1"
        },
        {
            "review_text": "This game is perfect for it's price! It's the ultimate time killer. Music is awesome for the atmosphere, story is simple, funny and exciting and the gameplay is the best of it all. It's action pumped and you need to learn each class' mehanix to play well against diverse enemies and bosses, looting epic items and improving your self in process. Game tells you how well have you done throughout the level and there is plenty of achievements. Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game but the dark mage guy is op when you have moneys",
            "review_score": "1"
        },
        {
            "review_text": "So i got this game on a whim, because one of the tags is Rouge-Like and the user reviews i read were overall pretty positive and made it sound really good.  +The gameplay is good and it works well with my controller.  +Each character feels somewhat different, although they all play the same hit and run style with most enemies. +The levels are well designed, most levels have loops, hidden areas are fairly easy to notice. There are some fall into acid/lava levels but its fine because you have double jump. +Dropped items like bombs, hearts, mana orbs and keys are not thrown at you endlessly, but you can end up with a big disparity of items gained depending on your luck. +The music is really good.  +The art style works well with the game.  -Characters feel a bit slippery because of high movement speeds that you can get.  -The levels although well designed get stale with nothing really changing, just the overall layout floor to floor. -Bosses are a joke and a waste of time, the only difficult boss i encountered playing was the 2nd major boss, but once you know its moves it becomes easy like the rest. -Lack of enemy diversity, there are only a few types of enemies, e.g. Zombie, Bats, Skulls and slugs. -Some Special items are unclear as to what they do, there is no real way of knowing with them unless you get the requirement for them to work. But there are some pretty good ones, like the spike friend and the item that lets you see in the dark (shows whats behind doors). -The equipment system is confusing at first. When you find a new item it is hard to tell if it is actually increasing your stats or is just a +1 attack weapon. This should be cleared up by putting its actual attack value with a + or a - depending on what you have equiped. Shields are confusing to get better ones as well, i had one shield that every other shield encountered would appear worse even when it was at 1% durability.  Overall i think its a fun game, but i don't think there is enough to keep me playing it for any period of time. Its a rouge-like/lite in terms of the map and enemies being procedurally generated but it doesn't feel like it changes all that much.  ",
            "review_score": "1"
        },
        {
            "review_text": "  If you like rogue legacy then you might like this same controls but there's annoying boss battle but thisgame is still good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really unfinished.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage. Complete ripp off of other sucessful games. No real imagination. Hit box is choppy, Health system is wonky, nothing is explained. Justs a real P.O.S   Go back to Newgrounds and start your ideas, instead of wasting peoples time.",
            "review_score": "-1"
        },
        {
            "review_text": "Cant crouch :&gt;",
            "review_score": "1"
        },
        {
            "review_text": "  So I got this for free and it is ♥♥♥♥ing awesome. Even if the game was bad i would still play it for the music &lt;3. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice Rogue Like RPG in Pixel style with awesome and well placed music. Hard, very hard and not forgiving so be prepard. You will suffer, you will die, you will use extensive language and you will laugh. Because you will learn on your mistakes. You will play it and make mistakes still but new ones.",
            "review_score": "1"
        },
        {
            "review_text": "Would.Totally.Princess.Loot.Pixel.Again.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, it's Binding of Isaac scroller edition. If you like Rogue-like games, worth the money you will pay for it",
            "review_score": "1"
        },
        {
            "review_text": "You will die frequently, but you'll keep coming back for more!",
            "review_score": "1"
        }
    ]
}