{
    "app_id": 414370,
    "name": "Raining Blobs",
    "release_date": "2016-01-15",
    "developer": [
        "Endi Milojkoski"
    ],
    "publisher": [
        "Black Shell Media"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Local Multi-Player",
        "Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Strategy",
        "Puzzle"
    ],
    "achievements": 38,
    "positive_ratings": 56,
    "negative_ratings": 4,
    "price": 7.19,
    "description": "Raining Blobs is a challenging, fast-paced arcade puzzle game based around matching falling blocks, featuring adorable anime-style pixelart! Prove that you have what it takes to survive the endless blob rain with up to 16 players!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/414370/header.jpg?t=1513731026",
    "minimum_requirements": "최소: 운영체제: Windows 7, 8, 10 메모리: 1 GB RAM 저장공간: 200 MB 사용 가능 공간",
    "recommended_requirements": "권장: 운영체제: Windows 7, 8, 10 메모리: 1 GB RAM 저장공간: 200 MB 사용 가능 공간",
    "reviews": [
        {
            "review_text": "Easy to pick up and hard to put down,  Raining Blobs  is an exciting arcade puzzler like the old  Dr. Robotnik's Mean Bean Machine  (or  Puyo Puyo ), but better. This game offers six difficulty levels and three different speed levels, along with a solo mode, battle mode (supporting up to eight players) and tournament mode.  To me, this is the best game in the genre since  Super Puzzle Fighter II  (1996), and I like how friendly or brutal it can be. Also, it's worth mentioning that there's a colorblind option, making the game accessible to everyone.  The anime appeal is a double-edged sword. I like it (and I'm sure there's a lot of people who'll discover the game because of it), but some people can mistakenly pass the game because of the girls. Either way, it doesn't really matter, since the player will be much more focused on the playfield.  All in all, I can't recommend  Raining Blobs  enough if games like  Puyo Puyo ,  Columns ,  Dr. Mario , and even  Tetris , are your cup of tea. For a small asking price, you'll get an addictive and very well made game to play alone and/or with friends - and you can even team up with CPU bots to get the co-op achievements!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy these types of games, you'll have a blast with Raining Blobs. Lots of fun with a group of friends on one computer.",
            "review_score": "1"
        },
        {
            "review_text": "I just tried it out, but the controls are so strange and the menu layout isn't really a good help, cause it is also pretty confusing. After I studied the well hidden tutorial now, I played another arcade match, which I quitted after a while, because it was too boring to me. The tournament then doesn't seem well balanced. All in all, this game wasn't fun to me, and this is what a game is for. Because of the reasons above I cannot recommend this game.",
            "review_score": "-1"
        }
    ]
}