{
    "app_id": 414580,
    "name": "Uriel's Chasm 2: את",
    "release_date": "2015-11-13",
    "developer": [
        "Rail Slave Games"
    ],
    "publisher": [
        "KISS ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 111,
    "negative_ratings": 224,
    "price": 3.99,
    "description": "את is an allegorical, multi-genre Love story and exploration of the Biblical themes of paradise and sacrifice vs offering.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/414580/header.jpg?t=1455848795",
    "minimum_requirements": "OS: Windows 7 or higher Processor: 2 GHZ Single core Memory: 2 GB RAM Graphics: 512 MB of dedicated video memory and support for OpenGL 2.0+ Sound Card: Sound blaster Audigy 2 or newer",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I wanted to forgive the game for it's strange charm, however it's an unfortunate boring waste of assets and has very few areas of potential.  For a start, it begins with a 10 second intro that isn't skippable every time you start the game. Then there's pointless movie sequences which are falsely advertised in the screenhots and video to look like in-game graphics, which are also by the way not skippable. The storyline is boring, pointless and interrupts the little gameplay the game actually has.  As for gameplay, you begin with a SMUP with more mechanics that are less obvious than a standard Bullet Hell game. Each time I played it, I discovered a new button or mechanic for a level that takes about 30 seconds to complete.  Once you beat it, you are put straight into the most boring and confusing tree game. I have no understanding for the ratios on the right, what the lightning is or coming from, when the fruit will spawn if i must avoid the fire sprites or the are. Before you have even discovered the mechanics, you're into the next level.  And before you know it you're back into the same SMUP Bullet Hell game again with and even easier boss than the first one because the Graze mechanic is too easy to use....  Then you get back to the tree level and angrily will quit the game. You try to give the game another go later on, but when you see the ♥♥♥♥ing 10 second intro and refund the game.  The bongo-man can eat my ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "  So the second game has been relased.As ♥♥♥♥♥♥ as the previous one.",
            "review_score": "-1"
        },
        {
            "review_text": "Hey everyone and this is my review about the game!  This is Some Weird game.    Interface/Menu/Settings",
            "review_score": "-1"
        },
        {
            "review_text": "I need to uninstall this to prevent another ebola outbreak",
            "review_score": "-1"
        },
        {
            "review_text": "  Good for the cards and... that's it.",
            "review_score": "-1"
        },
        {
            "review_text": "  * get a free key  * install  * get the trading cards  * uninstall  * delete from library",
            "review_score": "-1"
        },
        {
            "review_text": "  what",
            "review_score": "1"
        }
    ]
}