{
    "app_id": 414660,
    "name": "Vampire Legends: The True Story of Kisilova",
    "release_date": "2015-12-03",
    "developer": [
        "Organic 2 Digital Studio"
    ],
    "publisher": [
        "Artifex Mundi"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Hidden Object",
        "Casual"
    ],
    "achievements": 10,
    "positive_ratings": 283,
    "negative_ratings": 46,
    "price": 6.99,
    "description": "Discover the source of dreadful evil!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/414660/header.jpg?t=1530539039",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1.5 GHz Memory: 512 MB RAM Graphics: 128 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 2 GHz Memory: 1 GB RAM Graphics: 256 MB VRAM DirectX: Version 9.0 Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "As a special investigator from Vienna sent to Kisilova, you're stumbling upon a story of vampires... Who is behind this?  Vampires Legends is based apparently on a true story, though I didn't check the facts. The plot is perhaps basic but well, at least, the bonus chapter is kinda a twist and while Rose, the woman featured in the header, is a minor character, she's still important for the plot. Unfortunately, it lacks of Artifex Mundi's creativity. Indeed, the game is published by them and done by another studio. I found rather annoying your partner, however, I loved how Stefan was everywhere at one moment, I even suspected him as the culprit.  But I loved the bonus chapter! It was kinda different from the main story as you were seeing past scenes. It would have been great to have that during the whole game.  The gameplay is the standard one: HO scenes, puzzles, items to pick... While the HO scenes are easy, some puzzles made me sweat a lot - but I suspect that I wasn't in the right mood for that (real life reasons interfered). However, while the hint system is classic, I found it very original as it's your partner (or Rose in the bonus chapter)   The graphics are good, as I loved that kind of atmosphere (gloomy, tragic and mysterious, a tendency to go to the dark side of the Force if I may say it like that) for HOG. The soundtrack is correct.  The game isn't perhaps the game of the year published by Artifex Mundi or hasn't the same quality of any game developed by them, but it's still very enjoyable and one of the best in my opinion about vampires in the HO world that I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad little HOG. It is an older game or looks like it. The graphics are a bit dated and pixelated on wide screens but nothing too distracting to point of not being able to play it or enjoy it. The voice overs are well done and the story not bad. I also enjoyed that it has some steam achievements thrown in for the price and Steam trading cards.   It is a shorter game than most HOG's but I still enjoyed this one as a small pastime pleaser. It only shows 5 hours on my gameplay as I leave it running in the background when I go do running or leave to eat a meal sometimes, heh.",
            "review_score": "1"
        },
        {
            "review_text": "Decent puzzle/HO game. The story was pretty interesting, but the art style used in the HO scenes wasn’t the best; the quality was a bit low. Also, this game is really short so I recommend getting this one on a good sale.   6/10.",
            "review_score": "1"
        },
        {
            "review_text": "I'd recommend this game but only to oldschool gamers. Not quite the intensity of myst, but definitely a cool story behind this puzzle grinder. The game assistant that allows you hints and the like can be used as often or as little as you like. A good metric for use in my opinion is only when a minigame isn't fun.  I liked it overall. ",
            "review_score": "1"
        },
        {
            "review_text": "Thumbs up for basing the game on actual historical events and for the two interviews in the extras. Other than that it's a rather solid hidden object game, if not very elaborate.",
            "review_score": "1"
        },
        {
            "review_text": "Nice point &amp; click adventure. Maybe a bit to short.. not to difficult, but a nice story. I would recommend to buy it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Very easy and short. Even if I like casual playing, there should be a litte more challange, at least played in 'expert mode'.",
            "review_score": "-1"
        },
        {
            "review_text": "Tedious, poor graphics, common puzzles, heavily scripted actions.",
            "review_score": "-1"
        }
    ]
}