{
    "app_id": 414730,
    "name": "Epic Clicker Journey",
    "release_date": "2016-04-21",
    "developer": [
        "Cleversan Software"
    ],
    "publisher": [
        "Cleversan Software"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "In-App Purchases",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Clicker",
        "Casual"
    ],
    "achievements": 40,
    "positive_ratings": 438,
    "negative_ratings": 212,
    "price": 0.0,
    "description": "Experience your epic journey. Discover 20 mysterious lands and face the monsters living out there. Show that you are persistent traveler and held your adventure, even in the toughest conditions.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/414730/header.jpg?t=1555357230",
    "minimum_requirements": "OS: Microsoft Windows XP SP3 (32-bt) or higher Processor: Core 2 Duo 2.4 GHz Memory: 2048 MB RAM Graphics: GeForce 9800 GT with 512 MB RAM DirectX: Version 10 Storage: 1200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Yeah, honest review, this is the worst clicker Ive seen, puts the clicker genre to shame. The game starts off how all clickers should, a weak enemy that dies with like 4 or 5 clicks, simple, right? But then it becomes worse... the enemies health automatically jumps up by around 50, making you have to click more, most clickers start you off with easy enemies for 1 or two stages then get a little harder. Not this one. the boss for the first stage has around 500 health I think, your click do around 2 or 5 damage per click... I dont even think this game deserves my review. Its a ♥♥♥♥♥♥ clicker with a extreme amount of grinding, just sitting there and clicking with nothing else to do... and worst thing is, you get HEALTH the enemy can damage you. if your clicking or not, you will take damage, and the multiplayer portion of the game is even worse. You dont get like a shared health bar such as everyones health put together and the enemy damages the teams health not individuals. You randomy get put into match making with random people, you cant invite your friends to a lobby and take out the levels together, and the chances of getting in with your friend on a multiplayer stage is slim to none, and if you do, you wont be able to know at all, there is no identification system (choosing a username or using your steam name in game).    FINAL VERDICT 4/10  Until improvements are made, this review will stay the same.",
            "review_score": "-1"
        },
        {
            "review_text": "  Another typical cash-grab clicker game.. Plenty of them out there over social sites and such.  You click a lot on the - poorly drawn - monsters, when it dies you get gold, that's used to spend on upgrading your damage so you can kill things quicker.. and that's literally all there is to it. Little effort has gone into the game and nothing that makes it any better than the already existing clicker games. It claims to have multiplayer however you have no interaction with other players, you just join a party in certain areas and everyone's clicks/dps goes towards the same creature. You may not even end up joining other people in the limited time and you can get through it without them if you've got high enough damage anyway. A relatively pointless aspect of the game and adds nothing to it.  It lists the “areas” as a feature but there’s really no difference between them other than the childish artwork.. which you really don’t need to care about in the slightest.  The item names are in hashtags and most are memes and references which i personally find #dull ... You can use the items on the creatures that contain the same tag words, there’s plenty of items but they’re mostly the same thing just act on different creatures.  I've not played it since it was released so it's been a month since playing and getting around to writing a review. I've had no reason to go back to it.  The only good thing about this is that it’s short and thankfully there’s an end to it unlike most others, so if you like collecting achievements then you can get a few easily and free. There’s certainly nothing “epic” about this game though.",
            "review_score": "-1"
        },
        {
            "review_text": "  It became one of my best clicker games, with the constant updates and fixes, developers who listen to players I like that, it has great potential but kinda a lot missing though I'm pretty sure the developers are already working on adding new things. I see many people saying that the game is very hard and require cash to progress, I say that's BS, like most or prehaps all clicker games, you start weak and you first journey will be the hardest then everything becomes much much smoother you just have to grind the right location and have patience, it's true some features are incomplete but it's getting updated or fixed. its just minor things.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a lot of funny creatures, many places to discover and some great, epic music in the background. It's perfect to chill.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and funny game, although it needs a lot of time for farming its still fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Good, fresh, intresting, many new concept mixes. Strongly recomended to all who likes the clickers. Recomended to anybody else. ",
            "review_score": "1"
        },
        {
            "review_text": "I clicked Freddy Kruger to death!!!",
            "review_score": "1"
        },
        {
            "review_text": "Seems like it hits a bit hard at the 'give us money' drum without directly asking for it.  A few examples, a health potion costs 5000 gold, and health regenerates painfully slow, but the most gold you can gain per area (which you can repeat) is around 1500ish for the multiplayer area with much tougher monsters, the ones you can plow through with only taking a little damage might only pay 300 gold.  After 3 areas, you have the multiplayer area and an area that needs a key to get past. The key also costs 5000 gold. The second keyed area only requires 5 keys to get past.  Started playing last night, plowed through the first 3 areas, found some people for the multi area, then did it again for the money and happened to find a key the 2nd time (woo!) but then after I finished the 1 key area, I was at about 40% health and it was regenerating at about 2 per second when I have about 3000 health, got bored of waiting and killed the game to play something else  Overall the game seems unpolished but has really strange artwork, so mixed overall.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! You should play this! Why? It's not boring, and if you want to do something instead of nothing, you will enjoy it. 10/10 Clicker game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good but almost 'nobody is there'. I you want to play the game is no problem but you need days to play it. So good luck!!!",
            "review_score": "-1"
        },
        {
            "review_text": "So hard to play F2P. ♥♥♥♥ game. basicly unplayable without paying.",
            "review_score": "-1"
        },
        {
            "review_text": "Normal was pretty fun but once you finish the last map you are instantly transported to the 'new' area. The new area is an exact repeat of the first map except you earn the same money, enemies do x5 damage, and you have no way to heal other than wait. You can buy one potion every map or two but that only heals 1/3 of your health. So you wait.  There's no way to go back and farm either.. so you just wait.  You also don't get anything for prestiging. No awesome new items. No awesome new abilities or stats..   Game was solid up until I beat the last enemy. Now it's a 0/5.",
            "review_score": "-1"
        },
        {
            "review_text": "On the bottom of clicker genre. Items have no stats and dont mean anything, followers scale extremely linearly and its boring. No real redeeming qualities.",
            "review_score": "-1"
        },
        {
            "review_text": "If you just need a game to pass the time and doesn't require much effort, this is a game you need. It is a little confusing at first (I didn't fully understand the items and 'fellows' at first), but you quickly get the hang of things. Characters are enjoyable and usually some reference to movies, comics, games, etc. I will probably try to complete it.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game to begin with. You can't just leave your computer running like in 'Clicker Heroes', this makes it feel like a real grind to lvl up. Like the grind has a purpose! Item drops kinda matter and investing in your items seems legit.  However despite the obvious repetitiveness, it is made all to clear that once again the focus is on your money and not the game. Specially when at the higher lvls, (The point at which one might be tempted to invest into their 'characters') they have the nerve to just copy paste. Here is the exact same world you just beat... Do it again only harder. I didn't get to the third lvl of difficulty, but I'll go ahead and guess its the same world a third time with a difficulty spike.....   Look, you can have my money, just make a game out of the gimmic. Id be happy to play this simple format AND pay for asthetics if the content was constantly expanded. Like a clicker World of Warcraft, with stories n stuff... Why so lazy? I know little to nothing about codding but in a week I self taught myself and built something like this (without the graphics). You want our money? MAKE AN EFFORT!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Just another Clicker? Or something more?  Only time.....will tell.",
            "review_score": "1"
        },
        {
            "review_text": "just another.... wrreck your fingers and mouse game",
            "review_score": "-1"
        },
        {
            "review_text": "Well.. looks like I've got a new internet crush",
            "review_score": "1"
        },
        {
            "review_text": "No and No",
            "review_score": "-1"
        },
        {
            "review_text": "was running really smooth then it says save isnt in sync with server and wont run game. anyone know what happened? otherwise it is a fun time killer.",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ makes me to write more fast",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, but I wish there was more world content and I wish there was a way to get more gems without buying them...like rewarding people for getting to certain points in the dungeon, or achieving certain levels.",
            "review_score": "1"
        },
        {
            "review_text": "  Great clicker game, at some point it actually gets repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "Quite fun, hard to get far. I would recommend it for people who have a lot of time. But rather who don't, don't waste the time that You have on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a NO, but I'm giving this a positive review out of courtesy to the developer becuase he has so few reviews and it was free. I don't play clicker games, so maybe for clicker game players this would be OK.  You click on monsters faster than they 'click' on you, get gold and then new equipment or gold when you level and then keep clicking. The only strategy, at least as far as I played, is to know when to flee and start a level over. If you start a level over you keep you gold, experience and equipment. If you don't and die, you only keep your level.  A painful yes, that I will change a immediately to a No, once they get more reviews.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game for one sole purpose.  IF YOU DIE YOU LOSE ABSOLUTELY EVERYTHING!!  Why does this matter? Because there is ABSOLUTELY ZERO INFORMATION ABOUT THIS.  None. Nada. Zip. Zelch. Nothing. There is no tutorial about this 'in-depth' information. I found out the harsh way after being curious about what happens if you die. I lost the entire invintory i had, all XP and my follower. ♥♥♥♥ this game. All of that work that i wasted on this game? Gone? BECAUSE I HAD NO INFORMATION?!  ♥♥♥♥ you, Cleversan Software.",
            "review_score": "-1"
        }
    ]
}