{
    "app_id": 414920,
    "name": "Corgi Warlock",
    "release_date": "2015-12-03",
    "developer": [
        "Xander's Corgi Arcade"
    ],
    "publisher": [
        "Xander's Corgi Arcade"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Local Multi-Player",
        "Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 207,
    "negative_ratings": 57,
    "price": 1.69,
    "description": "Corgi Warlock is a 1-4 player side-scrolling fantasy action game, where one brave Corgi will take on the Skeleton Bunny King's army! Against the power of Narwhals, Fencing Bears, and Crazed Unicorns, it takes more than your average Corgi to survive the King's onslaught... it takes a CORGI WARLOCK.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/414920/header.jpg?t=1534379698",
    "minimum_requirements": "OS: Windows Vista Processor: AMD or Intel Dual-Core at 2.0ghz or greater Memory: 4 MB RAM Graphics: Direct X 10 or greater DirectX: Version 10 Storage: 133 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've spent several hours playing Corgi Warlock, and overall, I have to say that I'm impressed with the game. It's a side-scrolling action platformer with monsters to kill, loot to collect, and upgrades to attain.  The graphics and soundtrack are good, and the controller mechanics are both consistent and responsive. I enjoy gaming with a controller, and nothing disappoints me more than a game that advertises full controller support but doesn't deliver. Corgi Warlock delivers.   There are 10 levels to the game, and so far, I've made it to level 7. What I thought at first was a casual gaming experience is actually really quite challenging. The layout of the levels isn't where the challenge comes in, it's the progression of monsters with varying degrees of health coming across the screen at a steadily increasing pace.   The additon of obstacles such as platforms over water, jumping sharks, and fireballs flying across the screen add unpredictability and the need for quick response time to the mix. As the levels progress, response time gets shorter and shorter while the difficulty increases, meaning that even the most hardcore gamers will find a challenge during the latter portions of the game.  I did experience a few oddities that I want to point out. The first is that killing a coin-dropping monster with a tower in the background results in coins getting stuck in mid-air on the screen. This can be re-created most easily in level 6 or any level where there are step-like platforms leading up to a higher level. The bottom level ends at a gray tower, meaning that you can't advance any further to the right. However, the monsters are coming from the right side of the screen, as well as the left, so if you stand right at the end of the bottom level and shoot, or jump up on a right-side platform and shoot, coins will regularly drop and fly up into the tower, getting stuck on the screen where your character cannot go.   This brings me to the second oddity, which is that the Steam Overlay doesn't seem to work with this game, and neither does the F12 button for taking screenshots. I wanted to take a screenshot of these trapped coins to publish, but I couldn't figure out how to do this. Neither F12 or the Print Screen button worked for me, and I was unable to use Alt-Tab and snip tool to clip a JPG. Anyone determined to get a screenshot would likely have to clip a frame out of a video streaming session.  Other than those couple of things, which really didn't reduce my enjoyment of the game, overall, I didn't experience anything that would cause me not to recommend the game. It's appropriate for young and casual gamers as well as experienced gamers looking for a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This game is truly a hidden gem among indie games! I love finding indie games that stand out from the crowd and this one certainly does that.  In all honesty, I have only been playing the single player campaign all by myself and have not had a chance to play local campaign or multiplayer but if it plays as good as single player, then this game is a HIT!  10/10 would corgi again.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but somewhat easy and short.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely satisfying 4-player local co-op! Remarkable in that players of widely varying skill levels can play together and have fun. (Yes, it is on the easy side, which is good for the right group. Try handing an occasional gamer the controller for multiplayer Spelunky or Risk of Rain... recipe for frustration.) Not AAA polished, but it has a ton of charm and the visceral satisfaction of charging together through a level laying down a solid wall of fireballs, lightning, and red beams of death is undeniable.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for play in coop-mode with friends, Thanks so much for this game, pretty funny by the way..  emm ¬¬ hey! Developers or Publishers: can i have a Corgi-Dog real too? thanks a lot! :3  Regards! ;) ^^",
            "review_score": "1"
        },
        {
            "review_text": "  Corgis are the best",
            "review_score": "1"
        }
    ]
}