{
    "app_id": 415000,
    "name": "GTGD S3 How To Make A Game",
    "release_date": "2016-03-07",
    "developer": [
        "GTGD"
    ],
    "publisher": [
        "GTGD"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Steam Trading Cards"
    ],
    "genres": [
        "Education",
        "Software Training"
    ],
    "tags": [
        "Game Development",
        "Education",
        "Software Training"
    ],
    "achievements": 0,
    "positive_ratings": 44,
    "negative_ratings": 0,
    "price": 5.59,
    "description": "Welcome to Series 3, an in-depth set of video tutorials where you will learn to code an awesome single player FPS system from scratch in Unity 5. If you want to learn how to make a game the smart way then you've come to the right place.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/415000/header.jpg?t=1551818200",
    "minimum_requirements": "OS: Windows 7 SP1+, 8, 10 Processor: Intel i5 Dual Core Memory: 2 GB RAM Graphics: Something that can handle games from the last few years. DirectX: Version 9.0 Storage: 8 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Usually you need to pay hundreds of dollars, if not more, to learn an incredible amount. You simply cannot miss when you're just paying $6.95 US for this gem!  The first chapter is helpful for those new to Unity but the real meat of the learning comes in the chapters after that. The system created makes it extremely easy to customise weapons, items, enemies. You can also create and customise melee weapons, destructible objects and now videos to make AI for non-player-characters is possible. So you will have a really powerful, customisable and memory-efficient system.  Videos are broken up into small chunks (usually between 3 and 10 minutes, but occasionally stretching to 15-20 minutes) covering only one section per video, which makes it extremely manageable for viewers, as opposed to 30 minutes or more with some other tutorials (or indeed many of the tute videos from Unity themselves).  The guy doing the tutorials also has an extremely clear voice and is easy to understand. This makes the difference between him and other people who try to do Youtube tutorials.  I could keep going, but hopefully I've already convinced you this is more than worth a few dollars!",
            "review_score": "1"
        },
        {
            "review_text": "This is so good. I hope you will also include a boss battle in the game. I would love to learn how to create a boss to make any game more fun. That would be awesome!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would watch again",
            "review_score": "1"
        }
    ]
}