{
    "app_id": 41500,
    "name": "Torchlight",
    "release_date": "2009-10-27",
    "developer": [
        "Runic Games"
    ],
    "publisher": [
        "Runic Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action RPG",
        "Hack and Slash"
    ],
    "achievements": 66,
    "positive_ratings": 3825,
    "negative_ratings": 317,
    "price": 10.99,
    "description": "Adventure awaits in the award-winning Action RPG debut from Runic Games! Explore the randomized depths of this boom town, collect loot, and level up to save Torchlight - and possibly the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/41500/header.jpg?t=1501607845",
    "minimum_requirements": "OS: Windows XP or later Processor: x86-compatible 800MHz processor Memory: 512MB Graphics: DirectX-compatible 3D graphics with at least 64MB of addressable memory (such as an ATI Radeon 7200, NVIDIA GeForce 2, or Intel GMA 950) DirectX®: 9.0c Hard Drive: 400MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I don't really play games like  Torchlight . The style of action RPG proliferated by titles like  Diablo  never really interested me. It's mostly just a repetitive slog of killing and looting identical enemies who changed only statistically, becoming incrementally more difficult so as to retain the same amount of effort required for their deaths. While  Torchlight  is all that and more, it managed to keep me entertained for quite some time through diverse enemy types, artistic direction and engaging skill trees.  The gameplay hardly needs explaining--it's like  Diablo . You control most everything in the game using the mouse and some hotkeys. I chose to play as the 'vanquisher' class, focusing on ranged weaponry and magic related to it. The abilities of this class mostly serve to complement her ranged weapons, and I managed to completely finish the game without even equipping a melee weapon. I did find that the class benefited significantly from having summoning spells, allowing players to fire powerful ranged spells at enemies while minions keep them at bay. A lot of the more powerful weapons felt great to use, and I was impressed by the game's lenience toward players interested in multiple gameplay styles--nothing stopped me from summoning an army of skeletons, even though I didn't choose the class focused on that at the start of the game.   Torchlight 's balancing feels fine, though later levels do feature some enemies with huge damage output that were a pain to get past. I really liked the way the game's entire story takes place in a single dungeon, with the player's gradual descent into the earth beneath the titular town slowly revealing different fortresses and ancient ruins all lying beneath the ground. The game begins with entry into the mine upon which Torchlight's economy is reliant upon, but before the game's end you'll see a sprawling necropolis, colourful, flooded ruins and a fiery dwarven fortress. The graphical diversity keeps things interesting, and everything's quite pretty too. I liked the cartoony art style, but I found it quite curious how many enemies were simply recoloured, buffed up a bit and reused.  On release, some criticised  Torchlight  for it's lack of any form of multi-player component. I personally found this to be a good decision, as a single-player game tends to be more focused.  Torchlight , despite the admirable streamlining of UI and gameplay still contains a large amount of engaging content, even after the final boss. I just don't know if  Torchlight  will be one of those games that the average player can get a huge amount of mileage out of--while I found the content to be sufficient, it certainly does get old after a certain point.",
            "review_score": "1"
        },
        {
            "review_text": "It's well balanced, simple and a lot of fun to play. If you're looking for a deep storyline you'll get dissapointed. But if you look for a very decent Diablo clone with pleasant graphics, nice sounds and music and a very fluent gameplay, you found what you're looking for. I finished the main story, but the random dungeons still hook me to this game. Really an indie gem that lead to an even more polished sequel. Fully recommended if you're into action RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Look, this game is great if you like a simplified Diablo type game. It has a more vibrant color palette than Diablo games, making it more cartoony and more accessible to young children, but the gameplay is solid and fast enough for anyone to enjoy. I'd rather play the sequel Torchlight 2 because it is twice the game this one is, and it has multiplayer which this one does not. The story is pretty bare and simple here. Basically this is a good game and I would say worth a playthrough, but if you want your money's worth then get Torchlight 2 over this one. However if this game's style is not to your liking then I would recommend checking out Grim Dawn which is graphically superior and mechanically similar to this and the Diablo series. If steampunk is more your style then give The Incredible Adventures of Van Helsing: Final Cut or Victor Vran. If you want something more anient gods style then check out Titan Quest: Anniversary Edition.",
            "review_score": "1"
        },
        {
            "review_text": "It's a streamlined Diablo/Diablo2 with cutsey graphics; you liked those, you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "A classic RPG that i missed out on years ago! Great game with good visuals and easy to pick up. Skill system is simple and the game is alot bigger than i first though it may be. Overall, 40hrs in and im loving it. HIghly Recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The best Hack 'n' Slash between Diablo 2 and this year's boom return of the genre. Torchlight and Titan Quest were pretty much the only Hack 'n Slash during this period, at least that I can think of, and Titan Quest weren't that similar to Diablo. Torchlight have a similar atmosphere to the Diablo classics, even though the art style and graphics are more colorful and high-res that those of Diablo 2 - They still have very similar atmospheres.  A few guys in the Runic Games studio did work on Diablo 2: Lord of Destruction, and therefore have a professional insight of what made the original game so great. I wish to prevent using the term Diablo-clone, because it casts a negative shadow over a great game, but Torchlight is a obvious success of cloning. In some regards, Torchlight is even better than Diablo 2 because of it's added genuinity.  As every Hack 'n' Slash and RPG, you get to choose your class. In Torchlight there are only 3 classes; Vanquisher, Destroyer, and Alchemist. All three with different perks and advantages. Vanquisher is Range, Destroyer is Melee and the Alchemist is a Mage. Clear focus point for the three classes is speed, strength and magic in that order. You get to modify each class heavily though throughout the gameplay so each class can look very different in the end. There are a lot of different types of Weapons and Armors in the game, as expected from the genre! Loot is the most wonderful of things, see.  One unique addition is the pet system, where you always have pet with you. This has a few advantages; for example can the pet go back and sell your loot, for non-stop hacking and slashing. The pet also helps out in the fights, and can never die only flee and run around like an idiot. You can boost your pet with armors and jewelry, as well as bind scrolls to the pet that it will cast by itself. I never upgraded my pet too serious though, I always forgot to give it new items - so it's not a game breaker. Just a neat feature.  Sadly Torchlight lacked in a few areas as well, Multiplayer mostly so. Hack 'n' Slash is most enjoyable in co-op, where mowing through hordes of monsters become more of a sport. Luckily this year's sequel, Torchlight II, has improved the series greatly while maintaining the renowned Diablo aura. Torchlight offers rogue-like gameplay with the Hardcore difficulty settings, if you get tired of playing like a wuss.    Worth picking up if you like Hack 'n' Slash and mindless killing, just be prepared to do it alone. Very good atmosphere and art-style    Note: It might be worth checking out  Torchlight II  ( Review ) as it only improves the original in all ways. As well as Free to Play game  Path of Exile . ",
            "review_score": "1"
        },
        {
            "review_text": "Bottomless dungeon crawl. Essentially an 'improved' Diablo 1 with more 'family friendly' story and graphics. It really does play better than Diablo and has some enjoyable trais of its own (fishing and maps). There is an editor for the moding community to play with. All in all an enjoyable game if not perfect.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a cartoony Path of Exile mixed with some Diablo. I like everything about it but some things here  Actual things wrong with the game  - Tabbing out on fucllscreen causes the screen to bug out, getting rid of the hud or smearing characters across the screen.   Minor Annoyances  - Quests don't have a guide which can be a pain during the beginning where you don't know where anything is but some people would like this.  - There really isn't a 'tutorial' like in a lot of games that teaches you all the binds and what to do when you level up and such. It isn't too hard to get past this but it's a pain in the beginning.  - Instead of phasing out a wall when you go behind it, you get outlined awell as everything else behind the wall.",
            "review_score": "1"
        },
        {
            "review_text": "The most simplistic and fun dungeon crawler out there.",
            "review_score": "1"
        },
        {
            "review_text": "Wow.  I've played this game in 2016, and despite aging graphics, this game is a shining jewel.  Graphic design is amazing of talent, finely polished and readable. Battles are spectacular and shining with effects, but still easy to read. Animations are excellent, musics really fit... There is real talent in this game. It's a small game that builds upon a perfect engine and very smart design of the (rather few) features provided.  It's a jewel. I liked it way more than Diablo 3 crap.  F*ck you Blizzard fans, by the way. Just because.",
            "review_score": "1"
        },
        {
            "review_text": "It plays EXACTLY like a better-looking version of FATE, which is fine because FATE was an okay game. It's about as basic as dungeon crawlers can get but still functionally works and offers a good amount of replayability.  All in all if you like FATE you're getting the same product here, but if you like other dungeon crawlers...well you're getting the same product here with a different skin.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Diablo 2, but slightly more modern. The clickyness of Torchlight was a little too much, and was adjusted in Torchlight 2. There's a lot of interesting mods as well. The game is okay to kill some time, but I wouldn't bother.    I'd recommend Torchlight 2 over Torchlight, but Path of Exile over Torchlight 2. Path of Exile is FREE!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. All the mod support just makes it even better.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is an excellent point and click dungeon crawler. Its fun to waste a few minutes on when you don't have the time to get super involved in a game for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, very streamlined diablo clone notable for its lack of multiplayer. Still a good time, recommended if you can purchase for 10 bux or less.",
            "review_score": "1"
        },
        {
            "review_text": "If you have a soft spot for Diablo, Torchlight will provide hours of entertainment -- right down to the ambient acoustic guitar score.",
            "review_score": "1"
        },
        {
            "review_text": "Still a great game even after all this time and since Torchlight II was released. Had played this when it first came out and just re-bought it along with the 2nd one as part of a collection sale over this past holiday event. For just a few bucks you sure can't go wrong, and you sure as hell will have more fun than with some of those 50-60$ games out there now. This franchise has so many great things and got so many things just right to make this a classic for any RPGer/action/adventure gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Essentially a 'diablo clone', but a very good one. Great leveling system, wonderful visuals. An absolute 'must' if you enjoy the genre at all.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight 2 improves on this in every way, and adds co-op and Workshop mods, but TL1 is still a solid game. Smaller in scale, focused, doing everything it tries to do really well. The combat, looting, skills, etc. are all excellent. It has NG+ also. (Plenty of mods too, but you'll have to install them manually.)",
            "review_score": "1"
        },
        {
            "review_text": "This game was a little more cartoony than I was expecting. It would probably be good for a younger audience, and was a pretty good game objectively, I was just personally a bit put off by the overall cartoony feel of the game. Has some nice mechanics though.",
            "review_score": "1"
        },
        {
            "review_text": "It's like spelunking for candy in a massive, beast-filled dungeon of rainbows and happiness. And it's not hideously overcomplicated like other games of its kind.",
            "review_score": "1"
        },
        {
            "review_text": "Single-player Diablo-like game (action role-playing dungeon crawler, isometric clicky clicky with randomized loot drops) that came out in 2009. The world was still waiting for Blizzard to deliver the next Diablo, and so, this was well-timed. (Runic went on to release Torchlight2 at around the same time that Diablo3 came out.) It also has a pretty deep mod community, though I'll admit that I played the game vanilla on my playthrough.  The game is polished: graphics aged fine, clean audio helps the game feel immersive and responsive, and the game runs smoothly on my high-end gaming rig. Did not try it on anything else, but I suspect it'll run just fine. The story is nothing new, but then again -- you're not really playing this game for the story. It's a game where you diablo diablo diablo til you diablo diablo diablo, while you diablo diablo diablo... diablo. In that aspect, the game entertained me 'til the end. According to the in-game panel, that was about 12 hours.  One point of emphasis: the game difficulty runs easy. If you want a challenging game in which you engage all the mechanics, I'd highly suggest you nudge the difficulty up. In my playthrough, I didn't touch any of the optional map-fragment dungeons; simply the main dungeon and the ones that Hatch opens for you, in his Quest For Many Things. My character's levels almost always matched the number of the main dungeon floor I was on. Though I do have a habit of clearing each floor completely, I shouldn't have been overleveled for any part of the game. And yet, I never had to use a mana potion or any of the various mana shrines. Didn't touch a health potion until L25, and even then rarely. Never had to fiddle with my pet's form -- simply used him as a carryall back to town to sell my items. (So, that took the need to fish right out of the picture.) I had no real use for my currency. (Game only has one -- gold.) I was one-shotting enemies with the gear I found on the ground. I cannot imagine the devs intended for you to three-shot their bosses. At some point toward the end, I just decided to put 100k gold into enchanting a single item, you know, for funsies. I suspect the devs had intended for the enchantment system to work as a gold sink, but I simply didn't need the stat boosts to make the game less challenging. I'm afraid it would have become boring.  I never once used any spells. I also didn't bother learning any non-passive class skills outside of the first available frost shot. Once I learned that, that's what I left my secondary attack on.  Perhaps it was simply because I'd built up a ranged, spike character and the dungeons are designed with bottlenecks galore (hallways and corners everywhere, weeee), but giving the ranged player a NPC tank, a single-target spike, AND a piercing crowd-control projectile so very early in the game may have been overkill.  Even if you haven't played a Diablo before, turn the difficulty up a bit.  Other small notes: Pet pathing. I realize this is sticky for many devs to get right, but boy -- my pet did not know how to go up stairs when the stairs were perhaps seven feet away from him. It's a small irritant, of course, since I could simply spend the 5 seconds moving around to manipulate his pathing algorithm. Replayability. Once you beat the game with any class, a new 'Shadow Dungeon' opens up. I fully admit that I will not be playing the game again (I have far too many other things to get to!) but that along with being able to 'retire' a character to pass along a heirloom makes it seem as though the replayability is solid. And again, there's a pretty decent mod community.",
            "review_score": "1"
        },
        {
            "review_text": "The best Hack and slash RPG since Diablo 2!",
            "review_score": "1"
        },
        {
            "review_text": "A solid dungeon delving game with enough plot to keep you exploring and enough drops to keep the loot hoarders happy. Having your pet along to carry all your crap is a nice plus too.",
            "review_score": "1"
        },
        {
            "review_text": "A great Hack and Slash loot fest of a Game. If you are a Fan of Diablo and any game of that type, then this game is for you.  The amount of activities in the game will keep you occupied for at least a good 30 - 40 hours. ",
            "review_score": "1"
        },
        {
            "review_text": "Made from the makers of Diablo...while we wait for Diablo III.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty awesome and TL2 will be better!!",
            "review_score": "1"
        },
        {
            "review_text": "Not as cool as the second but still good. ^(&lt;&gt;)^",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Love comparing loot &amp; gear!",
            "review_score": "1"
        },
        {
            "review_text": "Just like Diablo, only boring, unoriginal, pointless... wait, exactly like Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is not an alternative to Diablo or Path of Exile if that's what you are looking for. It is a much smaller game, in both size and scope. However, it is quite fun and will provide you with many hours of entertainment. Despite its age and limited graphics, I honestly don't think you can go wrong with this game.",
            "review_score": "1"
        },
        {
            "review_text": "In between Diablo II: Lord of Destruction and Diablo III, fans struggled to get their 'Dungeon Crawler' fix anyway they could, through games like 'Sacred', 'Titan Quest', 'The Elder Scrolls', and other games. When the original team of Blizzard North was dissolved, they opted to make their own Dungeon Crawler game. The result? Torchlight!  Torchlight an immesrsive experience in which you descend into the the town of Torchlight, via the Ember Mines, to combat Ordrak, the villain behind the attacks on the small town. It has your traditional hack and slash routines, including item finds, various skills, set pieces, and other staples of dunegon crawler games.  Just like Diablo II, it's very easy to start playing the game, and 'forgetting' how much time has transpired since you first started playing. If you have 15 bucks, pick up this gem, or wait for it to go on sale, as it seems to routinely do. A great game for all Dungeon Crawler enthusiasts!",
            "review_score": "1"
        },
        {
            "review_text": "It's really good....for a game that was created in 2009 these days it kinda sucks...but still fun just very very repetitive",
            "review_score": "1"
        },
        {
            "review_text": "A cartoon version of the Diablo series. Very fun game and fun levels!",
            "review_score": "1"
        },
        {
            "review_text": "Definetly a classic. Torchlight, improves everything you liked in games like diablo and offered more.  A bunch of customization and 1 of those rpgs where there is no right or wrong spec... just your spec and your way to go.  Better than Torchlight 2, this classic is a true masterpiece that makes any fan coming back for more. Im actually gona reinstal it right now...",
            "review_score": "1"
        },
        {
            "review_text": "I never cared for Diablo, so it's a bit puzzling that I put so much time into Torchlight, a derivative made in part by makers of Diablo &amp; D2. Most tout D2 over Torchlight due to its multiplayer/larger class variety, but Torchlight's interface addresses my problems with the genre.  The main problem with ARPGs (esp. Blizzard's) is 'tedium' &amp; 'excessive mouse clicking.' Torchlight takes real measures to reduce both. You can hotkey commands to ALL keyboard numerals. You get an invincible pet that not only doubles your inventory, auto-attacks enemies, and can pick up items for you, but can be told 'go back to town and sell your items to free up space.' THIS IS HUGE. You're also CONSTANTLY getting new gear, which makes Normal mode a breeze. Alas, you still left-click to both move AND attack.  As far as aesthetics, I prefer that in this game, you can dual-wield GUNS and effectively set up machinegun sentry turrets. Hits have impact. Enemies can be pretty massive. One's even a chaingun mecha!",
            "review_score": "1"
        },
        {
            "review_text": "Yes it is a diablo-clone, but it is damn good one at that.",
            "review_score": "1"
        },
        {
            "review_text": "Click, click, click, click click, click, click click, click, click click, click, click click, click, click click, click, click click, click, click click, click, click......Thus the sound of your life being spent playing this awesome action RPG. I ain't even mad. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "It can be very simple, but can also be complicated if you wish it to be by delving into stats and gear more, which gives it a wide appeal. Like Torchlight 2 this is just a fine quality, complete game. If you like Diablo-esque games then this, it's sequel, and Path of Exile are definitely worth a try. The sequel is much bigger, but the simplicity of this first game has it's own merits too, howver you can't customize characters in the first game, unfortunately.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy clicking on things until they explode into loot.",
            "review_score": "1"
        },
        {
            "review_text": "Solid game. It's does the genre justice.",
            "review_score": "1"
        },
        {
            "review_text": "Poor man's diablo for ya. This game is something like cute spinoff of diablo 2, they even use the same scroll names. Good game but if you played Diablo 3 you may find this game nintendo version of diablo.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and addictive game. For both the casual and real gamers, this game can really suck you in and keep you playing for hours. I would consider this high on the dungeon crawler list!",
            "review_score": "1"
        },
        {
            "review_text": "The aesthetic is smooth and the gameplay is intuitive and fun, but the story and world leaves much to be desired. Somehow, even as an RPG lacking an immersive story, it manages to keep you playing for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive! A very hard to stop playing game! VISUAL: 8 GAMEPLAY: 9 AUDIO: 10 FUN: 9 FINAL SCORE: 90",
            "review_score": "1"
        },
        {
            "review_text": "Much more heart and soul than Diablo III or Torchlight II combined! This is where they should have concluded the 'Fate' saga from Wild Tangent.  Torchlight II failed this game.  Time to start over with a new intellectual property.",
            "review_score": "1"
        },
        {
            "review_text": "Another Diablo-like game. :P",
            "review_score": "1"
        },
        {
            "review_text": "TORCHLIGHT on my scale gets a 7.5/10 this game is very nice the map systeam the low graphics allow lesser player to experience a game like diablo. for this review will have some comparisons with diablo but no game should be just like diablo. The storage system in this game amazes me the fact it doesnt have expansion but, it teaches you how to manage to give to another character. The stash and shared stash is something that also raised this game to my liking.  So say you beat the game hurah! and u want to play on hard mode and not lose all your weapons there u go the shared stash will allow you to redo the game but keep ur kick butt weapons. Hud- well the hud i do not completely understand everytime i try to put an abillity inside it doesnt all i hv is a health potion an a pre-set abillity i dont even want! that plays a factor in the losing .5%. the fighting in this game is a little off perfect there is a bug that will make your character stand still and not move and you wont be able to drink a health potion either truly something the ruins the immersfulness of the game.  lastly the pet, the pet u get is something that seperates the game from other you start off with this pet and hes with you all the time when ur in a sticking sitiuation your dog/cat/etc.. will come and save your butt. if you equip your pet right with the right spells it will help A-LOT. this game is something i play on the side but i will complete it i very much reccomend buying this game and once i get torchlight 2 i will review that thanks id you read this all. ",
            "review_score": "1"
        },
        {
            "review_text": "A pure hack &amp; slash experience. Enter the flow and forget where you are. Click. Click. Click. Click. Click. Click. Intro bliss.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent single-player RPG in the style of Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "7",
            "review_score": "1"
        },
        {
            "review_text": "Play it on Hardcore Easy, and see how long of a lineage you can make (retire early).",
            "review_score": "1"
        },
        {
            "review_text": "WARNING: This game is highly addictive. Use with extreme caution.",
            "review_score": "1"
        },
        {
            "review_text": "I'd say just buy the sequel, but I'll recommend anyway as the game's still good.",
            "review_score": "1"
        },
        {
            "review_text": "Despite its simplicity it is strongly addictive. For those with lame hardware)",
            "review_score": "1"
        },
        {
            "review_text": "GAME WORKED FINE WHEN I GOT IT NOW IT DOESN'T..STEAM DOESN'T CARE TO FIX IT...I JUST LoOooOVE GIVING STEAM MY MONEY FOR FREEE :|",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun. Has lots of action, but mostly the tactics are just a matter of hitting your buttons really fast. A lot of item management, but easier than some other item-heavy games. Fun to have firearms with swords and magic all together.",
            "review_score": "1"
        },
        {
            "review_text": "What a cute game. Looks great and plays great, but it is for children, 7 year old D&amp;D fans will love it.",
            "review_score": "1"
        },
        {
            "review_text": "I was allover this game on the 360, and jumped ship to Torchlight 2 on here. When you return to Torchlight from Torchlight 2, you'll see how good a game Torchlight actually is compared to it's successor.  If you ever if have a few bucks laying around, get this game. The cheaper it gets, the more awesome the deal with this title. It already is a good buy at the going rate though.  Great game. Cynics might call it a poor man's Diablo 3. If only Diablo 3 was like this...",
            "review_score": "1"
        },
        {
            "review_text": "Oh boy, here comes a game with maximum power of epicness! It's very much based on the Diablo series, even better than Diablo at some corners I think, sending your pet to sell stuff while you're in a dungeon is just a tremendous feature, if you like RPG this is something for you all the way!",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe I just found out about this game. If you are a huge diablo fan like myself you will for surely enjoy this game as much as me. It's ♥♥♥♥ing amazing hands down I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Cartoonish graphics aside, this is a pretty good arpg. recommended as a time killer.",
            "review_score": "1"
        },
        {
            "review_text": "Love the items and the gameplay, a solid RPG for hacking and slahing. Great save feature, leave and hop in at any time, so play for a few minutes, or for a few hours, it's all easy!",
            "review_score": "1"
        },
        {
            "review_text": "This game's actually pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Scratching that Diablo 2 itch",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed Diablo II this is, in my opinion, the spiritual successor. Immediately you should preorder TL2.",
            "review_score": "1"
        },
        {
            "review_text": "Was new to the genre and thought torchlight was kind of cool, it's not really something I preffer but it was different, cool game overall, ending is ♥♥♥♥♥♥♥♥ hard.",
            "review_score": "1"
        },
        {
            "review_text": "Good game cant wait for Torchlight 2",
            "review_score": "1"
        },
        {
            "review_text": "It's good but it's not right. Just say what you see.",
            "review_score": "1"
        },
        {
            "review_text": "Even better than Torchlight 2, which is WAY better than Torchlight!",
            "review_score": "1"
        },
        {
            "review_text": "After the debacle that is Diablo III - this is a refreshing find prior to the upcoming Torchlight 2.",
            "review_score": "1"
        },
        {
            "review_text": "Great hack-n-slash game, colorful art style, SP only unfortunately.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Diablo style RPGs!!!! 1 and 2 are better than Diablo 3",
            "review_score": "1"
        },
        {
            "review_text": "Great dungeon crawler modeled after such epic titles as Diablo 1 and 2.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is the game that will tide you over until DIablo III comes out. Great little game, easy to play, nice graphics, something is always happening that will keep you going.  Next time it goes on sale, pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "Nice hack and slash RPG to play while waiting for Diablo III",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Diablo, you need to be playing this game now.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game to spend some time while waiting for Diablo III.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight 1 is an excellent game. While TL2 does improve on many of its core features, there is still tons of value packed into the original title. Definitely worth a purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Got bord with your other games? This game you will be playing for hours killing monsters getting epic loot and awsome skills.",
            "review_score": "1"
        },
        {
            "review_text": "It's only downside is the lack of co-op, and bag space.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game, but Torchlight II improved on a lot of things. I kinda feel like Torchlight I is like Diablo I (One town, descending deep into the dungeon with different environments) while Torchlight II is more like Diablo 2 (Separate Acts)",
            "review_score": "1"
        },
        {
            "review_text": "A very good Diablo clone. I really like the cartoon-like characters. Exploring is always fun and the baddies get toughter the lower you go in the mine.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is a blissful way to feed your action-RPG addiction. It's a budget version of Diablo 2 but with all the fat and grind removed and a delightful level of enhancement added to the experience. The visuals are very pleasant, eschewing the grim gore and putrid monsters of Diablo with an almost storybook charm.  The game is incredibly smooth and easy to play. Your character quickly levels up in power and the improvements noticeably make a big difference. The pet is a brilliant tool for adding to your damage and your personal economy, and it's all too easy to get attached to the little bugger. The 3 character classes add a lot of replay value and the upgradable skills diversify the personality of gamplay immensely.   Unfortunately there's no multiplayer. Single player is strong enough to make me forget about that however, even though there's little interest to the story.  $15 is a terrific value, but the sale prices of $7.50 and $5 = INSTANT BUY. You WILL get your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "better than d3 by miles yes",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is akin to that of Diablo 2, but focuses on single player. It only has three classes to select, but it does offer a variety of challenges to keep you busy. If you're into RPGs, you should check this one out.",
            "review_score": "1"
        },
        {
            "review_text": "Fun. Much like Fate. Too much like Fate. Feels like a successor to Fate. Although I beat fate, I have not beaten this game, probably cause I feel like I have already played it.",
            "review_score": "1"
        },
        {
            "review_text": "If you are an old school fan of the diablo series you will enjoy this title.",
            "review_score": "1"
        },
        {
            "review_text": "Great Single Player Dungeon Crawler. Can't wait for Torchlight 2!",
            "review_score": "1"
        },
        {
            "review_text": "This game has the best hourglass cursor on its loading screen.",
            "review_score": "1"
        },
        {
            "review_text": "Cellshade Diablo-esque with pets that can go back to town and sell things for you. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "As Torchlight 2, a wonderful hack n slash. The only thing that I do not like in the Torchlight series is the too childish graphics. Oh wait I do not like the fact that they're really too easy too. Except fpr that they're really good. Get it at the right price, there are tons of offers around.",
            "review_score": "1"
        },
        {
            "review_text": "So many people call this a Diablo clone..., well, IT IS a Diablo clone, it even was made by some of the people that made the original Diablo, but it's a fun dungeon crawler.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome lootfest RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is an excellent Diablo style game for the price.",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe it took me so long to find this game. So much fun and easy to pick up and learn!!",
            "review_score": "1"
        },
        {
            "review_text": "For an alternatice to diablo its quite good, it feels more vibrant to diablo but lacks multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty version of 'Moria' on stereoids, the way a dungeon crawler should be done. Diablo 3 can suck it.",
            "review_score": "1"
        },
        {
            "review_text": "A worthy entry into the Dungeon-Crawler arena. Perfect for keeping you busy waiting for Diablo 3",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is the game. If you are a Diablo fan this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Very formulaic action rpg, yet very well executed. Music, inventory system, item gradings etc are straight out of diablo 2 (I mean, key people from diablo 2 team made this game) However, that doesn't mean the game has no charm. it definitely will suck you in for hrs and hrs killing baddies, looting items and golds, and turning your pet into protective elementals.",
            "review_score": "1"
        },
        {
            "review_text": "Was a good time killer.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. It's Diablo, but more cartoony and with extra lasers. Otherwise it's very grindy and the story is dull.   Bright flashy colours are neat though, also random loots. Worth playing co-op, but also worth waiting until Torchlight II comes out, or failing that. Diablo III.  The Devs of this game have the makings of a fantastic game, if only they didn't have to compete with Blizzard.",
            "review_score": "1"
        },
        {
            "review_text": "The map repeats itself through the level of the dungeon and gets booring. And don't trust that f**king enchanter!",
            "review_score": "1"
        },
        {
            "review_text": "Delightful. Brilliant. Addicting.",
            "review_score": "1"
        },
        {
            "review_text": "It's a bit repetitious and tedious sometimes, but it's a solid game. Also, you have a pet.  You love pets, don't you?",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is one of the most addicting and fun games I've played. I highly recommend it to everyone!",
            "review_score": "1"
        },
        {
            "review_text": "Runs on pretty much any modern PC, feels like a classic RPG, and has a decent amount of loot to boot",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is a great little game that wont rob you of your lifetime. It has several levels of difficulty, so it can be as challenging as you want to make it. Normal mode here took almost 1 month to complete (though there are many quests that you can do even after defeating the final boss). This game has a sequel too - Torchlight II!",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is basically what Diablo's single player campegn should have been. All the dungeon crawling fun, but the loot you find is ACTUALLY USEFULL! No more killing 500 enemies to find a single sword that's margionally better than the one you just spent 300k gold on in town.  Grafically, it's simplistic and colourful, and though it looks a little dated, it's still a very pleasing pallet.  I recomend this to anybody looking to plumb the depths of a dungeon for loot and gold without worrying too much about extended cutscenes and serious plotlines.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on the Summer sale for $3. Even though I paid $3 for it I would pay the full price for it ($15), something I can't say about most games on Steam. I have never played dungeon crawler games like this for the most part, but I have thoroughly enjoyed my time playing it so far. It sort of looks like World of Warcraft but plays like Gauntlet/Diablo. Lots of character customization and the combat is very fun and the perfect level of challenging. Overall I would reccoment this game as I think it is a great introduction to the dungeon crawl genre.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best indie games out there. This game has got everything one might want from a hack-and-slash genre representative: flawless and fluent gameplay, excellent music (with a new 'haunting guitar theme' (tm)), nice random-generated level design, interesting art-style. Now the game has no co-op, but I don't care since I only play single-player anyway. Another debatable issue are the models used for enemies. Some like them, others don't. I personally find them a bit funny and well-fitting for an adventure of this type. Those looking for more grim environments can always play Diablo series instead. Another problem might be a very primitive story, but that has, unfortunately, become 'standard' for most hack-and-slashers these days. This game deserves 9 out of 10 at the very least and I eagerly anticipate part II (like many others).",
            "review_score": "1"
        },
        {
            "review_text": "This dungeon crawler is more action-oriented RPG. But that's OK. It was right down my alley. Mod-friendly and easy to get into, Torchlight is also developed by some of the people who have worked on Diablo and Diablo II. If you need a refreshing change of pace, this would be the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "From the same dudes that made Diablo 1 and 2. Indie company doing incredible things. Instantly a favorite.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great hackey-slashey dungeon crawler. Graphics are beautiful, the story driving you deep underground is well done, and if you think there's something missing there's a large mod community that may have what you're looking for. Mods are even endorsed by the developers, as evident from the mod-related achievements. The only thing that could make it better is multiplayer, but the devs decided to save that for the next one.",
            "review_score": "1"
        },
        {
            "review_text": "fun until i realized that they were not going to add multiplayer, insted the came out with torchlight 2",
            "review_score": "1"
        },
        {
            "review_text": "It's been a very long time since I played an isometric click-battle looting game, and this was a nice reintroduction.   I don't need to tell you what 'sort' of game this is. You should already know, should already at least have heard of Diablo-styled games if you weren't living in a cave. However, I review this game as a gamer, and not a hardened veteran of the genre. I think I've only played this game type less than five times.   The game is colorful, that's for sure. The best way to characterize it is that it gives a feeling of polished Warcraft 3 graphics. Most things are visually pleasing, but you cannot customize your character - at all. Many of the bits of gear are shared templates. The soundtrack is suitable but completely forgettable. The voice acting, what little of it there is, is pretty good. Now on to the meat.   You have your pick of three classes: an alchemist, a destroyer, and a vanquisher, and they are all genderlocked. That is, a mage, a warrior, and a rogue. Each class has three skill trees, but there aren't that many actual skills, and the variety only goes up to level 25.   This is important: you cannot respec. This is a problem because many skills either do not scale well, or become obsolete. Both Torchlight games are moddable, so I assume SOMEONE must have included a mod for this, but if you're going to play vanilla, you'll be stuck with whatever you've got. You can look up builds, but I'm going to be up front here - if you're on Normal or Easy mode, you can probably completely screw up your character and still make it through.  Your stats generate base values for certain abiliites of course, and determine what kinds of gear you can wear. More on this in a moment.  You can also learn up to 4 spells from scrolls, and are able to unlearn and switch them out with better versions/different ones once you find or buy them. This was important for the alchemist, because he HAD NO HEALING SPELL. I bet that since the mage didn't have one, the other two classes didn't either.   Your pet, whom you pick at the beginning of the game, serves several functions. He attacks, of course, and you can feed him fish to turn him into various other creatures temporarily. Fishing as a mini-game is amusing for all of five minutes, and in spite of what it does I never needed it. He can hold as much loot as you can, he can learn two spells, equip two rings and a necklace, AND you can send him back to town to sell whatever he's got in his inventory. Once I figured this out the only time I went back to town was to pick up more quests. If you shift-click you can have him pick up items (I typically had mine loot 'grays'), but there's no way to have him pick up anything by himself.  As I trudged through the main dungeon's innards during the game's woefully simple plot, several things became immediately apparent. The first is that if, like me, you prefer to do sidequests before the main quest, you will be massively overleveled. Normal mode has been written off as too easy by pretty much everyone, and the sidequest mechanic doesn't help. Through most of the latter third of the game I found my mage running around with his small army of minions basic-attacking things with a wand and shield and positively steamrolling EVERYTHING. Which brings me to my next point.  Sometimes limitations are there for a reason. Each class has 3 trees, but since the gear is stat-based, you can have mostly any kind of character you want. My mage was fairly balanced between offensive spells and minions. I basically ran around with my two golems, the pet, two imps, 6 zombies (three from the pet), occasionally 6 skeletons (all from the pet), firing overpowered thunderbolts while teleporting around with a damage absorbing shield. With each wave of that wand I stole both health and mana. I'm fairly sure I wasted several precious skill points on abilities that were out-leveled or simply not very good in the first place. The fact that I was doing it all in half-warrior gear was the icing on the OP cake, and frankly the game just wasn't up to the challenge.   The interface was a little... quirky. You cannot rebind keys, and you only get one quickslot bar for skills and potions. Left click and right click can be designated as well, with a third Tab-accessed function for right click. By the end of the game, at least half of my skills could not be used, because you apparently cannot use them from the skill menu and I had no space for them.   Sometimes, when re-arranging inventories (there is no auto-sort), I'd accidentally stick a gem into an item. Using most of the items from the inventory screen requires a RIGHT click, but apparently not gems. The only way to get them back out is to destroy the items. You have two inventory pages thanks to the pet, one bank, and a storage bin that's shared between all characters. It's not a lot of space considering the game is about loot.   The vendors are what you'd expect, with one exception: the enchanter. His sole function is to turn whatever item you give him into a better item, which can mean either stats or gem sockets. Although I hardly used it, I thought this was a pretty nice feature. There's a % chance of the item become disenchanted. It's a nice way to upgrade generic gear that may have better base value than older gear, though the process is hideously expensive.  The clicking frenzy of battle works fine for a warrior, I'd imagine, but is a bit messy for a mage with minions, and probably a ranged rogue too. Some skills go right where you click them, some require only pointing in the general direction of a mob. Attacking with a ranged weapon when there are many mobs is frustrating, and since left-click to move is a thing, I frequently found my mage running headfirst into groups of mobs whenever he'd use his wand. The key point is that basic attacks do NOT activate unless you click right ON the mob, and if you have minions this can be a real mess. Sometimes skills can be used up or down staircases, and sometimes they can't, often times for the same skill. This sort of randomness is not a major gripe, but it's definitely noticeable.   AI companion pathing is reasonable. Many times my minions would be stuck in nearby areas because the levels are packed fairly tightly with many turns. If you want to be cheap you can hit enemies with ranged attacks in other areas of the map because they're not smart enough to find their way to you.   Speaking of those levels, one of the talking points of the game is the randomized environments. Truthfully, you'll notice some repeated designs, but for the most part you either won't notice or care.   The difficulty in the final few floors ramps up dramatically, even if you're five levels higher than the mobs. It's hard to know what combination of possibly gimped character stats, and a couple of cheap monsters created the difficulty, but it was the only time in the game where I died. And the last boss? Oh, you better be ready for that cheapness. The final battle was completely unimaginative to boot.   If you complete the few long-running sidequests along with the main story, you'll probably look at somewhere between 15-20 hours of play. Some people blast through it (especially on easy mode) in 6 hours, and some people blow over 60 hours on it. To be honest, the real game felt short, and since Torchlight II is out (and reputed to be superior in every way), the only reason to play through this title is because the story is continued (although it's painfully simple) in T2. Unless you're a hardcore fan of the genre, do NOT pay full price for this game.",
            "review_score": "1"
        },
        {
            "review_text": "A very good Diablo clone. I really like the cartoon-like characters. Exploring is always fun and the baddies get toughter the lower you go in the mine.",
            "review_score": "1"
        },
        {
            "review_text": "The best RPG game I have ever played! Very simple kill 'n' loot game that anyone can play!",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is a fun dungeon-crawler/RPG/thing, especially for fans of Diablo. Also a great time-killer. The character customization is a bit lacking (there is none), but they have promised to change that in Torchlight 2 (sometime this year... please?). The main story is kind of typical (good guy researches evil stuff for good, becomes corrupted), but the great thing is that the game doesn't end once you finish the main story. I definitely recommend for anyone to give it a try, especially considering it is always cheap whether it's on sale or not.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little time waster that improves upon the same addicting gameplay as its little brother Fate. If you've played Fate before, you know what to expect from here.  Only problems that I have with the game are that there's no multiplayer and that the default normal setting is painfully too easy. Set it on hard if you're interested in something resembling a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "If Diablo and World of Warcraft had a baby Torchlight would be it. It's the same point and click style of combat familair to the Diablo series but with a WoW style grapical twist. A healthy dose of Borderlands style upgrades and class diversity make playing it over and over a blast.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics are a bit dusty but instantly give you the feeling of playing an old Warcraft game. Action, RPG and Adventure, all blended beautifully together in one game. It's a bit like World of Warcraft, stripped down in terms of environment and also without the other players. For me personally also outstanding is the 'randomly-generated dungeons' feature. Anticipating Torchlight II with multiplayer, but I'd say this one is a must-have aswell.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes for an easy review in my opinion, It's fantastic. Steam has me clocked in (currently) at just under 6 hours of play time. I, however have tons more time invested in this game as I have also completed it on my Xbox 360. Owning this game on two different systems should be enough praise to get you to buy it. To add a little more fuel to this, if they add this game to the Xbox One list I will buy it there as well.   I love Diablo....LOVE it. I've been playing the Diablo franchise since it was first unleashed opon the world all those years ago. It has everything I could want in a good game and Torchlight, being a Diablo clone (and very competent one at that) does it all just as well. Sure Torchlight has a more cartoon like feel and is more comic book like in its graphics, but that's not a bad thing. It deos everything right. Quests, gear, challenge..it does it all just as well as Diablo ever could.   If you don't haver the money to get Diablo itself, Torchlight is a great substitute. Hours of fun, great environment, excellent level design and you can tell the devs put love into its creation. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Especially for point and click (call me Diablo) fans.  Has a lot of loot: money, items, armors, weapons.  Many side quests and plenty of hours to play.   The maps do not diff much and lots of enemies has similar properties , The story is Indifferent and after a few levers can be bored. The games dificulty is quite easy.  You can easily find magical weapons and armor but be carefull you can eaily lost all properties if you enchanted many times",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is pretty much a clone of Diablo 2 and similiar games but with a more cartoonish style. You start in a town and work your way deeper and deeper into the ruins underneath the city, finding treasure, beating monsters in randomly generated levels. Every now and then you head back to the surface to buy new stuff, get skills and spells or do sidequests to gain experience points. It's overall a decent game if you like dungeon crawler. As for me, i quickly lose interest, the repetetive nature of these games isnt my cup of tea.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderfull game in a great good designed world. Very cool.",
            "review_score": "1"
        },
        {
            "review_text": "If you've wanted to try an action-rpg for some time, but never wanted to get into the whole Blizzard thing, Torchlight is for you. The system requirements are low. The game is sort of easy, but if you are a newcomer, you won't be dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "If you have played and enjoy games like Diablo, Crimson Alliance, Dungeon Siege, etc. then you will enjoy Torchlight. I am eagerly awaiting the second game in the series. The mod community did a real good job developing some nice add-ons to keep the life span of this game going well beyond what it was originally developed for. The development team consists of ex-Blizzard employees who had a hand in Diablo, so that isnt a bad thing at all. Great game and I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "What is there to say? It's a fun little game that is similar to Diablo. You get to choose a companion animal to assist you in your fights, carry items, and to send back to town to sell items when needed. You can also download the TorchED program to create your own dungeons, quests, and more. Plus, talking to the horse in the village is entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is, in a word, satisfying. Yes, it isn't some radical new game concept or an incredibly high-profile game that's been promoted and advertised as much as CoD, but that doesn't mean that it's a bad game. The story is decent, though not particularly remarkable; all it really needs to do is provide an excuse for you to go smashing your way through waves of enemies and leveling up. I love the graphics; they are colorful, detailed and hi-res. Two thumbs up for me.",
            "review_score": "1"
        },
        {
            "review_text": "Great Diablo clone! Cartoonish graphics, old-school hack and slash gameplay and a soundtrack that grows on you like the Diablo games. No wonder a part of Diablo's team is behind this gem. This game also has tons of fantastic mods to play around with! Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "It's hack-n-slash on steroids or perhaps speed. I've never tried either, but I assume it's one or both of them.  The pace is quick with lots of enemies to fight through and a decent number of customizations and skills for each character class. You level up reasonably fast to get to new abilities. With what seems to be almost unlimited side quests and then deeper dungeons after finishing the main 'story', there should be a decent amount of replayability, though it does seem that it can get repetetive if you really wanted to delve farther and farther. The Steam Achievments also make continued play a decent possibility.  The biggest thing on 'roids in this game, though, is the insane amount of loot and coin you will come across on each level. It just keeps coming and coming as you are constantly looking at newer equipment as well as enchanting options to constantly work to get your character that much more powerful.   Too much loot? Not really. Except on special quest levels, getting back to town to sell your extra stuff is almost no problem. At first I would send my pet back to town to sell extra stuff, but it didn't take long and I had enough teleport scrolls to quickly send me back to town. I probably spent as much time going back and forth between town and the dungeons to sell my extra stuff. It is the perfect OCD action RPG as I almost never had to drop anything to make room for something better. Pick it all up and sell what you don't use. You can use the coin to get some of the gems and other enhacements you want to work with that you can't find lying around.  I've played better and spent more time on others, but it is still a satisfying dungoen crawl that will probably call me from time to time to go just a bit deeper or a level higher so that I can see what's more I can do with my character. For it's reasonably quick main quest playing time, it seems almost obligatory to start it over again with a different playing class to see how it changes the experience.   Once again, not the greatest, but more than entertaining enough to make it worth a play through for action RPG enthusiasts.",
            "review_score": "1"
        },
        {
            "review_text": "Diablo meets steam punk. A short but fun action RPG. Would have enjoyed multi player in this, but that's what torchlight II is for. But this was still quite a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, good for beginners with Diablo-like RPGs. I woud love to see controller support (Steam or XBox 360) on PC tho.",
            "review_score": "1"
        },
        {
            "review_text": "This game rocks. Only bad thing is that there is no multiplayer. Can't wait for TL2 4/5",
            "review_score": "1"
        },
        {
            "review_text": "For anybody who played Diablo 2 back in the days, this game is a must-have. Tho it's only Singleplayer, you'll have lots of fun playing through it's story. I'm already awaiting the Sequel which should have a multiplayer. Atleast that's what I've heard. Grafics: 7/10 (Not everybody's Style) Gameplay: 8.5/10 (Once you leveled up and got ze uber-equip you'll just ♥♥♥♥ everything) Price: OK!",
            "review_score": "1"
        },
        {
            "review_text": "Good hack and slash, put some time in until diablo 3 comes out.",
            "review_score": "1"
        },
        {
            "review_text": "I greatly enjoyed this game! Nicely done.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't touched this nice RPG yet... Then now there is NO excuse because the current price is so low that this game (allready good) now is totally essential for the RPG lover....",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant dungeon crawler. Great time waster. Excellent art style that perfectly suits the mood of the game. Random dungeons means it never ends as long as you want to keep playing.",
            "review_score": "1"
        },
        {
            "review_text": "6/10",
            "review_score": "1"
        },
        {
            "review_text": "Yeah good old-school rpg, graphics in the style of warcraft III, some interesting music scores throughout. play this shiz.",
            "review_score": "1"
        },
        {
            "review_text": "Classic RPG and Loot game that doesn't always play the same. If you played the game FATE, then you have played Torchlight. FATE was the godfather of ARPG's along with Diablo. It's worth noting that the Torchlight series was made by a small group of the original team that created Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "This game is indeed created by team of the most famous Diablo HOWEVER this is more or less casual and nothing of hardcore. You can only pick three different classes (No custom) What did you expected from Diablo gameplay? The story seem good and not too bad, some twist plot that might surprise you a little. This game actually have a few great idea for adding to game to make it easier for you, this team of Torchlight know how to do it, that for sure!  The so-called great idea I said when I mean to level up of your character, higher weapon and armor as well however you can actually retire if you wish and therefore to make new character again! In return for the benefit to grant you ONE item per on any of your armor, weapon or accessory for higher damage or higher resistance and such after this, your character will wear the one item per called Heirloom which your previous character forged it and pass it on to your new character. What interesting me is having your own pet as companion although it only has cat or dog... BUT the companion will take your stuff back to town and sell it then return without even set up the portal to enter and sell it yourself! This team of Torchlight popping up the idea have been evolved to made this game much fun and not even Diablo have yet to add in gameplay.  The vertern team didn't make this game for nothing! All thank to previous Diablo's effort. This may have very few flaw in gameplay, level up your character is quite diffcult even after finish the storyline. Not enough of waypoint in each maps.",
            "review_score": "1"
        },
        {
            "review_text": "The dungeon crawler I never new I always wanted. I love Torchlight. It reminds me of playing Baldurs Gate with my friends in the late 90s, with updated graphics and a more interesting story line. The difficulty ramps pretty evenly, the dungeons are interesting and the modding community is amazing. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun hack and slash game.",
            "review_score": "1"
        },
        {
            "review_text": "yes best game ever can not wait untill the second one comes out ",
            "review_score": "1"
        },
        {
            "review_text": "What can I say, if you liked Diablo and Diablo 2, then you very well might like this game too.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game to be very enjoyable. It's well worth the price, especially at the 90% discount. I would recommend this to anyone that enjoys the Diablo series or any RPGs in general.",
            "review_score": "1"
        },
        {
            "review_text": "Another game I just keep playing.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is a good Hack and Slash RPG by the creators of Diablo. Instead of the dark creepy tone of Diablo the art style is more colourful and cartoonish like World of Warcraft. You won't look as bad ♥♥♥ as in Diablo 2 and it makes enemies powerfull enemies not very scary. The game is very polished and feels high quality. The gameplay is very good. It's too bad it's only single player, but because of that they made it very modable. So there are a ton of good mods for it. This is one of the best HnS RPG's out there. So if you like Diablo 2 you should definitely get this one.",
            "review_score": "1"
        },
        {
            "review_text": "You love it if you're into Diablo!",
            "review_score": "1"
        },
        {
            "review_text": "Visually pleasing, solid gameplay mechanics but ultimately repetitive and kind of pointless really. The story is bascially non-existent and the combat, whilst satisfying, remains essentailly unchanged, It's fun for a few hours, but the lack of variety makes it easy to put down and forget about in the end,",
            "review_score": "1"
        },
        {
            "review_text": "Great game - Absolutely excels at delivering the oldschool Diablo 2 experience, and the sequel is shaping up to be a real treat.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay-wise it's on par with Diablo II; not nearly as good as Diablo III. But it's cheap and runs on older PCs and without an internet connection, and it's still a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good, play on hard though",
            "review_score": "1"
        },
        {
            "review_text": "20:48 - Sticky~: sup 20:48 - ¢asual ᖘlayer: Diablo killer 20:49 - Sticky~: ♥♥♥♥ you &lt;/3 20:49 - ¢asual ᖘlayer: what 20:49 - ¢asual ᖘlayer: what 20:49 - ¢asual ᖘlayer: what 20:49 - ¢asual ᖘlayer: I meant torchlight 20:49 - ¢asual ᖘlayer: It's awesome! 20:49 - ¢asual ᖘlayer: and kinda addicting 20:50 - ¢asual ᖘlayer: Only downside is that it's too easy 20:50 - ¢asual ᖘlayer: I picked normal because it said 'for people who new to action-rpg' 20:51 - Sticky~: oh 20:52 - Sticky~: how much does it cost 20:52 - ¢asual ᖘlayer: I got it for free with my torchlight 2 pre-order! 20:52 - ¢asual ᖘlayer: How awesome is that! 2 games for the price of one! 20:52 - Sticky~: should i get it? 20:52 - ¢asual ᖘlayer: Another reason why everyone should get it",
            "review_score": "1"
        },
        {
            "review_text": "the guys from Blizzard North did their job well.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for people who liked the diablo games, its great to fill the gap while I wait for diablo 3 :) def worth a buy",
            "review_score": "1"
        },
        {
            "review_text": "Fun game for people who don't care for Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "Like dope, you cannot go wrong with this naive Diablo love tribute. GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "How to say this ? It was my first experience in this genre and I quite liked it, but the game got boring after repeatingly clearing similar floors and fighting the same enemies (just stronger) than I did before. Nonetheless it is interesting and I am looking forward to playing the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "This is, in all honesty, my ♥♥♥♥♥♥♥ wet dream. Innumerable minions, magic spells, easily learned system, appealing graphics, etc. etc. The only downside is a lack of multiplayer. You'll sometimes get tired of the constant grind but they have a lot of different things to switch up your gameplay. Sorry I waited so long, will be getting Torchlight 2 the day it comes out.",
            "review_score": "1"
        },
        {
            "review_text": "Three playable characters: a brute, a busty-archer, and a mage. A town atop an endless dungeon that’s randomly stitched together as you play. Hundreds of enemies that die in a torrent of clicks. Scrolls. Health and magic potions. Quests. Leveling. Loot. More loot.  Diablo is the obvious comparison you could draw with this combat-heavy RPG, but Torchlight is more than a clone. This is like a super-clone with psychic powers. Choose a character. Choose a companion cat or a dog. Enjoy a quaint cutscene, and then wonder where your evening went.  With Torchlight 2 on the horizon, and Diablo 3 even further down the line- enjoy this game as your go-to clicky-looty-action-rpg. The game just recently went on sale already, but perhaps we can see some deals when T2 releases.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Great dungeon crawler",
            "review_score": "1"
        },
        {
            "review_text": "Diablo-like. Fun, but can get repetitive fast without mods. Keep an eye out for Torchlight 2, it should be out later this year.",
            "review_score": "1"
        },
        {
            "review_text": "Great single player.",
            "review_score": "1"
        },
        {
            "review_text": "Ah, the first Torchlight. action-rpg, dungeon delving goodness. My recommendation varies depending you why you are seeking this game out. Torchlight is a wonderful game in and of itself. However, there is little reason to play it over Torchlight 2, which is far superior in everyway. This in no way take away from the quality of the original. The classes are great, the delving is great, the action is great, etc.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best hack and slash RPG's out there! If you're a fan of Diablo, you'll surely enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "If you are an old school fan of the diablo series you will enjoy this title.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it",
            "review_score": "1"
        },
        {
            "review_text": "From the original Diablo 2 devs, this will provide hours of fun monster slaying and item hoarding. If only it had multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "It was ok. There were a lot of inconvenience and things that didn't make sense, which I won't tell you for it will be spoiling. However the game was still fun enough to make you reach through the end. Enjoy.  By the way, if I am going to play this game again, I am not going to play as Alchemist.  -) When Items are stacked together it is hard to sort out the things you want among them. -) Your minions aren't shown in the map, nor their health. -) Minimap is bad. It does not show minions, stairs, etc. It is just whine lines. Sometimes It's impossble to see how the map really is because of the structures. -) There are no additional guide tips for the quests on the minimap or whatsoever. It is really easy to overlook. You just have to search for them in every corner and by pressing 'Alt' key a lot. -) Lack of information is serious in this game. You can only pick up information after the incident. I lost my favorite wand by enchanting it. He turned it into a damage 0 wand; a stick. The NPC just said it might degrade it in certain percentage but never told me it could turn it into a piece of junk.",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Ridiculously addictive dungeon-crawler. If you enjoying murdering monsters and picking up ridiculous amounts of loot, magic and weapons then this game is for you. Very pretty as well, plus you get a ♥♥♥♥♥♥♥ed pet that is your best friend forever.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a cartoony lightweight version of Diablo 3, with even greater amounts of customization for your character. May not have an endgame as complex as Diablo 3, but as John Locke once said, 'It's not about the destination, it's about the journey.'",
            "review_score": "1"
        },
        {
            "review_text": "Its good. Lot of originality and the game world is nicely rendered. But the amount of weapon drops and items kinda kill the gameplay. You constantly are having to check bags and decide on whether to keep or drop items. Its like an MMO cept a bit more annoying on the loot. The lack of a variety of classes means each class has multple routes which change how it plays, but overall it also can complicate things if you want to change up play style. Lack of multiplayer is also a hinderance but not game ending. Buy it whenever it goes on another Steam sale. Its worth it then for sure.",
            "review_score": "1"
        },
        {
            "review_text": "The map repeats itself through the level of the dungeon and gets booring. And don't trust that f**king enchanter!",
            "review_score": "1"
        },
        {
            "review_text": "Great hack-n-slash game, colorful art style, SP only unfortunately.",
            "review_score": "1"
        },
        {
            "review_text": "if you liked diablo, pick this up, looks gorgeous and is great play. missing multiplayer but still awesome ... i'm totally digging it.",
            "review_score": "1"
        },
        {
            "review_text": "if you enjoyed the diablo games at all, well torchlight is a million times better and the money won't be going towards people who are ruining blizzard",
            "review_score": "1"
        },
        {
            "review_text": "For $14.99, Torchlight is a steal. Any hardcore RPG fan out there needs to get their hands on this game. A deep dungeon crawler, Torchlight shares some similarities with World of Warcraft. All the loot, skill trees, side quests and adventures are present. Though only a single player experience, it's an addicting one at that. Functions like gems, gambling, alchemy, spells, costumization and achievements make this game hard to put down. I highly recommend it to any RPG fan who is looking for a fresh experience.",
            "review_score": "1"
        },
        {
            "review_text": "I was not a big fan of dungeon games until I got my hands on this game. You will play for hours and still want more. Loot will always keep you coming back, and new (bigger and stronger) monsters will make the game more challenging.",
            "review_score": "1"
        },
        {
            "review_text": "If you need something to hold you over until Diablo III's release, this maybe the perfect fit. Set very identical to the original Diablo where there's one town and a multi floor dungeon. You will also get a pet companion that can run back to town and sell your supplies so you don't need to restart the dungeon from the beginning.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is a point-and-click adventure for beginners to advanced players. The designers took various different aspects of other games of its genre and wove together a game works quite well. It generates maps for every hero, and it adds replay value with dungeons you can access through portals. The addition of multiplayer support in the next version can't hurt, of course.  I recommend at least giving it a try, as you may be surprised by how it grows on you.",
            "review_score": "1"
        },
        {
            "review_text": "Amaazing game. A little small, but its great.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth a play-through with friends but has no real lasting purpose. The bosses are generally interesting battles but I found myself not giving a single iota about loot in a game based on it.",
            "review_score": "1"
        },
        {
            "review_text": "et remines me ov aa gayn cawled deeablo too.",
            "review_score": "1"
        },
        {
            "review_text": "My all time favorite Diablo-esque title. Has just about everything you could ever want in a dungeon crawler, and whatever it's missing is going to be added in Torchlight 2, can't wait!",
            "review_score": "1"
        },
        {
            "review_text": "Yea this game was good when I played it back some years back..kicked butt..in fact probably more enjoyable than d3 was in ways (d3 had a better story)...oh and torchlight 2 was very good",
            "review_score": "1"
        },
        {
            "review_text": "A fun ARPG game with a good loot system, interesting artwort, decent music and most of all fun to play! Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great Dungeon Crawler for anyone who prefers soloing bosses.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight isn't a game. It's an addiction.  Everything about Torchlight is very simplistic. From the fighting (which is as simple as 'point and click') to the story (which I barely remember after 20+ hrs. of gameplay). It becomes mindless, and after awhile Torchlight made me feel like a rat hitting a feeder bar. I'd *click, click, click* to kill monsters, hope for some good loot, and repeat. Playing on normal mode was perhaps a bit too easy, as I only ever died out of stupidity. Even the bosses were very easy, with the exception of the final boss who was entirely unbalanced with the rest of the game.  Though I'm glad I'm now free of its grasp, I must admit that I had fun playing Torchlight. Any RPG expert will have fun balancing player, pet, and weapon/armor stats, but the actual gameplay and story will remain a bit dull.  My rating: 3/5",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight was developed by some of the guys who worked on Diablo 1 &amp; 2. It's essentially very similar gameplay, the most noticeable difference being how bright and colorful the game looks in comparison to Diablo. This may be a turn-off to some, and very welcome to others who are tired to the standard dark and brown color schemes in games these day.   If you're unfamiliar with Diablo, Torchlight is still a very accessible game. ARPGs are quite easy to get the hang of, as far as controls go (clickclickclickclick Q 124356 etc.) It's rather slow-paced, which might bug some people as it starts to feel boring after a few hours in a play session. Having a pet companion helps make the single player descent less lonely/ Pets will fight by your side, and also sell any excess items you give it in town for you. Dungeons are somewhat randomly generated. Loot drops also varies.  The game is quite easy on Normal difficulty due to the abundance of potion drops, and the ability to just spam the potion button when you are in trouble. You shouldn't expect to die very often at all. Although this might give the game a bit of a casual feel, it is still an enjoyable single player game that isn't overly lengthy. You can get a good 25 hours in. Don't expect much on the story front; it's rather bland and not very memorable. Besides, the core of the game is centered on loot.   While this game is worth the price, you may want to shell out an extra $5 for the sequel, which, in addition to fixing how rigged potions worked, the slow pace, adds much more to the game with regards to loot, classes, monsters, skills, and importantly, multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Super addicting! Have gotten lost playing the game, wanting to just beat one more boss. Don't play if you know you have something to do",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the biggest suprises of my recent purchases. First i thought of this as a Diablo clone, but is is much more then that! Lots of fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "Great single player.",
            "review_score": "1"
        },
        {
            "review_text": "finished the 360 version with a melee character then tried to do the same on PC.  ranged characters have a huge advantage on pc over the 360 version which annoys me as i always play fighters first.  having more achievements is fun and you forget how much time you lose while playing these games.  because it's done by old blizzard people even the town music sounds like diablo 1.",
            "review_score": "1"
        },
        {
            "review_text": "Diablo 2 taken less seriouisly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is indeed created by team of the most famous Diablo HOWEVER this is more or less casual and nothing of hardcore. You can only pick three different classes (No custom) What did you expected from Diablo gameplay? The story seem good and not too bad, some twist plot that might surprise you a little. This game actually have a few great idea for adding to game to make it easier for you, this team of Torchlight know how to do it, that for sure!  The so-called great idea I said when I mean to level up of your character, higher weapon and armor as well however you can actually retire if you wish and therefore to make new character again! In return for the benefit to grant you ONE item per on any of your armor, weapon or accessory for higher damage or higher resistance and such after this, your character will wear the one item per called Heirloom which your previous character forged it and pass it on to your new character. What interesting me is having your own pet as companion although it only has cat or dog... BUT the companion will take your stuff back to town and sell it then return without even set up the portal to enter and sell it yourself! This team of Torchlight popping up the idea have been evolved to made this game much fun and not even Diablo have yet to add in gameplay.  The vertern team didn't make this game for nothing! All thank to previous Diablo's effort. This may have very few flaw in gameplay, level up your character is quite diffcult even after finish the storyline. Not enough of waypoint in each maps.",
            "review_score": "1"
        },
        {
            "review_text": "Really great if you want a single player Diablo fix. If this had any online capability, I bet this would probably be incredibly popular.",
            "review_score": "1"
        },
        {
            "review_text": "I had TORCHLIGHT II for a few weeks on my wishlist. Now I bought both the first and second TORCHLIGHT via Steam sales for about five bucks each. Well, after I started the first one 'just to see if it was worth the 4 bucks' I think I just might have overseen the part in the buying process where it states that TORCHLIGHT is one of the best RPGs you can get out there and that it will cause an instant addiction if you're rudimentarily interested in RPGs.  But no, seriously - this game is as simple as great. The story is not too deep, but you can instantly start it without any problems and have fun. Tons and countless hours of fun.  I'm not a programer and the last time I did play a RPG was the time when DIABLO 2 came out.  If you can get it for a decent price / when it's on sale, do yourself a favor and buy it. You won't regret a single penny. Awesome. SImply awesome. Slashing, hacking, firing, collecting, collecting, collecting.",
            "review_score": "1"
        },
        {
            "review_text": "A childish yet highly entertaining dungeon crawler. RPG elements are simple yet flexible enough to give you incentive to keep playing. The combat vigorous &amp; a foray of loot &amp; weaponry to sate the hungriest of appetites of loot addicts. If you like games like Deathspank, Diablo 3 or Dungeon Hunter Alliance then Torchlight is definitely a purchase well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The music in Torchlight always reminds me of the countless days I spent playing Diablo. As it should, since it is the same composer.  It might be lacking multiplayer and the story is a bit thin, but the core gameplay is great. 9/10 fishes.",
            "review_score": "1"
        },
        {
            "review_text": "I could play this game for hours without end. Good yet subtle story and enticing gameplay. 11/10 Torchlight. Can't wait to play Torchlight 2",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoying this game. I was looking for something that was similar to Diablo 2 and super happy that I got this. The graphics are vibrant and the gameplay is fantastic. The weapons feel powerful, the enemies are tough-ish (when you get surrounded) and I just love equipping my character with newer, more powerful armour every half hour or so. Have travelled considerably far with the vanquisher. Waiting to for the Alchemist next!",
            "review_score": "1"
        },
        {
            "review_text": "A fun (albeit simple) romp that paved the way for the far better sequel. Giving this a once-through is still good fun, although not necessary to understand or appreciate TL2. It's good to support indie developers of high-quality titles, though, so TL1 is still worth picking up during a flash sale.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say, if you liked Diablo and Diablo 2, then you very well might like this game too.",
            "review_score": "1"
        },
        {
            "review_text": "This is ar really nice RPG. At a sale price, this is a real deal to get. However, if you are just going to try RPG's or this game out. I do not recommend buying it at full price, because it costs a little bit. There might be only 3 charactres, but the diverse gameplay you will get is amazing. You can go on for hours without getting bored. There is always new corners of the mine to fight and places around the world to discover. Sometimes, the monsters in some areas get boring, as they are kept at a range of monsters. However, I would recommend getting this game overall.",
            "review_score": "1"
        },
        {
            "review_text": "a good pocket diablo II.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a classic dungeon crawler. Its lots of fun and easy to pick up",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight = Diablo II - multiplayer + numerous UI improvements + mods. It's tons of fun if you like dungeon crawls, gathering loot, and killing a ton of monsters with three different default classes.",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, a decent little hack n slash isometric RPG with a unique pet partner that can manage your loot for you... the first Torchlight game is singleplayer only so the second one is better mainly in that regard.",
            "review_score": "1"
        },
        {
            "review_text": "Worth $20!!!",
            "review_score": "1"
        },
        {
            "review_text": "A suprisingly fun little dungeon crawler. It reminds me of Diablo in the way you have a central town and go deeper and deeper into the dungeon, all the while finding tons of loot.   I really like the upgrade system where you can combine items to make better items and also tweak weapons and armors with certan abilities.   The graphics are smooth even with lots of spells/enemies exploding all over the screen. Add in pets and summons and there is lots of stuff going on at once.",
            "review_score": "1"
        },
        {
            "review_text": "The best bits of Diablo dipped in rainbows.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is a dungeoncrawler where you use the mouse as movement device and keyboard for your spells kinda like diablo. The fact that it looks alot like diablo isn't really strange since most of the team worked on diablo. In this game you can choose between 3 diffrent characters the destroyer (warrior), the vanquiser (archer) and last but not least the alchemist (mage/summoner). Each of them have there own unique builds and play styles. Its are really fun game however it has one major con and thats the fact that it doesn't support online.  I would still say its worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight doesn't have multiplayer. That is a major shortcoming in this sort of game. That said, it's a damn good dungeon crawler. Coming from the developers behind the first two Diablos (and featuring music by the same composer, a man that will make you believe guitars can sound haunting and foreboding) it should come as no surprise that it does everything those games did and more, with various time-saving, anti-frustration features that serve to streamline the game experience and keep you in the fight. I played Torchlight for a lot longer then it took to simply beat the final boss, which should be testament to it's sheer addictiveness. However, an addictive game is not necessarily a fun one, and Torchlight will eventually wear out it's welcome in your library. It's worth its low price for what you get, but at this point you may be better off waiting for the multiplayer sequel or the eventual MMO.",
            "review_score": "1"
        },
        {
            "review_text": "This is what Diablo 3 should have been! I can't wait for the sequel, but even if its more of the same, you can't go wrong. This game has a ton of replayablility and there's a lot of room for character customization to be done with both the experience and fame systems. Not to mention, it looks great!",
            "review_score": "1"
        },
        {
            "review_text": "Would highly recommend this game if you havent got it already. Very fun! well worth the money :)",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is an adorable little game. You have a little base, you have a pet, and there's just so much stuff to do. Yeah, the dungeon gets repetitive after you see the same floor multiple times but it's still enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting game that should certainly help fulfill your Diablo fix before Diablo 3 is officially released. The graphics are a bit more cartoony, but the gameplay is just as great with a bit more simplicity but also some new additions Diablo should have had (i.e. have your dog take your sell haul back to town and bring back the gold!)",
            "review_score": "1"
        },
        {
            "review_text": "Waiting for Diablo 3? Wait no more, you will cetainly enjoy this title, same fun, adventure and best of all, its cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "Dungeon Crawler with nice graphics 10/10 would dungeon siege again.",
            "review_score": "1"
        },
        {
            "review_text": "Kind of like fate but less to do and less to buy ( the gambling guy only has crap prices)   Doesn't mean it ain't fun tho :D!",
            "review_score": "1"
        },
        {
            "review_text": "One of the finest Hack 'n' Slash RPG's to date and so it should be if you take a look at those working on it. Has a real character and if this came with Multiplayer like the 2nd installment will have then this would be my favourite Hack 'n' Slash of all time...of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Have you played this masterful send up to the click and attack rpg Diablo yet? Torchlight does more than stand on its own, a masterful game from Runic Games and one of the best I have played in a while. A great mod community and what seems like endless dungeons keeps this game on top of my replay list time and time again.",
            "review_score": "1"
        },
        {
            "review_text": "I admit it, I only got this because it was on sale and I already loved Torchlight 2. Even so, I heartily recommend it for anyone who loves games like FATE. Or horses. (I mean in the Mr. Ed sense, not in the sense of riding one: 'Gazing into the horse's eyes, you feel on the verge of understanding a deep mystery.') If you understand the difference between rogue, roguelike and roguelite then you probably already own this game, and if you don't, you will still enjoy it.   Simply put, this is an enjoyable dungeon crawler game with no downside. You pick one of 3 classes, akin to a tank, wizard, or ranger, and you go dungeon crawling to improve your gear and items so you can go deeper and deeper. That's it. Everything (grinding, levels, shared stash, socketed items, color-coded gear) here is fun and familiar if you've played any Blizzard game ever in the last 12 years.   Do try all three classes for each character, or at least as many as you like, until you find the one you like best. (Though if you do it like I did, with everyone at once, then you'll find inventory management to be a mini-game all its own.) You can adjust the difficutly setting and whether it's hardcore so you can tailor the game to be as hard or casual as you like. And if the price bothers you, wait for one of the ever-present Steam bundle sales and get it at half off!   I recommend this game. Every time I play it, I feel like I'm on the verge of understanding a deep mystery. About horses.",
            "review_score": "1"
        },
        {
            "review_text": "fun enough to warrant a purchase. a little repititive though",
            "review_score": "1"
        },
        {
            "review_text": "A solid Diablo like game, Diablo 3 creators are apparently ''borrowing'' design ideas from this game.  Has a hardcore difficulty also :D",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, a very immersive and very engaging game, solid graphics and sound, dungeons are also on point, so not much to complain about.  A lot of people compare this to diablo 3, I personally own both franchises, and they both bring their own strengths to the table, I think they are both top of the tree for dungeon crawlers.   Torchlight 2 is also very good.  Buy this or diablo 3 can’t go wrong. ",
            "review_score": "1"
        },
        {
            "review_text": "Torchlight is great. I recommend it to people who like RPG's or are starters to the genre as it's not over-complicated like a lot of games can get.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, whoever liked Diablo I or II will also like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Collecting armor and weapons and experimenting on character builds got me hooked. Can be repetitive if you don't explore the potential of your character but overall one of the best hack-n-slash games out there. Definitely worth buying and playing.",
            "review_score": "1"
        },
        {
            "review_text": "Get this one mens! It's like Diablo 2 set in Diablo 1, but with Diablo 3's pretty lights. PLUS, you get a pack mule right from the start, it fights for you, carries as much as you can, and you can ♥♥♥♥ it off to town by itself to sell all the junk you've picked up, and it comes back straight away. That in itself, means that you can pg this one hard without having to rip out a town portal scroll every two seconds.  The only downside - no co-op. Otherwise, it could have been one of the greats. Get one in ya!",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever played Diablo 1/2 or FATE, this game is probably going to be pretty fun. Especially if you ever wanted to combine the best features of both together, as it features developers from both series respectively. Veteran Diablo musician Matt Uelmen even scores this fantastic little game",
            "review_score": "1"
        },
        {
            "review_text": "Wanting to play Diablo 3 but hating how little time the game apaprently takes to beat, I turned to Torchlight to appease my dungeon crawling desire. Fortunatly this game did not let me down; It's well made, fun to play, full of loot, and long, making it a definite buy if you are a Diablo fan. In my opinion and the opinions of many of my friends, this actually is better than Diablo 3, just sayin.",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphics, interesting game play.",
            "review_score": "1"
        },
        {
            "review_text": "A real fun RPG. Not the same as Diablo, but in the same class. A lot of fun.... and mouse clicks.",
            "review_score": "1"
        },
        {
            "review_text": "Your dog/cat is a superhero",
            "review_score": "1"
        },
        {
            "review_text": "If you were a fan of Blizzards Diablo series, then Torchlight is a wonderful refresh into the Diablo world. Worth the little money you will spend for the countless hours of hack n slash goodness you will have.",
            "review_score": "1"
        },
        {
            "review_text": "Great hack n slash",
            "review_score": "1"
        },
        {
            "review_text": "Great little Diablo-esque game. A bit repetitive at times, but good fun, and runs well on most systems (even my crap laptop). 20hrs for the main story (if you can call it that), but supposedly there's a never-ending dungeon which you can play to your hearts content. I'm curious about the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "--&gt; Read Before Voting &lt;--  Grudgingly, I'm giving this game a thumbs up.  It's done everything I imagined it was trying to do, but it felt, SOOO empty to me.  Content was Extremely repetitive - - But it looked good.  Combat was So simplistic and So repetitive. - -I found three spells that worked together and the rest of the game was too easy. - -My brother actually made fun of me because I was TOO over powered!  I didn't fight through these dungeons, I walked through them at a slightly slower pace than I could have if there weren't mobs to slow me down.  Weapons and armor were lacking in variety and the levels of item (required to wear the equipment) Rarely correlated with stats. (Eg. lvl 40 necklace: +5 Dexterity)  Spells lacked in variety too. There are about 10-15 spells Total, and came in levels. There was little to distinguish one from the other.  - - Conclusion - -  This game kept me Mildly entertained, but I felt like I was grinding the Entire Time! Even bosses were boring.. I beat one without even realizing it was a floor boss!! I thought it was just a big tree.  I had a Lot more fun playing FATE.",
            "review_score": "1"
        },
        {
            "review_text": "diablo 2 singleplayer :3",
            "review_score": "1"
        },
        {
            "review_text": "Beware, this game may make you want diablo...",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game for hack'n'slash madness while waiting anxiously for D3 ^^",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic dungeon crawler!",
            "review_score": "1"
        },
        {
            "review_text": "An all around great game with tons of endless play or multiple replays. A Diablo clone that does everything right and better. The continual search for loot and just one more skill point will keep you engaged without ever being a grind. The only reason this game is not still on my machine is because the sequel has co-op multiplayer to bring a friend along. Playable on almost any machine, this is a solid game that looks fabulous for such low requirements, and is well worth the hours you will pour into it.",
            "review_score": "1"
        },
        {
            "review_text": "  Buy It!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "A modern Diablo 2, as similar as it could possibly be without breaking copyright law. But if you played Diablo 2, and loved it, you'll love this too.",
            "review_score": "1"
        },
        {
            "review_text": "Dark and mysterious. Guaranteed hours of fun. Lacking multiplayer though.",
            "review_score": "1"
        },
        {
            "review_text": "So many clicks",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "I played 18 hours straight in 2 days, it's that good.  It's like the early Dungeon Hunter 2 game for iPad before they ruined the series with 3,4,5. Diablo is simular too, It had an original Guantlet vibe to it. Ya, super fun game. I'm starting Torchlight 2 after writing this review. Get this game if you want a great dungeon crawler game, This one is the best I've played so far, I like it more than Diablo 3.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite Single-Player games of all time, an excellent example of an Dungeon-Crawling Action RPG! Controls as simple as they get, graphics that stand the test of time and audio to match. If you've ever played Diablo or Fate this is almost the same but slightly more refined. The story isn't something you'll remember once your done playing but isn't half bad.   Its pretty straight forward: buy it, try it then lose yourself in it for about 8 hours.  The sequel is even better with multiplayer, its almost Diablo 3 but not quite there.  I think ive been through it about 7 times, currently on my 8th Character and probably gonna run it until my computer dies.  8.9/10 - Just buy it, its excellent.",
            "review_score": "1"
        },
        {
            "review_text": "I blame myself. I just don't find this type of game to be that much fun anymore. i will say that Torchlight is one of the best and both it and its sequel offer far more entertainment than Diablo 3. Visually, this game looks great. It has a charming world and great music. The entry price for this and Torchlight 2 makes these games a great value for fans of this genre.",
            "review_score": "-1"
        },
        {
            "review_text": "Torchlight: a dull glow  I played Torchlight way back when it first came out, circa 2009. I enjoyed it, but there were some things that just nagged at me while I played it. Unfortunately, the more I played it, the less I liked it. Going further and further into the game did not increase my enjoyment. And I ultimately stopped playing.  Sadly that perfectly describes my most recent experience with Torchlight.  I’ve tried to figure out just what it is that I don’t like, but every time I formulate my thoughts I come up with the same conclusion:  The game feels hollow and generic.  It doesn’t seem to have it’s own identity or stand out as unique from other games in the ARPG genre. Hell, Torchlight is essentially an “HD remake” of Diablo from 1996… without the “Hell.” The game follows the same basic progression and is, in many ways the same game, but with less of an edge.  I feel that really hurts Torchlight.  Plenty of games can be fun without a cool in-game world or a “gritty” story hook to pull you in. It’s gameplay that matters in the end, right? Sadly I think that Torchlight also falls flat here as well.  Torchlight is pretty a pretty shallow game, to its detriment. Killing monsters is fun in its own right, but only for so long. Other ARPGs alleviate this by giving you things to work for: new more powerful items, more powerful skills, harder challenges, etc. Torchlight does have all of these things… they’re just not interesting. So although the game does have the “carrot on a stick” incentive to continue playing… I’m, sadly, not interested in the carrot.  I found the gameplay to be rather lackluster and boring. Torchlight’s art style does not appeal to me. The environments lacked feeling, and ultimately felt sterile. The items in the game were shallow, and only the “unique” items had any flavor. The various character skills weren’t very impressive, and didn’t feel very powerful.  But let’s break down the individual pieces of Torchlight and critique it against the five points I mentioned previously.  Atmosphere and Story  Atmosphere  the pervading tone or mood of a place, situation, or work of art.  Torchlight has little to no atmosphere. Certain areas in the game look pretty darn cool, but carry absolutely no feeling.  My favorite areas are a necropolis found underneath the mines beneath Torchlight (Yes, that’s the name of the town) and the underground jungle-temple ruins beneath the necropolis. Why I like these two areas over all the others? Probably because they have the most ‘flavor’. But even then it’s spread pretty thin.  There isn’t much to be said about the game’s various locales other than that they don’t make much sense and require a bit too much suspension of disbelief for my taste.  Story an account of imaginary or real people and events told for entertainment.  I consider story to be tied very closely with atmosphere, and like Torchlight’s atmosphere, there isn’t really much to be said about the story. It’s pretty generic and could be summarized in two sentences: “Torchlight was built over a corrupted source of magic caused by an ancient evil deep within the Earth. Go kill it.”  More accurately: The town of Torchlight is mining a substance called Ember, which allows for the various forms of magic in the world, but it turns out the Ember under Torchlight is corrupt and will turn anyone who comes into contact with it evil! This is because the Ember Vein runs over an ancient evil, later revealed to be a dragon. You are called to Torchlight to help the mining operation, which is being attacked by monsters, but are promptly betrayed by the man who summoned you. As it turns out he wants to revive the dragon sleeping beneath Torchlight. And you, the hero, have to stop him by traveling deeper and deeper into the Earth uncovering older and older civilizations that fell to the corrupting allure of the Ember.  Pretty good ideas! Not going to lie, there’s definitely a cool story in there. But it’s really only used as an occasional spur to remind you to continue murdering monsters as you travel what seems like miles into the earth. A shame, really.  There is very little involvement in the story, and to be honest the voice acting is pretty hammy. If you like that sort of thing, then good on ya! I had to skip most of it.  But hey, atleast you can skip it! Actually all of it! Which is nice.  Enemies the persons who are actively opposed or hostile to someone or something.  Unfortunately, the enemies in torchlight are boring. There isn’t any way around it. I don’t like their designs, and none of them really seem to have any interesting mechanics to differentiate them. They’re all just bigger and bigger punching bags. Some will revive their comrades, and some will leave noxious fumes after death. But by and large, the majority of them are meat sacks that fling their bodies against your weapons.  It doesn’t help that the enemies have massive spikes in difficulty towards the end of the game. There is a LARGE increase in enemy health and damage in the last area. And every time I’ve played, it has come as a shock.  I’ll be doing just fine, then I’ll walk into the last section of the game and be murdered. Only to find that I’m unable to deal significant damage to the enemies. Their scaling seems to be off, and it’s just not fun.  Your Character  the representation or expression of something in a tangible or visible form.  Torchlight utilizes the typical stat system. Your RPG standards are all present: Strength, Dexterity, Magic, Life, and Defense. Every time you level, the game gives you five points to allocate to each of these different parameters. Unfortunately it seems like the various stat points are really just a way of directing your progression. It didn’t seem as though loading a bunch of points into Magic made my Alchemist’s magic any more powerful, despite it being his main damage stat. It seemed as though it was just a holdover from previous games. “Diablo had them, so Torchlight will too.”  Really the stats just felt like numbers I had to inflate in order to put on different armor. My character’s power seemed to be located in the weapons and armor he was wearing rather than the character himself.  Skills  skill or expertise in a particular activity or field  Torchlight also follows a rather traditional skill tree format, present in almost every ARPG. Ever. That’s perfectly fine. Skill trees are used so commonly because they work. Sadly, the skills in Torchlight are boring. Plain and simple. The coolest spells I got for my Alchemist were Chain Lightning and a laser. Everything else rather boring.  I think that is was a major contributing factor to why Torchlight felt boring to me. The three different classes all had pretty boring skills. Nothing really stands out, and everything felt pretty lame.  Itemization  the balance and distribution of items, their types, and the various effects, powers, and statistics attached to them  Last but not least, the items. Again, there isn’t a lot to say. Torchlight’s items were rather lacking. Most items are of the, “+10 fire damage,” “+20 lightning damage,” “+5% attack speed” variety. Nothing to write home about.  This is probably the one aspect of the game where Torchlight tried its hardest to please me.  I received about 7 unique items before reaching level 15. Unique items are Torchlight’s highest rarity item, apparently. They were all decent, and some of the unique wands I found had cool effects that altered combat, like shots bouncing and releasing arcs of electricity on the ground. But they were little more than more powerful versions of the base items. Not particularly exciting.  Boring skills, boring monsters, boring items, boring combat.  Very sad indeed.",
            "review_score": "-1"
        },
        {
            "review_text": "How Can I Refund This Game? Its Bad I Dont Want It",
            "review_score": "-1"
        },
        {
            "review_text": "I'm in the minority here. I didn't find Torchlight to be that great. I don't like Diablows-esque click click clickty click games.",
            "review_score": "-1"
        },
        {
            "review_text": " PROS  + Moments when the game feels like a great ARPG. + Lots of loot. + Some great ideas, especially with the pets...   CONS  - ...which turn tedious after a while. - Feels unbalanced at times. - Somewhat repetitive levels. - Fairly meaningless equipment customization. - A somewhat uninteresting story. - Utterly boring boss fights. - An unsatisfying ending.  While the game does have its moments, the overall experience isn't something that I'd really recommend to anyone but the most hardcore of ARPG fans that are dying for something to play.",
            "review_score": "-1"
        },
        {
            "review_text": "No story, incredibly boring and repetitive environments. In general, a dull and pointless exercise which will do nothing to interest players who are not already fans of this type of game. Van Helsing is infintely better and more entertaining!",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get the appeal of this game at all. It's a dungeon crawler with random loot generation ala Borderlands. Very little story or character development, which is fine if the combat mechanics are there. Unfortunately, they're not. This is a left-click-fest of the worst kind.",
            "review_score": "-1"
        },
        {
            "review_text": "Really monotonous from start to finish, the story was incredibly boring and so was the combat. The game is literally just running through a 30 floor dungeon while killing everything with one (mouse) button. Has none of the charm that the games in the genre usually have, upgrading gear isn't at all satisfying and doesn't change the game at all from start to finish. There are more spells, but there's really no point when you can just click fireball through the whole game and kill everything and drink a potion once in a while. Mainly played through to find out why everyone praises the game and it was nothing to write home about. Only way I got through it was by watching Family Guy on secondary screen while playing.",
            "review_score": "-1"
        },
        {
            "review_text": "If you play on Mac, and character dies, do not quit with CMD+Q, this corrupts save and you'll have to start all over.  This is a known bug for 4+ years, so I don't think they ever going to fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "Eh. Single-player diablo clone. Mindless, tedious, and repetitive. Can't say I recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "IT'S NOT ♥♥♥♥ING MULTIPLAYER",
            "review_score": "-1"
        },
        {
            "review_text": "If ever there was a game that was overrated it would probably be the first Torchlight.  People would say things like 'If you liked Diablo then there is nothing to dislike about Torchlight' while completely ignoring that even the first Diablo had multiplayer and Torchlight does not.  Torchlight has another problem where moreso then most games I've played with RNG loot like this, I seem to always be using gear that is at least 10 levels below my level because everything that drops is worse then what I already have. At about the halfway point in the story I had to rely on purchasing items from the Weaponsmith whenever something decent would show up, because all the loot seems to suck.  At the end of the day, if you want to play a game like this you're probably better off getting the sequel or looking elsewhere entirely.",
            "review_score": "-1"
        },
        {
            "review_text": "2/10   Cheap Fate wannabe knock off.",
            "review_score": "-1"
        },
        {
            "review_text": "huge casualized fail aids. if you want to play a game of the esteemed 'loot equipping' genre, then you should pick any other game",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like Torchlight because i really enjoyed Diablo 2, but found the lack of seriousness distracting  You cant deny it is good at what it does and is priced cheap, but it felt empty the deeper i went..   2/5  Try Torchlight 2 though if you was 'okay' or better.",
            "review_score": "-1"
        },
        {
            "review_text": "Definitely aiming to be a Diablo-clone. That kind of thing was okay back in the day (y'know, when Diablo did it), but now it just comes off as way too repetitive. The introduction of new weapons and skills didn't come nearly often enough to keep me excited.",
            "review_score": "-1"
        },
        {
            "review_text": "I did prefer over 2, because of simplicity, but the game overwrites extant files with dupes or even deleted characters which means your toon, and all asssociated, is randomly deleted. Perhaps this is a windows thing, I don't know. What I do know is a game where it can just 'randomly' end, and OOP, is a game that effectively sux, even if th3e game itself is good. The game itself is great, but If i wanted to play 'Wheel of misfortune', I would play that by, well, existing.",
            "review_score": "-1"
        }
    ]
}