{
    "app_id": 415350,
    "name": "Shooting Stars!",
    "release_date": "2016-01-19",
    "developer": [
        "Bloodirony"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Shoot 'Em Up"
    ],
    "achievements": 31,
    "positive_ratings": 500,
    "negative_ratings": 57,
    "price": 3.99,
    "description": "This game is the answer to one of the most important questions in life: “I can haz lazer kitty?“ Yes you can!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/415350/header.jpg?t=1524046759",
    "minimum_requirements": "OS: Windows Vista SP2 Processor: 2 GHz Dual Core CPU Memory: 4 GB RAM Graphics: NVIDIA GeForce 8600 GS, AMD Radeon HD 4290 or newer Storage: 120 MB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "recommended_requirements": "OS: Windows 7, 8, 10 Processor: Multi Core Processor with 2,5 GHz or more Memory: 6 GB RAM Graphics: NVIDIA GeForce 8600 GT, AMD Radeon HD 4550 or newer Storage: 120 MB available space Sound Card: DirectX 9.0c Compatible Sound Card with Latest Drivers",
    "reviews": [
        {
            "review_text": "Take a laser-cat (what else) and shoot your way through different most popular character´s - more or less well known.  A retro shoot’em up indie gem as it´s best made in Austria. Vienna calling :)  Love it!",
            "review_score": "1"
        },
        {
            "review_text": "one of the coolest shoot 'em up games i have ever played   it got good music, good sense of humor, reasonable difficulty, chuck norris and a LASER CAT!!!  i highly recommened this game if u are a fan of shoot 'em ups and celebrities mock ups.  ",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly good fun for a standard vertical shooter. The humour element, graphics and sound are all top notch.",
            "review_score": "1"
        },
        {
            "review_text": "Great, colorful, funny game to play in between. It reminds me on the 'good old times' games.  Also the sound is superb. I could hear this for hours. Love it. ",
            "review_score": "1"
        },
        {
            "review_text": "Feels like playing Space Invaders and Galaga but offers 3 different ways to control your character; KB, mouse and controller. Game is repetitive and becomes old quickly. Needs different and better backgrounds and enemy variety in general but particularly the boses, as it stands it should be .99 cents and for the smartphone market and not PC. I am hoping the developer comes back and improves this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A really fun and funny sh'mup that works with the PS3 controller on OS X.",
            "review_score": "1"
        },
        {
            "review_text": "If you are on a weak computer and need a time killer this is your game! 420 lazers out of 10",
            "review_score": "1"
        }
    ]
}