{
    "app_id": 415670,
    "name": "Highrise Heroes: Word Challenge",
    "release_date": "2016-01-08",
    "developer": [
        "Fallen Tree Games Ltd"
    ],
    "publisher": [
        "Fallen Tree Games Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Adventure",
        "Indie"
    ],
    "achievements": 36,
    "positive_ratings": 65,
    "negative_ratings": 5,
    "price": 3.99,
    "description": "A towering word-game and mystery-story mash-up!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/415670/header.jpg?t=1460748040",
    "minimum_requirements": "OS: Windows Vista/7/8/10 Processor: 1.66 GHz or faster 32-bit (x86) or 64-bit (x64) processor Memory: 1 GB RAM Graphics: OpenGL 3.2 or higher Storage: 100 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "NOTE: If the game won't start, try turning of DeepGuard (assuming that you have that as part of your antivirus program, of course.)  The first thing you see upon entering the game is Story Mode and Chimp Challenges. Once you choose one, you'll be able to access Settings. Options are separate mute buttons for music and sounds, plus Windowed mode or full-screen.  Gameplay consists of chaining together letters to form words, usually with the goal of dropping everyone to the bottom of the screen to 'save' them. When you include the characters from the story in a chain, it will give you access to letters you otherwise wouldn't be able to get to, but there's more to it than that. Characters will soon run out of air if you don't use them in a word with an air (blue) tile, there are battery cells that have to be used within a certain number of turns, or they'll explode and everyone will die from toxic gas. There can be fires to put out, debris to clear, and/or glass to break before you can move on, and you only have a certain number of turns to save everyone!  Each character has an ability that will help you out of a tight spot, ranging from instantly breaking a tile that would otherwise take 3 turns to destroy, to swapping letters on the screen, to showing you the longest-possible word on the screen. SUPER-helpful... but use these abilities wisely, as each time you use them, you'll lose a certain number of turns!  Making 5+ letter words will give you a small red bomb, which takes out all of the tiles touching it (8 tiles), and making a 7+ letter word gives you a large gold bomb, which will take out an additional row of tiles surrounding it (24 tiles).  The early levels will give you hints if you stall for too long, but no worries... That doesn't continue once you progress in the game, and neither does the super-easy-to-pass nature of the levels. Every word you make gets you points, and of course longer words give you more points. Chaining together multiple characters in a word will net you some bonus points, and there are also some tiles that include multipliers. If you're an achievement-hunter like me, simply passing a level isn't good enough, as you're going to want to get the most points possible in order to get three stars, and if you're competitive, there are leaderboards for each level, too!  All levels have a hidden timer for the purpose of stats, but there are a good 10 levels (that's a guess) that have a visible timer, and which you have to complete within 2 minutes or less... and a few of those levels have number tiles instead of letters, with challenges such as 'Link tlles to add up to 40.' GAH!  Every level has a goal that must be met before you can move on, and 64 of the levels include an additional challenge in the form of 'banana' challenges. An example of a banana challenge would be, 'Make a 6+ letter vowel-heavy word.'  There are: - 36 achievements - If you're having trouble with the Codebreaker achievement, you'll find the secret on   level 25    - 111 story-driven levels - 64 'banana' challenges - 12 chimp challenges  The story was surprisingly interesting for the most part, and although I had figured out an important point pretty early on in the game, there were some surprises thrown in, and I found myself rushing through the latter levels just to see how it would end... And there came another surprise! There are  two  possible endings! :O NICE!  Overall I found Highrise Heroes to be a delightful word game, with an engaging story and nice bonuses. I love the achievements and extra challenges to complete, and the difficulty level -- once you get past the early stages -- was enough to make me re-play over and over again to get my three stars, but (with the exception of the number levels) not enough to make me want to pull out my hair.  Definitely recommended to lovers of word games, the competitive, and those who love achievements (eventually, I'll have them ALL! I WILL defeat those number levels!) Muwahaha! XD",
            "review_score": "1"
        },
        {
            "review_text": "So far I've spent an equal time enjoying the storyline and three starring the levels. So much so I've only just finished chapter 2 out of five total. It's highly enjoyable, the gameplay is interesting and many of the levels will ask for different requirements such as having a timer or having to complete a level within x number of turns.   Overall deeply satisfying and at a really nice price.  10/10 Would do the same level over and over for a flag covered banana again.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic boggle-style game. Great story and the challenges are varied enough to keep you on your toes. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the better word games I've enjoyed on Steam. Different challenges. and even a rather captivating story mode as well. I got this for some casual play, but as time goes on I find I play this more than some of my recent game faves. Highly recommend!!",
            "review_score": "1"
        },
        {
            "review_text": "All around well done. Love the entertaining/funny writing and story that keeps you going.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Highrise Heroes in the steam sale after enjoying another word game called Letter Quest: Grimm's Journey and while I still prefer Letter Quest this game makes a considerable effort to give variety. There are more than just your basic find words challenges, timed challenges and even a few number challenges (which I loved!). The story while not amazing is certainly quite humorous in places and I was eager to progress to see the next part mainly for the humour.  As a few reviewers have commented on, this game really does start to crank up the difficulty very fast, even when working together with my partner we struggled with some levels for nearly 40 minutes, Some of the later ideas and how to's aren't greatly explained either which led me to take a break from it.  Overall if you liked boggle or word games im general I can recommend this title. I certainly hope there are more like it sooner rather than later.",
            "review_score": "1"
        }
    ]
}