{
    "app_id": 416290,
    "name": "Bleeding Border",
    "release_date": "2015-11-09",
    "developer": [
        "Curse Box Studios"
    ],
    "publisher": [
        "Curse Box Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Horror"
    ],
    "achievements": 6,
    "positive_ratings": 22,
    "negative_ratings": 26,
    "price": 3.99,
    "description": "Bleeding Border is a first person 3d survival horror game in which the player must escape through the top of a monster infested building using his own blood as the only defense mechanism.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/416290/header.jpg?t=1514590332",
    "minimum_requirements": "OS: Windows 7 or + Processor: Intel Celeron 2.16 GHz Memory: 4 GB RAM DirectX: Version 11 Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7 or + Processor: Intel i5 Memory: 8 GB RAM DirectX: Version 11 Storage: 2 GB available space",
    "reviews": [
        {
            "review_text": "Do you want a game where you climb up some building floor by floor by grabbing keys to open doors trying to escape some weird fish squid monsters while you bleed out and your only defense is the spraying blood of your open wound? Neither did I.  It took just over 30 minutes to complete after getting stuck in walls and objects multiple times and having to slowly kill myself by stabbing my arm with a screwdriver repeatedly. Very boring. The only positive I can give this game is the opening intro.  Terrible game. Glad I got it from an old Greenlight bundle. This isn't even worth the current discount price of £4.19, £0.19 sounds about right.",
            "review_score": "-1"
        },
        {
            "review_text": "Let's get the bad out of the way, first: The game's in the running for the absolute ugliest I've ever seen. It's blatantly unfinished, with two out of three game modes to be added later. There's a few nasty glitches, though no longer anything game breaking.  I still have to recommend this as one of the best horror games I've played. Beyond just having some legitimately creepy monster designs, it just has an incredibly effective central mechanic that ratchets up the tension. You're in an abandoned building, filled with monsters. The good news is that you have a 100% effective weapon against them. The bad news is that it's your blood -- every time you try to kill an enemy, you inflict a bleeding wound on yourself and need bandages or you'll eventually bleed out and die. The game becomes an exercise in avoiding combat where possible, and where forced to, it frequently becomes a tense race for the next medkit before you become too far gone and either collapse or get easily picked off by one of the monsters. I've rarely played a game that left me with as much dread and fear as this one did.",
            "review_score": "1"
        },
        {
            "review_text": "Old school survival horror game. You stab yourself so you can bleed over some monsters. Sick and challenging",
            "review_score": "1"
        }
    ]
}