{
    "app_id": 416370,
    "name": "Showing Tonight: Mindhunters Incident",
    "release_date": "2015-11-12",
    "developer": [
        "phime studio LLC"
    ],
    "publisher": [
        "phime studio LLC"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Stats"
    ],
    "genres": [
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Adventure",
        "Hidden Object"
    ],
    "achievements": 13,
    "positive_ratings": 44,
    "negative_ratings": 34,
    "price": 3.99,
    "description": "Use your detective skills to solve the mystery of the missing film crew and finish the movie.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/416370/header.jpg?t=1448014127",
    "minimum_requirements": "OS: Windows XP, 7, 8.1, 10 Processor: 2GHz Memory: 2 GB RAM Graphics: DirectX 9 GPU DirectX: Version 9.0c Storage: 1 GB available space",
    "recommended_requirements": "OS: Windows 7, 8.1, 10 Processor: 3GHz Memory: 2 GB RAM Graphics: DirectX 9 GPU DirectX: Version 9.0c Storage: 1 GB available space",
    "reviews": [
        {
            "review_text": "The game is quite a ride so far, and it doesn't reveal all at once. At the beginning you are not sure what you are doing, but it turns out it fits the very premise of the story. The music is atmospheric, not intrusive, and it blends nicely. The puzzles are interesting, and not so typical for this genre. Overall, very interesting game, and I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "We'll let's start off on the positives... I did like the 'shadow' puzzles and some of the variety of puzzles in this one. Not many hidden object puzzles but the ones in the game were good. Now.... I like fairly short hidden object/puzzle games with a nice story and interesting graphics to carry the story along. Sadly, this story had great potential i think, but really never gets told. Nothing to carry me along to the next area or to get 'excited' about. I ended up getting bored after a few hours and ultimately just quit; certainly not hard, but there are so many other games of this style that keep me better engaged. (off to play Nightmares from the Deep III...as an example). Sorry for the thumbs down but....",
            "review_score": "-1"
        }
    ]
}