{
    "app_id": 416380,
    "name": "The Hurricane of the Varstray -Collateral hazard-",
    "release_date": "2015-12-21",
    "developer": [
        "Studio SiestA"
    ],
    "publisher": [
        "Rocket-Engine Co.,Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Bullet Hell",
        "Indie",
        "Shoot 'Em Up"
    ],
    "achievements": 108,
    "positive_ratings": 85,
    "negative_ratings": 26,
    "price": 6.99,
    "description": "【About &quot;The Hurricane of the Varstray&quot;】&quot;The Hurricane of the Varstray&quot; is a vertically scrolling shoot'em up with a SF story: in the distant future, to defend the Earth against the invasion of mystery mechanical structures, 4 girls head to &quot;the Varstray sector,&quot; far away from the Earth and considered as the v",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/416380/header.jpg?t=1493825896",
    "minimum_requirements": "OS: Windows 7/8/8.1 Processor: Intel Core i3 or Higher Memory: 2 GB RAM Graphics: Support to DirectX11 Graphics DirectX: Version 11 Storage: 1 GB available space Sound Card: Support to DirectSound Soundcard Additional Notes: DirectX End-User Runtime *About a controller besides I recommend a controller for X-input. About the controller except X-input, I cannot guarantee normal movement.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'tis pretty good and fun to play.  The gameplay trailer and the official website up there will shows you everything you need to know.  One thing to warn you about, though : there's no 'slow' button. The game is build around it : the idea is to dodge the whole clusters of bullets and cancelling them, not grazing through them, plus at power max you have a shield to take one hit and get invulnerabilty for two or three seconds - but it can be pretty wierd for some poeple.",
            "review_score": "1"
        },
        {
            "review_text": "On the one hand....good music! Space lesbians! (kinda maybe?) A story! Mostly fun gameplay/mechanics!  On the other hand...you can't slow down your ship like in Cave shmups and etc., the translation is kinda wonky, and, well....  So the game has this mechanic where you build up a bar by shooting enemies and when the bar is full you can shoot screen-clearing beams that turn enemy shots into medals. The game is kinda built around this! The problem is that when I say 'the game is built around this' i mean 'i hope you like the screen near-constantly being saturated with bullets in the later levels with no rhyme or reason!' Even with a little wiggle room ('cos you have a shield) I went through like three continues in the last two levels alone. :v  That said, it's still pretty neat, just.....y'know, maybe get it on sale if that last part sounds overwhelming.",
            "review_score": "1"
        },
        {
            "review_text": "I actually had a ridiculously succesful first run. That's the problem, bullet hells are supposed to be difficult and present multiple challenges throughout the various stages. The music was annoying, the voice acting was the worst offence by a wide margin as there is more super high pitched whiny japanese voice acting than there is gameplay. As far as actual gameplay goes, the stages were far too short for any meaningful gameplay to even present itself, and the difficulty curve basically adds more random bullet sprays behind poorly designed patterns forcing you to use 'bombs' repeatedly or just die to a wall of death with no hope of getting through without. This game is bad for the $3.47 that I paid and just outrageous at $16.",
            "review_score": "-1"
        }
    ]
}