{
    "app_id": 416680,
    "name": "Zombie Night Terror",
    "release_date": "2016-07-20",
    "developer": [
        "NoClip"
    ],
    "publisher": [
        "Good Shepherd Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Zombies",
        "Strategy",
        "Indie"
    ],
    "achievements": 34,
    "positive_ratings": 1140,
    "negative_ratings": 86,
    "price": 9.99,
    "description": "Prepare yourself for the most thrilling night of your life! Something strange has happened and people everywhere are turning into blood thirsty walking corpses. But guess who’s the brains behind this hungry undead army? YOU! So spread this pandemic and wipe humanity off the planet.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/416680/header.jpg?t=1540277282",
    "minimum_requirements": "OS: Windows Vista or Later Processor: Intel Core 2 Duo or faster Memory: 2 GB RAM Graphics: AMD Radeon HD 5750/Nvidia GT 450  or higher DirectX: Version 9.0 Storage: 1500 MB available space",
    "recommended_requirements": "OS: Windows 7 or Later Processor: Intel Core i3 or faster Memory: 4 GB RAM Graphics: AMD Radeon HD 6850/Nvidia GTX 460 or higher DirectX: Version 11 Storage: 1500 MB available space",
    "reviews": [
        {
            "review_text": "One of the best games I have played this year. Think of it as 'Undead Lemmings', with a great sense of humour and whose pixel graphics I feel enhance its appeal. Easy to pick up and play, whether for 10 minutes or several hours, this game is far more fun that most of the titles out there currently and well worth the price. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "- Lemmings, erm I mean zombies. - Cool 8-bit graphics and animations. - Nice ambient and funny story - Hard game, not for crybabies (most negative reviews main point is the difficulty)",
            "review_score": "1"
        },
        {
            "review_text": "Lemmings with zombies Zombie lemons! \\(^o^)/  The puzzles are easy to get through, so don't worry about getting stuck for too long The only difficulty is in acheiving full comppletion.  The cutscenes have a great 'B-movie' feel to them which is also fun",
            "review_score": "1"
        },
        {
            "review_text": "Basically Lemmings, but with zombies instead. Should be call Lembies or Zombings. Enjoyed each level, easy controls, with a pause options to think about what you going to do next.",
            "review_score": "1"
        },
        {
            "review_text": "I like lemmings. I like zombies. I like this game.  The game is easy to have fun with. Figuring out the timing to swarm various armed humans is satisfying. The challenge goals made repylaying the level interesting. The game played smooth with no crashes for the few levels I've played so far.   Overall it is the perfect game for a quick 15 or 20 minutes session to beat a level or two.",
            "review_score": "1"
        },
        {
            "review_text": "Lemmings but with zombies. Physics Puzzler where you give zombies special abilities to complete levels, and devour humans in an apocalyptic end of world scenario with a light-hearted b-movie feel.   Lots of levels. Good graphics. Worth the price per hour of entertainment, even though the game isn't too hard.",
            "review_score": "1"
        },
        {
            "review_text": "Reimagining of an old The Lemmings game, this time with zombies, who are as mindless and braindead as suicidal characters from the 90th classic. Stylish and humorous.",
            "review_score": "1"
        },
        {
            "review_text": "If you ever played Lemmings and thought that what was missing was murder and communicable disease then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Loads of brainy fun. Not only for the smart puzzles that mix up your goals and rules in inventive ways for every game, but as an homage to classic movies that reference Terminator, A Space Oddysey, Resident Evil, Mad Max and off course, the classic Night of the Dead series just to name a few.   I'm not going to assume that everyone knows the Classic puzzle game Lemmings? In Zombie Night Terror, you lead a group of zombies across a 2-D cut out of different environments. Problem is, your zombies are pretty much... brain dead. Without your help, they'll marsh single mindidly in one direction until they fall to their deaths, drown, electrocute themselves, or get shot to pieces by a human populace that is consistently potraited as vain, addled, self-absorbed and idiotic. In other words, the kind of people that deserve a good zombie mauling. It's up to you te issue them the series of mutations, directions and aid to surmount it all. Need to keep them from drowning themselves? Turn a zombie into an overlord that draws them to safety. Need to break through a wall? Blow up a zombie. Need to sneak by an armed guard or climb a wall? Give your zombies claws and the ability to kill silently.   And let me just emphasize how clever and varied the levels and puzzles are. In some levels, you go no holds barred total zombie apocalypse with hundreds of the critters, out in the street and overwhelming everything in your path. In some, you have just a single zombie that needs to stealthily sneak through an entire hospital or government complex on his own, creeping into the blind spots of armed guards. Sometimes you team up with other cult classic characters to overcome humanity, sometimes you even need to TEAM UP with humanity to save yourself and lay off the brains. Sometimes, your zombies don't even matter and you just need to survive.   No single level is the same, the game stays fresh and interesting throughout, and the game will never bore or lose its shine if you're into puzzle games with a fondness of cult movies.",
            "review_score": "1"
        },
        {
            "review_text": "  It's like Stubbs the Zombie but with better graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes frustating because you can't save during a level, only inbetween, but overall it's an excellent, and quite difficult, real time tactical Lemmings game. The arts and sounds are awesome, and it has a fresly rotten touch of humor.",
            "review_score": "1"
        },
        {
            "review_text": "A well-done puzzle game in the tradition of Lemmings, done in the style of Left 4 Dead. Interesting and engaging levels with a kick-♥♥♥ pixel art-style and 70s horror flick aesthetic. Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "  I absolutely loved Zombie Night Terror. The concept of being able to control zombies in the zombie apocalypse rather than the survivors was very fun. Each level is harder than then the next and you really have to rack your brain to try and figure out how to solve each level. The challenges in each level add replayability to it as well.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Can you put a difficulty level on this thing. I don't know how many freaking hours I need to play fast and ravenous, before I get tired of it. I don't mind various ways to finish a mission, but thats not the case here. On certain levels so far.. you only do it one way or you can't finish the mission.",
            "review_score": "1"
        },
        {
            "review_text": "Think lemmings, but with zombies. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "the game is fun untill the levels get way to confusing to be fum it just gets frustrating",
            "review_score": "-1"
        },
        {
            "review_text": "Really enjoyable casuaul game. Reminds me of Lemmings. Lots of laughs and fun when you turn humans into zombies using chemical injections, zombie bites, zombie infused bombs and moe. I've played a few levels so far and can't wait to play more!  Would love to see a sequel to this or more games similar to this :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great.",
            "review_score": "1"
        },
        {
            "review_text": "  Cool game crazy and exciting i like the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "You get what you see, it's a fun little game.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, great gameplay, available on linux too! 100% original 100% recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Im getting started but i love it. Its godly, great idea, even better artstyle, and a cherry on the cake.... A good ai system! ",
            "review_score": "1"
        },
        {
            "review_text": "One of the better ones, digging the music and the polished art. Fun casual dad game.",
            "review_score": "1"
        },
        {
            "review_text": "Well hello there little boy, don't be shy, Step right up, I'm a reasonable guy! Don't be frightened by the look in my eye, I'm just you average Zombie Overlord up in the sky!",
            "review_score": "1"
        },
        {
            "review_text": "Overview: a classical game 'Lemmings' (and some gerne from other classics) have been converted into a new zombie world. Worth trying.  Game system: a plain zombie just keep walking in one direction until they go into walls, doors, or humans. You have to control those brainless walkers with environments and special zombies with some abilities, which you can order them to evolve with some costs.  Cons: Though this game is fun and playable enough, there are some improvements required. 1) Its GUI is too simple and small with a mouse and a keyboard, and descriptions are too short for players to understand the rules of the game. 2) There seems to be an error that timers goes on when you pause the game, in stages with Time Attack Challenges. This can be the specification, and if this is true, there can be some description on it. 3) There seems to be only one right solution to beat Challenges. More alternative solutions can make the game more enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "memorable missions funny cutscenes nice animation and sound design  all grunt zombies look the same. its hard to identify enemies with guns sometimes",
            "review_score": "1"
        }
    ]
}