{
    "app_id": 416790,
    "name": "The Metronomicon: Slay The Dance Floor",
    "release_date": "2016-09-29",
    "developer": [
        "Puuba"
    ],
    "publisher": [
        "Akupara Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Local Multi-Player",
        "Co-op",
        "Local Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "RPG",
        "Rhythm"
    ],
    "achievements": 32,
    "positive_ratings": 224,
    "negative_ratings": 25,
    "price": 14.99,
    "description": "Rhythm Role Play Game; fight the weirdest monsters with the power of music! Level your party and upgrade your gear while dancing to the beat of some SICK tunes...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/416790/header.jpg?t=1555440323",
    "minimum_requirements": "OS: Windows 7, 8.1, 10 Processor: Intel Core i3 or equivalent Memory: 2 GB RAM Graphics: 1GB, OpenGL 1.5+ Storage: 2500 MB available space Sound Card: One that allows sound to come out of a sound maker",
    "recommended_requirements": "Additional Notes: You can use the following controllers for this game; M/K, Xbox 360 Controller, Xbox One Controller, PS3/PS4 controllers, PS3/4 Rock Band Guitars, XB Rock Band Guitars, our Custom &quot;The Metronomicon&quot; Dance Pad, plus the majority of USB Dance Pads (sadly we haven't tested them all so there is no guarantee on these)",
    "reviews": [
        {
            "review_text": "Really enjoying this game. Great music selection and it can get incredibly challenging. If you have a controller, use it. Keyboard isn't as responsive. It also has an option to sync your monitor/audio response time. The only downside to the game is that I can't apprecate the really cool creatures because my eyes are glued to the note-bars. Well worth the low price!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing soundtrack with a difficult yet fun and addivtive mechanic. If you think you might enjoy this then you definitely will.",
            "review_score": "1"
        },
        {
            "review_text": "Game is fantastic! RPG game that requires strategy. What I like is that there is a lot of freedom in the way you build your team. You can put the moves in different slots of your character, as well as choose which moves to use. Also, the items allow you to make different builds as well. The characters represent healers, tanks, physical attackers, magic attackers, rogues, etc., that you would see in other RPGs. I would definitely recommend this to others. The game is challenging at first on easy but you improve quickly. Hard provides a great challenge for the more hardcore gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent challenging rhythym game with additional depth through rpg mechanics.  strengths and weaknesses: +Genre combination done well. Important to use correct abilities + gear in the match. +characters always dancing!  -Damage numbers located far from rhythym arrows. Very hard to watch both. Consequently, buffs, debuffs, weaknesses less noticeable. -I only like 33% of the music.",
            "review_score": "1"
        },
        {
            "review_text": " Are you looking for a Rhythm game with more depth, one that isn't just committing the tracks to muscle memory? Are you an RPG fan looking for something completely different? Do you wish to do battle with a Giant Tentacle Monster with glow-in-the-dark body paint?",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually write reviews, but I absolutely had to for this gem. It's a perfect blend of addictive RPG elements and the exact style of rhythm games that I like. This is also subjective but so far there also hasn't been a single bad song, and really in a rhythm game what could be more important than that? It's like this game was designed specifically for me and it's amazing.  Anyone with even a passing interest in The Metronomicon owes it to themselves to at least try it out",
            "review_score": "1"
        },
        {
            "review_text": "At times fiendishly difficult while being incredibly rewarding. For the first time ever, I wish the tutorial section was a little longer, but once you figure things out the game play and game itself is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "You find yourself in the middle of an episode of Rick &amp; Morty. A giant head crashes to the Earth and says, 'Show me what you got!' Everybody panics...there's complete pandimonium. What do you do? WHAT DO YOU DO? ...you play Metronomicon to save the world, that's what!",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to your fate. End of the line.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty addictive once you get used to the mechanics (the tracklist helps a lot). As some other reviews have stated, it's recommended to use a controller with this game. It's still totally playable with just a keyboard though.",
            "review_score": "1"
        },
        {
            "review_text": "If you played Sequence/Before the Echoe, this is just like it, but with MUCH deeper gameplay. (Which isn't bad for Sequence)  Edited because the original review was all over the place  Good The soundtrack Art Direction Gameplay is incredibly solid and very well refined Plenty of 'Challenge Songs' IE: Survive a song without healing, defeat a super tough enemy that regens HP, etc  Bad On unlocking the second area, it was rather confusing as to why I couldn't go to any other spots in the main hub. When you unlock Area 2, and the areas after, you need to hit B to get access to the shop, arena and music room. The writing isn't great. But it's a narrative driven Music game, so I would imagine they worked on the mechanics and music first then worked on the story. And the final negative, and this may just be because of my familiarity with music games, but I found it far to easy even on hard mode. I averaged the top 5 in the leaderboards as of writing this review and your build has nothing to do with your score.  It's easily an 8/10 and one of the best music games I've played since Amplitude 2016 and DJ Max Fever before that.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't really been one for rythm games but this one caught my eye and is really fun and awesome to play. The characters are fun, the enemy designs look great, the backgrounds are well detailed, the game offers a challenging and fun experience, the animations looks wonderful and goes along with the beat of the songs, has good humor, and of course the music is outstanding.",
            "review_score": "1"
        },
        {
            "review_text": "A much, much worse version of Before the Echo. The soundtrack is more diverse, but that's probably the only advantage of Metronomicon (personally, I liked BtE soundtrack a lot more, but everyone has different tastes I guess).  1) The gameplay is a lot less skill-based and a lot more random. If your enemy wants to do damage when you don't have enough HP, it will do damage. If it wants to stun you, it will (and this will affect your final score). There is nothing you can do to control the situation (except for boss attacks, that actually give you a way to prevent the damage, like you normally can in BtE), so you kind of have to guess if you should heal one more time or try to kill one more enemy to get one more kill for the challenge.  2) Interface tries to annoy you any time it has an opportunity to do so. You just finished one enemy and want to see the element of the next one? Well, here is an enemy, but it will take a few moments for its health bar to appear, so unless you want to memorize all the ugly sprites and their corresponding elements, you have to guess blindly. Any reasons to not show you an important UI element? Nope, just game being annoying. Another example: game convinced you that Water skills are blue, Fire ones are red, and Thunder ones are yellow? Basic color coding, works for every skill. Nice. Ok, quick quiz: as your cast spells, your battlefield changes from blue into red into yellow. Does it mean that it changed from water into fire into thunder? Of course not, it means 'first, second, third skill slot', duh. It would probably kill the devs to be consistent, or to use different colors for unrelated things.  3) Progression system is so broken that it makes the scoreboard system completely pointless. Want to compete with your friend and compare scores? The same song on the same character level may become a lot easier or harder based on the order in which you first completed these songs in the campaign (and this is permanent), so if you picked some other order, you may never be able to beat someone else's record, no matter how hard you try (the difference in mob levels will stay forever, even when you'll reach the level cap). Why they decided to implement this system is beyond me. And BTW, devs don't care about their game anymore, and have no intention to fix that.  4) Performance. It's hard to believe, but a game that looks like a simple 2D arcade manages to drop frames at random moments on a powerful modern PC. Oh, and 1-2 seconds-long hickups every time you fiddle with the menus will make you hate the UI even outside of the combat.  If you are looking for a fun rhythm game, try Before the Echo instead.",
            "review_score": "-1"
        }
    ]
}