{
    "app_id": 417430,
    "name": "Moto Racer  4",
    "release_date": "2016-11-02",
    "developer": [
        "Artefacts Studios"
    ],
    "publisher": [
        "Microids"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Online Multi-Player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Action",
        "Sports"
    ],
    "achievements": 50,
    "positive_ratings": 474,
    "negative_ratings": 252,
    "price": 11.39,
    "description": "Choose from a variety of daring riders and get a taste of adrenaline riding freestyle or on the race course. Show your opponents what you can do with your best drifts and tricks! Show of your skills to win the championship and send your enemies of the road or into traffic for spectacular crashes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/417430/header.jpg?t=1487254704",
    "minimum_requirements": "OS: OS: Windows Vista, 7, 8, 8.1 or 10 Processor: Intel Core 2 Duo CPU E6550 at 2.33GHz Memory: 4 GB RAM Graphics: Video card must be 1 GB or more and should be a DirectX 11 - compatible DirectX: Version 11 Storage: 12 GB available space Sound Card: DirectX compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Classic 90's styled racer, track design is great and reminds me of games such as cruis'n usa and obviously the original moto racer.  i like the upgrade system and the ability to customise the bikes slightly.  The racing itself is crazy the ai actually crashes into other vehicles sometimes which is cool but the difficulty is still high enough for a challenge  The optimization ist perfect yet, seems to have fps problems when running into walls,   This seems to be the norm for early unreal 4 games. im sure with some patches it will be perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Really bad game. Graphics and sounds sucks, I feel like I ride an electric saw and my eyes are burning... Maniability sucks and the gameplay is so poor... Don't buy it. Please refund !  Très mauvais jeu.  Un supplice pour les yeux et les oreilles : des graphismes dépassés, le bruit du moteur semblable à une scie électrique... Une maniabilité médiocre et un gameplay pauvre... Aucun intérêt. Je voudrais qu'on me rembourse.",
            "review_score": "-1"
        }
    ]
}