{
    "app_id": 417750,
    "name": "Left Alone",
    "release_date": "2016-04-28",
    "developer": [
        "Volumetric Games"
    ],
    "publisher": [
        "Volumetric Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Horror"
    ],
    "achievements": 0,
    "positive_ratings": 232,
    "negative_ratings": 69,
    "price": 4.99,
    "description": "Left alone is a psychological horror game set in multiple believable interior and exterior environments. The game has a unique, old school, high octane atmosphere which means you'll feel like you're truly beginning an adventure you'll never quite forget.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/417750/header.jpg?t=1481549085",
    "minimum_requirements": "OS: Windows 7 64-bit Processor: Quad-core CPU ~ 2.5Ghz Memory: 2 GB RAM Graphics: GTX 560m / HD6870 1GB or equivalent DirectX: Version 10 Storage: 1 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well worth the money! Few hours of fun i couldnt stop playing",
            "review_score": "1"
        },
        {
            "review_text": "Oh finally I can experience camping with my mates like the good old days.....  Pretty enjoyable game, even if it made me feel like an idiot on occasions.  Spent a solid 10 minutes trying to figure out one of the first puzzles involving colours. Its a good atmosphere and on a couple of occasions managed to physically send a chill down my spine, more than I can say for some other horror games I play. Including Alien Isolation for that matter. Of course it isn't fair to compare an indie title to a AAA company but I felt credit is due in that regard. Some of the puzzles are challenging at least if you are a spoon like me.  With all things horror your milage my vary, but I'm certainly enjoying my playthrough so far.  The only thing this game really is lacking is Ronnie Coleman. The most horrific thing to me was seeing the gym and no weights. Who knows maybe its Ronnie stalking the school and he has stolen all the weights. Or maybe its the vengeful spirit of Kai Greene out to get revenge on the Mr Olympia judges.  At least I'm glad I don't have friends to go camping with. Seriously though it might be an indie game but if you can get over that you will have a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Left Alone is an amazing example of an indie developer's first try at a steam release, and deserves praise! It had some minor things here and there so far, but in all, pretty good.  Pros:  - This game looks stunning for what it was built with! Having expirience with the Unity Engine, I know it's hard to make good visuals, but this game pulls it off fantastically!    -The Gameplay is really good! The puzzles are difficult, and the controls are intuative. There are a few things you need to get used to, but they work.   -The atmosphere is great. It's very creepy and mysterious, and I really like it!   Cons:  - There are a few gameplay aspects that don't make much sense, and a few thing I wish were added, like a viewable inventory so I can see everything I've picked. If these few things are great, I think you have yourselves an amazing game!    I would absolutey recommend this game! With good gameplay and atmosphere, which is barely weighed down by some bad mechanics. I give this a solid 7.5 / 10. Keep up the good work!",
            "review_score": "1"
        },
        {
            "review_text": "Left Alone is a great little psychological horror game that has you on the edge of you seat by cleverly using the environment and sounds to make you feel a little on edge as you play. As soon as you start the game up you almost get the feeling that this is going to be a slender man clone game, but that passes ten minutes into playing the game. The puzzles are good, and a couple of them can become a little confusing but once you solve them you feel like you have accomplished something good. The overall quality of the game is good and well made; with nice environments and detail this game is a bargain for the price and is defiantly not overpriced for the content you receive. It is a little short, maybe around two hours of gameplay if it’s your first time playing but its defiantly worth the price tag and is ideal if you’re looking for something to play for a couple of hours to pass the time.     (**Spoilers** - More about the game - **Spoilers**)   The game is almost split into two areas, the first being some woods and the second being a school building. The woods in the first part of the game could do with some improvements to the fog, as it only seems to be off path and kind of looks like a repeated tiled pattern of balls of smoke. Some blending would help here to make it look more realistic. A little bit more work on the detail would also help in wood area, apart from a few school busses and logs outlining the path there isn’t much else that stands out. The second part of the game takes place in a school building and to me this is where the game starts to get interesting as you try and find your friends. The school is filled with quite a few puzzles which I enjoyed solving, although one puzzle had me stumped in which I had to get a code for a door. The puzzle included computer screens with shapes on them which had something to do with the code and I could not for the life of me figure it out so had to watch how it was solved by watching a YouTube video. Maybe this puzzle was simple and I was too dumb to see the answer but I felt like this particular puzzle needed more hints to figure out what to do. The final part of the game you find yourself in a brightly lit corridor after taking a lift down too it. The corridor had many doors but only one of them opened. It was at this point I felt the ending was a little rushed as it did not take long in this area. I really hope the devs will do a little more with the final area, maybe even open a few more doors in this corridor to extend the story a little and maybe include a couple of final puzzles.   Pros     Nice environment    Nice detail    Runs smooth    Runs smooth     Cons     Fog needs improvement, looks like unrealistic balls of smoke floating (Looks tiled Needs blending)     Mouse sensitivity a little high and no option to change it (DPI adjustable mouse did not really help either)     Sometimes you have to wait in locked rooms to progress (Can become confusing to the player)  ",
            "review_score": "1"
        },
        {
            "review_text": "Second review:  The game developer added me after I've written a negative review and looked into the issues trying to fix them. I want to support such behaviour as he was very kind and seems to be a one-person developer. He also assured me that my bug was kind of unique.   Apart from the bug the game was good, so I'm changing my initial negative review to a positive one. For my first review, see below:   First review:  Lost over an hour of gameplay due to getting stuck because of a bug. Autosave is a cool feature, if it's done right. And it isn't good enough to play that hour again.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this one. It is deffinitely worth the price for a couple hours of game time. I didn't like the lack of ability to save when you need to, so i just left the game on in the background until i was ready to come back to it.",
            "review_score": "1"
        },
        {
            "review_text": "This was an absolutely amazing game, gripped me through out. It is best played all the way through or in sections as it saves as save points are far apart. However having played it all the way throguh first t/ime playing the story, tension, audio and the entire puzzel created an amazing psycologicl horror. one question... What for?",
            "review_score": "1"
        },
        {
            "review_text": "*Spoilers* Alright. I have been asked by the developer to write a review on this game and how I enjoyed it and things I will point out that I think need to be fixed.  Positives-:  So while playing the game through, looked fantastic and had great scenery! I enjoyed the first 5 minutes of the game. The story really made sense and liked the way the game built up to something. Later in the game we come across an old school with good detail and had a great spooky atmosphere. I enjoyed reading the notes and the writing. I also enjoyed the sounds in the game, thought they were very well made. Overall in the positives, Good game.  Negatives-: (Detailed tips to make the game better)  Just a few negatives, more of tips really than negatives. I found it difficault to run through the puzzles at times. If I didn't look on the internet about the switches, I would have found it difficault to do, if not impossible. I don't know how other people managed to do it but I just coulden't figure it out. Then we have no 'objectives'. Where the map was torn in half, at first it didn't occur to me that you needed to go back and do that. Maybe put something like 'Find out what to do with the torn map' or something like this. The last thing was I thought the school was a little too large but really I don't mind too much.   Overall, great game, atmosphere and nicely made animations. Good job on the game, I feel as if you tried your very best on the game. I had a different opinion on the game but people were swaying my opinion, so I decided I would recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "(could contain spoilers)  The game is starting like a typical horror game: alone in the woods, buddies gone, some text messages on the phone. After a while, you figure out, there's omething wrong, of course, just to stumple into an abondoned school which is being located in the woods. Something went definitely wrong there, as you can reveal by collecting hints, letters, etc. Inside the school, you're all alone, on search for your buddies, but for sure, you are not alone... As the story about a bad janitor continues...  The game is just a bit like an Urban Exploration. The atmosphere is really great, even if there is not happening too much, it is eerie and spooky, since you're expecting anything to happen anytime. Many details and good graphics. The level design is realistic and supports the atmosphere well. All the time you are unsure what exactly is wrong here? The ending will shed some light... Maybe?  Horror fans should give it a try. A bit of Silent Hill, a bit of Urbex'ing, very nice mixture. Hoping for a sequel!   Pro: - Atmosphere - Graphics &amp; sound - Many details in the area - Level design - Story development   Con: - Lack of inventory and map - Quite short",
            "review_score": "1"
        },
        {
            "review_text": "Just get it. It took me 4 hours to beat in a night and was very entertaining. I assume there are two completely different endings based on the choice you make near the end, But its worht another go around.   Graphics are clean, gameplay is simplistic, puzzles are only moderaely challenging.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. The puzzles are complex enough to present a challenge while remaining fun. Story is amazing and very creative with the way it tries to spook you. Great atmosphere and graphics. Could not reccomend this game more.",
            "review_score": "1"
        },
        {
            "review_text": "Story was very good and the scares were superb. The only complain I have is the ending. It is very incomplete and I have no idea what they were going to do after Joel found out that it was all a test. All I have to say is to make the game longer. I completed it in around 2 and a half hours. Otherwise, this is a great horror game, very unique. Great job!",
            "review_score": "1"
        },
        {
            "review_text": "I couldnt get in to the building . Its not as fun as i thought it would be.",
            "review_score": "-1"
        },
        {
            "review_text": "Just another walking simulator with no real solid story and the ending leaves you and confused. Not much to do and only really 3 puzzels if you want to even call it that. the game didnt even last and hore of full gameplay. regret this purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "Cons: I think the bobbing circle of light from the flashlight is giving me motion sickness. I don't suffer this sensation from other first-person games like Skyrm or Fallout.   Save points are dictated by the game, forcing repetition of actions if you need to quit before finding the next save point.   Pros: Very atmospheric and creepy; intersting puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel like I just played cabin in the woods now...",
            "review_score": "1"
        }
    ]
}