{
    "app_id": 417880,
    "name": "Everybody's Gone to the Rapture",
    "release_date": "2016-04-14",
    "developer": [
        "The Chinese Room"
    ],
    "publisher": [
        "PlayStation Mobile, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Walking Simulator",
        "Atmospheric",
        "Great Soundtrack"
    ],
    "achievements": 18,
    "positive_ratings": 667,
    "negative_ratings": 293,
    "price": 15.99,
    "description": "Featuring a beautiful, detailed open-world and a haunting soundtrack, Everybody’s Gone to the Rapture is non-linear storytelling at its best.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/417880/header.jpg?t=1464039474",
    "minimum_requirements": "OS: 64-bit Windows 7, 64-bit Windows 8 (8.1) or 64-bit Windows 10 Processor: Intel Core i5-4570T 2.9 GHz / AMD FX-6100 3.3 GHz Memory: 4 GB RAM Graphics: NVIDIA GeForce GTX 560 Ti / AMD Radeon HD 6850 DirectX: Version 11 Storage: 8 GB available space Sound Card: DirectX Compatible",
    "recommended_requirements": "OS: 64-bit Windows 10 Processor: Intel Core i7-4770S 3.1 GHz / AMD FX-8320 3.5 GHz Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 770 / AMD Radeon HD 7970 DirectX: Version 11 Storage: 8 GB available space Sound Card: DirectX Compatible",
    "reviews": [
        {
            "review_text": "PROS: - Excellent writing. The developers know how to tell a story. - Great voice acting. Every character sounds like a real, relatable human being. - Great map design - Great graphics.  - Great music and overall sound design. The soundtrack contains some of the most beautiful and atmospheric music I've ever heard in a video game.  CONS: - Inconsistent framerate issues, even with the settings turned down (using an R9 290X, 16GB ddr4 RAM and i5 6500) - I'd go from the mid 50's one second to mid 20's the next.  - No puzzle solving whatsoever or any other feature to let you interact with the world (aside from opening doors and turning on radios). It's a walking simulator through and through.  - ZERO replay value. Seriously, there is nothing that would ever bring me back to this game - there are no alternate endings (that I know of) or any other kind of player-made decisions to change the course of events in any kind of way. It has a single story to tell, it tells it, and that's that.  - The game's ending is practically insulting to its audience.  I'd only recommend this game when it's on sale. And when I say 'sale' I mean when it's 70% off or lower. You could easily finish this game in an afternoon and you may or may not be left with an empty feeling after its finale. I know I was.",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely poorly ported/optimised - stuttering, crashing. Unplayable. Refund requested.",
            "review_score": "-1"
        },
        {
            "review_text": "Whether you enjoy this game or not depends almost entirely on what you are expecting. If you want a well-paced, puzzle-filled, challenging, interactive experience, then you'll be disappointed. But there are plenty of other games that will scratch that itch. What makes this game so great is that it offers an experience that very few other games can. If you want to relax, slow down, contemplate the meaning of life, and soak in the eery atmosphere of an abandoned English village haunted by the stories of its mysteriously-vanished denizens, then you will certainly love this game. It may not be riveting, but it is rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Though it is a short experience, this game packs a lot into only a few hours of gameplay. It was good enough that I felt the need to play through it several times, which is almost necessary to see the full detail of where the game takes place. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, but confusing!   I played this game through in one run - its not so much a game than a visual novel. I was left completely confused about the entire thing. The graphics of the game itself are stunning. It looks absolutely beautiful! Storyline, I wanted more. The ending felt like an anti climax for me - but perhaps the moral of the story just went right over my head. Who knows - because I certainly don't!",
            "review_score": "-1"
        },
        {
            "review_text": "I wasn't too sure about this game at first.   Here's a warning to everyone: it's not a fast paced game. It's more like a slowly unfolding book than anything.   If that sounds interesting to you, then you might very well enjoy this game. If the idea of a very slow game doesn't appeal to you, then don't buy it. For me, between the music, environments, and the story, I was enthralled during my entire experience. I plan on playing through a second time in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Bought on release, played for 2 hours, 66 minutes of which weren't saved! No fix on the horizon, so it got refunded.  Poor show Chinese room! Especially when Esther was so good...:/",
            "review_score": "-1"
        },
        {
            "review_text": "Yes, it is another Walking Simulator, but a really beautiful and mysterious one. Fans of Dear Esther or Gone Home will have a lot of fun. There's plenty to explore, the world has its borders but is quite open to explore it through different and hidden paths. The graphics are stunning and the soundtrack is a masterpiece. The interludes between the 'chapters' (no loading screens) are some of the best I've ever seen, goosebumps guaranteed.",
            "review_score": "1"
        },
        {
            "review_text": "To put it simple, this game is graphics porn set on 13/10. The game is beautiful. The story is also actually really good. This is a walking simulator and I do mean WALKING simulator. This isn't a game you get and expect a ton of hours out of, flashy gameplay, or any type of hard gameplay. This is a game you get when you have a weekend off and want something fun and new to play. Keep in mind, in order to run this game on the highest settings you're going to need some pretty beefy hardware. I achieved max settings with a GTX 980Ti and was able to run at a constant 60FPS. This game is gorgeous, and overall I would have to give it a solid 8/10. If you've played walking simulators before and you know the genre then I would full on recommend this game, if you're new to walking simulators I would probably wait for a sale before purchasing.",
            "review_score": "1"
        },
        {
            "review_text": "When I found the game on Steam I was bewildered since I could see a great game on pictures but an awful game on reviews. Why wouldn't I give it a try then? So I did. Let me say first I enjoy popping every achievement on walking simulators. And that's exactly what happened. I TRULY loved this game. Visuals and atmosphere are stunning. Many options to reach multiple destinations with nothing to be done first. You just walk and do as you like. Characters? They are light orbs and you feel them as real as if you could see them (good job there). Is it real that its speed is slow? Yes it is... but when you read a book... Do you complain because it is 700 pages long? Don't have time... then don't read it!  Anyway, this is just my opinion. I would give this game 9/10. Grab it while on sale if you're doubtful as I was.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interactive drama rather than pure game. So if you value game mechanics than emotional experience, this one is not for you. For me, this is the best walking simulator I've ever played. Sad and tragic but, at the same time, it's so beautiful. Respective villagers' lives are converging into 'The Rapture', and you will witness the peaceful end of the world. If you seek seek breathtaking landscape and emotional story, grab the copy right now!",
            "review_score": "1"
        },
        {
            "review_text": "Everybody's Gone to the Rapture is not so much a game as it is an interactive movie.  There are no puzzles for you to solve. Yes, there is the mystery of where everyone is and what the heck happened. The game tells the story of what happened through conversations that you witness via echo like ghosts. They do tell an interesting story in a way that despite the fantastic elements of the story does make the residents feel like normal people experiencing something that is anything but.  You find these conversations primarily by following an orb that leads you through the small village. You can however, explore on your own. The movement speed is quite slow however, so exploring might feel tedious to some. Exploring can also lead to frustration as the game only saves on its own. You might end up walking around for a long time without the game saving if you don't find something the game considers worthy of a save. This is part of why my play time is probably a bit higher then normal.  While the achievements indicate there is more to do then just listening to the conversations, you may well find yourself just wanting to get on with things.  The graphics are beautiful, showing us a realistic looking town that you might find yourself wanting to explore and wishing there was life to take part in and experience.   The music is gorgeous. It's profound at times, melancholy and touching at other times.  The menus are creative and interesting in the way they handle the game's various options.  I can tell the people involved in making this game went to a lot of effort to make this village and to tell the story. It feels like a real place with real people.  So, why did I give this a down vote? In short, while it does tell a good story, looks and sounds beautiful and is an emotional (or at least will be depending on the player) experience, gameplay wise, you're only going to be walking and listening. I get that this is a walking simulator similar to The Vanishing of Ethan Carter. Others have compared it to Dear Esther but I only played it a bit back when it was a mod, so I can't really compare.  This is not the sort of game where you can influence or at least take part in the events. The majority of this game is walking from one point to another and listening to conversations. Even if you do find the experience touching emotionally and beautiful from a visual and auditory standpoint, the price tag feels a bit much. I got it in the Winter sale and it still felt a bit expensive. Yes, I do feel bad giving it a thumbs down. However, as it is, it's more an interactive film then it is a game. If that's what you're looking for and are willing to pay the asking price, that's fine. However, I think a lot of players are going to feel let down if they buy it at full price or even at anything but a steep discount.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the few games that aren't fast paced and still kept my attention to do a full playthrough in a few hours. The story and the graphics are so captivating, it keeps you seated and makes you want to know more about the characters and their backstories. It's like playing through a movie.   Anyone who has the patience to sit back and let him/herself be awed by scenery, music and emotional backstories should totally take the time to try Everbody's Gone to the Rapture at least once.  The only thing that I didn't like was that there was no option to run. But it didn't make me quit the game. The fact that you can't run actually helps you to experience the game at the exact right pace.   10/10 would play again to see if I missed any details.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Amazing story. Amazing Graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I generally rate games based on graphics, audio, game play and storyline. This game has some amazing art. Its just beautiful. There detail in everything. Like the tools in a shed, stuff in a house, it makes sense. Then there is the story, a mystery you have to peace together. For minimum effort this game was fun. It felt like a movie rather than a game. But, a movie that I could pause and look at the details from different perspectives. To the creators, well done it! Shows you the power of the cryengine.",
            "review_score": "1"
        },
        {
            "review_text": "This is a lot like the TV show Lost - you get a well done and at times very moving ending for the characters, but you still don't have a full explanation for what's going on. This will either not bother you at all, or be really frustrating. I loved it.   ",
            "review_score": "1"
        },
        {
            "review_text": "Gee, our demise was explained by our ignorance. And again we were soothed by notions of everlasting life. Well it was in the title after all.  We apparently couldn’t work out the formulas of doom despite repeating sets of numbers from various airways, calculations strewn over walls and streets, and the hand-holding guide of lightness that tethered us into oblivion. I know, the light is lonely. How about the plot?   Observing the mundane is often interesting or challenging. Yet our impatience usually wins out, and we make something fresh happen. Not here. Even if it is much prettier, EnglishCountryBerg is no different thanI InnerCityApartmentBuilding. So that’s it? Five or six hours of being led around by ordinary lives in pretty much a straight line? At least it was short. The credits were longer than the final act. ",
            "review_score": "-1"
        },
        {
            "review_text": "Like it's predecessor, Dear Esther, I have trouble calling Everybody's Gone to the Rapture a game, per se. It's more of a walking simulator, with the first installment in the pseudo-series (Esther) as the prototypical, and thus perhaps archetypal, example of such a genre. While I thoroughly enjoyed Rapture, it does have a few problems.  Originally released on the PS4, the Steam iteration is a port. Thus, there are some parts that simply don't work as well as intended. I had a lot of trouble figuring out how to actually PLAY the game, as the controls aren't explained very well -- especially the storyline's 'main events' (which require one to rotate the controller on a PS4, but hold down a trigger while sliding the analog stick on the XBox controller when playing on my PC). There are also a few other problems, like the walk speed being too slow (which stands as a common complaint). I understand the response to this is 'well, it IS a walking simulator...' so perhaps I'm misunderstanding, but the slow speed meant getting the achievements was... quite tedious.   Ah, yes. The achievements. As many of you who have read my others reviews know, I love achievements and earning them. This game has a few creative ones, but for the most part, its achievements mostly fall into one of two camps: 1) Go somewhere and wait BUT CAN YOU FIGURE OUT EXACTLY WHERE IT IS YOU NEED TO WAIT?? or 2) Find random items in the world, but you don't know how many of that item there are and there's no indication when you've 'found' one of them. So yes, they're quite annoying. Add the slow walking speed to that for a truly frustrating gaming experience.  While those sins would be enough to damn most games, I feel compelled to positively recommend Everybody's Gone to the Rapture. Perhaps this is my endearing fondness for Esther shining through, but there are many positive qualities I feel many reviewers tend to overlook in this game. The music (oh man, the MUSIC!) is aboslutely phenomenal; Jessica Curry, the composer, is a wonderful human being and has absolutely nailed another perfect soundtrack. The graphics are exceedingly beautiful (though perhaps the port is a bit poorly optimized -- my monster computer had random framerate drops the like of which I've never seen). The environment is spectacular and immersive, so much so that it makes me want to travel to rural England to see such beautiful sights with my own eyes.   I guess, at the end of the day, Rapture is a beautiful but flawed game. The Chinese Room, for whom this game is no doubt a labor of love, are definitely a studio to watch for those who dig narrative-driven experiences. I hope the negative qualities which I touched upon influence their future games, which I will no doubt buy -- and you should too! Rapture is a great game... Just perhaps one you should buy on sale. And try to not get TOO frustrated while achievement hunting! ;)",
            "review_score": "1"
        },
        {
            "review_text": "I can see how this game could be quite polarizing, depending on the audience. As with all games, I think that if the player knows what the game is going to contain before they purchase it, they can adequatly judge whether or not they will enjoy it.   Everybody's Gone to the Rapture contains a splendid story. Not just the superficial story that takes place during the events of the game. This story is well written in and of itself. However the game leads you, the player, to a possibility that opens up a much grander story.   To tell this story the game utilizes well done voice acting. The Bioshock style recordings are left all over so you can piece together the plot on your own. The music is also quite striking, though I don't think it's the kind of music most people will be listening to in their car every day of the week. It's much more of an 'epic' soundtrack.   As far as gameplay goes, however, the game is a walking simulator. You can walk and activate recordings, that's just about it. A common complaint, and one that I will echo, is that the walking seems to slow. I'm okay with the idea of a walking simulator, but I still think the player should be able to choose, to some degree, how fast they walk. You either walk or jog (if you hold down the sprint button) in this game, and both are exceedingly slow. I understand that the slow speed is arguably to force the player to experience the atmosphere. Even so I think movement could have been a bit faster without sacrificing the experience.   Speaking of the atmosphere, the CryEngine is used to beautiful effect in this game. The town and woods surrounding it are rendered beautifully. This being a CryEngine game, like Crysis, it will tax your computer. You will probably not be running Ultra details at 90fps. I personally don't think this is a problem; this is a walking simulator. I don't care if it drops to 30fps, all I'm doing is plodding around town examining empty homes and gas stations. I'm not making frame-perfect reactionary shots or anything.   The Walking Dead got critical acclaim for being a story driven video game. Everybody's Gone to the Rapture is another story driven game, but the story is told in a different manner. If you want a good story, and don't need a bunch of action, I would recommend this game. I'm glad Sony decided to produce this game, I think the developer put the resources to good use.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game.   What I like about this game is that the storyline is rich with characters and events and the voice actors I think are very convincing. The scenery is amazing and backed with a great soundtrack (which, if you don't like the game, at least check the music).   That being said, this game is not for everyone. It is basically an open world, story-telling, atomspheric game... HEAVY emphasis on the story-telling bit.   I understand that most people would barely call this a game because there are no puzzles, figthing, strategy or anything like that... you literally walk through the game and click on things to learn the story. That will appeal to some people but definitely not a lot or people.   This game is like experiencing a movie. If you don't like the movie, its not for you.   Controls-wise, one of the 'cons' of this game is how slow your character moves. TBH, I was hesistant to buy this game after reading some reviews saying that the game is too slow bc the character moves too slowly. The walking pace is SLOW but appropriate for the game. If your character moved too quickly the game would be over WAY too fast.... (another con, I suppose). I can understand that the option to 'run' in the game is barely noticeable against the walking option.    I did not feel impatient playing the game bc of the walking speed, I found it completely appropriate for the pace of the game and you can still finish this game in one sitting.",
            "review_score": "1"
        },
        {
            "review_text": "ohhhh that starting music.........",
            "review_score": "1"
        },
        {
            "review_text": "Story... Music... Unparalleled.  Gameplay leaves something to be desired.  Recommend.",
            "review_score": "1"
        },
        {
            "review_text": "i bought it on PS4 and played it 3 times.  Now i have bought it on Steam again, cause it's ... it's not a game... it's art.  Not everybody will understand its emotional story.  Some will think there is no action or puzzles, etc.  But Everbody's gone to the Rapture is one of the best things ever programmed. You just have to open your heart and mind. ;)",
            "review_score": "1"
        },
        {
            "review_text": "I adored Soma and craved something else in the genre. Succumbing to the hype, I purchased this. Alas! This is undoubtedly the dullest thing I have ever played. Not a game in any meaningful sense of the word,  What is it then? That haunting soundtrack. The detailed, faithful and very human background stories. The delightful imagery and accurate evocative environments. It feels like the backdrop for an amazing, ground breaking experience: a game world to rival any other. But it's not a game, it's not even an unfinished game: this is the real deal, the final product.  An interactive movie? Perhaps but the disjointed nature of the little narratives (however delightful, individually) and the stultifyingly slow pace make this a pretty dull affair. That word again.  Should you buy it? If you're expecting a game, no. If you're expecting a stirring interactive movie, no. As a piece of interactive, digital art? If the videos and screenshots take your fancy and you are willing to take the time to drift around Yaughton, taking in the sights and sounds of an English village, it may be your cup of tea.  Alternatively, for English folk anyway, take a trip to a real village this weekend but try not to be too prurient. They don't like nosy Townies.",
            "review_score": "-1"
        },
        {
            "review_text": "the story is absolutly fantastic. although it is stuttery, the story is amazing. If you are in a mello mood, it's totally worth the time it takes to finish the story. grab some popcorn, bring some friends. and enjoy the story. I would give this a 4/5 since the game was not very well optimized.",
            "review_score": "1"
        },
        {
            "review_text": "A nice science fiction story that has been done quite a few times before but never so much like this in a video game format.  It feels like a console port a tad unoptimized and it does not really boast high resolution textures but that is more of a crytek engine (being more of a console engine than a pc engine) thing. But it is a beautiful game very surreal and sombre with pleasant and daunting feel the music changes mood to effect in the game rather well.  over all it is interesting but the basis of the story has been done before",
            "review_score": "1"
        },
        {
            "review_text": "Very slow story and not worth the price that I paid.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel like the people giving this game a bad review don't understand that this game a walking sim that is meant to be experienced.",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful game. The detail of the flying bee, butterflies and flower pollen floating in the air. The character lights moving around. The sunsets moving back and forth between scenes. The scenery of the trees, grass and houses. The voice acting. The amazing music score of gregorian, violin and chanting makes you want to just sit and listen.   The walking could of been a tad faster. The ending could of been better. All in all, it was a very nice walking simuator.  Game time is 5 - 8 hours. Worth $15 - $20. 4/5 Stars.",
            "review_score": "1"
        },
        {
            "review_text": "What a great experience. Played it in 4k on my ultra wide T.V and the visuals, as well as the well told storey amazing. At times I got lost and had to retrack to find the light. But once you get to grips with the way the game unfolds it is worth the time in my opinion. The kind of game that really makes you think and even question your own existence in this wonderful world we live in. Top stuff.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good.",
            "review_score": "1"
        },
        {
            "review_text": "I THOUGHT IT WAS STUPID AND MADE NO SENSE WHAT A WASTE OF MONEY AND TIME!",
            "review_score": "-1"
        },
        {
            "review_text": "So ever since I came across an article about this game I knew I had to play it. I am a sucker for any deep story game and this one has so much to it. Considering it's open world, it gives me the player to take my time and explore every ounce of detail that this beautifully constructed piece of art has to offer. Before I played, I listened to Jessica Curry's score over and over in complete awe of how it sounded. Now playing the game and listening to the music and sounds, it's just out of this world. I'm also a student at art school studying 3D animation, so seeing this game's lighting, modeling, textures, shadows, particles, JUST EVERYTHING IS GORGEOUS. And the little details with the particles leading the player to certain areas is such a nice touch. No not the AI lights, the actual light particles. But technicalities aside, if you really want to wind down after a long day, and just have an experience in a fiction English countryside that makes you wish you lived there, I HIGHLY recommend this to you.",
            "review_score": "1"
        },
        {
            "review_text": "Wow....if you like Games like Dear Esther, would you love this. Gameplay is simple...walk and listen or activate the Sphere's. Find some secrets and feel free to explore the great designed nature and village. How long you enjoy the game is your choice. Sometimes 'walking' is a little bit to slow and faster run would be nice. Great graphics, excellent voice actors and awesome soundtrack. 20 Euro for a very nice Journey like a interactive crossing of book and radioplay. Worth it",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game to torrent.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to have your brain melt out your ears, buy this game!",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing story and awesome visuals.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so let's start off by saying only buy this game if you enjoy walking simulators. Overall it's a good game with a pretty decent story and a great atmosphere. But when I say 'walking simulator' this game is the walking simulator of walking simulators. There is little intereacting between your charater and the world, aside from the radios, telephones, and light orbs you encounter. Also be warning the walking is very slow... very slow.   Pros: - Story is psychological-type, where you must uncover the truth - Great character development - Great voice acting - Graphics and environment are top notch - Amazing atomosphere  Cons: - Not as much player interactions compared to other walking sims. - WALKING SPEED.  - One of the main problems I had with the game was walking.. The movement speed is horrendously slow and  the sprint takes time to build up, really only doubling your normal movement speed, if that. The other problem  is when you do sprint, you must hold down the key (defualt shift). Since you find yourselve sprinting everywhere   your finger starts to get numb.  - May loose your sense of direction if new to walking sims.   May sound negative but I really do reccommend this game, really great atmosphere like The Vanishing of Ethan Carter or The Cursed Forest. The story does make you think and connect dots if you're into that kinda thing.  Cheers!    ",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful for both your eyes and ears. There's a fix which enables Nvidia 3D Vision as well which makes it even more stunning. Loved this on the PS4, plays great on my PC as well. It is slow paced and there's no puzzles to solve, just a great story which you need to discover by exploring. Its not for everyone, but it can be a very emotional experence for those looking for something a bit different.",
            "review_score": "1"
        },
        {
            "review_text": "The walking is painfully snail pace like at times which can be very testing on your patience if going around wanting to see everything in the beautiful world that's been created for you to explore. That being said there is a great story to be found if you can put that aside.  Pros:- Breathtakingly beautiful Great storyline Music is beautiful  Cons:- Walking pace is VERY slow, tests your patience when exploring",
            "review_score": "1"
        }
    ]
}