{
    "app_id": 417890,
    "name": "Apotheon Arena",
    "release_date": "2015-12-08",
    "developer": [
        "Alientrap"
    ],
    "publisher": [
        "Alientrap"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Action",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 758,
    "negative_ratings": 166,
    "price": 0.0,
    "description": "Apotheon Arena is the free online-multiplayer complement to the mythic Greek action RPG, Apotheon. Pit your skills with spear and shield against other players in brutal bronze-age combat. Battle across the statuesque arenas of Olympus, depicted with beautiful black-figure pottery artwork.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/417890/header.jpg?t=1449687259",
    "minimum_requirements": "OS: XP/Vista/Windows 7 Processor: Dual-core processor (Intel Dual Core 2.0 GHz or AMD Athlon X2 5200+ 2.6 GHz) Memory: 1 GB RAM Graphics: DirectX 9.0c compatible DirectX: Version 9.0c Network: Broadband Internet connection Storage: 1 GB available space Sound Card: DirectX 9.0c compatible sound cards",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Well I must say, as an advertisement for the single-player 'parent' game, Apotheon, this certainly makes quite the impression (though I'm not entirely sure why it states that this one can also be played single-player, when it seems that only the tutorial can be tackled in such a way)! Visually stunning, really nice 'n' natural-feeling controls, solid sound...there's not much to complain about here. Especially for FREE.   I can only suspect that it's even 'better' in multiplayer, as that's what it's clearly intended for, but alas: a. No one else in Australia seems to be playing it right at this very moment (it is, in all fairness, 3.30 in the morning), and b. I generally couldn't be arsed with multiplayer games anyway, especially with strangers. I'll definitely buy the aforementioned single-player game on the strength of this, though, and wouldn't hesitate to recommend this to all you people out there - all several BILLION of you, far as I can tell - who do indeed enjoy the multiplayer experience.    A thoroughly excellent side-scrolling beat-'em-up, whichever way you look at it.  Verdict: 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "okay, first of all, this game is AWESOME!!!!   pros: -the controls are easy to understand,  -love the smooth gameplay, -lots of different weapons, which you all can carry at once to F with your enemies, -stable servers, -game is sooo small! why not install while reading some reviews? -there is always someone playing online, -the feeling when you destroy someone with only 0,000000000000001% of your healthbar left is AWESOME.  cons: -you cant really see who is in your team or not, ive been trying to smash a guy for like 10 minutes to find out he was in my team... :/ -when the host leaves, the whole server stops. this is kinda annoying.  hope this was helpful, now you can start playing the game :)",
            "review_score": "1"
        },
        {
            "review_text": "As a Greek, I can confirm that we used to fight with ancient molotovs and stone tossing... we also had our d*cks out sometimes! 10/10 would γαμήσουν το κωλαράκι σου again...",
            "review_score": "1"
        },
        {
            "review_text": "This is a well polished game with a good fighting system. I highly reccomend downloading this because it is free. It is nothing like I have played before and a single player historic campagin would of been a nice addition to pay for. There are not as many servers as expected but playing with a friend is the best way to go. I think the fighting system makes you be predictable and spam. Not a very competitive game. I give it a 7 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Great game concept. But for now I would stay away. Its just a lag fest. Either you host, and have an unfair advantage over others, or you join and have an unfairadvantage against, either way it just takes all of the fun out of the game. It is a beautiful game, and has a great potential, but for now its just not worth playing. I will still recomend, as for some people might not have the same connectivity issues and might still have a great time, check it out for your self.",
            "review_score": "1"
        },
        {
            "review_text": "flawless co-op arena deathmatch, with beautiful artwork. great for couch games",
            "review_score": "1"
        },
        {
            "review_text": "This game is really amusing once you get the hang of it",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best free multiplayer game I have seen in a while. Greate for a few hours of fun. I dunno about the main game but the combat in this is purty fun. 10/10   I wish more games had this art style. I am waiting for a medieval game with period art style, like what is on efigies.",
            "review_score": "1"
        },
        {
            "review_text": "I love you guys so much.   The only thing I owuld like to see added is the 'Air Roll', other than that it's a dream come true.",
            "review_score": "1"
        },
        {
            "review_text": "The core Apotheon game is fantastic and I've sunk quite a few hours into it. Unfortunately, due to very common desync issues (my game is disconnecting every third game or so, but then I'm Australian) make this a less-than stellar enhancement.   On the plus side, it's free, and it's a great advertisement for the wonderful core game. Sadly Arena is just not spectacular by itself",
            "review_score": "-1"
        },
        {
            "review_text": "A very great and fun game. But for some weird reason since Xmas 2015 it seems to be dead unfortunately. Almost no servers and nobody joins your own hosted server any more.",
            "review_score": "1"
        },
        {
            "review_text": "You can kill 2 friends using 1 stone (boulder)",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS SPAAAAARRRRRRTTTTTTTTTTTAAAAAAAAAAAAAAAAAAAA",
            "review_score": "1"
        },
        {
            "review_text": "Poor port No multiplayer Doesn't support VR Has racial slurs Is generally offensive to my ancestors 2/20",
            "review_score": "-1"
        },
        {
            "review_text": "impossible to play with friends",
            "review_score": "-1"
        },
        {
            "review_text": "Game looks great. BUT, it's currently impossible to join a game without being disconnected after a few seconds. Can't see why this game was released in this state  Online multiplayer is 100% unplayable. I think it would be best to remove the game from Steam or change development status to Beta, while these issues are fixed. On the plus side, local multiplayer should work fine.",
            "review_score": "-1"
        },
        {
            "review_text": "The main game is amazing, but this broken and ♥♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "It seriously needs a better tutorial. The tutorial expects you to 'know' how to do things like interact with objects without really telling you anything. I could not figure out how to end the tutorial, for instance. It also gives no instructions on various modes or how to fight. Just... click and hope.  I understand the minimalist style of the tutorial, but that's no excuse for a tutorial so useless that the game might as well not have it.  As for the actual game, it could be fun if they explained out to play it.  Great art style though.",
            "review_score": "-1"
        },
        {
            "review_text": "The problem with this game is that online doesnt work so well. I have joined serveral servers and after a short amount of time when the server gets full it will eventually crash / disconnection error. I have also hosted my own servers serveral times but the same errors happens when my server is starting to get full. I get a disconnection error and I am returned to the main menu. It happens to other online players too. There is also some lag despise playing at servers hosted in my own country. When these problems are fixed then I will give this game a positive thumb up.",
            "review_score": "-1"
        },
        {
            "review_text": "Disconnection simulator 2015",
            "review_score": "-1"
        },
        {
            "review_text": "good artstyle and good gameplay id would be better with a campain because this gae has lots of potential",
            "review_score": "1"
        },
        {
            "review_text": "10/10 This game is: If my greek plate replicas at home would move",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Gets better when more people join.",
            "review_score": "1"
        },
        {
            "review_text": "ok i see the complaints about the tutorial but i did the tutorial twice and then it was... different!?!??!?! great game great art chivalry style combat and really intense gameplay. they do need to fix the tutorial though. also it can get very laggy in full ELM",
            "review_score": "1"
        },
        {
            "review_text": "10/10 This game is very S2W Not ♥♥♥♥ to win, Stone to win. Not like get stoned, I mean like throw a stone. A big stone. That instakills.",
            "review_score": "1"
        },
        {
            "review_text": "awsome!",
            "review_score": "1"
        },
        {
            "review_text": "Not my type",
            "review_score": "-1"
        },
        {
            "review_text": "cool ",
            "review_score": "1"
        },
        {
            "review_text": "I couldnt play in any server",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing platform fighting game 11/10.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game that lacks the playerbase to be played at all.",
            "review_score": "1"
        },
        {
            "review_text": "Fun rp SANDBOX game free :) and makes a free and fun server.",
            "review_score": "1"
        },
        {
            "review_text": "really fun and addicting combat. I want more pvp games like this.",
            "review_score": "1"
        },
        {
            "review_text": "Kept putting me in servers that weren't the one I was clicking (I was trying to join a friend's server) Plus, the most laggy cursor I have EVER seen. Considering it's a game where the mouse matters, this is ridiculous; I've never seen anything like it. Gave up and uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "Super fun with friends :D",
            "review_score": "1"
        },
        {
            "review_text": "Tho i may die alot i love this game. the music the game play the grathic's you look like a real painting. I recommend this game to anyone and everyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the definition of a casual time killer. Very fluid combat system, an immersive art style and theme and a very cutthroat, split second combat engine that means precision and timing are all important, yet still forgiving in the correct scenarios for a duel or a scrap to take place As a free game with little to no business model (aside from making you immediately want to buy the single player game, which i can also heavily recommend) there is no reason for you not to give this a shot and keep the servers full and fun",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Very satisfying to kill people, and get the simulation of being a painting on a 4th century Greek pottery. And its free!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun! but only when I am in town with my laptop. I dont have very good internet and I would enjoy a singleplayer arena mode to this. I think its funny how most of these free games are online, and not a singleplayer game. Isnt it harder to make a multiplayer server for a game? Im not too sure how it works, but this is my interperatation.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game simply amazing only issue I have with this game is there is literally only 2 servers which are Russian only servers for some reason it is a hacked server do not join them as they will boot you for no reason and there is plug-ins at work to damage you when you are not moving and there are hackers on there killing you in one hit even when they are not presently fighting you.  So all in all Amazing game with great mechanics but if your going to play this play with some friends start a lobby for friends only not randoms.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game if you are waiting for your friends to come online or if they are away. its also great with a party!  Also i like the spears a lot. its really fun when you hit someone!       ",
            "review_score": "1"
        },
        {
            "review_text": "yes it gusd",
            "review_score": "1"
        }
    ]
}