{
    "app_id": 418150,
    "name": "The Madness of Little Emma",
    "release_date": "2015-12-21",
    "developer": [
        "Bartosz Bojarowski"
    ],
    "publisher": [
        "Bartosz Bojarowski"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Platformer"
    ],
    "achievements": 121,
    "positive_ratings": 107,
    "negative_ratings": 24,
    "price": 5.99,
    "description": "The Madness of Little Emma is a difficult action platformer with roguelike elements. Featuring over 250 items with insane synergies, varied enemies, and numerous secrets and mysteries to discover.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/418150/header.jpg?t=1478114258",
    "minimum_requirements": "OS: XP Processor: 2.5 GHz Memory: 2 GB RAM Graphics: OpenGL Support, recommended dedicated graphics card Storage: 550 MB available space Additional Notes: installed JAVA (1.6 or higher) Microsoft Xbox 360 Controller or Direct Input compatible controller",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Take the theme and collectibles of Binding of Isaac, mix it with the 2d platformer aspect of Spelunky or Rogue Legacy; and you’ve pretty much got The Madness of Little Emma.  It’s difficult – some rooms and bosses can get downright bullet-hell-esque with the amount of fire they’re throwing at you, and even some fairly early enemies can be extremely vicious – especially ones that make quick leaps at you, potentally trapping you in a corner.  The items you pick up tend towards passive bonuses, allowing for vicious stacking combos (if you get lucky, anyway – there’s plenty of dud items, although I have yet to find anything actively negative like accidentally picking up Soy Milk or Cursed Eye in Isaac.)  The music is good, and the pixel graphics work pretty well.  Importantly, as of this writing (September 29th), the game is 80% off – a mere $1.79. At that price, I’d say that it’s a great pickup for anyone who enjoys rogue-like/light/platformers/any of the games that I mentioned in my first sentence.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR - Despite some of its flaws, low budget, and how heavy-handedly it draws from its obvious inspirations, Emma is a competently made game with enough fun and unique ideas to make it a worthy addition to the rogue-like-like genre.  As someone with over 1000 hours in the Binding of Isaac games, I've been curious to try the Madness of Little Emma for awhile now, since Isaac appears to be its most obvious influence.  I'm writing this review of my initial impressions of the game after only having played a few runs, with my latest being a fairly decent one (I made it to 'Misery' and managed to clear some sort of Love-themed optional dungeon). I'm not sure how close to the end I made it, but I feel I experienced enough of the game to give me a good idea of what kind of experiences I can expect from it.  While the game draws heavily from its Isaac inspiration, the most obvious difference is its side-on perspective and the inclusion of some basic platforming elements. If Isaac is a variation on Zelda-type dungeon crawling, Emma is a variation on Metroid. The movement feels good - due to the game's focus on bullet-hell type enemies (more so than Isaac even), the ability to jump, dodge, and weave between enemy bullets is crucial, and game controls quite well in that regard. While I normally prefer to play platformers with a controller (and the game does kind of support it, but not very well), mouse and keyboard seems to make the most sense for this game.  The art style is quite dark, and lacks the silly gross-out humor found in the Binding of Isaac. Most of the early enemies are just some gnarly insects, but some of the later enemies are downright Lovecraftian masses of eyeballs, slime and sinew. Though there is some humor in the game, most of it seems pretty straight-faced and grim, and the music, which is mostly subdued and atmospheric, adds to that aesthetic.   The spirit of the gameplay is very much like Isaac. Players play as Emma or one of several unlockable characters and traverse procedurally-generated dungeon maps. Maps are randomly populated with a series of rooms - upon entering a room, the doors lock behind you until all the enemies have been cleared. Also like in Isaac, death is permanent, and each run starts you over from scratch aside from any unlockables you managed to get from your previous run. The enemies themselves seem quite varied in both appearance and attack abilities. Some fire bullets in a wide range of patterns and effects, some chase you down in varying ways (through walls, divebombing from the sky, teleporting across the room, etc), some spawn other enemies, some fire beams, and some are, frankly, just hard to describe - I'm actually tempted to say there might even be more individual enemy variety in this game than in Isaac. In addition to enemies, some rooms have chests of varying quality (brown, gray, gold, and red in rare cases) some of which require a bomb to open. The are also spike traps, and bombable walls, secret rooms, and occasionally colored herbs which grant the player stat buffs (or debuffs) when consumed, sort of like pills in Isaac. Each floor contains one treasure room which randomly draws from a large pool of stat/ability altering items (over 250), one boss room, and sometimes one or more 'special rooms' like a sacrifice room (sacrificing health/consumables for herbs [maybe items?]), Arenas (fighting off waves of enemies for loot), Shops (which contain herbs, chests, and a creepy hooded skeleton man who doesn't understand the meaning of 'personal space'), and what I call 'Hanging Rooms' which feature a girl hanging by a noose who drops an item when you shoot her.   Of the items I've found so far, some seem familiar, and some unique. In my last run I found an item which caused friendly ghosts to spawn around me and chase down enemies (like blue flies in Isaac), a helpful robot friend that orbited my body and shot down enemy projectiles with a laser, an item which made my 'tears' larger and stronger when I stood still, and an item that made me fart enemy-stunning perfume. It's not yet clear to me whether or not Emma features the same level of item synergy found in Isaac, though I would assume it does to some degree or another.  Combat is only superficially similar to that in Isaac. While Emma also fires white tear-like projectiles (or maybe it's spit?), the high movement speed, ability to jump, and the 360 degree aiming makes for a much faster and potentially more hectic experience than in Isaac. After the first few floors, the bullet hell aspects of this game seriously ramp up - whereas Isaac is more focused on predicting enemy shots and carefully placing yourself between them, Emma seems to require more twitch reflexes and simply running the ♥♥♥♥ away from situations when they get too hairy. The later levels can become seriously overwhelming in that regard, so much so that I find it difficult to imagine that player should be expected to be able to dodge all of the shots instead of simply taking it on the chin and using your (generous) invincibility frames to better position yourself around some cover. On the one hand, this seems somewhat reasonable despite the game being fairly withholding when it comes to health and especially health upgrades, on the other, one of the things I love so much about Isaac is the predictability of enemy attacks and being able to avoid damage simply by being smart.   Bosses are also a big part of the game, and so far I've only found a couple that remind of those from Isaac. One was a segmented snake monster that bounced around the room, the other was a big face that split into multiple smaller faces when enough damage had been dealt to it. So far, other than those two, I haven't seen any others which immediately reminded me of Isaac bosses. That said, I can't say I found most of the bosses I fought to be particularly fun or compelling. One was a giant fly that lazily glided around the room occasionally popping out two smaller flies that would each fire a single projectile (and small flies dropped hearts, which seemed unnecessary given how easy the fight was). In the optional Love-themed dungeon I stumbled across, the boss was a large heart that bounced around the room spewing out bullets in an octagonal pattern, which would split into more large bullet-spewing hearts as it got damaged, repeating this process until 8 or so of these large hearts had been defeated. Of the bosses I encountered, my favorite was called Entozoon, who looked like a giant demented Pez dispenser and flew off-and-on the screen spewing bullets and carpet-bombing the room, requiring some interesting dodging to avoid being hit. While admittedly I haven't even seen half of the bosses in the game yet, I'm a little disappointed in the boss rooms, which so far have been empty rectangular rooms that don't seem to take advantage of one of the game's main mechanics - the platforming. You're mostly just running back and forth across the floor dodging projectiles and hopping over the bosses when they get too close. There's no verticality to fights from what I've seen (though, again, it's possible I just didn't get to see those fights). On the later levels the game somewhat manages to remedy this by spawning bosses in the normal rooms which makes more a much interesting fight. I just wish platforming had been more of a consideration for those early boss fights to keep them from feeling so dull.  Overall, aside from my complaint about boss fights, and a few bugs I noticed during the screen transitions, I quite enjoyed my time with this game. Emma manages to wear its inspiration on its sleeve without being overshadowed by it and has its own unique brand of fun charm. Fans of the Binding of Isaac, Rogue Legacy, or even Terraria will probably find more than a little to love here.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Binding of Isaac but a platformer, fun, and actually difficult. Play it, it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "I greatly recommend The Madness of Little Emma for anyone who likes rogue-lites and challenging games with tons of replayability.   I really like this game. Although heavily inspired, it manages to be unique and inventive. After playing a lot of Rebirth and getting a bit bored with it, I found The Madness of Little Emma to soothe the craving while not being just more of the same.  Definitely worth the price, too. There is a surprising amount of content and a great deal of replay value. It always feels exciting to figure out what an item does, to finally kill a boss or to find yet another secret. Also, I love the music.  Not sure if I like the game visually but that's not what I'm here for. There are so many good things about this game that it would be silly to judge it just by it's looks, which aren't too bad anyways.",
            "review_score": "1"
        },
        {
            "review_text": "The Madness of Little Emma is a good game, however it'll take you a while to actualy start getting somewhere.    The Madness of Little Emma is a game inspired by Binding of Isaac, and takes a different approach on it by making it into a sidescrolling game (is sidescrolling the right word here? I'm not sure myself, so please let me know if it isn't!)   now, as always, let's start with the good stuff:  + the story, while it has a few similarities to BoI (which is prefer to call nod, because there's only 2 noticeable one and they're minor details), is very unique and intriguing, however, I cannot say anything about the ending as I have yet to reach them.  + the game is easy to grasp, you shoot at enemies with left click to kill them, and you place bombs with right click to break walls and other objects (or just blow up enemies), however, being able to effectively doge enemies and survive for more than 3 floors is where the game starts becomming difficult, so if you've never played a game like this before, you'll suck for quite a while.  + the music isn't anything special IMO, but it works really well with the grim tone the game has.    while this is all great, I have a few issues with this game:  - such a game should have some sort of wiki, which it does not. However, the game is less than a month old and the community is pretty small, so I can understand it not having a wiki yet.  - the game becomes repetitive really quickly, becasue of the small collection of items and the fact that there's only one character, and for a game that can take a while to get good at, that is not a good thing    all in all, the game is fun, but I'd say that the game currently costs a bit too much for what it has as of right now.  Final rating: 6/10",
            "review_score": "1"
        },
        {
            "review_text": "'The Madness of Little Emma'.  Platformówka wyraźnie inspirowana grą 'The Binding of Isaac'. Sposób rozgrywki nawiązuje do starożytnych gier platformowych z Atari czy Commodore, gdzie kiedy twoja postać umierała, to zabierała ze sobą do grobu wszystkie zdobyte umiejętności czy znajdźki i trzeba wtedy zaczynać grę od nowa, do czasu aż nie nauczy się przetrwać w tym danym świecie. Współcześnie, najbardziej podobna gra to wymieniony wyżej 'Binding of Isaac', gdzie nasza postać stara się przetrwać w labiryncie korzystając ze zręczności gracza, a także używając porozrzucanych w labiryncie przedmiotów dających rózne  modyfikacje do statystyk gracza. Których w 'Emmie' jest trzeba przyznać sporo, grałem już kilka godzin a znalazłem może z 20% dostępnych przedmiotów. Niektóre z nich pomysłowo zmieniają sposób rozgrywki, np. po znalezieniu krzyża możemy strzelać tylko pionowo lub poziomo, ale za to zadajemy sporo większe obrażenia. Na Emme w każdej planszy czekają potwory, robaki czy kolce które chcą ją uśmiercić, a im głębiej w  lochach tym potwory są trudniejsze, sprytniejsze i wymagają większej zręczności aby się z nimi uporać.  Podsumowując: jak lubisz platformówki, podobał Ci się Isaac, gra 'The Madness of Little Emma' powinna dostarczyć Ci wiele godzin rozrywki. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure I have a few hundred casual hours left out of this game for the few bucks I payed for it, and while I'm not sure I've ever come close to beating it yet, I love it. It's like a platformer version of Binding of Isaac, which is awesome and unique enough to stand up on it's own. It's also a lot more challenging too. Definitely worth it if you like roguelikes at all.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Binding of Isaac except as a platformer and you pretty much have this game. Unfortunately some aspects of a game don't work nearly as well in platformer form as it does Legend of Zelda style and it clearly shows in this game. There's some original ideas. It's more horrorcentric and if you want a roguelike that is a bit more dependent on skill rather than memorization, this will fit the bill, but expect a much greater difficulty than in Isaac.  Unfortunately that difficulty increase doesn't feel intentional. Spikes that seem to be meant to push up if you stand on them too long, damaging you, seem to switch to the 'stab' state too quickly to really utilize this as a mechanic and you can easily get treasure screwed early on because of their placement. Similarly, many of the items you can get are useless or actively detrimental to your gameplay. Once I got flight and was like 'woo flight'--in Binding of Isaac this was one of the best items you could get but in this one it's actually awful and many of the traits you can get are like this. 'Great in Isaac, awful in a platformer'. While there were subpar items in Isaac, you could often make use of all of them in certain situations but some of the items in this game are legitimately just pointless to have around or only really detrimental to your play (like the flight option that has such a slow leadup time you're likely going to get hit). If you didnt' have to hold down spacebar to stay afloat it might have been a much more useful item.  Beating the first chapter wasn't that hard but once I got to story 2 I couldn't progress much further as a cheap enemy comp would generally destroy me.   Similarly the pacing is a lot slower. You can't just rush a backtrack like you can in Isaac.   In short the difficulty spike is too much and frankly the difficulty spike rarely seemed fair. The bosses seem to be well designed but the rooms themselves hardly and the story from what I've seen--hardly original or curious.",
            "review_score": "-1"
        }
    ]
}