{
    "app_id": 418190,
    "name": "Helen's Mysterious Castle",
    "release_date": "2016-03-18",
    "developer": [
        "Satsu"
    ],
    "publisher": [
        "AGM PLAYISM"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Casual"
    ],
    "achievements": 0,
    "positive_ratings": 513,
    "negative_ratings": 31,
    "price": 1.59,
    "description": "A young girl with a hidden past sets off on an epic and mysterious journey in hope of learning more about her own origins in this beautifully rendered, classic-style RPG adventure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/418190/header.jpg?t=1554707102",
    "minimum_requirements": "OS: Windows 2000 / XP / Vista / 7 / 8",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I first came across HMC a couple of years ago, and I'm so happy that it made its way to Steam.  You are Helen, a girl of indeterminate age who can't speak or read...and that's kind of it! The story reveals itself as you make your way through the titular mysterious castle, and while an RPG that drops you right into gameplay without a cutscene or whatnot can be disorienting, it does allow you to get right into the battles, which is where HMC really shines.  I'm a fan of JRPGs that: a) require more than mashing A to win b) have defending be a viable strategy c) have grinding/buying a ton of healing items not be the solution to everything ...and HMC meets all three criteria. Battles are duels - you (Helen) v. a monster. As you explore, you can find a massive array of weapons, with each weapon having three stats - Effect (how much damage the weapon does), Defense (how much of your opponent's damage the weapon can negate), and Wait (how long it takes to use the weapon). Each enemy also has its own set of attacks, which makes battles a kind of back-and-forth dance: the monster is getting ready for a big attack! Do you put up a shield to block it? Or use your longsword to both attack and block some of the damage? Or spam a ton of quick, weak attacks so that you beat them first? Or charge up your healing spell so that it comes out right after the attack connects?  Another thing that makes HMC unique is that Helen herself never levels up: you still earn experience points after battle, but they're instead used as a kind of currency to level up your weapons, to increase Effect &amp; Defense and/or decrease Wait. The only way Helen can get stronger is through HP upgrades, which are found through exploring - these optional upgrades, as well as the veritable arsenal of weapons you can find, gives the game a great amount of replay value.   The story is genuinely funny at times, although ultimately it's not much to write home about. The game itself isn't particularly long, too - it can easy be finished in an afternoon. Regardless, Helen's Mysterious Castle is a delightful little JRPG, and two dollars is a steal for a game this fun. Buy it whydontcha",
            "review_score": "1"
        },
        {
            "review_text": "If I listed off the flaws, you could get the impression that this is someone's first poorly done RPGMaker game, and it may as well be (except the poorly-done part.) There is a visible increase in the design skill as you progress.  Audio is acceptable. Visuals I believe are mostly the included RPGMaker tilesets and sprites. Story is weak, but gets better. The menus are overly basic, I'm not sure you can load a save without restarting, or change audio volumes. Lastly, one puzzle involved an element I never knew the game had, thankfully at least there are online playthroughs if you're stuck.  The combat is the main strong point and interesting enough to last for the duration of the game. The only skill needed is basic math, the game has no resource management except spending EXP to upgrade items. Had the game been longer, there was plenty of room for the combat system to grow as to not get tiring.  Overall, is satisfactory. For the asking price, got more than my money's worth out of it.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool strategic mechanics, although they often come down to 'guard until you can squeeze in an attack.'  A nice spin on JRPGs.  EDIT 6/13: I'd like to add, now that I've finished the game in full, the challenge amps up in fun and engaging ways throughout, and the story is surprisingly satisfying.   The title's reliance on stock sprites becomes really apparent right at the end, but it doesn't really detract from the experience.   As the game goes on, it throws new and interesting types of challenges at you, and you will have to constantly change up your strategies, especially in the bonus dungeon. I strongly recommend for anyone looking for a unique type of RPG challenge.",
            "review_score": "1"
        },
        {
            "review_text": "This game gives a nice twist to what can be a repetitive combat system in most RPGs, and what I most appreciate about it is that it's very intuitive and easy to pick up and understand. I'll give a brief overview here, but if you simply experience the game it won't take long for you to grasp it. Your attacks have 3 main stats - attack power, defense power, and cast time. As you progress you will have as many as 8 attacks to choose from in any given situation and have to predict what actions the enemy will take as you select your moves. If you play too defensively, they might use an attack that ignores all defense power, making you waste time you could be attacking and still get damaged in the process. If you play too aggressively with low defense they'll outspeed you and hit you while you're vulnerable. It makes even simple enemies potentially dangerous since each attack and strategy has pros and cons to it and you'll have to adapt for each enemy. For this reason, this is the kind of RPG where you are likely to die, as a new enemy you don't know how to handle can outmaneuver you. However, 'Death,' is lightly punished (it's actually beneficial if it's at the right part of the game as you'll get an HP boost) as you'll respawn in a bed without losing any XP you gained before, 'Dying.' If you do get stuck for a while, a bit of grinding to boost up your equipment, and adjusting your approach will likely see you through quick enough.  Grinding in this game is different than in others as you use experience points like currency to upgrade the power of your weapons. Some are inherently weaker and improve very little, even when maxed out, whereas others increase by larger amounts, and are a better investment for your experience. I do wish they were a bit more balanced in that regard, but it works, especially as there is a decent inventory of equipment for the scope of the game.  I suppose the game does live up to its title, as there are plenty of secrets in the game, requiring the player to inspect and navigate the areas carefully in order to get much needed equipment to progress, as well as get to the next section.  One thing that amuses me about the story of the game is how it keeps going on further than expected. There were two times in the game where I thought it was nearing the end, but that turned out to be a diversion as there was yet another area to go through. I've played plenty of RPGs in my day, yet they did surprise me with that, as it is hard to tell the exact length of an RPG maker game though the chest layout should have given me more of a hint there was still more to go. What further supports this point is that you don't get much exposition at the beginning and are merely tossed into the game world, which worked quite well here.  I did experience a glitch that crashed the game, which can hopefully be patched so it doesn't discourage people from finishing the game. Thankfully you can save at most anytime, and if you do so after every mini-boss, you shouldn't have any issues. I haven't yet finished the game, but I'd recommend it to anyone who likes having to think through RPG fights instead of mindlessly tapping the attack option until they get to a boss, as this battle mechanic is something I'd like seeing in a larger RPG title.",
            "review_score": "1"
        },
        {
            "review_text": "This is the indie equivalent of the classic SNES JRPG games. Shorter and with less story and depth, but supremely satisfying turn/wait based combat that is unique for every mob and boss. A lot of thought went into this game and it shows. There are more than 20 items (weapon/shield/magic/passive) including some 'uniques', but you can only carry 8 at a time, so your loadout makes a huge difference. Helen doesn't level up, but her items do, and she gains health in various ways as you progress.  There are also two? endings... I got the lame ending first because I couldn't figure out what she means by '!' and '?' (!=yes, ?=no). Reloaded my save and finished up with the real ending... loved it! There were a few other times I feel I might have missed out on some extra little tidbits. Make sure to read everything (once you can read), and talk to everyone (also the fairy when she is with you).",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest, I didn't expect much when I bought this game. Just another cheap little indie RPG to add to the collection. But this game surprised me more than any other game I've ever played on here. I loved exploring and getting little glimpses of the world that this game created, I loved the game's battle system, which put a unique spin on turn-based battling that I have never seen used quite so well. The music was fantastic, there were plenty of secrets to discover, and the ending... I don't want to spoil anything, but this game's ending is by far my favorite ending of any RPG. What a rush! Buy this game, and I promise you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Nice combat system -Variety of enemies -Inclusion of hidden rooms -Simple -Cheap -Gear-Based fighting -Nothing seems out of place Cons: -Difficult to find some hidden rooms  -Stuck at one point in game for some time due to a path being hidden that is needed to progress -Difficult to find Ardis late game Conclusion: BUY IT, ITS GREAT!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely not what I was expecting, but I can't say I'm at all displeased with the game. Perhaps I'm forgetting something, but I haven't seen anything quite like the battle system and the way you grow stronger is certainly a nice change.  Though I haven't gotten terribly far, I have beaten the first section and can honestly say it's already worth the (admittedly very low) price.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun RPG where there are no random misses or critical hits. Instead, each weapon has three stats and (in some cases) a special effect. The three stats are the time it takes to use the weapon, the defense bonus while the weapon is being used, and the damage dealt when the wait time finishes. Quick, flimsy attacks allow you to deal great damage when an enemy uses a low-defense weapon, and coordinating your wait times to use a heavy hitting weapon without getting hit are just two examples of how this battle system opens many unique encounters with new strategic opportunities. You do not level up in this game. Instead, XP is spent on weapons to upgrade them. You can only have eight weapons at a time, so choosing an effective loadout is important. Don't worry about losing weapons you drop on the floor to get more inventory space: A room reachable fairly early in the game allows you to regain your dropped weapons, and they will still be leveled up! The story is good at driving the action and motivating the player (especially toward the end of the game), but don't go into this game expecting it to be story-heavy, since the story is secondary to the battles. Sound effects and visuals are the standard RPG maker type, but the sprites manage to be especially detailed and well animated. Music is good and decently varied. I would give this game an 8/10. It's definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, and excellent value! Took me about 8 hours to finish, which is about the length of your average full $60 AAA games these days. Really goes to show you the sad state of the games industry.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap, simple and fun. Fairly short though but it's good.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great example of what RPGMaker is capable of - and should be used as a reference point for many amateur game makers!  *PROS* - Lots of secret areas/exploration - Engaging/fast-paced battle system - Lighthearted story  *CONS* - Lack of direction can make some areas a *little* confusing  For the price tag - just get it! It's worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable RPG game for a low, low price. It's a bit simplistic with only one character, but the unique battle system is very fun. Grinding is mainly optional.   The game started without any story and developed quickly partway into the game.  All in all, I loved the game and hope to see a sequel in the future. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "? - Helen/2016  A surprisingly good game for that price. The gameplay was interesting and pretty unique, the story was nice and simple and you can expect 5-6h of game time. If you have 2 bucks to spare, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty good game for 2 bucks.",
            "review_score": "1"
        }
    ]
}