{
    "app_id": 418120,
    "name": "Cally's Caves 3",
    "release_date": "2016-01-05",
    "developer": [
        "VDO Games"
    ],
    "publisher": [
        "VDO Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Indie",
        "Action",
        "Female Protagonist"
    ],
    "achievements": 64,
    "positive_ratings": 349,
    "negative_ratings": 77,
    "price": 5.99,
    "description": "Cally's parents have been abducted, as her arch-enemy Herbert has taken control of the Caves to perform his evil experiments. Join Cally and her friends in this action-packed run and gun platformer, conquering insane bosses, exploring to find secrets, and levelling up EVERYTHING.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/418120/header.jpg?t=1464804719",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core2Duo Memory: 1 GB RAM Graphics: integrated DirectX: Version 9.0 Storage: 250 MB available space Additional Notes: This game should play on pretty much anything!",
    "recommended_requirements": "OS: Windows 8/Windows 10 Processor: Core i7 Memory: 2 GB RAM Graphics: Nvidia GTX 560 (1gb) DirectX: Version 9.0 Storage: 250 MB available space Additional Notes: This game should play on pretty much anything!",
    "reviews": [
        {
            "review_text": "I wasn't expecting much, but I got surprised by it.  It's a really nice game, with nice graphics, sounds and story. We play as Cally in her attempt to rescue her parents after being kidnapped by a 'mad scientist' who doesn't make it easy for us to get our parents back. Lots of enemies lure in the way and lots and lots of rewards including weapon upgrades, new weapons and friends.  Pros. - Nice graphics - Nice music - Long, quite long - Weapons!!! - Achievements and Trading Cards - Full controller support  Cons. - Could be really easy to beat - Some minor bugs related to the achievement list  Overall 9.5/10. Worth every penny.    Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Cally's Caves 3 is one of those games I'm not really sure to recommend or not. Unfortunately, I have to go with 'no' in this case.  First the good: -Platforming controls are extremely tight. I never felt like I missed a jump because of the game. -The art style is very nice. It has a kind of cutesy-retro fell. The developer didn't go for a cash-in 'retro' faux 8-bit style, but still managed to capture an oldschool charm.  And the bad: -The difficulty is almost entirely of the 'nailed by an off-screen enemy' sort. -Weapons lack any kind of punch or impact. I was never really excited to get a new gun, because I just kind of assumed is would be as bland and uninteresting as the rest. I was usually right. -Many weapons rely on you slamming the fire button as fast as you can to be effective. This gets old quickly. -Level design often punishes exploration. Certain paths might lock you out of a large part of the level, but there is no indication they will do so. Choose the wrong path and miss all the tasty gems. -Level design is bland. They're around the size of a Mario 3 stage, but with none of the appeal. Just platforms with enemies on them. -There are quite a few weapons, but the only way to scroll through them is by pressing the 'change weapons' button. This will allow you switch through all your weapons, one at a time, in sequential order. If you accidentally go past your desired impliment of destruction, you're going through the list again. An odd design decision.  Despite the bad, I did have quite a bit of fun with Cally's Caves 3. But that fun was often punchuated by both minor and major annoyances. If you're really, really into platformers, then give it a try. For everyone else, I'll have to regretfully give this game a 'no'.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't remember where I got this game but it's awesome! I've been playing it today and well, everything is fantastic! What's ever better, there's an android version of it too! :) So that said here's why I like it.  PROS: It's a simple but effective platformer, it brings back old memories of similar games. It has a simple leveling system! (I love RPG aspects in games, no matter how simple). You gain exp from killing, you level up. You gain more health. Monsters get progressively harder, so my mindless run and gun tactic doesn't work so well :) You can also find other guns (you start with a handgun and a sword) later on you get a lot more guns! You can also LEVEL up the guns! Yes, the more you use a gun the more it levels up, morphs / changes and becomes stronger! Boss fights! - Woo, definitely has everything a platform game has to offer! Do I recommend this game!? HELL YES! Will I play it over and over!? HELL YES!  Cons: No multiplayer... Multiplayer would be fun, both local and over the internet :)",
            "review_score": "1"
        },
        {
            "review_text": "A very lightweight Run ‘n’ Gun platformer. The platforming isn’t particularly difficult, you start with Double Jump and then get Triple Jump very early on. The games controls are responsive and almost all the weapons are semi-automatic with no delay in-between shots. This gives a very satisfying 1:1 ratio of button mashes to shots fired.  All your weapons gain exp and level up. The exp is gained every time a weapon shot hits, rather than it being based on kills or pickups. This makes failed levels and boss attempts not feel like a waste of time as you retain the exp even if you die. The weapon leveling gives a nice feeling of constant progression throughout the game.  The game is very simple, you pretty much just jump and shoot things the entire time. Don’t expect a Metroidvania, the game is very linear with very few side areas and doesn’t have much in the way of secrets to find. I never really got the sense that I was exploring anything, mainly just collecting all the money and then looking for the exit to the next area. But this game is very fun for what it is, it’s great for when you don’t feel like thinking and just wanna hop around and blast things.  The game uses the Dpad rather than Left Stick for movement so be prepared to fix this with your favorite third party program such as xPadder.  -Playtime- 8-10 hours for first play through. New Game+ is substantially quicker because you retain your weapons and their levels which makes things much quicker even though it has tougher enemies.  -Achievements- Nothing fantastic here, mainly just getting all the collectables. Only 2-3 of which I would consider to actually be hidden, most are just found with a thorough exploration of each area. Finishing up the Max All Weapons achievement took less than an hour and didn’t feel too grindy. I did however use Turbo on my controller to speed this up quite a bit. The biggest grind was the 250 Deaths achievement, I only died maybe a dozen times playing though the whole game and New Game+. I ended up just going to a boss fight, setting up a macro and leaving for an hour to get this.  Recommended on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is honestly amazing.   It reminds me a lot of Cave Story-   It's got a great soundtrack, although the music sometimes stops playing to switch tracks, which is kind of annoying but otherwise fine  It's got an amazing weapon system that introduces a new mechanic of evolving your weapons, one in which I've never seen before.   I'd give this game a 8/10- It's got some bugs to fix but It's fairly new (6 days old at the time of writing this) So I'm gonna say it's only gonna get better from here.",
            "review_score": "1"
        },
        {
            "review_text": "A cute fun and addicting platformer. Also if you're playing without a controller like I am, this game with give you carpal tunnel. Better workout than fapping.",
            "review_score": "1"
        },
        {
            "review_text": "This is a mildly fun little time killer platformer. I'd recommend it on sale.   The progress and story seem a bit of a mess and uninteresting. Usually the character in the game explains powerups after the fact.  For example, you gain a new ability then must use it to finish the room. THEN, in the next room he explains to you what it does.  Like, thanks for letting me know I can do what I just had to do before you told me. Shut up and go away.  There is nothing special or standout-ish about the title but when I need to kill some time or keep my hands busy whole listening to something I don't  mind putting this game on. Very amature and game maker template feel to it,  but its not broken and the game play is mildly fun. I would not get it unless on sale for $1 or $2. Its def enjoyable. Just keep your expectations low.  (Devs, please don't take it personal. These are just my honest &amp; dumb opinions as one who has played hundreds of platformers since NES. I would still like to see what you make in the future.)",
            "review_score": "1"
        },
        {
            "review_text": "If rex rocket,cave story and kero blaster had a 16bit baby. The game is all sort of grindings, for coins, for xp, but its enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "A fundamentally broken game. I bought this game because the gameplay video made it look skill-based and action-packed with lots of bullets, dodging, parrying, etc. Unfortunately, the maps and damage sponginess of the enemies completely ruin that design.   Most enemies will stay on their vertical level without moving up or down. Almost every time, you'll be able to approach them, completely risk-free, from a higher or lower level and simply spam them down with your weapon of choice. The sword cause enemies to go into a full second and a half hitstun, so once you hit an enemy once, you just have to keep swinging the sword until they die. Either way you choose to unfairly dispatch the baddies, make sure to pack a lunch; it'll be a while.  Enemies have so much HP that these tactics don't feel 'pro' or even 'cheap' - it's just tedious. Spam from a distance or stunlock up close; either way you'll be sitting there with no risk for 5-10 seconds per enemy. And there are a lot of enemies, and a lot of stages.  I get that the enemies have so much HP so that when you get bigger, better weapons cutting through them like butter will feel great; but you're asking a lot out of your players, who have much better games sitting on their shelf they could have fun with immediately, without having to grind up weapons.  Speaking of weapons, the levelling is completely uninteresting. Weapons get more damage as you use them (very incrementally more) and occasionally 'evolve'. This sounds cool, and could be if the evolutions were meaningful or changed how you used the weapon. Alas, they're almost always 'fire extra bullet', 'bigger bullet', or 'more damage'. What's the point? Why not just balance the weapons around each other so that you choose weapons based off the level, the enemy, or your personal preference? When you really get down to it, who cares whether your shotgun does 1.00 damage per pellet or 1.05 damage? These are actual numbers from the game, I'm not even exaggerating for effect.  As for the other RPG mechanic, the money/shops, that's broken too. From the beginning one of the first things you can buy is a drop that lets you get more money; obviously this is the optimal thing to purchase, since you can see that later upgrades cost hundreds of thousands of gold, and enemies drop between 10-100 apiece. Unfortunately, maxing out the gold-dropping multiplier takes hundreds of thousands just by itself, which means that your first few hours of this game will be doing nothing but making it so that later you'll have enough gold. What's the point of cool upgrades if they're all so expensive I can't buy them without spending hours either farming gold for them, or farming gold for the gold-multiplier upgrade?  The writing, plot, characters, etc are all mediocre but that's to be expected, so no points off there.  All in all, a game that missed its potential by bad design. A lot of the pieces of a good game are here. Pretty decent art, sound, the controls are tight and feel right. Some of the fights I had, when the level didn't allow for cheesy tactics, were pretty challenging and fun. Just needed better playtesters.",
            "review_score": "-1"
        },
        {
            "review_text": "decent game i guess. its like a knock off cave story. would never buy it",
            "review_score": "1"
        },
        {
            "review_text": "Cally's Caves 3 is a very good, if frustratingly flawed indie platformer.",
            "review_score": "1"
        },
        {
            "review_text": "Disclaimer: I only played untill the third or the fourth level / segment into the house of carls level or whatever its called (the second zone).  But yea, onto the review: I heard somewhere that a game should captivate you within the first five minutes.. but it just didnt. I tried the game over several small play sessions and this time i just gave up on it.  Pros -Graphics -Controls  Cons -Music is repetitive -Boring level design -Boring enemies, they just walk back and forth, back and forth. -No immunity timer when getting hit (You can run into an enemy and die in one second by losing all your health. Bad design) -Overpowered weapons (really? You can just hit the enemies with the sword and they get stunned, so repeat that untill they die. Or level up your shotgun and blast your way through - oh wait you die if they run into you, so its better to just use the sword, unless you're standing on a platform where they can't hit you, but you can shoot them). -Grinding (you can barely buy any upgrades from the first store if you play it somewhat normally and take your time to collect stuff, so you have to grind points)  And that's my initial impression",
            "review_score": "-1"
        },
        {
            "review_text": "Good port of the mobile game. Controls feel a little sticky - maybe an engine limitation? Upgrading weapons feels very grindy. Lots of fun though, it's worth a play if you enjoy action platformers.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun Metroidvania and is scratching the4 exact itch I havefor the genre. I have two complaints : the dodge roll appears only usable when you are standing still, and so far there aren't a huge variety of enemies. Those are minor points however, and I've really enjoyed this game so far!",
            "review_score": "1"
        },
        {
            "review_text": "The only complaint i have about this game is that it takes too little skill to beat it and it's a little too simple.  There was some challenge but not much which made the game less exciting and fun.  If the developers could make this game to be more challenging, that would be great. Otherwise, it's actually a good game for it's price and lightly entertaining.  also this game has pretty nice music    7/10",
            "review_score": "1"
        },
        {
            "review_text": "If you'd asked me a week ago, I would have *raved* about this game, and given it eight thumbs up. Unfortunately, enough game play inside Cally's Caves 3 revealed what most gamers dread: bugs and game glitches. Enough glitches to be problematic and thoroughly ruin what could have been a stellar game. And the developer is nowhere to be found. He promised a year or so ago to resolve some of Cally's issues, yet seems to have completely abandoned the game. So what's left is an enjoyable platformer with overly frustrating issues such as weapon upgrade glitches and artifact collecting gone wrong. It's still pretty good, all things considered...but if you're after Steam achievements? Nearly impossible.",
            "review_score": "-1"
        }
    ]
}